{
    "author": "pinkcatsonacid",
    "created_utc": 1626466337.0,
    "distinguished": null,
    "edited": false,
    "id": "olp09b",
    "text_only": true,
    "flair_text": null,
    "name": "t3_olp09b",
    "num_comments": 906,
    "permalink": "/r/GMEJungle/comments/olp09b/i_dont_know_where_im_going_from_here_but_i/",
    "score": 3298,
    "selftext": "This was originally posted on the other sub and has been edited for the name. GMEJungle is my abandoned sub idea from before modship over there but I guess since I'm permanently banned, here I am. You asked, here's something. Please don't expect much from it. Idk wtf is happening.\n\n&#x200B;\n\n*Expanding on the words of Wes Christian*\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/ehwadb8ptmb71.png?width=750&format=png&auto=webp&s=2241fe09949563343286dffb3f00e52fcb94bd61\n\n*There used to be a link here to the AMA that inspired this*\n\n&#x200B;\n\n💎🙌\n\n&#x200B;\n\n***\"So, first I want to thank all the followers in this group. Which I understand is close to 300,000, so realize that each one of you are important to the cause, exposing this, getting this information out is critical. It's going to take all of us to make a change.\"- Wes Christian on S\\*\\*\\*\\*\\****\n\n&#x200B;\n\nhttps://preview.redd.it/xwtdv47otmb71.png?width=259&format=png&auto=webp&s=97f2cef41e4a565bac50d3dced8585969828e2a4\n\nDid you hear that, S\\*\\*\\*\\*\\*? How about you in the back, lurkers? ( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)\n\n&#x200B;\n\nYOU'RE NOT ONLY IMPORTANT, YOU ARE HELPING PRODUCE AND DISTRIBUTE CRITICAL INFORMATION TO THE PUBLIC!!\n\n&#x200B;\n\n***\"It takes a gargantuan effort, it takes people as strong as apes.\"- WC***\n\n&#x200B;\n\nApes are strong. Evolving. Adaptive. Resilient. And cunning. But they are stronger together.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/chbuqgrmtmb71.png?width=800&format=png&auto=webp&s=4365e14827e145ca3e0f3ad51f70ae5c7a9f762c\n\n&#x200B;\n\n***\"It takes a warrior. It takes somebody that's principled that never gives up.\"- WC***\n\n&#x200B;\n\nOn days when FUD is high and hope is low, every single ape has to realize that it will take the diligence and resilience of a warrior to win this battle. Leroy Jenkins is within us all.\n\n&#x200B;\n\nhttps://preview.redd.it/fs4ig9dltmb71.png?width=732&format=png&auto=webp&s=eb15ca905464972c437d0f2e0492c99dd8764775\n\n&#x200B;\n\n***\"It's up to each of us to make a decision. Do we want to be on the side of right or wrong?\"- WC***\n\n&#x200B;\n\nI think we all know which side the apes are on. And history will remember. For generations they have been robbing our families, stealing our ideas and our land and resources, negotiating our time and talents for pennies on the dollar, kept us in class and race wars to distract from the fact that... they've been stealing the world's wealth for a lot longer than Gamestop has been a company. And the game stops here.\n\n&#x200B;\n\nhttps://preview.redd.it/jdxc747jtmb71.png?width=620&format=png&auto=webp&s=c2fc251c5b563cb67639d74f40d6e88bf0328531\n\n***\"How do we want to spend the talents that God gave us?\"-WC***\n\n&#x200B;\n\nAre we going to let the FUD stop us from using our talents to grow, nurture, and thrive within this golden think tank that is **quickly becoming bigger, mightier, and more precious than the City of Athens?** Or are we going to put our wrinkles to work and create to share, to spread knowledge among our kingdom of apes, new and OG alike, and fortify these great walls we have built from the ashes of WSB and GME. To protect the culture and the inevitable philanthropy and hope that will come from these walls post-MOASS... we are a force to be reckoned with. What we are building together within the walls of this city will stand tall and proud, long after the squeeze has squoze.💖💪\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/0r3pmaaitmb71.png?width=300&format=png&auto=webp&s=69ea580b11d21377d701e68cb934ca601991db0c\n\n&#x200B;\n\n***\"Ultimately it's going to take massive amounts of people to want to be involved in this to expose it. We're gonna have to come together as a similar*** ***~~wolf~~*** ***ape pack to share education to educate ourselves and fight it. And to ultimately win the battle at least as was done in part with Gamestop.\"-WC***\n\n&#x200B;\n\nhttps://preview.redd.it/t82mdjehtmb71.png?width=760&format=png&auto=webp&s=46f3ac9844ecd28c5a755203635256f721ea499e\n\n&#x200B;\n\n# \"It's gonna take a massive effort by the investing public to RISE UP...\"-WC\n\n&#x200B;\n\nhttps://preview.redd.it/9x9152sgtmb71.png?width=1258&format=png&auto=webp&s=55ee73e7abde519a312652d17b7e0a6378d55ba6\n\n# \"This effort that this group of ladies and gentlemen are involved in is CRITICAL it's MISSION CRITICAL...\"-WC\n\n&#x200B;\n\nhttps://preview.redd.it/nila4xwftmb71.png?width=300&format=png&auto=webp&s=e2c4e1e9411243d86a0c00e3d1b603bbeab0b29b\n\n&#x200B;\n\n# \"Fakeness, or lies, deserve no place in this process.\"-WC\n\n&#x200B;\n\nGo with your gut. If someone tells you there's a price ceiling, and especially if it's in the (low) thousands, they are ***fucking*** ***liars***\\*\\*.\\*\\* You know who tells you that the price ceiling is anything below an absurrrrd amount of money?\n\n&#x200B;\n\n**People that are paid to tell you that. And to sell on the way up. Especially as anything but a limit order. It's confirmed FUD. Ignore, report, correct in the comments. Call out those shill motherFUDers. Remember, if it looks like a duck and quacks like a duck! 💎🙌🚀🚀🚀**\n\n&#x200B;\n\nhttps://preview.redd.it/tzcvis8ftmb71.png?width=300&format=png&auto=webp&s=6b6e4311635e91b6d2699a8a7380572c2088fd49\n\n***\"Dilution is a very important point- Dilution is an actionable form of damage model.\"-WC***\n\n&#x200B;\n\nhttps://preview.redd.it/ydu5m2cetmb71.png?width=638&format=png&auto=webp&s=5050fbcb8aa551abdcb24a3b7e66fb5f903dd462\n\n&#x200B;\n\nI.E. big lawyer speak for, if you own shares, and your ownership has been diluted (like can be proven by overvoting) because of naked short selling, then **THOSE DAMAGES GIVE SUFFICIENT REASON TO TAKE LEGAL ACTION!**\n\n&#x200B;\n\n🚨OMG WE CAN SUE THEM!!🚨\n\n&#x200B;\n\n# \"In the next 3-6 months you're going to see some major things happen on the legal side. We've been increasing our bench exponentially, we've put a big pot of money together, and we're gonna go after this in unprecedented way.\" -WC\n\n&#x200B;\n\nhttps://preview.redd.it/64k2xcidtmb71.png?width=800&format=png&auto=webp&s=ca3865152b9f496fe1bb14dbdf17f8e84d7fc6cd\n\n&#x200B;\n\n***\"What can change this? Doing what S\\*\\*\\*\\*\\*\\*\\* is doing, because it's going to take massive amounts of people to be involved to expose the bullies out there.\"-WC***\n\n&#x200B;\n\n**No matter what happens, dear apes, HODLing got us here. And HODLing will take us to the moon and beyond. Remember that by VOTING AND HODLing, we are the catalyst. The catalyst has literally been inside us the whole time. The DD is written and the rocket is set for trajectory. Buckle up 🚀🚀🚀**\n\n&#x200B;\n\nhttps://preview.redd.it/jne78qk7tmb71.png?width=1920&format=png&auto=webp&s=a7e44e87159f51d8f68e1035d1c449595cf78721\n\n**Stay strong and ever vigilant, my dudes. ✌**\n\n&#x200B;\n\n💎🙌🚀",
    "title": "I don't know where I'm going from here, but I promise it won't be boring...",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GMEJungle/comments/olp09b/i_dont_know_where_im_going_from_here_but_i/"
}