{
    "author": "pinkcatsonacid",
    "created_utc": 1626482967.0,
    "distinguished": null,
    "edited": 1626485797.0,
    "id": "olu21e",
    "text_only": true,
    "flair_text": null,
    "name": "t3_olu21e",
    "num_comments": 2797,
    "permalink": "/r/GMEJungle/comments/olu21e/overall_democratic_decisions_for_the_sub_please/",
    "score": 3701,
    "selftext": "# Welcome to the Jungle 🦍🤝💪\n\n&#x200B;\n\nhttps://preview.redd.it/d4aklnta7ob71.jpg?width=618&format=pjpg&auto=webp&s=c3098f90ac09e0307ba6fb5662438c1d68257a19\n\nAlright, housekeeping!!! Please use the numbers to make suggestions for me in the comments.\n\n&#x200B;\n\n1. **New rules are at the sidebar**. Please let me know if you have input and/or see anything missing there. No, this will not be anything but $GME til MOASS. We just like that stock.\n2. **I'm working on post flairs**. Very interested in how you want DD split up- for example DD- Technical Analysis.\n3. **User flairs**\\- I am also getting those set up, you may have noticed there are a few available. **PLEASE KEEP THEM CIVIL AND SOMEWHAT SFW**. Don't put anything hateful or we can't have nice things. **I'll manually change yours if they're offensive**. I'll probably ask what you want instead, unless you're being an absolute motherFUDer. I'm also probably going to change the fact that they are self editing eventually once I get plenty programmed, so get your limited-edition-whatever-the-fuck-you-want-flair now lol. But, give me some good ideas for standard available flairs please!\n4. **Mods**\\- I'm debating heirarchy (lackthereof) as I would ideally like mods to have as little platform as possible. I don't want to write daily posts and be a loud voice (anymore lol) I just want to serve you apes and keep a clean place according to the ideals we have clung to for this long through previous migrations. So PLEASE leave comment for this, and use the upvote feature to help me easily see what you agree with. **I'm also open to mod nominations\\*** in this thread and will rely heavily on the upvote/downvote system to let me know where the community agrees. Obviously this requires great trust, but I'm also not some fucking dictator and don't want to do this alone, I can't. Moderation is a shit ton of work but it's fulfilling when done right and a community thrives (thinks back to April and May :'))\n\n\\*Obviously this requires a lot of community trust. I want lots of input on not just who to pick, but how to pick them, and how they operate. And on that note, no SATORI is not here and will not be here for the foreseeable future. I am also going to have to rely heavily on moderation to combat FUD and clean the sub until we get some things like automod up and running.\n\n&#x200B;\n\nUse the Upvote/Downvote buttons to help me/us as we get our bearings here. This was seriously a sub I created before becoming mod of Superstonk and then abandoned. But it's here and welcome to all apes interested in $GME discussion. I'm depending heavily on these vote features to also weed out shills this first weekend. Y'all know FUD. Use your thumbs vigilantly please! The more you exercise that self moderation, the less power/responsibility/whatever I/we mods have.\n\nOn that note, I'll be brutally honest here guys and don't take it wrong. I don't want to police content and I don't want you to either. Let's just be cool. Everyone here knows the DD. FUD is practically powerless at this point, BUY and HODL are set in stone. I don't want to adopt old identities from the old place like Knights of New or anything. It's mostly because it's an old-sub thing. And the knights served.... *the queen*. So, fresh sub, fresh start? Everyone knows what content should and shouldn't be upvoted. Wrinkles have been formed. Apes are evolving.\n\n[evolution of ape, formation of wrinkles in medulla oblongata](https://preview.redd.it/sbscz5ob4ob71.png?width=1280&format=png&auto=webp&s=7d93cbac70c3961ab9360efdb2ea4f4634742cad)\n\n&#x200B;\n\nFinally, I want to assure you of something that would seem silly in any other context.\n\nBefore you read this: I have no delusions of grandeur regarding my place here. I don't want to be a celebrity or perpetuate this idea. I'm the groundskeeper willie to you beautiful apes. This is not a divine appointment for me anything, I am not deluded. I just won't lie to y'all, I know that's why you're here. 🤝\n\nI am a happily married woman in my 30s. I \"retired\" from corporate world in an Executive position to start my own business then (covid and such) I became a housewife with a family. This is a passion for me, but I have a stable family life irl and a healthy relationship with an (overly) supportive husband (who is not here let alone going to be anywhere near modship). I have purchased my own home in the past and have been largely independent and consistently employed (before marriage), and while I am no where near rich, I am comfortable enough and happy in my simple life. I HODL GME for many reasons like all of you. But I bought in on January 18 and I have only been averaging up since. Quite simply put: I cannot be bought out of my diamond hands.\n\n**Why am I telling you all this? This is TMI...**\n\nWell, you trust me to not do what just happened. Here's the transparency you were promised from the beginning. No I won't be sharing this again outside of this post, or harping on the past or whatever. But here's the truth so you know I'm here for the right reasons and **just want to mod a fucking sub.** (This will be treated as a work environment behind the scenes FYI to prevent certain issues happening again.)\n\n&#x200B;\n\nAnyway, I look forward to your input, I appreciate everyone who trusts the truth enough to be here, and I am excited to see how you run your sub. Cheers everyone. 🍻",
    "title": "Overall Democratic Decisions for the Sub- Please comment with your input!!",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GMEJungle/comments/olu21e/overall_democratic_decisions_for_the_sub_please/"
}