{
    "author": "ILikeChopin2",
    "created_utc": 1624690311.0,
    "distinguished": null,
    "edited": 1624717772.0,
    "id": "o85ojc",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_o85ojc",
    "num_comments": 115,
    "permalink": "/r/DDintoGME/comments/o85ojc/why_the_300_wall/",
    "score": 577,
    "selftext": "I'm a simple ape, and can do simple math. \n\nYou have seen u/criand [DD](https://www.reddit.com/r/Superstonk/comments/o7klxj/looks_like_the_recent_robinhood_class_action_si/)  that lays out that SHF are holding a 110M share bag.\n\nLet's do a simple math here. For them to cover 110M GME shares, that's $1.1B at $10/share, 11B at $100/sh, and $33B at $300/sh.\n\nGuess how much Citadel LLC have assets under management?  [$35B](https://en.wikipedia.org/wiki/Citadel_LLC). So somewhere slightly above $300/share, Citadel gets margin called and they go to zero even before they buy all the shares. \n\nCoincident? \n\nI think not.\n\nBut it makes sense now why they are fighting so hard. Using subterfuge, legally questionable tactics, media manipulation, pretending nothing is wrong, shills, and all of that. Because if they don't, they go to zero. They are a cornered wolf, and who knows how hard they will fight back. \n\nApes just have to hold.\n\n**edit1** \n\n* Other hedge funds are short GME too, but  the option trick to hide the short position only works if the SHF and MM are under the same roof. I thought Citadel was the only one, but I could be wrong. Even if they are others, they'd be all accounted for when tracking deep ITM options.\n* Margin call only requires that one's liability (short shares) exceed some agreed fraction of one's assets. It says nothing about the future price of the stock as it rises as one covers.",
    "title": "Why the $300 wall",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/DDintoGME/comments/o85ojc/why_the_300_wall/"
}