{
    "author": "taliskergunn",
    "created_utc": 1625621316.0,
    "distinguished": null,
    "edited": 1625713004.0,
    "id": "of8tvx",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_of8tvx",
    "num_comments": 241,
    "permalink": "/r/Superstonk/comments/of8tvx/how_much_volume_are_you_hiding_in_your_shorts_a/",
    "score": 3812,
    "selftext": " Hello everyone!   \nI'm that guy who has become obsessed with 1-minute candles and daily volume. This DD is late, but hopefully worth it. **TA:DR/Summary at end.**\n\nObligatory - I am not a financial advisor, this is not, and should not be taken as financial advice.\n\nMy DD is centred on asking why so many 1-minute candles of GME’s day contain more than 1% of that entire day’s volume, which **I will refer to as \"Significant Ticks\". On extremely high volume days, I will also be discussing \"Notable ticks\", with 0.5%+ of the daily volume** \\- for reference, each of the 390 minutes should contain an average of 0.256% of the daily volume, with maybe a couple of percent being traded in pre and after hours.\n\nI had originally planned on making a more speculative DD around a couple of theories and estimations on Gamestop’s volume over the last few months - but that’s not how we fucking do it around here.\n\nInstead, I was contacted by the absolute legend that is u/ChildishForLife \\- shoutout to him - who sent me records of every single minute of GME’s trading over the last 6 months and beyond. This includes outside usual market hours, so we are looking at a rather spicy 960 minutes per day, each with Open/Close/High/Low and volume statistics. So naturally, I decided to read through minute-by-minute for:\n\nThe week and a half leading up to and surrounding the January sneeze  \nThe week beginning the 22nd of February, which had some spicy price movement and big boi volume\n\nAnd the 5 days leading up to MAR10 day, that famous, famous day I’m sure most of you will remember.\n\n**I apologise, this DD is absolutely monstrous in terms of sheer length, volume if you will** **^(heh)**  \n**However, it's all pretty simple, feel free to skip all the tables as I've summed them up after each.**\n\nFirstly, I will talk through exactly what I saw minute-by-minute of these three events. I’ll give you this spoiler, even at its biggest your volume still looks weird and scares me a little, but now I might have a theory as to why. For veteran apes, this will give you a nice nostalgic walk down memory lane, and for new apes, this will let you imagine what it will be like when the actual squeeze begins.\n\n&#x200B;\n\n***Part 1: The January Sneeze***\n\nI began looking at the buildup to the sneeze from the 19th of January. The 19th and 20th of January were fairly comparable to how the stock has been for the last year - around 30-40 significant ticks in a day, that is 30-40% of it’s daily volume coming from only 30-40 out of the 390 minutes of the trading day.\n\nThe 19th and 20th of January were no different, and each started out their day with the opening minute representing over 2% of the daily volume.\n\nThen the 21st comes along. First tick = 0.516%\n\nThen the 22nd. First tick = 0.3%\n\nNow here, apes and apettes, is where it gets **Interesting.**\n\n**22nd of January**\n\nThis day is an important day - it’s the highest volume Gamestop has ever traded in a day - 197 Million shares, roughly 3 times the float at the time. But what if I told you that for the first hour and a half of trading, not a single minute held even close to 1% of that day’s volume? “Well when the fuck did those 197million shares happen then” you ask.   \nRemember, each minute should have around 0.256% of the day’s volume, so while many of these minutes do not hit the 1% target I usually look for, with a volume as massive as the 22nd, each of these minutes contains at least 900k-1million trades. On the day of writing (6th July), our entire volume for the day was a little over 2.6million.\n\nHere’s the timeline, Skip past it to the section in **bold after the 4th table for what it all means,** however I think the data is pretty interesting and spent far too many hours on just this one day of data to not include it.\n\n*Fuck this is a big table, I'll break it up into 4:*\n\n|Time|Volume (Millions)|Volume (percentage of day's total|\n|:-|:-|:-|\n|12:16| 1.32 |0.67|\n|12:17| 1.29  |0.65|\n|12:18-12:23|Each minute contained 750k-999k trades |0.44 average|\n|12:24| 1.49 |0.76|\n|12:25| 1.06|0.54|\n|12:26| 0.932|0.47|\n|12:27| 1.18 |0.6|\n|12:29| 1.18 |0.6|\n|12:30| 1.97 (first 1%) |1|\n|12:31| 1.67|0.85|\n|12:32| 1.5 |0.76|\n|12:33| 1.3 |0.66|\n|12:34| 1.2 |0.61|\n|12:35| 1.0|0.51|\n|12:36| 2.03 |1.03|\n|12:37| 1.17 |0.86|\n|12:38| 1.58 |0.80|\n|12:39| 1.76 |0.89|\n|12:40| 1.87 |0.95|\n|12:41| 1.70 |0.86|\n\n  \n12:42 only contained 23,000 volume as it was subjected to our first -   \nTRADING HALT  \nAnd thank fuck for it as well, it gives me a nice natural break point for the table. Oddly enough, this halt did NOT come as a result of the price moving too much in too short a period of time, honestly I'm not sure why it was halted, parhaps because the volume was so unusually high. \n\nThis would make sense when you see the next minute, 12:47. This minute contained more volume in a single minute than both the 29th and 30th of June had in the whole day.\n\n&#x200B;\n\n|Time|Volume (Millions)|Volume (percentage of day's total|\n|:-|:-|:-|\n|12:47| 2.56 |1.3|\n|12:48| 1.80 |0.9|\n|12:49| 1.56 |0.79|\n|12:50| 1.87 |0.95|\n\n&#x200B;\n\n12:51 - 8000  \nTRADING HALT #2  \nFuck me, another one? After just 5 minutes? Alright then\n\n&#x200B;\n\n|Time|Volume (Millions)|Volume (percentage of day's total|\n|:-|:-|:-|\n|12:56| 2.35 |1.19|\n|12:57| 2.23 |1.13|\n|12:58| 1.33 |0.68|\n|12:59| 1.48 |0.75|\n|13:00| 1.98 |1.01|\n|13:01| 1.22 |0.62|\n|13:02| 1.00 |0.51|\n\nTRADING HALT #3\n\nJeez, I'm starting to feel like this stock isn't normal, almost like it's being manipulated or something idk\n\n*Last table of the day*\n\n&#x200B;\n\n|Time|Volume (Millions)|Volume (percentage of day's total|\n|:-|:-|:-|\n|13:07| 1.06 |0.54|\n|13:08| 1.15 |0.58|\n|13:09| 1.18 |0.60|\n|13:10| 1.39 |0.71|\n|13:11| 1.51 |0.77|\n|13:12| 1.11 |0.56|\n|13:14| 1.2 |0.61|\n|13:15| 1.56|0.79|\n|13:16| 1.13|0.57|\n|13:17| 1.06 |0.54|\n|13:18| 1.22 |0.62|\n|13:19| 0.978 |0.5|\n|13:21| 1.48 |0.75|\n|13:22| 1.48 |0.75|\n|13:23| 0.970 |0.49|\n\n&#x200B;\n\nAnd thus the crazy run ends.\n\nLet's recap -   \n1 hour and 7 minutes. 3x 5-minute trading halts. A total of 51 minutes recorded into these tables with sufficiently high volume to make them worth talking about, 3 minutes with volumes too low to bother recording.\n\n**51 minutes.** A volume of 70.4 Million spread across them. 28% of the biggest volume day in GME's history, in **51 minutes.** More than the **entire float of GME traded between 12:16 and 13:23 - with 3 trading halts in 51 minutes. These 51 minutes contained the same amount of volume as June 15th - July 2nd.**\n\n**And on this 197 million volume for the day, the price of a share rose by $22.50.** In fairness, at the start of the day, the price was $42.59, so this was an increase of over 50%, but still.\n\n&#x200B;\n\nNow for the rest of the days in January, and the first couple in February. They were ironically less busy, despite having so much price movement, yet in many ways much, much more interesting - buckle up.\n\n***Into the week of the sneeze*** \n\n**25th of January**   \nOpen 96 Close 76 High 159 Low 61\n\nVolume - 178 Million - 1% = 1.78 Mil\n\nOur opening minute has a volume of...   \n82,633 ^(excuse me what the fuck)\n\nAnd then,   \n9:34 - 4.52Million - 2.56% of the day. So that's fucking weird, anyway 35+ notable minutes of very high volume\n\n&#x200B;\n\n**26th of January**   \nOpen 88 Close 148 High 150 Low 80 \n\nVolume - 179 Million - 1% = 1.79 Mil  \n Opening minute - 2 million (1.12%)\n\n25+ notable minutes \n\n*Now here's where it gets interesting again* \n\nIn the after-hours of the 26th, 10 million shares were traded between 16:00 and 16:52, a further 8 million were traded between 17:00 and 20:00,\n\n18 Million shares in after-hours, just over 10% of the day's volume. Now that's a signal if ever I've seen one that shit is kicking off.\n\n  \n**27th of January** \n\nOpen 354 Close 347 High 380 Low249\n\nOpen - $354, oh so that's what was kicking off, that's a bit higher than the $148 close  \nVolume - 93.4 Million - 1% = 934k  \n\n\n***Now let's look at the pre market on January 27th***\n\nThis has to be one of my favourite pictures of all time\n\n[Minute - Open - High - Low - Close - Volume](https://preview.redd.it/yzpda2d0co971.jpg?width=1242&format=pjpg&auto=webp&s=c789e217c3020e00e527df7070d438155128998f)\n\nYeah just your casual price spread of $185.47, no big deal, classic GME am I right?\n\nAt  9:44, we have a volume of 3.1 million - this is the **only tick of the day exceeding 1% of the day's volume. Maybe at $300+ it was getting difficult for them to play with millions of shares each minute?**\n\n  \n**28th of January**   \nOpen 265 Close 193 High 483 Low 112 \n\nVolume - 58.8 million - 1% = 588k \n\nFun fact - The price actually hit $508.83 in the pre-market at 7:24am  \nEven more fun fact - It did this on **barely any volume. I'm talking ticks in the thousands and low tens of thousands.**\n\nEven EVEN more fun fact - it took **a lot more volume to push the price down to the starting price of the day - we're talking ticks in the high tens of thousands, and low hundreds of thousands.**\n\nBut still, we open at 265, $243 lower than the pre-market peak.  \nOpening minute - 1.39 million, more than 2% of the day's volume\n\nNow, on **low volume for the middle of the day (around 50-300k) we climb back up to $483, the official peak of the day (and GME as a stock)**\n\n***Then it hits***  \nThe tidal wave of volume. 15 Significant ticks in 2 hours. **10 trading halts in 2 hours.**  50/120 minutes missed from trading halts. 12 million volume in attacks over 70 minutes of trading, more than 20% of the day's volume. **The result: a drop of $300.**\n\nNow a friendly reminder that 12 million volume is 5 times the volume we have had on each of the last 5 trading days (DD written on 6th July).\n\nOnce we hit the daily low at $112, the volume died out, presumably tapped out of cash for the day, the manipulation stopped and the stock was left to it's own devices. It slowly rose back to $193 to finish out the day on pretty low volume.\n\n&#x200B;\n\n**29th of January**  \nOpen 379 Close 325 High 414 Low 250   \nVolume -  50 million - 1% = 500k \n\nOpening minute - 1.2mil (2.4% of day), this pushes the price up to the daily high of 414  \nThen, in the first 10 minutes we had 2 significant ticks, each taking the price down by $30 and causing a trading halt   ^(remember guys this stock totally is not and never was manipulated) \n\nWe close out the first 10 minutes around $300, down $114 in ten minutes - ooft\n\nThen we have no significant ticks and the price steadily recovers until  \n13:34 - 400k shares drop the price $16\n\nNone for the rest of the day and we close out pretty high - this shit is weak and pathetic, just like the after hours volume \n\n  \n**THEN...**\n\n&#x200B;\n\n[The weekend came, that's kinda boring huh, can't believe weekends are now the not fun part of the week](https://preview.redd.it/qb4cnkjvjo971.jpg?width=225&format=pjpg&auto=webp&s=8f69a0d82c1a194061b3f9915baac83f2575e1f1)\n\nAND WE'RE BACK, AND IT'S FEBRUARY\n\nCAN'T WAIT TO SEE HOW MY FAVOURITE STOCK PERFORM-\n\n^(oh)\n\n^(oh no...)\n\n**1st of February**   \n Open 316 Close 225 High 322 Low 212 \n\nVolume - 37.4 million - 1% = 374k\n\n Opening minute - 1.01 (2.67%) - drops price $26, just shy of the $30 that halts trading ^(sneaky bastards)\n\nThen we have these 6 hilarious big candles between 10:23 and 10:35, which account for 10% of the whole day, they swing the price between $212 and $257, but after all the dick waving is done, the price only moved $2 (lol, nice 4 million shares fuckheads).\n\nThen the volume jumps off a cliff and the price slowly saunters down $20 over the rest of the day\n\n&#x200B;\n\n**2nd of February**  \nOpen 140 Close 90 High 158 Low 74 \n\nApologies in advance, but this one will hurt a bit. The price drops from 175 to 125 in the pre-market, but on extremely low volume. Unfortunately the only conclusion I can draw from this is paperhanders selling off thinking it was over - not to worry though, the damage had been done, and the diamond handed apes prevailed as we all know.\n\nAlso, shoutout to u/LongTimeGamer and his .00 price point stuff, this was the 3rd day in a row with a close ending .00 and even more,  from 26/1 to 02/02, out of the 4 measurements (Open Close High Low), each day had an average of 2/4 of these ending .00   \nFebruary 1st actually had a High, Low, and Close all ending .00, so yeah that guy was 100% right, and it's been fucked for months.\n\n  \n Volume - 78.2 million - 1% = 782k  \n\n\nOne thing was certain about this day, there was **a lot of fuckery afoot**\n\nThe opening minute had 1.44 million volume, nearly 2%  \nOut of the first 19 minutes, 6 exceeded 1%, and a further 8 got close  \nOh and the other 5 minutes were during a trading halt - so **every minute was important**  \nThe first 19 minutes of the day contained 9.3 million volume - 12% of the day   \n14 ticks - 12% of the day.\n\n And thus the price was absolutely butchered down below 100, never to rise again \n\nThe Squeeze was finishe-\n\n&#x200B;\n\n[ slàinte everybody](https://i.redd.it/1hh26o8rno971.gif)\n\n***Part 2 - Deep Fucking Value***\n\n**19th of February -** u/DeepFuckingValue **doubles down.**\n\nSurely that can't affect things too much, right?  \nThe stock is dead, it's at $40, right?\n\n**22nd of February, first trading day after 19th of February**   \n Open 46 Close 46 High 48 Low 42 \n\n Volume - 19.5mil - 1% = 195k   \n Opening minute - 12,000   \n9:34 - 929,466 - 4.77% of the day\n\nHey wait I've seen this one before...\n\n&#x200B;\n\n[The fuck?](https://preview.redd.it/hpbcknl9po971.png?width=460&format=png&auto=webp&s=fb85bd5e7e35af7a832de15842350e67d142f42f)\n\nThe same minute with super high volume? **Both on T+21 days? Last time this happened, a massive spike followed, that's definitely not going to happen again eh?**  \n\n\nAnyway, then we have 16 significant ticks in the day and nothing fucking happens, oh well.\n\n&#x200B;\n\n**23rd of February**  \nOpen 44.97 Close 44.97 High 46 Low 40\n\nVolume - 7.57million - 1% = 75k  \n Opening minute 273860 - 3.7% of day \n\n10 significant ticks in the next 25 minutes   \nAnd then the volume just fucking dies, like end of June levels of low volume here  \n\n\nOddly however,  \n\n16:32 after hours 91208 - 1.2% of daily volume  \n16:32-16:34 - 173607 volume, 2.3% in 3 after hours minutes   \nKinda weird - *That's definitely going to be the highest after hours volume we see right? (This is foreshadowing)*  \n\n\n**24th of February**    \n Open 44.70 Close 91.71 low 44.70 high 91.71 (yeah seriously, this day was practically just a straight line up to double the price.) \n\nVolume - 83.1million - 1% = 830k  \nOpening minute - 182k\n\nNo significant minutes until 15:18 - When the price hits $60 for the first time \n\n14 significant ticks for about 18% in the final half an hour before a trading halt, price goes up $30.  \nAnd we peacefully end the trading day at $91.71, on 43.5 million volume.   \n\"Wait, 43.5 Million? I thought you said 83.1 Million\"\n\n   \n**11.2 MILLION volume in first 30 mins after close (13.4% of day)**\n\n**12.2 MILLION volume in next 30 mins after close (14.7% of day)**\n\n**5.6 MILLION volume 17-17:30 (7.2%)**\n\n**3.3MILLION 17:31-18:00**\n\n**1.7MILLION 18:01-18:30**\n\n**2.1MILLION 18:31-19:00**\n\n**1.6MILLION 19:01-19:30**\n\n**1.9MILLION 19:31-20:00**  \n \n\n**36.3% of the daily volume came in the first hour and a half of after hours. The price moved from $90-$150** \n\n**39.6Million volume in after hours** \n\n**48% of the day. Fourty-Eight Percent.** \n\n&#x200B;\n\n**25th of February**   \nOpen 169 Close 108 High 184 Low 101 - opening $80 above the previous close due to that insane after hours\n\nVolume 150 million - 1% = 1.5mil\n\nHere again we see throughout the day the price rising on low volume, and going down on high volume, perhaps more obviously than any other day. Every single significant tick dropped the price this day, someone clearly was not happy about the after hours rise the day before.\n\n&#x200B;\n\n**26th of February** \n\nOpen 117 Close 101 High 143 Low 86 \n\nVolume - 92 million - 1% = 920k\n\nNo significant ticks, plenty of 0.6%-0.7%, but no massive spikes. I suspect they were tapped out after the 25th, in the end they managed to drop it $16, and didn't manage to finish the week below $100. \n\n**All of this fuckery, 40 million after hours trades in a day, and at the end of the week the price had** ***more than doubled.***\n\nI can't help but feel this is getting quite expensive.\n\n&#x200B;\n\n&#x200B;\n\nOur final intermission before we get to the last section, MAR10 day\n\nAt this point, I could see everything was fucked, but a theory was starting to form, and I needed to check the other big volatile spike before I could say I believed my theory, after all once is an accident, twice is a coincidence, thrice is **BLATANT FUCKING MARKET MANIPULATION.**\n\n&#x200B;\n\n***Part 3: Super Mari-oh fuck it's happening again***\n\n**4th of March**  \n Volume - 32.6 Million - 1% = 320k  \nAround 15 significant ticks\n\n  \n**5th of March**  \n Volume - 30.7 million - 1% = 300k    \nOnly 5 significant ticks\n\n  \n**8th of March**  \n Open 154 Close 194 High 211 Low 146\n\nVolume - 63.6 million - 1% = 630k  \nLow volume ticks, the price creeps up to $200 where he have our only significant tick of the day at 12:38 - 840k.\n\nVolume in after-hours is non-existant\n\n**9th of March**  \n Open 217 Close 246 High 249 Low 208   \n Volume 39.1 Million - 1% = 390k \n\n **About 100k volume in pre market managed to take the price from after hours close of 197 to open of 217, +$20 on 100k volume - remember how I spoke about how much effort it seemed to take to keep the price low, look at how easy it is to push it higher. Today (6th of July), a 73k candle only pushed the price down $1.13**\n\n***It is costing them more than it is costing us - and it costs nothing to HODL***\n\nThere are some more large-ish minutes until the price breaks $230, at which point they stop, and the price rises freely to $246\n\n**This is the 3rd time now where a certain price is hit, and all significant minutes stop. In all 3 occasions, these have preceeded a large spike in the price - I think you see where I'm going with this now**\n\n&#x200B;\n\n**MAR10 Day**  \n Open 269 Close 265 High 348 Low 172   \nVolume - 71.57M - 1% = 710k  \n   \nPre market - More low volume causing price surges, all the way up to high 290s. Volume picks up and pushes it back to opening 269.\n\nNot a single significant tick as price climbs up to high of 348.   \nFirst significant tick of the day 12:22 - 851k - drops price $30 and triggers trading halt   \n   \n12:28-12:30   \n3 significant ticks in a row, the last drops the price $50  \nTrading halt 2 \n\nSignificant tick at 12:36 causes drop of $15  \nTrading halt 3 \n\nTrading resumes at 12:41 having dropped a further $30 \n\n3 further halts occur before 13:00 \n\n6 halts between 12:22 and 13:00 - in this time, the price moves from $330 to $170 to $270.\n\n Almost All the day’s significant ticks occurred during this time. More large-ish ticks occur to drop price to $220, before volume dries up and we creep back to the $265 close.\n\n  \n**Every time trading resumed after a halt, it resumed at a .00 number.**\n\n&#x200B;\n\n&#x200B;\n\n**AND WE ARE DONE**\n\n**TA:DR, Summary, and Theories**   \nI just spent 4 hours alone just typing this up, please read the actual post or I'll cry  \nAnyway\n\n**Since as far back as I have checked, in 2020, GME has always had 20-40 1-minute ticks per day worth 1% of the total daily volume. Currently, we are experiencing around 18-20 per day. There have only been 3 times that I can see where these ticks disappeared, before the January sneeze, before the February DFV double down spike, and before MAR10 day.**\n\n**The significant ticks cut off abruptly in each case, generally when the price reaches a certain level. They then do not return until after the mini squeeze, and come back to hammer the price back down, at a MUCH GREATER COST than it took to get the price up to the high.**\n\n**It is my opinion that, in all 3 of these cases where the ticks stopped, the manipulators were either margin called, and thus had to stop until they gathered the funds for an all-out attack a couple of days later, or they had to cover their short positions around this time, which made them contribute to the upwards pressure of the stock. I expect it is likely a mix of both in all 3 occasions.**\n\n**\"That's great TaliskerGunn, but haven't you just wasted about 30 hours to find something out we kinda already knew?\", see that's what I thought too - but no.** \n\n**For each of these occasions, the large ticks stop abruptly, after they slowly go down into single figures the few days before. On all 3 occasions*****. I therefore think that, by continuing to monitor how many significant ticks we have each day from now on, if we see the number creeping down into single digits, and then cutting off entirely, it would be reasonable to assume that the manipulation is having to stop again, and that a spike in the price will follow. We may be able to have a few days notice of the rocket taking off in which to load up on any final supplies.***\n\n**I will be updating every day on how many ticks we had that day, and you can be fucking sure that I'll make a big deal out of it when we get into single figures.**\n\n&#x200B;\n\n&#x200B;\n\nWhat I hope this DD has done is changed perspective on how volume will affect the squeeze when it happens. Just having high volume is not what we want, as sometimes (almost all the time actually), **the periods of highest volume have been directly knocking the stock back down.** What we are looking for is **High volume relatively unopposed by the hedgies.** The 9th of March showed us what unopposed volume can do for us, 100k made the stock rise $20 - imagine what will happen when the hedgefunds are liquidated during the squeeze, or are forced to purchase back their shorts - all the volume that was pushing us down will now be pushing us up much, much faster. To repeat: **every mini squeeze we have had has been on the back of significant ticks of volume dropping off - they happen when the hedge funds stop manipulating the stock, and it's easier to see than we previously realised.**\n\n***If 100k volume in our favour can push us up $20, what do you think 100 Million volume in our favour will do? I guess we'll find out.***\n\nAlso, this is kind of a cool historical document now, hopefully you all enjoyed reliving the last 6 months as if you were glued to the ticker again.\n\nSee you on the moon  \n  *slàinte*",
    "title": "How much volume are you hiding in your shorts? A history of GME’s biggest events on a minute-by-minute scale",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/of8tvx/how_much_volume_are_you_hiding_in_your_shorts_a/"
}