{
    "author": "ammoprofit",
    "created_utc": 1625560382.0,
    "distinguished": null,
    "edited": 1625587599.0,
    "id": "oequz8",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oequz8",
    "num_comments": 51,
    "permalink": "/r/Superstonk/comments/oequz8/market_maker_liquidity_providers_maths/",
    "score": 958,
    "selftext": "Once again, I am [replying to a comment](https://www.reddit.com/r/Superstonk/comments/oeahh2/rcs_tweets_are_timed_with_etf_ftds/h47asll/) and have exceeded the 1500 character limit, so you get a DD.\n\n# TL|DR?\n\nHonestly, I'm not sure what to conclude from this, and until we can confirm the LP's criterias and obligations, we should be careful  arriving at any conclusions.\n\nAs near as I can tell, this changes the total shares owned, and introduces a new, mostly invisible, combination metric of LP Owed Shares and LP Strike Price, similar to derivatives.\n\nIf there's a timeframe obligation to repurchase, then it gets an Open Interest type metric, too. Otherwise, it's just Volume & Price.\n\nI tried to come up with a scenario where I could reasonably argue the SEC should make this information publicly available in a timely manner, but because of the legal and financial impact to the underlying asset's parent company, *LP privileges should be revoked entirely*.\n\nI might consider LP privileges (LPP) in a scenario where you have acquired the shares but are waiting on T+3 settlement, but I don't see why LPP is needed for that.\n\n&#x200B;\n\n# Edit #3\n\nThere's a [comment](https://www.reddit.com/r/Superstonk/comments/oequz8/market_maker_liquidity_providers_maths/h487fi1/) suggesting I am conflating Maker Taker with PFOF.  The discussion is ongoing.  I strive for accuracy, and I am awaiting feedback.  (Not sure I can tag the username without triggering the automod.)\n\nI expect Maker Taker and PFOF revenue to be roughly comparable.  Given my conclusion, I don't think it matters.  Once I have more information, I'll adjust the post accordingly.\n\n&#x200B;\n\n# Meat & Potatoes:\n\nToday we are looking at Liquidity Providers.  Liquidity Providers have bothered me since I first found out about them.  LPs have an exemption that allows them to sell shares of stock (equity) today, even shares that do not ~~exist~~ own, as long as certain criteria are met and they repurchase the shares later.\n\nThis is incredibly weird for a lot of reasons that mostly pertain to market manipulation and undercutting sellers.\n\nBut, primarily, this allows both good and malicious LPs to perform share offerings on behalf of companies **without filings or authority**.  We, the public, rely heavily on those filings to make informed decisions, and there is *no* insight into this behavior, it's volume, it's frequency, when it occurred, or anything else metric-ly substantial.  We are almost 100% in the dark, and the companies are largely in the dark, too.  (Arguably, they knew this raw deal when they entered the stock exchange, but holy fuck.  What a blind spot!)\n\n&#x200B;\n\n# Let's figure out what we know.\n\nA Market Maker will charge a fee per transaction.  That means they are primarily volume based.  This is important because MM are incentivized to have transactions flowing through their markets.  If there is no volume or liquidity, the MMs don't eat, and they're hungry.\n\n[Investopedia says](https://www.investopedia.com/articles/active-trading/042414/what-makertaker-fees-mean-you.asp), emphasis added, mine:\n\n>Makers typically are **high-frequency** trading firms, whose business models largely depend on specialized trading strategies designed to capture payments. Takers generally are either large investment firms looking to buy or sell big blocks of stocks or hedge funds making bets on short-term price moves.  \n>  \n>The maker-taker model runs counter to the traditional “customer priority” design, under which customer accounts are given order priority without having to pay exchange transaction fees. Under the customer priority model, exchanges charge market-makers fees for transactions and collect payment for order flow. Order flow payments are then funneled to brokerage firms to attract orders to a given exchange.  \n>  \n>The maker-taker plan harks back to 1997, when Island Electronic Communications Network creator, Joshua Levine, designed a pricing model to give providers an incentive to trade in markets with narrow spreads. Under this scenario, makers would receive a $0.002 per share rebate, and takers would pay a $0.003 per share fee, and the exchange would keep the difference. By the mid-2000s, rebate capture strategies had emerged as a staple of market incentive features, **with payments ranging from 20 to 30 cents for every 100 shares traded.**\n\nIn English?  We know ~~MM~~ Exchanges act as the middle person between a buyer and seller, and one party pays $0.30 and the other receives $0.20, and the ~~MM~~ Exchange gets the difference ($0.10) per 100 shares.\n\n(If your keen eye caught that the LPs act when there is a buyer without a seller, we cover that at the end.  For now, we are focusing on profits that exceed their normal revenue streams, assuming three parties.  Trust me.  You'll see why it doesn't matter in the slightest.)\n\n&#x200B;\n\nWe also know:\n\n1. A dollar today is worth more than a dollar tomorrow (yay! inflation!)\n2. Shares have Share Price\n3. Most stocks are sold in lots of 100 (like a pound of flour at the grocery store)\n4. If an LP sells a share for liquidity, it has to purchase it back when the share price drops below that sold price\n5. There are 365 days in a \\[non-leap\\] year\n\nYay.  Now we get some math.\n\n* Inflation per day = 3.5% / 365 = 0.009589% per day\n* Δt = Number of Days between when an LP sells the shares and when it buys them back\n* Let's assume the LP sold 100 shares and bought 100 shares later at the same price.  The difference is $0.00.\n\nThis gives us an equation of roughly...\n\n( # of Shares Sold / 100 ) \\* Share Price \\* Δt \\* 0.009589% > $0.10\n\n( # of Shares Sold / 100 ) \\* Share Price \\* Δt \\* 0.00009589 > $0.10\n\n( # of Shares Sold / 100 ) \\* Share Price \\* Δt > $1,042.86\n\n\\# of Shares Sold \\* Share Price \\* Δt > $104,286.16\n\n===================================================================\n\nEdit #4: I originally did the math for 10c per 100 shares sold for Market Makers, but I got the relationship wrong.  Because the LP can be either a buyer or seller, they can either pay 30c per 100 shares or receive 20c per 100 shares.  Oddly enough, it really doesn't change the math, and I'll highlight that point down below.  Keep reading.\n\n===================================================================\n\n&#x200B;\n\nOk, great, but how does this help us?  Turns out u/FreezYourMind cranked out the image below in this [great post](https://www.reddit.com/r/Superstonk/comments/o9l10s/gme_t21_as_it_becomes_clearer_it_seems_its_not/):\n\n&#x200B;\n\nhttps://preview.redd.it/2dk4pggvuj971.png?width=1872&format=png&auto=webp&s=b4d74b9b51bca0526e1b6a3832142c8fe13f02d5\n\nIf the LP is behaving according to the rules, every sale should generate a support now *and the same support later*.  (I still have trouble wrapping my head around explaining this part.  Apologies.  I haven't had my coffee yet.)\n\nThat image shows a series of resistances.  The last resistance was just under $200.  Let's use $200, because it's a nice round number.\n\n\\# of Shares Sold \\* Share Price \\* Δt > $104,286.16\n\n\\# of Shares Sold \\* $200 \\* Δt > $104,286.16\n\n\\# of Shares Sold > 521.43/Δt\n\nIf an LP sells shares today at $200, and buys them back tomorrow ( Δt = 1 ) at $200, in a world with a flat 3.5% inflation per year, they need to sell more than 521.43 shares to make a profit.  If the delay is 2 days, they need to sell at least 260.72 shares.\n\nIn restaraunt work, you are limited by your seats. Turnover is how many tables you can flip.  People sitting around drinking coffee aren't buying things.  Here, it's the reverse.  The longer the turnover (Δt), the longer you get to play with your money before you spend it on shares you owe, and the more favorable your numbers get.\n\n&#x200B;\n\nThese shares are sold in lots of 100, so let's round up.  Always be conservative.  For every 600 shares per 1 day turnover at $200 each, an LP will generate more money than their traditional business model.\n\nIf you share price goes down, your volume or turnover must increase.  If we assume 1000 shares, we get...\n\n1000 Shares Sold \\* Share Price \\* Δt > $104,286.16\n\nShare Price > $104,286.16 / 1000 / Δt\n\n\\> \\~$104.29/Δt per 1000 shares sold\n\nI think this is a particularly neat equation with huge ramifications for stocks with both low liquidity *and* share prices under $10.  Especially penny stocks - ho-*ly* fuck.\n\n&#x200B;\n\n&#x200B;\n\nBut some of you had a keen eye and realized MMs act as the middle between a buyer and a seller.  We know there is a Buyer because the MM is creating and selling the shares, and we know there isn't a Seller because there is no volume or liquidity.  That means we're not getting either the $0.30 or $0.20 and taking the difference of $0.10.  Instead we're receiving one payment of either $0.20 or $0.30.  Assuming $0.20 instead of $0.30 (most conservative), that doubles the result to > \\~$208.60/Δt per 1000 shares sold.\n\n&#x200B;\n\n# LP Revenue absolutely dwarfs Maker-Taker Revenue\n\nWe're assuming the LP buys back the shares, and we're assuming they buy them back at the same price they sold them for.  There's no gaurantee either of these assumptions are true.  The price may never drop back down.  They may only purchase a portion of the shares before the price rises again.  The LP may be nefarious and never intend to repurchase the shares.  We don't know.\n\n&#x200B;\n\nProfit = ( Sold Share Volume \\* Sell Price ) - ( Buy Share Volume \\* Buy Price )\n\nYou can take a look again at Freez' image with the supports and resistances and fiddle with the math.\n\n&#x200B;\n\nRegardless, *when* the shares are never purchased, the equation changes dramatically.\n\nProfit = (# of Shares Sold \\* Share Price ) + ((# of Shares Sold / 100) \\* 0.10)\n\n&#x200B;\n\nFirst, they're selling N shares for some price. Second, they get $0.10 per 100 shares sold for being the middle person.  Third, they never repurchase the shares, so we can drop the inflation portion of the equation entirely.\n\nLet's compare apples to apples from our previous equations.  We'll assume 500 shares this time, using the most conservative block of 100 shares for the 521 shares from before, and we'll use the same share price of $200.\n\nProfit = (500 shares \\* $200 per share) + (500 shares / 100) \\* $0.10)\n\nProfit = $100,000 (LP sale) + $0.50 (Maker-Taker)\n\nEven if the MM LP cut is $0.30 per 100 shares, that increases the Maker-Taker revenue to $1.50\n\nLet's be real.  You don't care about the Maker-Taker revenue.  *That's a fart in a hurricane.*\n\n==== \\^\\^  See Edit #4 down below \\^\\^ ====\n\nNow take a look at the resistance image again.\n\nhttps://preview.redd.it/ayq8hwogvj971.png?width=1872&format=png&auto=webp&s=23c2932705e45b29f32183025fbe6ab1af5211fd\n\nI never understood how the daily drops' volume was always so much higher than the [available borrows](https://iborrowdesk.com/report/GME), even when accounting for the \\~10M shares in ETFs.  And I never understood why the resistances kept increasing.  I could understand the resistances to some effect, because each % we eat of their borrows increases their overall short position, but the two pieces never added up.\n\nRetail, simply put, does not have the power to effect that much volume in either direction right now.  (Yes.  Effect with an E.  I will fight you.)\n\nEven though our math is rough, at best, I think Liquidity Providers' actions and obligations explains the supports and liquidity.\n\nI'm not really sure where to go with this next.  I hope someone finds language in one of the previous or new rulings that says something like, \"LPs must close their positions within timeframe,\" similar to the FTD mechanics for equities (stocks) and their derivatives (options), but I'm not sure where to look for that language.\n\n&#x200B;\n\nEdit: Formatting changes and cleaned up redundant formulas.  Also edited TLDR to reflect my personal take.\n\nEdit 2: Longer TLDR\n\n# \n\n# Edit #4:\n\nBoth Maker-Taker and PFOF are competing for roughly the same market inventory.  It might be weird to think of transactions as market inventory, but it is.  They've got their pros and cons between them, but they're either a flat fee or a percentage take.  Either way, the revenue from this is large enough to make a business (or augment existing revenue streams), but small enough that it doesn't drive business away.  That means there's no reasonable way either MT or PFOF could realistically compete with selling purchased shares for profit (ΔShare Price), much less selling \\[as of yet\\] unpurchased shares for profit.\n\nI wish I had similar metrics for PFOF so we could do both maths side by side, but I don't.  But we know the numbers should be similar because they are competing for the same market inventory.  Even if we give PFOF 10x the revenue impact ($15.00) as MT ($1.50), the example provided demonstrates *it just doesn't matter.*\n\nDetails matter *for so many reasons*, especially when we try to convey important points accurately to people who understand these systems well.  But these details don't change the big picture.\n\nWhen you can sell something you don't own and don't intend to purchase, you make money hand over fist.",
    "title": "Market Maker / Liquidity Providers Maths",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oequz8/market_maker_liquidity_providers_maths/"
}