{
    "author": "duglas2948",
    "created_utc": 1627483458.0,
    "distinguished": null,
    "edited": 1627528088.0,
    "id": "otbbux",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_otbbux",
    "num_comments": 385,
    "permalink": "/r/Superstonk/comments/otbbux/ryan_cohen_knew_what_he_was_doing_announcing_this/",
    "score": 4574,
    "selftext": "Everyone always laughs when good news comes out and GME tanks. Today we got invited to the S&P 400 and rebranded EB Games to formally become International GameStop franchises. Hedgies knew this would be good so they sold all the shares they bought through dark pools, this is why price tanked on a volume of 600K even with a high buy sell ratio of 5:1 (what GME hits midday with the low volume we have seen in the past few weeks.) \n\nHowever they were so wrong in doing this and Ryan Cohen baited them. Yesterday that massive selloff I believe was hedgies taking thier profits on tech stocks before earnings so they could tank GME today. However, in order to do that they must have capital to back up the shorting they do as well. Normally in a bull market they do, but you know what today is? ITS JPOW DAY!!! \nOnce he gives his speech the market will tank on that speech like it always does and RC knows it. So he chose today to make these announcements so that hedgies would short but then be stuck without collateral as the markets dip, causing them to roll over thier positions causing GME to stay green today and leave hedgies out off ammo for GameStop earnings.\n\nEdit1: yes I know market did not tank today which is surprising as it usually does when jpow speaks. This is probably ur to there already bring a selloff yesterday in megacaps, GME did recover a bit and it will be interesting to see if the markets will be up or down for the week starting tomorrow, and hopefully GME gaps up to $180 EoW.\nI trust RC in that he knows what he is doing and his announcements are usually in clusters and timed so they benefit GameStop, so let’s see what he is up-to and what comes later down the streatch.\n\nClarification: yes I know RC didn’t control S&amp;P 400 announcement, although it is a nice coincidence it was announced today, I was referring to the expansion into foreign markets starting by rebranding EB Games to GameStop",
    "title": "Ryan Cohen knew what he was doing announcing this news today.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/otbbux/ryan_cohen_knew_what_he_was_doing_announcing_this/"
}