{
    "author": "InvestmentOracle",
    "created_utc": 1622413835.0,
    "distinguished": null,
    "edited": 1622450639.0,
    "id": "nomalf",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nomalf",
    "num_comments": 339,
    "permalink": "/r/Superstonk/comments/nomalf/dr_trimbaths_work_directly_disproves_a/",
    "score": 4058,
    "selftext": "A reverse-merger, or any sort of CUSIP # change or name change, will not work, and here’s why:\n\n\n1. Dr. Trimbath, Naked, Short and Greedy: Wall Street’s Failure to Deliver, Page 172-173:  “I had drinks with a person who is an expert in clearing on Friday. He said Patrick should do a rollback (he could always do a forwards split later) and change his CUSIP number. Is my friend right that this would force the system to reconcile all the claims into real shares? No, your friend’s suggestion could result in the issue being frozen at DTCC.” [Image](https://imgur.com/a/Jf5TClN)\n\n\n2. Dr. Trimbath, Naked Short and Greedy: Wall Street’s Failure to Deliver, Page 41 (41 on the PDF, might be Page 43 in the paper copy): “Companies victimized by short sales, stock lending and settlement failures made numerous attempts over the years before 2003 to fix the problem: declaring reverse stock splits, recapitalizations, name changes, the issuance of warrants and “loyalty shares,” etc. All these efforts failed and eventually only made it impossible to fix the underlying regulatory failure.” That last line makes it seems that a change would actually make the problem *worse*, but I don't know. [Image](https://imgur.com/a/U2gZ12i)\n\n\n3. In that same article that one of the original DD’s linked (https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/) they wrote “Once that CUSIP changes, the naked shorter has no apparent way to close out the naked short position. No stock under the old CUSIP number exists anymore; it all automatically converts to the new CUSIP. Those trades can sit in the Obligation Warehouse forever, in theory. But the “aged fails” — essentially orphaned naked short transactions — remain on the naked shorter’s balance sheet as a liability to be paid later. By DiIorio’s reckoning, then, the cycle of naked shorting and reverse splits would inevitably result in an ever-increasing number of aged fails. And if that was happening, and those liabilities grew bigger and bigger, then federal regulators could see the outlines of the scheme on any financial statement.” Meaning that it would not be a catalyst but rather a stain on their balance sheet that might look bad but wouldn’t for the shorts to do anything. Historically, it seems that the naked shorting issue would just get frozen at the DTCC in limbo and not actually addressed. *Also I reached out to the author on twitter and he has yet to reply so I'll update this if he does I guess.*\n\n\n4. And [this tweet](https://i.redd.it/k1h6uwj0bb271.jpg) from Dr. Trimbath in which she states it’s not the move.\n\n\n5. Take a look at [this Forbes article](https://www.forbes.com/2006/08/25/naked-shorts-global-links-cx_lm_0825naked.html?sh=7940abe48400) regarding Global Links Corp when they tried to do the same thing in 2005 even after RegSHO was passed. It states the following: “In the first four days of trading, more than 143 million shares traded hands. This is despite the fact that the stock was trading under a new ticker and a new trade tracking number, and despite the fact that it had only 1.1 million shares issued. The Depository Trust & Clearing Corp., which handles the lion’s share of U.S. stock settlement, had just 929,277 shares available for trading.” [Thanks /u/Warm_Fudge](https://www.reddit.com/r/Superstonk/comments/ngj4br/using_pure_logic_why_gamestop_will_be_the_ones_to/gyrjh10/)\n\n\nI don't want to say [this post](https://www.reddit.com/r/Superstonk/comments/n7bv2h/ryan_cohens_kill_shotthe_reverse_merger/) and [this post](https://www.reddit.com/r/Superstonk/comments/nnmb4c/tombstone_tweet_confirms_reverse_merger_reposted/) are FUD, but the seemingly only source they have is the same article that says it wouldn't force the shorts to do anything, and Dr. Trimbath's work directly disproves it. \n\n\nVoting and a crypto dividend are still cool though 👍\n\n\nThanks!",
    "title": "Dr. Trimbath's Work Directly Disproves a Reverse-Merger or CUSIP # Change Catalyst",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nomalf/dr_trimbaths_work_directly_disproves_a/"
}