{
    "author": "Nauaf101",
    "created_utc": 1622059052.0,
    "distinguished": null,
    "edited": 1622210941.0,
    "id": "nlpz4h",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nlpz4h",
    "num_comments": 4766,
    "permalink": "/r/Superstonk/comments/nlpz4h/your_votes_are_important_the_time_to_vote_is_now/",
    "score": 23688,
    "selftext": "Heya Stonkers!\n\nYou can **VOTE** with your GameStop shares for the upcoming shareholder meeting on June 9th. The final deadline to vote is June 8th.\n\nIt is important that you cast your vote, because this can prove that there ARE more shares floating around than what GameStop has issued. This means that if the amount of votes CAST exceeds the FLOAT. A.K.A **Hedgies. Are. Fuk.**\n\n**Gamestop's Board of Directors is urging everyone to vote as soon as possible.**\n\nhttps://preview.redd.it/t01rkfo0li171.png?width=842&amp;format=png&amp;auto=webp&amp;s=c784448e5d641a9194d2e8f1fa0cfb3610760fcf\n\n\\----------------------------------------\n\n**HOW Do I VOTE?**  \n*Click on these links below to view how to vote through your brokerage*  \n*(You must be a shareholder on or before 4/15 to be eligible to vote)*  \n\n* EToro\n\n1. You should have received an email with information regarding the voting procedure and how to vote!\n\n\n\n* Fidelity:\n\n1. Navigate to Fidelity.com and Log In\n2. From the Portfolio Summary page, click ‘Statements’\n3. Select ‘Proxy Materials’ in the white menu at the top of the page. The following page will show all current available securities you are able eligible to vote on.\n4. There will be a ‘Vote’ link in the ‘Status’ column if you are able to participate.\n5. The link will take you to an independent Fidelity-affiliate website. There, you’ll be able to vote, review meeting agendas, and see related documents/learning materials.  \n[https://www.reddit.com/r/GME/comments/mspe40/how\\_to\\_proxy\\_vote\\_gme\\_with\\_fidelity/](https://www.reddit.com/r/GME/comments/mspe40/how_to_proxy_vote_gme_with_fidelity/)  \n\n\n\n\n* TDAmeritrade\nCallTDA @ (800) 669-3900 (Trade Desk)\n\n1. Enter your account info, then select option 4\n2. Say something like “Hello, I am calling because I own a handful of GameStop shares and I am interested in getting my control number that I can use to vote on proxyvote.com regarding the upcoming shareholders meeting”\n3. The rep will likely do one of two things; either transfer you to the proper department for them to give you that info, or they themselves will chat to that department internally to get the control # for you. In my case, the trade desk rep chatted to the department internally and got my control number for me within about 20 minutes.\n4. Once you have your control #, it’s off to the races. Visit [www.proxyvote.com](http://www.proxyvote.com/), enter your 16 digit control #, then vote on the list of things. It’s about 5 or 6 things, with recommendations from the board on what they suggest.\n5. You’re done!  \n[https://www.reddit.com/r/GME/comments/mx27pq/proxyvote\\_instructions\\_for\\_td\\_ameritrade/](https://www.reddit.com/r/GME/comments/mx27pq/proxyvote_instructions_for_td_ameritrade/)  \n\n\n\n\n* IBKR\n\n1. You should have received an email with your control number and a link that automatically takes you to a website that allows you to vote.  \n\n\n\n* XTB\n\n1. Contact their support, email, or call them asking for your control number to vote for using your GME shares.\n\n\n\n* Saxo Bank \n\n1. You should contact their support and they will guide you on the procedure of getting your control number.\n\n\n\n* TradeStation \n\n1. You should have received an email with a link that takes you to a page to vote!\n\n\n\n* BinckBank (Deadline to vote Friday May 28th 12:00)\n\n1. Mail to klantenservice@binck.nl with subject: Incident 2346 + * Your Binck Account Number*\n\n2. Alternatively, you can call them at 020 606 2666\n\n\n\n\n* Degiro\n\nhttps://www.reddit.com/r/Superstonk/comments/n63w7l/important_how_to_vote_with_degiro/\n\n\n\n* SoFi\n\n1. They should have sent an email regarding your proxy materials. If you haven't seen it, contact them!\n\n\n\n* Chase\n\n1. They should have sent an email regarding your proxy materials. If you haven't seen it, contact them!\n\n\n\n* Stash\n\n1. Contact their support and ask for your control number for your GME shares in order to vote for the upcoming shareholder meeting.\n\n\n\n* Schwab\n\n1. Log in, go to services tab, click \"corporate actions\". On the corportate actions page, click \"Proxy Events\". On proxy events page click on \"vote\"\n\n2. Alternatively you can also call them by following the guide here:\nhttps://www.reddit.com/r/Superstonk/comments/n3weyj/schwab_how_to_get_your_control_number_and_vote/\n\n\n\n* Avenue (Brazilian)\n\n1. Call broker\n\n\n\n* Wells Fargo\n\n1. Should have recieved an email from them, if you haven't make sure to call them and ask for your control number.\n\n\n\n* BNP PARIBAS / SMARTBROKER\n\n1. You should receive an invitation for the vote in your (mail) account. From there you can request your right to vote for free!\n\n\n\n* SwissQuote\n\n1. Contact them and ask about voting for GME. https://www.swissquote.ch/url/contact\n\n\n\n* DIRECTA SIM (Italy)\n\n1. To obtain your code you must submit your request to the customer service via email at directa@directa.it\n\n\n\n* - DNB (Norway)\n\n1. To vote contact corp.acts@dnb.no\n\n\n\n\n* - Fineco\n\n1. Contact them by emailing, or calling them\n\n\n\n* - Passfolio\n\n1. An email should have been sent with the proxy link to vote.\n\n\n\n* - Firstrade\n\n1. You should have received an email from them regarding how to vote.\n\n\n\n* - M1 Finance\n\n1. You should have received an email from them regarding how to vote.\n\n\n\n* Vanguard\n\n1. You should have received an email with your control number and a link that automatically takes you to a website that allows you to vote.  \n\n\n\n\n* TradeRepublic  \n[https://www.reddit.com/r/Spielstopp/comments/nh24t9/tr\\_affen\\_k%C3%B6nnen\\_w%C3%A4hlen/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/Spielstopp/comments/nh24t9/tr_affen_k%C3%B6nnen_w%C3%A4hlen/?utm_source=share&amp;utm_medium=web2x&amp;context=3)  \n\n\n\n\n* Comedirect\n\n1. Use the contact form and demand the proxy statement. You will be able to find it after a few hours/days (maybe after the weekend) in your Postbox. Alternatively, you can call them  \n[https://www.reddit.com/r/Superstonk/comments/ncg06m/german\\_broker\\_comdirect\\_finally\\_allows\\_to\\_vote/](https://www.reddit.com/r/Superstonk/comments/ncg06m/german_broker_comdirect_finally_allows_to_vote/)  \n\n\n\n\n* WEBULL\n\n1. You should have received an email with your control number and a link to: [https://www.proxyvote.com/](https://www.proxyvote.com/) Contact Webull if you don’t have it.  \n\n\n\n* Ally Invest\n\n1. You should have received an email from id@proxyvote.com\n\n\n\n* Interactive Investor\n\n1. Call or Email them to get information on how to cast your vote.\n\n\n\n* Interactive Brokers\n\n1. if you have a cash account and disabled the lending then you will get your documents. Otherwise, contact them.\n\n\n\n* Stake\n\n1. You should have received an email with a link to vote from (SAY) (GameStop Corp)\n\n\n\n* REVOLUT (DriveWealth Partner)\n\n1. You should have received an email with a link to vote from (SAY) (GameStop Corp)  \n\n\n\n* E Trade\n\n1. You should have received an email from id@proxyvote.com\n\n\n\n* Wealth Simple\n\n1. Contact a customer service representative by going to Settings -&gt; Help -&gt; Chat with us\n2. Tell the representative that you are interested in getting the control number for your GME shares so that you can vote.\n3. They will respond with a control number (multiple control numbers if you have multiple investment accounts with GME) and a proxyvote link where you will enter your control number for each investment account and vote.\n\n\n\n* TD Direct Investing\n\n1. Call the investing 1 800 number and request control number to provide proxy vote for upcoming shareholders meeting.\n\n\n\n* Scotia Itrade\n\n1. The same as TD Direct Investing above ^\n\n\n\n* IG Trading\n\n1. IG Trading says you should follow the protocol linked here. https://www.ig.com/uk/help-and-support/investments/share-dealing-and-isas/do-you-offer-proxy-voting\n\n\n\n* Questrade \n\n1. Contact support and request proxy voting, takes 2-3 business days by email! Alternatively, you can also submit an account request, and you'd get it by mail.\n\n\n\n* BMO\n\n1. Contact support and request control number, takes 2-3 business days by email!\n\n\n\n* RBC\n\n1. Arriving by snail mail!\n\n\n\n* Q Trade\n\n1. Arriving by snail mail!\n\n\n\n&amp;#x200B;\n\n* RobinHood\n\n1. Check the email you received from RobinHood for further instructions  \n\n\n\n\n* CashApp\n\n1. You should have received an email with a link to vote from (SAY) (GameStop Corp)  \n\n\n\n\n*(Comment down below if I have missed your brokerage, and I will add it)*  \n\\----------------------------------------\n\n**If you haven't received your control number, make sure you...**\n\n* Check your broker inbox for proxy info ✔\n* Check your email ✔\n* Send a message via your broker help/chat interface ✔\n* Call your broker and request your control number ✔\n* Look around the comments and other posts to see if any resources have been shared that might help you in your search ✔\n* Check your broker's website for an FAQ- Many have a landing page with GME specific proxy info ✔  \n(*Thank you* u/PinkCatAcid *For This)*  \n\\----------------------------------------\n\n**Misinformation ALERT:**\n\n\\- The only apes who can vote the DAY OF the shareholders meeting are the ones who PREARRANGED it with GameStop and will be there IN-PERSON. Shills will try to convince you otherwise. All proxy votes MUST BE in by June 8th, or they WILL NOT be counted. Like GameStop, Superstonk encourages all apes to vote as soon as possible.\n\n\\- Phishing Links from bad actors are being spread around, make sure to input your control number in a website provided by official channels **ONLY. (GameStop Corporate Website OR Links From Your Broker)**  \n\\----------------------------------------\n\n**DeadLine To Cast Your Vote: Tuesday, June 8th, 2021**\n\n\\----------------------------------------\n\n**Voted Flair**\n\n**(StonkU2):**\n\n - Want a “🦍Voted✅” Flair? Automod will hook you up! Just type !apevote! And - BOOM - you get a flair, and you get a flair, and YOU get a flair. Everybody Votes? Everybody gets a Flair!\n\n- If you attempted to vote with no success, \ntype: !novote!\n\n- Please note for all apes who own GME but are feeling left out by the voting flairs... you can now type !newape! and receive your own flair: ✅ New 🦍\n\n*Please note, this will overwrite any current flair in place. If you already have custom flair, but also want the voted or attempted vote flair, just tag* u/Bradduck_Flyntmoore *in the comments below!*  \n\\----------------------------------------  \n**Final Notes**\n\n**Please note that the board recommends you vote for ALL**\n\nIf you see an ape without the flair, ask them if they have voted, and encourage them to vote!\n\n**Ape Help Ape!**  \n\\----------------------------------------\n\nIf you have any questions about voting, do comment below and the mods will do their best to answer!\n\nThank you.",
    "title": "⚠️ Your Votes Are IMPORTANT. The Time To Vote Is NOW ⚠️",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nlpz4h/your_votes_are_important_the_time_to_vote_is_now/"
}