{
    "author": "leisure_rules",
    "created_utc": 1626204213.0,
    "distinguished": null,
    "edited": 1626216419.0,
    "id": "ojmur0",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ojmur0",
    "num_comments": 60,
    "permalink": "/r/Superstonk/comments/ojmur0/extended_summary_cftc_risk_meeting_and_proposals/",
    "score": 1688,
    "selftext": "For those who saw [this post](https://www.reddit.com/r/Superstonk/comments/ojgmav/for_anyone_interested_there_is_currently_a_risk/?utm_source=share&utm_medium=web2x&context=3) and are looking for a summary, here ya go:\n\nSome **light background reading** on the Futures Market - [https://www.investopedia.com/terms/f/futuresmarket.asp](https://www.investopedia.com/terms/f/futuresmarket.asp)\n\n**What's the CFTC?**\n\nThe mission of the Commodity Futures Trading Commission is to promote the integrity, resilience, and vibrancy of the U.S. derivatives markets through sound regulation.\n\nThe proposed amendments outlined below, [would be to this chapter of Title 17 of the SEC](https://www.ecfr.gov/cgi-bin/text-idx?SID=79452713d116ca7e248dfb358011c202&mc=true&node=pt17.1.39&rgn=div5):\n\n**What's the MRAC?**\n\nThe Market Risk Advisory Committee advises the Commission on matters relating to evolving market structures and movement of risk across clearinghouses, exchanges, intermediaries, market makers and end-users. It examines systemic issues that threaten the stability of the derivatives markets and other financial markets, and makes recommendations on how to improve market structure and mitigate risk.\n\nIt's comprised mainly of executives with \"compliance/risk/governance/legal\" in their job title from companies that operate within the derivatives market; some to note:\n\n* Citadel\n* CME Group\n* BlackRock\n* Federal Reserve Bank of New York\n* Goldman Sachs\n* Intercontinental Exchange, Inc.\n* Virtu Financial\n* The OCC\n* Vanguard\n* JPMorgan\n\n**What was this meeting about?**\n\nMRAC will receive final reports from the CCP Risk and Governance Subcommittee and a status report from the Interest Rate Benchmark Reform Subcommittee. In addition, the MRAC will vote on a recommendation from the Interest Rate Benchmark Reform Subcommittee for a market best practice that prioritizes derivatives trading in the Secured Overnight Financing Rate (SOFR) for particular market segments, otherwise known as SOFR First.\n\n**Some quick vocab:**\n\n* **SOFR** \\- Secured Overnight Financing Rate (SOFR) is a broad measure of the cost of borrowing cash overnight collateralized by Treasury securities. It's getting rolled out globally as a replacement for LIBOR - [https://www.newyorkfed.org/markets/reference-rates/sofr](https://www.newyorkfed.org/markets/reference-rates/sofr)\n* **CCP** \\- Central Clearing Party; in any tri-party market, the CCP acts as a mediator between two institutions looking to initiate an exchange of securities/assets. The CCP will take cash from Institution 1 and the security from Institution 2, and manage the entire transaction.\n   * **The whole point of this meeting is to ensure that the CCPs that operate in the Derivatives Market (DCOs), are adequately positioned to handle adverse economic situations,** ***as they*** ***currently are not***\n* **DCO** \\- CCPs that are subject to regulation by the CFTC as **derivatives clearing organizations**\n* **SIDCO -** Systemically Important DOC\n* **SITG -** Skin in the Game\n* **FSB -** Financial Stability Board\n* **NDL** \\- Non-default Losses; significant capital losses that are *up to but not including, defaulting of the CCP*\n* **PFMI** \\- Principles for Financial Market Infrastructures; broad documentation, relative here to stress testing requirements\n\n**What are the reports about?**\n\n1. **SOFR First**\n   1. SOFR replacement of LIBOR in derivative market agreements:\n      1. Linear Swaps **(beginning 7/26/21)**\n      2. Cross Currency Swaps (FX)\n      3. Non-Linear Derivatives\n      4. Exchange Traded Derivatives\n   2. **Takeaway**: This isn't huge news, SOFR rollout is happening around the world, and this is more or less the implementation of that framework into regulations around the derivatives market\n2. **Capital and 'Skin-in-the-Game' Requirements**\n   1. The primary purpose of **DCO SITG** is to *incentivize management of market and other risks*, rather than serve as a significant resource to absorb losses arising from a clearing member’s default\n      1. While all members **agreed and voted on the fact that it's something that should be implemented**, *\"Subcommittee members were unable to reach agreement on an appropriate methodology to utilize for sizing a DCO’s SITG contribution to the default waterfall and the related matters, such as the specific size of any DCO’s SITG contribution.\"*\n   2. Subcommittee members **agree** that DCOs should *maintain appropriately sized capital requirements to cover NDLs* for which they are responsible, and a DCO’s default fund should not be used to cover NDLs\n      1. In addition, there was broad agreement, consistent with financial market practices, that a DCO **should not be responsible for losses arising from the failures of third-party custodians and settlement banks, where the DCO has not acted negligently or in bad faith in the selection and monitoring of such third-parties**\n      2. **However**, *CFTC Regulation 1.29 requires that DCOs bear losses related to investment of customer funds. DCOs are further required to maintain conservative investment portfolios for customer funds pursuant to CFTC Regulation 1.25, thus minimizing the risk of investment losses*\n      3. **No agreement on specific language to implement additional rules concerning NDLs**\n   3. This one is interesting: **Agreement for DCOs to solicit shareholders for voluntary contributions**\n      1. While Subcommittee members **agree in principle** that to the **extent a DCO’s losses exceed available resources after capped assessments have been made that a DCO’s shareholders should be solicited to contribute voluntarily to address such losses**\n      2. However, they were **unable** **to agree** whether residual DCO equity at the end of the waterfall should be required to be used to address uncovered losses\n   4. **Takeaway** here is that everyone agrees that DCOs should be able to cover their asses when needed, but no one agrees on the exact amounts/rules that would be imposed...\n3. **Stress Testing and Liquidity**\n   1. This proposal was born from the broad agreement in the Subcommittee **that stress testing of DCOs is a critical element to ensuring the resilience of DCOs and the financial system. Similar to above, while everyone agreed it's a good idea, no one could agree on specific implementation of the following:**\n      1. **Credit Stress Testing** by most, if not all, DCOs to employ stress tests that are designed to calibrate its financial resources to withstand the default of its two largest clearing members\n      2. **Stress Scenarios** should be aimed at identifying tail risks for the CCPs that could be exposed by shocks in stress periods\n      3. **Reverse Stress Testing** for analyzing its stressed loss distribution by member (and its credit risk)\n      4. **Stress Period of Risk** should be at least equal to the **margin period of risk** (“**MPOR**”) that is assumed when calculating the relevant initial margin levels\n      5. **Default Fund Re-sizing** on a monthly, rather than on a quarterly, basis\n      6. **Liquidity Stress Testing** is critical for both DCOs and the financial system and in considering liquidity risk\n      7. **Access to Central Bank Accounts** with appropriate oversight and governance should be broadened across jurisdictions\n      8. **Transparency** on matters relating to stress testing, with no agreement being established\n   2. **Takeaway**: Stress tests conducted by CCPs should be used to calibrate resources needed for resilience of the CCP to withstand extreme but plausible market shocks sufficient to result in the default of its largest clearing member(s), **but it's still up to the CFTC to determine the exact requirements.**\n\n&#x200B;\n\nWow, so much for this thing being a TL;DR for the other post.... I guess the overarching takeaway is that there is considerable risk identified within the Central Clearing Parties of the derivatives market. **Given the TRILLIONS of dollars that are exchanged daily within this market alone, it's imperative that the outlined proposals are enacted upon by the MRAC and CFTC committee members. The ball is now in their court**\n\n&#x200B;\n\nEDIT: for those asking how this ties to GME... besides the fact that futures and derivatives are utilized to manipulate the share-price, u/[Useful\\_Tomato\\_409](https://www.reddit.com/user/Useful_Tomato_409/) pointed out that **the former head of the CFTC (the commission about which this post was written) is now the chief legal officer for Citadel**\n\n[**https://www.reuters.com/article/us-heath-tarbert-citadel-securities-idUSKBN2BO6X3**](https://www.reuters.com/article/us-heath-tarbert-citadel-securities-idUSKBN2BO6X3)\n\n&#x200B;",
    "title": "Extended Summary CFTC Risk Meeting and Proposals",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojmur0/extended_summary_cftc_risk_meeting_and_proposals/"
}