{
    "author": "myplayprofile",
    "created_utc": 1626128049.0,
    "distinguished": null,
    "edited": false,
    "id": "oj1tjl",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oj1tjl",
    "num_comments": 183,
    "permalink": "/r/Superstonk/comments/oj1tjl/erasing_the_tape_how_to_remove_daily_trade_volume/",
    "score": 3131,
    "selftext": "While the whole world was having a big old COVID reopening party, a few autistics and apes saw the giant lie at the heart of the stonk markets, and they saw it by doing something the rest of the suckers never thought to do - They looked. Insert obligatory shoutout to u/atobitt u/criand u/homedepothank69 u/broccaaa and the many other DD authors in this sub that have and continue to 👀.\n\n&#x200B;\n\nTA:DR - Volume CAN be kept off the data feed, and certain trades are not published by the FINRA Trade Reporting Facility, aka the tape. This can suppress volume and hinder the natural price discovery in the market. More data is needed to verify if this has occurred with GME.\n\n&#x200B;\n\n[Remember that moment in \\\\\"The Big Short\\\\\"?](https://preview.redd.it/5jsomx48kta71.png?width=888&format=png&auto=webp&s=098a8b7ad80c66876cbe4b3cc33e62c4d213f8bc)\n\nEver heard of the term \"Painting the Tape\"? It's one of the many well known market manipulation tactics *\"whereby market players attempt to influence the price of a security by buying and selling it among themselves to create the appearance of substantial trading activity. The goal of painting the tape is to create the illusion of an increased interest in a stock to trick investors into buying shares, which would drive the price higher\"* [\\- From Investopedia](https://www.investopedia.com/terms/p/paintingthetape.asp). Painting the tape is so 2019 though, and in 2021 the market fuckery has reached new heights, and since the \"Reverse Uno\" has been played, to fully understand GME, your mind needs to travel through the \"Tenet Turnstile\" and begin thinking about everything in reverse, like it's opposite day, or a reciprocal. What's the opposite of \"painting the tape\"? I would like to present the lesser known tactic of \"Erasing the tape\", which has not even gotten it's own Investopedia page yet.\n\n&#x200B;\n\n[DFV 4\\/9\\/21 \\\\\"Reverse Uno\\\\\" Tweet - https:\\/\\/twitter.com\\/TheRoaringKitty\\/status\\/1380611475757236226\\/photo\\/1](https://preview.redd.it/d2i3ev79nta71.png?width=1500&format=png&auto=webp&s=e6bd7e1f27ea60d545f719e92416b97a4f38c5dd)\n\nBefore getting into the \"HOW\", first let's apply some critical thinking and try and answer \"Why would someone want to suppress the volume of a stonk?\" The first clue comes from \"Painting the Tape\" - 2 or more parties can trade a stonk between themselves to begin pumping the stonk higher, increasing reported trade volume on the tape, and \"outside interest\" in the stonk begins to rise the higher the volume and price goes, eventually making a headline on CNBC or other MSM, further increasing interests and volume, whereby the original parties that \"painted the tape\" hope to be able to exit the position at a higher price. The second clue comes from the nature of short squeezes and how both volume and price explode higher as the squeeze is being squoze. In regards to GME, every spike higher in price since Jan has had a surge in volume, followed by a slow churn lower in price and volume until the cycle repeats. i.e. Today (7/12/21) was the lowest volume (1,572,297 shares) since last July. Volume is the enemy of the shorts, and keeping volume down helps keep the price down, and gives the SHF's and Kenny G \"one more day' of solvency. After volume spiked above 100 million shares in Jan and Feb, GME volume has fallen substantially, only passing 20 mil shares twice since May!\n\n \n\n[GME Chart since 1\\/4\\/21 - OBV flatlined higher, while volume remains at levels for ants](https://preview.redd.it/4i69cz7dvta71.png?width=1245&format=png&auto=webp&s=8d106d97f7a88f4422a539c53743337faadf6686)\n\nNow, this fall off in volume since the Jan \"sneeze\" higher could be completely natural and explained by theories such as \"everyone that wants to buy GME has, they are all in, and the 💎🖐 are being shown by low volume that 🦍 aren't selling.\" For me personally, I don't fit into this narrative as I've quadrupled my holdings and recently added a comma to my X's, but I'm a small fish in a vast ocean. I do not think I'm alone, and I think the statement above is not accurate. My 🧠 is pretty smooth though, and I have been struggling to wrap my head around where the volume has gone, especially after the wrinkles of u/dlauer have cleared up many things regarding dark pools through posts like [THIS](https://www.reddit.com/r/Superstonk/comments/o70lid/dark_pools_price_discovery_and_short/) \\- so I started digging, found a rabbit hole, and still in the process of finding out how deep it goes.\n\n&#x200B;\n\n**THE HOW -** \n\nDark Pools and FINRA rules relating to \"Transaction Reporting\" for \"Trading Otherwise than on an Exchange\", aka OTC (over the counter) transactions, either through \"Alternative Trading Systems\" (ATS) or non-ATS systems, aka dark pools. Need a night time read to help you sleep, knock yourself out - [LINK](https://www.finra.org/rules-guidance/rulebooks/finra-rules/6110). \n\nQuick note, FINRA has addressed dark pool trading mainly by making registration requirements and rules for ATS, and these rules have led to fines such as the $3.5 million Citadel paid in 2018 for \"failure to submit complete and accurate trade data for approximately 80 million trades between 2012-2016\" - [See Disclosure 11 of 59 starting on p.60](https://files.brokercheck.finra.org/firm/firm_116797.pdf). While that fine could be considered part of the cost of doing ~~business~~ *crime*, Kenny G and Shitadel (aka 💩a🔔) are relentless optimizers and always looking to cut down on costs, so I wonder if that led them to shut down their registered ATS \"Apogee\" in 2015 and move their dark pool to a non-ATS entity know as a \"Single Dealer Platform\" (SDP) that Kenny cleverly named \"Citadel Connect\" - [Reuters Article](https://www.reuters.com/article/us-citadel-darkpool/citadel-securities-to-close-apogee-dark-pool-sources-idUSKBN0MN22Q20150327). u/swede_child_of_mine has some great DD with more details [HERE](https://www.reddit.com/r/Superstonk/comments/od4bb1/the_sun_never_sets_on_citadel_part_2/), but essentially SDP's have significantly less regulations and reporting requirements than \"ATS\" dark pools, making them the **DARKEST** of the dark pools. Using the SDP, 💩a🔔 effectively side steps the rules that cost them $3.5mil a few years ago - great win for their bottom line I'm sure - through use of \"Immediate or Cancel\" Transactions.\n\nNow, to fully understand **HOW** trades can be kept off the tape, look no further than [FINRA rule 6380](https://www.finra.org/rules-guidance/rulebooks/finra-rules/6380a) under subsection (e) stating \"**The following shall NOT be reported to the FINRA/Nasdaq Trade Reporting Facility\"**, and specifically the following -\n\n*  (1)(D) the acquisition of securities by a member as principal in anticipation of making an immediate exchange distribution or exchange offering on an exchange; \n*  (1)(G) the transfer of equity securities for the sole purpose of creating or redeeming an instrument that evidences ownership of or otherwise tracks the underlying securities transferred (e.g., an American Depositary Receipt or exchange-traded fund). \n* (2) (A) transactions where the buyer and seller have agreed to trade at a price substantially unrelated to the current market for the security, e.g., to enable the seller to make a gift; \n* (2) (B) purchases or sales of securities effected upon the exercise of an option pursuant to the terms thereof or the exercise of any other right to acquire securities at a pre-established consideration unrelated to the current market;\n\nAdditionally, subsection (d)(3) describes \"**Reporting Principal an Riskless Principal Transactions\" -** essentially highlighting how market makers and broker-dealers need to submit \"Non-Tape, Non-Clearing Reports or Clearing-Only Reports\" for certain legs of transactions where *\"a member after having received an order to buy a security, purchases the security as principal at the same price to satisfy the order to buy or, after having received an order to sell, sells the security as principal at the same price to satisfy the order to sell, shall be reported to the FINRA/Nasdaq Trade Reporting Facility as one transaction in the same manner as an agency transactio*n.\"\n\n\\--------------------------------------------------------------------------------------------------------------------------\n\nUp to this point, everything I've shared is a verifiable fact with a source, but from here I'm going to include my opinions and speculation. I am not a financial advisor and this is not financial advice, but here's my take - \n\n* (e)(1)(D) - An IoC (Immediate or Cancel) transaction *\"is an order to buy or sell a security that attempts to* [*execute*](https://www.investopedia.com/terms/e/execution.asp) *all or part immediately and then cancels any unfilled portion of the order\"* as defined by [Investopedia](https://www.investopedia.com/terms/i/immediateorcancel.asp). The wording of this rule, in conjunction with the \"riskless principal\" rules in (d)(3), seems ripe for a Single Dealer Platform (SDP) dark pool like 💩a🔔 Connect to exploit for fuckery when they want to keep volume suppressed. I'm sure I may be over simplifying things right now, but since market makers can legally create phantom shares are they see fit, and 💩a🔔 has their own HF and ties to criminals like known insider trader Steve Cohen, it seems like volume can be taken to the darkest pool and never reported to the tape as the MM can claim \"buying GME was in anticipation of immediate offering\" or the buying was part of a riskless principal transaction with 💩a🔔 the hedge fund, Point72, or countless others within Kenny G's criminal enterprise.\n* **(e)(1)(G) - Creating or Redeeming ETFs - This is BIG imho -** Plenty of DD's on how the bulk of FTD's have shifted from GME to ETFs containing GME. Imagine 💩a🔔 had FTD's on the IWM, they need to \"create\" an IWM share to redeem and satisfy the FTD. They funnel shares from the dark pool into a basket of the 2000 other stocks in the IWM, that volume is never reported to the tape since it was part of a IWM share creation, new IWM shares are created and the FTD is satisfied.\n* (e)(2)(A) - While I'm not really sure how applicable the \"e.g. gift\" is here, the phrase *\"trade at a price substantially unrelated to current market\"* brings back memories of all the fuckery we saw with 🦍 transferring shares out of Robinhood and the cost basis being way different than what people actually paid, and usually split out to several trades at prices way different than where GME was trading.\n* **(e)(2)(B) - Exercising options - THIS IS THE BIGGEST - someone with more wrinkles than me help out here, but exercised option trades ARE NOT REPORTED TO THE TAPE!!!** I think a lot of the missing puzzle pieces to things are hidden in the option data, and I personally am looking deeper into this data to try and make sense of things, but my intuition is options are not only being used to hide short interest, reset FTDs, and create \"synthetic\" shares, but also are being used to keep volume suppressed - instead of \"painting the tape\" to increase interest, \"ERASE the TAPE\" to try and KILL INTEREST! \n\n\\---------------------------------------------------------------------------------------------------------------\n\n**HELP NEEDED!!!**\n\nNow, I've laid out this theory, but I have not been able to substantiate anything with data...YET. I need help, and hope some of the wrinkly  🦍 out there may have access to the data I'm looking for, specifically - \n\n* Historical data on the shares outstanding for all the ETF's containing GME. i.e. IWM currently has \\~300 million shares. How does this compare to the shares outstanding in Jan, Feb, and especially Apr/May/Jun when FTD's started pilling up.\n* How did the Russel 2000 rebalance affect ETF holdings of GME. Were ETF's like the IWM intentionally failed on delivery after GME was announced for Russel 1000 inclusion since MM had 35 days after the fail to create IWM shares without needing to buy GME.\n* Historical option data specifically showing ITM options being exercised early. This can be tricky, especially on strikes with higher volumes, as it will be difficult to determine if day over day changes in OI was the result of options being exercised or simply closed out by MM's.\n* Data on \"Non-Tape, Non-Clearing Reports or Clearing-Only Reports\". I've searched for days on FINRA trying to find this data, but I don't think it's publicly available. This may be a stretch, but could a FOIA (Freedom of Information Act) potentially be used to get access to this? It doesn't even need to be market wide, maybe just a few of the SUS entities like Citadel and Susquehanna.\n* More granular OTC (Non-ATS) Data. For GME, dark pool data can be found on the FINRA site - [https://otctransparency.finra.org/otctransparency/OtcIssueData](https://otctransparency.finra.org/otctransparency/OtcIssueData) \\- and Non-ATS data showing Citadel volume was released each month under the \"NMS Tier 2\". GME moved to \"NMS Tier 1\" after Russel 1000 inclusion and will be released every 2 weeks now. The data shows shares traded and the number of trades, but I'm wondering if there is anyway to breakdown that data further to show buys, sells, and short sales on a daily basis, instead of the consolidated data for the entire reporting period. The May data looks like this - \n\n[Non-ATS Dark Pool Data for GME for May 2021](https://preview.redd.it/o5vrqz60tua71.png?width=1150&format=png&auto=webp&s=6a580452dee12f0456b0416d6ebf95240b46f4a0)\n\nI've said this before in prior posts, but after spending the last several weeks looking in this and still having many unanswered questions, if it looks like 💩, acts like 💩, and trades like 💩, then it's probably the fine work of Kenny G and 💩a🔔. I have struggled to wrap my head around what seems like \"missing volume\" for months now, and just like \"radio waves\", just because I can't see it, doesn't mean it's not there. I hope some of 🦍s out there can help uncover some of the data I listed above, or help me and others form some new wrinkles if I've missed anything or have any counter DD. If I'm able to get the data, I'll get a follow up DD written as soon as I can. Again, this is not financial advice. \n\nBUY. HODL. 💎🖐. \n\n💎🖐🦍 --> 💩a🔔🎆 --> 🔥🚀🚀🚀🌙-->🍗🍗🍗",
    "title": "\"Erasing The Tape\" - How to Remove Daily Trade Volume and Why it Matters",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oj1tjl/erasing_the_tape_how_to_remove_daily_trade_volume/"
}