{
    "author": "Daweism",
    "created_utc": 1626131518.0,
    "distinguished": null,
    "edited": 1626136215.0,
    "id": "oj2x92",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oj2x92",
    "num_comments": 156,
    "permalink": "/r/Superstonk/comments/oj2x92/the_deep_out_of_the_money_puts_2_judgment_day/",
    "score": 1876,
    "selftext": "&#x200B;\n\n[DFV Arriving from the future sent back by R.C.](https://preview.redd.it/4szp0dqt4va71.png?width=449&format=png&auto=webp&s=378371c27a366b89a9e41aa741fccd79517341d3)\n\nHey apes, I've been reading into ***FINRA's Regulatory Notice 21-24*** and I feel like there's a huge piece of the puzzle that people are glancing over. Happy to talk about any oversights or oversteps of my analysis to make sure this is spot on.\n\nEveryone keeps pointing to the impact on short sales, but this feels SO MUCH BIGGER than the short sale stuff. My interpretation is that this actually closes the loop on the married call/put issue, effectively neutering it, which is AMAZING NEWS for the apes.\n\n\\---\n\n**TLDR**: **The rule clarifications (effective immediately), if enforced (and that's a big IF) could lead directly to the end game, potentially getting the party started (assuming this is all enforced) at the most appropriate time: the start of MoonJam. The changes mean it will be physically impossible for the hedgies to kick the can down the road via** ***OTM*** **puts anymore due to the steep margin requirements to initiate a transaction.**\n\n[Hasta la vista baby.](https://preview.redd.it/h76gkb3n4va71.png?width=500&format=png&auto=webp&s=fff86a70cdac503900b24bb33597153af38b01a1)\n\n**---**\n\nLet's start at the beginning, which is actually the end. People keep getting stuck on $2,000, probably because the rules keep referencing it. Let's look at Endnote 1 though regarding what the initial margin requirement actually is on which they are offering a clarification:\n\n>Rule 4210(b) requires a customer to deposit margin in cash or securities, which shall be **at least the greater of**: (1) the amount specified in Regulation T, or Rules 400 through 406 of SEC Customer Margin Requirements for Security Futures, or Rules 41.42 through 41.49 under the Commodity Exchange Act (CEA); (2) the amount specified in paragraph (c) of Rule 4210 (the maintenance margin requirements); (3) **such greater amount as FINRA may from time to time require for specific securities**; or (4) **equity of at least $2,000** except that cash need not be deposited in excess of the cost of any security purchased (this equity and cost of purchase provision shall not apply to \"when distributed\" securities in a cash account). The minimum equity requirement for a \"pattern day trader\" is $25,000 pursuant to paragraph (f)(8)(B)(iv)a. of the rule.\n\nMy interpretation (which is not financial advice...I'm just an ape who used to read/decipher financial legalese for a living but is still a smooth brain whose words should be taken with a grain of salt) is that $2,000 is the FLOOR, and the only \"known\" number used because everything else has some level of subjectivity or specificity. IMO, they keep using $2,000 in the clarification text because it's shorthand for \"whichever value is highest of the 4 options.\" That's what we used to call \"capturing the spirit of the text\" back in my MBA program. My two primate cents.\n\nLet's explore option 3 though, and see if FINRA made any specific requests for margin requirements on particular securities. OH YEA, THEY DID:\n\n>**/021 Minimum Equity**\\[Omitted 1-4\\](5) **Even if the resulting equity is less than $2,000**, the minimum equity requirement **with respect to the sale of an option** in the account would be satisfied by the **deposit into the account or under an escrow agreement** (as defined in Rule 4210(f)(2)(A)(xiv)) of:(A) **cash sufficient to satisfy the customer’s payment obligation** upon the assignment of the options **if it is a put**; or(B) **fully paid securities sufficient to satisfy the customer’s delivery obligation** upon the assignment of the option **if it is a call**;\\[Omitted (b) \\]\n\n&#x200B;\n\n[I need your FTDs, your Shorts, and your OTM Puts.](https://preview.redd.it/eteas7406va71.png?width=584&format=png&auto=webp&s=84977758d37dff17db8d4baea809228f04e678ae)\n\nSo now it looks like opening a put requires posting cash to satisfy a payment obligation and opening a call requires posting the fully paid security. THIS IS INSANE. THIS IS NOT $2,000...it is MUCH GREATER. What I think this means is that if they want to execute a married call/put option trick, they will be subject to both of these margin requirements on execution of the trade.\n\nIf I understand the mechanics correctly (and I may not...please, wrinklier ones, chime in), that means that for a put they need to post the difference on trade execution between the current fair value and the strike price for the entire transaction - the potential loss. Going off of the $0.50 and $1.00 strike trades expiring this Friday, that accounts for 178,936 contracts that will need to be renewed to cover the FTDs and kick the can down the road. If they wanted to roll them, it would be roughly a $200 difference...that's like $3.6 BILLION. And that's not even touching the call...the call half of the trick would require the FULLY PAID SECURITY.\n\nNow say there was an expected event in the near future when a new call would need to be made \\*cough cough 7/16 option expiration cough\\*, in order to open a new call contract to cover up some FTDs, if my understanding is correct, they would need to post 17,893,600 fully paid shares of GME as collateral. THAT'S INSANE, and IMPOSSIBLE with all us diamond handed apes hodling our moon tickets.\n\nOn top of this, there's this gem:\n\n>**/022 Effect of Market Value Decline Below $2,000 Equity**If the equity in a margin account falls below $2,000 because of a decline in the market value of the security positions in the account **and no new commitments are made**, no deposit or liquidation is necessary. **For the purpose of this Rule, a same-day substitution constitutes a new commitment**.\n\nhttps://preview.redd.it/7sbnge4m7va71.png?width=457&format=png&auto=webp&s=d78dcf5f2f4c3d429e7ad92ba03a021bdd699583\n\nWhile it may look like hedgies are safe if their collateral value drops, that's ONLY if they make no new commitments, and it is specifically called out that a substitution, i.e. rolling options, counts as a new commitment. This precludes them from the no-deposit-and-no-liquidation clause. If they try to roll the 7/16 expiring options, they will not be safe.\n\nThe fact that this is happening right before this massive OTM put expiration makes this giddy ape think the start of the MOASS is right around the corner. With the daily collateral checks, and options expiring at EOD Friday, this makes me think that the first check that would show an issue would be after one full trading day when these contracts have already expired. That would be Monday, meaning the check that counts would be...Tuesday. MoonJam Launch Day. Buckle Up.\n\nSorry for adding the date, but hot damn...7/16 is already hyped enough, what's a little more hype, amirite?\n\n**Other TLDR for those who scroll first**: Hedgies are fuk beyond belief. If this rule is actually enforced, it would seem they cannot continue to carry out the married call/put option trick to kick the can down the road, and the FTDs will start piling up in the millions after the 7/16 option expiration. MusicStop. GameStop.\n\n&#x200B;\n\n[Buy and Hodl](https://preview.redd.it/jdnx33v86va71.png?width=487&format=png&auto=webp&s=360d9f6d57587ef8d236d7bb1688b6c83baa5faf)\n\n&#x200B;\n\nBonus meme:\n\nhttps://preview.redd.it/29le71ebkva71.png?width=486&format=png&auto=webp&s=52d502fac0631742799b159995ff7a40f96b806e",
    "title": "The Deep Out of The Money Puts 2: Judgment Day (FINRA 21-24 Analysis)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/oj2x92/the_deep_out_of_the_money_puts_2_judgment_day/"
}