{
    "author": "Noderpsy",
    "created_utc": 1616362651.0,
    "distinguished": null,
    "edited": 1616379790.0,
    "id": "ma6tbq",
    "text_only": true,
    "flair_id": "67db277a-6e3d-11eb-91b6-0e101d88f509",
    "flair_text": "Hedge Fund Tears",
    "name": "t3_ma6tbq",
    "num_comments": 620,
    "permalink": "/r/GME/comments/ma6tbq/reddit_apes_inadvertently_exposed_a_loophole_in/",
    "score": 15315,
    "selftext": "Money Makers like Shitadel and Co have been abusing their ability to synthetically manipulate stock prices amidst the broader overall market for years, and they finally got caught on fucking Reddit of all places.\n\nThe free dissemination of information provided in forums like this are Kryptonite for hedge funds and abusive traders.  I can't even begin to imagine the money that has, and is currently being spent to discredit, and if possible even shut down these types of sites.\n\nYOU, dear Redditor, are on the precipice of what could be the single most damaging financial miscalculation that big money has ever made, and it's likely that half of you still have no idea what/why or how any of this really happened, and that's what makes this so funny.\n\nThey have NO FUCKING IDEA WHAT ANYONE IS DOING because likely half of everyone with shares is just SCREECHING like a god damned monkey and throwing shit at them without rhyme or reason, and the other half is absolutely ass blasting them with damaging DD and targeted memes.\n\nWhatever happens, this is the most interesting social/financial experiment of modern times, and this FUD could very quickly turn into FUBAR.\n\n&#x200B;\n\nEDIT: Because this blew up, and because F in the chat for the bad hedgies, be advised: WRINKLE BRAIN APES KNOW WHAT'S UP.  GIVING APES BORROWED SHARES SO YOU DON'T HAVE TO BUY FROM THE MARKET AND MOVE THE PRICE is some BAD MONKEY BULLSHIT. All the ETFs and other bullshit being used just kicks the FTD can down the line. You know it.  The SEC knows it.  Creepy Uncle Ken knows it.  And now it looks like CONGRESS KNOWS IT.  VLAD WAS A SACRIFICIAL GOAT and it didn't work.  THE T-REX IS OUT OF THE CAGE and now they are the guy that runs to the bathroom and gets his head bitten off on the toilet.",
    "title": "Reddit apes inadvertently exposed a loophole in the financial system. The squeeze will NOT be televised. This website scares them and it's hilarious.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/ma6tbq/reddit_apes_inadvertently_exposed_a_loophole_in/"
}