{
    "author": "kevykev89",
    "created_utc": 1628257533.0,
    "distinguished": null,
    "edited": 1628260330.0,
    "id": "oz6xzm",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oz6xzm",
    "num_comments": 215,
    "permalink": "/r/Superstonk/comments/oz6xzm/with_the_new_1t_capital_requirements_for_the_big/",
    "score": 2857,
    "selftext": "\\*I'm a dude, He's a dude, She's a dude, We're all dudes HEY!\\*\n\nOh! Welcome to Good Burger home of The Good Burger can i take ya orrder?  Dude. We gotta talk about this stress test! Remember, back in March before the Quad Witching :( R.I.P. that it was a pretty big deal and we had hoped it was gonna light the boosters? Well, I know i forgot about it until reading about the new required $1 TRILLION Net Capital Requirement for all DFAST firms. Lets kick it together for a bit and lemme talk to ya. Its....well something.\n\n# TLDR: Fed tells 23 Banks \"No Bailout. Eff you, brew coffee at home.\"\n\n\\*Note: There were 2 specific types of tests. One being Baseline and the other being Severely Adverse. For the sake of our beloved GME and her -Beta....this is the big owie.\n\nSo!! Im gonna hop out the Strawberry Milkshake Jacuzzi and break this down real quick.\n\nhttps://preview.redd.it/pl7plqyceqf71.png?width=2346&format=png&auto=webp&s=0baccb0e78992038910a29661d9d69650b96f222\n\n^(Also remember i have NO FUCKING CLUE wtf im talking about! So this whole thing should be added upon and dissected and if its not up to par...well you can type so you do it next time <3)\n\n^(-----------------------------------------------------------------------------------------------------------------------------------------------------)\n\n# Stress Test.\n\nThink of it as a Madden 21 Season Sim...they Sim an EXTREME market event and base it over 9 quarters. (Thats 2 years and 3 months, I can smell the smoke from your ears from here. Dont hurt yourself <3)\n\nSo i copied this directly from The Fed: [https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-scenarios.htm](https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-scenarios.htm)\n\n>These scenarios were developed using the approach described in the Board's Policy Statement on the Scenario Design Framework for Stress Testing.[10](https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-scenarios.htm#f10) The severely adverse scenario is **not a forecast but rather a hypothetical scenario** designed to assess the strength of banking organizations and their resilience to an unfavorable economic environment.  \n>  \n>The DFAST 2021 supervisory scenarios include trajectories for 28 variables. These include 16 variables that capture economic activity, asset prices, and interest rates in the U.S. economy and financial markets, and an additional three variables (real GDP growth, inflation, and the U.S./foreign currency exchange rate) for each of four foreign country blocs.  \n>  \n>In 2021, the Federal Reserve applied a global market shock to the trading and private equity portfolios of 10 firms with large trading exposures and a largest counterparty default (LCPD) scenario component to 12 firms with substantial trading, processing, or custodial operations (see \"[Global Market Shock and Counterparty Default Components](https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-scenarios.htm#xsubsection-164-ca57c66c)\").\n\nOk. Pretty self explanatory, but Kev, WTF is DFAST? Glad you asked ape!\n\n[DFAST the 23 largest banks. This is kinda a spoiler but Im already typing too much and i aint bout to type em all out for the sake of surprise. Dey Fukt ](https://preview.redd.it/5mfcc6aqfqf71.png?width=2671&format=png&auto=webp&s=30b92f606c9ea495be7fc61f80de340ab03c54e8)\n\nWell...not all are fukt...some...a couple...well we will see really. IMO yes, its big to know who to buy Puts on, but...GME gets my dollars and Fidelity \\*gush\\* I Love You Bae! Also...I think in this instance WHICH I COULD BE WRONG! talking about the players is the symptoms and not the disease.\n\n# The Disease.\n\n&#x200B;\n\n[Dems some big ole pie pieces.....](https://preview.redd.it/46jubjc7hqf71.png?width=1501&format=png&auto=webp&s=3f47a6ed31ce52f1fe8aae1cb8e283e55e8f3b01)\n\nHere we see what all 23 are at risk of losing where. Its a collective the Billions they stand to lose if this \"Severe\" scenario was to pan out. Thats Pre-Provision Net Revenue or PPNR. The PPNR is defined as:\n\n>PPNR projections **are driven by the shape of the yield curve, the path of asset prices, equity market volatility, and measures of economic activity in the severely adverse scenario**. In addition, PPNR projections incorporate expenses stemming from estimates of elevated levels of losses from operational-risk events such as fraud, employee lawsuits, litigation-related expenses, or computer system or other operating disruptions.[45](https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-stress-test-results-severeley-adverse-scenario.htm#f45) In the aggregate for the 23 firms, operational-risk losses are $151 billion for DFAST 2021. This amount is slightly higher than the $136 billion projected for the same set of firms in DFAST 2020.\n\nCool! With the way the market is \"Frothy\" right now, it makes sense to have a couple extra dollars in the kitty. Better play it smart right?\n\n[Across ALL 23 firms...if this scenario plays out..$-34.4B. Uh wha?!?!?! Note this is before taxes. \\*Is this meant to be taken as a +$34.4B since its before because....](https://preview.redd.it/d51mg5sqmqf71.png?width=2657&format=png&auto=webp&s=dedae07291bf14422af80fd2db5716bf182dfe45)\n\n[Im going to assume this is AFTER taxes...and One should not be net positive after paying taxes ](https://preview.redd.it/mnq89uxapqf71.png?width=2667&format=png&auto=webp&s=90020ccd4d1b7113b29555efe30c0ecf99009841)\n\nNeedless to say....The Fed is saying \"Yo! Dawg!!! You better habe enough capital to not only deal with these losses, but to not only continue business as usual, but have a metric shit ton of capital in reserve because the Roomba is about to track dog shit ALL through the house and you are NOT getting bailed out again!\"\n\nI dont support The Fed. Boy do i have some strong opinions about them, but like B-holes...everyone has one and they all stink. I could go super deep into explaining, but apes dont read, ergo the pretty pictures with all our favorite names on them. I'm going to leave one last chart....\n\n&#x200B;\n\n[I didnt graduate....](https://preview.redd.it/f4m78xkvqqf71.png?width=1350&format=png&auto=webp&s=443dce11df5a387fefb721d08cc63cf7e838f6ac)\n\nFull Results: [https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-stress-test-results-severeley-adverse-scenario.htm](https://www.federalreserve.gov/publications/2021-june-dodd-frank-act-stress-test-supervisory-stress-test-results-severeley-adverse-scenario.htm)\n\n\\*please keep in mind I wanted to keep this as short as possible\n\n&#x200B;\n\nEDIT: Was asked about current Capital Requirements:\n\n \n\n**(1)** A national [bank](https://www.law.cornell.edu/definitions/index.php?width=840&height=800&iframe=true&def_id=1b4e13db0fedfcf4130540b3d34ef442&term_occur=999&term_src=Title:12:Chapter:I:Part:3:Subpart:B:3.10) or [Federal savings association](https://www.law.cornell.edu/definitions/index.php?width=840&height=800&iframe=true&def_id=6cd390d0cb51a795dc83981df8eb4129&term_occur=999&term_src=Title:12:Chapter:I:Part:3:Subpart:B:3.10) must maintain the following minimum capital ratios:\n\n**(i)** A common equity tier 1 capital ratio of 4.5 percent.\n\n**(ii)** A tier 1 capital ratio of 6 percent.\n\n**(iii)** A [total capital](https://www.law.cornell.edu/definitions/index.php?width=840&height=800&iframe=true&def_id=59c1565c093378a0ad6d8caf451b2a87&term_occur=999&term_src=Title:12:Chapter:I:Part:3:Subpart:B:3.10) ratio of 8 percent.\n\n**(iv)** A leverage ratio of 4 percent.\n\n[https://www.law.cornell.edu/cfr/text/12/3.10](https://www.law.cornell.edu/cfr/text/12/3.10)\n\nF in the chat",
    "title": "With The New $1T Capital Requirements For The Big Banks, We Should Talk About The Stress Test And I Dont Think The Fed Is Eff'n Round..",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oz6xzm/with_the_new_1t_capital_requirements_for_the_big/"
}