{
    "author": "SnapOnSnap0ff",
    "created_utc": 1618802716.0,
    "distinguished": null,
    "edited": 1618808502.0,
    "id": "mts2y6",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_mts2y6",
    "num_comments": 560,
    "permalink": "/r/Superstonk/comments/mts2y6/what_part_about_not_fucking_dancing_arent_some_of/",
    "score": 9061,
    "selftext": "[This shit right here](https://www.reddit.com/r/Superstonk/comments/mtnzih/since_citadel_has_been_working_over_the_weekend_i/?utm_medium=android_app&utm_source=share), this we dont need.\n\nThe subs and GME holders dont need this type of attention. Its bad enough we already have and will have the media painting us as the bad guys in all of this, we dont need to prove them right. Honestly the weekend is so slow for some of you that you feel inclined to do shit like this? It paints us ALL in a bad light. This behaviour is NOT the way.\n\nWhat part of DONT. FUCKING. DANCE are some of you forgetting?? We havent won yet. We havent even started the full on squeeze yet. Some of you need to remember that this isnt over, and despite how harmless it all seems, they will certainly find a way to push it under harassment, once again, not the attention apes want or need, especially now.\n\nWe have people droning around their offices, sending \"gift baskets\" with the intent to mock (even playfully) and video/photographing every angle of their buildings. TWO WRONGS DONT MAKE A RIGHT, WE ARE BETTER THAN THIS. They may have mocked us during the crash, but we shouldn't do the same. We need to prove we are better. We need to BE better.\n\nSit in your corner, read your DD, keep your eyes on the prize and for GMEs sake, STOP FUCKING DANCING\n\n\nEDIT: This is gaining hella traction, please let me elaborate further.\n\nIm NOT saying that these posts should be banned, nor should the hype be killed (which sounds shilly to me, look around, theres more hype than ever and its not going away).\nWhat im saying is, GME is against people who dont want to be crossed. People who haven't been crossed, and have never lost everything or anything. They have money, lots of it. Lawyers, lots of them. Good ones. Qualified ones. They CONTROL media.\n\nLike it or not, to them, we arent the individuals making our own decisions like we know we are. To them we are a collective and we are WE. Please understand that the things you do as an individual do effect ALL APES because thats how it will be portrayed. They didnt say GME was up $30, they said it was down over 50% of peak. \nTHEY WILL NOT SAY INDIVIDUALS HARASS HEDGEFUNDS. THEY WILL SAY WE HARASSED them.\n\nthere is no we, but thats not their agenda.\n\n\nStay healthy, stay HYPED AND JACKED, and stay rational. TO THE MOOONN 🚀🚀🚀🚀🚀🚀🦍💎🤲🤲🤲🍌🍌",
    "title": "What part about not fucking dancing arent some of you getting?",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/mts2y6/what_part_about_not_fucking_dancing_arent_some_of/"
}