{
    "author": "Inkapacitated",
    "created_utc": 1627947838.0,
    "distinguished": null,
    "edited": 1627961679.0,
    "id": "owqyl2",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_owqyl2",
    "num_comments": 64,
    "permalink": "/r/Superstonk/comments/owqyl2/divergence_update_mother_of_all_divergence_on_the/",
    "score": 816,
    "selftext": "Yes Sir! 6 different indicators are calling Bullish Divergence on the Daily GME chart. This is only the 3rd Bullish Divergence since January on the Daily Chart and points to a strong trend reversal.\n\n&#x200B;\n\n[6 Indicators are saying \\\\\"WTF! Is this Real Life!?!\\\\\"](https://preview.redd.it/0anhfmgyb1f71.png?width=696&format=png&auto=webp&s=1a589030b9e2c8314ed6be15dd58170d08c5f03a)\n\nJust a brief summary of what is divergence:  Divergence is a popular concept in technical analysis that describes when the price is moving in the opposite direction of a technical indicator.  Each type of divergence will contain either a **bullish bias** or a **bearish bias.**\n\n[Bullish Divergence warns of trend reversals to the upside when there is a disturbance in the force.](https://preview.redd.it/5bw2al4u21f71.png?width=925&format=png&auto=webp&s=570680aac685b85191bc2539dc5cc78bb922f476)\n\nWhile divergences can occur between price and any other piece of data, they are most commonly used with technical indicators especially with **momentum oscillators.** \n\nThe last time I updated you all in Mid July we had a strong Bullish Divergence to the upside (green line below) and we did in fact have a small run before the price started to dip again. The upward momentum was snuffed out with heavy shorting. This was only on two indicators calling divergence the MACD Histogram and Stochastic Indicators.\n\n&#x200B;\n\n[My post from mid July warning the price was going to run up.](https://preview.redd.it/uz1hs7oa31f71.jpg?width=1363&format=pjpg&auto=webp&s=dc3450e6766a35d1e464057c2050594b0387e2a9)\n\n&#x200B;\n\n[We had a small run after the mid July Divergence, but it was a false break of the trend.](https://preview.redd.it/u3au3guv31f71.png?width=272&format=png&auto=webp&s=15a86da9612813e2c6c1ace09305ea491c777461)\n\n&#x200B;\n\nSo what do we have as of today on the Daily Chart? Nothing more then 6 indicators calling Bullish Divergence! This means a trend reversal is imminent and if the hedgies keep shorting it will only get stronger and we can expect a violent push up to a whole new wealth class. Note: This divergence is the strongest we have seen since May 2019.\n\n&#x200B;\n\n[Bullish Divergence on the RSI. MACD Histogram, Momentum, Stochastic, Diosc, MFI Indicators!](https://preview.redd.it/ticqf7b451f71.png?width=1353&format=png&auto=webp&s=8ec9b777d6b22e9b2a225217ed5dfbeff880d9c5)\n\nTLDR: Bullish Divergence says I'm Rich Bitch!\n\nNote: I am using the Divergence for Many Indicator to plot the divergences, there are too many to show on a single image. This indicator in Trading View searches through over 10 different indicators for bullish and bearish divergence. The Green Lines are Bullish divergence and the red lines are Bearish divergence.",
    "title": "Divergence Update: Mother of all Divergence on the Daily Chart, 6 Indicators warning of trend reversal. To the F**ken Moon Boyz!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/owqyl2/divergence_update_mother_of_all_divergence_on_the/"
}