{
    "author": "StonkyFarts",
    "created_utc": 1616788202.0,
    "distinguished": null,
    "edited": false,
    "id": "mdwu8v",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_mdwu8v",
    "num_comments": 66,
    "permalink": "/r/GME/comments/mdwu8v/citadel_and_virtu_own_s3_partners_so_stop/",
    "score": 633,
    "selftext": " Re-post from January.\n\nFuck your grammar criticism, I'm dumb and my fingers hurt. Yes, I know it's a new account. I was a lurker until this thing. Can someone put this on the original WSB as well? It keeps getting blocked.\n\nThere are two parts to this. First, I will start with what I found with media as it tells how I came to the heavy info, then I’ll get into the heavy stuff with the actual crime. I have copies of all the documents, but have included links for where I found most of this info.\n\n**1.** **Media**\n\nWhile trading during the GME short-squeeze, I was wondering why CNN and CNBC cared so much about the Reddit/WallStreetBets and Gamestop frenzy, so I started digging into official business registrations and ownership records.\n\nReddit/WallStreetBets got spammed with discouraging bots and algorithms during trading, and the theory was Hedge funds were doing this to read our posts for momentum knowledge.\n\nNaomi M. Bergman is the **Senior Executive for Advanced Publications**. Advanced Publications is the **majority shareholder of Reddit**. Here's the connection... The same **Reddit majority shareholder exec is on the board of directors for comcast (owns CNBC).**\n\n**Weird how CNBC Reddit stories were so in-depth about Reddit and the bots got crazy pushing the narrative that CNBC was lying about!**\n\nAs for CNN, Richard W. Fisher is a senior advisor to **Barclay (dark pool trader of GME)** and board of directors of **AT&T (owns CNN) and also a senior contributing editor of CNBC.**\n\nScott T. Ford AT&T (**owns CNN) board of director and worked at**  **Merrill Lynch**  **(another dark pool).**\n\n**All of this got me curious, so I started looking more. Here’s the heavy part…**\n\n**2.** **S3 Partners, Citadel, VIRTU and other Hedge Fund trading during a unlawful media campaign.**\n\nI started noticing that **S3 Partners**, a notorious advisory group for Wall Street was suddenly very vocal about narrating the story of Gamestop. I also noticed most of the CNBC and CNN articles used S3 Partners data in their stories. Also, retail traders on Reddit/WallStreetBets and everywhere use their date during due diligence and strategic investment planning. So I started looking at them through SEC documents, corporation filings, and audit trails (publicly available). This is what I found in only a couple hours….\n\nS3 securities was a subsidiary of S3 partners and partially owned by Knight Capital Group\n\n2013 KCG and Getco merged to form KCG Holdings\n\nKCG has 75% indirect interest ownership of all of Virtu holdings\n\nKCG turns into VIRTU KCGM\n\nVirtu KCGM was one of the dark pool traders\n\nVirtu bought KCG programs in 2011\n\nCitadel bought S3 Partner data and services in 2013\n\nKCG was bought by Citadel in 2016\n\nCitadel bailed out Melvin Capital on GME and is the biggest financial supporter of RobinHood, through paying RobinHood for retail trade data.\n\nCitadel (bought S3/KCG and the S3 data and services) gave Melvin Capital money to cover shorts while stopping RobinHood retail traders long enough for Melvin to get out. During this, S3 Partners’ fake “data” (owned by Citadel and Virtu and who knows who else) is used to posture a media campaign to discourage firms and retail traders from increasing the damage done to all of the Hedge Funds involved. The Stock market was also manipulated by the dark pool traders using their shares to trick algorithms into displaying numbers suitable for the Hedge Funds. S3 Partners controlled the narrative on this as well as being one of the traders through parent ownership.\n\nThe KCG that turned into Virtu KCG (Dark Pool GME) has traded BATS while serving in roles requiring financial disclosures.\n\nThe following positions have been held: Insider 2016 at Bats Global Markets, Inc.\n\nBats GM is owned by CBOE, who also owns BIDS ATS (another dark pool)\n\n**Dark pool traders related to S3 for a MINIMUM of 445,660 shares of GME traded 1,479 times in a single week between dark pool networks (this was original found in January. I'm sure it's in the Billions now)**\n\n**3.** **About S3 Partners**\n\nFounded in 2003, S3 Partners is a financial technology company. Professional clients use our software, data and analytics for better self-directed outcomes in their investment processes, risk management, counterparty relationships, and investor relations.\n\nWhat makes S3 unique is our ability to drill into data on $2 trillion in daily financial transactions and distill actionable analytics, like short interest insight and market research. That’s why S3’s analytics are regularly referenced by over 100 media outlets, including The New York Times, Bloomberg, Business Insider, and many more. In addition, S3’s BLACK APP, is the best-selling app on the Bloomberg Terminal.\n\nS3 Securities was partner owned by Knight Capitol Group, who merged with Getco in 2013 to form KCG Holdings. KCG Holdings became Virtu KCG Holdings. Virtu KCG holdings was a dark pool trader of GME.\n\n4. Notes\n\n[https://www.reuters.com/article/us-usa-stocks-probe-exclusive/exclusive-u-s-investigates-market-making-operations-of-citadel-kcg-idUSKCN0Y11CJ](https://www.reuters.com/article/us-usa-stocks-probe-exclusive/exclusive-u-s-investigates-market-making-operations-of-citadel-kcg-idUSKCN0Y11CJ)\n\nJustin Waldie = KCG and Virtu Exec\n\nHoward Sugarman is Managing director of Compliance at S3 and also was the owner of S3 Securities (subsidary of S3 Partners).\n\nADV Page.9 S3 Strat LLC\n\nADV Page.15 KCG\n\n[https://archives.fbi.gov/archives/sanfrancisco/press-releases/2012/founders-of-s3-partners-charged-in-21-million-real-estate-investment-fraud-scheme](https://archives.fbi.gov/archives/sanfrancisco/press-releases/2012/founders-of-s3-partners-charged-in-21-million-real-estate-investment-fraud-scheme)\n\n[https://adviserinfo.sec.gov/firm/summary/137091](https://adviserinfo.sec.gov/firm/summary/137091)\n\n[https://reports.adviserinfo.sec.gov/reports/ADV/137091/PDF/137091.pdf](https://reports.adviserinfo.sec.gov/reports/ADV/137091/PDF/137091.pdf)\n\n[https://en.wikipedia.org/wiki/Knight\\_Capital\\_Group](https://en.wikipedia.org/wiki/Knight_Capital_Group)\n\n[https://en.wikipedia.org/wiki/KCG\\_Holdings](https://en.wikipedia.org/wiki/KCG_Holdings)\n\n[https://wallstreetonparade.com/2021/01/gamestop-shares-dark-pools-owned-by-goldman-sachs-jpmorgan-ubs-et-al-have-made-tens-of-thousands-of-trades/](https://wallstreetonparade.com/2021/01/gamestop-shares-dark-pools-owned-by-goldman-sachs-jpmorgan-ubs-et-al-have-made-tens-of-thousands-of-trades/)\n\n[https://sec.report/Document/0000950123-19-009321/](https://sec.report/Document/0000950123-19-009321/)\n\n[https://sec.report/CIK/0001300764](https://sec.report/CIK/0001300764)\n\n[https://www.ft.com/content/e1cb396e-29a7-11e7-bc4b-5528796fe35c](https://www.ft.com/content/e1cb396e-29a7-11e7-bc4b-5528796fe35c)\n\n[https://financialpost.com/investing/knight-capital-spurns-us500-million-rescue-from-citadel-sources](https://financialpost.com/investing/knight-capital-spurns-us500-million-rescue-from-citadel-sources)\n\n[https://www.thetradenews.com/kcg-sells-nyse-market-maker-to-citadel/](https://www.thetradenews.com/kcg-sells-nyse-market-maker-to-citadel/)\n\n[https://www.marketscreener.com/quote/stock/THE-CITADEL-GROUP-LIMITED-18521363/news/Exclusive-U-S-investigates-market-making-operations-of-Citadel-KCG-22329549/](https://www.marketscreener.com/quote/stock/THE-CITADEL-GROUP-LIMITED-18521363/news/Exclusive-U-S-investigates-market-making-operations-of-Citadel-KCG-22329549/)\n\n[https://ir.virtu.com/press-releases/press-release-details/2017/Virtu-Financial-Inc-Completes-Acquisition-of-KCG-Holdings-Inc/default.aspx](https://ir.virtu.com/press-releases/press-release-details/2017/Virtu-Financial-Inc-Completes-Acquisition-of-KCG-Holdings-Inc/default.aspx)\n\n[https://www.cnbc.com/2021/01/27/hedge-fund-targeted-by-reddit-board-melvin-capital-closed-out-of-gamestop-short-position-tuesday.html](https://www.cnbc.com/2021/01/27/hedge-fund-targeted-by-reddit-board-melvin-capital-closed-out-of-gamestop-short-position-tuesday.html)",
    "title": "Citadel and Virtu own S3 Partners so stop believing them!!!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mdwu8v/citadel_and_virtu_own_s3_partners_so_stop/"
}