{
    "author": "Lohe1234",
    "created_utc": 1616737712.0,
    "distinguished": null,
    "edited": 1616739960.0,
    "id": "mdhtsr",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mdhtsr",
    "num_comments": 163,
    "permalink": "/r/GME/comments/mdhtsr/i_have_been_doing_some_sec_digging_on_purposed/",
    "score": 5445,
    "selftext": "First one to include dark pools in the bid/ask exchange pricing! \n\n\nhttps://www.federalregister.gov/documents/2021/02/08/2021-02465/self-regulatory-organizations-nyse-american-llc-notice-of-filing-of-proposed-rule-change-to-amend\n\n\nSelf-Regulatory Organizations; NYSE American LLC; Notice of Filing of Proposed Rule Change To Amend Rule 970NY and Rule 970.1NY To Eliminate the Use of Dark Series on the Exchange\n\n\nThe Exchange also believes that the proposed discontinuation of its suppression of quotes in dark series would increase transparency and enhance price discovery. Specifically, as proposed, all Market Maker quotes (including in “inactive series” under the current Rule) would be displayed and reflected in the market to the benefit of all market participants who would be on notice of such liquidity. The Exchange also notes that, over the years, certain market participants have expressed confusion regarding what quotes are being published and which are being suppressed. Therefore, the Exchange believes that the proposal would remove the element of potential confusion among market participants by publishing all quotes (not just those in active series) in the disseminated quote feed.\n\n\n\nThis rule was setup to get approved/denied or wait period extended. \n\n\nThe Commission is extending the 45-day time period for Commission action on the proposed rule change. The Commission finds that it is appropriate to designate a longer period to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change. Accordingly, pursuant to Section 19(b)(2) of the Act,[5] the Commission designates May 9, 2021 as the date by which the Commission should either approve or disapprove, or institute proceedings to determine whether to disapprove, the proposed rule change (File No. SR-NYSEAMER-2021-05).\n\n\nNext up\n\nSelf-Regulatory Organizations; MIAX PEARL, LLC; Notice of Filing and Immediate Effectiveness of a Proposed Rule Change to Adopt a Minimum Execution Quantity Instruction for Orders\n\nhttps://www.federalregister.gov/documents/2021/03/19/2021-05674/self-regulatory-organizations-miax-pearl-llc-notice-of-filing-and-immediate-effectiveness-of-a\n\n\nRule to make it so institutional large order can still be easily made without the use of dark pools\n\n\n\nNext up if you haven’t seen those posts of the huge orders in the TOS order book. This might explain part of it. \n\n\nhttps://www.federalregister.gov/public-inspection/2021-06233/self-regulatory-organizations-proposed-rule-changes-cboe-futures-exchange-llc\n\nhttps://public-inspection.federalregister.gov/2021-06233.pdf\n\n\nCFE proposes to add new Section U to P&amp;P XVIII to specifically reference two examples of practices that are prohibited by new Rule 620(b)(iv). In particular, CFE proposes to add new Section U of P&amp;P XVIII, which will provide that (1) engaging in a pattern and practice of submitting partial messages for the purpose of seeking to reduce latency has the potential to disrupt the systems of the Exchange; (2) purposefully corrupting or constructing malformed data packets also has the potential to disrupt the systems of the Exchange; and (3) the Exchange considers any market participant engaging in either of these practices as part of a trading strategy to have recklessly disregarded the potential to disrupt the systems of the Exchange in violation of new Rule 620(b)(iv).\n\n\n\nThe second proposed example includes the following fact pattern: A market participant engages in a trading strategy where the market participant’s trading system is designed to purposefully send to the Exchange untradeable orders or orders that have no reasonable probability of trading. For example, prior to the occurrence of an event or signal, the market participant’s trading system begins transmitting to the Exchange data necessary for an order message (e.g., Ethernet frame; TCP packet; etc.). The trading system is designed so that if the event or signal does not occur as expected, the trading system will complete the partially transmitted data and successfully submit an order message to the Exchange. However, because the event or signal did not occur as expected, the trading system is designed to render the completed order message untradeable or improbable of trading. This may be accomplished, for example, by submitting the order message as a fill or kil order type with a price or quantity that causes the order to immediately be cancelled by the trading platform. This may also be accomplished, for example, by submitting the order message at an off-market price, deep in the order book, and intending to cancel that order prior to execution.\n\n\n\nThe second proposed example includes the following fact pattern: A market participant engages in a trading strategy where the market participant’s trading system is designed to purposefully send to the Exchange untradeable orders or orders that have no reasonable probability of trading\n\n\nThe proposed rule change is consistent with similar updated guidance provided by other designated contract markets (“DCMs”) regarding disruptive practices.3 The Exchange believes that aligning its guidance regarding disruptive trading practices across DCMs where appropriate protects the Exchange, investors, and the public interest by promoting uniform expectations among market participants regarding disruptive trade practices.\n\n\n\n\n\n\n\nTL:DR\n\nSEC trying to make more transparency. \nDark pool Info won’t be so dark. \n\nAnd new rules for sending in bogus orders to try and manipulate the price.\n\n\n🧐🍌🍌🍌🍌🚀🚀🚀🚀🌕\n\nOh and you can get documents here before the SEC publishes them. \n\nhttps://www.federalregister.gov/agencies/securities-and-exchange-commission\n\n“This document is unpublished. It is scheduled to be published on 03/26/2021.\n\nOnce it is published it will be available on this page in an official form. Until then, you can download the unpublished PDF version.”",
    "title": "I have been doing some SEC digging on purposed rules changes. Holy crap big stuff in the works! Looks like they are coming in to lay the smack down on these hedges. Melvin and friends probably shitting themselves.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mdhtsr/i_have_been_doing_some_sec_digging_on_purposed/"
}