{
    "author": "JustBeingPunny",
    "created_utc": 1619891644.0,
    "distinguished": null,
    "edited": 1619896003.0,
    "id": "n2nhgw",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n2nhgw",
    "num_comments": 128,
    "permalink": "/r/Superstonk/comments/n2nhgw/ftds_naked_shorting_borrowing_shares_every_day/",
    "score": 2313,
    "selftext": "**TL;DR: HFs are naked shorting GME over and over. They are failing to deliver, which forces the NSCC to borrow shares from other participants to ensure the trade is completed by T+3. This is why you see shares disappear each day. It's not HFs, it's the NSCC borrowing them to ensure the trade is completed for buyers.**\n\n**The HFs are forcing the NSCC to borrow the shares to complete the trades and this is why the borrow rate is so low.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nWell I say. Some of the DD out there is getting real wrinkly and I'm starting to think people are losing track of what's going on. I will not be going into options (yet). I'd love for Queen Kong to review this and make sure I got it right...so get her here!\n\nTHIS IS A BIG OL READ BUT IT'S APED DOWN. It's easily digestible for even the smoothest.\n\n&#x200B;\n\n**So I'm here to ape it all down for you. I'm going to try to explain the following:**\n\n&#x200B;\n\n* Naked shorting\n* What a failure to deliver is\n* What a failure to receive (FTR) is. *(oooooh that's a new one)*\n* Why shares are being borrowed every day.\n* What it means for GME\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Shorting vs naked shorting\n\nOkay. So by now you should know what shorting is, but here is the actual process.\n\n**Traditional short selling (** ***I will be the short seller here)***\n\n&#x200B;\n\n* I borrow a stock from a broker/institutional investor.\n\n&#x200B;\n\n* I immediately sell the stock, in the hopes to buy back later on when the price has dropped.\n\n&#x200B;\n\n* **When I sell the stock, the proceeds of the sale goes back to the lender I borrowed from, (with a few percent more) as collateral.**\n\n&#x200B;\n\n* The lender then usually invests this collateral to earn some extra bucks on the side.\n\n&#x200B;\n\n* If the price has dropped, the short seller buys back the stock and returns it to the lender.\n\n&#x200B;\n\n* If the price rises? The lender requires the short seller to increase the amount of money in their account. This is usually in line with the price of the stock, so that the lender has enough from the borrower to buy back the stock on the open market.\n\n&#x200B;\n\n&#x200B;\n\nWhat happens if the borrower doesn't have enough in the account to buy back all the shares they borrowed on the open market?\n\n**MARGIN CALL.** This is where the lender uses that collateral money to buy back the stock that was borrowed.\n\n&#x200B;\n\n**Okay...so short selling explained. Though what about naked shorting?....**\n\n&#x200B;\n\n&#x200B;\n\n# Naked shorting\n\n&#x200B;\n\nThis is a different beast altogether because I would not be ACTUALLY borrowing the stock. I'm not paying fees or any of that nonsense. When stocks are hard to borrow, I can engage in a 'naked' short.\n\nI can sell a stock I don't have, with the promise on delivering said stock to the buyer by the settlement date. *(That's all these T+ numbers you keep seeing about.)*\n\nIf I don't get you that stock by then? **It's a failure to deliver (FTD).**\n\n*In such cases naked short selling, then failing to deliver is economically equivalent to borrowing shares at a zero-fee zero-rebate equity loan plus the expected cost of being forced to buy back the stock and deliver it (a process called “buying-in”).  In difficult-to-borrow stocks, this amount can be less than the cost of borrowing.*\n\n&#x200B;\n\n**So sometimes... it's actually cheaper for it to be done this way. Crazy right!!**\n\nBecause naked short sellers do not borrow the stock they can theoretically sell an unlimited volume of stock into the market, driving down a share price.  Traditional short sellers, on the other hand, are limited by the amount of stock they can locate to borrow, which can become limiting as the level of short interest becomes large.\n\n&#x200B;\n\n**OKAY. You know about the two types of short selling, but all this isn't done over the phone with boardroom discussions. This is all done electronically through the DTC and NSCC. I'm sure you've heard of those names a few times... Let's see how the above works in reality....**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n# The DTCC, DTC & NSCC; How do these people operate?\n\n&#x200B;\n\nThe DTCC is the big boy. These are responsible for providing clearing, settlement and information services for equities and other securities traded on US financial markets.  One of its key roles is to reduce counterparty risk by guaranteeing obligations will be fulfilled.\n\n&#x200B;\n\n*Getting wrinkly yet?*\n\n&#x200B;\n\nThere are two subsidiaries of the DTCC; The DTC and the NSCC.\n\n&#x200B;\n\n* The NSCC: These are the peeps that make sure everything clears all good and well and make sure everything is settled by the dates it should be. They also streamline the entire process by netting. They figure out everything I owe you and everything you owe me and boil it down to a single payment.\n\n*it doesn't actually go down to a single payment but you get the point. It reduces the constant back and forth of payments and securities exchanged.*\n\n&#x200B;\n\n* The DTC: Now these peeps are responsible for transferring stock ownership, usually by making electronic book-entry changes, to reflect NSCC's net settlements  as well as transferring money between participants (brokers and broker-dealers)\n\n&#x200B;\n\n**The NSCC says Person A owes Person B $100, because they bought 100 shares. They make sure Person A coughs up the money and Person B provides the shares.**\n\n**The DTC is the bookkeeper. They make the actual transfer from each account to reflect what the NSCC is showing.**\n\n&#x200B;\n\nThe DTC has some cash in the bank. Usually a few billion dollars for in case someone is naughty and can't settle their trade.  This consists of:\n\n&#x200B;\n\n* a 'participants fund,  A pot of cash that everyone contributes to\n* A line of credit, Just an amount they can borrow from the bank\n\nThe NSCC also has a participant Fund that it holds as collateral to cover losses from participant defaults.  This serves as a form of mutualized default risk-sharing\n\n&#x200B;\n\n**I hope you're still with me...**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# How do trades settle and what happens when it goes wrong?\n\nOkay so there's a lot to unwrap here. I'll try and only keep the essential information to provide understanding.\n\n&#x200B;\n\nStocks go back and forth everyday. (wow that's easy).\n\nFor a trade that is executed on day T, NSCC’s guarantee of settlement begins midnight between T+1 and T+2, at which time NSCC steps in the middle of the trade and assumes the role of counterparty for both the buyer and seller.\n\nNSCC multilaterally nets trades by stock and on T+2 notifies participants of their net positions in each stock (net long or net short) due to be settled, as well as summaries of all their trades..\n\n&#x200B;\n\n**So they get the info on what needs to go where and a couple days later, let everyone know who owes what to who.**\n\n&#x200B;\n\nNow this bits important.\n\nThe NSCC has essentially become the middle man. Due to the couple days delay, you might as well think of it as:\n\n&#x200B;\n\n* If you're short a stock - you owe the NSCC\n* If you're long a stock - you're OWED by the NSCC\n\n&#x200B;\n\nOn the third business day following the trade (T+3) instructions are sent to the DTC containing net securities positions to be settled, and the DTC makes the transfers of stock and cash.\n\nTo keep the next bit short (pun intended), there's an algorithm that decides who gets shares that are owed based on age of trade and blah blah blah. There's a process. The algo sends the info to the DTC and they transfer the stocks.. but what about the cash?\n\n&#x200B;\n\nThe cash isn't transferred at the same time. This is done later on in the day and is done through the Federal Reserve’s money transfer system (Fedwire). The transfers occur between DTC’s account at the Federal Reserve Bank of New York and the participants’ settling banks.\n\nIf no participants fail to deliver on their short positions, i.e., the DTC is able to transfer all the stock owed by participants to the NSCC account, then everything is hunky dory and tomorrow is another day!\n\n&#x200B;\n\n**YAY! We just learned how trades are cleared. It sounds great right? When it all works good...but what happens when it goes bad?**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# When an FTD occurs\n\nWell what happens when a participant doesn't deliver their side of the deal? **Remember...this stock is owed to the NSCC at the moment.**\n\nThe position is called an FTD and the short position remains open.\n\nSo when the NSCC add up all the stock they're owed for the day vs what they have to give back out...there's a difference. That means that people that are long may not be delivered the shares.\n\nIf they don't get their shares, they instead get an FTR (Failure to receive). This is essentially a glorified IOU from the NSCC saying I'll get you your stock.\n\n&#x200B;\n\nAn FTD - A short seller owes the NSCC some shares\n\nAn FTR - The NSCC owes some shares to the long holders\n\n&#x200B;\n\nDividends are automatically debited from participants with FTD positions and credited to those with FTR positions. *(Make sense now?*)\n\nHowever shareholder voting rights are distorted because FTR holders (participants with stock IOUs from the NSCC) do not receive the usual voting rights that they would have, had the stock been delivered. **They are also unable to lend the stock until they actually receive it.**\n\n&#x200B;\n\n**IT GETS BETTER. NOONE HAS ANY IDEA IF THEY HOLD A REAL SHARE OR AN FTR FROM THE NSCC.**\n\nSo you sell your share? (paper handed bitch). You just sell your IOU but due to the algorithm, the buyer might actually get a real share. What a lottery eh!\n\n&#x200B;\n\nWhen a participant receives an FTR (the IOU from the NSCC) cash is still debited from their account even though they have not yet received the stock.  However, instead of being paid to the participant with the FTD, it is held by the NSCC as collateral until such time as the stock is delivered and the FTD is cancelled.\n\nThe amount of cash collateral held is not the cash value of the stock bought/sold but, rather, is the marked-to-market value of the stock, reset daily with cash adjustments. The cash adjustments are made from the money settlement account of the participant that failed to deliver the stock.\n\n&#x200B;\n\n**Could this explain why they get scared of certain numbers?  The cash adjustments of collateral are automatically taken from the short sellers account to account for the rise in share price. If they go to take some money out the account and there isn't enough....MARGIN CALL BABY!**\n\n&#x200B;\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n# Why are so many shares borrowed each day?\n\n&#x200B;\n\nNow that is a good question. You all ask THEY'RE USING THEM TO SHORT! AHHHHH. Well not exactly...(I believe)\n\n**The Stock Borrow Program**\n\nA mechanism the NSCC has in place to reduce the number of FTRs (but does not reduce FTDs) is the Stock Borrow Program.  Under this program participants are able to lend excess stock in their DTC accounts to the NSCC, so that the NSCC can satisfy delivery requirements not filled via normal deliveries.\n\n&#x200B;\n\n**Those borrowed shares? Yup. I see it as the NSCC taking them to cover for all the FTDs. You buy a  naked short? Well the shorter doesn't deliver and now the NSCC has to borrow the stock to make sure you get it on time. This is happening DAILY.**\n\nEach day, participants submit a list of stocks they own that they would like to have participate in the Stock Borrow Program.  Once the NSCC determines the open long positions (stock it owes participants) that are due to become FTRs, it attempts to satisfy these obligations by borrowing from participants in the Stock Borrow Program.\n\n&#x200B;\n\nWhen the NSCC borrows stock from a participant, it credits the participant’s money settlement account with the marked-to-market value of the borrowed stock.  Recall this is the same as the collateral held from the participant that failed to deliver the stock. So effectively the NSCC is simply acting as a facilitator of lending between the participant failing to deliver and the participant lending their stock.\n\nAlthough the NSCC states that the purpose of the Stock Borrow Program is to cover temporary shortfalls in CNS (continuous net settlement), there is no time limit on how long NSCC may borrow stock from its participants.\n\n**The short sellers keep making FTDs and the NSCC is borrowing the shares to make sure they're delivered. This doesn't let the short sellers off the hook though....**\n\n**THEY ARE STILL REQUIRED TO SETTLE THE FTDS**\n\n&#x200B;\n\nFor FTDs caused by naked short selling, the Stock Borrow Program is equivalent to the naked short seller borrowing stock from the Stock Borrow Program participants (at a zero-fee zero-rebate loan) and short selling the stock to the participants that would have received FTRs in the absence of the Stock Borrow Program.\n\n&#x200B;\n\n**So instead of the HFs having to borrow stock normally and pay a load of fees - they just naked short it because they know the NSCC will borrow it for them and deliver it. The naked shorters are effectively forcing the NSCC to rehypothecate to ensure the system doesn't go bang. Now I can see why they might wanna close that loophole.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# How much is it costing them to do this?\n\nWhile the open FTD and FTR position lasts, this arrangement is effectively aninvoluntary zero-fee zero-rebate equity loan from the buyer to the seller.\n\nIf a naked short seller is forced to buy-in, then in order to maintain a short position they mustbuy the stock, deliver it to the initial counterparty and then naked short sell the stockagain, together costing them the roundtrip transaction costs.\n\nThe NSCC may also charge a fee to the participant that fails to deliver, however, the fee is insignificant in relative terms.  Because the incidence of buy-ins is low and penalties for failing aresmall, naked short selling effectively is a way of short selling difficult or impossibleto borrow stocks.\n\n&#x200B;\n\n**Oh so basically - sweet fuck all.**\n\nI also believe this is why the borrow rate is so cheap. It's not the HFs borrowing, its the NSCC.\n\n&#x200B;\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n&#x200B;\n\n# And that, is how these motherfuckers keep getting away with it.\n\n&#x200B;\n\n# Part II to come.",
    "title": "FTDs, Naked shorting, Borrowing shares (every day), margin calls and The DTCC, DTC & NSCC - FOR DUMMIES (Part I)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n2nhgw/ftds_naked_shorting_borrowing_shares_every_day/"
}