{
    "author": "Criand",
    "created_utc": 1619854419.0,
    "distinguished": null,
    "edited": 1620084993.0,
    "id": "n2dkw2",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n2dkw2",
    "num_comments": 332,
    "permalink": "/r/Superstonk/comments/n2dkw2/scoobydoo_and_the_deep_itm_calls_of_april_16_is/",
    "score": 3177,
    "selftext": "Hello apes. Not a financial advisor, hopefully you know that.\n\nPlease take a look at the following DD as it is beautifully written and I'm going to be referencing some figures from there. It also gives you a much needed confirmation bias injection straight into your retinas:\n\n[https://www.reddit.com/r/Superstonk/comments/mvdgf5/the\\_naked\\_shorting\\_scam\\_in\\_numbers\\_ai\\_detection/](https://www.reddit.com/r/Superstonk/comments/mvdgf5/the_naked_shorting_scam_in_numbers_ai_detection/)\n\nAlso would like to give a big shoutout to /u/yelyah2 for providing me with a data dump of options numbers, and /u/Dan_Bren for providing deep ITM call purchase data.\n\nLet's get to it, shall we?\n\nhttps://preview.redd.it/nyka631l0gw61.png?width=612&format=png&auto=webp&s=354d585f9221b3bed06324db4f13bd2aee097c8c\n\n# We Totally Covered Our Positions!\n\nRemember how Mr. Plotkin said that Melvin had closed their Gamestop position? **And also saying that the runup was not due to shorts covering**? Yeah, that was most likely a technicality in words to fuck with everyone's heads. \n\nConsider this: what if you \"closed\" your Gamestop position by becoming net-neutral by hiding your shorts, and new shorts, with Married Puts? You 'closed' your original position by shifting it. Lawyers love this shit. You're not technically lying!\n\nOver the weekend of the 27th we were told that SI% had dropped from over 100% to \\~40% and it continued to decline for a few weeks. Well, that's not right. How could they have covered if they **literally said that the runup was not due to covering short positions**? Sounded, and still sounds fishy as hell. I'll let you in on a secret: **they have not covered. Why would they ever give up BILLIONS of dollars to retail? You can bet your sweet ass they would fight tooth and nail until they win it all or lose everything.**\n\nTake a look at the following chart and think about if the put OI (orange) looks normal to you.\n\n[Source: \\/u\\/broccaaa \\\\\"The Naked Shorting Scam\\\\\"](https://preview.redd.it/djhl8mfp0gw61.png?width=1873&format=png&auto=webp&s=30665f72b556f7c766aca898704e2efed684272d)\n\nSure as hell does not look normal. It looks like shorters must have created a bunch of married PUTs **in order to hide their true SI%**. This surge happened in the January runup and is still well away from where it should be - it's sitting around 1,300,000 OI when it should be roughly 300,000 OI to align with CALL OI. Scooby Doo (/u/broccaaa) - I think you deserve a Scooby Snack for this data.\n\nLet's take a look at deep ITM call purchases:\n\n[Source: \\/u\\/broccaaa \\\\\"The Naked Shorting Scam\\\\\"](https://preview.redd.it/j0fq1ach3gw61.png?width=1937&format=png&auto=webp&s=31818cbfc8946d80eca1d149bd157126a73b0217)\n\nOh boy look at that. We get anomalies of deep ITM call purchases around the time the total PUT OI skyrockets. Not only that, I'd like you to notice the following dates at which these anomalies occurred:\n\n* January 13, first spike in price.\n* January 24-26, runup in price.\n* January 27, second spike in price.\n* January 28-Feb 1, rundown in price (still above $200).\n* February 24-25, third spike in price.\n* March 8-10, second runup in price.\n\nWhy was this happening? Well, I'm pretty damn sure that it was to put a cap on things before they got out of hand. Each date of deep ITM calls being purchased was either on the day of a spike in price or during a multiple day run-up in price. This was a chance to stop the upward pressure of FTDs being delivered. It was a guaranteed runaway train in January unless they stopped buying to allow this malicious options practice to go through. It was almost a runaway train on March 10 as well, until they dumped a hundred thousand PUTs to flash crash the price.\n\n**So it is very likely that the increase in PUT OI is to hide SI%, while the deep ITM calls are to delay FTDs.**\n\nA few FTDs had slipped out on some days - allowing the price to pump upward - but the rest were suppressed to a later date. Where exactly did the rest of them go? What date are we potentially waiting for?\n\n# Scooby Doo - Where Did Shitadel & Co. Hide The Shares? What Happened on March 10?\n\nI've highlighted the below data courtesy of /u/yelyah2. This is a chart that tracks **OI of PUTs** for a select few expiration dates. I've included a column of the total CALL OI just for reference. We're basically looking at the earlier chart, but with specific option expiry information.\n\nOrange = Spike dates\n\nGreen = Major option expiry dates to look at. It is very likely that these option dates triggered T+13 FTD spikes (e.g. 2/5/2021 -> 2/24/2021, and 2/19/2021 -> 3/10/2021)\n\nRed = OI changes to consider\n\n[Source: \\/u\\/yelyeh2 Options Data](https://preview.redd.it/vu31m3o65gw61.png?width=901&format=png&auto=webp&s=d0fe2896848485c003317248d6881fcd58503396)\n\nI'd like you to take a notice of the three sequential red highlighted rows from 3/9/2021 to 3/11/2021. What in the **hell** happened to OI for 7/16/2021 PUT OI? It is very likely that FTDs were spilling out due to **T+13 FTD delivery** from 2/19/2021, causing that massive run-up in price to about $350. They utilized their ammo in 7/16/2021 PUTs to smash the price down. They did not have this trick up their sleeve back in January - shutting down buys was their only chance back then. On March 10, exercising options all at once would allow them to put massive sell pressure at whatever strike price they wanted. This was potentially expensive, but worth it to shut things down.\n\nAnyways - just like the graph earlier shows, we go from a ridiculous \\~300,000 OI in PUTS to \\~2,000,000 OI by 2/5/2021. I consider most all OI changing after 2/16/2021 to be natural and not due to shorters, because our main interest is what happened between the January runup and the middle of February, when SI% dropped significantly. You can see that the PUTs were mostly spread between 2/19/2021, 4/16/2021, 7/16/2021, and 1/21/2022.\n\nSo, it looks like SI% has been hidden in those major option expirations through PUTs. Now let's take a look at when they decided to purchase deep ITM calls (which are way more interesting to me, mainly because they haven't been spread out as much, **and are likely the place where FTDs have been hidden**). This data is courtesy of our good friend /u/Dan_Bren. Let's look at the option date and strike price that the first post /u/Dan_Bren provided of deep ITM calls were purchased from March 1st:\n\n&#x200B;\n\n[Deep ITM Call Purchases, March 1st](https://preview.redd.it/iepm3qufbgw61.png?width=145&format=png&auto=webp&s=3837a4da20305942f2a8b740a8bd3731ac552753)\n\nOk ok, April 16. Interesting. What's the next purchase on March 3rd?:\n\n[Deep ITM Call Purchases, March 3rd](https://preview.redd.it/ilkqzw9nbgw61.png?width=141&format=png&auto=webp&s=90e8db32728c11229452e046cfc3336f8325ccdb)\n\nSame date, alright. What purchases were made on March 4th?:\n\n[Deep ITM Call Purchases, March 4th](https://preview.redd.it/kvq3s50wbgw61.png?width=145&format=png&auto=webp&s=9204b40f7e8976435bc8af4b0b18c7c4d8216757)\n\nDamn you hedgies, what you doing? \n\nI'm not going to waste more screenshots. I'll sum it up. **All of the purchases were for April 16 expiration up until April 26, at which a few purchases were made for April 30.** ~~There is no evidence of purchases for deep ITM calls in expirations later than these dates. Nothing for 7/16/2021, and nothing for 1/21/2022~~. Does this mean that most FTDs were hidden in 4/16/2021 expiration? We might find out soon.\n\nEdit: There are quite a few deep CALL purchases that were made for July 2021 and January 2022. But a lot of ammo was dumped into April 16, 2021, which starting back in 2020 and continued into April. I'll talk more on this below.\n\n# What's so significant about April 16, 2021?\n\nLet's roll back in time to early 2020. What were the main options you could purchase?\n\n* 01/15/2021\n* 04/16/2021\n* 07/16/2021\n* 01/21/2022\n\nIf you were a hedgie, and COVID just hit, you'd think, \"Damn, Gamestop is going to release their earnings report and their bonds will mature before April 16. They will be dead by then. The closer to expiration the higher risk the higher reward, and thus a cheaper entry price. Let's pile up and pump into 04/16/2021. Why waste more money on 07/16/2021 expiration?\"\n\nIt's very likely that Shitadel & Co. had significant positions expiring on April 16, 2021. **Remember when Melvin reported 50%+ losses in January, and then magically gained 20%+ in February? I call bullshit and believe this was unrealized losses from their PUT positions that they must have diamond handed and any naked CALLs they must have sold. You don't technically lose your option premium until expiration. They could claim \"losses\" on the way up and \"gains\" on the way down due to premium swings. Hmmm... Wonder what date of expiration they might have chosen for their 60,000 PUTs? And (very possible) naked CALLs?**\n\nThey (most likely) kept purchasing deep ITM calls specifically for this date to delay FTDs because it was the cheapest date to hope that GME would die off, and the date which they held many PUT positions. After that, whelp, they're probably screwed because our wonderful friend/foe the DTCC had introduced **rule 005 to ban hiding of FTDs through malicious options practices**.\n\nI understand that **005 has disappeared** but I truly believe that it will re-appear just before the next FTD spike is about to occur so that they cannot hide their FTDs once more. This might be why Shitadel is shitting their pants and working overtime ever since April 16 - \"What the **FUCK** do we do now?\".\n\n# When Moon? When Next FTD Spike?\n\nConsider the T+N dates we've heard about. T+2, T+13, T+21, and others.  For normies like you or me, we're required to deliver by T+2. For the special guys like HFs and MMs, you simply report an FTD after T+2. However, upon T+13, the broker forces you to deliver.\n\nI'd like you to note that **January 27**, **February 24, March 10** all occurred on Wednesdays. It is in my belief that these spikes are all linked to T+13 from a previous options expiration. Specifically:\n\nJanuary 8 -> January 27\n\nFebruary 5 -> February 24\n\nFebruary 19 -> March 10\n\n[Now take a look at this data from another wonderful DD](https://preview.redd.it/hqeiaec69kq61.png?width=960&format=png&auto=webp&s=142b6106a5b8824006906f3604af2d779e551165). Shout-out to /u/beyond-mythos for bringing this to my attention.\n\nSource: https://www.reddit.com/r/GME/comments/mhv22h/the_si_is_fake_i_found_44000000_million_shorts/\n\nWould you look at that! Deep ITM CALLs were purchased for....\n\n**February 5 and February 19**! Looks like some support to the T+13 theory.\n\nBut wait! You see March 19 deep call purchases. Why didn't it spike on April 7? Very few deep CALLs were purchased for March 19. A ton more for February 24. And **an absolute DUMPSTER for April 16**\n\nIf this pattern continues from another very interesting options date \\*cough\\* April 16 \\*cough\\*, then we're due for an FTD spike very soon.\n\n* We know that they hid their SI% most likely through married PUTs. \n* We know that they most likely hid FTDs through deep ITM calls, almost all expiring April 16. \n* We know that Shitadel and others have been working day and night since April 16.\n* We know that with rule 005, when in effect, will prevent them from kicking the can further down the road. \n\nNow, let's apply T+13 to April 16 for when we could possibly land:\n\nApril 16 -> T+13 -> **May 5**\n\nYeah, it's a date. I like dates, bitch. I'll leave you with a few supporting notes:\n\n* Lots of TA is pointing to an apex next week. \n* US Treasury is issuing 0% bonds on May 4th which mature June 1st. \n* [Distribution Days](https://www.reddit.com/r/Superstonk/comments/n0htur/the_end_is_near_market_tops_distribution_days/) have been noticed by [u/According\\_Bee2757](https://www.reddit.com/user/According_Bee2757/) signaling a potential imminent market crash. Big players must be slowly exiting their positions at the peak of the market.\n* The initial comment period for rule 002/801 will be up next week, so its possible it will go into effect. \n\n**Oh boy.** Are your tits jacked? Mine are.",
    "title": "Scooby-Doo And The Deep ITM Calls of April 16. Is The Rocket Lifting Off Soon?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n2dkw2/scoobydoo_and_the_deep_itm_calls_of_april_16_is/"
}