{
    "author": "MOSfriedeggs",
    "created_utc": 1619920000.0,
    "distinguished": null,
    "edited": 1619927482.0,
    "id": "n2witz",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n2witz",
    "num_comments": 228,
    "permalink": "/r/Superstonk/comments/n2witz/wen_moon_taddelliot_wavegamma_squeezeoptions/",
    "score": 2389,
    "selftext": "  \nHello follow apes 🦍 this **DD/TA** post is a combination of my own smooth brain chart TA and the analysis of a professional trader and Youtuber named Andrew a.k.a **Trading Sciences** *(link at the end of the post)* **Elliot Wave Theory/Options Chain** Analysis.   \n\n\nThis is going to be short and straight to the point as I want a maximum of Apes to understand what   \nmight happen next week with our favorite stock. Please keep in mind these dates and prices are not set in stone, but will give you a general idea of where we could be going and what might end up happening this month. 🚀  \n\n\n&#x200B;\n\n# Part I : MOAW (Mother Of All Wedges) \n\nWhat Is a Wedge? ([source](https://www.investopedia.com/terms/w/wedge.asp))\n\n*A wedge is a price pattern marked by converging trend lines on a price  chart. The lines  show that the highs and the lows are either rising or falling and  differing rates, giving the appearance of a wedge as the lines approach a convergence. Wedge shaped trend lines are considered useful indicators  of a potential reversal in price action.*\n\nIn this picture the ***Yellow lines*** represent our ***MOAW*****,** the **green line** represents the approximative price where ***Elliot's Waves*** converge it's also a great resistance/support. **The blue line** was made using our lowest and highest point from **January 27th** to try and illustrate how explosive the stock can be in the right circumstances in this case I was estimating a price of around **600$,** triggering a massive **gamma squeeze** in the process and putting insane pressure on the short sellers. \n\nI've try to draw this wedge using different prices and the result all pointed in the same direction, as you can see we we will be breaking out the giant **Doritos** somewhere around the **end of next week**.\n\n[Doritos and crayons](https://preview.redd.it/zx322414hlw61.png?width=805&format=png&auto=webp&s=3773edd19aeecc37a25cc00cc792552d8aa634bd)\n\n# Part II : MacDaddy\n\nMoving average convergence divergence (**MACD**) is a trend-following momentum **indicator** that shows the relationship between two moving averages of a security's price.  ([source](https://www.investopedia.com/terms/m/macd.asp))  \n\n\nAs some of you might have noticed the MACD  on the daily timeframe has been green for 3 trading days now, if we look at our last two run-up it took 7-8 trading days from the time the **MACD** turned green to the time it peaked, if history repeat hitself we would hit another peak somewhere around thursday/friday right on schedual to break out the Doritos.\n\n&#x200B;\n\n[MACD](https://preview.redd.it/btwqsz07hlw61.png?width=539&format=png&auto=webp&s=afa64fd31dbc5a33fa3188d749c95a4a9b6dd583)\n\n  \n\n\n[3 days after MACD crossover](https://preview.redd.it/945rp457klw61.png?width=430&format=png&auto=webp&s=950cb872e243ba97dca84c39c9dd80b700a6ad53)\n\n  \n\n\n[wen moon?](https://preview.redd.it/dk7uajibklw61.png?width=440&format=png&auto=webp&s=0d1a61f75d6a71ba9db85b083bdd3277364b3ba9)\n\n# PART III : Elliot Wave Theory \n\nIn his [***video***](https://youtu.be/GDeMralCaiY?t=130) Andew predict the price action, he explain in detail that according to **Elliot Wave theory** we would hit a stock price of approx. **216$ish** erly next week *(Green line in the first picture/ Green circle in the picture underneath)*   \nfollowing a possible correction, where apes would buy the dip en masse as usual. From there, it's impossible to predict the exact price but according to his analysis it would be around **800$**\\+**. (Keep that in mind for the next part)**   \n\n\n[Elliot Wave](https://preview.redd.it/du60t9adklw61.png?width=806&format=png&auto=webp&s=340a1ccbf40b3d22b215ea1df749723e5fe348ee)\n\n# Part IV  : Gamma Squeeze \n\nA “gamma squeeze” is a trading terminology that refers to massive  call buying leading to higher stock prices, which leads to more call  buying, a higher stock price and so on.\n\nFor a gamma squeeze to start, a group of small retail traders or one  big trader betting that a stock will rise buy short-dated call options  in the underlying stock.\n\nOnce they buy these call options, the investment banks and  intuitional investors that sell them essentially become short the  underlying stock.\n\nShould the traders buy more call options, market makers and  institutional brokers will be forced to buy more shares of the  underlying stock to hedge their short position.  \n\n\nJust like a short squeeze, as the price of a stock begins to go up  and traders increase their call positions, market makers are forced to  buy the underlying the stock thus pushing its price higher.\n\n**Investors selling or writing the call are hoping the price will fall, but like going short, the downside can technically be limitless because  the stock can keep on climbing instead of dropping to zero.**\n\n**If a stock has low liquidity, the latter can cause the share price to  rise even further, forcing brokerages to purchase even more shares as  the value of their exposure increases further as the share price gets  closer to the strike price of call options.**\n\nWheter its 200$/300$/400$/600$/800$ doesn't matter, Hedgies are fucked. By looking at the picture below I hope you understand why they fought so hard to keep the price below **180$** this week. if you want more in depth explanations on this, watch the video I [linked](https://youtu.be/GDeMralCaiY?t=461) below at the **7:41** mark where he compares GME to other stocks and tell us why this is very bullish.  \nSomeone can correct me if I'm wrong, but in theory if we go above 200$ it could create a domino effect of FOMO/***gamma squeeze*** that will then trigger a ***MOASS*** completly annihilating short sellers in the process.  \n\n\n[Options go STONK!!!](https://preview.redd.it/6skqhhleklw61.png?width=672&format=png&auto=webp&s=e15133270aecbbe6907f096da66635064ecf0575)\n\n***TLDR :***   \nBuy and HOLD. MACD, giant Wedge, Elliot Wave Theory and Options are extremly bullish for next week. I Know TA is not 100% reliable on GME, this is only my personal opinion and not financial advice.   \n\n\n  \n***Trading Sciences video on EWT/Options :***   \n[https://www.youtube.com/watch?v=GDeMralCaiY](https://www.youtube.com/watch?v=GDeMralCaiY)    \n\n\nOnly reason this will work is because I know most APES by now have hands as hard as  [**💎**](https://emojipedia.org/gem-stone/) and would never sell at a low price. Remember the upside is limitless 🚀  \nI apologize in advance for mistakes as english isn't my first language.   \n\n\n#",
    "title": "Wen Moon ? [TA/DD/Elliot Wave/Gamma Squeeze(Options)]",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/n2witz/wen_moon_taddelliot_wavegamma_squeezeoptions/"
}