{
    "author": "HomoChef",
    "created_utc": 1613935962.0,
    "distinguished": null,
    "edited": 1613938319.0,
    "id": "lp4m6l",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lp4m6l",
    "num_comments": 322,
    "permalink": "/r/GME/comments/lp4m6l/melvin_capital_gamestops_final_boss/",
    "score": 1987,
    "selftext": "*“If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle.”*\n― Sun Tzu, The Art of War\n\nWhile reading all of the great DD while diamond-handing GME, I've been wondering to myself this question -\n\n#**EXACTLY WHO IS THE SHORT SELLER(S) THAT GAMESTONK IS DEALING WITH?**\n\nThis question is vitally important because $GME shareholders needs to know exactly who their \"enemy\" is.\n\nI've come to the following conclusions: (ALSO, THE TL;DR IS CONTAINED IN THESE FOUR POINTS)\n\n**1.\tMelvin Capital is completely out of the picture, and very possibly facing fund liquidation in the near-future. [Melvin started 2021 with 12.5 billion in assets under management \"AUM\"]**\n\n**2.\tCitadel & Point72 are the \"final bosses\" who have taken up Melvin Capital's position. [Citadel has AUM as of October 2020 of 35 billion; P72 AUM as of July 2020 of 17.2 billion]**\n\n**3.\tBoth Hedge Funds have doubled down in their positions, after having bought-out Melvin's short position (at $2 billion from Citadel, and $750 million from P72).**\n\n**4.\tThe short squeeze has definitely NOT happened, and the can has been kicked down the road.**\n\n##**1 Melvin Capital is completely out of the picture, and very possibly facing fund liquidation in the near-future.**\n\nIn watching Gabe Plotkin's testimony, I was wondering why he looked like a literal cuck (not just a figurative one). He looked like someone literally shot his wife, and raped his dog.\n\nFor the last two weeks, I assumed the major \"enemy\" was Melvin Capital, still. And that they had just rolled their shorts, manipulated the market to reduce their exposure, and holding on for dear life hoping they can drive Gamestop into the ground through their various manipulative tactics.\n\nHowever, as it pertains to Melvin Capital specifically - this thesis doesn't address the following inconsistences;\n\n>Melvin has stated they closed out their Gamestop short position(s).\n\n>Gabe Plotkin's wife is purportedly filing for divorce (citing irreconcilable differences).\n\n>Gabe Plotkin looks like a literal cuck now.\n\n>Melvin Capital REALIZED actual losses (ie., were forced to cover some shares) at some point, to the tune of losing 30-50% of the AUM value (up to 6 billion in investors money) - evidenced by the stock price dips of various long positions owned by Melvin Capital during late January (Notice how their biggest holdings - FISV, FB, EXPE all dip dramatically around January 28th. This is when Melvin had to start liquidating).\n\n>Gabe Plotkin mentions his investors multiple times in his written testimony for the Congressional Hearing. He states that investors in Melvin suffered significant losses. That it is now Melvin's job to earn it back.\n\nNow, imagine you're a millionaire or billionaire passive investor in Melvin Capital. A limited partner that placed money in an aggressive securities trading hedge fund. They have great returns, you're happy, they're happy.\n\nNow imagine one day you wake up and you see Gamestop ad-nauseum LITERALLY EVERYWHERE on every media available, and then you see MELVIN Capital, those slick-haired fucks that you invested some millions (or billions), and the headline reads \"MELVIN CAPITAL LOSES 50% OF AUM IN A MONTH DUE TO GAMESTONK\".\n\nFirst fucking phone call you make is to the hedge fund, demanding redemption of your money (you are withdrawing your capital from the fund). Now, assuming a majority of LPs of Melvin do the same (which is completely realistic), your fund now has to lock-down the outflow, has to sell off all of their positions, buy-back all shorts, and essentially liquidate the assets and return it to the investors. You're essentially going out of business (but not bankrupt).\n\nThis is an inevitability. I don't see how any investor in Melvin sees that they lost 30-50% of the value in one month, due to widely reported greed and irresponsible shorting, and think \"okay, this is copasetic, I fucks with that.\"\n\nNo way. Melvin is facing liquidation.\n\nHowever, if the cost to close out all the Gamestop short positions, all at once, will create a massive short squeeze that will literally bankrupt the fund - what do you do? What if you've recklessly overshorted a low-liquidity stock to the extent that closing your short position would mean literally selling off every last long position, losing ALL investor contributions, what do you do?\n\nIf I were Gabe Plotkin, I would call my wife, tell her to divorce me immediately. I may be personally liable for the financial losses sustained by my greed. I need to make sure we protect 50% of our assets and make those \"untouchable\" in lawsuits, bankruptcy, etc.\n\nThe next thing I would do is to phone my old bosses (and partners in crime) and tell them that now, because of this short position, I have a solvency problem if I have to buy the $GME shares at escalating market prices, and Melvin will lose all of it's value (Which, of course, means that Citadel, Point72, Steven Cohen, Kenneth Griffin will lose the billions they've invested in Melvin). \n\nFurthermore (and even more concerning for Citadel and P72), if I, Gabe Plotkin, have to cover these Gamestop shorts - then any other hedge funds whose hands are in the cookie jar will be forced to cover their shorts AS WELL. Because the escalating share price will start to pop the margins of even bigger funds. Then THOSE funds (Citadel, Point72) are at risk of complete insolvency as well.\n\nTherefore;\n\n##**2 Citadel & Point72 are the \"final bosses\" who have taken up Melvin Capital's position.**\n\nIf I'm Steve Cohen, and I've invested money in my former employee - that snot-faced Gabe Plotkin... Why would I hitch my trailer onto his losing play? The truth of the matter is, I wouldn't, unless I had a significant exposure risk as well.\n\nWhich leads me to my next point;\n\nI believe the 2.75 Billion dollar bailout was effectively structured behind closed doors as as buy-out of Melvin's short position - to prevent insolvency.\n\nEffectively, I think that Citadel and Point72 could not afford to let Melvin cover their Gamestop shorts. If they covered, it's game over for all the capital invested in Melvin, and would trigger the dominoes that could very realistically lead to the insolvency of Citadel and Point72 (with escalating buy prices of Gamestop, and the real threat of getting short called and having to sell off assets to then cover).\n\nTherefore, they structured this \"bailout\" by arranging a darkpool sale of Gamestop stock (which are shorted) \"Okay, we'll take over your 100 million shares short position, which costs us 2.75 billion on paper value\" The 100 million share position is just a fictional number, but you get the gist. They're buying out 100% of Melvin's shorts. They borrow the stock from various stock-brokers, (unbeknownst to the owners of the stock) and then give them to Melvin so Melvin can close out their short positions without liquidating their full portfolio or having to buy the stocks at the market price at that time. \n\nThis buy-out factually verifies Gabe's statement that Melvin's short position in Gamestop has been closed... by Melvin. But opened by the bigger fish.\n\nBecause Citadel and P72 are bigger firms, and likely had less exposure, they can weather the storm of a short call much better than Melvin. Therefore, they postpone a short squeeze, which protects their very existence. Remember, short squeeze = all 3 funds will either become insolvent or lose a VAST majority of their value - potentially $50 billion+ in losses.\n\n##**3 Both Hedge Funds have doubled down in their positions, after having bought-out Melvin's short position**\n\nNow the remarkable thing about Citadel thereby opening a short position, is that they have access to even more tools than Melvin did in order to manipulate the stock. If you've opened up a massive short position in Gamestop, what do you want? You need the stock to go down, or now your ass is on the line if the squeeze happens.\n\nCitadel, through conduits, are essentially part owners of the DTCC. The DTCC raised margin requirements on brokers, and Robinhood got the short end of the stick. To be clear, however, the order came from the top (the DTCC). That's why various OTHER brokers had to restrict trading GME and other high volatility stocks as well. Any/all stocks with short exposure from Melvin's shorting, which now became Citadel's short position, got restricted.\n\nCitadel also suspiciously was reported to have opened a shit ton of bearish positions (puts and/or shorts) on Gamestop right before the controversial (and likely, illegal) stock restrictions on January 28th. \n\nNow why would they do that, in the face of exponential almost 10,000% growth of Gamestop stock, on that exact day - unless... of course... they triggered the sell-off and benefited hugely from it.\n\nFurther, it also allowed them to make a fuck-ton of money when they bought-out Melvin's position. They probably paid $50-75/share~, the price of Gamestop stock on January 25th, and now have made a profit from that.\n\nThey massively profited from their bearish position at the stock's ATH on January 28th, and have even profited (if/when they actually cover the borrowed shares) on paper from the short-position buyout.\n\nThe thing is... they can't ever close this short position and \"realize\" this gain because doing so would trigger that short squeeze, on low volume, with high volatility. They NEED paper hands to sell en masse so they can reduce their short exposure.\n\n##**4 The short squeeze has definitely NOT happened, and the can has been kicked down the road.**\n \nAnd that is why so much capital, and effort, and carefully crafted testimony during the Congressional hearing, and the changes in policy to under-report short positions in major financial publications, and on and on and on have been going on. \n\nThey need FUD to spread. \n\nThey need retail to relinquish their shares. Because they're not getting the shares they require from institutions. They need the apes to sell. That way they can finally cover their position at a low price, without triggering a short squeeze. \n\nThat's why the short position has, on paper, been shifted to $GME holding ETFs like XRT. To scare retail into thinking that the short squeeze is DONE or NOT HAPPENING.\n\nThey're trying to tap-dance over a million lasers.\n\nBut shareholders should recognize this, and not let them off the hook.\n\nBy myriad of potential catalysts (stock split, shareholder recall, massive upward buying pressure through a press releaser that shifts public sentiment on the fundamental forward-facing value of the stock, EVEN a black-swan event that reduces the value of the HF's holdings), the price WILL spike up, especially on low volume. The shorts WILL face a liquidity crisis, because they HAVE NOT exited their positions. They're praying that paper hands all sell the stock down, while they continually flood the market will shorted stocks (hence the up to 400% short percentage of the float).\n\nBecause, again, they have a time crunch. They have to avoid dozens of potential catalysts.\n\nShareholders just need to hold.\n\n---\n\nDISCLAIMER: THIS IS A HYPOTHETICAL THEORY BASED ON THE FICTIONAL RAMBLINGS OF A CRAYON-EATING APE. ANY AND ALL RESEMBLANCES TO REAL LIFE GOING-ONS OR LINKS THAT MAY OR MAY NOT RELATE IN ANY WAY TO REAL-LIFE EVENTS ARE COMPLETELY COINCIDENTAL AND ACCIDENTAL.\n\nThis is NOT investment advice, and I am not a professional financial advisor, and do not accept the role of giving any financial advice. This is for fictional purposes only.\n\nI am a shareholder and call holder of Gamestop, and I personally just like the stock. I will hold the stock based on my personally held beliefs, and I compel you to make your own financial decisions based on your own theses and circumstances.",
    "title": "Melvin Capital & Gamestop's Final Boss",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lp4m6l/melvin_capital_gamestops_final_boss/"
}