{
    "author": "rensole",
    "created_utc": 1613731936.0,
    "distinguished": null,
    "edited": 1613739605.0,
    "id": "lnd3t5",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lnd3t5",
    "num_comments": 108,
    "permalink": "/r/GME/comments/lnd3t5/synopsis_for_02182021_what_we_need_to_know_before/",
    "score": 716,
    "selftext": "Goodmorning everyone,\n\nI am Rensole, and I fucked up the title.\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/3cnecpl3sei61.png?width=680&format=png&auto=webp&s=775f86c9ea2eb56bddbee9a8fa9ce615f0f53042\n\n&#x200B;\n\nYesterday we had a chance to watch along with the financial house grilling everyone.\n\nA quick rundown of everyone:\n\n**DFV:**\n\nhttps://preview.redd.it/gg75rbrqsei61.jpg?width=960&format=pjpg&auto=webp&s=267fc467c248652b63dd7f5c3c0b6f5c1ed04bcc\n\nHe's not a cat, he still likes the stock, and thinks that at the current price GameStop is still at an attractive point as it's undervalued. Had zero people with him, as it's easy to speak when you're speaking the truth.\n\n&#x200B;\n\n**Gabriel \"plotting\" Plotkin**\n\n&#x200B;\n\nhttps://preview.redd.it/bqjznkr9tei61.jpg?width=1920&format=pjpg&auto=webp&s=5fbb8d48af1641fc617a38ac5231a79ff82cb1b6\n\nThis motherfucker started lying right out of the gate.He said they closed all their positions, while the subs have found this is bullshit.\n\n[as can be seen here](https://www.reddit.com/r/GME/comments/ln7dmz/must_read_very_good_dd_before_opening_on_021921/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nAlso claimed we belittled him with anti-Semitical posts, calling for a second holocaust, or anti Jewish in any way. As reddit prides itself on how the communities are self governing, we have never and will never allow that kind of speech, and even though we might personally dislike HIM, no one has ever said these things against him (as is evident in u/spez s opening statement)\n\nAlso this is a very interesting statement from him:[https://www.reddit.com/r/GME/comments/lmzxp2/gabe\\_reveals\\_two\\_things\\_in\\_this\\_clip\\_1\\_he\\_admits/](https://www.reddit.com/r/GME/comments/lmzxp2/gabe_reveals_two_things_in_this_clip_1_he_admits/)\n\n&#x200B;\n\n**Steve Huffman aka** u/spez\n\nhttps://preview.redd.it/kluq55z8uei61.jpg?width=4032&format=pjpg&auto=webp&s=a1ee0b81c24ee42e5be4f03997e039f00a30c92b\n\nThis guy right here, amazing work. He dredged the subs to see if Plotkin's allegations were in any way true or not. \n\nThey were not, as you can see in his opening statement [here](https://www.youtube.com/watch?v=vBdGL1X5Sdg&ab_channel=CNBCTelevision)\n\nThey also tried deflecting the conversation in a way that reddit would be the bad guy, Spez didn't allow this and pointed to the virtues of our self governing reddits.\n\nShowing how we would not stand for certain things that would be considered racist or anything of that kind.\n\n**Kenneth \"grifter\" Griffin**\n\n&#x200B;\n\nhttps://preview.redd.it/uhgjz299vei61.jpg?width=2602&format=pjpg&auto=webp&s=66ec81f2161db38c937073b8a7519cc51ddaf72e\n\nI haven't seen such robotic acting out of a person since I've been to a amateur film festival.\n\nThis guy was called out by the senate for his weird acting as this guy was clearly reading off of cue cards, and when asked how many people where in the room he said there where 5.It came to light that over 50% of RH sales went through them, but they said they didn't have control over the halting or manipulating the stock in any way.\n\nWe don't believe you Kenny.\n\nMaybe if you didn't have an entire team of lawyers right there for you to type out on the teleprompter you could've come off as half credible, but we pray for you that someday you'll become a real boy instead of a wood puppet.\n\n&#x200B;\n\n**Vlad \"the stock impaler\" Tenev**\n\n&#x200B;\n\nhttps://preview.redd.it/0fclfqg3wei61.jpg?width=460&format=pjpg&auto=webp&s=a74f0a14ec794c904d1fe030043ae6898650e0de\n\n&#x200B;\n\nHow this idiot runs any company is beyond me.\n\nHe failed to answer even the simplest questions, his entire time on the hearing can be summed up in some easy sentences.\n\n\"thank you, I appreciate that question and the ability to address that\"\n\n\"here is why robinhood is a good company\"<regardless if that was asked or not.\n\nI saw somewhere (cant find the link right now but feel free to correct me) that he was coached by a former SEC employee, this dude was so bad he failed to deliver questions.\n\nHe could not answer simple yes or no questions, when asked he tried going on rants\n\nBut we have learned that robinhood makes their money through something called \"order flow\", meaning they make money by letting someone (citadel mostly) handle their buy and sales.\n\nHe did not have any hard numbers, he didn't know any percentages and this motherfucker had a script he was not programmed to deviate from.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/ozbhxog2xei61.jpg?width=958&format=pjpg&auto=webp&s=a1bbb802d50b705a0c992373cbaa943464768c4b\n\n&#x200B;\n\nThey also all (except for our nice little kitty) lied to congress and perjured themselves.\n\nSaying there are no shorts on gme, there are as seen here \n\n[https://www.reddit.com/r/GME/comments/ln5hs8/xrt\\_shorted\\_85\\_today\\_only\\_160k\\_shares\\_were\\_not/](https://www.reddit.com/r/GME/comments/ln5hs8/xrt_shorted_85_today_only_160k_shares_were_not/)\n\nDFV's most important part, as someone from the committee tried to finally get him to talk as they where not asking our boy jack shit during this[https://www.reddit.com/r/GME/comments/ln6193/love\\_how\\_he\\_calls\\_them\\_stonks\\_to\\_congress\\_dfv/](https://www.reddit.com/r/GME/comments/ln6193/love_how_he_calls_them_stonks_to_congress_dfv/)\n\n&#x200B;\n\n**Also DFV did some redecorating.**\n\nA stream from a month ago you can see the beamer screen is empty, nothing in front of it, but yesterday he hung a motivational poster there for us, with a his Rambo headband[https://www.reddit.com/r/GME/comments/lmsh4t/deepfuckingvalues\\_poster\\_says\\_hang\\_in\\_there\\_hes/](https://www.reddit.com/r/GME/comments/lmsh4t/deepfuckingvalues_poster_says_hang_in_there_hes/)\n\n[https://www.reddit.com/r/GME/comments/lnarfw/the\\_hang\\_in\\_there\\_cat\\_poster\\_had\\_this\\_hidden/](https://www.reddit.com/r/GME/comments/lnarfw/the_hang_in_there_cat_poster_had_this_hidden/)\n\n&#x200B;\n\n**A good summery of why Melvin might be fucked**\n\n[https://www.reddit.com/r/GME/comments/ln4nso/melvin\\_mightve\\_admitted\\_defeat\\_already\\_heres\\_why/](https://www.reddit.com/r/GME/comments/ln4nso/melvin_mightve_admitted_defeat_already_heres_why/)\n\n&#x200B;\n\n**Justin Sun just tweeted**\n\n&#x200B;\n\nhttps://preview.redd.it/60vhuemcyei61.jpg?width=960&format=pjpg&auto=webp&s=f96137306eb2606cd3d60078964d71f1a9e8f07e\n\nMight be nothing, may be a lot.\n\n&#x200B;\n\nAnd for the people who are currently worried about where we find ourselves.\n\nDon't be, even by fundamentals GameStop's stock is worth more than 40 and we all know it.\n\nWe know that the company is shifting to digital, and right now we just have to wait.\n\nI don't know about ya'll but I'm feeling bullish as ever.\n\nMelvin, Citadel and Vlad seemed too squeamish, their body language wasn't that of a confident business man, they where nervous, unmoving, squinting their eyes and tried to keep their bodies as stiff as possible.\n\nIn interviews you can see this with some criminals, this is due to adrenaline and fear, never because of confidence.\n\nIf you look at the body language of DFV he was up, happy, moving and wide eyed, this is a sign of confidence and you can see there is a stark contrast between him and the others.\n\n&#x200B;\n\nSo in short, relax my apes, we may be on to something great yet!\n\nI'm also going out today to get me some nacho's, this dip is delicious.\n\nAnd remember this is a rabbit hole they dug themselves into, there is no other way out than to buy the stocks and guess who will be waiting.\n\nUs!\n\nAs always none of this is financial advice.\n\nAnd if I've missed anything that needs to be included today let me know I'll add it in!\n\nFor apes:🐒🐒🐒💎🙌💎🚀🚀🚀\n\n&#x200B;\n\nEdit: spelling and I fucked up the date.\n\n&#x200B;\n\nEdit 2:  \nApparently there are some FUD posts out and about.  \nSaying we NEED to stay above 40, this seems untrue.  \nAs user u/Fenrir324 pointed out:\n\n>Put is a contract that allows you to sell stocks at a set price. So what would happen is the price dips, Melvin goes and buys 6 million shares and then sells them at 40 bucks, netting the profit. Another party (the writer) is obligated to purchase those back, so while Melvin might make a quick buck, the purchase of 6 million shares would almost certainly be a catalyst. But I'm a fucking ape, I don't really get Put options to begin with, so imma go eat another blueberry crayon.  \n>  \n>IANAFA\n\nso regardless if we go down in price today, we have been holding for weeks now, we will remain holding many more weeks if needed.  \n\n\n[remember, fate loves irony](https://preview.redd.it/s9nwp1psmfi61.jpg?width=828&format=pjpg&auto=webp&s=b1bcaf54f8e86f5c4caee1111ba575f478e0bf18)",
    "title": "Synopsis for 02-18-2021 what we need to know before the market opens DD",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/lnd3t5/synopsis_for_02182021_what_we_need_to_know_before/"
}