{
    "author": "theregoesasupernova",
    "created_utc": 1622288002.0,
    "distinguished": null,
    "edited": false,
    "id": "nnll3e",
    "text_only": true,
    "flair_text": "𝗥𝗲𝘀𝗼𝘂𝗿𝗰𝗲",
    "name": "t3_nnll3e",
    "num_comments": 110,
    "permalink": "/r/DDintoGME/comments/nnll3e/why_your_stop_loss_is_mostly_an_assured_loss_stop/",
    "score": 793,
    "selftext": "**What is stop loss?**\n\nStop Loss is a trading strategy for a volatile market with a bearish tendency. Here you set a specific price limit - which if reached by the stock on its way down - an automated sell order is placed to the broker at that \"specific price\". This limits your loss - in case of a rapid decline of the ticker (especially when you are not monitoring the price in real-time).\n\n**Who sets it?**\n\nYou - the investor sets it - in the broking interface / app.\n\n**How does one decide the stop loss price?**\n\nStop loss price (the price at which you wish to sell off your position in a bearish trending market) - is set using many different inputs or indicators. For example one may set the stop loss at $1 lower than the lower support price. Another may set it at a price at which he is happy with the profit that he makes. Another may set it at a favourite number - just below or far below the current price of the stock (think of apes setting it at some number which has 69 or 420 or any combination of those numbers like 69420 or 69696969 and so on). So there is no specific \"perfect\" way to set the stop loss price - it varies as per the current market conditions, volatility, risk appetite, investment approach etc.\n\n**Why does the stop loss price get hit repeatedly?**\n\nThose of us who set stop loss price - normally observe that it gets hit quite quickly and repeatedly - and our shares are sold and then the stock price goes up. The major reason for this is something called \"Stop Loss Hunting\". Hedge Funds & Whales actively pursue this strategy of \"Stop Loss Hunting\" with great success rate - to buy shares in bulk at lower prices.\n\n**What is Stop Loss Hunting?**\n\nThis is a market strategy where you estimate / find out the existing stop losses in the market set by the other investors (retail largely) - and short the stock price (or drop the share price by other means) to ensure that the stock price hits those preset stop loss levels. Once the stop loss price is hit - the HF can then buy hundreds of thousands of those \"stop loss\" shares at that \"stop loss\" price - in bulk (without being worried of creating a buying pressure - and the consequential upward price rise on the ticker).\n\n**How do the HFs know about my stop loss price?**\n\nIn short - they are privy to much more data and information that retail is not even aware of. Through a strong nexus with the broker (who knows your stop loss settings) - they are able to understand where the stop losses are. For example for a certain stock the Broker (& associated HFs) will know - that there are 50k shares at a stop loss of $ 169 and another 120k shares at $ 175 and another 750k shares at $188 and another 90k at $ 190. Now the current price of the stock is say at $ 220 and it has high price volatility. This information is enough for the HF to short the stock - to $ 190 levels and pick up 90k shares at $ 190 in one fell swoop. They can then further short it to $ 188 & pick up another 750k if they wish.\n\nThis is an extreme example - with very wide gaps between the current and stop loss prices. Many times this gap is in just couple of dollars / few dollars (especially in case of a low volatility tickers) .\n\n**What happens after the HF's buy the \"stop loss\" shares?**\n\nNothing - They do not bother about what happens to the price. They buy and withdraw to hunt other stop losses. The buying pressure that gets created - increases the price appreciably. And the retail investor feels cheated. Its feels like the stock price took a bit of a detour and dipped just to snap up your stop loss shares and went back up... feel very unfair.\n\n**Isnt this illegal?**\n\nIt is very difficult to prove \"stop loss hunting\". Even if you suspect - it is very difficult to establish the chain of events leading to the result.\n\n**How can the broker share your stop loss details to the HFs? Isnt it confidential?**\n\nNothing is confidential (the brokers T&C will clear this up).\n\nWe know of Level 1 and Level 2 data available to investors from brokers at correspondingly higher costs. What are the chances that Level 3 and Level 4 data is being made available at even higher costs to specific buyers? I feel, very high chances.\n\nAnd for those brokers who are tied at the hip to the MMs - its even more detailed and useful data for deciding their positions.\n\nThis is like two teams are competing in an F1 race but one team knows entire details - including the strategy of the other team (all strategies of pitstops, tire combinations being used, fuel consumption and other details). Whereas the other team is competing without any such information at all about the first team. This, by the way, is the current reality of the stock market (HF's / MMs versus Retail Investors). \n\nAnd this is the primary reason why the retail investor **has always been** the bag holder.\n\n**How can you safeguard yourself?**\n\nBest option is - Remove stop losses - unless you are ok to let go of the shares at those prices.\n\nIf you need to set them - corelate the stop losses with other technical and fundamental analysis - to identify whether it is essential to put them. Some put them only when there is significantly high chance that the stock price may fall drastically and they, personally, are not available to track it in real time to take sell decisions. But know that your stop losses **will be known** to the HF's and Brokers and MM's who wish to bet against your positions. Any way you look at it - you lose.\n\n**I have set stop losses but they were not triggered?**\n\nWell like I explained in the example **\"How do the HFs know about my stop loss price?\"** \\- it may be that your stop loss is just outside (below) the \"target price\" of the HF. Or there may be very few shares that the HF may get at the price you have set the stop loss to - that it is unattractive for them to take the effort of dropping the share price to that level.\n\n**How is this relevant to GME?** \n\nDuring the MOASS - if you set stop losses - **know that, the SHFs will know exactly where the stop losses are set**. And they can then decide their \"shorting\" strategy to ensure that they win (by shorting it to the stop loss price - hitting it - buying your shares in bulk and covering their naked shorts) and you lose. \n\n**Mandatory Disclaimer: Not investment advice. Do your own DD, Make your own choices, Be responsible for your own calls. And be good and loving to Plants, Animals and Humans...**",
    "title": "Why your Stop Loss is mostly an Assured Loss - Stop Loss Hunting",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nnll3e/why_your_stop_loss_is_mostly_an_assured_loss_stop/"
}