{
    "author": "Sioned-Song",
    "created_utc": 1619666798.0,
    "distinguished": null,
    "edited": 1619711711.0,
    "id": "n0vtbu",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_n0vtbu",
    "num_comments": 459,
    "permalink": "/r/GME/comments/n0vtbu/how_gamestop_could_issue_crypto_dividends_and/",
    "score": 3635,
    "selftext": "Everyone has already discussed how Overstock issued a crypto dividend to shareholders to force short sellers to close. Shorters couldn't pay that dividend because they couldn't obtain the exclusive crypto. BUT Overstock has been stuck in litigation over that move for years, and with a recent appeal they're still not done with the lawsuits from short sellers.\n\nGamestop has advertised job postings looking for experience in crypto, blockchain, and NFT's. They could be gearing up for their own crypto coin to use in the Gamestop ecosystem. But if they tried to issue a crypto dividend like Overstock did, they would have the same legal challenges, *unless*...\n\nWhat if Gamestop issued enough crypto coins to sell to the official shorts as well? So they create enough coins for their 70M actual shares PLUS another 11M coins to sell to the officially reported 11M shorted shares. For all those officially reported shorts, it would be no different than a cash dividend they had to cover. So Gamestop couldn't be accused of the same thing Overstock was - GME actually made sure the short sellers could purchase the crypto they needed to pay the dividend.\n\nNow if there existed hundreds of millions of unreported shorts and naked shorts hidden in FTD's, options, and shorted ETF's that were forced to cover because they couldn't pay the dividend, well Gamestop couldn't be expected to plan for those shorts if they weren't reported.\n\nEdit: TL:DR: Overstock issued crypto dividends =  #total outstanding shares, forcing shorters to close because they couldn't pay the dividend. They're now fighting lawsuits from short sellers for illegally forcing a short squeeze. If Gamestop issued crypto dividends = #shares + #reported shorts (sold, not given to legal short sellers), then they made good faith effort to not force a squeeze. It would be all the illegal naked shorting that forced a squeeze.\n\nEdit2: After this post, I received my first chat request \"Hi there. I work for Dubistas Wine and would like to offer you the chance to work for us. You can start by removing your last post as it's getting the wrong kind of attention. Cheers, Patrick Bamaudi\" --- I feel like I'm now a true GME ape!\n\nEdit3: My account isn't old enough to post at Superstonk, if anyone wants to crosspost.",
    "title": "How Gamestop could issue crypto dividends and still remain legally blameless for the squeeze...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/n0vtbu/how_gamestop_could_issue_crypto_dividends_and/"
}