{
    "author": "MontyRohde",
    "created_utc": 1616357079.0,
    "distinguished": null,
    "edited": 1616381232.0,
    "id": "ma4udz",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_ma4udz",
    "num_comments": 264,
    "permalink": "/r/GME/comments/ma4udz/etf_fuckery_volume_volcanos/",
    "score": 5880,
    "selftext": "\\*Not financial advice I am a stupid crayon munching ape who before I got involved with this crazy shit was nothing more than a passive index investor.\n\n\\*The following statements are me speculating on bizarre activity on a volume chart if you have a better idea of what's going on by all means correct me.  I'm am posting this in hopes that smarter apes will confirm these observations and make better DD or refute my observation.\n\n\\---\n\nBased on other people making observations on oddly high trading volume occurring in XRT I decided to take a peak at other ETFs.  While you can see spikes everywhere I'll share the most bizarre example I've found.\n\nIntroducing: **SYLD**!\n\nSYLD isn't particularly well known because it is a smaller ETF, under 3 million shares, containing a smaller amount of GME.  0.45% by weight, currently 4.71% by value.\n\nUnderstand that ETFs in general are supposed to be sleepy investing tools.  A fund manager comes up with a concept, buys the shares, and sells the idea to the public.  In general ETFs are low volatility and aren't actively traded.\n\nSYLD generally has a 5 minute trading volume in the low hundreds, occasionally it rises into the thousands.  Then crazy shit like this happens.\n\n&#x200B;\n\n[5 day volume](https://preview.redd.it/ywko5t8clfo61.png?width=1302&format=png&auto=webp&s=6e20fe4de1c44bd8c0d7b71c6a5c8cc6bb9970ec)\n\n&#x200B;\n\nEdit 2: Smarter ape talked about how there's different analysis of how deep in shit the shorts are.  This was created by  Gafgarian and Johnny Dankseed  and posted by someone else: [https://www.reddit.com/r/GME/comments/m7n0rm/hiding\\_ftds\\_in\\_dark\\_pool\\_calls/](https://www.reddit.com/r/GME/comments/m7n0rm/hiding_ftds_in_dark_pool_calls/)\n\nBasically it goes into buying calls at stupidly high prices and exercising them to give dumb apes that glorious sale on 3/10.  Different content, more in depth analysis.  Worth reading if you haven't seen it already.  More words, less pictures.  I will promote it here because it was posted during the week when the shills are more active.  Apparently they get Sunday off.",
    "title": "ETF Fuckery – Volume volcanos",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/ma4udz/etf_fuckery_volume_volcanos/"
}