{
    "author": "jsmar18",
    "created_utc": 1616329215.0,
    "distinguished": null,
    "edited": 1616333457.0,
    "id": "m9vizg",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m9vizg",
    "num_comments": 37,
    "permalink": "/r/GME/comments/m9vizg/looking_for_a_job_you_wont_find_one_at_shitadel/",
    "score": 614,
    "selftext": "Fellow apes,\n\nIt's late-night on a Sunday Downunder, so what better time to sift through some company's LinkedIn profiles? For purposes of seeing if bots pick up on keywords to auto-downvote, I'll refer to our SHF friend as S̨̥̫͎̭ͯ̿̔̀ͅhî̩́t̲͎̩̱͔́̋̀adè̑ͧ̌l̘̝̙̃ͤ͂̾̆ and Me̿̔̉l̘̝̙̃ͤ͂̾̆vî̩́n to hopefully fuck around with any wildcard/regex logic they have.\n\nTo preface this, if you work in industries such as finance, SaaS, etc... A company will need to advertise through LinkedIn to reach the relevant audience. So saying this, let's review a bunch of companies who are in the same industry as S̨̥̫͎̭ͯ̿̔̀ͅhî̩́t̲͎̩̱͔́̋̀adè̑ͧ̌l̘̝̙̃ͤ͂̾̆ and Me̿̔̉l̘̝̙̃ͤ͂̾̆vî̩́n and are derived from the \"People also viewed...\" recommendations of LinkedIn.\n\n[Two Sigma](https://www.linkedin.com/company/two-sigma-investments/): 1.67k Employees, **130** Job Openings\n\n[Jane Street](https://www.linkedin.com/company/jane-street-global/): 964 Employees, **22** Job Openings\n\n[Millennium](https://www.linkedin.com/company/millennium-partners/jobs/): 2.83k Employees, **128** Job Openings\n\n[Jump Trading](https://www.linkedin.com/company/jump-trading/): 874 Employees, **72** Job Openings\n\n[Bridgewater Associates](https://www.linkedin.com/company/bridgewater-associates/): 1.58k Employees, **22** Job Openings\n\n[Goldman Sachs](https://www.linkedin.com/company/goldman-sachs/): 60.64k Employees, **3k** Job Openings\n\n[AQR Capital Management](https://www.linkedin.com/company/aqr-capital-management/jobs/): 780 Employees, **24** Job Openings\n\nYou get the gist.... Each and every one of these financial/investment firms, even the small ones have job openings advertised. Now let's check out our friends. Me̿̔̉l̘̝̙̃ͤ͂̾̆vî̩́n has already nuked their website, so there are no openings as one would expect, they are also relatively small with only \\~22 employees.\n\n[S̨̥̫͎̭ͯ̿̔̀ͅhî̩́t̲͎̩̱͔́̋̀adè̑ͧ̌l̘̝̙̃ͤ͂̾̆](https://www.linkedin.com/company/citadel-securities/): 1.0k Employees, **0 Job Openings.**\n\nIf you head through to their website, there are [job openings](https://www.citadel.com/careers/open-positions/quantitative-research/) displayed there, but sure as shit, no one will find them unless they are advertised through the main professional advertising platform.\n\nTo back this up further, their LinkedIn has gone near radio-quiet (similar to their Twitter). Only one post since shit hit the fan for them. They were pretty active, making multiple posts per month before Late January 2021.\n\n***What does this tell us?***\n\nTwitter tells us that they want a low public profile, however, seeing they are not wanting to advertise any job openings it's likey they know they are in the shitter. Why would you bother hiring employees to have them lose their jobs a few months later (this assume they have empathy or morals)? It'd also save on cash, that they oh so desperately need. I'm confident if one digs deeper they would find other overhead cash saving methods, e.g. shedding office space, terminating leases.\n\nI have been searching to uncover if they've also been shedding employees to save additional overheads to no avail. If anyone has some data/proof of this that'd be great as it'd further support this hypothesis.\n\n**TLDR;** While all their rivals are going about BAU, S̨̥̫͎̭ͯ̿̔̀ͅhî̩́t̲͎̩̱͔́̋̀adè̑ͧ̌l̘̝̙̃ͤ͂̾̆ has stopped hiring in a bid to save every penny before their impending doom.\n\n**P.s.** I'll also note any findings I uncover through the use of the funky letters above.  **💎🙌**\n\n**EDIT:** Findings given post has been up for an hour, I've been running a scraper which refreshes this posts' [JSON](https://www.reddit.com/r/GME/comments/m9vizg/looking_for_a_job_you_wont_find_one_at_shitadel/.json) and stores the upvotes and upvote ratio. So far I have not seen the upvote ratio drop below 99%, which possibly suggests the funky wording above might fuck around with their scraping.\n\nI suggest we all start using variations of these funky letters, entering whitespaces, adding hyphens between characters etc... to *FUCK WITH THEIR BOTS*. In my case I'm using Unicode accents Me̿̔̉l̘̝̙̃ͤ͂̾̆vî̩́n =  **Me**\\\\u033f\\\\u0314\\\\u0309**l**\\\\u0303\\\\u0364\\\\u0342\\\\u033e\\\\u0306\\\\u0318\\\\u031d\\\\u0319**vi**\\\\u0302\\\\u0341\\\\u0329**n**.\n\n&#x200B;",
    "title": "Looking for a Job? You won't find one at S̨̥̫͎̭ͯ̿̔̀ͅhî̩́t̲͎̩̱͔́̋̀adè̑ͧ̌l̘̝̙̃ͤ͂̾̆",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m9vizg/looking_for_a_job_you_wont_find_one_at_shitadel/"
}