{
    "author": "Leaglese",
    "created_utc": 1616358562.0,
    "distinguished": null,
    "edited": 1616369839.0,
    "id": "ma5did",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_ma5did",
    "num_comments": 207,
    "permalink": "/r/GME/comments/ma5did/nscc_clearing_fund_dd_why_the_long_whales_are/",
    "score": 2921,
    "selftext": "Given the TLDR at the top has proven popular elsewhere, here's mine:\n\nTLDR - members of the NSCC are incentivised to take the opposite position on a bad trade for another member, therefore they aren't 'heros', they are trying to protect themselves from paying out in accordance with the NSCC's rules\n\nTLDRTLDR - sharks eating sharks\n\nWelcome to another in my legal series DD, where long whales are joining the fight out of preservation, and to them retail doesn't matter.\n\nHowdy apes. Let's all put on our jackets, it's awful shilly in here. Fingers crossed we get past the downvote / remove upvote shill tomfoolery we've been assaulted with in recent days.\n\nOr I mean, if you think the post is shit then just let the bots do the work for you.\n\nA lot has been said about the 'hero' long whales entering the fray on the side of retail investors, I'm going to try to explain an NSCC rule on the Clearing Fund, which in my view, may explain why they have decided to do so.\n\nUnfortunately, I don't think the long whales are joining our side owing to their good nature, but rather for both survival and greed purposes. \n\nIn my view, any hedge fund with billions is so divorced from the everyday reality these emotions wouldn't even register.\n\nAs always, this is neither financial or legal advice and you should always do your own thorough research before listening to an ape on the internet.\n\nLet's dig in. Buckle up apes, this explanation and speculation may get a little long and may require my customary tinfoil hat. Let's start with the rule.\n\nThe NSCC rules I refer to can be found [here](https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.dtcc.com/~/media/Files/Downloads/legal/rules/nscc_rules.pdf&ved=2ahUKEwjH48uhncLvAhW0SxUIHSQpDuQQFjAAegQIBBAC&usg=AOvVaw0avQW3P4BRlgzpomtYOld0) and specifically, I'm referring to Rule 4 (page start 48 of the doc); the dreaded Clearing Fund \n\n**cue dramatic music**\n\nIf you've been following the DD on this excellent subreddit, you'll know all about the new and old SLD payment rule which requires a payment to the NSCC from those 30 or fewer members the NSCC determines fuk. \n\nThe Clearing Fund is entirely different and it affects every single possible type of member, and the minimum deposit from each is $10,000, where they have around 4,000 participants. \n\nWhat's the Clearing Fund? Well put simply it's the 'uh oh even our SLD payment won't fix the fuck up' fund which is taken from all members, kind of like a participation fee.\n\nShould each participant deposit the minimum alone it would amount to a (relatively) measly $40m Clearing Fund, but our friends at the NSCC reserve the right to crank the deposited sum up / request the full fuck up fee based on numerous factors, of any **and all members**\n\n*Oh a quick aside, a member may choose to add extra into the Clearing Fund if they feel the NSCC has miscalculated, but in my mind the only reason a participant would choose to do so is to stop their ass being liquidated, so this rule is like a chocolate teapot, it may look good but it's pointless*\n\nInterestingly, the NSCC reserves the right to take the debt for the Clearing Fund either as cold hard cash, **or in securities**, which in my view could represent the interesting beta position of GME, given its inverse relationship to the market as a whole.\n\nPut simply, as Clearing Fund deposits increase and the participant is strapped for cash, NSCC may liquidate securities to meet the deposit requirement, therefore giving it a negative beta. Something to consider for those beta loving apes.\n\nThe NSCC sets out three purposes for the Clearing Fund, these are:\n\nI. To ensure each member essentially settles any pending security transactions;\n\n\nII. **To provide liquidity in order to provide the NSCC the ability to either use cash or securities for liquidity or hypothecation (i.e. collateral with the right to seize a security) it needs to settle positions**; and\n\n\nIII. For investment purposes.\n\n**The important point here is that the NSCC reserves the right to use the Clearing Fund collected from all members for pretty much any purpose it chooses, including if 1 of the 4000 goes tits up, hey Citadel**\n\nIt goes on to say should even the securities of a member not be enough, we'll bill your ass **in addition to the SLD payment** to get it. \n\nDon't worry apes, the NSCC and therefore the DTCC will *always* settle with the apes first and bill their members later, this is literally their purpose.\n\nIf they fail to pay the right amount into the Clearing Fund, they can liquidate your ass to cover *their* asses and stop that member using the market.\n\nBut wait, there's **more**\n\n**If a member fucks up so badly it could cause a problem to the NSCC's ability to settle trades, well then it becomes every member's problem and risks their deposit to the Clearing Fund**\n\n**Further, one member's default becomes EVERY member's problem if they declare a serious event, essentially, every member HAS TO MEET THE DEFAULTING MEMBER'S FUCK UP WITH PAYMENT OR SECURITIES**\n\n**Enter the incentive for the long whales**\n\nWhilst those who caused the problem are on the hook for the biggest sums, each and every member must pay a fee towards the screw up as a price of membership to the NSCC, as mentioned earlier.\n\nPut as simply as possible, the NSCC reserves the right to scalp each and every member for any sum to resolve an issue caused by any other member. They don't do margin like we know it, they just make their members pay the bill.\n\n**This provides the incentive for many other member whales to take the opposite position of a trade they see going bad, hence my theory the large whales are doing this ONLY to protect their own capital, unless they decide to not be a member anymore, and no big whale who didn't fuck up will EVER do this**\n\nOh and guess what? If the other members fail to pay, **the NSCC can liquidate YOUR ass too**\n\nOh guess what too? **If you colluded to help, say Citadel escape liability in the dark pool, it's YOUR ass on the line**\n\nFinally, even if the above should all fail, **the NSCC will utilise insurance to settle as a last resort, but it'll damn well take all it can from everyone involved before doing so**\n\nI hope this alleviates the concerns surrounding potential dark pool FUD, members are literally warned they may make their shitty bed if they try to help a fucked member by using dark pools to push FTDs, i.e. that trade becomes YOUR problem if you help them.\n\nTherefore these long whales aren't coming to retails rescue, they're coming to their own and the rules to me deliberately incentivise them to fuck over the other member to protect their clients.\n\nWhilst many have had issues with the SEC and the government's agencies taking little action, self regulation from private bodies almost ensures that when, **not if**, Citadel defaults, there will be plenty of big whales (not even including the retail whale) who will force them into the ground to save their own asses.\n\nIn a way, making the sharks eat the sharks is the best form of regulation. It incentivises their greed to remove a competitor and gain their market share whilst simultaneously covering their own ass.\n\nDon't therefore believe the long whales are in this for you apes, but be damned sure they're just as eager to ride the wave to destroy Citadel just as much as we are.",
    "title": "NSCC Clearing Fund DD - Why the long whales are acting to protect themselves and not retail",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/ma5did/nscc_clearing_fund_dd_why_the_long_whales_are/"
}