{
    "author": "dlauer",
    "created_utc": 1623087284.0,
    "distinguished": null,
    "edited": false,
    "id": "nuidlk",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nuidlk",
    "num_comments": 374,
    "permalink": "/r/Superstonk/comments/nuidlk/finra_regulatory_notice_2119_new_short_sale/",
    "score": 10269,
    "selftext": "Hi everyone,\n\nMy apologies for not being more active the last two weeks or so - life has a tendency to get in the way. But part of that involves something that I'm very excited to announce on here, hopefully in another week or two.\n\nToday I want to call your attention to FINRA's most [regulatory notice - 21-19](https://www.finra.org/rules-guidance/notices/21-19).\n\nThis is clearly in response to the volatility involving GME and AMC, amongst others. FINRA is proposing some very significant changes to short-sale related disclosures. This is a big set of changes, and it looks very encouraging to me. The headlines are:\n\n* Consolidation of short interest data publication, centralized on the FINRA website\n* Changes to the content of short interest data\n   * Require firms to segregate short interest held in proprietary accounts vs that held in customer accounts.\n   * Report to FINRA account-level short interest (not for publication).\n   * Report synthetic short positions. Interestingly they only note options contracts, and do not include security-based swaps. They are asking for comments on this.\n   * Loan obligations from arranged financing to better reflect actual short sentiment.\n   * Total shares outstanding and the public float.\n* FINRA is considering reducing reporting timeframe to daily or weekly, and is asking for comments on this.\n* Information on allocations of FTD positions - a daily report of FTD allocations at the security level, with applicable closeout obligation. This would not be for publication, but to allow FINRA to conduct more effective investigations.\n* They're asking for comments on whether to create a reporting framework around stock lending activity. \n\nIf you visit the page I linked above, you can see the full details of the regulatory notice, and also all of FINRA's questions for public comment.\n\nSubmitting a comment letter can be a very effective way of advocating for change and showing FINRA that there is demand for a far more rigorous disclosure regime. The best comment letters are concise, well cited with evidence to back up claims, and unemotional. I know this is a hot button topic, but my feeling is that FINRA is trying to figure out what to do here, and I would urge you to engage them in good faith. \n\nPlease let me know if you have any questions, I'll do my best to respond to as many as I can.",
    "title": "FINRA Regulatory Notice 21-19: New Short Sale Reporting Regime",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/Superstonk/comments/nuidlk/finra_regulatory_notice_2119_new_short_sale/"
}