{
    "author": "DigitalWizrd",
    "created_utc": 1623161100.0,
    "distinguished": null,
    "edited": 1623196913.0,
    "id": "nv4s4o",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_nv4s4o",
    "num_comments": 313,
    "permalink": "/r/Superstonk/comments/nv4s4o/be_wary_this_mornings_price_action_is_not_the/",
    "score": 9854,
    "selftext": "Ok so the price is looking dope today right? \n\n\nWRONG. The price is wrong. \n\nTSLA is green today, the volume isn't that crazy, my account doesn't look like a phone number, no voting results are out, and my tits aren't even jacked. \n\nWhat is $330? That supposed to get us distracted? Get that shit outta here. Watch this drop back to $180 and the msm articles start talking about new \"meme stock millionaires\". But it'll all be a lie cus this baby is primed like Optimus and when that moass engine really starts revving you'll hear the roar of excited apes round the world. \n\nThis isn't even our final form. Fuck this $330 BS. I'm waiting for $20000000 to show up in that ticker.\n\n\nEdit: Alright the morning run has settled a bit. Check those volume candles. It's all for show today. Time to buy some more! I appreciate everyone asking \"who thought this was the squeeze?\" Because I'm not sure if anyone even thought that but of they did I'm happy to remind folks:\n\nThe squeeze is when there's severe trading halts\nThe squeeze is when big green dildos fill up your screen. \nThe squeeze is when the rest of the market is crumbling and we're still holding. \nThe squeeze is coming, but it's not here yet. \n\nEdit 2: Removed \"is that a share price for ants?\" because I love our ant brethren. Apes and ants together strong. \n\nBuy. Hold. That's all we gotta do. \n\n🦍🦍🦍🦍🚀🚀🚀🚀🌕🌕🌕💎👍",
    "title": "Be wary! This morning's price action IS NOT THE SQUEEZE. No squeeze indicators have been hit!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nv4s4o/be_wary_this_mornings_price_action_is_not_the/"
}