{
    "author": "plants69",
    "created_utc": 1621553722.0,
    "distinguished": null,
    "edited": 1621562434.0,
    "id": "nhepn1",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nhepn1",
    "num_comments": 657,
    "permalink": "/r/Superstonk/comments/nhepn1/the_imminent_liquidity_crisis_reverse_repos_usage/",
    "score": 7029,
    "selftext": "# Intro:\n\nMany of us Apes have been hearing about Reverse Repos and the liquidity crisis as of late, but some may not understand what that means or looks like, and I'm going to explain it & show the relevant data as simply and clearly as possible so that even a brain as smooth as a watermelon could form a wrinkle or two. Technical explanations/suit jargon are simplified by the emojis 🍌🦍\n\nNo TLDR but if you read the text by the emojis 🍌🦍 you can learn a lot!\n\n# Reverse Repo Usage & the Imminent Liquidity Crisis\n\n**The daily aggregate of reverse repo transactions is signaling a MAJOR & IMMINENT liquidity crisis. It is only a matter of time before the Fed has to taper the money supply or else risk long-term substantial inflation.**\n\n[Reverse Repo Usage in Billions USD. IT'S ALREADY OUTDATED!](https://preview.redd.it/ghbe1lcd1d071.jpg?width=500&format=pjpg&auto=webp&s=ba88d163d87facfcd0bf4914e0b08bfa0dca72ff)\n\n# I like the lines and colors but what does this mean? 🍌🦍\n\n* **Overnight Reverse Repurchase Agreements:** short-term (often overnight timeline) purchase of securities with the agreement to sell them back, usually at a higher price.🍌🦍 **The fed is buying back corporate & US treasury bonds in accordance with Quantitative Easing to reduce the supply of money.**\n* **Quantitative Easing:** what the fed likes to call money-printing. the increase in Reverse Repos is signaling a corresponding increase in Quantitative Easing.\n* **Tapering:** starting to turn off the money printer\n\n# What's a liquidity crisis?\n\n* **Liquidity is determined by how quickly a business can convert its assets into cash**\n* 🍌🦍A lack of liquidity can occur when a market has very few buyers or sellers or both.\n* One of the biggest sources of liquidity in the US markets comes from repos & reverse repo agreements. The repo market exists for short-term (often overnight) transactions\n   * Repo = the buyer purchases some securities  **🍌 for a short-term period**\n   * **Reverse Repo = the buyer agrees to sell those securities**  **🍌back at a slightly higher price**\n* 🍌🦍A liquidity crisis can happen when all of the banks decide to lend all of their bananas out because they make a fortune collecting fees. What happens when the market goes red? No one can pay each other back because banks & hedgefunds leveraged themselves to the tits and rehypothecated all of their bananas into synthetic banana ice cream, and they lent all of that out too. When they run out of bananas, they run out of liquidity. The music stops.\n* **If institutions lack the liquidity to perform their daily operations they MUST sell off assets and securities to survive (avoid failing a margin call). If enough institutions lack liquidity all at once, this can trigger market-wide sell-offs.**\n\n# What does a liquidity crisis look like? 🍌🦍\n\nIt looks like this:\n\n**Daily Aggregate Reverse Repo Usage (Collateral Type: Treasury)**\n\n5/5/21 - 162.800 Billion\n\n5/6/21 - 154.921 Billion\n\n5/7/21 - 161.856 Billion\n\n5/10/21 - 175.548 Billion\n\n5/11/21 - 181.753 Billion\n\n5/12/21 - 209.257 Billion\n\n5/13/21 - 235.217 Billion\n\n5/14/21 - 241.185 Billion\n\n5/17/21 - 208.960 Billion\n\n5/18/21 - 243.470 Billion\n\n5/19/21 - 293.998 Billion\n\n**5/20/21 - 351.121 Billion** **🍌HOLY SHIT THAT'S A LOT OF BANANAS!!!!!**\n\n# TODAY we surpassed the highest amount of Reverse Repo Purchases on the March 2020 Crash at $285 Billion by over $65 billion!\n\n🍌Is this sustainable? Fuck no. It's either tapering (printer doesn't Brrrrr anymore) or the USD will eventually become 1:1 with the Venezuelan Bolivar.\n\n🧠🧠🧠Zoltan Pozsar (Managing Director at Credit Suisse): \"The \\[Reverse Repo Purchase\\] cap is a key piece of our warehousing puzzle: the $1 trillion of reserves we’re trying to find a warehouse for are currently warehoused by the Treasury; **U.S. banks can’t add another $1 trillion to their warehouses, and money funds can’t warehouse $1 trillion unless the Fed decides to uncap the Reverse Repo Purchase facility**. Unless the Reverse Repo Purchase facility gets uncapped, bill and repo rates can trade negative and **money funds may turn away inflows, as they won’t invest at negative rates.\"**\n\n🍌🦍 What mean? The fed has trapped themselves & banks in a corner after producing too much cash through Quantitative Easing. High Reverse Repo Purchase usage mid-quarter (spikes at end of quarter are typical) signals that **the banks simply don't have the balance sheets to accept the excess reserves. They are forced to park the reserves right back with the Fed using the Overnight Reverse Repo Purchase**. This can have disastrous consequences if Quantitative Easing (printing) continues at its current trajectory.\n\n🍌🦍🍌🦍🍌🦍Even simpler: **Repo rates go negative because collateral is in high borrowing demand (Fed buying back through the Quantitative Easing program decreases supply). There is a banana shortage caused by printing. In order to balance the effects of printing, new bananas end up recycled right back into the overnight reverse repos** and as the toxic cycle continues, more bananas are produced in the Reverse Repo Purchases, bought and paid for by Quantitative Easing brrrr. See the problem? \n\n🍌🍌🍌🍌🍌🍌🍌🍌🍌🦍\n\nCurrently the liquidity in the US stock market is entirely artificial because the fed won't stop brrrrr because **the slightest bit of federal tapering could shut down the entire game. it's either no more bananas for anyone, or so many bananas that the value of bananas becomes near worthless.**\n\n**No bananas, no liquidity.**\n\n# Okay, I learned a few new words, but what does this have to do with my favorite stonk? 🍌🦍\n\nNo liquidity means that major institutions will have to sell off securities & crypt0 to increase their capital supply. If they can't increase their capital supply to meet a certain threshold, margin will ring and ask for a deposit. 🍌🦍 If shitadel & hedgefunds can't make a deposit (aka prove liquidity to be able to cover positions), **DTCC will forcibly close all of their positions and GME will be catapulted into Andromeda and beyond** 🚀",
    "title": "The Imminent Liquidity Crisis & Reverse Repos Usage - Smooth Brain Edition",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhepn1/the_imminent_liquidity_crisis_reverse_repos_usage/"
}