{
    "author": "nktm85",
    "created_utc": 1616782488.0,
    "distinguished": null,
    "edited": 1616789088.0,
    "id": "mdus7g",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_mdus7g",
    "num_comments": 42,
    "permalink": "/r/GME/comments/mdus7g/hedge_funds_didnt_take_this_into_account_when/",
    "score": 546,
    "selftext": "Long time lurker here...  Bought into GME back in late Jan a few days before the RH incident.  Won't post my position, but I can say it's gone way up since then (Edit: not in value, but # of shares...)\n\nAnyways... I was excited to finally get enough karma to make my first ever post on this sub (edit: lol just checked and doesn't seem like there is the 100 karma to post anymore...)\n\nAnyways, obligatory note: I am definitely not a cat, and this is definitely not financial advice.  I am just a smoothed-brained ape who wants to share something with you all.\n\nHedge Funds, Market Makers, brokerages (cough...RH), and other prominent players may have:\n\n1. Super smart and the brightest people who know the markets\n2. Proprietary software for market analysis\n3. Lots, and LOTS of capital to play with, but from my understanding it is other people's money like Michael Jordan's and Steve Cohen, aka rich people's/companies.\n4. Fancy Offices and Buildings where they operate out of\n5. Advanced computer trading algorithms that are built solely to generate the maximum amount of profits no matter what.\n\nThey have, for years, beat down the little guy and taken advantage of them, and they continued to get rich because they leveraged the market to their advantage.  Their short positions were almost guaranteed to make money because what could go wrong?\n\nWhat they didn't account for, was our **HUMANITY**.  I've lurked and I've seen exactly what everyone is fighting for.  Yes, tendies are great, but what they didn't realize is that by kicking the can down the road, they helped forge us into a diamond-handed community of apes.  And when I say we as a collective, I'm not saying market manipulation/colluding because we all individually do our own DD and make our own decisions on what to do with that info.  But what I do mean as a recent example, are the attacks on u/heyitspixel and u/rensole (and I assume others) and how our community protected our own.  I, for one, cannot believe they could stoop this low to actually threatening a person's well-being.  But when the animal is cornered, it will do anything...especially when money is involved.  I hope the proper authorities get involved and takes appropriate actions so both, and any others who received threats, will feel safe again.\n\nI first followed WSB's and left because I just couldn't take watching the sub being overtaken by shills and FUD.  At the time, I did not recognize how much psychological warfare this would be.  I am just a lurker, so I can only imagine what some of the prominent DD writers have been facing.  I'll be honest, it was definitely hard to watch my accounts that went red when stock dropped to $40.  But finding r/GME was what I needed to continue in my resolve.  The more time the HF's give us, the stronger the bond of community and that's what fancy schmancy computer algorithms can never account for.  This is exactly the opposite of what they thought would happen... meaning the longer the squeeze doesn't happen more people will give up and lose interest.  And that is exactly why I think they just keep doubling down because their models and strategies are based on the fact that we will give into FUD.  Not today, not ever for me.  Pressure is what forms diamonds, and the pressure I experienced since January has formed these diamond hands and there's nothing they can do about that anymore.  I hope that is the same for others out there.\n\nI want to thank all the mods for tirelessly keeping this sub alive and free of shills and bots.  I know many of you have personal lives and other things going on, but like I said, we've developed a community here, and I trust my fellow apes here.  To be honest, my initial exit strategy was to sell a couple of shares to recoup my initial investment, but because of the constant and blatant manipulation, the attacks on our own, and don't even get me started on MSM corruption, I will be holding all my shares to  MACS0647-JD (the furthest known galaxy from earth).  It may take some more time, but since we are going past the moon and Andromeda, we'll need a bigger and better rocket.  Looks like we are building that rocket as we speak.\n\nI like the stock, I like the company and the direction it is going, and we are already seeing the pieces come together.  I see a bright future with this company.\n\nThanks for hearing my rant.\n\nEdit:  I thoroughly enjoy some of the light-hearted meme posts as they helped lighten the mood.  So thanks everyone for making them.  I've also been liking everything since 2 weeks ago to combat the downvotes...\n\nEdit: I can't believe I forgot...  💎💎💎🤚🤚🤚🚀🚀🚀🦍🦍🦍🌚🌚🌚",
    "title": "Hedge funds didn't take this into account when shorting!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mdus7g/hedge_funds_didnt_take_this_into_account_when/"
}