{
    "author": "mybustersword",
    "created_utc": 1622867219.0,
    "distinguished": null,
    "edited": 1623102892.0,
    "id": "nsnl20",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_nsnl20",
    "num_comments": 85,
    "permalink": "/r/GME/comments/nsnl20/i_need_to_ask_a_few_questions_about_satori_if_you/",
    "score": 612,
    "selftext": "***Edit*** additional info added at the bottom. \n\nEdit 2- I do not plan on killing myself or deleting my posts. I am not depressed. \n\nFellow apes, I understand I have incited some distrust. I am here to tell you, I believe in one thing-the freedom to know the truth. It's what drives us here to learn about the hidden, synthetic share game of hot potato the hedges are playing. It's what drives us all, the freedom for honest and open discussion. \n\nMy concern is not with gme. My concern is with the implication that a small team of reddit users developed - in secret- an advanced and complicated AI that emerging technical companies are only now developing and implicating - on their on time and their own dime. The angle, I am not sure of. Only that I think it warrants looking into and we are owed an explanation of how a small group of unknown reddit users were handed the ability to directly impact reddits operations and moderation on such a large scale. Please, an open mind. \n\n\nhttps://nypost.com/2021/05/18/conde-nast-may-have-a-place-in-the-warner-media-discovery-merger/\n\nAT&T  is recently looking to sell off Warner media. They are likely going to sell to Reddit majority stakeholder Advanced Publications. AT&T's advertising agency is Xandr. \n\nWho recently partnered with xandr? This year? You guessed it, human security, developer of the SATORI AI. https://www.humansecurity.com/newsroom/xandr-and-human-formerly-white-ops-expand-protection-against-sophisticated-bot-attacks-and-fraud\n\n────────\n\nReddit partners with Omnicom Media Group https://www.adexchanger.com/ad-exchange-news/friday-12032021/ \n\n\"The deal means that OMG clients will have access to Reddit’s creative strategy team, education and training tools, early ad product and feature testing, measurement and reporting, data, and other offerings to more effectively engage with Reddit’s 52 million daily active users. \"\n\nHuman securities is a client of OMG. Which means that Human Securities has access to the above Reddit services \n\n\nhttps://www.linkedin.com/in/abigailshchur\n\nPer this and several other employees of reddit, Reddit is expanding its machine learning team as of recent. Which is what I assume to be for site wide implementation of the Satori AI \n\n\nhttp://programmatic.co.nz/2021/05/27/reddit-releasing-several-updates-for-moderators/ \n\nSeveral updates for MODS were released mere days  before SATORI is unleashed \n\n\nAnd finally, for now at least,\n\n\"Digital Shadows, the leader in digital risk protection, today announces powerful upcoming features to its SearchLight™ solution providing greater insight into threat actors than ever before. By integrating with MITRE ATT&CK\n\nThe new features draw on this collective global security ‘brain’ but provide security professionals with visualizations relevant to their specific organization so they can quickly determine the relevance or danger of a particular threat actor or incident to them. This insight is further enhanced by Digital Shadows own analysis of threat actors and updates within the same library. Combined, it means Digital Shadows customers gain actionable remediation advice against specific threat actors before they may pose a risk.\"\n\nhttps://securityboulevard.com/2021/04/digital-shadows-announces-new-threat-intelligence-capabilities-mapping-to-mitre-attck-framework/\n\nLook-this is the EXACT Same program as Satori on Superstonk. It's being implemented by Digital Shadows. Now.... \n\nDan lowden : Prior to joining White Ops, Lowden served as the CMO at Digital Shadows, who was named the \"Leader\" in 2018 Forrester New Wave Report for Digital Risk Protection.\n\nhttps://www.humansecurity.com/newsroom/white-ops-names-industry-leader-dan-lowden-chief-marketing-officer\n\nAgain, we have two MAJOR companies with backing by big banks and hedge funds, who clearly believe in the AI. They have the SAME program developed at the SAME time as Satori is implemented on reddit. And mind you, Satori was supposedly developed by a small group of redditors. How do we expect a small team of redditors to create for free what several large, multi-institutionally backed emerging tech companies are doing for growth? Is it really that simple to code an AI that combs one of the largest subreddits and predicts bad actors a LA Minority Report?\n\nMOASS is inevitable. But I HIGHLY question the development, implementation, and true intention of the power of the Satori AI. My fear is what it would do with this power during a crucial gme moment, or with the influence of several newly wealthy, dedicated investors?\n\nA fair question, no?\n\n\n\nEdit- I am continuing my research and digging and will not stop until I am satisfied I am wrong. So far that gets further and further away\n\nhttps://www.lancerreview.com/review/andela\n\nThis company, andela, is an AI company and the website shared is suspiciously singing its praises through reddit. However, the CFO at Human Security is a former CFO at andela. Isaac Itenberg. Isaac was also formerly employed at Thrive Global, owned by Arianna Huffington. Who apparently ran podcasts that featured reddit cofounder Alexis Ohanian. As recently as may this year. \n\nhttps://people.com/sports/alexis-ohanian-shares-how-wife-serena-williams-helped-him-learn-to-unplug/.\n https://podcasts.apple.com/gb/podcast/what-ive-learned-with-arianna-huffington/id1180759468\n\n\nReddit filed a transparency report.\n https://techcrunch.com/2021/02/16/reddits-transparency-report-shows-a-big-spam-problem-and-relatively-few-government-requests/\n\n\"Of nearly 3.4 billion pieces of content created on Reddit (which is to say posts, comments, hosted images, etc.), 233 million were removed. These numbers are both up by 20%-30% from 2019. Of those 233 million, 131 million were “proactive”\" \n\nAn increase in proactive removals to that degree is an assumption that Satori may have been operating site wide as early as 2020.\n\nWhich, the code for White Ops in the reddit source per my previous post was found in 2020.",
    "title": "I need to ask a few questions about Satori, if you please. I think you should ask them too.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/nsnl20/i_need_to_ask_a_few_questions_about_satori_if_you/"
}