{
    "author": "pinkcatsonacid",
    "created_utc": 1626725309.0,
    "distinguished": "moderator",
    "edited": 1626727283.0,
    "id": "onm3l7",
    "text_only": true,
    "flair_text": "👍 Court of Public Opinion 👎",
    "name": "t3_onm3l7",
    "num_comments": 618,
    "permalink": "/r/GMEJungle/comments/onm3l7/please_vote_addition_of_moderator_ubodysurfdan/",
    "score": 1022,
    "selftext": "# 69,000 Members ( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)\n\n&#x200B;\n\nSince we have just now crossed the sacred threshold of 69,420 members, it's time to get some halp up in here.\n\n&#x200B;\n\nhttps://preview.redd.it/v4h5lq7o48c71.jpg?width=1080&format=pjpg&auto=webp&s=db403346dec8373ebf85723a942d6bc6328bc353\n\n&#x200B;\n\n[we also had 3.44MM pageviews this weekend lmayo](https://preview.redd.it/1vzjbcha88c71.png?width=1084&format=png&auto=webp&s=840cb6ff9f4c095c6f96eaaaf010b0ee7ef64494)\n\nYesterday we had lots of discussion around the [Housekeeping post](https://www.reddit.com/r/GMEJungle/comments/omucfa/knock_knock_housekeeping/) wherein u/BodySurfDan was considered.\n\n&#x200B;\n\n[He made a vetting post here with lots of excellent discussion.](https://www.reddit.com/r/GMEJungle/comments/omvrjv/at_the_request_of_apes_a_little_bit_about_myself/?utm_source=share&utm_medium=web2x&context=3) I strongly encourage you to read before voting. I want to say thanks Dan for answering so many questions for the community, it makes for excellent transparency :). Judging by the sentiment in comments around both of those posts, it's safe to say we can now put BSD up for a vote of the people.\n\n&#x200B;\n\n**What will he be doing?**\n\n&#x200B;\n\n**Answer:** Moderating the posts and comments as he surfs the sub. Nothing heavy handed, just around when you need and helping me keep a trusted eye on the sub as we iron out the kinks and grow.\n\n&#x200B;\n\n# This sub is still largely moderated by you with up and down votes 👍👎\n\n&#x200B;\n\nI don't plan on changing much of the administrative stuff once it's set, and I'm working on a plan to make the wiki accessible and editable by the community but with certain higher karma and age restrictions for editability. So all that is expected is to... just help moderate the public side of the sub. BSD has been in the community and in the comments for months as a regular dose of enthusiasm and hype and just a regular schmegular ape and that's how he originally came to be my nomination for moderator in the other sub. Given his regular presence in the community, I trust him to be around and basically do what he has always done, just with access to some extra buttons :).\n\n&#x200B;\n\n# Edit: forgot to add- Communication\n\nI can't get to dms right now even if I wanted to, but I have my nose buried right now in learning how to make the sub look acceptable lol. So I'm not really easy to reach right now anyway, and I have admittedly walked away from discord communication. I had never used it before becoming a mod in April and I was never a fan. So I will try to check messages when I can and will try to keep my chat open, but mainly you can meet me in the comments or the daily discussion here. I will be keeping a close eye on that more than any other communication channels. \n\n&#x200B;\n\nHaving said that, dan and I will be largely communicating with each other in the comments and the daily discussion. I like open, transparent communication. Dan feels the same way.\n\n^(end edit)\n\n&#x200B;\n\nPlease vote accordingly below for u/BodySurfDan. The poll will be open for 24 hours.\n\n&#x200B;\n\n**Please respect the system we are attempting and don't vote if you're not a member of this community. Thank you.**\n\n&#x200B;\n\n*I will publish moderator details like permissions and logs in the wiki- just give me time to get it all set up :)*\n\n&#x200B;\n\n[View Poll](https://www.reddit.com/poll/onm3l7)",
    "title": "Please Vote- Addition of moderator u/BodySurfDan",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/onm3l7/please_vote_addition_of_moderator_ubodysurfdan/"
}