{
    "author": "tapakip",
    "created_utc": 1614656585.0,
    "distinguished": null,
    "edited": 1614689910.0,
    "id": "lvt1hd",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_lvt1hd",
    "num_comments": 340,
    "permalink": "/r/GME/comments/lvt1hd/3415_deep_itm_call_options_bought_right_before/",
    "score": 1168,
    "selftext": "Obligatory I am not a financial adviser, do your own research.  Not sure if anyone else has already posted this DD, but I noticed this earlier today and thought I'd share.\n\nI check the \"Today's Biggest (Options) Trades\" tab in Fidelity Active Trader Pro for GME every day.  Usually you see variations of the same thing, with people buying options that cancel each other out.  Others who sell puts at a $2 strike price and make $500 total, mostly fluff.  But not today.\n\n[https://imgur.com/a/8ZCd3b9](https://imgur.com/a/8ZCd3b9)\n\nToday, I saw something that I've never seen before.  Someone bought 3,415 Call Options, of 5 different strike prices and dates, all super deep in the money, 2,400 of which expire on April 16th.  That's a total of $35.7M paid in premiums for these options, a huge sum by any metric.\n\nEven crazier, that's not all of them, because 1,080 Call Options were purchased 3 hours earlier than that, from the same exchange and at the same strike price as one of their later ones.  It may not be the same person, but it would be shocking if it wasn't.  Add in the cost of those options as well, $10.5M, and we get a total of $46.2M invested today by one entity.\n\nThis is not something I have ever seen, due to the amount of money it takes to buy Calls that are deep ITM.  Usually it's only options that are way out of the money, like ones with an 800 strike price, and usually that's only to hedge against something else they have going on.\n\nIf anyone has data on why they would do this, versus buying the shares outright.  Or why I've never seen this happen on other days but it happened today, please let me know.  I'm not here to tell you what it all means, I'm just here to provide the data.\n\nI have highlighted the Calls I've discussed in yellow, the rest of them are the types of options I normally see day to day.\n\nHODL strong my fellow apes.\n\nEdit: In case you have issues reading the options in the link above, direct link to image.  [https://i.imgur.com/KcVBu9B.png](https://i.imgur.com/KcVBu9B.png)\n\nEdit 2: As has been pointed out by (quite) a few of you, [Uncle Bruce did a great job explaining exactly this possibility](https://www.youtube.com/watch?v=VwXLRoAw3Z4).  This is why I posted my DD here, because I knew you guys would be able to provide the information I was missing!  \n\nEdit 2: [You love me, you really love me](https://www.youtube.com/watch?v=2lPKU5qSO6A).  Thank you all for the awards and kind comments.  Best sub I've ever posted in.  Let's keep working together with DD, to help all of us get to the moon!",
    "title": "3,415 deep ITM Call Options bought right before close Monday 3/1 from one buyer. $35.7M (or more) in Premiums paid!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lvt1hd/3415_deep_itm_call_options_bought_right_before/"
}