{
    "author": "TblackUman",
    "created_utc": 1614632229.0,
    "distinguished": null,
    "edited": false,
    "id": "lvkbic",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lvkbic",
    "num_comments": 109,
    "permalink": "/r/GME/comments/lvkbic/analysis_on_why_the_new_heads_of_sec_cfpb_is/",
    "score": 590,
    "selftext": "I have posted this DD previously this weekend, but now with the two new heads, Rohit Chopra(CFPB), and Gary Gensler (SEC), I figure that this information may be more relevant. All the new Information will be at the end separated by '----'. I am typing this on desktop, no emojis here yet (insert rocket diamond hands ape frog ice-cream emojis here)\n\n&#x200B;\n\nThe following post contains fact and speculation, and should not be taken as serious truths. Tin foil hats are required. Be prepared to have your brains smoothed out by my chewed up crayons.\n\n\\*Side note: I am leaving Plotkin out of this because we already know his butt is stuffed by Kenny G. This also goes for Vlad the rat.\n\nTL;DR:\n\n1. Citadel has connections everywhere\n2. The SEC may be too afraid to mess with their own kind\n3. We should investigate who may try to stop the squeeze legally\n4. The two new heads have an eye out for protecting retail, BULLISH AF\n\n# WHY IS THIS IMPORTANT?\n\nA lot of you are all anticipating the MOASS. Many are getting impatient and FUD is crazy strong rn. I am holding and buying until we we reach the minimum 100k floor no matter how long it takes.\n\nHOWEVER, there is still justice to be had in this. A lot of us are also wondering why and how is this even possible? If we look at exactly WHO is involved, we may be able to start seeing connections and patterns that may require more investigation.\n\nIf we want to fight, flip off the SEC and the Hedgies, Its good to know WHO and WHY we are flipping them off. If they become under more scrutiny from the world. there is a higher chance that they won't be able to pull off whatever fuckery they do in order to stop the rocket from launching.\n\nWE WANT THE ROCKET TO LAUNCH WITH NO LEGAL INTERUPTIONS!\n\n# WHO ARE THE PLAYERS?\n\n1. **Citadel** \\- Big Boi Money Maker/Investment Firm/Execution Service Provider led by Kenneth Griffin himself. Based out of Chicago Illinois, has firms around the world.\n2. **Point72** \\- big boy Investment Firm Led by Steven Cohen. Chipped in with Citadel to bail Melvin Capital out ( Also gets paid by Citadel for order flow)\n3. **DTCC** \\- They are the sole “plumbers” of the stock exchange system. I suggest looking into their responsibilities as they are an integral part of the trading system. Lead by Michael Bodson\n4. **SEC** \\- Well we already know this group of clowns. Temporarily being headed by Allison Herren Lee, the only wild card I can’t quite figure out yet.\n5. **CIA** \\- This one is a tiny stretch just for funsies. Essentially Point72 has hired multiple personnel who used to work for In-Q-Tel: the strategic investment arm of the CIA and the U.S. Intelligence Community\n6. I’m just going to lump Melvin capital and Robinhood and friends over here. There's lots of little connections that probably aren't major and did not make the cut.\n\n# WHAT IS THE CONNECTION?\n\nI made a crude connectivity graph/char/graphic that visualizes the connections, but I will go over every connection brief detail:\n\nIn case ape don't know how to read: people are red rectangles, companies/organizations are blue rounded rectangles. Important connections or people have thicker borders and are bolded in the description list. Kenneth Griffin and Citadel are at the center.\n\n(I will be updating this graphic over time as we make new discoveries)\n\n[Potential connections between people and firms](https://preview.redd.it/1o6fndkwchk61.png?width=2500&format=png&auto=webp&s=954e0fd470b9760692b80a6f396af83c4b3e12c7)\n\n&#x200B;\n\nHere is an oversimplified version of the above graphic that only shows connections between the companies.\n\n&#x200B;\n\n[Oversimplified connections between firms](https://preview.redd.it/q72e727wchk61.png?width=2500&format=png&auto=webp&s=c15a660badede6ced97fe1e3bc83a8af126d78e4)\n\n# Connection Descriptions\n\nMore important connections are bolded/starred.\n\nThe sources I use are included in most descriptions let me know if I'm missing any and you want to verify\n\nCitadel Based\n\n1. Kenneth Griffin <-> Citadel:[ The CEO of Citadel](https://www.citadel.com/leadership/kenneth-c-griffin/) Based out of Chicago, Illinois\n2. Kenneth Griffin <-> Harvard: Griffin started at Harvard College in the fall of 1986. Griffin graduated in 1989 with a degree in economics.\n3. Kenneth Griffin <-> Anne Dias-Griffin: Griffin's[ Ex-Wife](https://en.wikipedia.org/wiki/Anne_Dias-Griffin) Divorced in[ 2015](https://money.cnn.com/2015/10/07/investing/ken-griffin-citadel-divorce-settlement/)\n4. Anne Dias <-> Goldman Sachs: Former financial analyst, NY & London\n5. Anne Dias <-> Chicago Council on Global Affairs: Anne Dias was also a Trustee of the[ Chicago Council on Global Affairs](https://en.wikipedia.org/wiki/Chicago_Council_on_Global_Affairs), I’ve only been able to find that Anne and Kenneth Griffin took part in[ 2006/2007](https://www.thechicagocouncil.org/sites/default/files/2006-07_annual_report_final.pdf), they are listed on page 49 in the President’s circle. I found a few other interesting names in this circle, but nothing extraordinarily relevant to this DD (yet)\n6. Douglas Levine <-> Morgan Stanley:[ Current Managing Director](https://www.morganstanley.com/wealth-investmentsolutions/pdfs/adv/rothschild.pdf) and portfolio manager and analyst. (2007- Current)\n7. Douglas Levine <-> Citadel: Former a buy/sell side analyst\n8. \\* **Umesh Subramanian <-> Citadel:**[ **Current Chief Technology Officer**](https://www.citadel.com/leadership/umesh-subramanian/)**. Leads the technology teams that build and power the innovative research, investment and risk-management platforms that provide Citadel with a competitive advantage in the financial market**s\n9. \\* **Umesh Subramanian <-> DTCC:**[ Former member of the Board of Directors](https://news.relsci.com/connections/umesh-subramanian-109859705) (2017-2018). During this time,[ Subramanian was on the Technology and Risk Committee](https://www.dtcc.com/news/2017/april/24/dtcc-names-four-new-members-to-board-of-directors) along with others and may have connected with Susan Cosgrove, another member of the Risk Committee. Umesh definitely learned a lot about the inner mechanisms of DTCC, and could possibly be using this knowledge to power the innovate technology that helps citadel take advantage of the markets. He could also be using his connections/knowledge to figure out ways around preventative measures against naked short selling.\n10. Umesh Subramanian <-> Goldman Sachs: Former Partner and Co-head of Each Division\n11. Robert Colfin <-> Citadel:[ Senior Software Engineer](https://www.linkedin.com/in/rcolfin/) (2017- present)\n12. Robert Colfin <-> J.P. Morgan: Vice President, Equities (?-2017)\n13. Mathieu Belanger <-> Citadel:[ Post Trade Business Intelligence and Analytics](https://www.linkedin.com/in/mathieu-belanger-7a792b24/)\n14. Mathieu Belanger <-> J.P. Morgan: Vice President, CyberSecurity Analytics\n15. Michael Papp <-> Citadel - Head of Options Supervision\n16. Michael Papp <-> Federal Reserve Bank of Chicago:[ Former Risk Management Specialist](https://www.linkedin.com/in/michael-papp-294953b) While I doubt that Papp has any power over the Federal Reserve, I do believe he has knowledge and potential connections that could give an advantage to Citadel. The reason why I even include connections to the federal reserve is because of the “coincidence” of GME skyrocketing when the Fed’s money transfer system went down\n17. Justin Lubell <-> Citadel:[ Head of Global Equities](https://www.citadel.com/leadership/justin-lubell/) (2020-current)\n18. **Justin Lubell <-> Point72**: Portfolio Manager (2008-2019) specializing in the Media, Internet, Telecom, and Services industries and was a member of the firm’s Risk Committee. This is a great hire for citadel when it comes to communication and public relations between them and Point72.\n19. **Gregg Berman** <-> Citadel:[ Director of Market Analytics and Regulatory Structure](https://www.wsj.com/articles/secs-former-high-frequency-trading-expert-joins-citadel-1473978359)\n20. \\* **Gregg Berman <-> SEC**: From 2009 to 2015 Mr. Berman served at the U.S.[ Securities and Exchange Commission](https://www.sifma.org/people/gregg-berman/) in Washington, DC, where he established and was associate director of the office of analytics and research in the division of trading and markets. This is major. Berman is ex-SEC and is an expert in High Frequency trading. He knows all of the loopholes and workarounds when it comes to potential market manipulation and regulation of trading algorithms. Also he may still have connections/communications with people still inside the SEC.\n21. \\* **David Glockner <-> Citadel**: Chief Compliance Officer (Dec 2017 - Mar 2020) This guy started a whole new rabbit hole. I originally Did not find him until I saw that[ he signed for Kenneth Griffin with the power of attorney](https://www.sec.gov/Archives/edgar/data/1535527/000110465920000854/tm1924443d3_sc13g.htm). Turns out that he was former SEC.\n22. \\* **David Glockner <-> SEC**: Regional Director (2013- Nov 2017) Glockner oversaw a 75 percent increase in annual enforcement actions, including high-profile cases involving financial fraud and public corruption. He was a leader in the SEC’s approach to cybersecurity regulation, serving as a founding co-director of the agency’s Cybersecurity Working Group, and co-authored the agency’s handbook on investigating corruption and fraud in public finance. This guy essentially would have spearheaded any investigations against citadel as he worked in the midwestern region that includes Chicago. He may have even been a part of prior investigations. somehow David Glockner ended up working for Citadel from 2017 to 2020... Something seems fishy here.\n23. \\* **David Glockner <-> Exelon**: VP, Compliance and audit (march 2020-Present?) Now this is the most suspicious moves out of all of them that led me even further down the rabbit hole. Exelon was currently under[ federal investigation](https://www.law.com/corpcounsel/2020/03/17/facing-corruption-probes-exelon-hires-former-sec-official-prosecutor-as-compliance-chief/?slreturn=20210126163445) when Glockner was abruptly moved from citadel and hired by Exelon. I suggest looking at the investigation yourselves. but Essentially the Chicago based wing of Exelon (ComEd) was accused of bribery and lobbying. In 2020, The investigation was settled with a[ $200 Million slap on the wrist](https://www.exeloncorp.com/newsroom/comed-reaches-agreement-to-resolve-justice-department-investigation). There were members that \"Resigned\" during this investigation, and that led me to Anne Pramaggoire.\n24. \\* **Anne Pramaggoire <-> Exelon**: Senior Executive Vice President (may 2018 - October 2019) (oversaw branch “ComEd” in Illinois/Chicago area. This lady resigned in October 2019 amid the lobbying and bribery investigation. November 18, 2020[ Pramaggiore was indicted by the U.S Attorney for the Northern District of Illinois for bribery conspiracy](https://www.wbez.org/stories/feds-charge-former-top-comed-executives-lobbyists-in-springfield-corruption-case/e8e5d7cf-6418-4491-a152-fc7b1702907e), bribery and willfully falsifying ComEd books and records. All of this happened, and now Citadel sends a guy over there that used to work for the SEC. I wasn't liking that one bit.\n25. Anne Pramaggiore <-> Federal Reserve Bank of Chicago: Anne Pramaggoire was also chair of the Board of a federal reserve bank. Another connection. I believe she was chair when Michel Papp was a specialist there as well before being hired by Citadel. Pramaggoire also resigned from chair when she resigned from ComEd. All of these strange timings and coincidences caused me to look into the Fed.\n26. Christopher Murphy <-> Federal Reserve Bank of Chicago: Board of directors (2019-2012)\n27. Christopher Murphy <-> 1st Source Bank: Chairman and CEO\n28. \\* **1st Source Bank <-> Citadel**: $[1.1M stake as of Dec 2020](https://stockzoa.com/ticker/srce/) (search Citadel Advisors) This was a stretch but it is technically partial ownership and a connection between the CEO and Citadel. This CEO also happened to be a Harvard Grad (so was Kenny G). These coincidences made me look into more board members of FRBC\n29. Christopher Murphy <-> Harvard: MBA (? need date)\n30. Michael O’Grady <-> Federal Reserve Bank of Chicago: Chair of board (2020, 2021-2023)\n31. \\* **Michael O’Grady <-> Northern Trust**:[ Chairman, President & CEO](https://www.northerntrust.com/united-states/insights-research/corporate/experts/ogrady-g-michael) (current)\n32. \\* **Northern Trust <-> Citadel**:[ Payment for order flow](https://mta.ihsmarkit.com/app-v2/public-report-library/public-report-library-view/Northern%20Trust%20Securities%20Inc/249) since at least 2015. This is of course another crazy coincidence as Citadel basically gets a majority of all order flows (see my last DD)\n33. Michael O’Grady <-> Bank of America Merril Lynch: Former Managing director of Investment Banking group (1992-2011). In my last DD we discovered that BoFA is bearish on Gamestop and their brokers placed major trading restrictions on GME. O'Grady probably has nothing to do with this but its a funny coincidence.\n34. Michael O’Grady <-> Harvard: MBA Graduate (Year Needed) Hey look its another Harvard grad.\n35. Ben Bernanke <-> Citadel: Senior Advisor\n36. **\\* Ben Bernanke <-> Federal Reserve System**: Board of Governors: Member of Board. This is a direct connection between a senior member of Citadel and the Federal Reserve. Here is an article that made me suspicious about Citadel, Bernanke, and potential cooperation with the federal reserve[ https://www.politico.com/story/2015/04/ben-bernanke-adviser-hedge-fund-citadel-117040](https://www.politico.com/story/2015/04/ben-bernanke-adviser-hedge-fund-citadel-117040).\n37. Steven Cohen <-> Point72: CEO. I think we all know this but I'm putting it here just in case.\n38. Point72 <-> Cowen Prime Services: Order Execution Service\n39. Cowen Prime Services <-> Citadel:[ Payment for order flow](https://mta.ihsmarkit.com/app-v2/public-report-library/public-report-library-view/Cowen%20Prime%20Services%20LLC/341). Yet another pocket citadel is putting money in.\n40. Sri Chandrasekar <-> Point72: Co-leads Point72 Investment activities and technical DD in AI/ML\n41. Sri Chandrasekar <-> In-Q-Tel: Former lead of Analytics practice at In-Q-Tel, a role in which he was responsible for setting the investment priorities for a team of technical investment professionals.\n42. Dan Gwak <-> Point72: Investment activities in artificial intelligence, machine learning and related technologies.\n43. Dan Gwak <-> In-Q-Tel: Former Partner on the Investment Team, focused on enterprise analytics and infrastructure companies whose technologies were impactful to the mission of the U.S. Intelligence Community.\n44. In-Q-Tel <-> CIA: The strategic investment firm of the CIA and U.S. Intelligence Community. (haha see I told you there is a slight connection so now my clickbait is justified!)\n45. Scott Barclay <-> Point72: looks at healthcare investments, kinda boring guy.\n46. Scott Barclay <-> Bank of America Securities: helped establish capital markets in London. Random BoFA ties again in this web. (see connection #33) **\\*\\*The source for the Entire team of Point72 is**[ **Here**](https://p72.vc/)**: scroll down to “Team” and click on the names.\\*\\***\n47. Dan Geer <-> In-Q-Tel: Current CEO\n48. Dan Geer <-> Harvard: A[ 1988 Harvard graduate](https://en.wikipedia.org/wiki/Dan_Geer) (Griffin graduated in 89) where he received his Doctor of Science (Sc.D) in biostatics\n49. Michael Bodson <-> DTCC: President and Chief Executive Officer (2012-current)\n50. Michael Bodson <-> Morgan Stanley: Former[ Global Head of the Institutional, Retail and Asset Management Operations Department](https://www.dtcc.com/about/leadership/board/michael-bodson) most recently before moving to DTCC in 2007. Its not a great connection or interesting, but Morgan Stanley has definitely Interacted with Citadel in the past.\n51. Robert Colby <-> DTCC:[ Chief Legal Officer of FINRA](https://www.dtcc.com/about/leadership/board/robert-colby)\n52. Robert Colby <-> SEC: Former Deputy Director, responsible for regulating broker-dealers, markets, and clearing organizations. This guy also knows the ins and outs of the SEC and could easily give suggestions about how to get around certain laws or tripwires. speculation of course.\n53. Robert Colby <-> Harvard: J.D from Law school. Yet another Harvard Grad (Unknown Date)\n54. Susan Cosgrove <-> DTCC:[ Managing Director](https://www.dtcc.com/about/leadership/management-committee/susan-cosgrove) and Chief Financial Officer (current)\n55. Susan Cosgrove <-> Umesh Subramanian: Both were members of the Management Risk Committee at one time before Umesh moved to Citadel (See connection #9)\n56. Allison Heren Lee <-> SEC: Acting Chair of Commission (present)\n57. Kenneth Johnson <-> SEC: Chief Operating Officer (2017-present)\n58. Kenneth Johnson <-> Harvard: Masters in Public Policy (1998-2000) wow another Harvard Guy\n59. **\\* Ryan VanGrack <-> SEC**: Former advisor to former SEC chair Mary Jo White , provided counsel on a broad range of regulatory matters, including enforcement, examinations, investment advisers, cybersecurity, and FinTech. I don't know why, but this seems like he could have been a snake in the grass, considering that after MJW left, he went over to citadel.\n60. **\\* Ryan VanGrack <-> Citadel**: Deputy general counsel (current). Manages the legal and regulatory affairs functions across the company, including overseeing all regulatory investigations and examinations globally. He allegedly was placed with David Glockner (See connection #21).[ This news article](https://news.bloomberglaw.com/business-and-practice/citadels-ken-griffin-adds-to-hires-from-a-preferred-locale-the-sec/) talks about the hires from the SEC by citadel. Now this is crazy. These people are literally in charge of (fighting) investigations that are most likely being conducted by people who used to work under/with them. I now conflict of interest isn't really a thing for this, but I believe there have been many investigations that have been dissolved off the books by Vangrack and Glockner.\n61. Ryan Vangrack <-> Harvard: Law degree (unknown date) Hey look, more Harvtards.\n62. **\\* Stephen Luparello <-> SEC:** Former Director of the SEC’s Division of Trading and Markets\\*\\*, the division that regulates and sets policy for market participants, including exchanges, securities\\*\\* associations, broker-dealers, and clearing agencies. This guy also knows the ins and outs of SEC policy and any potential loopholes.\n63. **\\* Stephen Luparello <-> Citadel:** General Counsel for Citadel Securities, responsible for legal, compliance, and surveillance functions in the Americas. So this guy is now in charge of making sure Citadel uses the loopholes correctly.\n64. \\* **Stephen Luparello <-> DTCC**: Former Member of the Board. This guy has had feet in all three of these companies and currently presides in citadel. I have no proof to suspect anything, but I am sus AF. This is why a tinfoil hat is required.\n65. \\* **Gary Gensler <-> SEC:** Of course he has been [appointed as the 33rd chair](https://www.axios.com/biden-sec-cfpb-elizabeth-warren-36b83800-01be-427c-9811-c07fe32a7dbb.html). This is pretty good, I hope.\n66. Gary Gensler <->Goldman Sachs: [Former employee](https://en.wikipedia.org/wiki/Gary_Gensler), worked his way up (1979-1997) He did good things for the company\n67. Rohit Chopra <-> Harvard: Ah another classic Havardian. [Graduated with a BA](https://en.wikipedia.org/wiki/Rohit_Chopra)\n68. \\* R**ohit Chopra <-> CFPB**:  [Next Director](https://www.axios.com/biden-sec-cfpb-elizabeth-warren-36b83800-01be-427c-9811-c07fe32a7dbb.html), this is bullish, I will go over why at the end.\n69. **Nice**\n\n# Kenneth Griffin’s Personal Influence\n\nThese connections are more speculative and really just based on the fact that there is a \\**chance*\\* that Kenny G was in the same room as them at one point in time. (not listed in the graphic to prevent clutter)\n\n**Annual Global Financial Leadership Conference 2018-19:**\n\nKenneth Griffin was a primary Keynote Speaker in both 2018 and 2019. The following is a list of other speakers: (hence the \\**chance*\\* of them being in the same room at some point)\n\n**2018:**\n\n* **George W. Bush**, 43rd President of the United States (2001-2009)\n* **Bill Clinton**, 42nd President of the United States (1993-2001)\n* H.R. McMaster, United States National Security Advisor (2017-2018)\n* **Janet Yellen**, Chairman of the Board of Governors of the Federal Reserve System (2014-2018) David Cameron, Prime Minister of the United Kingdom (2010-2016)\n* Gary Cohn, Director of the United States Economic Council (2017-2018)\n* J. Christopher Giancarlo, Chairman of the U.S. Commodity Futures Trading Commission\n* Blythe Masters, Chief Executive Officer, Digital Asset Holdings\n* **Alexis Ohanian**, Co-founder, Reddit and Initialized Capital\n* Laura Shin, cryptocurrency journalist\n* Michael Spencer, Chief Executive Officer, NEX\n* Gillian Tett, Managing Editor, Financial Times\n* Bob Woodward, Associate Editor, The Washington Post\n* Steve Wozniak, Co-founder, Apple\n\n**2019:**\n\n* **Lloyd Blankfein** \\- Chairman and CEO, Goldman Sachs (2006-2018)\n* Indra Nooi - CEO, Pepsico (06-18) Board Member, Amazon\n* Oprah Winfrey - Oprah Winfrey\n* Stephen Attenborough - Director, Virgin Galactic\n* **Kelley Ayotte** \\- US Senator (2011-2018) Ex AG (NH, 04-09)\n* Jum Bridenstine - Administrator, Nasa\n* Andrew Card - Chairman, National ENdowment For Democracy\n* Kate Couric - Journalist/Author\n* Christian Davenport - Reporter, Washington Post\n* **Dr. Jacob Frenkel** \\- Chairman, Jpmorgan Chase International\n* Dan Glickmen - Ex us Secretary of agriculture (95-01)\n* Tim hughes - Senior VP of Global Business and govt Affairs\n* Gen. John Kelly - White House Chief of staff (2017-19)\n* Edward Luce - National Editor, The Financial Times\n* Denis McDonough - Whitehouse Chief of staff\n* Dr. Heath Tarbert- Chairman, U.S. Commodity Futures Trading Commission\n\nSources:[ http://investor.cmegroup.com/index.php/static-files/def4768d-3ec2-474f-b384-0140e2e364e6](http://investor.cmegroup.com/index.php/static-files/def4768d-3ec2-474f-b384-0140e2e364e6) 2018\n\n[https://www.gflc.com/speakers.html](https://www.gflc.com/speakers.html) 2019\n\nI compiled a list of articles that showed some interaction (positive and negative) between a few of the other speakers and Ken griffin:\n\nGeorge W. Bush:\n\n* Was donated (small amount) to personally by Kenneth Griffin in 2004[ https://www.opensecrets.org/search?q=Kenneth+Griffin&type=donors](https://www.opensecrets.org/search?q=Kenneth+Griffin&type=donors)\n\nBill Clinton:\n\n* Was payed \\~ 250,000 To speak during 2008 crash:[ https://www.wsj.com/articles/citadels-ken-griffin-leaves-2008-tumble-far-behind-1438655887](https://www.wsj.com/articles/citadels-ken-griffin-leaves-2008-tumble-far-behind-1438655887)\n\nJanet Yellen:\n\n* Old news, but she obviously has been paid by Citadel before:[ https://slate.com/news-and-politics/2021/01/janet-yellen-paid-speeches-citadel-gamestop.html](https://slate.com/news-and-politics/2021/01/janet-yellen-paid-speeches-citadel-gamestop.html)\n\nAlex Ohanian:\n\n* Reddit Co-founder, Defends WSB against Griffin:[ https://nypost.com/2021/01/29/reddit-co-founder-alexis-ohanian-backs-wallstreetbets-rally/](https://nypost.com/2021/01/29/reddit-co-founder-alexis-ohanian-backs-wallstreetbets-rally/)\n\nKelley Ayotte\n\n* Donated to by griffin:[ https://www.opensecrets.org/donor-lookup/results?name=kenneth+griffin&order=asc&page=6&sort=D](https://www.opensecrets.org/donor-lookup/results?name=kenneth+griffin&order=asc&page=6&sort=D)\n\nJacob Frenkel\n\n* A part of CME Group and won awards with Griffin:[ https://www.bloomberg.com/press-releases/2019-11-21/cme-group-announces-ken-griffin-as-the-2019-melamed-arditti-innovation-award-recipient](https://www.bloomberg.com/press-releases/2019-11-21/cme-group-announces-ken-griffin-as-the-2019-melamed-arditti-innovation-award-recipient)\n\nThere are more but I don't want to bore you.\n\n# Kenneth Griffin’s Political Influence:\n\nWe are all well aware that Griffin has donated generously to many politicians throughout the years. I would make a list, but others have already. I suggest you read up on them here.[ https://ballotpedia.org/Kenneth\\_Griffin](https://ballotpedia.org/Kenneth_Griffin)\n\nIf something interesting comes up during the next hearings, I will dive into the politician(s) as well.\n\n# PURE Speculation on How Citadel is Pulling This Off:\n\nIf your tinfoil hat is not on, Please put on now.\n\nCitadel has connections with nearly every market regulator that has the resources/power to stop them. Whether it is between former employees, donations, or co-worker/board members, Citadel is connected to the SEC and the DTCC and the federal Government via multiple mediums. Money is usually the biggest factor when it comes to regulation and decision making (See Connection #24). But there is also a connection that some humans feel when they share similar histories, jobs or college or board membership status. This makes decision making morally difficult and can slow any legal regulation down exponentially until someone who is detached from all of these connections comes along to lay down the law.\n\n Ken Griffin & friends have a major influence politically and financially over most of those that can stop him. Something must be done about this before everything gets eventually swept under the rug. The world is watching.\n\nOf course there is no plausibility that all of these organizations are in collusion with one another, but that does not mean that they don't communicate. Co-workers communicate, board members communicate, friends and donors communicate. Even Machine learning algorithms communicate.\n\nI believe that if we (or a regulator) can gain access to the communication between key members (inside and outside of the above connectivity graphic) we can find out exactly what has been going on. I am trying to gain access to certain communication channels, but that is going to take some more time if it is even possible in the end.\n\nOf course this is a crazy conspiracy theory that has no factual basis behind it, but as I dove down into 200+ individuals and 300+ connections for this research, I kept on seeing so many mutual connections and crossovers that I didn't want to chalk everything up to \"coincidence\".\n\nWe are not on a witch hunt, we really just want to get our tendies, support a company that we like, and then move on with our lives. However if there is someone preventing us from getting these tendies,  there are investigations to be had.\n\n\\-----------------------------------------------------------------------------------\n\n# WHY THIS IS BULLISH FOR THE MOASS\n\n\\*Notice that this is speculation and my own opinion so keep your tinfoil hats overtop your helmets plz thx.\\*\n\nI will save my breath and only go into the two new additions, first there is\n\n**Rohit Chopra:**\n\nEven though Chopra is a Harvard grad (just like Griffin and many other people in the connectivity graphic) Chopra has a lot of promise when it comes to regulating big money. After he helped launch the Consumer Financial Protection Bureau, in 2012, he analyzed and co-reported the facts about student debt.  He was a part of the lawsuits against  [Corinthian Colleges](https://en.wikipedia.org/wiki/Corinthian_Colleges) and [ITT Educational Services](https://en.wikipedia.org/wiki/ITT_Technical_Institute), who both eventually closed down. \n\nNow this doesn't really mean anything substantial, but it does mean that he is aware of the extortionate amount of debt that students (like me) are in. While I doubt the CFPB will step in to bring justice to Citadel and friends, I do believe that Rohit will at least make some moves to protect retail.  This protection can mean he either pleas to let the squeeze happen, or even introduce a plan to protect our bananas & trendies after  it happens.\n\n(Side note, he also made a powerful statement about the  [Amazon Lawsuit](https://www.ftc.gov/system/files/documents/public_statements/1587003/20200102_final_rchopra_statement_v2.pdf), this furthers my belief that he does care about the little people)\n\n&#x200B;\n\n**Gary Gensler:**\n\nThis guy I am not entirely sure of but I have high hopes. While he used to be the CFO for the [Hillary Clinton 2016 presidential campaign](https://en.wikipedia.org/wiki/Hillary_Clinton_2016_presidential_campaign), (A campaign that Griffin/Citadel has allegedly donated to \\[source needed\\]). He still has limited connections with the rest of the graph.  In 2001 Gensler was a part of the staff that helped write the [Sarbanes Oxley Act](https://www.investopedia.com/terms/s/sarbanesoxleyact.asp). This act pushed higher regulation on corporate institutions. While Gensler could go both ways, either pushing regulation on retail, and or pushing more on institutions, I believe that Gensler will not jump in to prevent the MOASS. Afterwards, I'm quite sure the rules will change for both retail and institutions after this once in a lifetime event.\n\n&#x200B;\n\n# Final Thoughts\n\n(As I was writing this, GME went up \\~15% today. This is incredible, however I would hunker down and expect red days/weeks to come.)\n\nLong story short, I think these two newbies have a decent head on them to protect retail and do not have too many connections with citadel to make irrational moves. I'm sure the investigation will be arduous, but **GME IS GOING BEYOND THE MOON**. Its up to Gary & Rohit (and many more) to prevent the govt from trying to squash it.\n\nAPE OUT",
    "title": "Analysis On Why The New Heads of SEC & CFPB is BULLISH for The MOASS",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lvkbic/analysis_on_why_the_new_heads_of_sec_cfpb_is/"
}