{
    "author": "Immortan-GME",
    "created_utc": 1626628181.0,
    "distinguished": null,
    "edited": 1626632841.0,
    "id": "omuprc",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_omuprc",
    "num_comments": 59,
    "permalink": "/r/DDintoGME/comments/omuprc/summary_of_data_evidence_supporting_moass/",
    "score": 573,
    "selftext": "Looks like lots of hot posts rn are regarding mod drama on Superstonk which is in of itself sus that this happens like every 2 months, but in the big picture it's just a distraction.\n\nI consider myself a rational investor, I got a PhD, worked several years as a scientist, and now middle management in a big company with a good salary. Only reason I share this is to make a point that not all GME investors are college kids believing in witchcraft 😜\n\nNow to the subject of this post. I saw an excellent post yesterday which I can't find anymore amongst all the mod drama posts which had a great summary of the 2 fold GME investment bull thesis: A) Company e-commerce transformation as driver for greatly improving fundamentals and B) Asymmetric upside potential with MOASS.\n\nNow for me, A) is the safety net. This is what differentiates GME from other stonks which are getting hyped (or pumped?): Even in the case MOASS would get manipulated away by hedgies and their accomplices, the stock price is not going to go much below current level IMHO. I think we now bounced off of 160ish a couple of times and this is also roughly the level where DFV doubled down the 2nd time, so without extreme fuckery and maybe briefly we won't go below that. There's now analysts e.g. Argus research who have a 190-210$ fundamental price target rn. Also Fidelity has 8.6 bullish score compromised of several buy recommendations.\n\nBut l assume like the majority of apes I am mainly here for B)  MOASS. I did want to safe GameStop from bankruptcy, which we already accomplished. I also plan to remain long term invested because I believe stock price can go to 1000+ on fundamentals alone the next 1-3 years. But I am over proportionally invested because of MOASS potential.\n\nSo here I want to list data evidence that supports MOASS:\n\n\n#1) Shorts didn't cover end of Jan\n\nSupporting data:\n\n-OBV which normally tracks price movement up and down, went up but never came down despite the price plummeting from 480 to 40$\n\nMore details e.g. this post:\nhttps://www.reddit.com/r/Superstonk/comments/of5huv/obv_the_king_of_confirmation_bias_in_depth_look/?utm_medium=android_app&utm_source=share\n\n\n-Deep ITM options volume expiring end of March, this Friday, and Jan 2022 at nonsense strike prices of e.g. 50¢. The only reason anybody would buy these is to hide real short interest. \n\nMore detail e.g. this post:\nhttps://www.reddit.com/r/Superstonk/comments/nwte0h/45_millions_long_synthetic_otm_puts_the_story_of/?utm_medium=android_app&utm_source=share\n\n\n-Failure to deliver volume continues to be very high and intentionally there is always a single day per month without any FTDs in order to stay off threshold list. E.g. most recently June 15, see e.g. https://gme.crazyawesomecompany.com/ which pulls FINRA data.\n\n-Run-ups in March and June. Unlike MSM are suggesting, retail doesn't have the money to move the price extremely like this. If we did, why wait months in between? These were driven by FTD cycle partial forced covering.\n\n\n#2) Even without 1), the official SI is high and stock continues to be heavily shorted\n\nSupporting data:\n\n-Daily short volume from FINRA. Short volume is >50% almost every day since Jan, so with that it is impossible for SI to go down. E.g. 60% short volume means at least 10% of the days volume net new SI. And that's assuming all buying is covering the daily shorting, e.g. 60% short volume -40% covering leaves 10% net new shorts of the daily volume. But:\n\n-Fidelity daily buy ratio shows that (regardless of missing volume info) people have been buying GME at ratios higher than any other stock since Jan. So if e.g. net buying would be just 10% of daily volume this already increases not covered short volume by that %. E.g. 60% short volume with 10% apes buying would mean only 30% covering and 20% net new shorts of the daily volume.\n\n-Retail owns the float: There are various calculations with various approaches e.g. based on FINRA, BLOOMBERG terminal, survey, but no matter which method it is hard to imagine retail not at least owning the entire free float. Likely much more.\n\n-Extremely low volume: Even the higher volume days recently are much lower than before and trend shows liquidity drying out. E.g. March run-up needed 1/3rd volume vs Jan run-up and June run-up needed 1/3rd of March run-up.\n\nSo taken together, even if you somehow don't believe 1, which the data clearly shows there's something going on, alone for 2 take the face value SI of 10m shares and put that in the current low volume environment. Net buying of 10m shares would skyrocket the price into the thousands at least. And then let's see if 1) wouldn't be true afterall and take the price into true MOASS territory.\n\nSo I hope this was helpful. Don't get distracted by bullshit and FUD, remember the DD and data.\n\nHold, buy if you like, enjoy the ride with memes. 🦧 together 💪🏻\n\nNo financial advice.\n\n\nEDIT: Corrected some formatting errors, added March and June run-ups as evidence for 1)",
    "title": "Summary of data evidence supporting MOASS",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/omuprc/summary_of_data_evidence_supporting_moass/"
}