{
    "author": "Bradduck_Flyntmoore",
    "created_utc": 1627530622.0,
    "distinguished": "moderator",
    "edited": false,
    "id": "otpvr7",
    "text_only": true,
    "flair_text": "🚀 Moderator 🚀",
    "name": "t3_otpvr7",
    "num_comments": 150,
    "permalink": "/r/Superstonk/comments/otpvr7/pinception_dd_mod_announcements_and_everything/",
    "score": 2060,
    "selftext": "Howdy Apes! u/Bradduck_Flyntmoore here! As many of you know, the sub only allows us to pin two posts at a time. The idea of \"pinception\" was suggested to me by a fellow ape in the comments a few days ago (credit goes here when I find the comment again) and I'd like to take it for a test run. I'm going to keep it simple for now, until I get some feedback from the community. I've already listed out a few categories I think might be useful to have, but nothing about this post is set in stone at this time.\n\n&#x200B;\n\n**DD:**\n\n[The GME Master Guide](https://www.reddit.com/r/Superstonk/comments/njwv6n/the_gme_masters_guide_a_dd_campaign_for_apes/?utm_source=share&utm_medium=web2x&context=3) by u/Blanderson_Snooper\n\n&#x200B;\n\n**Mod Announcements:**\n\n[SATORI: A look into the mind of a robot](https://www.reddit.com/r/Superstonk/comments/otiyf6/satori_a_look_into_the_mind_of_a_robot/?utm_source=share&utm_medium=web2x&context=3) by u/Captain-Fan\n\n&#x200B;\n\n**Community Spotlight?**\n\n**News?**\n\n**🔥 Memes?**\n\n**$GME EOD $$?**\n\n&#x200B;\n\nPlease keep in mind this idea is under construction. We are just trying to figure out the best way to use the pinned spots we have. Maybe the daily mega thread should be in here instead and DD should have a standalone pinned post? Maybe we should add GameStop news releases? Ideas on how apes think we should use pinception space (if we even should) are welcomed. \n\nAll I know is I have been hearing for a long time that apes want DD pinned to the top for newcomers to easily access. Maybe this isn't that, maybe it is (or will be, after some refining), but I had to try something. Thanks in advance for any constructive criticism. 🚀🌙",
    "title": "Pinception - DD, Mod Announcements, and everything else we want to pin at the same time: A Test Run",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/otpvr7/pinception_dd_mod_announcements_and_everything/"
}