{
    "author": "ecsluz",
    "created_utc": 1627752713.0,
    "distinguished": null,
    "edited": 1627762190.0,
    "id": "ovbbcl",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ovbbcl",
    "num_comments": 73,
    "permalink": "/r/Superstonk/comments/ovbbcl/brazilian_investor_here_just_filled_my_complaint/",
    "score": 4011,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/bxri9zhx1le71.jpg?width=960&format=pjpg&auto=webp&s=fb23f5193721a0f6549d568229f0e5c78938c637\n\n* Also emailed [**investoradvocate@sec.gov**](mailto:investoradvocate@sec.gov)\n\nThere is ample evidence the practice of abusive naked short selling has happened in the past and is likely still happening with GameStop and other jocosely called Meme stocks. Naked shorting creates synthetic shares that are equivalent to counterfeiting. While naked shorting is permitted by Market Makers in specific circumstances, there is evidence that naked shorting is far more pervasive than permissible by law.\n\nIt is my belief that several \"big players\", such as Citadel, Point72, Melvin, along with their countless subsidiaries and \"flying monkeys\" have targeted GameStop in particular, with the intent of \"shorting the stock to zero\".\n\nThere is also a highly suspicious amount of daily trades being routed off-exchange, the impression could in my opinion arise, that buying pressure is being routed off-exchange intentionally, while sales, along with counterfeit shorts are being routed through exchanges.\n\nThere is also the matter of things like CitadelConnect, basically a dark pool, but without the duty to publicly report transactions. The amount of conflicts of interest is truly staggering.\n\nIt is my further conviction that, contrary to their public statements, the short side has not since closed its positions, but rather expanded them, using illegal means. I believe the methods involved are among others, hiding FTDs in married put positions, transferring massive amounts of funds via abuse of crypto currencies, spreading out risk and staying off margin requirements by transferring positions globally in a perverted game of hot potato.\n\nConcerned Brazilian Investor\n\n&#x200B;\n\nEdit: For those interest in reach out to SEC:\n\n [SEC - Report Suspected Securities Fraud or Wrongdoing](https://www.sec.gov/tcr)\n\n[I'm doing my part! o7 \\[filed an SEC complaint\\] by u/karenski667](https://www.reddit.com/r/Superstonk/comments/oumtwt/im_doing_my_part_o7_filed_an_sec_complaint/h73dcdz/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
    "title": "Brazilian investor here. Just filled my complaint with the SEC.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovbbcl/brazilian_investor_here_just_filled_my_complaint/"
}