{
    "author": "AnnihilationGod",
    "created_utc": 1624103397.0,
    "distinguished": null,
    "edited": 1624232569.0,
    "id": "o3e9kg",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o3e9kg",
    "num_comments": 522,
    "permalink": "/r/Superstonk/comments/o3e9kg/annihilationgod_presents_the_big_short_data/",
    "score": 7501,
    "selftext": "&#x200B;\n\n**!NEW CHARTS AT THE END OF THE POST - Updated 21.06.2021 01:42 CET!**  \n\n\nHey everyone,\n\ntime is running out for some people in the market and it's neither GME nor retail.\n\nA big issue in this whole GME situation is a lack of data. Retails just have access to limited informations, sometimes non, but in generall not enough.\n\nI spend the last month learning everything I could about data, what data is available and how to get this free data.\n\n[Thx to  u\\/hamzah604  for this great meme! :D ](https://preview.redd.it/xcsho42eb7671.jpg?width=500&format=pjpg&auto=webp&s=e0885a916b7d0d61c585208849b267e5ee30a5dd)\n\nYeah, RegSho. Everyone knows RegSho. But the data just goes back as far as 1 year and thats it.\n\nReally?\n\nOn the visible level - Yes.\n\nOn smart brain level - No.\n\nI realised that the useable timeframe is moving on with the time passing by. So I asked myself - do they delete the files the moment they disappear on the webside?\n\n&#x200B;\n\nhttps://preview.redd.it/w8d0u3awb7671.png?width=286&format=png&auto=webp&s=28b0756e7417b8fa46a687f2aa776136635e94bb\n\nSo I merged ALOT links in Excel, threw them into JDownloader and VOILA:11.551 Files - and a way more accurate data collection then Apes ever had!\n\n&#x200B;\n\nhttps://preview.redd.it/80vjjcijc7671.png?width=620&format=png&auto=webp&s=dab806ac11059f3787a21e0fa79953e0de80c636\n\nI extracted all available GME data and all available CBOE Data back to 2010, merged them with Historical Data provided by Yahoo, Nasdaq and Fail To Delivery and **made on big MasterSheet for every GME retail.**\n\nThe overall accuracy is around ~~45%. Means, 45%~~   **50,37% (recalculation at the end)** of all shares traded between 2010 and 2021 are displayed in the data. Its lower at the beginning of the timeframe, but gets better over time.\n\nI already produced some charts for people with the excel-level ape.\n\nI further organised my whole data collection, zipped it and **uploaded it on Mega so that EVERY FUCKING RETAIL has access to better data for free**, totally unrelated to GME. Its a shame that retails are getting no support - so we have to help each other!\n\nOne chart from the Mastersheet shall be displayed here to raise your attention for data:\n\n[Timeframe 2015-2020 - Does anyone else see a pattern? \\(Source: Mastersheet\\)](https://preview.redd.it/33vqk8rwi7671.png?width=2015&format=png&auto=webp&s=b084e9e2e603011ace9b5dda290b063ea2a5c737)\n\n[Because my first calculation was like: WTF GME? This doesnt make any sense - Should compare!  \\(thx to the discord dudes giving me this stock names for a comparison\\). The results are - interesting - And like: WTF?](https://preview.redd.it/63t4ssmvi7671.png?width=928&format=png&auto=webp&s=d0de8c44bc70e3f9977ac0f303e49a16a46baec9)\n\nI dont know if this data set is enough to proof naked short selling with data, but if this is the case, I really would like this SEC Award! :D SEC pls?\n\n**You can download the Mastersheet here:**\n\n[https://easyupload.io/ogovzr](https://easyupload.io/ogovzr)\n\nContains all Information I could find for GME in the data sets. Contains prebuild charts and comparisons.\n\n&#x200B;\n\n**You can download the whole fkn collection ( 1,4 GB zipped, 4 GB unzipped - 22.734 Files)**\n\n[https://mega.nz/file/ikgUUCRC#HxOl0afMatKWpmmWrYOBMwQgQwVU2MHgGSoG0p1uRQk](https://mega.nz/file/ikgUUCRC#HxOl0afMatKWpmmWrYOBMwQgQwVU2MHgGSoG0p1uRQk)\n\nContains my entire data collection  - have fun! And pls, share it with every community that could have use for this information. The data collection is about ALL stocks - and I think alot retails rely their investment on bad data atm. If you want to work with the raw data on your own, get Notepad ++  - makes it way more easier to work with this amount of data.\n\n&#x200B;\n\n[To the Moon!!! ](https://preview.redd.it/p2aeqok3f7671.png?width=1182&format=png&auto=webp&s=9268bc219dfd78277936ebab2edfbabd7b8835b0)\n\nThats the part a youtuber would ask for your financial support, but I have another request:If you make money because of this data collection, you already made a fortune in stocks and you are happy to finally have some quality data - **give some money to charity.**\n\nI worked 4 month to get this done - and you would make me happy if your donation would be for a  **Children's hospice** \\- because this is something that should be supported more. And I am pretty sure they would love to play some Mario or have a nice  stuffed animal of their favorite character.\n\n**Let's take care of each other and support people who need our help.**\n\n**Let's change the world.**\n\n**Gamers and Retails United!**\n\nBest wishes and have a great Weekend!\n\nYour\n\nAnnihilationGod\n\nPS: I'll publish the link to the updated versions of the collection and mastersheet on my Twitter:@ Annihil4tionGod  or here at r/Superstonk . If you got any questions regarding the data and so on, pls reach out.\n\n&#x200B;\n\nUsefull links to get daily data about shorting:[http://regsho.finra.org/regsho-June.html](http://regsho.finra.org/regsho-June.html)\n\n[https://www.cboe.com/us/equities/market\\_statistics/short\\_sale/?mkt=bzx](https://www.cboe.com/us/equities/market_statistics/short_sale/?mkt=bzx)\n\n[https://www.cboe.com/us/equities/market\\_statistics/short\\_sale/?mkt=byx](https://www.cboe.com/us/equities/market_statistics/short_sale/?mkt=byx)\n\n[https://www.cboe.com/us/equities/market\\_statistics/short\\_sale/?mkt=edga](https://www.cboe.com/us/equities/market_statistics/short_sale/?mkt=edga)\n\n[https://www.cboe.com/us/equities/market\\_statistics/short\\_sale/?mkt=edgx](https://www.cboe.com/us/equities/market_statistics/short_sale/?mkt=edgx)\n\nHistorical Data (open, high, low, close, volume:):\n\n[https://de.finance.yahoo.com/quote/GME/history?p=GME](https://de.finance.yahoo.com/quote/GME/history?p=GME)\n\n[https://www.nasdaq.com/de/market-activity/stocks/gme/historical](https://www.nasdaq.com/de/market-activity/stocks/gme/historical)\n\nSEC Search Edgar (better then [Sec.report](https://Sec.report)):[https://www.sec.gov/edgar/search/?r=el#/dateRange=all&category=form-cat0](https://www.sec.gov/edgar/search/?r=el#/dateRange=all&category=form-cat0)\n\n&#x200B;\n\n**Add: I wanna thank SC - he helped me alot over the past months - this collection would not exist without his advice and support whenever I could not solve a problem!**\n\nThx SC!;) I owe you a beer!\n\n&#x200B;\n\n**Update 22:50 CET**\n\n\\*\\*Add2:\\*\\*I couldnt accept that i couldnt find any stock so far with a negative quote like GME - so I made another research. I decided to choose the stock mentioned in this article I had read back in Feb 2021:\n\n[https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article\\_id=224548&navigationaction=industrynews&newssection=industry](https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224548&navigationaction=industrynews&newssection=industry)\n\n[Perhaps someone who already downloaded the collection could crosscheck this pls?](https://preview.redd.it/6ualqyhiba671.png?width=478&format=png&auto=webp&s=fc3ac5612b14a7869a9b5fe404a8dbf69a398737)\n\n&#x200B;\n\nAdd3: 20. June 2021:I have to admit that I did a mistake while calculating the accuracy of the data. It is 50.37% instead of 45% like i wrote before.\n\nhttps://preview.redd.it/9ldmzz9g8h671.jpg?width=633&format=pjpg&auto=webp&s=9c13ed4b7597f89827a99372df4f0a83625e2917\n\nI looked deeper into the data to understand the relationship between regular volume and short volume better. This is the result for the Timeframe 2010-2021. I am trying to increase my data collection tonight and will try to find out, if the balance had been positiv before 2010.\n\n[Chart GME](https://preview.redd.it/co0zp2cfkh671.jpg?width=4932&format=pjpg&auto=webp&s=122e4b939fb5b55473b7136e6dc4896442e66bff)\n\n[Chart OSTK - I though it would be a good idea to use OSTK again because i already compared it above with GME. ](https://preview.redd.it/s4vay0et8i671.jpg?width=5166&format=pjpg&auto=webp&s=3a1f4b2085642b9ca0efae345e97b161c1add7cb)",
    "title": "AnnihilationGod presents: The Big Short Data Collection for Everyone - Or: How to data proof irregularities in GMEs trading history for everyone (AGods GME Mastersheet + Full collection Download link at the end)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o3e9kg/annihilationgod_presents_the_big_short_data/"
}