{
    "author": "LaserHawk_",
    "created_utc": 1619060078.0,
    "distinguished": null,
    "edited": 1619073276.0,
    "id": "mvvspq",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mvvspq",
    "num_comments": 128,
    "permalink": "/r/Superstonk/comments/mvvspq/cede_co_the_secret_trilliondollar_company_that/",
    "score": 1162,
    "selftext": "Hello apes of all genders. With the awakening given to us by u/atobitt regarding the rampant corruption that runs up and down the chain I began my due diligence. I ran across an article that I thought had to be shared.  \n\nI would like to say that I didn’t write this article but it’s on a crappy website that wants to spam you with ads. However, it’s written in a mature ape language that’s easy to understand and reads to me who the actual illuminati is. Surprise it isn’t the Rockefeller’s, Rothschilds or Bilderbergs. \n\nHere is the article: https://www.dailystar.co.uk/news/weird-news/secret-trillion-dollar-company-owns-20790205\n\nEnjoy 🍌 \n\nConspiracy theorists are convinced that a tiny organisation owns all of the wealth in the US. \n\nWho owns America? That depends who you ask. A growing body of opinion points to an obscure, but immensely powerful organisation called CEDE and Company.\n\nThis small New York based financial institution has a dozen directors and no more than a half dozen employees but holds, according to some reports, some 34 trillion dollars in assets. A complex system of interlocking bodies, such as The Depository Trust &amp;amp;amp;amp;amp;amp; Clearing Corporation, the National Securities Clearing Corporation and the Fixed Income Clearing Corporation oversee all stock trading in the US. They all come under the umbrella of Cede.\n\nAnd, on paper at least, own all the stocks traded. The multi-trillion dollar secret works like this: The Depository Trust Company is a private bank for securities. Every other financial organisation in the US, bankers and brokerage houses, is obliged to secure membership with DTC.\nLike the Federal Reserve, DTC is a private company entrusted with national responsibility. It processes all stock and paper securities for every US bank and brokerage house.\n\nCede technically owns nearly all of the publicly issued stock in the United States. Private investors don’t own the stock they think they own, but rather have contractual rights that are part of a complex chain of rights ending up at Cede and Company.\n\nIt sounds dry and academic, but it impacts every American. And as long as the USA remains the preeminent economic power on Earth, it affects the rest of us too.\n\nThe Depository Trust Company absolutely controls every paper asset transaction in America and they physically hold the majority of stock and bond certificates in their name. Very few people hold genuine stock ownership certificates. Most trust their brokers to do that for them.\n\nAnd many Americans, who unlike Brits depend on private finance for all of their retirement and health needs, are concerned that these precious stocks could at any moment ‘vanish’ overnight to service the country’s staggering national debt. The Depository Trust &amp;amp;amp;amp;amp;amp; Clearing Corporation is notoriously publicity-shy, but the DTC’s Jim McNeff spoke to financial journalist Anthony Wayne. Explaining to Wayne how infallible the DTC’s governance of the US stock market was, he said ”DTC's first controlled test was 4 or 5 years ago. Do you remember Black Monday? There were 535 million transactions on Monday, and 400 million transactions on Tuesday\". \"DTC cleared every transaction without a single glitch!\".\n\nWayne’s conclusion from that interview that Black Monday – a colossal financial downturn that ruined many Americans – was a controlled test. That it was a deliberately manipulated disaster for the benefit of the DTC.\n\nWith the global financial system becoming ever more complex, it’s increasingly hard for even the experts to understand much more than a part of it.\n\nThe 2008 financial crash which led from a crisis in the US subprime mortgage market to a series of massive bailouts that taxpayers are still paying for is just one symptom of a system that’s not only too big to fail.\n\nAs one Reddit user put it: “America has gone bankrupt 4 times. The government has mortgaged the entire country. No one really owns anything...we don't even have our original birth certificates. Titles and deeds have small print telling you the original is with the DTCC.\n\n“All the people, and their property, are really owned by Cede, which is owned by the private bankers… “It is not a lawful system, but it is legal.”\n\nEDIT 1: Found this 6Y Reddit user who was deleted and only got like 4 upvotes on his post 🤔 \n\nAnd correction it is the damn Rothschilds and fam.  \n\nhttps://www.reddit.com/r/conspiracy/comments/26xqtg/who_owns_cede_co/?utm_source=share&amp;amp;amp;amp;amp;amp;utm_medium=ios_app&amp;amp;amp;amp;amp;amp;utm_name=iossmf\n\nEDIT 2: And we thought England owned us. Larger share holder in this shadowy clan is Australia. DTC is 13th in the club. LETS MAKE THEM LAST PLACE!\n\nhttp://www.gwb.com.au/gwb/news/banking/wpac97.html\n\nThis is WWIII. They need us or the game is over. What are they going to do play against themselves? 10 Million floor is still cheap. We want reparations for all of our ancestors you reptilian creatures!\n\nEDIT 3: \n- Owners of all stock certificates. \n- Owner of all birth certificates. \n- 🤔",
    "title": "Cede & Co. The secret trillion-dollar company that owns America",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvvspq/cede_co_the_secret_trilliondollar_company_that/"
}