{
    "author": "Kangaroosexy23",
    "created_utc": 1623581224.0,
    "distinguished": null,
    "edited": 1623619450.0,
    "id": "nytql1",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nytql1",
    "num_comments": 167,
    "permalink": "/r/Superstonk/comments/nytql1/is_the_new_shill_campaign_just_trying_to_make_us/",
    "score": 1047,
    "selftext": "OMG!??!? The company made up of members participants has member participants on it's board.\n\nTHIS IS AN OUTRAGE HOW DARE THEY!!! \n\nNo, this is literally how the DTCC is founded. \nMost of the board of directors are board members of other banks and hedge firms.\n\nThis is like being angry that the NFL is owned and operated by the guys that own the teams.\n\n\nThe next one? \n\nWarren buffett owns xxxxx shares of GME!!! Omg!?!??\n\nHow did they get that number? Berkshire has an 8% stake in a company that owns gme.\n\nThat's not how any of this fucking works!!!!!\n\nIf you collected 756,000 shares of GME (roughly 1% of the company's shares) you are not entitled to 1% of what's in your local game stop. \n\nStop up voting this shit, it smells like a shill campaign to discredit this group.\n\nYou karma farmers that are pushing this shit, fucking stop.\n\nYou fuckers just mindlessly up voting mis-information. This shit takes like 5 minuets to figure out. \n\nY'all, we are each other's brothers and sisters. \nAs your ape kin, I'm telling you to do better.\n\nWe are gonna get paid, all we gonna do is hodl.\nThe system might not even get fixed after this shit.\n\nBut we can worry about that AFTER WE GET PAID. we are here about making money.\n\nThis community is here to make fucking money. \n\nOnce we have money we can change the fucking world with it. But first we are here to get paid.\n\nEdit: auto correct got me.\n\nAnd down vote all you want it ain't changing the truth.",
    "title": "Is the new shill campaign just trying to make us look stupid?",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/Superstonk/comments/nytql1/is_the_new_shill_campaign_just_trying_to_make_us/"
}