{
    "author": "k9handler2000",
    "created_utc": 1620493745.0,
    "distinguished": null,
    "edited": false,
    "id": "n7torw",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_n7torw",
    "num_comments": 116,
    "permalink": "/r/Superstonk/comments/n7torw/as_someone_who_paperhanded_when_the_price/",
    "score": 3590,
    "selftext": "I had been investing for 2 weeks when the price hit $480 in January. I had read a few DDs, learned the definition of short selling, but that was pretty much it. My appetite for risk was low but I believed in the squeeze just enough to hold until I saw red in my account. It was the first time I had “lost” money in stocks and it was fucking scary, so I pulled out.\n\nI feel like I was a completely different person back then. I actually looked to the mainstream media to tell me when the squeeze was over! But when we saw that DFV had doubled his position, I knew something was up. I started reading DD again, and a week later I had a position 2x larger than I had before. I transferred to Fidelity, where I plan to diamond hand every one of my shares until every HF short on GME has collapsed in on itself like a dying star.\n\nThe months of reading DD, researching new topics and wrapping my mind around how huge this squeeze is gonna be has sealed their fates. They made a bet that retail would give up the second we faced any conflict, and it was the worst bet ever made on Wallstreet.\n\nI also wanna thank all you apes who held the line during the first squeeze. You truly have diamond fucking balls/vulva. Us baby apes wouldn’t be here right now if it weren’t for you!",
    "title": "As someone who paperhanded when the price plummeted in Jan, the worst decision HFs could have made was to give us months to read DD and grow our position. My hands are pure diamond now!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n7torw/as_someone_who_paperhanded_when_the_price/"
}