{
    "author": "phoenixfenix",
    "created_utc": 1621181263.0,
    "distinguished": null,
    "edited": false,
    "id": "ndrjl8",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ndrjl8",
    "num_comments": 993,
    "permalink": "/r/Superstonk/comments/ndrjl8/naked_short_sellers_have_set_our_cancer_research/",
    "score": 22383,
    "selftext": "**Before I start:** I received my PhD studying drug delivery platforms of small molecule and protein based immuno oncology therapeutics in 2019 from one of the world’s best universities. I will not disclose anymore personal information since it looks like this forum is under a lot of scrutiny.  \n\n&nbsp;\n\nLet me give you all a little historical background to Immuno oncology (I/O). I/O is an incredibly hot field of cancer therapeutic research today that harnesses your own immune system to fight off cancer. Think of a vaccine that trains your body to kill off cancer cells. In ideal cases, the patient gets some flu like symptoms (that’s their immune system being activated), and then they go into full remission, with their immune system protecting their body from cancer.  \n\n&nbsp;\n\nThe first major blockbuster I/O therapeutic that was FDA approved was Nivolumab, an anti-PD-1 antibody. It was approved in 2014. One year later, Yervoy (CTLA-4) was FDA approved. Three years later (2018), Professors James  Allison and Tasuku Honjo share the nobel price in medicine for discovering CTLA 4 and PD-1, respectively. In other words, this shit is a big deal, and is now believed to be the ideal therapeutic modality to cure cancer.\n\n&nbsp;\n\n\n**Okay-Superstonk time**\n\n\n&nbsp;\n\nThe other night I was watching the wall street conspiracy, after it was mentioned in a couple of superstonk interviews. About 10 minutes in, they start disclosing an example of naked short selling of a biotech company called “Viragen”, and how their treatment could cure multiple sclerosis and metastatic malignant cancer. There was this stock broker and an ex employee of Viragen talking up this treatment, and how it could cure cancer.\n\n&nbsp;\n\n\nTheir stock was naked short sold on the open market, tanking their share price, and preventing them from raising funds, destroying their credit, and ruining their future prospects. Sound familiar?\n\n&nbsp;\n\n\nI rolled my eyes and called bullshit: you know how often universities “cure” cancer? About once a week. Odds are that this was some bullshit treatment, or it was some minor tweak of chemistry on a chemotherapeutic. Yeah, the medical and scientific community would “suffer”, but honestly, no big deal. \n\n&nbsp;\n\n\nBut then they called out the drug name: Omniferon, which immediately struck me as an interferon therapeutic, as early stage drug companies are rarely creative with their names. I immediately stopped watching, and looked into Viragen. What I found got my blood boiling.\n\n&nbsp;\n\n\nThere’s no longer very much information about Viragen, but what I found was that: Viragen was a biotech company founded in 1980, and their lead candidate was a multitype human interferon alpha, starting their clinical trials in the early 2000s.\n\n&nbsp;\n\nWhat is interferon alpha, can it cure cancer, and why do we care about a company founded in 1980? Well, to get started, interferon alpha is a protein based immune cytokine that modulates immunity. In ape-speak, this thing can jump start your immune system. Useful for things like… I don’t know, cancer, covid, Hepatitis, HIV, etc? There are currently over 3000 clinical trials recorded on the use of interferon alpha for dozens of different diseases: https://clinicaltrials.gov/ct2/results?cond=&term=interferon&cntry=&state=&city=&dist=\n\n&nbsp;\n\n\nSo wait, this company was working on an immunotherapeutic all the way back in 1980? Yep, it looks like it. Before oncologists had even coined the term immuno oncology, these guys were trying to do it. Let’s look at the timing of their drug development and compare it with another therapeutic: Peginterferon alfa-2a and alfa-2b, two modified single type interferon alphas that is sold today be Merck. They were clinically approved in 2001 and 2002, respectively. Viragen’s multitype interferon was hot on the heels of Merk’s therapeutics, with phase II clinical trials in Europe ongoing around the same time: https://www.bizjournals.com/southflorida/stories/2001/06/18/daily33.html\n\n&nbsp;\n\n\nIn vitro studies showed that their multitype interferon was superior to Merck’s interferon in vitro: https://www.biospace.com/article/releases/viragen-inc-multiferon-r-shows-potent-activity-in-preventing-the-progression-of-malignant-melanoma-study-to-be-published-/ (just a heads up, as a scientist, I can tell you this study drew the wrong conclusions from the data, but thats not the point. This was a legitimate company trailblazing one of the hottest biopharma fields today)\n\n&nbsp;\n\n\nLastly, in spite of all of the naked short selling of Viragen, they were still able to get clinical approval of multiferon in Sweden: https://www.thepharmaletter.com/article/viragen-s-multiferon-approved-in-sweden.\n\n&nbsp;\n\n\nSo let’s recap. Viragen was an early trailblazer of today’s massive field of immuno oncology, which lead to two nobel prizes in 2018. They gathered a team of talented scientist, technicians, clinicians, and businessmen to drive forward a potentially groundbreaking cancer therapeutic. They were shortsold into the dirt because shortsellers in the early 2000s did not understand what I/O was. In spite of all this, they developed an immunotherapeutic that had enough clinical success to be approved in Europe, in spite of their inability to raise funds on the stock market. Imagine what they could have done if they weren’t short sold?\n\n&nbsp;\n\n\nThis leads to another question that really gets my blood boiling. What other companies are developing new therapeutics, or trailblazing new scientific, medical, or engineering modalities that are getting short sold into the ground? I know of three companies off the top of my head in the EV space (QS, TSLA, and RIDE…DO NOT BUY THESE COMPANIES RIGHT NOW, GME IS THE MOASS)\n\n&nbsp;\n\n\nShort sellers are not innovators. They are not scientists. They do not have the ability to think outside the box and see what others do not. They do not understand the technologies they are shortselling. They do not know the feeling of spending countless nights in the lab trying to achieve their vision, frustrated by all of the setbacks, but driven by the potential of their work to change the world. Short sellers are parasites, taking advantage of innovative technologies that the average investor does not understand. They naked short sell, and spew FUD to make money, all while driving perfectly good companies in the dirt.\n\n&nbsp;\n\n\nFuck these guys. They all belong in jail. Short selling should be banned. I’m not selling.",
    "title": "Naked Short Sellers have set our cancer research back decades from their abusive short selling.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/ndrjl8/naked_short_sellers_have_set_our_cancer_research/"
}