{
    "author": "Icy-Paleontologist97",
    "created_utc": 1621177832.0,
    "distinguished": null,
    "edited": 1621219760.0,
    "id": "ndqd6e",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ndqd6e",
    "num_comments": 325,
    "permalink": "/r/Superstonk/comments/ndqd6e/this_week_is_different_than_jan_march_because_we/",
    "score": 3221,
    "selftext": "GOOD MORNING COURAGEOUS & BEAUTIFUL APES! Before I begin I just want to share with all of you how privileged I feel to count myself as a member of your ranks. Being here on Reddit with you, on the frontlines of this once-in-a-lifetime experience is truly a great honor. In other words, I’m so happy I have found you all - many of you have helped restore my faith in humanity.\n\nNow onto the purpose of this post. Im sure quite a few of us by now have figured out with the help of our wrinkly brothers and sisters exactly what it is that DFV knew to inspire both his tweets in the lead up to 4/16 and his double down. A pattern has emerged in the criminal and chaotic history of GME’s share price. One DFV picked up on over a year ago.\n\nAs has been discussed, shorts have likely hidden naked shorts inside married puts between the $5 and $.5 range. I’ll leave the explanation of naked puts to the wrinkles because the most important thing to know about them is that that SHFs must cover these puts, when they expire OTM, in 35 calendar days.\n\nAnd the puts are on a cycle. Jan/Feb saw 18m puts that needed cover. March 19m. And now April with the highest number yet: 230,000 puts which equals 23 million shares. These puts were purchased back in April of 2020 when DFV also purchased his calls. Very likely, he was matching these puts with calls, in a grand game of 4D poker. \n\nThere is little to no evidence suggesting that these April puts have been covered meaning this week, May 17-21 is the last week the SHFs have the opportunity to do so.\n\nNow of course, the above dates also correspond with the major price run-ups of GME. +$400 in Jan. $350 in March. Those run ups were likely shorts covering puts. A lot of puts. Millions of puts.and once they cover they are able to then issue millions of more phantom shares to push the price back down and kick the can down the road.\n\nThis week, however, is different. You see, for starters, they will need to cover more than they have ever covered before. 23m shares (230,000 puts) is the highest number of puts needing to be covered at one time in this stock’s history.\n\nSo what? You ask. They will cover abs then print millions of more phantom shares and the cycle will repeat itself. Sic mundus creatus est…\n\nAnd yeah, that could happen.\n\nBut I don’t think it will and here’s why. It gets at what else is different this time around. Namely, the volume. It’s drier than a British sitcom. Why? Cuz no one is selling!!\n\nSure, we see some sell volume. Most of this is shorting, but the rest is likely wash trading. SHFs passing the same couple hundred thousand shares back and forth, back and forth to depress the price.\n\nWhat we see though is that after these shares are gone, the asks jump into the thousands.\n\nAnd when they cover their puts, they can’t do so with the same couple hundred thousand shares they pass back and forth between themselves.\n\nTHEY NEED APE SHARES! 🍌 🍌 🍌 \n\nHow are the SHFs going to get those for $400 when no ape is selling for $400? Especially not 23 MILLION shares. Hmmmmmm. I honestly can’t think if an answer to that question unless we change one if the conditions: either apes sell for $400 or SHFs pay A LOT more? (I see you, Mr. $69,420!)\n\nTL;DR: This week is different. The playing field has changed. We aren’t the same apes we were back in January. But the SHFs still have to cover their puts. The question is, have apes changed enough to set the price at which SHFs cover? The extra dry volume suggests YES!\n\nSee you on moon, you big, bold shrewdness of apes! 🌙 🚀 🍌\n\nEDIT: I’m progressively adding DD to the bottom of this post. I’m not doing it all at once because I just spent a lovely afternoon with my mother drinking potent bloody Mary’s. I am now on my second homemade blackberry cider. In other words, I’m taking my time here to savor this moment both in the Superstonk community and with my mother and these marvelous elixirs.\n\nFirst: screenshot of 4/16 puts. This says there were over 400,000 but only 230,000 of those are deep OTM made by short HFs a year ago. This is what must be covered now.\n\nhttps://www.reddit.com/r/Superstonk/comments/mr9bfb/416_option_scraper_data_total_calls_itm_calls/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nHere is a great DD on the FTD cycle:\n\nhttps://www.reddit.com/r/Superstonk/comments/ne3ra6/t21_from_put_expiry_dates_could_be_key_to_the_ftd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
    "title": "This week is different than Jan & March because we all have more wrinkles - what DFV knows",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ndqd6e/this_week_is_different_than_jan_march_because_we/"
}