{
    "author": "possibly6",
    "created_utc": 1618527099.0,
    "distinguished": null,
    "edited": 1618527489.0,
    "id": "mrq5jh",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mrq5jh",
    "num_comments": 126,
    "permalink": "/r/Superstonk/comments/mrq5jh/gme_price_levels_to_watch_416/",
    "score": 2094,
    "selftext": "Salutations once again sweet apes, u/possibly6 here with your daily debriefing and price action recap.\n\nAs always, this aint no mothafuckin financial advice, hoe. The views expressed here are solely my approach to investing in this specific equity. I ape an am.\n\nobligatory.\n\nToday's DD is gonna be brief, again I personally don't even really watch the ticker anymore. I know what is coming and it's a state of nirvana almost. If you missed my last post, my TLDR was as follows:\n\nGood price action today on relatively low volume. Using EW theory, I would like to see a retest of 153-155 before making the next leg up to 200+ in the very short term. If you can scoop up shares for sub 200 you're still getting a steal of a price, what goes down (artificially) must go back up! 🚀\n\nSo today as expected, we **appear** to have completed our mini wave 2 of 5. Remember this is a corrective wave that targets **at least** (key words) a 50% retracement of wave 1.\n\n&#x200B;\n\n[elliot waves visualized](https://preview.redd.it/jb7ptderwet61.png?width=299&format=png&auto=webp&s=8c6787f0394ee8b440cbd5a95bddbb10786de579)\n\nThis is my chart view of today:\n\n[5m view](https://preview.redd.it/znhjjkg0xet61.png?width=2856&format=png&auto=webp&s=818054132d027f945c01aeb4020fbc08e40c342e)\n\nAs you can see, price hit the area as predicted by the purple line I drew yesterday. I also wanted to clarify, in my last post I had the wave 3 as a more or less vertical line. This was just to visualize the price target, and was NOT implying that we would see x price today, so sorry if that confused anyone.\n\nYou could make the argument that an intraday cup and handle is formed, and this would be confirmed by price holding above the low of the day (LOD)\n\nAs long as price doesn't break below today's low, wave 2 is confirmed to be completed and wave 3 is next. Remember, wave 3 is often times the biggest and strongest of the 5 waves.\n\nAssuming today completed our wave 2 retracement, that puts our wave 3 inside of wave 3 inside of wave 3's first target at roughly 220, the 1.618 extension of wave 1's high of 174.09.\n\nI found this little cheat sheet on google images so you can visualize EW a bit better.\n\n&#x200B;\n\n[cheat sheet 1](https://preview.redd.it/su6rpyrnzet61.png?width=300&format=png&auto=webp&s=482d0b3d1e1c4338954bf26555feaeebce121319)\n\nWe are in between the big wave 2 and 3, between the smaller 2 of 3, between the smaller 2 of 3 (you can't see that on here but you get the idea). hope that makes at least some sense lol.\n\n[wave 3 should say 3 obviously lol](https://preview.redd.it/k8vtrklqzet61.png?width=980&format=png&auto=webp&s=1796080f571d94901c024bbf1cd57e73b74b1394)\n\nNot all wave formations are like this but this is the most common. trying to explain makes my head spin uncontrollably.\n\nIf we break below 153 tomorrow, the next level's down to watch are between 148 and 150. as visualized above, wave 2 targets at minimum 50% retracement, though often times it is 61.8% and sometimes 78.6%.\n\n&#x200B;\n\nThis would change the wave 3 pt to somewhere around 216. Whatever happens, you can bet your ass I'll be buying more.\n\nlast thing to consider: **VOLUME.** Today's volume was a mere 7.8m, whereas yesterday we saw 21m volume.\n\n&#x200B;\n\n[Look how low volume bars are ](https://preview.redd.it/8ratjfmk0ft61.png?width=2854&format=png&auto=webp&s=94d8c15ae80b140e527c2ffd539f6d5c447a8f53)\n\nA catalyst will ignite this and everyone knows it. I dont care when it happens, the longer it is pushed off the more time I get to buy, so can't really complain.\n\nBurry was years early on his \"Big Short,\" I know you all can stomach waiting a bit longer.\n\nTLDR: As predicted yesterday, we retraced to the 153 area which looks to be the end of wave 2. Wave 3 first target IF WAVE 2 is not invalidated (a break below 153) is 220. If we break below 153, I am looking for 148-150 for confirmation of the end of wave 2. It costs me nothing to hold shares, unfortunately for short sellers that's not the case. Let them bleed while apes accumulate even more 🚀\n\nobligatory 🚀 🚀 🚀 🚀 🚀\n\nalso lol, look at GameStop's new shirt:\n\n[jacked. ](https://preview.redd.it/078a1xli1ft61.png?width=2604&format=png&auto=webp&s=e6ebec10fb0e301b156b5bbfb7f91226d9c1e782)",
    "title": "GME Price Levels To Watch 4/16 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mrq5jh/gme_price_levels_to_watch_416/"
}