{
    "author": "friedmice",
    "created_utc": 1618468489.0,
    "distinguished": null,
    "edited": 1618470993.0,
    "id": "mr94va",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mr94va",
    "num_comments": 149,
    "permalink": "/r/Superstonk/comments/mr94va/world_war_whale_explanation_of_95_short_volume/",
    "score": 3156,
    "selftext": "Posting for visibility, as it's a fantastic interpretation of the [short volume for IXG that I posted earlier today.](https://www.reddit.com/r/Superstonk/comments/mr1gho/95_short_volume_the_past_3_days_on_millions_of/?utm_source=share&utm_medium=web2x&context=3)\n\nCredits to u/choompop for writing the DD below! Link to his post: [https://www.reddit.com/r/GME/comments/mr6pz6/world\\_war\\_whale\\_explanation\\_of\\_95\\_short\\_volume/](https://www.reddit.com/r/GME/comments/mr6pz6/world_war_whale_explanation_of_95_short_volume/)\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n**APES, I have GREAT news, but the data may be deceiving.**\n\nI initially [commented](https://www.reddit.com/r/Superstonk/comments/mr1gho/95_short_volume_the_past_3_days_on_millions_of/gujz813/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) on [this post](https://www.reddit.com/r/Superstonk/comments/mr1gho/95_short_volume_the_past_3_days_on_millions_of/?utm_source=share&utm_medium=web2x&context=3), but I decided to make a post for visibility purposes.\n\n**There are long whales in a massive battle for control. $GME seems to be the battle ground, and we may have passed a threshold that shows our tendies are coming (shorts are fuk).**\n\nHere are the three main points:\n\n**PART 1 - IXG HOLDINGS & INSANE SHORT VOLUME**\n\nIXG (iShares Global Financials ETF) has an insane short volume in the past few days as you can see in [u/friedmice](https://www.reddit.com/u/friedmice/)'s post.\n\n[Credit to u/friedmice](https://preview.redd.it/2cscljukb9t61.png?width=1678&format=png&auto=webp&s=95f59484baee319ca615e44eae7d0b502d50201d)\n\nIXG is an ETF for major **bank stocks**, including:\n\nBerkshire Hathaway, **JPMorgan Chase & Co**, **Bank of America**, AIA Group, Wells Fargo, Citigroup HSBC Holdings, Royal Bank of Canada, **Morgan Stanley**, Commonwealth Bank of America\n\n*Twist:* **The 2nd largest institutional owner of JPMorgan is Black Rock Inc. with 192 million shares. The 3rd largest institutional owner of Bank of America is Black Rock Inc. with 509 million shares.**\n\nI will explain the significance of JPMorgan, Morgan Stanley, and Bank of America in part 3 (Team Rocket).\n\n**🚀🚨IXG is ‘an exchange traded fund launched by BlackRock, Inc. The fund is managed by BlackRock Fund Advisors.’**\n\nBelieve it or not, the huge red candles are most likely a bullish indicator, not a bearish one.\n\nSo, why is the short volume so high on IXG?\n\n**PART 2 - SHORT VOLUME =/= SHORT INTEREST**\n\n**Apes don't like shorts.** Keep in mind, however, that short interest and short volume are two different things.\n\n**Short interest** is the number of shares that have been sold short but have not yet been covered or closed out (**Melvin**). This is when an institution is betting the price of a stock will go down.\n\n**Short volume** is measured from the perspective of the **Market Maker**.\n\n**THE SHORT VOLUME COMES FROM MARKET MAKERS SELLING BORROWED STOCKS TO DELIVER SHARES TO EAGER BUYERS**\n\nIf many people want to purchase IXG shares while no one is selling, the Market Makers will borrow the shares to increase liquidity in the market. **This is not them betting on the price to go down, this is the MM providing liquidity which they are required to do by law.**\n\nThe short volume being so high indicates that the only people willing to sell shares of that ETF are the the market makers. This is an indication of what big money sees as a safe haven.\n\n\\****KEEP IN MIND: GME SHORT INTEREST IS WELL OVER 100% (POSSIBLY MUCH HIGHER). DON'T GET TOO CONFUSED TRYING TO UNDERSTAND THE DIFFERENCE BETWEEN SHORT VOLUME AND INTEREST.***\n\nSo, why is it important that IXG may be speculated to be a \"Safe Haven\"\n\n**PART 3 - WORLD WAR WHALE**\n\n**There is a Financial War over control of the DTCC (JPMorgan/Black Rock vs. Citadel)**\n\nTo preface, I am building off of DD researched by [u/yosaso](https://www.reddit.com/u/yosaso/). The thesis from [“There is a WAR to control the DTCC and GME is the BATTLEGROUND: Citadel & Co VS JPM/BOA & Co”](https://www.reddit.com/r/Superstonk/comments/mouj57/there_is_a_war_to_control_the_dtcc_and_gme_is_the/?utm_source=share&utm_medium=web2x&context=3) is that there is an **ongoing war between the whales for control over the DTCC**. If you haven't read that yet, I highly encourage you to do so.\n\n**There is currently a STOCK ALLOCATION for the DTCC BOARD.** The fat cats are battling for control.\n\n“Makeup of DTCC Board:\n\nJP Morgan - 4\n\nBOA - 3\n\nCitadel - 3\n\nMorgan Stanley - 2\n\nBNY Mellon - 2\n\nVirtu - 2\n\nGoldman Sachs - 1\n\nCiti - 1\n\nState Street - 1\n\nUBS - 1\n\n**TEAM ROCKET (GME)**\n\nJP Morgan, BOA, Morgan Stanley, State Street, Goldman Sachs - 11\n\n**TEAM SUCK BALLS UNTIL YOU CHOKE**\n\nCitadel, Virtu, Citi, UBS - 7\n\n**TEAM UNKNOWN**\n\nBNY Mellon - 2\n\n\"My guess is that TEAM ROCKET (GME) is in control. They're pushing these new rules and regulations. BUT, TEAM SUCK BALLS UNTIL YOU CHOKE is trying to gain more power and influence in the DTCC.”\n\n*Disclaimer: Some of these positions are speculative. There is no way to know where these institutions truly want moon or doom (aside from Shitadel of course)*\n\n——————————————————————\n\n**WHAT DOES THIS MEAN?**\n\n**Black Rock, Vanguard, and Morgan Stanley are large institutional investors in $GME. Black Rock also holds high positions in JPMorgan and Bank of America.**\n\n**Shitadel desperately wants $GME to fail. They are in a battle against other whales for control of the DTCC and future of our financial markets.**\n\n**The immense buying pressure on IXG (which holds Banks that are on Team Rocket) could point to a shift in the Battle of the Whales.**\n\nBig money may be investing large sums of cash and holding as a hedge against other financial institutions collapsing.\n\n**>GameStop clears debt and approaches possible recall/dividend**\n\n\\>**Citadel, Melvin, shorts on GME get fuk**\n\n**>JPMorgan, BoA, Black Rock collect their scalps and seats on the Board of the DTCC**\n\n**If these large financial institutions are trying to end Citadel and Susquehanna, it is not to benefit us. They want to kill competition and seize power. We are an externality.**\n\nKeep in mind, DD covering the financial institutional battle is somewhat speculative. It is hard to interpret motives of large financial institutions, especially ones that thrive in misinformation.\n\nNot financial advice.\n\n**If you're interested in researching the World War Whale, I encourage you to read these posts:**\n\n1. [BlackRock Bagholders, Inc.](https://www.reddit.com/r/GME/comments/m7o7iy/blackrock_bagholders_inc/?utm_source=share&utm_medium=web2x&context=3)\n2. [CHAOS THEORY - The EVERYTHING Connection](https://www.reddit.com/r/Superstonk/comments/moswde/chaos_theory_the_everything_connection_reposted/?utm_source=share&utm_medium=web2x&context=3)\n3. [Why Is The DTCC Taking So Long To Act?](https://www.reddit.com/r/Superstonk/comments/mmh9jq/why_is_the_dtcc_taking_so_long_to_act_when_moon/?utm_source=share&utm_medium=web2x&context=3)\n4. [There is a WAR to control the DTCC and GME is the BATTLEGROUND: Citadel & Co VS JPM/BOA & Co](https://www.reddit.com/r/Superstonk/comments/mouj57/there_is_a_war_to_control_the_dtcc_and_gme_is_the/?utm_source=share&utm_medium=web2x&context=3)\n5. [BlackRock is about to delete Shitadel out of existence.](https://www.reddit.com/r/Superstonk/comments/mp7zbn/blackrock_is_about_to_delete_shitadel_out_of/?utm_source=share&utm_medium=web2x&context=3)\n6. [Financial mafias and equity swaps – and how one prime broker rules them all 👁️](https://www.reddit.com/r/Superstonk/comments/mqwyg3/financial_mafias_and_equity_swaps_and_how_one/?utm_source=share&utm_medium=web2x&context=3)\n\n**TL;DR**\n\n**We may be witnessing the biggest financial battle in history. The current market behaviors of IXG may be an indicator that Team Rocket (GME) is winning.**\n\n**IXG is an ETF with holdings of JPMorgan, Bank of America, and Morgan Stanley, who all have a vested interest in the demise of Shitadel in order to gain power and influence.**\n\n**High short volume on IXG is indicative of large buying pressure and few sellers. Market makers must borrow and sell the stock to appease buyers.**\n\n**Current trends suggest Big Money wants to back their money with Team Rocket.**\n\n**TA;DR 🚀🚀🚀🚀🚀🦍🦍🦍**",
    "title": "🚨WORLD WAR WHALE🐋⚠️ - EXPLANATION OF ~95% SHORT VOLUME FOR IXG (iShares Global Financials ETF)🚀🚀🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mr94va/world_war_whale_explanation_of_95_short_volume/"
}