{
    "author": "C2theC",
    "created_utc": 1624838788.0,
    "distinguished": null,
    "edited": 1624859509.0,
    "id": "o98tyk",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o98tyk",
    "num_comments": 201,
    "permalink": "/r/Superstonk/comments/o98tyk/a_shill_reached_out_to_me_to_sellhere_are_their/",
    "score": 1848,
    "selftext": "A funny thing happened on Thursday, where there was supposed to be a T+21, and it didn't happen—shills were out in full force to convince everyone to sell. One particular shill decided to reach out to me over Chat, and wasn't very good at their job. I played along to extract the blueprint of how they work, and the arguments they use. The most surprising part was their tenacity. No matter how many ad hominins I threw at them, they seemed determined to want to \"enlighten\" me to sell. See the attached screen shots for the entertainment!\n\n**TL;DR**\n\n1. The shorts are getting desperate if they are hiring people with such low mental capabilities to try to convince diamond hands to sell. It's like they put an ad out for all Nigerian scammers, to dupe apes out of their shares (the time zone is about right)\n2. Shorts are immensely scared of apes not selling\n3. HODL\n\nHere are some of their tactics:\n\n* Begin with a \"friendly\" yet very awkward, non-native English intro to make you think that they are an ape\n* Try to tell you that all of the DD is wrong\n* Ignore basic mathematical and financial concepts and questions\n* Ask you for a screen shot when you sell, saying that it is for a \"survey\"\n* Want to help you and the world sell GME (who has time to do this, unless they are getting paid?)\n* Tell you that the end is near, you should sell now\n* Try to tell you that nothing else will make the stock go up at this point, because the squeeze already happened (yes, that's why GME spiked twice to $350 since then)\n* Downvote button. Much like the *Knights of New*, there seems to be a dark group that I will call the *Scoundrels of Slovenly*. These decrepit beings downvote new postings and comments by apes, so that they never make it to the top of the list. I have seen good comments get downvoted as I refreshed, as well as my *Possible DD* about the AMC and crypto correlation, when I first posted\n\nHere are some of their arguments:\n\n* T+21 has been proven false  \nCounterargument: Only once out of the last six months. Besides, who cares about dates?\n* GME is plummeting  \nCounterargument: Plummeted from $4 to $210?\n* GME has been plummeting since weeks ago  \nCounterargument: My cost basis is $17 (in since December 2020!)\n* I am going to sell, you should, too  \nCounterargument: Super laughable, not sure how to reply to this one\n* GME is on the way down  \nCounterargument: How come it can't seem to go below $200 and there are multiple technical indicators that show support (see: [https://www.reddit.com/r/Superstonk/comments/o7u6z4/technical\\_analysis\\_is\\_bullish\\_on\\_gme\\_chartswere/](https://www.reddit.com/r/Superstonk/comments/o7u6z4/technical_analysis_is_bullish_on_gme_chartswere/))\n* Don't be a bagholder on a company not close to $200 based on fundamentals  \nCounterargument: GME is worth more than $200/share based on all fundamentals\n* You are a cultist  \nCounterargument: I use technical analysis based on mathematical derivations. You use...?\n* Mother of All Plummets  \nCounterargument: This one was pretty creative, I'll give them that\n* The board make a killing with the stock selling  \nCounterargument: Board made nothing, otherwise, it would have to be reported in SEC filings. Company, however, just raised $2B of capital in a stock offering where 8.5M shares were sold, and with a reported 55.8M float, increased the float by 15%, the stock price still ended *up*! Extremely bullish\n* There is no next catalyst  \nCounterargument: T+21 wasn't even a thing a few weeks ago, yet we see massive price action. Also, long term holders don't need a catalyst, only losers are counting on a catalyst (looking at you, Dr. Sunshine <[https://www.reddit.com/r/Superstonk/comments/o78go0/t21\\_spike\\_didnt\\_happen\\_but\\_we\\_are\\_still\\_winning/h2zi9v8/](https://www.reddit.com/r/Superstonk/comments/o78go0/t21_spike_didnt_happen_but_we_are_still_winning/h2zi9v8/)\\>\n* Board is slower than the SEC  \nCounterargument: How so?\n* Board will do nothing about the short squeeze  \nCounterargument: Not their job to save the shorts\n* You will pay a more tax if it climbs  \nCounterargument: This guy is a complete idiot. Of course I want to pay more tax, that means I made more money!\n* You never know when GME is going to plummet  \nCounterargument: Correct, I don't know what shorts are going to do with the price action, but you also don't know if you'll get hit by a car every day you get out of bed\n\n&#x200B;\n\nIn conclusion, I have learned to not promote specific dates, as Reddit is public. Shills can see everything that is put out here, and will devise strategies to demoralize us. However, it is still far better to share our information in public than to hide them, because when we democratize our ideas though peer review, we come up with the best of the best and grow our tribal knowledge.\n\n&#x200B;\n\nhttps://preview.redd.it/wmzpw4jjew771.jpg?width=1242&format=pjpg&auto=webp&s=f7e0dcd7b9de1c4e7e37926decc9c014fc20efa5\n\n&#x200B;\n\nhttps://preview.redd.it/qbdwinhlew771.jpg?width=1242&format=pjpg&auto=webp&s=9ff3083a8b513a75901529263a8dba4bda9b80a0\n\n&#x200B;\n\nhttps://preview.redd.it/om0kesemew771.jpg?width=1242&format=pjpg&auto=webp&s=0407cae74927ee754689dca59e30f2d835250394\n\n&#x200B;\n\nhttps://preview.redd.it/dadhhc5new771.jpg?width=1242&format=pjpg&auto=webp&s=a1c90b282ffa91cbab41ec8c368738eb728f9556\n\n&#x200B;\n\nhttps://preview.redd.it/ifk4d2hnew771.jpg?width=1242&format=pjpg&auto=webp&s=690c3db8367634f5468debe439fc9094e8b2d58c\n\n&#x200B;\n\nhttps://preview.redd.it/gm902utnew771.jpg?width=1242&format=pjpg&auto=webp&s=cbc4c0211c843af62145ea887219be6ebb60bb5f\n\n&#x200B;",
    "title": "A Shill Reached Out to Me to Sell—Here are Their Tactics",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o98tyk/a_shill_reached_out_to_me_to_sellhere_are_their/"
}