{
    "author": "digitaljm",
    "created_utc": 1624848619.0,
    "distinguished": null,
    "edited": false,
    "id": "o9bess",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o9bess",
    "num_comments": 90,
    "permalink": "/r/Superstonk/comments/o9bess/rcs_worldclass_legal_team_with_a_background_in/",
    "score": 3819,
    "selftext": "All credit goes to u/ninche60 and u/deepfuckingvalue.  Ninche60 doesn't have karma to post, so sharing this info with his approval, as I think it's some really great and different confirmation bias.   \n\n&#x200B;\n\nRyan Cohens lawyers\n\nOlshan Frome Wolosky LLP represented Ryan Cohen with Steve Wolosky, Ryan Nebel and Bachar Mahmoud.\n\nShareholder Activism Practice Co-Chair Steve Wolosky is a nationally recognized corporate and securities lawyer who counsels clients in the areas of proxy contests and mergers and acquisitions. Steve has been ranked by Chambers USA as a “Leading Lawyer” (Band 1) in Corporate/M&A: Shareholder Activism category. According to Chambers USA, Steve provides foremost counsel to clients in the market's most significant domestic and cross-border shareholder activism matters.\n\nRyan P. Nebel is a corporate attorney focusing on shareholder activism, proxy contests, mergers and acquisitions and corporate governance.\n\nBachar Mahmoud is a corporate attorney focusing on shareholder activism, proxy contests, mergers and acquisitions and corporate governance.\n\nCohen has some of the best in the world on his team. He’s fighting fire with fire and has the chess board mastered\n\n[Olshan Law](https://www.olshanlaw.com/) Go to attorney search and read up on these studs\n\nNinche60 Edit: I believe in two of their bios it talks about advising hedge funds. To me that screams they can advise RC on what the hedge funds are doing and the best tactics to fight against them.\n\nNinche60 Edit 2: Wanted to add I got this info from going back and looking thru DFV’s old tweets. There is some golden info in those old ones if you go thru them. This one in particular he had tweeted about Ryan Nebel being the lawyer listed in on 13F",
    "title": "RC's world-class legal team with a background in securities, shareholder activism, proxy contests, M&A, and corporate governance. highly specialized lawyers to fuk the shorts in all the right ways. courtesy of u/ninche60 and our boy DFV",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9bess/rcs_worldclass_legal_team_with_a_background_in/"
}