{
    "author": "ReasonablePlatypus31",
    "created_utc": 1623806514.0,
    "distinguished": null,
    "edited": 1623808182.0,
    "id": "o0tgka",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o0tgka",
    "num_comments": 105,
    "permalink": "/r/Superstonk/comments/o0tgka/how_net_capital_theory_could_predict_when_moass/",
    "score": 960,
    "selftext": "Hello apes. This is my first post within Superstonk after joining the apes in mid April. Just like everyone else, I am not a financial advisor and this is not financial advice. I'm just a guy that likes the stock.\n\n**TLDR: The Net Capital Rule states that after T+7,14,21,28 days a percentage of your shorts (25,50,75,100 respectively) must be included in your net capital equation. We currently follow a T+21 cycle, indicating HFs can cover 75% of their shorts without going net negative. As HFs begin to lose money and have less capital, HFs may begin to follow T+14 and eventually T+7 cycles as they are only able to cover 50% and eventually 25% of their shorts (respectively) without going net negative. Thus, the T+X cycle we are in should be able to be used to predict the capital that HFs have.**\n\n**Preface**\n\nAs of now, I'm pretty sure everyone knows the user [u/criand](https://www.reddit.com/u/criand/) and I'm pretty sure everyone has been following his T+21 theory and how he has recently developed this into his [net capital theory.](https://www.reddit.com/r/Superstonk/comments/ny2ov4/a_revisit_to_net_capital_what_is_truly_driving/) Personally, I think this theory just fits a lot better and makes a lot more sense. However, today I was thinking about how this theory could be used to possibly identify when the end may be coming for HFs.\n\nIn the net capital rule it talks about how the market value of shorts will be added into the net capital equation incrementally (25%, 50%, 75%, 100%) based on how many trading days (7,14,21,28) since their discovery (FTD). Currently, we seem to be following a T+21 cycle which makes a lot of people think that Citadel (and other market makers) are able to cover 75% of their short position without being margin called (as a market maker, Citadel must be net positive). Due to this T+21 cycle, it seems that right now HFs are not able to allow the short position to get to 100% otherwise they will be margin called.\n\n**My Theory: The Net Capital Theory Should be able to predict when the end is near**\n\nHere is my theory: as time goes by the HFs will slowly drain their capital supply. We all talk about how much it must cost for these HFs to keep kicking the can down the road and that eventually they will run out of money, get margin called, the MOASS will happen, and we will all get our tendies. But, if the net capital theory is true, we should be able to use it as a way to roughly estimate HFs capital.\n\nFor example, as time goes by lets say the HFs are beginning to run lower on capital compared to their current position. They can only afford for the shorts to have 50% of their market value (T+14) included in their net capital equation in order to remain net positive and not be margin called. Thus, it is possible they have to start covering every T+14 which would then, at least temporarily, switch us from a T+21 cycle to a T+14 cycle. (Personally, I think if this were the case the jumps in price on T+14 would not be as large as the jumps from T+21 cycles, but with no data regarding this it is impossible to know.) Continuing, as the HFs continue to run out of capital even more, they will only be able to cover 25% of the value of the shorts, and thus we will move to a T+7 cycle. From then I think the rest is pretty clear: They run in a T+7 cycle until their capital runs dry and they go net negative, get margin called, and are forced to cover, lose their market maker privileges, and simply cease to exist.\n\nBasically, if the net capital theory is correct, as the HFs lose capital over time they shouldn't be able to afford as much of a position on their shorts, will have to cover sooner, and we could see the T+21 cycle switch to a T+14 cycle, and eventually a T+7 cycle until their inevitable demise.\n\n**When I think we could see this happen**\n\nPersonally, with the help of some fellow apes, we think it is likely we could begin to see a cycle shift in mid to late July (Not saying this is when it will happen; a specific date is impossible to know. However, this seems like it could be a likely time period). There are a few reasons for this. First off is the upcoming end to a T+21 cycle scheduled to end on June 24th. We all know the effect this has on the price. Next is GME changing indexes from the Russel 2000 into the Russel 1000. Nobody really knows how this will affect price, but there are speculations which point to it rising the price. Continuing, on June 21st DTC 002 goes into affect (T+2 days to fix margin calls turns into T+1 hour).\n\nThree other quick points that can be better explained with pictures that help point to Mid-Late July:\n\n1. 400k PUTS expire on July 16\n\n[More shares expire July 16 than the entire float. Little sus if you ask me](https://preview.redd.it/5ql1v5b83j571.jpg?width=1170&format=pjpg&auto=webp&s=24546c2c6966293515d2a3393c54eef8319f08b6)\n\n2. Reverse Repos and end of quarter (Do not fully understand this yet but other apes believe it could have a significant affect on price and thus my theory so I wanted to include it)\n\n[From my understanding reverse repos are basically a way for banks to avoid being margin called by lowering their liabilities and raising their assets by \\*trading\\* with the FED. Apparently this makes price spikes. Some good DDs about reverse repos.](https://preview.redd.it/2km3gumc3j571.jpg?width=1170&format=pjpg&auto=webp&s=c5b55e9dc50a1cf95a0bdb71d4aeef4b6a5d0e42)\n\n3. Exponential floor is set to hit $350 by July 14th. We have all seen how quickly the price is plummeted once hitting $350 in the past, but with the floor consistently at this level it could be a quick end for the HFs. Credit to [u/jth1](https://www.reddit.com/u/jth1/) for the chart. It's incredible.\n\n[Yes, I know we have dipped below the floor for the first time, but me as well as many other apes believe this is due to the 5M share offering, and we should be back to normally following the floor by around June 24th.](https://preview.redd.it/n3i2tgli3j571.jpg?width=1170&format=pjpg&auto=webp&s=ce6ced294be471fbdf51ed9afdb63eae02ef0ddc)\n\n**Conclusion**\n\nPersonally, I think if we see that the [u/criand](https://www.reddit.com/u/criand/) net capital theory is correct, I think that this is a pretty good way to get an idea of when the end may be near. I would love for as much information on this to be shared as possible and I would love for people to share their opinions below. Sorry for the absolutely disgustingly boring writing style, I've only ever written things for school and it has destroyed my creative writing abilities.\n\nStay strong, BUY and HODL.\n\n&#x200B;\n\nEDIT: Changed \"army\" to \"apes\" in introduction. Thanks for pointing that out.",
    "title": "How Net Capital Theory could predict when MOASS is Closing In",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0tgka/how_net_capital_theory_could_predict_when_moass/"
}