{
    "author": "Cdawg_DaBeast",
    "created_utc": 1619968415.0,
    "distinguished": null,
    "edited": false,
    "id": "n38d64",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n38d64",
    "num_comments": 150,
    "permalink": "/r/Superstonk/comments/n38d64/just_a_reminder_to_be_greedy_fucks_during_the/",
    "score": 4140,
    "selftext": "Think about who we are up against. These hedge fucks have been the embodiment of greed for YEARS. These assholes have been manipulating the market for so long just so they can get more money in their pockets for their next vacation home or new expensive car.\n\nRadio Shack? Toys R Us? Just two examples of the absolute selfishness of these fucking degenerates. Money has transformed these guys into the selfish, egotistical narcissists that they are. Because of them, our kids aren’t able to experience some of the businesses and experiences that we had and cherish for our life. GameStop was the last straw, they FUCKED UP trying to take that one out. I remember going to GameStop and waiting in line for the midnight release of the new CoD game. I remember when I’d go to the mall with my parents, I always wanted to go to GameStop and look at the games they had, maybe even buy one of their cheap used games that they provided. Oh, and not to mention the memes of “turning in a brand new PlayStation? I’ll give you $4 in-store credit and a bag of chips”. Even though it never made sense, you gotta admit it was pretty funny how it worked.\n\nAnd they tried to take that from me, from us as customers. Well tough fucking luck Ken and Friends, it’s not happening this time. \n\nOh, and I can’t forget to mention the 2008 financial crisis. Yeah, the one where multiple fucking people lost their homes? Their jobs? Fucking everything. How could we forget about that? Personally, I was lucky enough to be in a stable family to where this didn’t affect us as much, but I’m here to fight for the people who it did affect.\n\nDo you want to continue to work paycheck to paycheck while letting these slimy fucks use loopholes in the market to help fund their [next million dollar mansion?](https://www.google.com/amp/s/therealdeal.com/2020/08/27/ken-griffin-is-approaching-1b-in-worldwide-luxury-real-estate/amp/) What fucking use do you even have for multiple mansions?? Do you want to continue to slave away hours just to get by, while these fucksticks continue to make millions in illegal money? (well it fucking should be at least, but clearly we’ve learned the government’s in on it too)\n\nOr, do you want to wrap these guys up by the balls and **squeeze** so tight that they fucking explode? This is yours, and all other apes, opportunity to fight back at the corruption that has been going on right under our noses for years. These hedge fucks think that their better than us, simply because they’re fucking sociopaths and aren’t afraid to push the limits and do anything just to get a quick buck. As the “average person”, we have MORALS. We are good people.\n\nBut not now. They’ve pissed off the apes, and now they’re gonna see the aftermath. Give these cockbags a taste of their own medicine. Covering your initial investment? For these guys that’s the equivalent of giving you a fucking $5 bill and flipping the bird. These guys have money, and we have the choice to make them pay up. They HAVE to buy our shares at some point, there’s just no other way around it.\n\nSo be selfish. Be greedy. Understand that the money is coming from the fucking shit eating parasites that are these HFs. Don’t fucking settle. Whether you’re an X, XX, XXX, or XXXX ape, I know you want to be a fucking millionaire. For the XXX and XXXX apes, be even greedier than you think you should be. This will a) ensure that X and XX apes can also become multimillionaires and b) make you even richer than you could have ever imagined you’ve been. As an X ape, trust me, these shares aren’t going anywhere until I see a fair price ($100mil to start maybe?), but I will need the help of the mini-whales to ensure that I have this power.\n\nOnce you get the money, you can go back to having your morals again. Don’t forget where you started. Don’t let the money entrap you and make your life become the very thing you swore to destroy. You know why? Because the economy is going to be fucked once this all blows up. You’ve read the DD, you know the impending market crash, and how GME will be the lone survivor, the growing mountain surrounded by the valleys that grow deeper and deeper. So you will have your money, but many people will lose theirs. Understand one thing:\n\n**Whatever happens as a result of you buying and holding GME is not your fault. You’re simply a retail investor who liked the stock. It’s the HF’s fault for holding the US economy hostage simply because they’re finally losing at the game they’ve been playing for years.**\n\nRemember how I said to not forget where you came from? How you can go back to being humble once you have your money? Well, don’t just be humble. Give back!! Yes, you will pay a lot of money in taxes, but that money just goes to the US government in order to help rebuild the economy that these hedge fucks destroyed. After taxes though? Still give back! Help out the less fortunate. Help those who weren’t even a part of this shitty charade, but yet got hurt the most. Be a friendly ape!\n\nTL;DR: don’t give your shares up too easy. Be a greedy fuck, just like the ones you’re up against. Don’t settle for anything less than life changing money. And help rebuild the economy that the HFs destroyed once you get your tendies.\n\n**Not a financial advisor. This is not financial advice. I shat in my hand and threw it at the wall the other day, just to give you a taste of my intelligence. I like the stock**\n\n🚀🚀🚀🚀",
    "title": "Just a reminder to be greedy fucks during the MOASS. Don’t settle",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n38d64/just_a_reminder_to_be_greedy_fucks_during_the/"
}