{
    "author": "HealsOnWheals",
    "created_utc": 1625156655.0,
    "distinguished": null,
    "edited": 1625190277.0,
    "id": "obpcj6",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_obpcj6",
    "num_comments": 71,
    "permalink": "/r/Superstonk/comments/obpcj6/dividend_record_dates_are_10_days_not_business/",
    "score": 715,
    "selftext": "[Straight from sec.gov](https://www.sec.gov/rules/sro/nyseamer/2018/34-82864-ex5.pdf)  \nDirect: [https://www.sec.gov/rules/sro/nyseamer/2018/34-82864-ex5.pdf](https://www.sec.gov/rules/sro/nyseamer/2018/34-82864-ex5.pdf)\n\nRefer to section 501:\n\n>\tSec. 501. NOTICE OF DIVIDEND   \n>\t\n>\\[A company is required to publicize and notify the Exchange immediately of any action taken by it in respect to the payment or non-payment of dividends. The form of notice is described in §503 below.\\] Prompt notice must be given to the Exchange as to any dividend action or action relating to a stock distribution in respect of a listed stock (including the omission or postponement of a dividend action at the customary time as well as the declaration of a dividend). **Such notice is in addition to immediate publicity and should be given at least ten days in advance of the record date.** The dividend notice should be given to the Exchange in accordance with Section 405. Notice should be given as soon as possible after declaration. In the case of notices provided to the Exchange on or after April 1, 2018, such notice must be given to the Exchange no later than 10 minutes before the announcement to the news media (including when the notice is to be issued outside of Exchange trading hours). \n\n&#x200B;\n\nThis is in advance of the **RECORD DATE.** \n\n**TLDR; We dont do dates.** \n\n\n**Edit: I believe JuLy 4th it will be announced for July 14th as the record date for an nft dividend or a 7 4(for) 1 split or something. Or maybe we own the float 7 times and they will need to buy 7 phantom shares 4(for) 1 real share.**\n\n\n**Edit 2: Holy shit. Announce the 4th , record the 14th issued end of month. That aligns with the tweets timing! I’m guessing 7 coins per share you own. Thine tittith be jacktih.**",
    "title": "Dividend RECORD DATES are 10 DAYS not Business days.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/obpcj6/dividend_record_dates_are_10_days_not_business/"
}