{
    "author": "thatskindaneat",
    "created_utc": 1625176611.0,
    "distinguished": null,
    "edited": false,
    "id": "obw91a",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_obw91a",
    "num_comments": 161,
    "permalink": "/r/Superstonk/comments/obw91a/what_happens_on_716_when_30m_shares_of_married/",
    "score": 1503,
    "selftext": "Wondering if some smarter folks than myself can help provide some context. I haven’t seen this discussed and I think it aligns well to some of the 7/14 theories we’ve been seeing. \n\nAs far as I understand from what Wes, Dave, Dr. T etc. have said - a married put scheme to reduce SI% and kick the can down the road ends with both sides tearing up the contracts a few days before expiration. Today, and until they’re torn up, these contracts are essentially “promised” shares to cover shorts. \n\nOnce they’re torn up, does another round of contracts need to be purchased immediately? Do the uncovered shorts enter another T+ cycle? Can they pre buy contracts today and assign them to these shorts now? Or, with the new rules (I forget them all), is the can kicking ability halted? \n\nI guess what I’m trying to get to is this: I’ve been disappointed by every date so far, but I’m happy to get hype for 7/14 given the large number of coincidences we’re uncovering. If RC understands the married put scheme then he’d understand these contracts are torn up a few days before 7/16 expiration. If new rules, etc. prevent can kicking that means SHF’s are going to have to cover ~30M shares at some point. If you’re launching your company transforming blockchain the same time 30M shares need to cover that’d be a hell of a potential catalyst. \n\nAny thoughts/opinions/wrinkles are appreciated. RC would have had foresight after the Jan sneeze to see the SHF’s move and this could have always been his counter. The fact it’s Bastille Day could just be somewhat coincidental to the overall scheme, but now certainly important in terms of dropping hints.",
    "title": "What happens on 7/16 when ~30M shares of Married Puts expire worthless?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/obw91a/what_happens_on_716_when_30m_shares_of_married/"
}