{
    "author": "Icy-Paleontologist97",
    "created_utc": 1625176132.0,
    "distinguished": null,
    "edited": 1625176234.0,
    "id": "obw3jw",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_obw3jw",
    "num_comments": 216,
    "permalink": "/r/Superstonk/comments/obw3jw/why_shorting_rh_jeopardizes_your_gme_rocket_ticket/",
    "score": 2685,
    "selftext": "Listen up, apes. Right now you are winning. You are winning because you hold GME and because others like you hold GME, and NO ONE IS SELLING.\n\nThe shorts aren’t stupid. They have watched us here and on other platforms, they’ve hired the best consultants to analyze us, they’ve probably even run an informal focus group or two. And they have discovered that there is basically nothing they can do to get us to willingly sell our shares for anything under $69,420,000.\n\nSo they have very likely hatched a new plan, a trap for all those red blooded, justice seeking apes among us. They have devised a bear trap to entice us into shorting RH so that they can set up a temporary stock pump that will result in margin calls for anyone short RH.\n\nAnd remember 002? You will be margin called and fast. \n\nAnd if you are margin called and cannot post the liquidity needed, your broker WILL sell your GME shares.\n\nJust look at the news. MSM coverage of Vlad’s fuck ups is as refreshing as it is suspicious. Why is this happening?\n\nTo lure you into shorting RH and to force the sale of your priceless GME shares.\n\nThis is not financial advice. It’s only speculation. But my intuition is buzzing on this one: shorting RH is a trap designed to forcibly acquire our GME shares.\n\nThink twice before you do it.\n\nBuy GME. Hodl GME. And avoid exposing yourself to any risks that will curtail your GME investment before the MOASS.\n\nNot advice, just speculation.",
    "title": "Why shorting RH jeopardizes your GME rocket ticket",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/obw3jw/why_shorting_rh_jeopardizes_your_gme_rocket_ticket/"
}