{
    "author": "pinkcatsonacid",
    "created_utc": 1625170659.0,
    "distinguished": "moderator",
    "edited": false,
    "id": "obu8p4",
    "text_only": true,
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_obu8p4",
    "num_comments": 397,
    "permalink": "/r/Superstonk/comments/obu8p4/the_jungle_beat_thursday_07012021_important_sub/",
    "score": 3151,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/61hdn2cjnm871.png?width=1426&format=png&auto=webp&s=efe295194054a2e93d72b6f17cb25cbe548c3308\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎤🎸🥁 🦍Welcome to the Jungle🦍🥁🎸🎤\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Today's Recap 📈\n\n# $GME Closing Price: $204.36\n\n&#x200B;\n\nOpen Price: $213.40\n\nDaily High: $216.83\n\nDaily Low: $202.00\n\nVolume: 2.72 MM\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🖍🍎🚌GME 101🚌🍎🖍\n\n&#x200B;\n\n*If you're new to Superstonk, start here!*\n\n&#x200B;\n\n[Superstonk FAQ](https://www.reddit.com/r/Superstonk/wiki/index/faq#wiki_how_do_i.2C_as_a_retail_investor.2C_stand_a_chance_against_the_hedge_funds.3F) (Updates coming soon)\n\n[Superstonk Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\n**NEW!!** We will be having a \"Smooth Brain Sunday Megathread\" every Sunday as a place to ask all the questions you've been wanting to get answered! Please be advised that all answers provided are from individual users and, as always, any information you receive requires doing your own due diligence!!\n\nThe apes of [r/Superstonk](https://www.reddit.com/r/Superstonk/) sincerely appreciate the time and effort put into getting this information out there. 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# PSA- Stop and think before you click the link\n\n**Important announcement regarding 3rd party links like Google Drive**\n\n&#x200B;\n\n[Brent Rambo doesn't click random links. Be like Brent Rambo.](https://preview.redd.it/onjaw1iuhm871.jpg?width=799&format=pjpg&auto=webp&s=ee38ad0883932b9135d63846c759af174e8e8791)\n\nBeing a savvy ape means staying 10 steps ahead of anyone that may be coming at you to undermine you. We mods try to stay ahead of the curve on upcoming FUD trends and while it is exhausting to keep up with the ever-changing tactics, we have managed to curb the FUD as it rushes in. But there's a new phishy tactic in town that has me on high alert. \n\n&#x200B;\n\n**Google drive links that are always purported to have enticing, must-read DD, which is usually deleted or somehow missing.** \n\n&#x200B;\n\n**This has been a FUD tactic used and abused by known shills since January.**\n\n&#x200B;\n\nThese links that lead to websites like google docs or sheets, **DOXXES YOU TO THE AUTHOR WHEN YOU CLICK IT**. As soon as you click that link, you are viewing the document under whatever google account you have logged in to that device. And the author can see every google email and account name that has interacted with that document. This is a common phishing tactic used by those wishing to collect email addresses for the purpose of spamming. \n\n&#x200B;\n\n*Note that opening these links in incognito mode will prevent the phishing from being successful, as you will not be signed in.*\n\n&#x200B;\n\nHere are a couple of instances (though slightly different situations) where google docs were used in a phishing attempt:\n\n* [Google Docs spam attack: If you’ve already clicked the link, here’s what to do](https://tech.hindustantimes.com/tech/news/google-docs-email-spam-attack-here-is-what-to-do-if-you-already-clicked-the-link-story-osCiPfMi7GxcvkbwQ7BFoK.html)\n* [A new scam uses Google Drive to send out a deluge of dodgy links](https://www.wired.co.uk/article/google-drive-spam-comments-phishing)\n\n&#x200B;\n\n I realize these situations aren't exactly similar in their avenue of gaining your attention. *But that's the beauty of Superstonk.* We have half a million apes with an insatiable craving for earth-shattering DD. Can't miss DD. If you say you've got a link to something like that, **you're going to get a lot of mindless clicks, especially from newer apes trying to catch up on the DD.** \n\n&#x200B;\n\nI've been sus of this practice of linking google drive for a while, but realize the importance of having backups in case things on this website go south, as we've been seeing more of lately. But the mod team has decided to enforce a temporary ban on google drive links and will be removing them anywhere we see them. More permanent rules regarding third party links are being discussed as we speak to protect the sub, and a \"trusted list\" will be created for reference. Once a rule is in place, certain 3rd party site links will be permanently banned from Superstonk, including google drive and linked in. \n\n&#x200B;\n\nPlease just stay extra vigilant as we become a bigger and more popular mainstream target. Most of us here hold very valuable stock in our trade accounts, that to some people, are arguably worth more than the ticker reflects. We know it. They know it. They know, we know it. Never EVER let down your guard.\n\n&#x200B;\n\n**Apes are stronger and smarter together. 🦍🤝💪**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# It's official- Half a million members reached 06-30-2021!!!\n\nCongratulations, Superstonk!!! \n\n^(to celebrate, you have been delisted from the subreddit directory lmayo)\n\n[started from the bottom now we here](https://preview.redd.it/nh6xrsg0xm871.jpg?width=1080&format=pjpg&auto=webp&s=3363bf54890a18a5e3f46bfda025dbd4f756c52e)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Sub Wellness Update 🩺\n\n[Link to the post here](https://www.reddit.com/r/Superstonk/comments/obei9c/superstonk_wellness_update_and_new_mods/) from u/redchessqueen99\n\n&#x200B;\n\n **Superstonk Growth Plan**\n\n&#x200B;\n\n[From baby apes to grown baby apes.](https://preview.redd.it/eigjldofom871.png?width=1200&format=png&auto=webp&s=c4b8191477125039ea5c6718c8eceb412c38ee02)\n\nWith this natural and impressive growth, the mod team has been putting together plans for expansion. We have modified our structure of mod hierarchy, and organized our team in a way that truly is comforting to all of us. We no longer fret over the psychological issues of compromised mods or bad actors, and honestly I must say this is the best team I have ever been a part of. I see nothing but great things in our future.\n\nThat said, we have become mildly fatigued over the sheer growth and intensity of the past few months. Mods are people too, and have IRL situations that need tending to, and ultimately we are not superhuman. Additionally, we have lost a few mods, most recently [u/HeyItsPixeL](https://www.reddit.com/u/HeyItsPixeL/), due to IRL workload constraints, and, while are sad to see him go, we were so happy to have him along for the ride to this point.\n\nMoving forward, we will be making regular additions to the mod team. Previously, we had waited for growing pains before beginning the process of adding new mods, usually 2-3 at a time, but now we are making a dedicated effort to scaling indefinitely so as to properly moderate the sub and ensure that [r/Superstonk](https://www.reddit.com/r/Superstonk/) has a long future on reddit.\n\nWe are planning to add 2-3 mods on a regular basis to ensure proper management of the mod queue and mod mail, among other more advanced responsibilities. This method, coupled with a mod training guide that we have put together, and a structured discord for moderator communication and organization, should allow us to quickly onboard, train, and implement new mods.\n\n&#x200B;\n\n**Welcome our new Moderators!**\n\n&#x200B;\n\n[Get into the mod team, you damn dirty apes!](https://preview.redd.it/vua7qkfjom871.png?width=726&format=png&auto=webp&s=f554e58ecf54ccf327cc2d4253425ac8c53abd9c)\n\nThis week, we are adding FOUR new moderators. They are already in the mod chat and meshing well with the whole team. Please give them all a warm welcome:\n\n* [u/broccaaa](https://www.reddit.com/u/broccaaa/) \\- This user is very helpful, and has a large knowledge base surrounding FTD cycles and more. He also has many connections in the DD circles that will be very helpful to the mod team. We are confident he will make a solid addition to the sub as a whole.\n* [u/stonk\\_sandwich](https://www.reddit.com/u/stonk_sandwich/) \\- From sending headbands to apes to attending the shareholder meeting in person, this user is an active, kind, and smart ape who will be focused on community engagement. We are already very impressed with their involvement in the team, and have high hopes.\n* u/ [badtothebone](https://www.reddit.com/user/_badtothebone_) \\- This user is someone that [u/rensole](https://www.reddit.com/u/rensole/) and myself ( [u/redchessqueen99](https://www.reddit.com/u/redchessqueen99/) ) have moderated alongside before, and we have decided to welcome him into the fold of the [r/Superstonk](https://www.reddit.com/r/Superstonk/) mod team. He has proven to be a reliable mod who prioritizes team work and loves this community, so we have very positive experiences and are excited to work with him again.\n* [u/hey\\_madie](https://www.reddit.com/u/hey_madie/) \\- This user has been fostering an impressive and positive image across the community, and has established herself as intelligent, resourceful, and reliable to not only the mod team, but respected circles of DD authors and technical analysts. We have no doubt that she will elevate the mod team to a whole new level, and are very excited to have her on the team. Also, she is basically the Queen of Quant.\n\nI am superstonkin' excited to have these four aboard, and I am very excited to see how they mesh with the team and progress the sub as a whole. Welcome, new mods!\n\n&#x200B;\n\n**Superstonk's Future**\n\n&#x200B;\n\nhttps://preview.redd.it/jq9lqhrlom871.png?width=1280&format=png&auto=webp&s=5b38074387ff14b1ac30937a0c813f80e809f736\n\nAPE 2.0\n\nI know there has been a lot of concern around the recent communication we received from reddit admins regarding [**issues of brigading**](https://www.reddit.com/r/Superstonk/comments/o80eky/no_brigading/), where apes are pushing GameStop and Superstonk onto other subs, as well as referencing them in negative light on this sub overall. Therefore, we have made several changes to the automod code, as well as a required change added by reddit admins, to prevent the discussion of certain terms and references to other subreddits. Please honor these constraints, and help us keep the sub going strong.\n\nWe realize this is frustrating, as many of us are used to collaborating with other GME-specific subs, and please know that I am working to clarify the specifics of this situation, and am working to try and recover crossposting and sharing of content with GME-specific subreddits. I am also on good terms with their moderators, and hope to reach out shortly, once I receive clarification from reddit admins, to foster a healthy relationship between our subs.\n\nAlso, a lot of people are talking about backup plans, and another migration, so let me say this. I am not going anywhere. I am extremely proud of what we've created here at [r/Superstonk](https://www.reddit.com/r/Superstonk/), and I am going to fight to the end to keep it healthy and strong, and active. We are going to do everything in our power to comply with reddit admins and reddit policy, so that this sub can live a long and healthy life.\n\nSo, please do your best to behave, to be civil, to be polite, and to be conscientious of these issues and policies, so that we can prevent further mishaps. I know there is a lot of animosity due to past grievances, but I am hoping we can start a new chapter with our 500k milestone, and take some proud steps into the future.\n\n&#x200B;\n\n**Re: Knights of New**\n\n&#x200B;\n\n[Is this ape? Or shill in ape suit?](https://preview.redd.it/o3c7p2eoom871.png?width=1000&format=png&auto=webp&s=656548ffb8981604fdfbbeb76792d63c04df0640)\n\nThis group has popped up over the past month or so, and aims to \"police\" the New sorted [r/Superstonk](https://www.reddit.com/r/Superstonk/) feed, and intentionally downvotes posts that violate our sub's rules and general content quality, and upvotes those that they deem to be quality content. While at first, this idea seemed fun and a good idea, as apes voting for good content and downvoting bad content has always been a staple of the success of the sub, we now are seeing some aspects that are problematic.\n\nThis could be construed as organized vote manipulation, as well as generally being unregulated and outside of the moderator's jurisdiction. As many of you may or may not know, the moderators can ban users and remove comments, but cannot control who votes on posts. We cannot see who votes, nor can we stop organized vote manipulation on this level. Even banned users can vote, and that is something I truly need to underscore. This has been a long time problem by bad actors and shills, and now it poses to be a real problem with the Knights of New, since they are primarily self-appointed and could easily be infiltrated or impersonated by bad actors. This would be very bad for the sub as a whole, and terrible for anyone who is identifying as a Knight of New.\n\nI urge you to please report users who are pushing any vote manipulation, and please bring it to our attention if you discover organized efforts in off-reddit mediums such as Discord and Twitter. We like the idea, but cannot support the execution and nature of the Knights of New. Therefore, we are detaching ourselves entirely from the concept as mods. Thank you for understanding.\n\nIf you ever received Knights of New flair, and would like to change it, mods will be happy to adjust, but since we can be rather busy, you can always comment !buckleup! to replace your current flair!\n\n&#x200B;\n\n**Community Awards Design Contest Update**\n\n&#x200B;\n\nThis is a really quick update. TLDR: We have been very busy with the anti-brigading issues of the sub, and [this contest](https://www.reddit.com/r/Superstonk/comments/o178u3/official_superstonk_community_awards_design/) has been delayed. However, we have received over 150 submissions, and plan to put the bracket together soon, but I am prioritizing these other important matters before this contest. I am hoping we can kick it off next week. Thank you for understanding.\n\n&#x200B;\n\nhttps://preview.redd.it/589414i1pm871.png?width=300&format=png&auto=webp&s=f9f98627daace4aaec4e8bd2d0e2174749691e58\n\n**The Future of YouTube Channel**\n\n&#x200B;\n\nMany of you were disappointed in one or two of our previous streams. We heard you and made serious changes. We are very proud of our new Monkey Business segment, which features local apes such as yourselves, and we have some exciting AMA guests we hope to bring on soon. However, we are prioritizing the moderating necessities of the subreddit itself, and hope to continue these side projects when we have the capacity.\n\nOnward, and Upward 🚀\n\n&#x200B;\n\n[Moass Effect: Legendary Edition](https://preview.redd.it/dt2eo2d3pm871.png?width=728&format=png&auto=webp&s=16ca282866e208fc2115937afc6e5c086ca9ac2a)\n\n&#x200B;\n\nI want to again thank each and every one of you for your dedicated support and activity in [r/Superstonk](https://www.reddit.com/r/Superstonk/). We truly have grown at an incredible rate, and I can only remain excited for the future, despite some of the obstacles we've faced. It's been one crazy ride, and I hope this ride continues until we find ourselves past the moon, past Andromeda, and onward. TO THE MOON 🚀🚀🚀\n\n&#x200B;\n\nBack to u/pinkcatsonacid 🐈🦄\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Feds are snooping through Vlad's Phone 👀\n\n# \n\nhttps://preview.redd.it/gypuavbhqn871.png?width=1079&format=png&auto=webp&s=fe4550e47219f2687e474dcd895495d5a9d4c7ef\n\nState Attorney General, SEC, And the US Dept. of Justice have seized his cell phone and are currently investigating Vlad Tenev. This is interesting because not only are they investigating the Robinhood buy button removal, this discovery period is giving us a glimpse into the agencies involved in the overall Gamestop investigation on a Federal level. \n\n&#x200B;\n\n[**You can read more here.**](https://www.businessinsider.com/robinhood-ceo-cell-phone-search-warrant-ipo-filing-vlad-tenev-2021-7)  \n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# \n\n# New \"Wut Doing?\" high score\n\n&#x200B;\n\n **Goldman Sachs, June 30 2021, 10:30PM** \n\n[ credit u\\/Sock\\_floaties](https://preview.redd.it/09vvrqi65m871.png?width=640&format=png&auto=webp&s=54f48e60db81c3af23ddb872e6e17948a797595d)\n\n&#x200B;\n\nThis one definitely wins the buildings with lights on high score!\n\n&#x200B;\n\nNow, Goldman Sachs is likely all lit up because of the end of the quarter on RRPs and probably has something to do with the record highs we have been seeing, but who knows. \n\n&#x200B;\n\nAll I know is, that's a lot of lights, and presumably a lot of employees working late under those lights. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Mainstream Media (NY Post) is now reporting how fukt Citadel is- and in particular, Ken Griffin\n\n👽Great Big Fat Opinion Flair👽\n\n&#x200B;\n\n*Ok I've edited the photo to abide by the guidelines of the sub- no politics, which includes mentions of particular president's name. I've removed content for this before, so it's only fair to set a good example. And normally I wouldn't even bother to share something if it requires this level of editing to fit the rules. But this merits the effort and exception.* \n\n&#x200B;\n\n[New York Post article from 06-30-2021](https://preview.redd.it/7sip637evm871.jpg?width=270&format=pjpg&auto=webp&s=244de6c00322d595105dd2e5aa9ca0daa39f90c3)\n\nNow, the big story here, to me, isn't exactly the executive order, although that could be dope af and could possibly toast the hedgies into oblivion. Who knows, I haven't looked into it.\n\n&#x200B;\n\nThe story here, is the way the story itself is written. \n\n&#x200B;\n\nHow many \"Wall Street Titans\" are there? How many big Wall St. businesses? \n\n&#x200B;\n\nWhy did the Mainstream Media decide that Ken Griffin was going to be the face and name used as an example in a story about the President taking down Wall Street? I mean, there are presumably hundreds or thousands of prominent professionals within the industry. But they chose Ken and Citadel. Is it because their crimes are a hot topic of discussion in MSM? /s\n\n&#x200B;\n\nI think there are rumors spreading in high places... of Kenny and co's demise. \n\n&#x200B;\n\nMedia's number 1 job is to curate a narrative. We all know that. And it seems to me that they are curating a new narrative to help paint a picture as big \"Wall Street Titans\" begin to fall from their rehypothecated throne in the impending market crash. Buckle up for liftoff. 🚀🚀🚀🚀\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# We Like the Company! We Support the Company!\n\n&#x200B;\n\nObviously you're a shareholder because you love Gamestop and have high hopes for its future. Supporting the company you love on the retail front is a great way for a shareholder to ensure a business' success! Here are several ways you can show your public support for Gamestop;\n\n* [**Shop at Gamestop.com**](https://www.gamestop.com/)\n* [**Become a PowerUp Rewards Member**](https://www.gamestop.com/poweruprewards/)\n* [**... Which gets you a subscription to Game Informer Magazine**](https://www.gameinformer.com/)\n* [**Follow Gamestop on Twitter**](https://twitter.com/GameStop)\n* [**Subscribe to Gamestop's YouTube Channel**](https://www.youtube.com/user/gamestopvideo)\n* [**Follow Gamestop on Twitch**](https://www.twitch.tv/gamestop)\n* [**Follow Gamestop on Instagram**](https://www.instagram.com/gamestop/?hl=en)\n* [**Follow Gamestop on Facebook**](https://www.facebook.com/GameStop)\n* [**Apple Devices- Download the Gamestop App**](https://apps.apple.com/us/app/gamestop/id406033647) **(Link to App Store)**\n* [**Android Devices- Download the Gamestop App**](https://play.google.com/store/apps/details?id=com.gamestop.powerup) **(Link to Play Shop)**\n* **Brands owned by Gamestop; ThinkGeek, GameInformer,** [**MicroMania**](https://www.micromania.fr/)**, and** [**EB Games**](https://www.ebgames.ca/)\n* [**Gamestop Ireland**](https://www.gamestop.ie/)**,**  [**Gamestop Germany**](https://www.gamestop.de/)\n\nPlease remember apes, as you are interacting with Gamestop Social Media, that their objective is to reach gamers and promote their brand to their demographic. Yes it's fun when they tweet MOASS and Chickie Tendies, but let's not flood them with comments about Ken, Naked Short Selling, and Mayonnaise. Let's show them support by joining, contributing to, and expanding their robust community of gamers!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🚨 Reddit down 🚨\n\n# With Reddit having issues during high traffic, exciting moments in this saga, we have discussed what to do if Reddit has an outage.\n\n**IF REDDIT GOES DOWN AT A PIVOTAL MOMENT A LARGE PORTION OF THE MOD TEAM IS ON TWITTER.**\n\n[https://twitter.com/ByeTriangle](https://twitter.com/ByeTriangle)\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/u\\_sharkbaitlol](https://twitter.com/u_sharkbaitlol)\n\n[https://twitter.com/BradduckF](https://twitter.com/BradduckF)\n\n**IF THERE IS SOMETHING BIG GOING ON WHILE THE OUTAGE IS HAPPENING WE MAY ALSO UTILIZE THE \"EMERGENCY BROADCAST SYSTEM\" TO RELAY INFO:**\n\n[SuperstonkLive YouTube - Emergency Broadcast System](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***OOK OOK***\n\n***\"I may have been early, but I am not wrong\"***\n\n&#x200B;\n\nhttps://preview.redd.it/17tme4z2mm871.png?width=1600&format=png&auto=webp&s=0d171416de9d477007c2c23399db7978bf209517",
    "title": "The Jungle Beat- Thursday 07-01-2021- Important Sub Wellness, Knights of New, & Security Updates! 🩺🦍💪",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/obu8p4/the_jungle_beat_thursday_07012021_important_sub/"
}