{
    "author": "djk934",
    "created_utc": 1619713334.0,
    "distinguished": null,
    "edited": 1619720159.0,
    "id": "n181a4",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n181a4",
    "num_comments": 88,
    "permalink": "/r/Superstonk/comments/n181a4/its_not_about_a_margin_call_its_about_failing_a/",
    "score": 2232,
    "selftext": "I've seen a few posts about this the past couple of days and just wanted to clarify things. If you've played around with margin accounts before, you might've experienced the problems that can emerge from being margin called yourself. You have a certain time period to meet a new requirement for cash on hand or the brokerage liquidates your position even if it makes you lose money.\n\nWhat I'm saying is, the MOASS doesn't start just because a firm gets margin called. For all apes know there could have been multiple margin calls already, but they haven't failed them, YET.  \n\n**It starts when a firm FAILS a margin call.** \n\nIt starts when they can't meet the new margin deposit requirement, either because the stock price of GME increases (which decreases the size of their existing deposit as a percentage) or they can't raise enough cash in time by selling other holdings. Once ONE SINGLE FIRM FAILS, the dominoes will start to fall because at that point the DTCC will start to liquidate positions which will **trigger a chain reaction driving the price upwards like you've never seen**. The first one to be liquidated will be at the cheapest price.\n\nThe DTCC holds margin deposits for its Participants. But these are mostly U.S Treasury Securities or U.S Debt Securities. They also hold some Cash in Money Market Funds as margin. They don't really fluctuate in value once they are deposited.\n\n[From their Annual Report.](https://imgur.com/a/Lv3hHN1)\n\nSo either GME increases and they need to add more dollars OR margin requirements change (new rules on the horizon) and they need to liquidate other positions to add more dollars. If they can meet the new requirement by adding more dollars, it's business as usual. BUT IF THEY CAN'T..... 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nIt's just a matter of time before they won't be able to meet those requirements. GME ain't going bankrupt anymore and the margin requirements are being adjusted. All apes need to do is wait as the interest continues to bleed them dry. Buy and HODL. Not financial advice.\n\nEDIT: Clarified a line.\nEDIT 2: Removed an accidental use of \"we\" - this is individual apes knowing stuff, yo!",
    "title": "It's not about a margin call, it's about FAILING a margin call.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n181a4/its_not_about_a_margin_call_its_about_failing_a/"
}