{
    "author": "suNN361",
    "created_utc": 1623450011.0,
    "distinguished": null,
    "edited": 1623450686.0,
    "id": "nxru5g",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nxru5g",
    "num_comments": 35,
    "permalink": "/r/Superstonk/comments/nxru5g/lawsuit_against_apex_clearing_many_brokers_were/",
    "score": 1021,
    "selftext": "1. All credit goes to [Tom Nash](https://www.youtube.com/channel/UCJwKCyEIFHwUOPQQ-4kC1Zw) promoting this in his [video](https://www.youtube.com/watch?v=dvqRKVTjbHc).\n2. If this has been covert before I'm sorry - I was trying to find if anyone has posted this before, but  I simply couldn't find it.\n\nHey everyone,\n\nso I stumbled over the above video where Tom Nash goes through a lawsuit that was filed against Apex Clearing Corporation in which Brokers (like WeBull) accuse Apex of forcing them to restrict buy orders for their customers due to lack of resources. However, Apex had the sufficient resources to meet collateral requirements set by the NSCC as per investigations from the lawsuit.\n\nSo when most people got mad at their brokers for not accepting buy orders but selling, this was most likely not the brokers decision.\n\nThis means, that removing buy options for customers over these brokers connected to Apex was most likely in Apex self-interest and that clearing houses like them actually play a bigger role in the manipulation than the brokers themselves.\n\nSo basically they wanted to save money by manipulating the market through brokers and their customers. It is just adding to the overall picture we are seeing over the last months on how greedy this whole garbage system is and how blatantly illegal they all act.\n\nThis is probably of little use for the weeks and months to come but maybe some of you find it informing.\n\nAlso: Hedgies R fuk - have a good weekend everyone. Tits jacked and buckle up!\n\n**TL; DR:** Read the title and watch the video.",
    "title": "Lawsuit against Apex Clearing - many brokers were probably forced to stop buy orders from customers on 28th of Jan (for GME and other highly shorted stocks) though they had sufficient resources to meet collateral requirements by the NSCC",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxru5g/lawsuit_against_apex_clearing_many_brokers_were/"
}