{
    "author": "jimmijoness",
    "created_utc": 1622807799.0,
    "distinguished": null,
    "edited": false,
    "id": "ns3cbh",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ns3cbh",
    "num_comments": 75,
    "permalink": "/r/Superstonk/comments/ns3cbh/a_house_of_cards_part_2_translated_to_danishdansk/",
    "score": 1679,
    "selftext": "  \n\n**House of Cards - Del 2**\n\n**Af** [**u/atobitt**](http://reddit.com/u/atobitt) **– Oversat af** [**u/jimmijoness**](https://www.reddit.com/user/jimmijoness)\n\n**ENJOY**\n\n***Forudgående DD/Analyser:***\n\n1. [Citadel Has No ](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/GME/comments/m4c0p4/citadel_has_no_clothes/)Clothes - ENGELSK  \n[Citadel Has No Clothes - DANSK](https://www.reddit.com/r/Superstonk/comments/nq3252/citadel_has_no_clothes_translated_to_danishdansk/)\n\n2. [The Everything ](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/GME/comments/mgucv2/the_everything_short/)Short - ENGELSK  \n[The Everything Short - DANSK](https://www.reddit.com/r/Superstonk/comments/nq3mxd/the_everything_short_dansk/)\n\n3. [A House Of Cards - Del 1](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/) \\- ENGELSK  \n[A House Of Cards - Del 1 - DANSK](https://www.reddit.com/r/Superstonk/comments/nq4abn/a_house_of_cards_dansk/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**TL; DR (opsummering af indhold) – Der er ikke nogen måde at opsummere det her på.**\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**1. Pilot**\n\nJeg kiggede faktisk slet ikke på GameStop, da alt det her begyndte. Det meste af min tid blev brugt på at undersøge pandemiens indvirkning på økonomien. Jeg taler om den økonomiske damp maskine, der beskæftiger mennesker og putter mad på bordet. Især de små virksomheder, der gik nedenom og hjem på grund af COVID-lockdowns. Det var skræmmende, hvor hurtigt de måtte lukke dørene.\n\nJeg brugte dog meget tid på at se på virksomheder som mindede om GameStop. Brick-n-mortar forretninger var basalt set ved at løbe tør for ”mursten”. Helt ærligt så lignede GameStop utroligt meget den næste Blockbuster, og det virkede egentlig bare som et spørgsmål om tid, før de ville bukke under. Hvis ikke DFV havde ikke gjort sit hjemmearbejde, er det muligt, at vi slet ikke havde en raket at holde fast i eller en historie at fortælle.\n\nHvem end, der har/havde en short position i GameStop, tænkte de med stor sandsynlighed det samme. Antallet af aktier, der kan handles frit på daglig basis, kaldes ”float”. GameStop har 70.000.000 udestående aktier, mens de 50.000.000 aktier repræsenterede GameStops ”float”. Med en lille ”float” som denne bliver en [short position på 20% pludselig betydelig](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://bullishbears.com/vw-short-squeeze/). Altså, Volkswagen blev squeezed med kun [12,8%](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://bullishbears.com/vw-short-squeeze/) short position. Så lad os bruge nogle små tal til at gennemgå et eksempel på, hvordan dette fungerer.\n\nAntag, at VW har 100 udestående aktier. Hvis 12,8% af selskabet er solgt short, skal det være muligt at købe 12,8 aktier (lad os bare sige 13) et senere tidspunkt (forudsat at VW ikke går konkurs). Imidlertid havde VW en float på 45%, hvilket betød, at der ikke var nogen reel udfordring med at dække den 12,8% store short position på noget som helst tidspunkt. Da Porsche først meddelte, at de ønskede at øge deres position i VW, investerede de efterfølgende TUNGT i VW.\n\n*”Kickstarteren var, at Porsche ejede 43% af VW-aktierne, 32% i optioner, og regeringen ejede 20,2%. I simple termer betød det, at det faktiske tilgængelige float gik fra 45% ned til 1% af de udestående aktier ”(Bullishbears.com/vw-short-squeeze/).*\n\nLad os se på vores scenarie igen. Med 100 udestående aktier og 13 aktier solgt short, hvad sker der så, hvis der pludselig kun er 1 aktie tilgængelig til at dække short positionen i stedet for 45?\n\nDET HER ER LIGE PRÆCIS, HVAD DER SKER:\n\n&#x200B;\n\nhttps://preview.redd.it/kzmv55mrl8371.jpg?width=348&format=pjpg&auto=webp&s=ee8984446618478f43a6c1d5775124b4991996c8\n\n[](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://preview.redd.it/c1n24ypq5k171.jpg?width%3D348%26format%3Dpjpg%26auto%3Dwebp%26s%3D2401d50c3ec1197e08564be1ffbd643558e52b6a)\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nGameStop er/var offer for short selling med det formål at presse prisen ned. Jeg diskuterede dette emne med [Dr. T](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.youtube.com/watch?v%3DfGVY2Kco8ng)rimbath og [Carl Hagberg](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.youtube.com/watch?v%3DKHnpPfWdf78) i [vores AMA'er.](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.youtube.com/watch?v%3DKHnpPfWdf78) Hver transaktion har to sider - en købs og en salgs side. Short selling øger *udbuddet* af aktier kunstigt og får prisen til at falde. Når dette sker, kan prisen kun stige, hvis *efterspørgslen* overstiger stigningen i udbuddet.\n\nJeg begyndte at kigge nøje på GameStop efter at have bekræftet deres rapporterede short position på [140%](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.reuters.com/article/us-retail-trading-congress-shorting/short-selling-under-spotlight-in-gamestop-hearing-idUSKBN2AJ026). Det er vigtigt for mig at forklare, hvorfor dette er så meget anderledes end VW-eksemplet ...\n\n140% af GameStops FLOAT blev solgt short. Der var 50.000.000 aktier i dette float, så 140% af dette svarer til de 70.000.000 aktier virksomheden har som udestående. Dette betyder, at mindst 100% af deres udestående aktier var/er solgt short. Sammenlign så dette med VW, hvor short position kun var på 12,8%. Kort sagt er det matematisk umuligt at dække mere end 100% af en virksomheds udestående aktier.\n\nToppen af VW squeezet blev nået, da efterspørgslen efter aktier blev overgået af udbuddet. Her repræsenterer efterspørgslen 12,8% af aktierne, som skal være tilgængelige for at kunne lukke short positionen. Med kun 1% af aktierne til rådighed garanterede dette et squeeze, indtil antallet af aktier, der var til rådighed i markedet, kunne tilfredsstille den resterende short interest.\n\nNår et selskab har en short position på mere end 100% af de samlede udestående aktier, kastes det foregående argument ud af vinduet. Udbuddet kan ikke overgå efterspørgslen, fordi virksomheden kun kan udstede 100% af sig selv til enhver tid. Derfor kunne de yderligere 40% kun forklares ved, at flere mennesker hævder at have ejerskab over den samme aktie. Det må helt sikkert være en fejl, ikke sandt? Jeg var overbevist om, at dette niveau af short selling var umuligt. Indtil jeg så antallet af overtrædelser relateret til short selling udstedt af FINRA.\n\nNår vi gennemgår disse FINRA-rapporter, er der et par ting vi skal huske på:\n\n1. **FINRA er ikke en del af regeringen.** FINRA er en nonprofit organisation med [regulerende beføjelser fastsat af kongressen](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.finra.org/about). Dette gør FINRA til den største selvregulerende organisation (SRO) i USA. SEC er ansvarlig for at fastsætte regler, der beskytter individuelle investorer; FINRA er ansvarlig for at føre tilsyn med de fleste af mæglerne (samlet benævnt medlemmer) i USA. Som SRO fastlægger FINRA de regler, som deres medlemmer skal overholde - **de er ikke direkte reguleret af SEC**\n\n2. FINRA efterforsker sager i deres eget tempo. Når man ser på \" *Date initiated\"* på deres rapporter, er det ikke synonym for \"*date of occurence\".* Mange gange vil FINRA ikke sige, hvornår et problem opstod, kun hvornår det blev løst. Det kan være ÅR efter den egentlige hændelse. [DTC deltager Rapporten](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.dtcc.com/-/media/Files/Downloads/client-center/DTC/alpha.pdf) er fyldt med sager, der blev indledt i 2019, men fandt sted i 2015, etc. Mange af de overtrædelser der sker i dag vil tage flere år at opdage.\n\n3. FINRA kan udstede en overtrædelse for hver hændelse ved at bruge et 1:1 format. Når det kommer til overtrædelser vedrørende short selling, kan disse \"hændelser\" dog vare ved over måneder eller endda år. Når dette sker, udsteder FINRA en overtrædelse for adskillige hændelser ved hjælp af formatet 1:MANGE. Jeg diskuterede lige præcis denne begivenhed i [Citadel Has No Clothes,](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/GME/comments/m4c0p4/citadel_has_no_clothes/) hvor en overtrædelse repræsenterede 4 ÅRS markedsmanipulation. Hvad der er endnu sjovere er, at FINRA ikke fortæller dig, hvilke type overtrædelser det er. Du skal læse hver linje og se, om de nævner et datointerval for hændelser inden for hver rapport. Hvis de ikke gør det, må du bare antage, at det var relateret til en begivenhed... BRUTALT.\n\n4. FINRAs investeringsportefølje ejes af de samme enheder, som de udsteder overtrædelser til. Lad lige det synke ind i et øjeblik!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n  \n\n**2. Hvad er argumentet?**\n\nKan du komme i tanke om en god grund til, at short sælgere ønsker at negligere deres short positioner? Sæt dig selv i deres sted og forestil dig at du driver en hedgefond...\n\nDu opererer i et selvreguleret (SRO) miljø, og dine regnskabsbøger er dybest set private. Hvis SEC beder dig om at komme med en forklaring ang. mistænkelig opførsel, er du i realiteten ikke nødsaget til at gøre det. Det værste, der kan ske, er et slag over fingrene. PRÆCIS denne del beskrev jeg også i [Citadel Has No Clothes](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/GME/comments/m4c0p4/citadel_has_no_clothes/). De modtog en ”cease-and-desist” ordre fra SEC den 12/10/2018 for manglende indrapportering af fyldestgørende og nøjagtige optegnelser. Dette stod på fra november 2012 til april 2016 og indeholdt mangelfuld information for over 80.000.000 handler. Deres straf - $ 3.500.000... Så hvorfor overhovedet opretholde en sandfærdig bogføring når du alligevel ikke behøver at føre et ærligt regnskab?\n\nAntag nu, at du shorter en masse aktier på markedet. Når du indrapporterer dette til FINRA, kræver de, at du markerer transaktionen med en indikator for short salg. Dermed bygger FINRA et papirspor over din short salg aktivitet.\n\nMen - hvis du udelader denne indikator, kan FINRA ikke skelne transaktionen fra et langt salg. Og hvem skal så holde dig ansvarlig for at dække din short position? Dette gør sig i særdeleshed gældende for selv-clearende organisationer som Citadel, fordi der er færre involverede parter, som holder dig ansvarlig for din bogføring. Hvis FINRA tror, at du fysisk ejede disse aktier og solgte dem (langt salg), har de ingen grund til at revidere denne transaktion i fremtiden. Du kan bogstaveligt talt proppe pengene i lommen og glemme alt om forpligtelsen om at lukke din position.\n\nEn anden meget vigtig fordel er, at det gør det muligt for short sælgere, at kunstigt øge udbuddet af aktier, mens de underdriver den egentlige udestående short interest for den givne sikkerhed. Udbuddet af aktier, der sælges, vil sænke prisen, mens short interesten forbliver den samme.\n\nSå bortset fra at betale en bøde, hvordan kan du så på nogen måder tabe noget ved at \"glemme\" at markere denne handel med en indikator for short salg? Det ser ud til, at systemet næsten tilskynder denne form for opførsel.\n\nJeg kæmede [DTC-deltagerrapporten](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.dtcc.com/-/media/Files/Downloads/client-center/DTC/alpha.pdf) igennem og fandt nok snavs til at udfylde den tomme kløft, i form af Ken Griffins sjæl. Gæt hvad deres mest almindelige short selling-overtrædelse er.. Jeg antager, at du sagde **“OVERTRÆDELSE I FORHOLD TIL KORREKT MARKERING AF SHORT SALGS TRANSAKTION”.**\n\nFor god ordens skyld vil jeg bare sige, at jeg råbte op om dette allerede i marts, da jeg skrev [Citadel Has No Clothes](https://dttjqdm3digs2mmkpc3i76d4m4-ac4c6men2g7xr2a-www-reddit-com.translate.goog/r/GME/comments/m4c0p4/citadel_has_no_clothes/). Citadel har en af ​​de højeste koncentrationer af short salg overtrædelser i deres FINRA-rapport. På daværende tidspunkt forstod jeg ikke konsekvenserne af denne overtrædelse fuldt ud.\n\nMen efter at have set, hvor mange deltagere der begik den samme overtrædelse, gav det endelig mening.\n\nDer fremgår cirka 240 deltagerkontonavne på DTC's liste. Jeg tager ikke pis på dig, jeg har tjekket enhver overtrædelse af short salg, der blev offentliggjort på [Brokercheck.finra.org](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://brokercheck.finra.org/). For at være fair udelod jeg deltagere med kun 1 eller 2 overtrædelser relateret til short selling. Der var masser af meget større fisk at gå efter.\n\nJeg valgte bogstaveligt talt den første deltager øverst på listen og fandt tre overtrædelser for short selling.\n\n[ABN AMRO Clearing Chicago LLC](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://files.brokercheck.finra.org/firm/firm_14020.pdf) (AACC) er den 3. største bank i Holland. De blev snuppet for tre short salg overtrædelser, hvoraf den ene omfattede en failure-to-deliver. I alt har de 78 overtrædelser fra FINRA. Flere af disse er alvorlige sammenlignet med deres short salg overtrædelser. Imidlertid afslørede ​​short salg overtrædelserne noget MEGET større:\n\n&#x200B;\n\nhttps://preview.redd.it/29t1n81xl8371.jpg?width=1055&format=pjpg&auto=webp&s=a6b54d40a3a66b9ed71f1c72c2087f966c315c72\n\nSå - ABN AMRO indrapporterede fejlagtig short interest position til NYSE og FINRA og manglede de rette tilsynssystemer til at overholde... praktisk talt alt...\n\nI 2014 betalte AMRO over $95.000 for at få lagt låg på og kom ikke engang, med så meget som et ”vi beklager”.\n\nI disse situationer er det let at tænke *\"bah, det kan jo have været en enkeltstående begivenhed\"* . Så jeg undersøgte det nærmere og fandt overtrædelser begået af de samme deltagere, hvilket gjorde det meget sværere at argumentere for deres sag om ren uagtsomhed. Her er et par til vedrørende AMRO:\n\n&#x200B;\n\nhttps://preview.redd.it/um0qzgczl8371.jpg?width=1079&format=pjpg&auto=webp&s=bccd1c528630be3fbd24f5f94d82d0249daf106a\n\nABN AMRO fik en bøde på $1.000.000 for at negligere kapital kravene, undlade at føre nøjagtig bogføring og manglende tilsyn med medarbejdere. Hvis du laver lort i den en gang eller to, men det hjælper med at løse problemet - PERFEKT. Når din primære forretning er at cleare handler, og du fejler SÅ miserabelt, er der tilsyneladende et meget større problem bag kulissen. Det bliver svært at forsvare dette som et uheld, når hvert trin i handelsregistreringsprocessen grundlæggende er mangelfuld. Følgende skærmbillede kommer fra selvsamme overtrædelse:\n\n&#x200B;\n\nhttps://preview.redd.it/2o58mz91m8371.jpg?width=733&format=pjpg&auto=webp&s=0dee4e79b661025ac95daf7bcaa5a2bb6561da90\n\n[Varehuskvitteringer](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.investopedia.com/terms/w/warehousereceipt.asp%23:~:text%3DA%2520warehouse%2520receipt%2520is%2520used,well%2520as%2520provide%2520inventory%2520management.) er som de kvitteringer, du får efter at have købt tømmer online. Dem kan du udskrive og tage med til Home-Depot, hvor du bytter dem til det FAKTISKE tømmer i butikken. I stedet for at handle de faktiske varer kan du i stedet handle med en varehuskvittering.. Så ja... Siden denne ene bogføringspost tillod AMRO at imødekomme deres kundes marginkrav, virker det EKSTREMT mistænkeligt, at de ikke slettede det korrekt, da de blev trukket tilbage.\n\nOm jeg tror, at det var et uheld? F\\*ndme nej. For FINRA indrapporterede dem 8 år senere for at gøre NØJAGTIG DEN SAMME F \\* CKING TING:\n\n&#x200B;\n\nhttps://preview.redd.it/c635ekr4m8371.jpg?width=1071&format=pjpg&auto=webp&s=c46d369c5a8a0fb726b699d0cc82ca4259ed34b4\n\nEndnu en gang blev AMRO taget i at negligere deres marginkrav. Sidste gang brugte de værdien af ​​tilbagetrukne varehuskvitteringer til at opfylde deres marginkrav. Her bruger de så bare værdipapirer, der ikke var berettigede til brug for margin, til at opfylde deres marginkrav...\n\nDu kan male et æble som en appelsin, men det vil altid være et æble.\n\nAlt det bullsh\\*t jeg har læst om i disse rapporter chokerer mig ikke engang længere. Jeg har det faktisk fuldstændig modsat. I og med at de sætter barren højere og højere for deres forseelser, skulle man tro, at bøderne blev større og større. Når jeg finder en sag som AMRO’s, lægger jeg som regel lidt mere tid i det, fordi visse forseelser repræsenterer ”brikker i puslespillet”. Langsomt som brikkerne samles, begynder man at kunne se det større billede. Så tro mig, når jeg siger, at jeg blev virkelig chokeret over den [detaljerede rapport](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.finra.org/sites/default/files/fda_documents/2016049875801%2520ABN%2520AMRO%2520Clearing%2520Chicago%2520LLC%2520CRD%252014020%2520AWC%2520va%2520%25282019-1572740384682%2529.pdf) ang. Den her sag.\n\n&#x200B;\n\nhttps://preview.redd.it/exxewn87m8371.jpg?width=844&format=pjpg&auto=webp&s=26db74017a40c2d7d9388f021a7fc1aaec1802ac\n\n**Dette har stået i 8 F\\*CKING ÅR!?**\n\nDet her er uden tvivl et godt eksempel på en overtrædelse, hvor forseelsen angiveligt blev *stoppet* i 2015, men det tog FINRA yderligere 4 år at offentliggøre rapporten. Hvis min hovedregning er korrekt, giver den relevante 8-årige periode, plus de 4 år som FINRA brugte... i alt 12 år. Med andre ord, med den tid det tog, fra problemet startede til det tidspunkt, hvor det blev offentliggjort af FINRA, ville børnene i 1. klasse have afsluttet gymnasiet.\n\nEr der nogen andre, der tænker at disse selvregulerende organisationer (SRO'er) gør et forfærdeligt stykke arbejde med at selvregulerer? Hvordan vi kan stole på, at tilfælde som dette bliver overvåget korrekt, hvis det tager 12 år før en sag ser overfladen?\n\nHov hov! Jeg var lige ved at glemme det her... Efter at have negligeret deres marginkrav på 22 konti i over 8 år, betalte ABN AMRO en bøde på $150.000 for at få lagt låg på sagen.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nJeg er godt klar over, at det var en ordenligt røvfuld information, så lad mig opsummere det for dig:\n\nEn af de mest almindelige citeringer for en forseelse er dem opstår, når et firma \"ved et uheld\" markerer et short salg som et langt salg, eller laver en fejlagtig indrapportering af short interest positioner til FINRA. Når der bliver gennemført et short salg, skal en sådan transaktion markeres med en indikator for short salg. På trods af dette gør mange deltagere det ikke for at undgå de låne krav, der er fastsat i SHO forordning. Hvis de markerer et short salg som et langt salg, ​​er de ikke forpligtet til at finde en aktie de kan låne, da FINRA ikke ved, at det er et short salg.\n\nDette er grunden til, at så mange af disse FINRA-overtrædelser inkluderer en erklæring om, at mægleren ikke kunne finde aktier at låne, samt den manglende markering af en short indikator på transaktionen. Det betyder bogstaveligt talt, at mægleren lavede naked short salg på en aktie men informerede samtidig FINRA om, at de fysisk ejede den pågældende aktie.\n\nPludselig havde en \"lille\" overtrædelse en meget større indvirkning. Andelen af shortede aktier, der er udelukket fra short interest beregningerne er direkte relateret til disse overtrædelser. Og der er HUNDREDVIS af dem. Hvem ved, hvor mange virksomheder der reelt set har underdrevet deres indrapporterede short interest positioner.\n\nFor at være helt klar i mæglet, valgte jeg dem IKKE baseret på mængden af ​​'snavs' de har lavet. AMRO's overtrædelser var som sandkorn på en strand, og det kræver unægteligt meget snavs at fylde det bundløse hul, vi også kalder Ken Griffins sjæl. Helt ærligt så ville selv ABN AMRO ikke kunne gøre det med 10.000 FINRA-overtrædelser. Med det sagt, let’s get dirty!.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**3. Udstil dem...**\n\nNår FINRA offentliggør en af ​​deres rapporter, udelades de mere specifikke detaljer, så som tal og datoer ofte. Dette gør det umuligt at afgøre, hvor systematisk den givne overtrædelser er.\n\nFor eksempel - Hvis du ved, at *\"XYZ ikke overholder FINRAs indrapporteringskrav om short interest\",* kan din eneste konklusion være, at forseelsen har fundet sted. Men hvis du ved, at *\"XYZ ikke overholdt FINRAs indrapporteringskrav ang. Short interest relateret til 15.000 transaktioner i løbet af 2020\"* , kan du begynde at undersøge omfanget af disse overtrædelser. Hvis XYZ gennemførte 100.000 transaktioner i 2020, betyder det, at 15% af deres transaktioner ikke levede op til kravene. Dette udgør en stor systematisk risiko for XYZ og de parter som de driver forretning med.\n\nJeg brugte noget tid på at analysere [Apex Clearing Corporation,](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://files.brokercheck.finra.org/firm/firm_13071.pdf) efter at jeg lod ABN AMRO ligge. Apex er nr. 8. på listen og den 2. deltager, jeg fandt med et åbenlyst short salg problem.\n\nI 2019 indledte FINRA en sag mod Apex for at have gjort det samme som ABN AMRO. Imidlertid satte størrelsen af ​​deres overtrædelse virkelig tingene i perspektiv: Jeg fik en lille forsmag på, hvor f\\*cked dette ”hus af kort” virkelig er.\n\n&#x200B;\n\nhttps://preview.redd.it/damqx2v9m8371.jpg?width=1076&format=pjpg&auto=webp&s=a80ed459aa3bcef8f033ed6da3567d7ebc3e583f\n\nDette er praktisk talt en skabelon over den første ABN AMRO-overtrædelse som vi gennemgik. For at se forskellen er vi nødt til at se på deres [letter of Acceptance, Waiver and Consent](https://www.finra.org/sites/default/files/fda_documents/2016049448301%20Apex%20Clearing%20Corporation%20CRD%2013071%20AWC%20va%20%282019-1573777189509%29.pdf) (AWC).\n\n&#x200B;\n\nhttps://preview.redd.it/7wittt5cm8371.jpg?width=938&format=pjpg&auto=webp&s=986c6811df630f796fb99aeda951b7fd7e38ad85\n\nLad os gennemgå det trin for trin!\n\nApex havde i 47 måneder et problem, hvor visse kunder registrerede deres short positioner på en konto, der IKKE blev indrapporteret til FINRA. Det kræver kun et par få hjerne rynker for at indse, at dette er problematisk. Stikprøve data fortæller os, hvor stort problemet er.\n\nNår du ser udtrykket \" *afviklingsdage/settlement days\",* så tænk \"[T + 2](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.schwab.com/resource-center/insights/content/stock-settlement-why-you-need-to-understand-t2-timeline%23:~:text%3Dthe%2520seller%27s%2520account.-,When%2520does%2520settlement%2520occur%253F,would%2520typically%2520settle%2520on%2520Wednesday.)\". Apex følger T+2-afviklingsperioden for både [kontantkonti og marginkonti,](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.apexclearing.com/wp-content/uploads/2020/01/Apex-Customer-Information-Brochure-2019.pdf) hvilket betyder, at handelen *skal* cleares 2 dage efter den oprindelige handelsdato. Når du køber aktier på en mandag, skal de afregnes senest onsdag.\n\nHurtig matematik...\n\nDer er cirka [252 handelsdage](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://therobusttrader.com/how-many-trading-days-are-there-in-a-year/) (I US) på et år når vi fjerner weekender og helligdage. I løbet af den 47 måneders “gennemgangsperiode” kan vi med sikkerhed antage, at **Apex havde omkring 987** ((252/12) \\* 47) **afregningsdatoer** ...\n\n**Med andre ord: 256 ikke rapporterede short positioner fordelt over 47 måneder er mere end 1 ”fejlrapport” om uge i næsten 4 år.** Fortæl mig igen, hvordan dette ikke kan være af betydning?\n\nFormuleringen i afsnittet \"afviklingsstikprøve/sample settlement\" er lidt tvetydig. Den præciserer ikke, om det var de eneste 2 afviklingsdatoer de tog stikprøver på, eller om det var de eneste afviklingsdatoer med nævneværdige problemer. Ærligt talt ville jeg blive chokeret, hvis det var sidstnævnte, fordi auditører generelt ikke undersøger samtlige bogføringer, men jeg kan ikke sige det med sikkerhed.\n\nUnder alle omstændigheder - FINRA opdagede 256 short interest positioner, bestående af 481.195 aktier, fejlagtigt blev ekskluderet fra deres short interest rapport. Derudover underdrev de antallet af aktier med 879.321 i 130 separate short interest positioner. Tilsammen udgør dette 1.360.516 aktier, der blev ekskluderet fra short interest beregningerne. Når man bliver klar over, at næsten 1,5 millioner 'ekskluderede' aktier blev opdaget på kun 2 afviklingsperioder og der næsten var 1.000 datoer at vælge imellem, udvider det seriøst ens fantasi...\n\nEndnu en gang gjorde FINRA rent bord for sølle $ 140.000...\n\nJeg vil gerne snakke om en sidste ting, inden vi springer til næste afsnit. Har du tilfældigvis bemærket de forskellige kontotyper, som Apex nævner i deres [letter of Acceptance, Waiver and Consent](https://www.finra.org/sites/default/files/fda_documents/2016049448301%20Apex%20Clearing%20Corporation%20CRD%2013071%20AWC%20va%20%282019-1573777189509%29.pdf)? De instruerede specifikt deres kunder i at bogføre short positioner på en TYPE 1 (CASH) konto eller TYPE 5 (SHORT MARGIN) konto. En short margin konto er bare en margin konto til short positioner. Margin kravet til short positioner er strengere end for almindelige margin konti, så jeg kan sagtens se fordelen i at adskille dem.\n\nI [AMA’en med Wes Christian ](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.youtube.com/watch?v%3D2rJujnpKiqM)*(startende fra 7:30)* diskutterede han specifikt, hvordan en broker-dealers marginkonto bruges til at lokalisere aktier til short sælgere. Marginkontoen indeholder dog aktier, der allerede er pantsat tidligere til anden part. Taget det manglende tilsyn i betragtning, vedrørende udlån af værdipapirer forværres problemet blot, for hver gang en ny låntager påkalder sig ejerskab over den givne aktie.\n\nTænk nu tilbage på situationen med Apex.\n\nDe bad deres kunder om at bogføre short positioner via en short margin konto eller en kontant konto. Brugeraftalen på en margin konto (ikke at forveksle med short margin konto) giver Apex mulighed for at fortsætte med at udlåne disse værdipapirer til enhver tid. Som det blev diskuteret med Dr. Trimbath og Carl Hagberg opkræver mægleren renter for at udlåne dine margin aktier og du får ingenting til gengæld. Når flere ejer lokaliteter er tilskrevet til den samme aktie, opkræver mægleren op til flere udlånsgebyrer på den samme aktie.\n\nI modsætning til margin kontoen, er kontant kontoen under beskyttelsen af [SEA 15c3-3](https://translate.google.com/website?sl=en&tl=da&ajax=1&u=https://www.finra.org/sites/default/files/SEA.Rule_.15c3-3.pdf) og består af aktier, der ikke er gearet eller udlånt, på samme måde som short margin kontoen. Ifølge Wes *(startende fra 8:30)* er disse aktier adskilt og der kan derfor ikke røres ved dem. Mægleren kan ikke på nogen måde belaste eller begrænse dem. Ifølge Wes sker dette imidlertid i øjeblikket. Han forklarede også, hvordan Canada har legaliseret dette og i øjeblikket tillader broker-dealers at sælge dine kontant konto aktier imod dig som short positioner.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nJeg skal nok stoppe med at slå mere på tromme for, hvad angår indikatorer for short salg og unøjagtige indrapporteringer af short interest positioner. Taget mængden af citeringer I betragtning, som vi ikke har gennemgået, opsummerer jeg nogle af dem jeg fandt, nedenfor.\n\nHav i baghovedet at disse citeringer kun er for **\"MANGELFULD INDRAPPORTERING AF SHORT INTEREST POSITIONER\"** eller **\"MANGLENDE SHORT SALG INDIKATOR\"**. Hvis overtrædelserne indeholder yderligere oplysninger, skyldes det, at citeringen er skrevet med yderligere oplysninger. **Dette repræsenterer IKKE en altomfattende liste over overtrædelser vedrørende short salg for disse deltagere.**\n\nVil du ikke gerne vide, hvor systematisk dette problem er? Værsgo... *(HVER BROKER-DEALERS NAVN ER HYPERLINKS TIL DERES FINRA RAPPORT)*\n\n1. [Barclays](https://files.brokercheck.finra.org/firm/firm_19714.pdf) | Disclosure 36 – “SUBMITTED 86 SHORT INTEREST POSITIONS TOTALING 41,100,154 SHARES WHEN THE ACTUAL SHORT INTEREST POSITION WAS 44,535,151 SHARES.. FAILED TO REPORT 8 SHORT INTEREST POSITIONS TOTALING 1,110,420 SHARES”\n\na. $10,000 FINE\n\n2. [Barclays](https://files.brokercheck.finra.org/firm/firm_19714.pdf) | Disclosure 54 – “SUBMITTED AN INACCURATE SHORT INTEREST POSITION TO FINRA AND FAILED TO REPORT ITS SHORT INTEREST POSITIONS IN 835 POSITIONS TOTALING 87,562,328 SHARES”\n\na. $155,000 FINE\n\n3. [BMO Capital Markets Corp](https://files.brokercheck.finra.org/firm/firm_16686.pdf) | Disclosure 23 – “SUBMITTED SHORT INTEREST POSITIONS TO FINRA THAT WERE INCORRECT AND FAILED TO REPORT TO FINRA ITS SHORT INTEREST POSITIONS TOTALING OVER 72 MILLION SHARES FOR 11 MONTHS”\n\na. $90,000 FINE\n\n4. [BNP Paribas Securities Corp](https://files.brokercheck.finra.org/firm/firm_15794.pdf) | Disclosure 53 – “FAILED TO REPORT TO FINRA ITS SHORT INTEREST IN 2,509 POSITIONS TOTALING 6,051,974 SHARES”\n\na. $30,000 FINE\n\n5. [BNP Paribas Securities Corp](https://files.brokercheck.finra.org/firm/firm_15794.pdf) | Disclosure 9 – “ON 35 OCCASIONS OVER A FOUR-MONTH PERIOD, A HEDGE FUND SUBMITTED SALE ORDERS MARKED “LONG” TO BNP FOR CLEARING. FOR EACH OF THOSE “LONG” SALES, ON THE MORNING OF SETTLEMENT, THE HEDGE FUND DID NOT HAVE THE SHARES IN IT’S BNP ACCOUNT TO COVER THE SALE ORDER. IN ADDITION, BNP WAS ROUTINELY NOTIFIED THAT THE HEDGE FUND WOULD NOT BE ABLE TO COVER. NEVERTHELESS, WHEN EACH SETTLEMENT DATE ARRIVED AND THE HEDGE FUND WAS UNABLE TO COVER, BNP LOANED THE SHARES TO THE HEDGE FUND. IN TOTAL, BNP LOANED MORE THAN 8,000,000 SHARES TO COVER THESE PURPORTED “LONG” SALES”\n\na. $250,000 FINE\n\n6. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 1 - (literally came out on 5/6/2021) – “THE FIRM SUBMITTED INACCURATE SHORT INTEREST POSITIONS TO FINRA. THE FIRM OVERREPORTED NEARLY [55,000,000 SHORT SHARES](https://www.finra.org/sites/default/files/fda_documents/2018059464001%20Cantor%20Fitzgerald%20%26%20Co.%20CRD%20134%20AWC%20va.pdf) WHICH WERE CUSTODIED WITH AND ALREADY REPORTED BY ITS CLEARING FIRM, WITH WHICH CANTOR MAINTAINS A FULLY DISCLOSED CLEARING AGREEMENT”\n\na. $250,000 FINE\n\n7. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 31 - “…THE FIRM EXECUTED NUMEROUS SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT… THE FIRM, ON NUMEROUS OCCASIONS, ACCEPTED SHORT SALE ORDERS IN AN EQUITY SECURITY FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT WITHOUT BORROWING THE SECURITY…”\n\na. $53,500 FINE\n\n8. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 33 - “…EXECUTED SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT. THE FIRM HAD FAIL-TO-DELIVER POSITIONS AT A REGISTERED CLEARING AGENCY IN THRESHOLD SECURITIES FOR 13 CONSECUTIVE SETTLEMENT DAYS… FAILED TO IMMEDIATELY CLOSE OUT FTD POSITIONS… ACCEPTED SHORT SALE ORDERS FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT, WITHOUT BORROWING THE SECURITY OR HAVING REASONABLE GROUNDS TO BELIEVE THAT THE SECURITY COULD BE BORROWED…”\n\na. $125,000 FINE\n\n9. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 17 - “THE FIRM EXECUTED SALE TRANSACTIONS AND FAILED TO REPORT EACH OF THESE TRANSACTIONS TO THE FINRA/NASDAQ TRADE REPORTING FACILITY AS SHORT”\n\na. $57,500 FINE\n\n10. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 20 - “THE FIRM EXECUTED SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT”\n\na. $27,500 FINE\n\n11. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 31 - “…SUBMITTED TO NASD MONTHLY SHORT INTEREST POSITION REPORTS THAT WERE INACCURATE”\n\na. $85,000 FINE\n\n12. Citadel Securities LLC | [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/) – LITERALLY ALL I TALK ABOUT IN THAT POST. GO READ IT\n\n13. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 10 – “THE FIRMS TRADING PLATFORM FAILED TO RECOGNIZE THAT THE FIRM WAS SELLING SHORT WHEN IT WAS ACTING AS THE CONTRA PARTY TO A CUSTOMER TRADE. AS A RESULT, THE FIRM ERRONEOUSLY REPORTED SHORT SALES TO A FINRA TRADE REPORTING FACILITY AS LONG SALES… EFFECTING SHORT SALES FROM ITS OWN ACCOUNT WITHOUT BORROWING THE SECURITY…”\n\na. $225,000 FINE\n\n14. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 59 – “…THE FIRM RECORDED 203,653 SHORT SALE EXECUTIONS ON ITS BOOKS AND RECORDS AS LONG SALES, SUBMITTED INACCURATE ORDER ORIGINATION CODES AND ACCOUNT TYPE CODES TO THE AUDIT TRAIL SYSTEM FOR APPROXIMATELY 2,775,338 ORDERS… “\n\na. $300,000 FINE\n\n15. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 76 – “…FAILED TO PROPERLY MARK APPROXIMATELY 9,717,875 SALE ORDERS AS SHORT SALES… FINDINGS ALSO ESTIMATED THAT THE FIRM ENTERED **55 MILLION ORDERS** INTO THE NASDAQ MARKET CENTER THAT IT FAILED TO CORRECTLY INDICATE AS SHORT SALES…”\n\na. $2,250,000 FINE\n\n16. [Cowen and Company LLC](https://files.brokercheck.finra.org/firm/firm_7616.pdf) | Several Disclosures – almost every other disclosure is for failing to mark a sale with the appropriate indicator, including short AND long sale indicators\n\n17. [Credit Suisse Securities LLC](https://files.brokercheck.finra.org/firm/firm_816.pdf) | Disclosure 34 – “NEW ORDER REPORTS WERE INACCURATELY ENTERED INTO ORDER AUDIT TRAIL SYSTEM (OATS) AS LONG SALES BUT WERE TRADE REPORTED WITH A SHORT SALE INDICATOR”\n\na. $50,000 FINE\n\n18. [Credit Suisse Securities LLC](https://files.brokercheck.finra.org/firm/firm_816.pdf) | Disclosure 95 – “BETWEEN SEPTEMBER 2006 AND JUNE 2008, CREDIT SUISSE FAILED TO SUBMIT ACCURATE PERIODIC REPORTS WITH RESPECT TO SHORT POSITIONS…”\n\na. $40,000 FINE\n\n19. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 50 – “THE FIRM FAILED TO REPORT SHORT INTEREST POSITIONS IN DUALLY-LISTED SECURITIES”\n\na. $200,000 FINE\n\n20. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 52 – “THE FIRM… EXPERIENCED MULTIPLE PROBLEMS WITH ITS BLUE SHEET SYSTEM THAT CAUSED IT TO SUBMIT INACCURATE BLUE SHEETS TO THE SEC AND FINRA… INCORRECTLY REPORTED LONG ON ITS BLUE SHEET TRANSACTIONS WHEN CERTAIN TRANSACTIONS SHOULD HAVE BEEN MARKED SHORT”\n\na. $6,000,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n21. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 58 – “BETWEEN JANUARY 2005 AND CONTINUING THROUGH NOVEMBER 2015, THE FIRM IMPROPERLY INCLUDED THE AGGREGATION OF NET POSITIONS IN CERTAIN SECURITIES OF A NON-US BROKER AFFILIATE… IN ADDITION… DURING THE PERIOD BETWEEN APRIL 2004 AND SEPTEMBER 2012, THE FIRM INAPPROPRIATELY REPORTED CERTAIN SHORT INTEREST POSITIONS ON A NET, INSTEAD OF GROSS, BASIS..”\n\na. $1,400,000 FINE\n\n22. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 32 – “THE FIRM REPORTED SHORT SALE TRANSACTIONS TO FINRA TRADE REPORTING FACILITY WITHOUT THE REQUIRED SHORT SALE MODIFIER”\n\na. $260,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n23. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 54 – “FAILED TO ACCURATELY APPEND THE SHORT SALE INDICATOR TO FINRA/NASDAQ TRADE REPORTING FACILITY REPORTS… INACCURATELY MARKED SELL TRANSACTIONS ON ITS TRADING LEDGER”\n\na. $55,000 FINE\n\n24. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 63 – “…SUBMITTED TO FINRA AND THE SEC BLUE SHEETS THAT INACCURATELY REPORTED CERTAIN SHORT SALE TRANSACTIONS AS LONG SALE TRANSACTIONS WITH RESPECT TO THE FIRM SIDE OF CUSTOMER FACILITATION TRADES… THE FIRM REPORTED SHORT SALES AS LONG SALES ON ITS BLUE SHEETS WHEN \n\nTHE TRADING DESK USED A PARTICULAR MIDDLE OFFICE SYSTEM…”\n\na. $1,000,000 FINE\n\n25. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 150 – “GOLDMAN SACHS & CO. FAILED TO REPORT SHORT INTEREST POSITIONS FOR FOREIGN SECURITIES AND NUMEROUS SHARES ONE MONTH… THE FIRM REPORTED SHORT INTEREST POSITIONS IN SECURITIES TOTALING SEVERAL MILLION SHARES EACH TIME WHEN THE ACTUAL SHORT INTEREST POSITIONS IN THE SECURITIES WERE ZERO SHARES… ACCEPTING A SHORT SALE ORDER IN AN EQUITY SECURITY FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT, WITHOUT BORROWING THE SECURITY OR BELIEVING THE SECURITY COULD BE BORROWED ON THE DATE OF DELIVERY…”\n\na. $120,000 FINE\n\n26. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 167 – “…THE FIRM FAILED TO REPORT TO THE NMC THE CORRECT SYMBOL INDICATING THAT THE TRANSACTION WAS A SHORT SALE FOR TRANSACTIONS IN REPORTABLE SECURITIES…”\n\na. $600,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n27. [HSBC Securities (USA) INC.](https://files.brokercheck.finra.org/firm/firm_19585.pdf) | Disclosure 26 – “FIRM EXECUTED SHORT SALE TRANSACTIONS AND FAILED TO MARK THEM AS SHORT… HSBC SECURITIES HAD A FAIL-TO-DELIVER SECURITY FOR 13 CONSECUTIVE SETTLEMENT DAYS AND FAILED TO IMMEDIATELY CLOSE OUT THE FTD POSITION… THE FIRM CONTINUED TO HAVE A FTD IN THE SECURITY AT A CLEARING AGENCY ON 79 ADDITIONAL SETTLEMENT DAYS…”\n\na. $65,000 FINE\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nJeg tænkte at stoppe ved 'H', fordi jeg egentlig ikke rigtig gider at skrive flere. Forhåbentlig forstår I alle pointen. Vi er kun 8 bogstaver inde i alfabetet og har allerede med succes begravet Ken til taljen.\n\nSystemet, der bruges til at markere den rigtige transaktionstype (sælge, købe, short salg, short salg fritaget osv.) Er åbenlyst gennemhullet og mangelfuldt.\n\nUanset årsagen - svindel eller uagtsomhed - er der for mange virksomheder, der ikke udfører, hvad der ellers umiddelbart virker som en meget simpel opgave. Konsekvenserne heraf er, at der bliver skabt langt flere aktier, end vi kan forestille os. Det er en gigantisk dominoeffekt. Hvis du ikke markerer 1.000.000 short aktier korrekt, og der går et år uden at nogen opdager det, er det allerede for sent.\n\nI hvert af eksemplerne nævnt ovenfor blev short interesten på aktien underdrevet med antallet af aktier, der blev udeladt fra de indberettede short rapporter. og det var bare en håndfuld..\n\nNår man er opmærksom på alt dette, hvordan kan nogen se på beviserne og sige, at de *ikke har noget på sig?*\n\nIngen ved for alvor, hvor systematisk dette problem er, fordi det er så dybt indkorporeret i markedet, at det næsten er blevet selve dynamikken i markedet. Derfor foregår der tydeligvis også noget, der stikker meget dybere her. Hvordan argumenterer man imod alvoren af ​​disse problemer, efter at have læst dette? Der er alt for mange ting, der ikke giver mening, og alt for mange mennesker, der vender det blinde øje til.\n\nDen eneste konklusion som jeg bliver ved med at vende tilbage til, er, at folk med penge ved, hvad der foregår og desperat forsøger at holde det under radaren.\n\nSå i et forsøg på at bevise dette, ledte jeg efter overtrædelser, der viste deres desperation for at beskytte dette f\\*cked up system.\n\n..Spænd sikkerhedsselen..",
    "title": "A House Of Cards - Part 2 - Translated to Danish/DANSK",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ns3cbh/a_house_of_cards_part_2_translated_to_danishdansk/"
}