{
    "author": "Pop-Tart_Rabies_Monk",
    "created_utc": 1622862650.0,
    "distinguished": null,
    "edited": 1623108827.0,
    "id": "nsmbnk",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nsmbnk",
    "num_comments": 318,
    "permalink": "/r/Superstonk/comments/nsmbnk/a_look_back_at_what_michael_burry_knew/",
    "score": 5420,
    "selftext": "APES. It has been a very good week. Don't let anyone try to tell you otherwise. Barely a week ago we were fighting for $180, now we have rock solid support at $245-250. It is all spelled out in black and white (green and red?) on the month-long chart: we are winning this battle.\n\nI don't know about you but it has been quite a journey to get this far. Lots of twists and turns and emotions. Even though we are not finished by a long shot, I thought this weekend might be a good time to step back and take stock of where we have been, to get a clearer view of where we are going. So, tonight I am going to peel back the layers to a tweet by Michael Burry from back in the beginning of the GME craziness. The seeds of the ending are right there in the beginning, if you look in the right place. So grab your Friday evening beverage of choice, and lets do some looking together, shall we?\n\n**Michael Burry**\n\nI like to think of Michael Burry as the original GME ape. Now, I say that of course with all due respect to our boy DFV, whom I have grown surprisingly fond of for a dude I haven't met, and whom I would love to buy a beer when this is all said and done (DFV, in the incredibly unlikely event you are reading these musings of a smooth brain, hiya bud 👋 cheers 🍻 to seeing you back on twitter this week, you cool cat). DFV actually testified in his testimony to Congress back in February that it was (in part) Michael Burry's public interest in GameStop that triggered him to take a deeper look. And if you take a look at Burry's letter to the GME board in August 2019, he makes many of the same points that DFV and even Ryan Cohen have brought up at different points (for example: new console cycle leading to stronger earnings in late 2020-early 2021; massively over-shorted stock that the Board of Directors can and should do something about; and that GameStop at the time was squandering a golden opportunity to develop a new business model based on e-commerce - Burry specifically mentions Twitch and GameSparks being bought by Amazon as missed opportunities - and that if they learned their lesson and made some key changes there was a chance for a big turnaround).\n\nWe all know what happened from there. DFV invested in GME starting in June 2019. He and the WSB retards had some fun with it during the pandemic. A lot of people made fun of him and then deleted their accounts like a month later out of shame. Lol. In late 2020, Ryan Cohen wrote his letter to the board and things got weird. Burry sold his GME position at the end of 2020 for serious profit (GME's price already was up 400-500% from the time when Burry opened his position), just before GME had a lil' mini squeeze in January (sidenote: Burry did NOT paperhands. As manager of a fund, he has a fiduciary responsibility to his investors. He can't sit around waiting for a short squeeze. If you seriously question the diamond hands on that silverback, watch The Big Short again. You must not have paid attention. My man HODL'd in the face of so much stress leading up to 2008 that he almost needed part of his intestine removed. Oh, and if you haven't seen The Big Short... 😑... we'll talk more about that in a moment).\n\nEven though Burry closed his GME position, he didn't just stop talking about it. Not by a long shot.\n\n**\"Building You Staircases and Knocking Castles Down\"**\n\nRead this tweet. No, seriously, go ahead. I'll wait.\n\n[🤑🤯](https://preview.redd.it/r9cnzt4sdc371.png?width=960&format=png&auto=webp&s=b2e08f32a36128bf71dc67a2a538ae9a6c0fb276)\n\nI think about this tweet almost every day. To fully appreciate the impact it had on me, the best I can do is to put you back to where we were and how we felt that day. It was tweeted at market close on Thursday, February 4th (the twitter timestamp says February 5th - this screencap is not my own, but I assume the person who took it was not in a U.S. time zone given the time and the commands being written in Swedish). The January mini squeeze happened the week before and we ended that Friday at $325. Pretty good considering we had just witnessed the worst market manipulation in multiple lifetimes. But then the following Monday, Feb. 1st, GME fell precipitously. It dropped $100 on Monday. Tuesday was worse, down about $150. Pretty dark times. I myself had just YOLO'd my savings into GME the day after Robinhood shut down trading, and was gutted to see losses of over 30% on my first full day as a stock trader. I was a lurker on WSB at the week of the spike, but that first week of February there were times where I was tempted to wonder if I had unwittingly stumbled into an echo chamber of cultists. WSB was suddenly filled to the brim with trolls calling people bagholders. Even among the true apes in WSB at the time, the general sentiment was some version of \"I'm with you to the end... but I would be lying if I said I'm not nervous.\"\n\nAnd then Michael Burry tweeted this.\n\nI first saw it on the evening of Friday Feb. 5th -- a snowy, cold, and dark winter evening where I live. Someone on WSB posted it, just as I was settling in to watch The Big Short for the first time. Apes, I wish I could put into words the level of mind-blown I experienced when I realized after just a few minutes into the movie that the dude Christian Bale was playing was the same dude that, earlier that very same day, tweeted about big money building us staircases via GME. I literally had to put the movie on pause for 10 minutes, reread the tweet, and then paced around my apartment with my mouth open, all the while turning these words over and over in my mind:\n\n\"building you staircases and knocking castles down... building you staircases and knocking castles down.\"\n\nHO. LY. 💩\n\nAt the time of course, we knew there was big money involved in GME -- but not necessarily on the long side. We had thought (or, more accurately, the media had portrayed) that it was a few million retail traders vs. Wall Street. But Burry clearly knew otherwise and, in his usual obscure tweet style, danced around the subject *just* *close enough* to throw your mind into a tizzy.\n\nSo the stock Burry compares GME to is a biotech stock. I won't mention it by name, because it isn't important to me right now, except for how it impacts GME (although, granted, it is on my list for stocks to invest in with MOASS tendies, for one big reason I will get into below). Instead I will refer to it simply as \\[biotech\\].\n\nLet's take a look at the price chart, 6-month view, with the cursor over the day in question.\n\n[\\[Biotech\\] 6-month](https://preview.redd.it/1qckf0u8mc371.png?width=3077&format=png&auto=webp&s=e187d04240a23db89f56276ff81b9c9ebdbef7e4)\n\n&#x200B;\n\n[GME 6-month](https://preview.redd.it/dg7pjzdbmc371.png?width=3081&format=png&auto=webp&s=d646c2265393ad3dfbdd930cbfb4f39ecfd82d2b)\n\nNow, when you look at \\[biotech\\], you might see the big spike and think it looks just like GME or the movie theater stock. We all could probably recognize the GME 6-month chart instinctually at this point, without any numbers or labels. But look closer. The big spike you see on \\[biotech\\] occurs on February 2nd and 3rd. GME had already more or less finished its freefall from $483 to $40 when \\[biotech\\] was spiking. So why did \\[biotech\\] do almost +300% in two days?\n\n[Interim Analysis Results](https://preview.redd.it/7nub2o3mic371.png?width=3793&format=png&auto=webp&s=fc1b63c3e20f4b699cf43264e28d59eef92c76c9)\n\nThis is why. They announced on February 2nd they have a drug that is a gamechanger in Alzheimer's treatment. As someone who lost a grandmother to Alzheimer's and remembers how disturbing it was, I consider this borderline miraculous. The interim results of this drug show 98% efficacy and improvements in behavior, cognition, and memory.  Yup, that would certainly account for the price tripling in 48 hours.\n\nBut it doesn't explain why it would then get cut in half over the next 48 hours. As we have seen with GME, price action on good news can last for months. Look up the price action on any of the companies that have produced COVID vaccines for even better examples. So why did \\[biotech\\] have a meme-like spike?\n\n**#BigMoney**\n\nLet's look at something else. One of the first things I tend to look into on a new stock is who has skin in the game. So here we go. \\[Biotech\\] institutional ownership.\n\n[\\[Biotech\\] Institutional Ownership](https://preview.redd.it/ncqoqesvlc371.png?width=1848&format=png&auto=webp&s=b4ee1f928c026481095c5cb17a9c69b8d3237c30)\n\nDid you see it?\n\n[🤔](https://preview.redd.it/j9nha0l3mc371.jpg?width=1848&format=pjpg&auto=webp&s=8de0087e483dd8d597da5c4889175cd3512e3c13)\n\nHmmmm...\n\nSo BlackRock, our mythical GME long whale, is also the largest institutional holder of \\[biotech\\]. Interesting. But that's not all. Susquehanna International is also in the top 10, a noted GME shortie (some would even put them in the top 3 with Citadel and Melvin).  Pretty sus if u ask me. Insert \\[FuturamaSquintyEyes.gif.\\]\n\nAnd yep, sure enough, there's our boy Kenny (sidenote: I will never insult the real \"Let's have some Sax\" Kenny G by calling Ken Griffin that. Nope. Won't do it! As he said himself, \"there's only one Kenny G, and it ain't you!!\")\n\nBlackRock owns 2,404,922 million shares, or about 6% of the company. I am comfortable saying that is a long position. By my count there are only three other institutional holders that have more than half a million shares.\n\nSusquehanna owns  367,827 shares. They also own calls and puts. I don't have the paid version of Fintel so I can't see exactly the ratio of calls to puts. They might be long, they might be short.\n\nBut Kenny boy on the other hand... according to everything I have found, Citadel is only net long on like 6 stocks, and they are all big tech and \"blue-chip\" stocks (Microsoft, Amazon, Netflix, Facebook,  VISA, possibly NVIDIA and AMD,). So if Citadel has a position in \\[biotech\\], you better believe it is as a hedge against a net short position.\n\nLet's go back to February 4th. On that day, both GME and \\[biotech\\] actually started to find support after their respective freefalls - GME in the $40-$50 range, as we all remember. My (not necessarily chronological) step-by-step explanation for what led up to the events of this day are as follows:\n\n&#x200B;\n\n1. Citadel (and possibly Susquehanna) shorted both GME and \\[biotech\\].\n2. BlackRock went long on both GME and \\[biotech\\].\n3. GME spiked as retail trading, media coverage, and FTDs spilling out converged perfectly to slaughter 🌈🐻\n4. A couple of days later, \\[biotech\\] spiked on the news of the interim results of their Alzheimer's treatment.\n5. Citadel didn't like that. So they shorted \\[biotech\\] back down to size as much as possible (smh).\n6. On February 4th, BlackRock stepped in and said \"enough is enough,\" and provided support for both GME and \\[biotech\\]. They ultimately stabilized, but the algorithms of the same two institutions fighting back and forth over the prices led to nearly identical charts.\n\n&#x200B;\n\nSo you see, the day Michael Burry tweeted this, February 4th, was really a perfect storm - a glitch in the simulation - that tipped Michael Burry off to something going on under the hood. Two financial behemoths - BlackRock on one side, Citadel on the other - dueling over stocks in *completely different sectors,* after they had spiked within days of each other, for *completely different reasons*. BlackRock, our GME long whale, apparently won that day, as they managed to stabilize the prices of both stocks well above their initial price before their spike. And, if you look at the months since then on the 6-month chart, I think it is clear who is winning still.\n\n**My main takeaways from this exercise:**\n\n1. **I cannot possibly fathom how someone as smart as our boy Kenny would think that a short position on almost every stock in existence is a viable financial strategy. Well, actually, that's not entirely true. I have** ***one*** **idea why he might, but it is a reason that is equal parts sad and degenerate. Maybe the subject for a future DD.**\n2. E**very time I, or any one of you beautiful apes, pulls on a loose string in the GME situation, somehow it always seems to lead back to BlackRock.**\n3. **Put yourself in Burry's shoes for a moment. If you were as smart as him, manager of a hedge fund, who had been investigated by the SEC and the FBI multiple times due to 2008, had just made serious money off of GameStop in the January runup, and you still knew GME was going to squeeze, what would you do? Would you say or do anything about it? Because I wouldn't. In fact, I probably would close my position (at least my public position) as soon as possible to show I have no \"skin in the game\" for fear of being investigated again for market manipulation. And then I would probably find a sneaky and indirect way on social media to tip people off that it is still going to squeeze. Like tweeting about staircases being built and castles being knocked down.**\n4. **When I first started this I was seriously hoping to learn some stuff from Burry. Now that I have finished, I am just left with a headache and wondering how anyone could ever have that many wrinkles. Wut.**\n\n&#x200B;\n\n**TADR: Michael Burry smart ape. Silverback. Looooooots and lots of wrinkles. He said GME go brrrrrr 🚀🚀🚀 even when it looked darkest.**\n\nHODL my beautiful fellow apes.\n\nIf you made it to the end, good job monke. Here, have a banana 🍌\n\nNot financial advice. I literally can't tell my own rear end from a coconut FYI.\n\nP.S. There are plenty more tweets and things that Burry has said and done that could be looked at under the microscope. I am doing this mostly as an exercise for myself to try and learn at the feet of a master. If this kind of thing interests enough apes I could do more of them going forward.\n\n**EDIT June 7th: APES. I got the ping on my phone this afternoon that this post is still getting upvotes and awards, 3 full days after I posted. It is over 5k now. It might not seem like much but I am tremendously honored and thankful for everyone reading this and giving it traction. I have never had a post get visibility quite like this, so thank you 🙏❤**\n\n**Also, I wanted to tidy up a few things, and to in turn give visibility to some really great points that commenters made below (I know I am going to miss some people if I try to tag usernames, so for now I will leave that out of it. But your wrinkly insights deserve to be highlighted here for all to see).**\n\n\\-As a couple of people pointed out, Michael Burry actually closed his position in GME *before* the runup in January, not during it. The post has been edited to show that :)\n\n\\-Just to make it fully explicit in case the analogy is lost on people (I am thinking especially of our fellow apes who might not speak English as a first language, to whom these images might be a little more obscure):\n\n**Staircases**, on the simplest level, are built to allow someone to ascend from a lower level to a higher level. So big money building us staircases via GME squeezing is simply them giving us the means to ascend from a lower state (poor, marginalized, and with the entire stock market stacked against us) to a higher state (rich, with all kinds of resources, and the ability to reform the markets to be more fair for everyone/ true to their purpose).\n\n**Castles** are a symbol of power, wealth, and tactical superiority. Historically they were fortresses, often built up on a hill or a mountain so that invaders would be thoroughly exhausted by the time they get to the front gate (if they even got that far). They had all sorts of tactical advantages like thick walls, ramparts and turrets for archers, moats that could only be crossed by a drawbridge, perches where burning hot oil could be poured down on invaders, and multiple layers soldiers and walls inside if you managed to breach the gate. Big money knocking castles down means offering us the most powerful of tactical support (whether out of convenience or out of kindness, it doesn't matter). They are quite literally taking care of the hardest obstacle for us. But we need to **hold** the line (heh, see what I did there?) so that the enemy doesn't have any alternate means of escape.  Oh, and by the way... guess what another name for a castle or a fortress is? A *citadel*. 🤯😳\n\n\\-The phrase \"building you staircases and knocking castles down\" was taken from a song, \"The Big Money,\" by Rush. Burry actually tweeted about it a couple of days before the February 4th tweet, so he obviously had it on the mind. I knew about it before I posted, but declined to include the entire song originally because I didn't want this to be too long. But some apes have mentioned that the rest of the lyrics have some other interesting things going on that definitely apply to us today, and I fully agree. So here they are in their entirety:\n\n\"The Big Money\"\n\nby Rush\n\n \n\nBig money goes around the world  \nBig money underground  \nBig money got a mighty voice  \nBig money make no sound  \nBig money pull a million strings  \nBig money hold the prize  \nBig money weave a mighty web  \nBig money draw the flies\n\n*Sometimes pushing people around*  \n*Sometimes pulling out the rug*  \n*Sometimes pushing all the buttons*  \n*Sometimes pulling out the plug*  \n*It’s the power and the glory*  \n*It’s a war in paradise*  \n*It’s a cinderella story*  \n*On a tumble of the dice*\n\nBig money goes around the world  \nBig money take a cruise  \nBig money leave a mighty wake  \nBig money leave a bruise  \nBig money make a million dreams  \nBig money spin big deals  \nBig money make a mighty head  \nBig money spin big wheels\n\n*Sometimes building ivory towers*  \n*Sometimes knocking castles down*  \n*Sometimes building you a stairway —*  \n*Lock you underground*  \n*It’s that old-time religion*  \n*it’s the kingdom they would rule*  \n*It’s the fool on television*  \n*Getting paid to play the fool*\n\nBig money goes around the world  \nBig money give and take  \nBig money done a power of good  \nBig money make mistakes  \nBig money got a heavy hand  \nBig money take control  \nBig money got a mean streak  \nBig money got no soul…",
    "title": "A Look Back at What Michael Burry Knew",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsmbnk/a_look_back_at_what_michael_burry_knew/"
}