{
    "author": "Dan_Bren",
    "created_utc": 1623977423.0,
    "distinguished": null,
    "edited": 1624033109.0,
    "id": "o2ckhq",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o2ckhq",
    "num_comments": 155,
    "permalink": "/r/Superstonk/comments/o2ckhq/a_metric_shitload_of_deep_otm_puts_the_last_2/",
    "score": 1632,
    "selftext": "Good evening Apes,\n\nWe've got some interesting things to discuss. I have saved all of the data since my last post (about 3 weeks worth.) I'm happy to share that data with anyone that is interested to see it or perhaps I'll do some sort of recap on it in the future but it was relatively mild in comparison to the last two days. Lets get right into it:\n\n[GME Biggest Options Trades 6-16-21](https://preview.redd.it/vs4q8zeq6x571.png?width=1136&format=png&auto=webp&s=e4de78eb81ea9c0ba664d47458cf332011b63877)\n\n[GME Biggest Options Trades 6-17-21](https://preview.redd.it/czt860fq6x571.png?width=1132&format=png&auto=webp&s=fe0dbae53040a774766bae06dfbcd2fc5431f717)\n\nThat is an absolutely absurd amount of DEEP OTM puts.  The most interesting is Wednesday's data where not only are there a massive amount of OTM puts but we are only seeing the time frame from 3:28pm - to close. The data set is limited to the most recent 20 large block order options trades.  In my mind this paints out two possible scenarios.\n\nScenario 1: There were far more DEEP OTM puts that we are unable to see because it is beyond the 20 large trade limit.\n\nScenario 2: The fact that it is showing the most recent 20 large trades may mean that they've pushed these trades through near the end of the day to possibly hide what they had done earlier in the day.\n\nI personally think Scenario 1 is far more likely but I do think Scenario 2 is a possibility.\n\nNow I've been tracking this data every day since the very beginning and I have never, in a single day since the start, seen anywhere near this quantity of DEEP OTM puts.  Not only that but coming from a multitude of exchanges and a multitude of trade types. The bulk of these trades on Wednesday came out of MRX which is actually the Nasdaq.  Personally I think the most interesting trade type here are the SingLegAuctNonISO as these were the same trade types we saw with the initial waves of DEEP ITM calls and this trade type doesn't appear too often.\n\nI don't want to sit here and speculate too far beyond this but I will keep you posted with the data as we see how this continues to shake out. Lastly thanks to everyone who reached out over the last couple weeks you're all very kind with your words and make this community special. u/Dan_Bren out.\n\nTL;DR: My wife's boyfriend grounded me for 3 weeks with no laptop or phone\n\nEdit: Going to look into filing an SEC tip this weekend",
    "title": "A METRIC SHITLOAD OF DEEP OTM PUTS THE LAST 2 DAYS (6/16 & 6/17)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2ckhq/a_metric_shitload_of_deep_otm_puts_the_last_2/"
}