{
    "author": "nemovincit",
    "created_utc": 1619759554.0,
    "distinguished": null,
    "edited": 1619794898.0,
    "id": "n1mwxg",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n1mwxg",
    "num_comments": 142,
    "permalink": "/r/Superstonk/comments/n1mwxg/a_big_takeaway_from_the_trimbath_ama_nasaaorg_and/",
    "score": 4908,
    "selftext": "I finally got to watch the full video and there were a couple of things she mentioned that I felt were real big. \n\nIn answer to the question \"What can we do?\" she responded that we can go to nasaa.org and \ninspectors-of-election.com.\n\n\n[NASAA.ORG](https://www.nasaa.org/)\n\nAt the top of the home page is a button to [contact your regulator](https://www.nasaa.org/contact-your-regulator/) and show them all the wonderful DD. She stated that this was the organization that brought the NYSE to the Overstock panel to answer questions. \n\n[Inspectors of Elections](http://inspectors-of-election.com/) (No https unfortunately)\n\nShe mentioned this one was organized by a guy named[ Carl Hadberg](https://carlhagberg.com/). When there's a shareholder vote and there are more votes than shares exist, the results should not be accepted. Instead, they call these guys and that's where evidence like naked shorts and FTD fuckery gets brought to light. \n\nIf this was already posted, sorry, but I didn't see it yet and I thought it was important for everyone to see.\n\nEdit0: This might be late night thinking, but I wonder what effect having apes from around the world utilizing these links would do as well.\n\nEdit1: \nu/sillyorganism had the same idea and made a template for apes to use in another post: \nhttps://www.reddit.com/r/Superstonk/comments/n1rgr2/please_read_and_take_action_dr_t_suggested/\nI hope this helps! \n\nEdit2:Some folks have commented stating the template gives off tin foil hat vibes and seems a bit emotive, but it's a good jumping off point you can use to formulate a well thought out, mature submission.",
    "title": "A big takeaway from the Trimbath AMA: NASAA.ORG and inspectors-of-election.com. Get the attention of the right people.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n1mwxg/a_big_takeaway_from_the_trimbath_ama_nasaaorg_and/"
}