{
    "author": "psych_ing_invest",
    "created_utc": 1621253865.0,
    "distinguished": null,
    "edited": 1621254242.0,
    "id": "neeoyk",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_neeoyk",
    "num_comments": 42,
    "permalink": "/r/Superstonk/comments/neeoyk/degiro_restricting_market_orders_because_of_high/",
    "score": 700,
    "selftext": "As an Europoor I have all my holdings in DeGiro. Some of you may know this brokers others not. I really appreciate DeGiro in regards of transaction fees and support. The interface is quite basic since there only is a webtrade. But nevermind - cutting the slack.\n\n*^(Please keep in mind that this is no financial advice, I do not have a financial background or know anything about the stock market at all - I just hodl.)*\n\n# LET'S GET INTO IT!\n\nLast week I contacted DeGiro support to ask them if they would suspend trading because of own liquidity problems or because of very high volatility.\n\n**Here is my E-Mail (translated into english):**\n\n>*Dear DeGiro team,*  \n>  \n>*I have some questions about very high market volatility. Especially with regard to the incidents at the end of January in the context of the Gamestop ticker symbol “GME” or “GS2C”.*  \n>  \n>*1. As a broker, is DeGiro authorized to close my positions without my consent? For example, to ensure your own liquidity?*  \n>  \n>*2. Can DeGiro liquidate shares in my portfolio without my consent?*  \n>  \n>*3. In January DeGiro prevented the creation of market orders for the ticker “GME”. If there is similar market volatility in the future, will DeGiro apply restrictions again? If yes, which?*  \n>  \n>*Thank you in advance.*\n\n&#x200B;\n\n**And here is the answer from DeGiro-Support:**\n\n>*Thank you very much for your email.*  \n>  \n>*1. As a broker, is DeGiro authorized to close my positions without my consent? For example, to ensure your own liquidity?*  \n>  \n>*-->As a matter of principle, DEGIRO only closes positions on margin calls from             customers if you are trading on margin. Apart from the scenario, I don't see any     reason why DEGIRO should / may close positions. (Not even to guarantee your own     liquidity.)*  \n>  \n>*2. In January DeGiro prevented the creation of market orders for the ticker “GME”. If there is similar market volatility in the future, will DeGiro apply restrictions again? If yes, which?*  \n>  \n>*-->Any restrictions are checked daily by the risk department. If market conditions require it, it may well be possible that market orders will be restricted. Please note that this is a standard procedure for all products at DEGIRO in the event of increased volatility. No other \"restrictions\" are planned at DEGIRO.*\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\n***So much about that - pretty good news I think for all of us hodling with DeGiro.***\n\nAfter all the shit that happened with the FUD attack on the weekend I dived a little deeper into the order types on DeGiro for GME. I was quite confused when I found \"Stop Limit\" and \"Limit\" Orders only.\n\n**I then contacted DeGiro again with the following E-Mail:**\n\n>*I have a question about the “GME” ticker symbol. Since I have a relatively large position in this stock, I have considered my possible exit strategy.*  \n>  \n>*I noticed the following:*  \n>  \n>*There is no “stop loss” order available for the ticker symbol “GME”:*  \n>  \n>*Why is that so? Is there a special reason for this? The option of the normal “market order” for “GME” is also missing. This needs an explanation.*  \n>  \n>*To check, I have selected another stock that also falls into product category \"D\" and is traded on the New York Stock Exchange. I found Boeing with the ticker symbol \"BA\":*  \n>  \n>*A “stop loss” order is possible here. It is also possible to set a “market order” here.*  \n>  \n>*For what reasons is the setting of “market orders” and thus also “stop loss” orders with the ticker symbol “GME” prevented? (As far as I know, a stop loss order triggers a market order as soon as a certain price is reached)*\n\n&#x200B;\n\n**Today I got this answer from DeGiro-support (yes I asked them Saturday and have my answer on Monday 1pm):**\n\n>*If a product is illiquid or has an increased risk, our risk department can block all order types for this product or limit the number of securities that result in a market order. Therefore, you cannot place a trailing stop or stop loss order, for example. Both have the result that a market order is sent to the trading venue.*  \n>  \n>*In this case, you only have to place an order based on a limit.*\n\n**Read carefully**: \"*illiquid*\" ... \"*increased risk*\" ... guuuuuuuhd 🦄\n\nEdit: Changed the format I displayed me E-mails because it looked way worse than I expected through using \"code boxes\".\n\n**TLDR**: DeGiro will probably not suspend trading for GME, will not sell your shares without your consent and will not allow market orders because they have already restricted them in January and just let them be restricted until now. Further more DeGiro is indirectly calling GME a stock with \"**illiquidity issues**\" and an \"**increased risk**\". BULLISH - BUY - HODL - VOTE 🚀🚀🚀🚀🚀",
    "title": "DeGiro restricting Market Orders because of high \"illiquidity\" and \"increased risk\" - They are not planning on restricting trades because of high volatility or because of liquitidy issues on their side 🚀🚀 Bullish for me ma friends! 🍌🍌Europoors doin there duty!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/neeoyk/degiro_restricting_market_orders_because_of_high/"
}