{
    "author": "vaseline_sandwich",
    "created_utc": 1621249039.0,
    "distinguished": null,
    "edited": 1621295793.0,
    "id": "ned4cd",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ned4cd",
    "num_comments": 148,
    "permalink": "/r/Superstonk/comments/ned4cd/the_vix_may_be_telegraphing_margin_calls_and/",
    "score": 3222,
    "selftext": "*First off, this post is not to persuade anyone to invest in anything other than GME.  The VIX is a tool to gauge risk, fear, or stress in the market.  I wouldn't recommend anyone invest in it even under extraordinary circumstances.  And honestly, GME is the perfect hedge against market instability, last time I saw a Bloomberg terminal raw beta was like negative 35.*\n\n*I was attracted to the VIX because of it's recent... volatility.*\n\n*Also, not a financial advisor--I eat crayons-- the sparkly ones taste the best.*\n\n\\--------------------------------------\n\nHere is a link to the wayback machine:\n\n[https://web.archive.org/web/\\*/https://finance.yahoo.com/quote/%5EVIX/options/](https://web.archive.org/web/*/https://finance.yahoo.com/quote/%5EVIX/options/)\n\nAs you can see someone was nice enough to capture the huge open interest in calls expiring January 20th on January 14th.\n\nhttps://preview.redd.it/mupr82jg0pz61.jpg?width=916&format=pjpg&auto=webp&s=dcaea975a307f69e0ef4e5700b05c05efd88e5ba\n\nOn Jan 14th, GME opened $38.09 and closed $39.91.\n\nThe VIX opened $22.67 and closed $24.72 -- no a huge runup for either, though GME was on the verge of the January baby squeeze.  Yet huge open interest on VIX.\n\nAt this point, most people on WSB are raving about GME potentially going to $100 ruining Melvin Capital's day (the understatement of the century) and there is some FOMO.  I don't have the data for Jan 27th calls, but I assume it is substantial, maybe someone else knows where to find it.\n\nMy point is, people with a lot of money, most likely the SHF knew shit was going down in January before we did.\n\nLets take a look at the 6 month charts.\n\nhttps://preview.redd.it/o942pxjl0pz61.jpg?width=1186&format=pjpg&auto=webp&s=9ffcf27230c83fd4e81bccbfaeef976cdb8bfcb0\n\nhttps://preview.redd.it/4izqxyhm0pz61.jpg?width=1237&format=pjpg&auto=webp&s=ae9b73e5ce5eb7c8ac1ee563dcb8deb423e7586d\n\nYou might notice the same big \"M\" on GME and VIX at the end of January.  The market was blood red except GME then, this may have been SHF preparing to be margin called or just trying to pay interest on all their shorts.  The DTCC guy said there were no margin calls though, but there is the possibility some shorts covered and caused this volatility because during the MOASS you don't want to be the last SHF to cover.\n\nEdit: u/Lanedustin : \"I wanted to note that the DTCC may have been saying they didn't have any members that were unable to meet the additional margin requirements. I think this may be separate from a Prime Broker like Goldman Sachs margin calling their client (HFs).\"\n\nThe second big pop up on the VIX happens on Feb 25th, however the runup on GME doesn't hit hard till March 8th.  I'm unsure why Archegos Capital Management defaulted.  I see a lot of unverified sources saying it was because the Feb runup of GME, but there is no evidence that I have seen, but it makes complete sense to me.  Liquidating positions end of Feb and cover beginning of March.  I would also like to point out the \"M\" Archegos Capital may have made on the VIX as well.  We may see another spike on the VIX in the next day or so if this is a pattern.\n\n[SOURCE???? WHERE SOURCE? And wen lambo dammit!?](https://preview.redd.it/qcfra2mo0pz61.jpg?width=1037&format=pjpg&auto=webp&s=7f9326f2dc426a88782f4573423df726f4c5ccf9)\n\nOk, so runup on VIX may potentially be linked to GME. Yeah?\n\nAnd we just had post from a European Financial News talking about all the margin calls on wall street last week.\n\nPost:  [https://www.reddit.com/r/Superstonk/comments/nb9pon/european\\_financial\\_news\\_is\\_reporting\\_major\\_margin/](https://www.reddit.com/r/Superstonk/comments/nb9pon/european_financial_news_is_reporting_major_margin/)The link:  [https://www.money.it/Fed-repo-miliardi-Wall-Street](https://www.money.it/Fed-repo-miliardi-Wall-Street)  If you can read European :O\n\nCounter DD (updated as of 5/16 and debunked): [https://www.reddit.com/r/Superstonk/comments/nbt1sp/counter\\_dd\\_ny\\_fed\\_400\\_bln\\_reverse\\_repos\\_is\\_not/](https://www.reddit.com/r/Superstonk/comments/nbt1sp/counter_dd_ny_fed_400_bln_reverse_repos_is_not/)\n\nLets take a look at the options expiring Wednesday, 5/19/21:\n\nhttps://preview.redd.it/408egpmu0pz61.jpg?width=977&format=pjpg&auto=webp&s=5280ed151440901669232f492cab2082a38f6bd8\n\nI just pasted the calls here, there is a large number of puts as well, however they are much closer to being ITM and less of them.  That's just those rascally HF *hedging,* typically not retail investors.  We had a spike on the VIX last Tuesday and Wednesday, but it simmered back down Thurs and Fri, so most of these will expire worthless unless margin calls continue throughout the week or there is something bigger on the horizon.\n\nLook at the next week, May 26th or the week after that and you'll see the option activity is far more normal looking, all the way up to until 6/16.  The simple explanation for this may just be that these dates were available more early than most dates.  The original dates back in January were 5/19 and 6/16, but that's still a concerning amount of money betting the stock market will shit the bed by then-- which is good if you're long on GME because of negative beta and because margin calls are more likely to come.\n\nI'm not going to bother pasting 6/16, because we already know this date was available earlier than the ones surrounding it.   My initial thought is that it was tied to being the week after the GME shareholder meeting, but probably has more to do with the lack of faith in financial stability.\n\nTL;DR:\n\nA VIX spike occurred last week.  The spike likely occurred due to margin calls.  Aside from one European news source we have not heard anything about margin calls, much like when Archegos defaulted.  The VIX may telegraph an increase in price in GME if SHF are the ones being margin called.\n\nThe lag between the VIX and GME was around 8 business days or 11 regular days.  Again, I have no idea if Archegos was short on GME, but it does seem likely.\n\n\\----------------------------------------------\n\nI will try to update if necessary.  My free time is sparse, so be patient with me.\n\nGME will moon regardless.\n\nEdit:\n\nApparently, I have to clarify the title... margin calls potentially cause VIX spikes, not magically show up before margin calls.  We don't have much transparency in the market, so we don't know when margin calls happened until way later.  And yes, there are plenty of other reasons for the VIX to spike recently like liquidity test and jobs report.  VIX up 10% since I posted fyi.",
    "title": "The VIX may be telegraphing margin calls and potential GME runups",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ned4cd/the_vix_may_be_telegraphing_margin_calls_and/"
}