{
    "author": "weenythebooty",
    "created_utc": 1623730313.0,
    "distinguished": null,
    "edited": 1623734157.0,
    "id": "o05dwx",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o05dwx",
    "num_comments": 91,
    "permalink": "/r/Superstonk/comments/o05dwx/801_and_nscc002_june_21_repost_from/",
    "score": 803,
    "selftext": "Preface from me u/weenythebooty: \nI’m reposting this for visibility because I think it provides some important insight that hasn’t been discussed for a while. For whatever reason I couldn’t crosspost this. Beyond this, I’m going to leave the post as it was originally. \n\nDisclaimer: These are not my original ideas or words. The views represented here are not mine, rather those I thought important to discuss. \n\nWeeny edit: keep in mind this information is retroactive to ~40 days ago so when it’s saying “this Friday” it’s Friday from several weeks ago. That said, the June 21 date hasn’t changed and that’s why I wanted this reposted - because it’s judgement day is upon us. \n\nAnother Weeny edit: I removed the references to previous days because it was confusing people. \n\n801 and NSCC-002\n\nCREDIT TO u/FATJUUL FOR STRUCTURE AND INFO\n\nI haven't seen as much talk about this, yet it is the biggest news to come and IT IS the endgame catalyst.\n\nNSCC-801 Passed with no objections. For this rule to enter effect it needs to piggyback on NSCC-002, which if no objections are made again, will be passed June 21. Let me remind you just how powerful 801 really is...\n\nOnce 801 enters effect, all hedgefunds holding short positions will be monitored Every. Single. Minute. They will have to report EVERY SINGLE MINUTE their value in short positions versus their actual money on hand. If they fail to report or their short position value crosses the threshold where it is higher than their money on hand, it is an immediate warning to deposit the funds needed to cover within ONE HOUR. Failure to do so leads to the NSCC immediately overriding operations and liquidating the hedge funds entirely, one after another until all that is left is the trillions in insurance.\n\nThis is bigger than anything, This is so big, that this rule will prevent a squeeze even a fraction of this magnitude from happening ever again. It is that powerful, and with its implementation of this stage of the game... good lord.\n\nIf NSCC-002 passes we have officially entered the squeeze. Hedgefunds will be on a leash that gets tighter the more they pull. Starting in after hours, they will be under so much pressure and restriction that one of two outcomes occur:\n\n1.) Their ability to short will be at such a minimum that our buying power will just break through sell walls and the price will just continue to rise and rise until they can no longer afford to suffer the loss and margin comes a calling, or.\n\n2.) There will be strong final blows of sell off aggression and shorting, literally out of pure ignorance and recklessness which will activate NSCC-801, and thus the great fall of the hedgies via margin call.\n\nRemember they passed the rule that changed reporting from once a month to anytime for any reason. They can be spot audit unlimited times and for them to run under the radar will require their books to be radioactive.\n\nI threw this up to let everyone know what is up with the end game posts and the severity of the situation. Nobody knows OP. It's not about OP. It's about digesting the information here.",
    "title": "801 and NSCC-002 June 21 - repost from u/moontellsmeasecret",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o05dwx/801_and_nscc002_june_21_repost_from/"
}