{
    "author": "zhishy",
    "created_utc": 1623677182.0,
    "distinguished": null,
    "edited": 1623780754.0,
    "id": "nzmr60",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nzmr60",
    "num_comments": 163,
    "permalink": "/r/Superstonk/comments/nzmr60/feds_reverse_repo_fuckeries_ultimate_smooth_brain/",
    "score": 1576,
    "selftext": "**1. Core Concepts Explained**\n\n**2. Reverse Repo in the Ideal World**\n\n**3. What Really Happened -- The Reverse Repo Fuckeries**\n\n**4. Connection to GameStop**\n\n**5. Conclusion (TLDR)**\n\n**6. Further Reading**\n\n\\---\n\n*\\[This DD serves as a brain-wrinkling bridge between* [*reverse repo news*](https://fred.stlouisfed.org/series/RRPONTSYD) *and* [*God-tier DDs*](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)*.\\]*\n\n*\\[This is my first DD. Correct me if I’m wrong in any way.\\]*\n\n*\\[No financial advice is intended. I’m a retard.\\]*\n\n*\\[I sincerely thank* [*u/plants69*](https://www.reddit.com/user/plants69/posts/) *for reviewing this DD.\\]*\n\n**1. Core Concepts Explained**\n\n1.1 A repurchase (or repo) is an agreement in which an institution agrees to sell collateral to the Federal Reserve (hereinafter \"Fed\") for some time, and then trade back.\n\n1.2 A reverse repurchase (or reverse repo) is an agreement in which an institution agrees to buy collateral from the Fed for some time, and then trade back.\n\n1.3 Quantitative easing (QE) is the purchase of long-term securities to increase the money supply.\n\n1.4 Rehypothecation is re-using collateral from one lending transaction to finance additional loans.\n\n1.5 Liquidity refers to how fast an entity can convert its assets into cash.\n\n1.6 A liquidity crisis happens when liquidity is urgently needed, but there is a lack thereof.\n\n**2. Reverse Repo in the Ideal World**\n\n2.1 In a reverse repo agreement, the institution agrees to lend the Fed money. The Fed agrees to lend the institution the collateral (usually in the form of treasury bonds). Upon the specified time, the institution gives back the collateral, and the Fed gives back the money. Extra money (i.e. an interest) is usually given by the Fed when it buys back the collateral.\n\n2.2 After a reverse repo agreement is made and before the specified swap time, the money supplied to the market is reduced. This is because the money that the institution originally has (i.e. the money used to lend the Fed money) is recorded as a liability in the Fed’s balance sheet, and during that period, the liability is temporarily deleted by the institution lending the Fed money. Besides, the collateral moves from the Fed’s asset to the institution’s liability.\n\n2.3 Therefore, ideally, the reverse repo is a good tool to offset the extra money supplied following QE.\n\n**3. What Really Happened -- The Reverse Repo Fuckeries**\n\n3.1 If the ideal things (as described in **Section 2.**) indeed happen, then the following statement [from the NY Fed](https://www.newyorkfed.org/markets/rrp_faq) will **not** make sense:\n\n*“When the Desk conducts RRP open market operations, it sells securities held in the System Open Market Account (SOMA) to eligible RRP counterparties, with an agreement to buy the assets back on the RRP’s specified maturity date. This leaves the SOMA portfolio the same size, as securities sold temporarily under repurchase agreements continue to be shown as assets held by the SOMA… but the transaction shifts some of the liabilities on the Federal Reserve’s balance sheet from deposits held by depository institutions (also known as bank reserves) to reverse repos while the trade is outstanding.”*\n\nOk, ape translation:\n\n*“After a reverse repo agreement is made and before the specified swap time, the collateral does* ***NOT*** *move from the Fed’s asset to the institution’s liability. This leaves the Fed’s assets the same size. The liabilities, which are supposed to get deleted, also don’t get deleted, as they’re moved from one liability account to another liability account. In this way, the Fed’s liabilities also remain the same size.”*\n\n3.2 OK, what the fuck?\n\nIf you sold a piece of gold to cancel a debt, your asset shrinks because you no longer have that gold. Your liability also shrinks because the debt is cancelled. Your balance sheet is supposed to shrink.\n\nBut the NY Fed says the exact opposite, and this statement directly contradicts what is supposed to happen, as described in **Section 2.2**.\n\n3.3 In other words, the Fed’s balance sheet, that is supposed to change, does not change, and the money supplied, that is supposed to be reduced, is not reduced.\n\n3.4 The only thing that changes is **the institution’s ability to profit off the newly obtained collaterals**, e.g. by short-selling the collaterals in hope that their prices will go down in the future.\n\nIf this happens, it is in the institution’s interest to drive the collaterals’ prices down, e.g. through selling off treasury bonds.\n\n3.5 It is also in the Fed’s best interest to drive the collaterals’ prices down, as it needs the institution to be able to return the collaterals upon the specified time. This is to maintain the Fed’s contractual integrity, i.e. to keep the music playing. The Fed can drive the collaterals’ prices down by, for example, again, selling off the collaterals.\n\n3.6 So, this is how the Fed-institution fuckeries happen:\n\n3.6.1 The Fed lends collateral to Institution A through a reverse repo. Before this happens, the Fed and Institution A are both incentivized to drive the collateral’s price **up**, and they do so, e.g. through buying up treasury bonds.\n\n3.6.2 Institution A short-sells the collateral to Institution B. Once this happens, the Fed and Institution A are both incentivized to drive the collateral’s price **down**, and they do so, e.g. through selling off treasury bonds. Institution B can profit from the short interest.\n\n3.6.3 In this way, the Fed’s, Institution A’s and Institution B’s interests are tied together. **The regulator and the regulated have become one.**\n\n3.6.4 During the fuckeries, as the Fed’s balance sheet does not change, it can rehypothecate the collaterals out of thin air, i.e. lend the collaterals, which have already been lent under a reverse repo agreement, under another reverse repo agreement.\n\n**4. Connection to GameStop**\n\n4.1 Now, shorties need enormous liquidity to keep the GME’s FTD cycle going (see [Hank's Definitive GME Theory of Everything](https://www.reddit.com/r/Superstonk/comments/n66tzh/hanks_definitive_gme_theory_of_everything/)). As such, the Fed and shorties start playing the fuckeries as described in **Section 3.6** (through intermediary banks, see  Figure 3 (on pg. 14) of [this paper](https://economic-research.bnpparibas.com/Views/DisplayPublication.aspx?type=document&IdPdf=25852).).\n\n4.1.1 They start by buying treasury bonds, driving the collaterals’ prices up.\n\n4.1.2 However, the GME short position is a black hole. Every day that we remain retarded and HODL, the fuckeries happen.\n\n4.1.3 Now, the Fed and institutions are selling off treasury bonds, driving their prices down. \\[Enter [The EVERYTHING Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/), [The Flurry of Rules Before the Storm](https://www.reddit.com/r/Superstonk/comments/ngru15/the_flurry_of_rules_before_the_storm_dtc_icc_occ/) and other God-tier DDs.**\\]**\n\n4.2 This also leads to the Fed favoring contractionary policies, as confirmed or speculated by multiple sources \\[[1](https://www.cnbc.com/2021/06/07/the-fed-is-in-the-early-stages-of-a-campaign-to-prepare-markets-for-tapering-its-asset-purchases.html)\\] \\[[2](https://realtybiznews.com/expect-an-interest-rate-hike-after-todays-federal-reserve-inflation-data/98762889/)\\] \\[[3](https://www.ft.com/content/9d100381-3f86-4540-91c8-4477b4cef127)\\], **completely driven by the shorties’ need for extra liquidity** (instead of market conditions).\n\nFor the absolute smooth brains, here’s how raising the bank’s interest rates can drive the bond prices down:\n\n4.2.1 Most bonds pay a fixed interest rate (this is the bonds’ interest rate).\n\n4.2.2 When the bank’s interest rates rise, the bonds’ interest rate becomes less attractive. Less people want bonds, declining their prices.\n\n4.2.3 Conversely, when the bank’s interest rates fall, the bonds’ interest rate becomes more attractive. More people want bonds, increasing their prices.\n\n4.3 As a result, there is less money supplied to the market, but the market demand for money remains constant. In other words, a liquidity crisis happens.\n\n4.4 What happens during a nationwide / global liquidity crisis? According to [Investopedia](https://www.investopedia.com/terms/l/liquidity-crisis.asp)...\n\n*“For the economy as a whole, a liquidity crisis means that the two main sources of liquidity in the economy — banks loans and the commercial paper market — become suddenly scarce. Banks reduce the number of loans they make or stop making loans altogether.”*\n\n*“A negative shock to economic expectations might drive the deposit holders with a bank or banks to make sudden, large withdrawals, if not their entire accounts. This may be due to concerns about the stability of the specific institution or broader economic influences. The account holder may see a need to have cash in hand immediately, perhaps if widespread economic declines are feared. Such activity can leave banks deficient in cash and unable to cover all registered accounts.”*\n\nIn other words, the nation / world will be **seriously fucked.**\n\n**5. Conclusion (TLDR)**\n\n**5.1 In short, the Fed is our endgame boss now. We’re past the hedgies stage.**\n\n5.2 The Fed has abused our trust, aligned its interest with the institutions (which it is supposed to regulate), and by doing so, created a systemic risk.\n\n5.3 Combined with the unresolved predatory shorting, it is almost as if **the whole system preys on its own failure**. To put it bluntly, **the Fed-Institution monster is parasitizing our economy**.\n\n5.4 As we deal a heavy blow (probably a final one) to this blood-sucking monster, the systemic economic damage is [starting to manifest itself in people's daily lives](https://www.youtube.com/watch?v=5dfeLQcDhco) \\[here's another [source](https://www.youtube.com/watch?v=kBJVU1RyxfQ) if you don't like China-funded media\\]. This is like a person finally [coughing blood after severe gastrointestinal bleeding caused by worms](https://www.emedicinehealth.com/gastrointestinal_bleeding/article_em.htm). Our global economy, just like the person, needs emergency care **right now**.\n\n5.5 We need to remove the parasites in our economy. It will be **extremely painful**, but it is **absolutely necessary**.\n\n5.6 And we do that by **BUYING, HODLING and BUCKLING UP**.\n\nDiamond fucking hands y’all.\n\n**6. Further Reading**\n\n[**New Repo Market Warning Sign Proves System Is Rigged!! - YouTube**](https://www.youtube.com/watch?v=vqxNTRtEvXg)\n\n[**The Imminent Liquidity Crisis & Reverse Repos Usage - Smooth Brain Edition : Superstonk (reddit.com)**](https://www.reddit.com/r/Superstonk/comments/nhepn1/the_imminent_liquidity_crisis_reverse_repos_usage/)\n\n[**The EVERYTHING Short : GME (reddit.com)**](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n\\---\n\nEdit 1: Remove references to corporate bonds as they're not available under Fed's reverse repo agreements.\n\nEdit 2: Clarified Fed = Federal Reserve.\n\nEdit 3: Regarding Section 4.1, clarified hedgies work through intermediary banks.\n\nEdit 4: Changed the reverse repo link to [this one](https://fred.stlouisfed.org/series/RRPONTSYD) for more dramatic effect.\n\nEdit 5: Regarding Section 4.1, changed \"need liquidity to pay off enormous GME's short interest\" to \"need enormous liquidity to keep the GME’s FTD cycle going (see [Hank's Definitive GME Theory of Everything](https://www.reddit.com/r/Superstonk/comments/n66tzh/hanks_definitive_gme_theory_of_everything/))\".\n\nEdit 6: Fixed typo.\n\nEdit 7: Provided another source for Section 5.4.",
    "title": "Fed’s Reverse Repo Fuckeries -- Ultimate Smooth Brain Edition",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nzmr60/feds_reverse_repo_fuckeries_ultimate_smooth_brain/"
}