{
    "author": "SpeedReactor",
    "created_utc": 1620246005.0,
    "distinguished": null,
    "edited": 1620252285.0,
    "id": "n5pj2q",
    "text_only": true,
    "flair_text": "🙋‍♀️ Question 🙋‍♂️",
    "name": "t3_n5pj2q",
    "num_comments": 130,
    "permalink": "/r/GME/comments/n5pj2q/negative_1_million_on_volume_afterhours_wtf/",
    "score": 1055,
    "selftext": "Ok I have no idea what this is but need share it. I will do some digging to see what this \"glitch\" is. But it totally messed my charts for the day and at first glance should not be possible?? Unless we are deleting shares now?\n\n&#x200B;\n\nhttps://preview.redd.it/08yi2jwm1dx61.png?width=2542&format=png&auto=webp&s=c0eac6b9f8dd6006edb4031fe0872f0fa419f049\n\nEdit: Ok I was looking at the chart and at the 4:15EST Candle it did in fact log a -1 million and some change volume. I then refreshed the chart and it was gone. I imagine a server farm somewhere in New Jersey sitting at 100% CPU with smoke pouring out. I suppose this should not be surprising its GME.\n\nEdit2: Alright so our Volume today is currently at 1.7 mil yet comments and notes from others say 2.7mil. I recall glancing at volume earlier and it was around 2.2 million this afternoon. So did 1 million volume just get chucked into the void or did we really have such low volume? that would be what roughly $160million of transactions that are no longer their? If anyone can cross post this would be helpful to get some smarter folks opinion. Or any screenshots that show volume prior to close.\n\nEdit3(Final): Ok so I found something! Looks like their was issues reported earlier in the day with the consolidated tape association. Who are they?? they keep track of volume and trades on the market. From their website:\n\nThe Consolidated Tape Association (CTA) oversees the dissemination of real-time trade and quote information in New York Stock Exchange LLC (Network A) and Bats, NYSE Arca, NYSE American and other regional exchange (Network B) listed securities. Since the late 1970s, all SEC-registered exchanges and market centers that trade Network A or Network B securities send their trades and quotes to a central consolidator where the Consolidated Tape System (CTS) and Consolidated Quote System (CQS) data streams are produced and distributed worldwide. . \n\nAlert issued - [https://www.ctaplan.com/alerts#110000353886](https://www.ctaplan.com/alerts#110000353886) \n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/b95z6c9xjdx61.png?width=756&format=png&auto=webp&s=4326995e61fbb21aced06f8bb0651dea6ce1d45b\n\nThis is the best explanation I have found: Unsure what this actually means but more info for all.\n\nStill holding - Not selling - Our cheat code is Buy = HODL",
    "title": "Negative 1 million on volume afterhours?? WTF",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/n5pj2q/negative_1_million_on_volume_afterhours_wtf/"
}