{
    "author": "JuxtaposeLife",
    "created_utc": 1617215520.0,
    "distinguished": null,
    "edited": false,
    "id": "mhchj9",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mhchj9",
    "num_comments": 165,
    "permalink": "/r/GME/comments/mhchj9/dd_gamestop_price_analysis_still_a_deep_fucking/",
    "score": 4926,
    "selftext": "**TLDR;** Gamestop is undervalued considering its online sales numbers and ecommerce focus - analysts haven’t caught up yet from Q4 Earning report; add on top of that all the hiring of Amazon execs and VPs and Gamestop Valuation is about to explode upward. On its current trajectory $550-750 a share is a reasonable (my worthless opinion) price point, with or without the squeeze. Not only is buying GME a play on the squeeze, but also a deep fucking value bet. \n\nFair warning, you'll develop a wrinkle of two if you proceed... but don’t worry my fellow ape brethren I’ve included charts, with colors, to make visualization easy. Let’s walk through these figures one by one and tell the story of Gamestop’s transition.\n\n\\*\\*\\*\\*\\*\\*\\*\n\n# Chapter 1: Gamestop’s Advantage in its Transition to Online.\n\nLet’s start with the ugly before we get to the good stuff: **Operating Loss**. An operating loss occurs when a company's operating expenses exceed gross profits. Gamestop has had a fairly significant operating loss for many years now (peaking in 2018), as it faced the challenges all brick and mortar stores faced: theft of sales to the e-commerce giants -- the convenience of online downloads and pre-ordering on the internet. In the last two years, this loss has come down significantly. And what impresses me most about Gamestop is their cash on hand (currently $635M). Very few stores with operating losses have that level of cash. Most are in debt, and require the sale of shares to float by during rough times.\n\n[Gamestop Operating Loss per Year](https://preview.redd.it/4e698fbbneq61.png?width=1579&format=png&auto=webp&s=0a7de50dda8fa00983cdec3285c1025a9ad83ca5)\n\nAnd this is the key misstep the HF’s made in shorting Gamestop. There has been a stigma out there about brick and mortar stores going under (Toys R Us, and Sears as example)...  feeding frenzy, blood in the water you get the point. Sharks (HFs) have been getting more and more bold (reckless) in their targeting. Gamestop was the wrong target, for a very specific reason. It leases its stores. By comparison, consider Walmart needing to reduce stores, or Target. They’ve built massive buildings with parking lots to house their very specific store needs (huge upfront costs, sunk), and they rent (or own) these buildings under much different contracts. They can’t easily get up and leave one of their stores. Ask yourself, how would Walmart leave a store? Who would buy it? How could the investor renting to them turn it into something else? Maybe a city might want it to build an expo center. On the cheap. WalMarts costs are priced into this (it’s expensive). They can’t move as easily. Point being, Gamestop doesn’t owe anything to shut down a store, it simply stops paying its lease and moves all it’s stuff out. They rent strip mall locations and mall storefronts. This allows them to liquidate stores and downsize with little to no sunk costs. They can also reposition themselves much more efficiently. This is why we see this fast turn-around in Operating Loss last year (a major component of Operating Loss is storefront costs for Brick and Mortar). News of Gamestop closing stores isn’t bad news. Remember that. The media will try to sell it as such.\n\nBecause of the focus, Gamestop is eyeing Digital Sales, for its future.\n\n \n\n# Chapter 2: Digital Sales Growth\n\nIt is clear to everyone, at this point, that Gamestop is looking to move a large portion of its business into the online space. In 2020 Gamestop did $580Million in sales online, and in Q4 alone their online sales represented over 34% of all Gamestop sales; Gamestop did more in online sales in the 4th quarter of 2020 than it did in all of 2019.\n\n&#x200B;\n\n[Gamestop: Online Sales Growth by Year](https://preview.redd.it/rsvos30pneq61.png?width=1530&format=png&auto=webp&s=2edf09bb5bd5d1de86557b06c28b938c4f3dcbd7)\n\nSo what caused this? Ryan fucking Cohen. And he’s just getting started. When we see the sales in 2021 first quarter compared to 2020 the trajectory of this massive shift will become even more apparent. We have only to look at Chewy’s online sales figures under Cohen to project what’s to come for Gamestop in the next few years.\n\n&#x200B;\n\n[Chewy Sales Growth by Year](https://preview.redd.it/apbjgr8vneq61.png?width=1533&format=png&auto=webp&s=3e98cdc7f1b8503d4c5bfca053d4aebf058885a0)\n\nThat’s right, Chewy grew from $205M in online sales to $3,500M (17x) in 3 years under Cohen. \n\nGamestop Announced in it’s Q4 earnings report last week what it’s intentions are... *“Our emphasis in 2021 will be on improving our E-Commerce and customer experience, increasing our speed of delivery, providing superior customer service and expanding our catalogue.”*\n\nWhich brings us to our next chapter on the entire Electronics & Media space in ecommerce -- let's make sense of what potential exists for growth in this sector...\n\n&#x200B;\n\n# Chapter 3: Electronics & Media Sales\n\nIf you ever wondered where Amazon makes all it’s money. Look no further than the category of Electronics & Media (Gaming, computers, electronics, digital media). In 2020 the company did 120.9 Billion in sales, and 54.6% of that fell into this category. There are plenty of other players in this space, but only Apple is close to Amazon’s market share. Here is a chart to visualize the largest players (Gamestop is #10 currently with their 2020 sales, the tiny orange slice):\n\n&#x200B;\n\n[2020 Online Electronics & Media Sales - Gamestop is orange](https://preview.redd.it/3vjkfrk2oeq61.png?width=1526&format=png&auto=webp&s=eda46d2f6f87934f9bb93e606a414bfefd5cbb8c)\n\nAmazon itself projects this space to grow 34.2% in the next two years. Meaning roughly $40B in new Electronics and Media sales will emerge in the online space for these companies to grow into over the next two years. Might be a good time to mention that Gamestop listed GPUs for sale on it’s website earlier this week, and they sold out instantly. With Gamestop doing $580M in online sales in 2020, and most of that coming in Q4 it is safe to say Gamestop is positioned to grab onto this space in a way that will shake Amazon’s growth models for the next two years. Have you noticed how Ryan Cohen is leaning on his Amazon (and Chewy) relationships to pull talent to go after this space. If chewy is any indication, I wouldn’t bet against him eventually grabbing a large percentage, even the majority, of it. \n\nSo let’s get to the fun part… valuation\n\n&#x200B;\n\n# Chapter 4: What is Gamestop Worth?\n\nValuations are a funny thing. Companies are only worth what people think someone else will pay for it in the future. Often we start with fundamentals, but in the end, hype and excitement over growth and continued growth leads to higher and higher valuations. I’ll start with a simple comparison just to prove a point.\n\nGamestop ($12B Market Cap) and Roblox ($36B Market Cap)… we’re all gamers here, right? We know what Roblox is, right? Two completely different companies, but let’s look at the figures anyway and then I’ll get back to comparing GME to the online retail giants. Roblox did $920Million in revenue in 2020 (up from $435Million in 2019), and it’s valuation rose from $4B to $36B. Hmmm… why? Well, it went public. IPO is a great way to hype a stock. Get people excited, maximize valuation, so those angel investors can finally get paid off. So how does this compare to Gamestop (minus the hype of an IPO). Well Gamestop did $6,466Million in revenue in 2020. Yep, seven times what Roblox did? So why the major difference in Market Cap? Well for one, Roblox has very few employees and no stores to spend money on (is this tickling that little feeling you have about Gamestop’s move to becoming primarily an online ecommerce giant, it should be). If Gamestop were valued the same as Roblox, right now… it would move it’s price to approximately $5,157 a share. That’s not a squeeze number. That’s simply an IPO hyped valuation number on growth. Gamestop is moving that direction, minus the IPO, but they are aiming to grow (like Chewy did). \n\n&#x200B;\n\n[Price-Sales Ratio 2020](https://preview.redd.it/3a9vif4boeq61.png?width=1532&format=png&auto=webp&s=ebf42d3b1e53472d42a4d8e70350c9ba91e5cfc3)\n\nSo let’s get a better comparison to the other giants. Apple, Amazon Chewy, Target, Walmart and Best Buy. I’ve chosen these because they represent a wide range of Brick and Mortar vs ecommerce. Price to Sales Ratio is calculated by dividing the company's market capitalization by the revenue, this gives a general sense of how much the market is going to value a company relative to its revenue. Value players (like Buffet) are often looking for the lowest P/S ratio to enter for a fundamentally solid company, and companies with a lot of growth potential and hype can grow their P/S ratio (similar to P/E ratio) to levels that are very high. One thing you’ll notice in this chart. The more online a company is, the higher it’s P/S ratio can go. This directly impacts the Valuation of the company. While companies that may be online, but still rely most heavily on their stores, have a lower P/S because they have a lot of overhead costs. You’ll notice Gamestop in the middle, because it’s transitioning to ecommerce. Last year you would have seen Gamestop with a P/S similar to Best Buy and Walmart. The reason this is important is because as Gamestop grows it’s online business, it’s P/S is likely to rise, and moving to the Amazon level would represent a share price of roughly double what we currently see for Gamestop, while not changing anything about it fundamentals. \n\n&#x200B;\n\n# Final Chapter: Conclusions\n\nOk you’ve been patient, and I told you I’d eventually get to what Gamestop is worth currently, and next year (projection). What the market hasn’t caught onto yet, that we all see in Gamestop is it’s deep fucking value. So what is Gamestop worth, right now?\n\nWell **$191**, that’s what it’s trading at. It’s only worth more, when people see these numbers and get excited about them. The numbers show that Gamestop is growing exponentially with its online sales and Ryan has brought on a team to accelerate that growth. I don’t know what Q1 numbers are, but I can guess a lot of Apes, are really excited about Gamestop, and becoming more and more loyal to its brand. I know I wouldn’t buy anything from Amazon, that I could get from Gamestop right now, even if it costs slightly more. It’s because of quality, and support for the brand.\n\nLots of things are increasing Gamestop’s valuation, but growth of it’s online sales will be the most significant one. What most analysts are ignoring (or simply missing, if I’m giving them some credit) is just how massive Gamestop’s online sales growth were last year, despite the pandemic. If we project Q4 numbers onto 2021, and ignored the dream team Cohen has brought on board, one can expect 3-4 times as much in online sales next year. That will tip P/S higher and people will stop seeing Gamestop as a failing brick and mortar and recognize it for what it is… an Amazon killer, going after an $88B market in Electronics & Media by 2023. On top of that, growing an esports brand (I suspect) that will engulf a $200B annual industry that is likely to only grow to $300B by 2023. \n\nProject these figures onto Gamestop as you’d like. I’ll take a stab at it. Right now Gamestop should be valued at $662 a share, based on it’s Q4 figures and projection into 2021 from it’s finish in 2020 Q4. By this time in 2023, we will see Gamestop at a $50B valuation from $12.5B in sales, and a P/S in the 4.0 ballpark - that puts it’s per share price at $795 - conservatively without hyper on the growth (that you know will amplify that by another factor of 2-3). How do we justify a growth from 580M to $12.5B in two years… Ryan fucking Cohen is how. Multiple current sales by 17. Go back and look at that Chewy graph if you’re wondering how that’s possible. There is a gaping hole in the Electronics ecommerce side of the market, growing. Amazon and Gamestop can both grow incredibly without stealing from one another…\n\nI have another DD in the works on The Squeeze (no dates, no times) and a look at how high we might go (spoiler, there is no accurate answer, but there is a lot to look at, and be excited about to try to make educated guesses).\n\nHere is a teaser… When Volkswagen Squoze, it temporarily became the most valuable company in the world. Gamestop doing the same, would put it’s price north of $31,800 on it’s way to the moon (not that we heard a bell yet as we flew by that mark).\n\nIf you needed one more reason to HODL, it’s this… you will be at least 4 times richer a few years from now, even if you went into a Comma and your wife’s boyfriend lost your password couldn’t get to that sell button on the way down from the squeeze, because at $191 a share, GME is still a deep fucking value play squeeze aside. \n\nAnd if you’ve ever wondered how Phineas and Ferb pay for their projects… I think I figured it out\n\n&#x200B;\n\n[Aha - follow the crotch rocket](https://preview.redd.it/3pxbpp7koeq61.png?width=1299&format=png&auto=webp&s=d2f3a62a73eac63b2faee7cd7698e75dda3c8941)\n\nPlease Be Good To Each Other Out There.\n\nBehind these names we are all humans and we all have our own stories. If you need one more reason to HODL -- I have (had) a terminally ill child (no I do not want anything from any of you) that has a life expectancy of 25ish (she's 9). She survived what was estimated as a 1 in 1000 chance of making it (nine operations and three open heart surgeries as an infant-toddler), which is why she qualified and received a wish from Make-A-Wish (the best damn organization I could have ever hoped for). I have to also give the largest kuddos to this community. On the r/ PoGo board, when I posted about my daughters acceptance by Make-A-Wish to follow her dream of living our Pokemon Go in real life, this community was a critical part of making all that magic come to life. From volunteers who attended the event (400+ costumed members) to connections that got in touch with the animation team in Japan (they drew her a special sketch and all signed the back). Niantic also put UNOWNs of her name into her account after one beautiful soul reached out to someone high up in the org to tell them my daughters story. Why do I bring this up? I want to give my daughter the ability to live out her retirement when she's 18. Travel the world. Experience as much as she can. **If you need one more reason to HODL GME... I'm not selling until I can give her that.** \n\nDon’t lose who you are in the wealth that may (or maybe not) suddenly fall into your lap based on your investing performances. I see mostly fucking amazing souls in this crowd of Apes. Let’s make the world a better place.\n\nNot financial advice. \n\nI don’t know how the stock market works.\n\nI don’t know how companies or their fundamentals work.\n\n**I bashed the keyboard a bunch of times and this popped out.**\n\nThe only thing I know for certain, is I bake a mean crayon pie.\n\nTrying to make Hot Pink a thing in our charting.\n\nWe need more colors.\n\n&#x200B;\n\nCheers. Ape Strong.",
    "title": "DD: Gamestop Price Analysis -- still a Deep Fucking Value under $550",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhchj9/dd_gamestop_price_analysis_still_a_deep_fucking/"
}