{
    "author": "Ren3666",
    "created_utc": 1617207926.0,
    "distinguished": null,
    "edited": 1618480359.0,
    "id": "mh9she",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mh9she",
    "num_comments": 127,
    "permalink": "/r/GME/comments/mh9she/explanation_low_borrowing_fee_put_into/",
    "score": 1922,
    "selftext": "There is some confusion currently going on why the borrowing fee for GME is so low, even though GME is a hard to borrow stock.\n\nSo hard to borrow even, that **three zeros have to follow before the available Float becomes visible** at 0.000111%, only for a short seller to be charged a meager 0.80% borrowing fee.\n\nWhich makes no sense, since this is literally the time to earn money on this Hard To Borrow security, **yet everyone acts humble.**\n\nA stark contrast to TKAT with an available Flot of 0.000168% and a borrowing fee of 543.60%\n\nThanks for the numbers:\n\n[https://www.reddit.com/r/GME/comments/mgo0go/the\\_biggest\\_anomaly\\_in\\_gmes\\_data/](https://www.reddit.com/r/GME/comments/mgo0go/the_biggest_anomaly_in_gmes_data/)\n\nMight as well disable my security lending program in my settings, because I get no money from it anyways.\n\nAngry  as I am, I tried to figure out, who sanded their brain listening to  Cra\\*er, because I need him to adjust the fees before there is nothing  left in-between.\n\nSince many threw around daddy DTCC, I looked into Clearing houses and it´s subsidery NSCC, **but they are actually not the ones who set the borrow fees.**\n\n**Clearing houses only earn their money through:**\n\n**1. Selling Clearing Firm Memberships**\n\nClearing  firms basically make big money by selling memberships to professional  individual traders and corporations. The higher the membership price,   the more rights and privileges the member enjoys.\n\n**For comparison - the selling price for a Chicago Mercantile Exchange, or  CME, membership was $400,000**.\n\nAnd if you thought you can just call them up to get one, **Memberships are actually sold at auctions, with the final price determined at the bidding’s close** and you have to **receive the approval of the clearing firm before you can even own a membership.** Big boii club apparently.\n\n**2. Charging Clearing Firm Members Transaction Fees**\n\nTransaction  fees are usually no more than pennies or fractions of a penny that are  added to the trading costs of each trade. The trading  volume basically  determines how much income the clearing firm makes in transaction fees  for **that day**.\n\nFor example, the Chicago Board of Trade charges  individual members a **transaction fee of 9 cents for every agricultural  commodity futures contract traded**.  If 250,000 corn contracts are traded,  CBOT makes $22,500, which is  250,000 contracts multiplied by 9 cents,  in transaction fees for that  day.\n\n**3. Charging Brokerage Firms Clearing Fees**\n\nA  clearing fee is charged every time an entity such as an individual or  corporation makes a trade. The trader’s brokerage firm is responsible  for assessing and collecting the clearing fees.\n\n**For example, Interactive  Brokers charges a clearing fee of $ 0.00020 for each stock share  traded.** **The clearing fee for trading 100 shares is 2 cents (100  multiplied by $0.00020).**\n\nThe brokerage firm lists the amount of the  clearing fee separately on the trader’s brokerage statement and **is imposed no matter which brokerage firm the trader uses.**\n\n[https://yourbusiness.azcentral.com/clearing-firms-make-money-26535.html](https://yourbusiness.azcentral.com/clearing-firms-make-money-26535.html)\n\nNow  the thing is, as important as clearing houses are to guarentee that  transactions go through, if it´s about your money, some people barely  entrust others with it, **if they can**, which is called **self-clearing**.\n\nMeaning that **some brokers** have **their own clearing firm** **while others use a third party to clear transactions.**\n\nNow  that we know that borrowing fees are not in the Clearing House business  model, who can I throw my poo-poo at? Well...actually I don´t have  enough to throw at everyone. Maybe someone could help me out, because  it´s actually **several entities under one roof**, so we can just dump it from there. Conveniently the door to the roof is already open, I wonder why.\n\n**Why is that important?**\n\nBecause it is actually brokers, who lend out your shares and set the borrowing fee. **But what if you had a broker, who also acts as their own clearing house?**\n\nDrum Solo please!!\n\n&#x200B;\n\nhttps://preview.redd.it/p9gl9rk04eq61.png?width=886&format=png&auto=webp&s=51ed4a37a74117140ecc88901fa5448a833477d0\n\nSome were missing from the list so I added them here:\n\n1. **Goldman Sachs Execution and Clearing LP**\n2. **J.P. Morgan Clearing Corp.**\n3. National Financial Services LLC\n4. **Pershing LLC**\n\nAs you can see though, some outright own their own clearing houses through subsidiaries.\n\nBacktracking  to the DTCC in other words, they are only acting as a 3rd party  clearing house for it´s members. They are not a broker.\n\n**Now the f\\*cky part - Who benefits from low borrow fees and why would they do that?**\n\nThere are actually only a few entities and reasons why anyone would do it:\n\n1. Take out competitors\n2. To get a message across\n3. Just cause\n\n**1. Take out competitors**\n\nYou probably thought I would talk about Hedge Funds and while this may be true, **the real bag holder is not some tiny Citadel boii, it´s actually DTCC itself.**\n\n**You  thought only we hate monopolies? Then let me tell you, this is not only  a once in a life-time chance for us, this is a full blown war of  numbers.**\n\n**Citadel was not even remotely the target. They only served as entry door for the real battlefield.**\n\n&#x200B;\n\n[\\*\\*\\*](https://i.redd.it/zmw8lr554eq61.gif)\n\n[https://www.reddit.com/r/GME/comments/m8golp/order\\_book\\_lvl\\_2\\_vs\\_lvl\\_3\\_vs\\_lvl\\_4\\_vs\\_lvl\\_5/](https://www.reddit.com/r/GME/comments/m8golp/order_book_lvl_2_vs_lvl_3_vs_lvl_4_vs_lvl_5/)\n\n\\*\\*\\***Amazon ticker in 1/10th of a second** with 100,000 quotes/sec (107 in a millisecond)\n\n**And the most likely competitors/clearing houses who are up to snuff to put a dent into the DTCC are:**\n\n\\- Perishing LLC, a subsidery of \\*\\*BNY Mellon (\\*\\*The Bank of New York Mellon Corporation) with 42.2 trillion **A**ssets **U**nder **M**anagement\n\n\\- **BlackRock Inc.**  ($8.67 trillion AUM - Mutual Fund)\\*\\*\n\n\\- **The Vanguard Group** ($6,3 trillion AUM)\n\n\\- \\*\\*J.P. Morgan Clearing Corp. (\\*\\*$2.988 trillion AUM)\n\n\\*\\*The  only reason I put BlackRock up there is because they served as key to  open the door, since Vanguard and BlackRock more than likely prepped  Ryan Cohen to get on board of GameStop and provided him with the voting  power to kick out the previous board members.\n\n**2. To get a message across**\n\nMany  said that, whoever sets these borrow fees up may have the intention to  lure in more short sellers to mitigate the damage once this goes off.\n\nAnd while the fee may be automatically calculated through the system, it can always be tinkered with **manually by Brokers that not only lend the stock, but also act as their own clearing house** by feeding the system with their own data.\n\n**But I think this is not the case. They don´t want to lure in short sellers.**\n\nTo quote an E-Mail from the former Merrill Pro president, Thomas Tranfagliain in 2005:\n\n**“We  are NOT borrowing negatives… I have made that clear from the beginning.  Why would we want to borrow them? We want to fail them.”**\n\nTrafaglia, in other words, didn’t want to bother paying the high cost of borrowing “negative rebate” stocks. **Instead, he preferred to just sell stock he didn’t actually possess.**\n\n[In-depth explanation of the rebate rate - Thanks to u/karasuuchiha for the Link](https://www.reddit.com/r/GME/comments/mgva26/gme_borrow_rates_do_reflect_a_hardtoborrow/?utm_medium=android_app&utm_source=share)\n\nThat is what is meant by, **“We  want to fail them.” Trafaglia was talking about creating “fails” or  “failed trades,” which is what happens when you don’t actually locate  and borrow the stock within the time the law allows for trades to be  settled.**\n\n**And  that´s the thing. If the borrow fee is too high, Market Makers may be  tempted to lend & create new shares without first locating them,  since the borrowing fee makes the ticker unattractive for their clients, but also impossible to sustain their leveraged margin accounts.**\n\n[https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/](https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/)\n\nThanks to  [u/bobfern37](https://www.reddit.com/user/bobfern37/) for the Link\n\nIn other words, someone is so f\\*\\*cked, that he is trying to tell Market  Makers (MM) through numbers to please locate their shares first before they lend them out to short sellers, **since they won´t earn anything by creating and borrowing new shares anyways.**\n\n**Brokers will be even belly up, if they are forced to foot the bill of their leveraged Hedge Fund Clients, which makes these borrowing fees a two-way statement.**\n\n**Which now brings us to the one, who benefits the most from this not to escalate any further:**\n\n\\- Chicago Board Options Exchange (CBOE)\n\n**The  ones, who more than likely wrote the most naked shorts and who will be  left burried in bags, since Citadel more than likely \"covered\" their  shorts through options before the Market opened on the 27th January  fully knowing that the price of GME drives up, yet being unknown to the  CBOE. And re-shorted an even greater amount all the way down to $5, once they knew ahead of time & saw themselves confirmed that the buying pressure for GME was guarenteed to dry up.**\n\nWhoever feels guilty probably never  thought, that everyone would hold onto their GME shares, which is why  they buried themselves into even more naked shorts, since GME at that  time was already at visible 140% short interest.\n\nIn other words to short it from all the way up they created even more, which is why I think that Long Instituions hold the (option\\`s) price of  GME at Max Pain, so that short sellers cannot prolong or recuperate their losses.\n\n**3. Just cause**\n\nYou probably thought the Joker was in 2. but he is actually here.\n\nWhile everyone is playing Colosseum, there are always some who watch from the sidelines.\n\nAnd it´s more than likely **Financial Authorities.** Regulators, who usually join the upper echelons of the very companies they were meant to control once they retire.\n\nAnd  I don´t mean Secretary of the Treasury Janet Yellen, she is still a  crook. She would poledance for Kenny, if her age would still allow it.\n\n[https://www.reddit.com/r/GME/comments/lutpdt/financial\\_authorities\\_and\\_gme\\_01032021/](https://www.reddit.com/r/GME/comments/lutpdt/financial_authorities_and_gme_01032021/)\n\nIt  is politicians, who cannot allow themselves to end their career just  yet, since the proportions of this case ended up so big, that America  would suffer serious international repercussion and a loss of their  market integrity, if investors were openly stolen from.\n\nNot  only would this weaken trust in the USA, but also their standing and  pave the way for foreign entities to seize Americas place in several  regards, which is why even if the most infested politcian seethes to pay  off their 6th Lambo, they cannot accept the money currently, since  our new President is just starting out. **That  is the only reason, and the only reason why we should be grateful that  this ended up being an international problem, since none of the above  mentioned would have ever moved, if international investors were not  involved.**\n\nAnd this is  literally the first and last very rightest timing and rightest place for  you to be, so don´t sell your shares for low. You will never get this  chance again.\n\n&#x200B;\n\nAn edit that is worth it - Shout-out to u/UEAMatt & u/sethmc712 for being at the right place at the right time\n\nhttps://preview.redd.it/iidazrx88fq61.png?width=817&format=png&auto=webp&s=422a2905d1d5639770398788ec8eb5a814f172f1",
    "title": "Explanation - Low Borrowing Fee put into Perspective (Once in a life-time chance)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mh9she/explanation_low_borrowing_fee_put_into/"
}