{
    "author": "RichHodler",
    "created_utc": 1617251675.0,
    "distinguished": null,
    "edited": 1617269498.0,
    "id": "mhnn3i",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_mhnn3i",
    "num_comments": 465,
    "permalink": "/r/GME/comments/mhnn3i/more_evidence_of_the_everything_short_this_is_huge/",
    "score": 6296,
    "selftext": "This post is regarding the link on Michael Burry's Twitter. It is a long read, but I have found some parallels with [The EVERYTHING Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/). Really recommend reading the whole thing it if you have time.\n\nRead it here: [https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm)\n\nDisclaimer: I am not a financial advisor. This document was published in December 2018 and the author has a PhD in Finance, so a real wrinkly brain. (Although it is a bit outdated, the information is insightful and Michael Burry is leading us to it)\n\n**So what sticks out to me:**\n\n1. &#x200B;\n\nhttps://preview.redd.it/18s07nx4lhq61.jpg?width=294&format=pjpg&auto=webp&s=4f86ce49c15ff2eccf34d031e0129ee09c42aae8\n\n2.\n\nhttps://preview.redd.it/0jrlxae7nhq61.jpg?width=319&format=pjpg&auto=webp&s=8b98e4ede6f06ef8562d6c039c5e138b88ace48b\n\nDid I read that right, 7 times as many treasury security backed assets as they own!?! and this is just 2018...\n\n3.\n\nhttps://preview.redd.it/522gn9j8nhq61.jpg?width=408&format=pjpg&auto=webp&s=f963eceba95828408aba0ce2391f43b738cdd3ed\n\nSo this part about the eSLR rule is interesting, but it didn't hold up. Next I will show some 2020 data from the same author which shows the collateral multiplier back up around 9 in April 2020.Source: [https://www.federalreserve.gov/econres/feds/files/2020103pap.pdf](https://www.federalreserve.gov/econres/feds/files/2020103pap.pdf)\n\n&#x200B;\n\nhttps://preview.redd.it/e8h5xnu1ohq61.png?width=697&format=png&auto=webp&s=a334a1c4d758f5364a51f8f61362d7f6f271e74f\n\nhttps://preview.redd.it/m3vkyi49ohq61.png?width=648&format=png&auto=webp&s=f5e2c2dab4e6145fcc80504ebf97585d100bfaaf\n\nNotice collateral multiplier is defined as the ratio between the black line (U.S. Treasury SFTs) and the red line (non-rehypothecated).\n\n&#x200B;\n\nCould a much smarter ape like u/atobitt give some insight here? This looks huge, but I don't completely understand what I'm looking at here.\n\nSorry if it's a bit rushed, I wrote it during my lunch break. I'll respond to comments later.\n\n&#x200B;\n\nEdit 1: Great analysis from u/weeknddev \n\n>7x leverage on encumbered capital and more than 85% is rehypothecated. This is like taking 85% of the same banana until there is no banana left. I would suspect that 7x exposure is low. Why?  \n>  \n>Those who do not exceed 700b in capital only have to report monthly as of this publication. That means at any given time they could be several factors more rehypothecated betting like fucking degenerates. And like in other posts because their money comes from derivatives, they are able to sell them and make out like bandits. Truly bandits.  \n>  \n>Since we effectively blocked their get out of jail free card by holding so damn hard they cannot come up with those rehypothecated shares. They are beyond fucked .. but we might be too.\n\nI do however think we will be okay. GME is probably the best thing to hedge against everything crashing.",
    "title": "More Evidence of the Everything Short, this is huge",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhnn3i/more_evidence_of_the_everything_short_this_is_huge/"
}