{
    "author": "Houstman",
    "created_utc": 1617183140.0,
    "distinguished": null,
    "edited": false,
    "id": "mh2erf",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_mh2erf",
    "num_comments": 274,
    "permalink": "/r/GME/comments/mh2erf/the_true_market_cap_of_gme_120_billion_or_more/",
    "score": 4334,
    "selftext": "When you click on your stock ticker and get the market info for a stock like GME, the fact sheet does a simple calculation of the ~70 million physical shares and multiplies it by the current traded price to get the market capitalization figure. Right now that sits around $13 to $14 billion.\n\nThere is a problem with this number: naked shorts.\n\nNaked shorts dilute the market and drive the price for a stock down, but all those naked counterfeit shares trade exactly like real shares. This means we need to think about the market cap as actually encompassing all the traded shares out there.\n\nLots of DD is done trying to estimate just how many shares are being claimed beyond the float (which is about 45 million), and short interest in FINRA and Bloomberg puts institutional claims anywhere from 100 to 200 million shares, and the number in retail hands is anyone's guess (my guess is way beyond 100 million). Then we see the squirrely shenanigans of the OTC market where GME should not be trading, but is, at a rate of billions of shares a week (dozens of times the volume of GME on the NASDAQ and NYSE).\n\nMy original [screed](https://www.reddit.com/r/GME/comments/lzgjmb/my_typofilled_twitter_thread_on_gme_backstory_has/) describing the GME situation to the layman from about a month ago roughly estimated the top-end of those naked shorts to be in the 500 million territory... I may have been really conservative in that estimate. Others have shown that the total claimed shares may be 900% to 1200% (so 600 to 800+ million shares). George Calhoun pointed out that in three days in February [10x the float was traded in insane volume](https://www.google.com/amp/s/www.forbes.com/sites/georgecalhoun/2021/03/10/gamestop-the-second-surgeanatomy-of-a-gamma-swarm/amp/) that he, as an economics professor has never seen happen with a stock. Heavy days where a normal stock goes madly volatile might see 20-30% of its float trade hands. GME regularly sees volumes in excess of 100% of the float in one day every few days! What we do know is that more and more naked shares are created every day and no one is closing those positions. These numbers will only increase until the margins are finally called.\n\nThis is remarkable for one thing: Apes don't sell. All we have done is add millions of shares a week to our holdings and ignore the norms of the market.\n\nSo, if we want to calculate the *true* market cap for GME, we need to calculate the assumed claimed shares multiplied by the current price:\n\n500 million shares at $200 is a market cap of $100 billion.\n\n1 billion shares is a market cap of $200 billion.\n\nWhat this means is the actual value of each physical, legit share of GameStop is currently worth $1400 to $2800 a share pre-squeeze!!\n\nWhat we don't know is who actually has physical shares. We don't know if we bought the real thing or counterfeits created by the naked shorting assholes. But right now, the floor price for GameStop after we make our millions in the MOASS, and the dust settles and GME is back to an actual float of around 45 million shares, means that the floor for this stock post squeeze is still well over $1k a share!",
    "title": "The true market cap of GME $120 billion or more",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mh2erf/the_true_market_cap_of_gme_120_billion_or_more/"
}