{
    "author": "SpaceCooper",
    "created_utc": 1623371554.0,
    "distinguished": null,
    "edited": 1623403760.0,
    "id": "nx2ylo",
    "text_only": true,
    "flair_text": "𝘜𝘯𝘷𝘦𝘳𝘪𝘧𝘪𝘦𝘥 𝘋𝘋",
    "name": "t3_nx2ylo",
    "num_comments": 241,
    "permalink": "/r/DDintoGME/comments/nx2ylo/guys_i_think_i_found_something_regarding_gmes/",
    "score": 1918,
    "selftext": "**Edit:** Some people pointed to u/dlauers [comment](https://i.redd.it/a0f4ruqh9i471.png). Still considering the membership move as bullish one, though.\n\nI can’t post on superstonk (karma) therefore I try this platform. This is my first DD and I am open to criticism and hope that wrinklier brains than mine can review this finding. \n\nI was wondering about the news of the Russell 2000 departure. \n\nI strongly believe that the whole market is involved in one way or another in these shenanigans. Either on the side of the shorts or on the side of the stock, of course there are plenty other parties caught in between. However this is about the big player. \n\nIf we assume that everyone is complicit why would the company behind Russell index decide to transition GME from the Russell 2000 to 1000. I know that if you look at the [high, low and avg. market cap](https://www.ftserussell.com/research-insights/russell-reconstitution/market-capitalization-ranges) GameStop became simply to big for the Russell 2000. \n\nBut I argue that if the Russell index or better the company behind it was on the short side of this fight, they would have done everything to prevent or at least delay this event as long as possible. \n\nThat’s where I started to look into the Russell index: \n\nIntroducing the [Russell 2000](https://en.m.wikipedia.org/wiki/Russell_2000_Index)\n\nTo quote Wikipedia:\n\n*The Russell 2000 Index is a small-cap stock market index of the smallest 2,000 stocks in the Russell 3000 Index. It was started by the Frank Russell Company in 1984. The index is maintained by FTSE Russell, a subsidiary of the London Stock Exchange Group.*\n\nRussell Investment, who founded the index, was bought by the London Stock Exchange Group in 2014. \n\nIf you click on the “Frank Russell Company” link in the article you get directly redirected to the [LSEG article](https://en.m.wikipedia.org/wiki/London_Stock_Exchange_Group) even though [Russell Investments](https://en.m.wikipedia.org/wiki/Russell_Investments) has its own Wikipedia article.\n\nBut back to LSEG. They are in fact a publicly traded company, so let’s have a look at the biggest shareholder of the company:\n\nhttps://i.imgur.com/K5HqCrG.jpg\n\nBlackrock. \n\nIf we assume Blackrock is on the long side in this whole deal (which we can fairly do), it would make sense to transition the stock from one index to another to force the SHF to cover a significant amount of shares shorted through ETFs. \n\nIt is a battle of the big players, while retail is a force to be reckoned with, we are still a sailing boat fleet between two clashing storms. All we can do is to buy and hold on for our dear lives. Soon will the tendieman come. \n\nSpaceCooper out. \n\nPS. I won’t be able to read comments, since it’s 2.30 in the morning here and I have to get up soon.",
    "title": "GUYS! I think I found something! Regarding GME‘s transition to the Russell 1000",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nx2ylo/guys_i_think_i_found_something_regarding_gmes/"
}