{
    "author": "teacoat___",
    "created_utc": 1621978332.0,
    "distinguished": null,
    "edited": 1622039329.0,
    "id": "nl0lk1",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nl0lk1",
    "num_comments": 918,
    "permalink": "/r/Superstonk/comments/nl0lk1/gme_token_info/",
    "score": 8051,
    "selftext": "I thought I'd summarize some information about the juicy morsel of information that was just discovered. I will try to keep it to information rather than opinion. \n\nAs has been rapidly circulating online, [https://nft.gamestop.com/](https://nft.gamestop.com/) was discovered. **This site is real and official. You cannot fake a subdomain.**\n\nIt has a curious little thing of numbers and letters near the bottom\n\nhttps://preview.redd.it/jhk5pvou3c171.png?width=536&format=png&auto=webp&s=6e7761eb55c1edbf3486a4494369673abd4e0e6a\n\nThose who aren't in crypto might not know that this is a an ERC (etherium) address. If we plug it into etherscan we get... [https://etherscan.io/token/0x13374200c29c757fdcc72f15da98fb94f286d71e](https://etherscan.io/token/0x13374200c29c757fdcc72f15da98fb94f286d71e)\n\nhttps://preview.redd.it/auq83ic24c171.png?width=1417&format=png&auto=webp&s=3e2eec1c0422df770769531e5c86a0cc3ce170d2\n\nWhat is this! **A GME crypto token!**\n\nI had one of my crypto friends look into the code, he found this:\n\nhttps://preview.redd.it/z8iptat44c171.png?width=1338&format=png&auto=webp&s=6afca582e1f6a054216d8a4d4187d9c9a720b03e\n\nlaunchDate is a unix timestamp, which again if you are unfamiliar with this stuff might not mean anything to you. If we convert this:\n\nhttps://preview.redd.it/vxzck7yc4c171.png?width=758&format=png&auto=webp&s=5250ba997c7d3fcc11218efec929e60d42686e16\n\n**Wed Jul 14 2021 11:20:00 GMT+0000 is the launch date for gme crypto.**\n\n(opinion: I think that is just the date that you could publicly purchase the tokens! I believe they would distribute a dividend of them before they were available for purchase, because the thing that forces **ALL** shorts to **HAVE** to cover is the token being unavailable to acquire.) \n\n*But what could this mean? Some ideas...*\n\nGME is going to pull an [overstock-style crypto dividend](https://www.marketwatch.com/story/overstock-founder-tried-to-squeeze-short-sellers-then-sold-out-when-the-sec-cracked-down-2019-09-19), which if executed correctly would force all shorts to have to cover, no margin call needed.\n\n\\--and/or--\n\n    >GME Launches NFT platform \n    >Digital Game licenses w/ reselling\n    >All publishers want in because of permanent smart contract returns for peer-to-peer trade of the digital copy in perpetuity\n    >GME is the steam killer\n    >Fundamentals primed for moon\n    >Shorts have to cover\n\n\\--and/or--\n\nGME token backed skin marketplace, plays well with the idea of pre-order and retailer specific skins\n\n\\--and/or--\n\nA user suggested they could somehow use blockchain to curb console scalping, if so maybe even graphics cards? \n\n\\--and/or--\n\nBeing able to play a game in any launcher? Or without any launcher. Open source launchers? \n\n\\--and/or--\n\nAnti-piracy by requiring a linked NFT game ownership\n\n\\--and/or--\n\nCross game avatar/identity \n\n\\--and/or--\n\n*NONE OF THE ABOVE - MANAGE YOUR EXPECTATIONS!*\n\n\\--and/or--\n\nlets hear your ideas!\n\ni liek dis stock\n\n&#x200B;\n\n&#x200B;\n\nEdit: another bit of info, this screenshot has been floating around. Note the source code block at the bottom. [link](https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e#code)\n\nhttps://preview.redd.it/t9rza7pq7c171.png?width=1397&format=png&auto=webp&s=273f483c1ad4156c429f1c5c81bf726b4b74e669 \n\nedit: Also, if you haven't found it, there is a tinnnnny little dot next to the header on the [nft.gamestop.com](https://nft.gamestop.com) website. If you click it, you get to play a game where you are a cat on the moon. Can't make this shit up.\n\nhttps://preview.redd.it/twuyo1wddc171.png?width=682&format=png&auto=webp&s=91d7b5d12d9c6d3df544de70d7574a560e24e561\n\nedit2: someone made this connection\n\nhttps://preview.redd.it/8ktikbw8fc171.png?width=1834&format=png&auto=webp&s=0e593cf209b24b0764c25708a769ac3be8c831a2\n\nEdit3: this guy is the head of blockchain at Gamestop, give em a follow! https://twitter.com/finestonematt/status/1397309790964047872?s=19\n\nHe tweeted this **VERY** interesting tweet https://twitter.com/finestonematt/status/1395051881844592641?s=19 \n\nEdit4: I crawled through the game and website code and found no additional information hidden in there\n\nEdit5: From a message: The French National Day is the anniversary of Storming of the Bastille on 14 July 1789,[1][2] a turning point of the French Revolution,\n\nCanada Vancouver, British Columbia holds a celebration featuring exhibits, food and entertainment.[31] The Toronto Bastille Day festival is also celebrated in Toronto, Ontario. The festival is organized by the French community in Toronto and sponsored by the Consulate General of France. The celebration includes music, performances, sport competitions, and a French Market. At the end of the festival, there is also a traditional French bal populaire.[32]\nRyan is from Canada, and if he is from a French province, then well maybe its a favorite holiday of his.\n\nIf anyone finds any inaccurate info or corrections please let me know!",
    "title": "GME Token Info",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nl0lk1/gme_token_info/"
}