{
    "author": "matthegc",
    "created_utc": 1627831486.0,
    "distinguished": null,
    "edited": 1627859410.0,
    "id": "ovu2wa",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ovu2wa",
    "num_comments": 415,
    "permalink": "/r/Superstonk/comments/ovu2wa/be_smart_ape_dont_fall_into_the_political_trap/",
    "score": 7176,
    "selftext": "Let’s avoid the political topic…as everyone saw over the last 5 years it has the ability to tear families apart.\n\nLet’s put that aside and focus on the MOASS.\n\nIf the sub starts going down the political route we are doomed.\n\nFor all we know Shitadel et al. only offered money to certain party Congressman to create the divide in apes.\n\nThink about it.  What better way to destroy the camaraderie among apes than to make the MOASS and GameStop political.  It’s their last ditch effort that we would never see coming.\n\nApe don’t fight ape has never needed to be remembered more than right now.  This is a divide and conquer tactic and a massive trap for 🦧.\n\nBe Smart. Don’t fall into the political trap.\n\n🙌💎🦧🚀🌚\n\nEdit:  for those apes that have interpreted my post to mean something different than I had intended.\n\nPoliticians should be exposed. period.  It was the partisan debate that started forming that we all know leads to know where.\n\nThe “political trap” that I reference is the divide that natural happens when people start infighting and not realizing that politicians want us to do exactly that. Fight amongst ourselves. \n\nLet’s not do that.  The prize is the MOASS. \n\nStay vigilant and focus on the common thread of why we are all here.",
    "title": "Be smart Ape. Don’t fall into the political trap being set. Focus on MOASS.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovu2wa/be_smart_ape_dont_fall_into_the_political_trap/"
}