{
    "author": "HomeDepotHank69",
    "created_utc": 1622077898.0,
    "distinguished": null,
    "edited": 1622078150.0,
    "id": "nlwb0a",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nlwb0a",
    "num_comments": 365,
    "permalink": "/r/Superstonk/comments/nlwb0a/important_note_on_ftd_cycle_from_hank/",
    "score": 6174,
    "selftext": "Apes, this is going to be an extremely quick post. I'm sorry that it won't include anything super funny or anything too in-depth but this is extremely important and I had to get it out now.\n\nI am currently constructing a DD and would've put this message in that DD but this was too urgent and too important to wait (I will be posting that DD this weekend). Ok, so as many of you know, GME is currently fucking the shorts. You've probably noticed that my FTD cycle prediction model was correct again (every 35 calendar days or 21ish trading days). Though I fully believe that yesterday's price action was from the FTD cycle, today's price action got me thinking (and erect). Normally, we do not see a huge rise on the day after the FTD cycle day like we did today. So, what I'm thinking it either a. they threw in the towel or got margin called (.1% chance that's the case cuz it would've rocketed up), or b. they are trying to make a little frenzy right now so apes sell before earnings and the annual meeting. IMO they might be trying to get the price up a little so apes either take their money now or so they can do another one of those monster short attacks like we saw in March.\n\nI believe that they might be doing this because the annual meeting is likely to have a SHIT TON of good news (that nft shit is the first one and they haven't even confirmed it). My next DD talks, in part, about how GME is consolidating to earnings and that if there is a good announcement on earnings, which is likely, the squeeze could start. SO PLEASE REMEMBER, that even though the price is excellent today it could be the result of manipulation to try to get apes out before the real show starts. The dawn of war is upon us, retards. Be prepared for some fucked up shit. As always.... stay motherfucking strong, apes.\n\nEdit: anyone else think it's hilarious how much financial media is downplaying this? Really? It almost $100 in two days on no news and retail buying alone? I love how they won't even consider manipulation.\n\nTHIS IS NOT FINANCIAL ADVICE, I AM NOT A FINANCIAL ADVISOR, I AM A FUCKING PRIMATE.",
    "title": "IMPORTANT note on FTD Cycle from Hank",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nlwb0a/important_note_on_ftd_cycle_from_hank/"
}