{
    "author": "Elegant-Remote6667",
    "created_utc": 1628440386.0,
    "distinguished": null,
    "edited": false,
    "id": "p0hvgj",
    "text_only": true,
    "flair_text": "Resource 🔬",
    "name": "t3_p0hvgj",
    "num_comments": 351,
    "permalink": "/r/GMEJungle/comments/p0hvgj/update_to_i_did_a_thing_to_all_shills_your_time/",
    "score": 2720,
    "selftext": "Hello everyone, \n\nape historian here.\n\nNow usually this sort of title would definitely be classed as \"click bait\", but this time around its not. I decided to start documenting the subreddits that have anything to do with GME.\n\nI then realised that to prove / disprove brigading, spam, authors purposefully reaching out to other subs and spreading the subs names, we have to actually find a way to read all that. \n\nSo thats what i did: I now have the last \\~3 years of reddit data, both posts and comments. This has achieved 2 primary things.\n\n# The data: a small intro / rant\n\n1-we now have data to prove / disprove / find facts and fud that was spread.\n\n2-The purpose of this work is that it can be completely verifiable by anyone who wishes to recreate the analysis, if they ever wanted to confirm that the files that I have downloaded are legit reddit files and not randomly made up files. \n\nand 2.1 - I have lost  a tiny bit of faith if anyone tries to build a reddit bot for any reason and then turns around with:\n\n \n\n[\\\\\"We DoNT haVE enOUGh DaTa to do X,Y,Z\\\\\".](https://preview.redd.it/gydwfyv1g5g71.png?width=259&format=png&auto=webp&s=9980eaf88689b6c2d37ec83928296464a5840798)\n\nslightly off topic but if you dont have enough data at this point it can mean three things:\n\n1. You are using outdated hardware and dont wish to upgrade\n2. You have not done the research when it comes to large scale projects and dont want to look\n3. you are cutting major corners / are lazy / dont want to look for better solutions\n4. the bot you are building doesnt do what you say it does.\n5. the bot you are building is limited by an api limit that you dont control\n\n**For those who are intersted- my rig that was used to create these datasets:**\n\nFrom my understanding, my rig would be considered \"pretty powerful\" and at the cusp between \"gaming pc\" and  and workstation/server grade performance, but certainly still affordable by many and not outside the realm of hobbyists and gamers.\n\n**Storage**\n\nThe entire analysis, and all the data are stored on an ancient hp microserver, which is now 11 years old. The data lives on 5 drives and 2 ssd arrays, depending on the speed of data access required. i backup weekly now, as the project is several TB large at the moment.\n\n**Ram:** 64gb DDR4, 2TB nvme as swap  (with heatsink), in those moments when i ran out of RAM. may upgrade ram later, not sure.\n\n**Cooling:** my pride and joy - noctua heatsink NHD15 (with twin noctua fans and with mx2 thermal paste for cpu), with 4 bequiet fans for intake (1 for exhaust). The entire system was designed that in case of catastrophic failure and loss of both cpu fans and half the intake fans, the system would not overheat. Indeed, the highest temps i've seen were 82c in a 32c room (heatwave). **for anyone building a new pc post moass can definitely recommend this cooling setup - it really really works.**\n\n**Processor:** ryzen 3700x 8 core (16 thread): i actually got a very nice unit as it benches about 15% faster than the average benchmarks, and if i spin up all fans to max (jet engine sounds) then its 15-20% faster still. No overclock.\n\n**Case:** fractal design define s with sound deafening panels, not the glass side wall edition.\n\n**GPU: GTX1660:** by no means the most powerful card, I got it to guarantee that it will drive my monitors with no issues. In fact it rarely spins up its fans as i don't really use it much \n\n**Powersupply:** ~~bequiet darkpower 11 pro~~  (somewhere in germany under warranty repair by now). its replacement is the bequiet dark power 12 850W.\n\nLet me know in the comments what you think - i am pretty sure people will have much more powerful rigs at their disposal,  especially if you do video work or simulations. I originally built this rig to get better at programming and data analysis but realised it can do so much more.\n\nCue sexy ass charts as below:\n\n[8tb read in. 8tb... so far.](https://preview.redd.it/bvqpnqp6j5g71.png?width=1089&format=png&auto=webp&s=02f425694a98758c854c4852001023230e664354)\n\n&#x200B;\n\n# Getting to data availability for our research: posts and comments\n\nDear shills. I know you have been posting fud around multiple reddits. I also know , that if the discussions between the normal people are correct you have indeed been brigading multiple subs across reddit to try to get the voices of retail shut down. well, i have something to say - your move bieatches, we have you on \"camera\" so to speak.\n\n&#x200B;\n\n**Posts:**\n\n[yes thats millions. Millions of posts per month.](https://preview.redd.it/jkdpdlemj5g71.png?width=274&format=png&auto=webp&s=7017d58af5a781bed0975ac1fa45df538e81d8bd)\n\n&#x200B;\n\n[710M posts. likely a lot of crap but once cleaned, might be interesting.](https://preview.redd.it/avvomenej5g71.png?width=236&format=png&auto=webp&s=1a8f93217510f68e1538b4abc14c2733d34ed906)\n\nacross all our beloved  subs that are related to GME - we have: \n\n&#x200B;\n\n[just about 5mill posts. this includes wallstreet bets, all the variations, all the variations of gme, and of course all the other subs that i have discussed in my previous post. whats also included is variations of investing subs. because it would really be very interesting to see the sentiment for GME between subs and see how it changes over time.](https://preview.redd.it/szf2crdlk5g71.png?width=274&format=png&auto=webp&s=fd8f002770818574cf1892502d297d81e021d28d)\n\nFor those of you who got this far, thank you. THis has taken a significant ammount of time and i wouldnt want it all to go to waste.\n\nLets summarise, mostly for me, what we have:\n\n* Posts for the last 2 odd years, starting from april 2019, loaded in and ready for analysis.\n* Comments for the same time period are being loaded in as we speed right now: these arent small files by the way: each month worth of data is approximately 100-120gb for posts and at the very least as much for comments.\n* historic data and links from reddit, with good coverage up to End of July 2021.\n\nThis gives me some interesting capabilities and may provide some interesting insights here.\n\n**Update on comments availability:**\n\n&#x200B;\n\nhttps://preview.redd.it/e410cblzl5g71.png?width=300&format=png&auto=webp&s=d311f309914395976ed72df8e72e1a69b12f8e75\n\nThe work for comment data is in progress but so far, ill update the final numbers as i know more. We have around 60 millions across gme related subs and what is starting to look like a Billy or maybe even 2 across other subs.\n\n# Main advantage of this: a complete library of all the DD, all the links, all the metadata, all the memes, all the shill posts and comments, did i mention memes and shitposts? \n\n* First obvious point: i can finally see all comments and posts that DFV and others have written for the last 3 years.\n* second obvous point: i can see how authors who post interact with comments and in what way? do we actually have evidence of shills karma whoring their way up the chain only then to spread fud?\n* third point: need i say that this is an exciting project for me?\n\n# There are a few fun things we can do here once we have this much data (all of these are currently in development at very early stages):\n\n**fun idea 1:SHILL alert!**  do you suspect an account of being a shill but cant prove it because you dont want to travl through 1000 posts and comments. well in theory if a method can be detected to identify shilldom, its now possible to query usernames by posts and comments to see what and about what they post.\n\n**fun idea 2:** I should now have most posts across our beloved subs and across reddit. we can now see if indeed authors were crossposting and brigading across differnt subs - lets politely warn those and after name and shame and ban from the sub. no need for fud spreading or any other sort of damage.\n\n**fun idea 3:** In theory, since we have all the comments, and all the posts, we will be able to see if the same types of users reply to particular types of posts- ie we may be able to either detect forum sliding or a group of users madly commenting on a post to bring it to the top. now these users will both be great community users and shills and bots - but since we have the data and past comments, eh, we will hopefully be able to verify who is who.\n\n**fun idea 4:** since shills will most likely try to obfuscate the links that they are spreading, like [this here](https://example.com), it may be fun to see all the authors who have posted about the ape book history month, google docs links that may be useful but may also dox, random spam links of there is any and so on and so forth.\n\n**fun idea 5:**  i am only aware of the 5 odd subs that discuss GME. who else discuss / discussed gme? do we want to have a list of everyone who posted and commented on GME meltdown? maybe, maybe not\n\nThis weekend has gone by way too quickly but i have made decent strides towards uncovering all the shillery.\n\nAny comments, please do shoot them here below:\n\nPS: if you still want memes, the two torrent links are here: if you are going to download them - please seed so everyone can see the hilarous memes. i will now be updating it with all other memes that i may have missed from other posts. my next update will be just the first 50k / 100 k memes in total. not everything.\n\nmagnet:?xt=urn:btih:05df0c8603753cb57a5a658aba4dd88739494910&dn=allthememes%5Fpictures\n\nmagnet:?xt=urn:btih:07d6a19333a66d158356f0514e2714de0bf2d6ee&dn=allthememes\n\n&#x200B;\n\nApe historian",
    "title": "Update to \"i did a thing\": to all shills- your time is numbered. I have the last 3 years worth of reddit data.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p0hvgj/update_to_i_did_a_thing_to_all_shills_your_time/"
}