{
    "author": "pinkcatsonacid",
    "created_utc": 1623097246.0,
    "distinguished": "moderator",
    "edited": 1623098281.0,
    "id": "numi3i",
    "text_only": true,
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_numi3i",
    "num_comments": 1107,
    "permalink": "/r/Superstonk/comments/numi3i/the_jungle_beat_monday_06072021_2_days_til_annual/",
    "score": 5493,
    "selftext": "*This piece will be posted at 4:20 pm NYSE time every trading day!*\n\n&#x200B;\n\n[u\\/bye\\_triangle u\\/pinkcatsonacid u\\/leaglese u\\/catto\\_del\\_fatto u\\/bradduck\\_flyntmoore](https://preview.redd.it/mtvbjuy58w371.png?width=1426&format=png&auto=webp&s=6404a58bd9224e9bd618154d769cb1b81cf284bc)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎤🎸🥁 🦍Welcome to the Jungle🦍🥁🎸🎤\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# $GME Closing Price: $280.01\n\n&#x200B;\n\nOpen Price: $258.00\n\nDaily High: $282.00\n\nDaily Low: $255.20\n\nVolume: 5.84 MM\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🖍🍎🚌GME 101🚌🍎🖍\n\n&#x200B;\n\n*If you're new to Superstonk, start here!*\n\n&#x200B;\n\n[possible, it is](https://preview.redd.it/1wjxlzkmfw371.jpg?width=810&format=pjpg&auto=webp&s=3eb1a1c63416e8d119956b53a4ba70123ad746f6)\n\n&#x200B;\n\n[Superstonk FAQ](https://www.reddit.com/r/Superstonk/wiki/index/faq#wiki_how_do_i.2C_as_a_retail_investor.2C_stand_a_chance_against_the_hedge_funds.3F)\n\n[Superstonk Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\n[The Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[House of Cards I, II & III in PDF format](https://www.reddit.com/r/Superstonk/comments/nm83eb/a_house_of_cards_parts_i_ii_iii_in_pdf/)\n\n*More DD to be added as we develop this section! This will be a daily recurring section that will serve as a go to reference for new apes!*\n\nAlso, as you probably know, [u/Atobitt](https://www.reddit.com/u/Atobitt/) has dropped HOC II&III. Pretty sure it crashed reddit when it dropped!! This piece was peer reviewed by such prominent experts as Wes Christian, Dave Lauer and mods as well. The apes of Superstonk sincerely appreciate the time and effort put into getting this information out there. 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# VOTE! SOME OF YOU STILL HAVE TIME!!\n\nby u/bye_triangle\n\n&#x200B;\n\nhttps://preview.redd.it/phecm0rkcw371.png?width=960&format=png&auto=webp&s=5cd0d108212428d987af3402260d07654bd57dc3\n\nAlright Apes,\n\n&#x200B;\n\nThe end is nigh, if you were given the opportunity to vote, and haven't yet... There is no excuse! If you want to see this Naked Short Selling scam brought to its knees then you **have** to make sure you submit your vote by the deadline.\n\n***This cannot be put off any longer.*** The Shareholders meeting is **IN TWO DAYS!!!** Though this may be getting repetitive, it needs to be heard.\n\nVOTE YOUR SHARES\n\nIf you've already voted, then spread the word to others-- everyone needs to be reminded of the importance of this.\n\n&#x200B;\n\n**Do it for the companies that have been uncerimoniously killed by this practice**\n\n&#x200B;\n\n**Do it for the people who lost their jobs because of these short sellers**\n\n&#x200B;\n\n**Do it for the Apes who are being disinfranchized by their brokers**\n\n&#x200B;\n\n**Do it for GameStop, who need the physical proof of the Naked Shorts**\n\n&#x200B;\n\n&#x200B;\n\n**Do it for whatever reason inspires you most...**\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/29aa3pqucw371.png?width=511&format=png&auto=webp&s=06b458225691db53d0f6a06e9c4b3dc343d54107\n\n**Also comment !apevote! to get your special voted flair!**\n\n&#x200B;\n\n# VOTED FLAIRS WILL BE LOCKED FOREVER AFTER 6-9!! GET YOUR BADGE OF HONOR NOW AND VOTE!\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Annual Shareholder Meeting 6-9 ( ͡° ͜ʖ ͡°)\n\n*by* u/pinkcatsonacid\n\n&#x200B;\n\nAlright apes! The time has come for Gamestop's Annual Shareholder Meeting! Remember in January when this seemed like a lifetime away? Now look at us. Look at us.\n\n&#x200B;\n\n[June me @ January me- LOOK AT US](https://preview.redd.it/bu4ej2wc9w371.jpg?width=1080&format=pjpg&auto=webp&s=3e54ca20d7bc0c63f8a73d2ca5895037442bbaa6)\n\n&#x200B;\n\nI want us all to have realistic expectations for the meeting... and I want to make it **perfectly** clear that this meeting is **not** the place to gather and have Woodstonk, (I promise that's a coming major event after MOASS!) but it *is* kinda the center of our Superstonk universe for the time being, and the mods wanted to make sure to have coverage of the day's events, including the shareholder meeting from 11:00-11:15 am Eastern, and the QE Report later at 5:00 pm Eastern.\n\n&#x200B;\n\nSo, there will be live coverage on location at Gamestop Corporate Headquarters, as well as the premiere of our new community roundtable style livestream, **Monkey Business!**\n\n&#x200B;\n\nAt 4:30 pm Eastern, **Monkey Business** will be live on Superstonk Live YouTube! Hosted by u/jsmar18 and u/sharkbaitlol and joined by apes from the Superstonk community, they are going to be discussing the meeting, the financial report, and whatever else happens that day!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/e6oohtor8w371.jpg?width=1024&format=pjpg&auto=webp&s=2f2bd3de9d96a8a5599b5cd8bc02423c692f16e6\n\n**And on that note... I want to make sure apes are very clear on some things. If you are an ape going to the meeting:**\n\n&#x200B;\n\n* Be overly respectful of the space and people around you. Pretend you are at a job interview.\n* Don't leave any trash (Leave nothing but footprints.. take nothing but pictures!)\n* Don't be a disturbance to the peace i.e. no loud music, yelling, fighting, or anything else that would make corporate want to call the local police.\n* If you gather in any capacity, even to sing songs, gather peacefully.\n* Distance yourselves from any bad actors or those seemingly trying to make a scene. Publicly denouncing the shill bad actors will help pluck them out of a crowd very quickly.\n* Remember the world, the media, even Ryan Cohen and DFV themselves, will be watching and judging apes behavior that day. Be a good example!\n* **Most importantly, HAVE FUN!!! 🤙✌💖🚀**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Mod Hiatus Update\n\n*by* u/pinkcatsonacid\n\n&#x200B;\n\nModding Superstonk is a 25/8 job (best job everrrr!). And as we grow, the need for all hands on deck grows larger by the day. And as more mods take hiatus, the need for a plan in place becomes more apparent to keep the ball rolling smoothly. The mod team has discussed how to address the issue of how to approach a hiatus, and believe we have come up with a solution.\n\n&#x200B;\n\nCommunication rules and parameters have been put in place with majority votes from the entire mod team supporting the new rules. Basically, if we haven't heard from a mod for a number of weeks, then permissions will increasingly be removed, ultimately leading to a team vote on the moderator's position being frozen indefinitely. These rules were also voted to be applied retroactively, and have resulted in Administrative action.\n\n&#x200B;\n\n**Therefore, please be advised of the following:**\n\n&#x200B;\n\nu/StonkU2 and u/heyitspixel have been placed in what we have deemed \"hiatus mode\" for individual reasons, though the result is the same. They no longer have access to any moderator capabilities and now hold the same permissions as a regular user. **As such, please be aware that they are no longer representatives of the Superstonk mod team** ***at this time*** **and any communication from them is coming as an individual.** We have not been able to make or keep contact per the guidelines set forth, therefore their moderator permissions have been removed, and further action will be brought to a vote within in the mod team in the coming days (their moderator position has not been revoked in any way, only their permissions). Transparency will of course be maintained as changes are made in the best interest of Superstonk. 💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Deep Fucking Birthday Wishes 🥳🎊🎉\n\n*by* u/bradduck_flyntmoore\n\n&#x200B;\n\nHowdy apes! u/Bradduck_Flyntmoore here! As many of you know, tomorrow is the birthday of the now-famous retail investor, DFV.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/m1fd78yxfw371.png?width=634&format=png&auto=webp&s=9acc86504392797d7f68960101d79f69245d234c\n\n&#x200B;\n\nLike so many of you, this Ape-Bassador first heard about GME through him, and it has been a WILD ride ever since. There have been a lot of rumblings about the need for a \"birthday card\" post of sorts, so all the Deep Fucking Birthday Wishes can be expressed in a single place. Mods agree! This will help keep the sub from sliding otherwise worthwhile content AND make it easier for DFV (we know you lurk here) to see all the nice things we have to say in one spot.\n\n&#x200B;\n\nThat means two things, apes: 1) Today and tomorrow's special edition of The Jungle Beat will serve as the Official Superstonk Birthday Card to DFV, please put all your wishes to him in the comments; and 2) we gonna delete all the rest. Please report any DFV birthday posts outside of the official birthday card so mods can remove it. As much as I respect and appreciate him for introducing me to GameStop, this sub is about GME, not DFV. Thanks in advance to all apes for your understanding and cooperation.\n\n&#x200B;\n\nMake sure to check back at tomorrow's Jungle Beat for info on Mod plans for the Annual Shareholder Meeting. Until then, and as always, Buy, Hodl, Vote if you can, and always be excellent to each other.\n\n&#x200B;\n\n**Power to the Player! 🚀🌙**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Superstonkbot (the Whistle Blower Bot)\n\n*by* u/Leaglese\n\n&#x200B;\n\nHowdy apes, your resident leaglese ape here to discuss an older feature within our new jungle beat feature!\n\n&#x200B;\n\nAlthough I haven't been posting much, I've been badgering away in the background assisting with general modding, transcriptions and, what I want to talk to you about today, a tool for apes the team thinks could use some love.\n\n&#x200B;\n\nOf course I'm referring to our very own anonymous DD StonkBot; the ultimate tool designed to attract DD from those who maybe can't post due to sub requirements or whatever reason anonymity provides an outlet for. It could even be you, dear reader.\n\n&#x200B;\n\nIt seems after a recent post about the bot, we saw a surge in activity, and we generally saw an increase in the quality of submissions made. Please note, this tool will soon expect the same post requirements we expect from the awesome DD posts apes have come to expect from our community, such as expecting minimum character counts and no image only submissions. This is to try and assist us in clearing the wheat from the chaff.\n\n&#x200B;\n\nSo I'm here to call on you all to spread the word and visibility of this tool, or engage! As our collective stonky vision and reach grows, so too does the potential for this bot to provide an anonymous means of DD drop from those late to the party, or for those unable to actively engage via an account. I mean, you can never have enough DD right?\n\n&#x200B;\n\nhttps://preview.redd.it/2rouwxwfcw371.jpg?width=538&format=pjpg&auto=webp&s=9c7f65afa1e434b74a3718867d7a695d2c25a864\n\n&#x200B;\n\nWith the Jungle Beat's / our anchorman's blessing, depending on the quality of what we receive, we'll be trying to implement a special feature of the best anonymous DD within Jungle Beat or the news when we can going forwards; so all of you lurking who think you can't be involved or have your praises sung, think again!\n\n&#x200B;\n\nEven if it is anonymous. You'll know.\n\n&#x200B;\n\nI'm therefore calling all apes to spread the word and / or engage with this tool if you have solid information to share!\n\n&#x200B;\n\nWho knows if this thing really kicks off, perhaps we can look to implement some more exciting features….\n\n&#x200B;\n\nLeag\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Ghost in the Shill\n\n&#x200B;\n\n*written by SATORI co-creator* [u/catto\\_del\\_fatto](https://www.reddit.com/u/catto_del_fatto/)\n\n[Oh yeah, it's all coming together](https://www.reddit.com/r/Superstonk/comments/nqnora/satori_the_first_36_hours/). The mod team and SATORI squad have received a fantastic amount of love, support and gratitude for sweeping up the shills, fixing ModMail, providing valuable insights and otherwise doing our part to keep Superstonk as wonderful as ever. Fan mail, fan art, even a [serenade to our beloved algo-rilla.](https://www.reddit.com/r/Superstonk/comments/nrgu4e/i_sing_satori_a_song/)\n\nThe appreciation is very much appreciated, but our work is never truly done. More so than ever, the responsibility to maintain a legendary sub rests in the hands of ordinary Apes.\n\n[SATORI dev, 2021 colourised](https://preview.redd.it/8rqw59r8mc371.jpg?width=400&format=pjpg&auto=webp&s=9f08a77aa72df51118e7201aa262d492f4908eee)\n\nThe shills are *absolutely furious* about what we've been up to the past week. It's as if they [need this allegedly-impossible creation of ours shut down post-haste](https://www.reddit.com/r/Superstonk/comments/nrx4pu/onslaught_of_antisatori_fud_gives_me_hope/) \\- desperation is in the air, and it tells me everything I need to know.\n\nAs the informatics arms-race between SATORI and its adversaries heats up, I'd like to make everyone aware of emerging stratagems and what they mean for the Ape community, so we're all well-equipped to deal with anything thrown at us ahead of time.\n\n&#x200B;\n\n**Solicitations, trolling & phishing in DMs**\n\n&#x200B;\n\nThis tactic is as old as FUD itself, but it hasn’t been this prevalent in months - the working theory is that the impostors suddenly have a load of accounts unable to post lying around, and wish to make use of them somehow. So, if you get any suspicious messages pushing \"investment advice\" or similar, **please report these to Reddit and our mod team.**\n\nA lot of these are Meltdown trolls that thrive on the attention, so I wouldn't recommend engaging or 'putting them on blast' - but if you insist, our friends from [r/scambait](https://www.reddit.com/r/scambait/) have plenty of advice on the matter.\n\n&#x200B;\n\n**Bad karma**\n\n&#x200B;\n\nSince the restrictions, Apes whose accounts barely make it above the karma limit have [found themselves under attack by bots downvoting all their submissions, pulling them back below the threshold.](https://www.reddit.com/r/Superstonk/comments/nsij2i/are_bots_and_shills_down_voting_apes_below_the/)\n\nThink about it - if professional FUD-mongers can't spread FUD directly, the second-worst thing they can do is attack solid content to prevent it from being seen. These attacks are exactly why we set SATORI to run in reverse and approve Apes, as well as using it to gather data on new tricks.\n\nWe're currently in discussions regarding what else can be done to prevent or counter such surreptitious acts; suggestions accepted. For the time being, it's up to everyone to be active in upvoting the good, downvoting the bad and reporting the *really* bad. Not only does this help a clear sub - it also lets us learn about the shills and strike back more effectively.\n\nAs with $GME as a stock, every vote matters.\n\n&#x200B;\n\n**Leveraging Apes and the weekend ennui**\n\n&#x200B;\n\nOn Saturday, a lot of us woke up to a *flood* of posts relating to a comment by a particular CNBC reporter. Sharing new info is a wonderful thing, but in this case, it was a deluge of the same content being repeated over and over again. As you can imagine, I was getting a ton of pings asking to sic the Terminators on these guys.\n\nSo, where was SATORI?\n\n&#x200B;\n\nhttps://preview.redd.it/0mghzm8phw371.png?width=2084&format=png&auto=webp&s=eaa258b2e0b961c6cf642995c6c762154c9677bd\n\n&#x200B;\n\nAs [Bradduck explained in his ambassadorship comment](https://www.reddit.com/r/Superstonk/comments/nplhx7/game_stop/h05v5ec?utm_source=share&utm_medium=web2x&context=3) on Interdiction Day, our setup is currently running on a per-user basis; a bit of negative sentiment doesn't necessarily make a shill. We've all woken up on the wrong side of bed, and one comment isn't enough for anyone to form an accurate verdict - whether they're an algorilla or a carbon-based, 100% organic, dip-buying ape.\n\nWe know that our adversaries are aware of this, and how they're countering it - their only hope at this point is to rely on otherwise well-behaved users to post content that dilutes or otherwise lowers the overall quality of the sub. That, and outright *stealing* accounts with AI approval or Superstonk posting histories in broad daylight - more on that later.\n\nTheir attempts to drag down karma on Apes' accounts reveals that they're just as interested in preventing top-tier submissions from gaining traction as they are in directly posting their own tosh. So, now that they're mostly unable to bring their own stuff into Superstonk, they're relying on us to do their work for them.\n\nI took the liberty of checking the Melissa posters' accounts, and it turns out the vast majority of them were genuine Apes with solid and lengthy histories in Superstonk. No wonder our per-user security measures didn't bag 'em, they aren't supposed to.\n\nIt's the weekend, there aren't any crayons to watch and everyone's understandably miffed. But please, if you believe the meme/tracker/DFV tweet or similar you're about to submit may have been posted before, I implore you to **check before posting.**\n\nThe Superstonk jungle - especially the [Knights of New](https://www.reddit.com/r/Superstonk/comments/nti5ms/knights_of_new/) \\- will appreciate it dearly.\n\n&#x200B;\n\n**Tag teams**\n\n&#x200B;\n\nStruck with a sudden shortage of useable accounts, our adversaries have had to pick their battles a bit more wisely - as opposed to regurgitating the same thing over and over, getting banned, migrating to a new account et cetera. One way to accomplish this is by tag-teaming - setting up a wedge of sorts and sowing drama on both sides.\n\n[Here's a brief yet insightful comment covering this tactic, and how to deal with it.](https://www.reddit.com/r/Superstonk/comments/nsmutv/complacency_kills_dont_let_satori_lull_you_into_a/h0nk71l?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n**Hacked accounts & a final note on account security**\n\n&#x200B;\n\nWe have received a surge in reports of Superstonk users’ accounts getting compromised It would appear that accounts able to post (i.e. approved by SATORI or above the karma/age requirements) are more likely to be targeted, but this could happen to anyone - don’t get complacent.\n\nPlease refer to [this post](https://www.reddit.com/r/Superstonk/comments/nojpde/best_security_practices_for_protecting_self_and/) for a comprehensive rundown on account security, in addition to other useful advice on the matter. Also, friendly reminder not to click any [suspicious links.](https://www.youtube.com/watch?v=dQw4w9WgXcQ)\n\n[No hax for you, Kenny](https://preview.redd.it/h5x51vmaig371.jpg?width=400&format=pjpg&auto=webp&s=eb452a9bc53ad97bc8e2b68e3003e0c85a77ef3d)\n\nTA;DR\n\nWhile the sub is significantly cleaner than it used to be, SATORI still has a long way to go. Since deployment, we've seen a trend towards attacks that don't rely on publicly 'revealing' their accounts. The might of 375,000+ AI-assisted gorillas is just too much.\n\nInstead of the old hit-and-run spamming, our foes are resorting to sneakier methods: hacking accounts, manipulating karma, sliding into people's DMs and otherwise causing trouble outside the public eye. In addition, they're increasingly relying on genuine Apes to accidentally drown out the good stuff, being increasingly unable to bring it into the sub themselves.\n\nThis scenario leaves far more responsibility to individual Apes than what we had before, so it is up to each and every one of us to deal with it appropriately.\n\nA sub is only as strong as its weakest link - B.H.V.F., and be strong.\n\nCatto\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Check out Lucy Komisar's New Article about her recent AMA on the SEC!\n\n&#x200B;\n\n# [Link to the Article](https://www.thekomisarscoop.com/2021/06/the-corruption-of-the-sec-over-decades-and-till-today/)\n\n&#x200B;\n\nIt was honor to host you Lucy! 💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# \"Congratulations (Wes), you got a lot of people looking up to you, hoping you can continue that 20 years worth of work, I think we're right at the finish line\"- Charles Payne, FOX News\n\nPink here. From the whole mod team, Wes Christian, we are so proud of you and we support you in this fight against Naked Short Selling! [Link to interview](https://www.youtube.com/watch?v=VRVBbNYfAOM)\n\n&#x200B;\n\n[Wes Christian on FOX discussing NSS- photo cred u\\/BENshakalaka !](https://preview.redd.it/ermcx4xadw371.png?width=1157&format=png&auto=webp&s=c5ad96ee879a58bf52f151d4173c6f81de9d5820)\n\n&#x200B;\n\n[photo cred u\\/Benshakalaka](https://preview.redd.it/h231aepffw371.png?width=1149&format=png&auto=webp&s=48c56b232462b66f059e1dec80750a1aed71790a)\n\n&#x200B;\n\n# 👀👀👀👀👀👀👀👀👀👀👀\n\nhttps://preview.redd.it/5v097oondw371.jpg?width=952&format=pjpg&auto=webp&s=cdf99e49c835097e1c546e22e6164ccbc3e892fd\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Reddit down, wot do?**\n\nMods have carefully considered what to do during a reddit blackout and advise the following - **IF REDDIT GOES DOWN AT A PIVOTAL MOMENT** go to:\n\n&#x200B;\n\n[SuperstonkLive YouTube - Emergency Broadcast System](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA)\n\n[https://twitter.com/ByeTriangle](https://twitter.com/ByeTriangle)\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/u\\_sharkbaitlol](https://twitter.com/u_sharkbaitlol)\n\n[https://twitter.com/BradduckF](https://twitter.com/BradduckF)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWe ain't going anywhere, it just means we get another week out in the jungle, screamin' with the apes. ***OOK OOK***\n\n&#x200B;\n\nJust remember, we got this far cause we do our research and we trust our findings. Armed with data there should be nothing that can kill the vibe. In the words of Dr. Burry:\n\n&#x200B;\n\n***\"I may have been early, but I am not wrong\"*** *(This quote has never rang more true)*\n\n&#x200B;\n\nhttps://preview.redd.it/npbtz16afw371.png?width=1600&format=png&auto=webp&s=319d6af93534966a2cf34e9f0b67e4f37c535ce0",
    "title": "The Jungle Beat- Monday 06-07-2021- 2 DAYS TIL ANNUAL MEETING!!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/numi3i/the_jungle_beat_monday_06072021_2_days_til_annual/"
}