{
    "author": "Kaoticni_Jastog",
    "created_utc": 1623661881.0,
    "distinguished": null,
    "edited": 1623694024.0,
    "id": "nzince",
    "text_only": true,
    "flair_id": "7fabe5b2-8cbd-11eb-968a-0eaf84b82885",
    "flair_text": "Shitpost 👾",
    "name": "t3_nzince",
    "num_comments": 240,
    "permalink": "/r/Superstonk/comments/nzince/can_anyone_please_find_me_the_article_about_a_guy/",
    "score": 3516,
    "selftext": "Edit 2: what I was looking for https://www.euromoney.com/article/b1320xkhl0443w/naked-shorting-the-curious-incident-of-the-shares-that-didnt-exist\n\nspecial thx to u/steelandquill for getting me the right article in like 21 seconds after posting <3\n\nCan anyone please find me the article about a guy who owned a company which had smth like 4million float.\nHe saw his company being naked shorted into the ground untill 1 share fell to smth like 0,0007cents and decided to buy every single share(entire float).\nThen on the next day, while owning the entire float of a company he saw about 40million shares exchange hands.\n?\nThx in advance apes 🚀🚀🚀\n\nEdit 3: just a bit more TLDR: In 2004 it turns out it short squeezed by the quick look at it from less then a fraction of a penny to more then 1000$, go to trading view and zoom into that if you want a more detailed picture...\n\nEdit 1: I allways knew this community was THE best, but again i got amazed how proffesional and quick you all were with answers!\nAnyone wondering about how extremely corrupt the system is should read the article in the first comment, i will link it here shortly!\nPS: thx for annonymous who gave me \"To the stars award!\"\nDFV i know you are gay for me (no homo), feeling is mutual",
    "title": "Can anyone please find me the article about a guy who bought entire float of a company and the next day saw 40 million shares exchange hands? Ive spent hours and cant find it",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nzince/can_anyone_please_find_me_the_article_about_a_guy/"
}