{
    "author": "rensole",
    "created_utc": 1618934815.0,
    "distinguished": null,
    "edited": false,
    "id": "mutr3e",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_mutr3e",
    "num_comments": 4488,
    "permalink": "/r/Superstonk/comments/mutr3e/about_my_post_earlier/",
    "score": 27107,
    "selftext": "Hey everyone,\n\nSo first of all I want to apologize about my reaction earlier.\n\nWriting dailies every day isn't an easy thing, I usually get up at 6 am my time, research write etc, then post answer questions etc, then have dinner research more check facts and stay online till midnight trying to moderate the sub and help out wherever I can, and it seems I've bitten off more than I can chew in that regard as I've been doing that for months now.\n\nToday I wrote something that I had on my mind for the past few days, as I knew it was an unpopular opinion but it needed to be said, even though I knew it had to be said I was expecting some backlash and has cost me more sleep then I wish to admit. but when everyone started to dogpile I lost it. I will need to grow some thicker skin in that regard.  \nI reacted badly, I forgot that we have people in here who are deliberately trying to do threadsplitting as we have learned before.\n\nNow I have been lucky enough to have a great support team around me, my fellow mods, the guys on discord, the people who reached out, everyone.\n\n&#x200B;\n\nI never told anyone what they need to do or how to do it, I never said you have to follow a certain exit strategy, this is all personal and you should look into what is best for you.  \n\n\nAgain if you think that I am a shill, or bought off you have missed the point of the entire post, I try to help that's what I've always tried, and I now know I can't please everyone nor is that my goal.\n\nI have thought about the dailies and being a moderator, I will continue to do both. not just because I feel I'd let people down but it also feels bad, like I'm backing down from a fight and that's not me.\n\nso if you guys can excuse me I'll go eat my crayola sandwich and start helping again.\n\nhttps://preview.redd.it/wv7p73beqcu61.jpg?width=4032&format=pjpg&auto=webp&s=b91f05b9978bfcc61712825a6db6712178054364\n\ncya guys tomorrow",
    "title": "About my post earlier",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/mutr3e/about_my_post_earlier/"
}