{
    "author": "Fearless-Ball4474",
    "created_utc": 1618940543.0,
    "distinguished": null,
    "edited": false,
    "id": "muvwor",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_muvwor",
    "num_comments": 18,
    "permalink": "/r/Superstonk/comments/muvwor/burry_who_made_a_fortune_betting_against_cdos/",
    "score": 549,
    "selftext": "I had a bit of extra time to connect a few dots. Last year, I followed this Bloomberg post about Michael Burry's position against ETFs, specifically the Russell 2000. It was interesting to me because I personally know shorters who got crushed by the R2000s rally after the GFC.  Today, it is quite apparent that the sell-off is on. When you consider all of the DD from the last 72 hours, it is obviously a liquidation event to prepare for a major correction. \n\nTL;DR Is the R2000 forming a Head & Shoulder pattern? Is this the reversal? \n\n&#x200B;\n\nhttps://preview.redd.it/17qkpejc6du61.png?width=655&format=png&auto=webp&s=d3949310284f601b70f0c5fe276811bc9122529c\n\n&#x200B;\n\nhttps://preview.redd.it/q97psgcy6du61.png?width=635&format=png&auto=webp&s=31bc563dd72de261c08c3ce6f42899aa334dcf48\n\n&#x200B;\n\n&#x200B;\n\n[ A head and shoulders pattern is a chart formation that appears as a baseline with three peaks, the outside two are close in height and the middle is highest. In technical analysis, a head and shoulders pattern describes a specific chart formation that predicts a bullish-to-bearish trend reversal. ](https://preview.redd.it/9z8fwr2n6du61.png?width=1077&format=png&auto=webp&s=af5fb25483c1e4611290545958d52b8567aa1de9)\n\n  \nThe head and shoulders pattern is one of the most common reversal formations. **It is important to remember that it occurs after an uptrend and usually marks a major trend reversal when complete.**  \n\n&#x200B;\n\n[2 Hour Chart ](https://preview.redd.it/wm5paxlp6du61.jpg?width=1847&format=pjpg&auto=webp&s=d1962dcfe87cdd028f66e388e37eeba5f3a2c0f8)\n\nI like the stock!",
    "title": "Burry, who made a fortune betting against CDOs before the crisis, said index fund inflows are now distorting prices for stocks and bonds in much the same way that CDO purchases did for subprime mortgages more than a decade ago. The flows will reverse at some point, he said, and “it will be ugly”",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/muvwor/burry_who_made_a_fortune_betting_against_cdos/"
}