{
    "author": "Dzerikas",
    "created_utc": 1618690437.0,
    "distinguished": null,
    "edited": 1618855051.0,
    "id": "msy5yf",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_msy5yf",
    "num_comments": 528,
    "permalink": "/r/Superstonk/comments/msy5yf/so_the_sec_have_told_stock_brokers_as_of_the_22nd/",
    "score": 6203,
    "selftext": "( Its important to recognize that this IS NOT a rule or regulation, it is a staff statement. Not saying nothing will come of this or it won't be acted on, but we can't take this to mean it's a rule that will be enforced.)\n\n\nThe letter is an internal letter, what you may understand is basically that its  similar to a \"Disclaimer\" written at the bottom of internal memos, letters etc, stating that the letter in itself is not a new actionable regulation. \n\nThe real important part of the letter is this.. \n\nRule 15c3-3(b)(3) requires broker-dealers entering into agreements with their customers who lend the broker-dealers fully-paid or excess margin securities to provide the securities lenders with collateral that fully secures the loans.[3]  Staff’s letter stated that the staff would not recommend enforcement action to the Commission regarding these programs for six months from issuance of the letter, or until April 22, 2021, to give firms time to come into compliance with the Rule.[4] \n\nBroker-dealers operating these programs should be mindful of the importance of complying with the requirements of Rule 15c3-3 and ensuring that retail investor funds receive the full protections afforded under the Securities Investor Protection Act.\n\n\nSo stock brokers need Billions of extra capital on hand as of the 22nd or they have to recall the shares they lent out. \n\nMakes sense as to why the banks have been selling huge amounts of bonds now.\n\n\n\nLink to SEC https://www.sec.gov/news/public-statement/staff-fully-paid-lending?utm_medium=email&utm_source=govdelivery\n\n\nCredit - @ReapersGavel :)\nhttps://mobile.twitter.com/ReapersGavel",
    "title": "So the SEC have told Stock Brokers as of the 22nd April they must have the capital on hand to cover every share they borrowed from investors and lent to hedge funds.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/msy5yf/so_the_sec_have_told_stock_brokers_as_of_the_22nd/"
}