{
    "author": "Dan_Bren",
    "created_utc": 1619988114.0,
    "distinguished": null,
    "edited": 1619997149.0,
    "id": "n3fg7w",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n3fg7w",
    "num_comments": 259,
    "permalink": "/r/Superstonk/comments/n3fg7w/23_million_in_deep_itm_puts_purchased_in_large/",
    "score": 3680,
    "selftext": "Happy Sunday Apes,\n\nIt's your friendly neighborhood u/Dan_Bren. Friday was a spicy day on the options front. Let's get right into it:\n\n[GME Biggest Options Trades 4\\/30\\/21](https://preview.redd.it/qezu2l14nrw61.png?width=1227&format=png&auto=webp&s=532d6e688d7028d2fd5d36a2c203370d74364a73)\n\nAs you can see from the data above there were several large block trades of DEEP ITM Puts which can effectively be used in the same way we had seen the DEEP ITM calls used. On Friday there were 858 trades (in blocks) of the 4/30 $300 Puts for $10,215,018. Additionally there were 1,058 trades of the 5/21 $300 Puts for $13,161,978. All of these trades came out of the EMLD (Miami) and CBOE (Chicago) exchanges.\n\nThese purchases are relatively in line with the size of purchases we began to see at the beginning of April and so I will continue into monitor early next week to see if these continue to appear in mass.  It is interesting to see these exchanges pop up on the Biggest Options Trades lists as I had not previously seen them buying DEEP ITM calls on here.  I wonder what other viable options they had for resetting FTD's and if any of the new DTCC rules and causing them to resort to buying these DEEP ITM CALLS AND PUTS.\n\nTL;DR: Read the title.💎🙌",
    "title": "$23 MILLION IN DEEP ITM PUTS PURCHASED IN LARGE BLOCKS ON FRIDAY (4/30) OUT OF CBOE (CHICAGO) AND EMLD (MIAMI) EXCHANGES",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n3fg7w/23_million_in_deep_itm_puts_purchased_in_large/"
}