{
    "author": "wkowdyw",
    "created_utc": 1621712760.0,
    "distinguished": null,
    "edited": false,
    "id": "niqgpo",
    "text_only": true,
    "flair_text": "𝗡𝗲𝘄𝘀",
    "name": "t3_niqgpo",
    "num_comments": 145,
    "permalink": "/r/DDintoGME/comments/niqgpo/sec_pays_dark_pool_whistleblower_constantine/",
    "score": 1440,
    "selftext": "\\--- start of article; link follows---\n\n&#x200B;\n\nhttps://preview.redd.it/tjozm9hd4q071.jpg?width=288&format=pjpg&auto=webp&s=b78a9e25857fef2cc2071ecf8a6444c808b01323\n\nPosted  **May 21, 2021**\n\n**The SEC has made a multi-million-dollar award to a Constantine Cannon client whose original information and assistance led to an enforcement action against the brokerage firm ITG.  The award—30% of the recovery—is the maximum allowed under the SEC Whistleblower Program.**\n\nThe SEC has taken three enforcement actions against ITG in recent years, two of which involve ITG’s dark pool POSIT.  **POSIT is an alternate trading system where subscribers are told they can anonymously and confidentially place trades.  An often-touted benefit of trading in dark pools is the ability to place orders without alerting predatory traders who might trade in front and affect pricing.**  Notwithstanding ITG’s assurances of confidentiality, the SEC concluded that ITG created a secret proprietary trading desk—“Project Omega”—and used confidential POSIT trading information to inform Project Omega trading strategies. ITG paid [$20.3 million](https://constantinecannon.com/2015/08/21/sec-enforcement-spotlight-itg-pays-over-20-million-to-settle-charges-related-to-its-dark-pool/) in 2015 to settle these charges. Less than two years later, ITG paid [$24.4 million](https://constantinecannon.com/2017/01/17/january-12-2016/) to settle charges that it violated federal securities laws when it prompted the issuance of American Depository Receipts (ADRs) without processing the underlying foreign shares. In 2018 the SEC brought an enforcement action again ITG yet again, finding this time that ITG sent certain clients daily reports identifying the top 100 stocks for which orders were placed and the top 100 stocks for which orders were executed.  **These clients included high-frequency trading firms (HFTs), which often engage in the exact predatory trading practices dark pool subscribers seek to avoid.**  While promising protection from predatory traders, ITG, the SEC concluded, effectively served up open client orders to high-frequency traders. In 2018, ITG and AlterNet paid [$12 million](https://www.sec.gov/news/press-release/2018-256) to settle these charges.\n\nThe 2015 and 2018 ITG settlements involve the types of misconduct that Michael Lewis warned about in *Flash Boys*, his bestselling 2014 exposé of high-speed trading.  It also adds to the list of major enforcement actions the SEC has brought involving market-structure violations, for which dark pools, exchanges, and broker-dealers have paid more than $100 million in civil penalties.  These include enforcement actions against:\n\n* Merrill Lynch, Pierce, Fenner & Smith, a broker-dealer, [paid](https://www.sec.gov/news/press-release/2018-108) a $42 million penalty for misleading customers by “masking” the fact their external liquidity providers executed their orders, leading customers to wrongly believe that Merrill Lynch executed them.\n* **Citadel Securities LLC, a broker-dealer affiliate of a high-frequency trading firm, paid $22.6 million to settle** [**charges**](https://constantinecannon.com/2017/02/21/january-13-2017-7/) **that it misled clients by claiming its algorithm sought to obtain the best price in the marketplace when it did not.**\n* The New York Stock Exchange and two affiliated exchanges, which agreed to pay $14 million to settle [charges](https://constantinecannon.com/2018/06/01/march-6-2018/) that they failed to comply with exchange rules and federal securities laws.\n* Citigroup Global Markets Inc., which paid more than $12 million to settle [charges](https://www.sec.gov/news/press-release/2018-193) that its affiliated dark-pool operator misled subscribers with assurances that high-frequency traders were not permitted to trade in the dark pool.\n* **Three broker-dealers—Citadel Securities LLC, Natixis Securities Americas LLC, and MUFG Securities Americas Inc.—which paid more than $6 million to settle** [**charges**](https://www.sec.gov/news/press-release/2018-275) **that they provided to the SEC incomplete and inaccurate “blue sheet” trade data that the SEC uses to investigate insider trading and other fraudulent activity.**\n\nAs SEC Market Abuse Unit Chief Joseph Sansone has made clear, the SEC “continues to scrutinize dark pools to ensure that they protect client trading information and operate in compliance with the securities laws.”\n\nIn addition to Constantine Cannon’s client, at least two other claimants unsuccessfully sought whistleblower awards in connection with these ITG settlements.  **Our client’s award comes on the heels of numerous** [**blockbuster successes**](https://constantinecannon.com/2020/10/08/record-shattering-whistleblower-rewards-2020/) **for Constantine Cannon clients and a** [**record-breaking year**](https://constantinecannon.com/2020/10/09/sec-record-year-of-whistleblower-rewards/) **for the** [**SEC Whistleblower**](https://constantinecannon.com/practice/whistleblower/whistleblower-types/whistleblower-reward-laws/sec/) **Program.**  The program offers awards to whistleblowers who provide high-quality, original information that leads to enforcement actions that recover more than $1,000,000.  These awards range between [10 and 30% of the money collected](https://www.sec.gov/whistleblower).  All told, the program has paid roughly [$901 million to 163 individuals](https://www.sec.gov/news/press-release/2021-86) during its nine-year tenure.\n\nNotably, whistleblowers do not have to be “insiders” to be eligible for an award.  And whistleblowers who are represented by counsel can submit information anonymously.  For more information on whistleblower reward programs or to speak with a Constantine Cannon whistleblower attorney, please click [here](https://constantinecannon.com/practice/whistleblower/contact/).\n\nSource: [https://constantinecannon.com/2021/05/21/client-receives-maximum-award-for-blowing-the-whistle-on-itg/](https://constantinecannon.com/2021/05/21/client-receives-maximum-award-for-blowing-the-whistle-on-itg/)\n\n\\--- end of article---\n\nITG Inc. is owned by Virtu Financial.  Clicking on [www.itginc.com](http://www.itginc.com/) redirects to [https://www.virtu.com/](https://www.virtu.com/).  They had a press release on Mar 1, 2019: [Virtu Financial, Inc. Completes Acquisition of ITG to Create Premier Agency and Broker Neutral Franchise](https://ir.virtu.com/press-releases/press-release-details/2019/Virtu-Financial-Inc-Completes-Acquisition-of-ITG-to-Create-Premier-Agency-and-Broker-Neutral-Franchise/default.aspx)\n\nVirtu and dark pool trading was previously mentioned here by [u/HoldYourGroundon](https://www.reddit.com/user/HoldYourGroundon/) : [Let's not forget Citadel's partner in crime: VIRTU AMERICAS LLC](https://www.reddit.com/r/Superstonk/comments/mw6zx9/lets_not_forget_citadels_partner_in_crime_virtu/)",
    "title": "📣 SEC PAYS DARK POOL WHISTLEBLOWER: Constantine Cannon Client Receives Maximum Award for Blowing the Whistle on ITG",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/niqgpo/sec_pays_dark_pool_whistleblower_constantine/"
}