{
    "author": "StringentCurry",
    "created_utc": 1617272310.0,
    "distinguished": null,
    "edited": 1617272473.0,
    "id": "mhs96a",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion 🦍",
    "name": "t3_mhs96a",
    "num_comments": 515,
    "permalink": "/r/GME/comments/mhs96a/if_we_get_hit_by_a_fake_short_squeeze_today_or/",
    "score": 8519,
    "selftext": "Can you sense it? Can you Feel that electricity in the air; smell that blood in the water; hear those 🚀 rocket engines 🚀 rumbling? I know I can.\n\nDon't succumb to a prisoner's dilemma because it's falling from 1K, 10K, even 100K and you want to multiply your stake once its settled. That's the whole point of the fake short squeeze. They know they can't actually fool anyone into thinking the squeeze has truly squoze, but they can try and bait apes into selling to increase their stake, creating an opening to floor the price and close their positions.\n\nIf you need a selfish reason - which I know you don't because we're all true, committed apes here - you'll have to pay tax on those gains. Then, if it doesn't murder the MOASS in the crib, you'll have to pay tax on gains from that too.\n\nDon't think \"oh well if everyone holds it won't matter if *I* sell and buy back\". If everyone does that we're fucked and the shorts win. Don't be cute, don't screw other apes trying to be greedy, **DON'T** paperhand thinking that you're being a clever daytrader.\n\nJust clench your diamond fucking hands no matter what. 💎🙌 So long as we hold, we literally set the price.\n\nApes. Together. Strong. 🦍🦍🦍🦍🦍\n\nThis is not financial advice, I just like the stock.",
    "title": "If we get hit by a fake short squeeze today or any day, DO NOT SELL so that you can buy more at the dip. That's exactly what the hedgies want. Just buy and hold 💎🙌 no matter what, and we're all going to be fucking rich. 🚀🚀🚀 This is not financial advice.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mhs96a/if_we_get_hit_by_a_fake_short_squeeze_today_or/"
}