{
    "author": "BearBiPolar",
    "created_utc": 1618016624.0,
    "distinguished": "moderator",
    "edited": 1618016935.0,
    "id": "mnuvlz",
    "text_only": true,
    "flair_text": "Mod Announcement 🦍",
    "name": "t3_mnuvlz",
    "num_comments": 1015,
    "permalink": "/r/GME/comments/mnuvlz/bearbipolars_statement/",
    "score": 11595,
    "selftext": "Hello.\n\nI am the head mod at r/GME. 5 months ago, I found this subreddit unmoderated and abandoned. I was its first member and I’ve experienced the tremendous growth of this subreddit first-hand, from r/GME gaining its first 10 members, to the first 100, all the way to the hundreds of thousands of members it has now.\n\nYou might not trust me due to the lack of content on my profile, and that’s understandable. I have always adopted a Laissez-faire approach to moderating, since I believe the r/GME community knows itself better than any specific person on the mod team, including me. That is why I try to minimize mod intervention whenever I can.\n\nThe recent drama going on with r/GME mods can partially be attributed to my inattentiveness. I do not use Discord and I have been busy recently due to family and personal circumstances that I will not go into. Needless to say, I wasn’t as up to date as I should have been regarding the situation.\n\nI want to make it abundantly clear, I was not consulted regarding the removal of u/rensole and u/redchessqueen99. They were invited to the mod team when r/GME was still in its infancy, and their contributions have been invaluable to the success of this subreddit, both as moderators and content creators. I would have never let them leave on such trumped up charges, especially when they have seniority over the supposed mods who “voted” them out.\n\nI can promise to you that as long as I am a moderator, r/GME will continue to be a platform for free speech and discussion surrounding GameStop stock as it was I established the subreddit at 0 members, the same values and sense of community which helped the subreddit grow to 100 members, 1000 members and now 200 thousand members and beyond.\n\nThe values of free speech and discussion around GameStop stock is what r/GME was founded on, which helped propel its rise into one of the largest subreddits dedicated to a single stock. I will never abandon those principles, as any deviation from those core values is a betrayal to my original vision of r/GME and a betrayal to all the members of this incredible community.\n\nRecent Mod Removals and Reasoning:\n\nu/YourNameIsC00L \\- Excessive banning, inappropriate post removals\n\nu/plumdragon \\- Unapproved moderator additions and removals\n\nu/0wl-Exterminator \\- Invited without full mod team approval\n\nu/Ya_Boi_Nezi \\- Invited without full mod team approval\n\nu/the_captain_slog \\- Invited without full mod team approval\n\nNote:\n\nu/toasterrrr was temporarily removed as a mod due to him receiving death threats, and was re-invited back after deleting the crypto wallet link from his bio.\n\nAll of the remaining mods are people that I trust and have been here since the beginning; individuals who have dedicated their time and efforts to improving the r/GME subreddit without asking for anything in return. I can never thank them enough.\n\nFinal Note:\n\nI have checked out r/SuperStonk and their mod team (especially u/rensole and u/redchessqueen99) are doing a fantastic job at cultivating a thriving community. I would highly advise all of you to join them if you haven’t already (I know most of you have) as they have some excellent content and DD regarding GME stock.\n\nI believe transparency and communication is in the best interests of this community, so I decided to draft this statement. Forgive me, I wanted to post something earlier in the week but I was too shocked and disturbed to write an announcement, especially after seeing the sense of community I worked tirelessly for a half year to build get destroyed in the span of one weekend.\n\nWhen I established this subreddit, I wanted to create a small but safe space to discuss GameStop stock without fears of being banned or silenced. Never could I have never imagined r/GME would grow to be this big, which is all thanks to you wonderful individuals. Just know that I deeply appreciate every single one of you for creating one of the most amazing and supportive communities on Reddit. Thank you.",
    "title": "BearBiPolar's Statement",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/mnuvlz/bearbipolars_statement/"
}