{
    "author": "Csmbird",
    "created_utc": 1628169475.0,
    "distinguished": null,
    "edited": false,
    "id": "oyhcte",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oyhcte",
    "num_comments": 57,
    "permalink": "/r/Superstonk/comments/oyhcte/spac_crackdowns_ken_griffins_company_pine_island/",
    "score": 1932,
    "selftext": " \n\n# TLDR; SPAC crackdowns are directly related and impacting MMs and Hedgefunds like Citadel. Ken Griffin has a company called Pine Island Capital Partners and Pine Island Acquisition Company. Pine Island got delisted in May by the SEC for financial filings and misrepresentation of their warrants . Pine Island also bragged about being able to profit off of Covid. \n\nAt face value it seems that the SEC has not only had it’s head in the sand, but that when it’s head wasn’t in the sand it was going in all the wrong directions. Back when information about SPACs getting cracked down on I remember folks questioning why in the hell they were going after SPACs when in reality there was major market manipulation elsewhere.\n\nSo. Why in the hell would they go after SPACs?\n\nBecause there are SPACs owned by MMs and Hedgies, many like Citadel and Ken, who are fucking over the economy in their own right. \n\nLast night I did some digging and found another spinoff company of Ken’s. It’s called Pine Island Capital Partners and thus Pine Island Acquisition Company. \n\n&#x200B;\n\nHere is the 13G That goes into detail regarding this being their company:\n\n[https://www.sec.gov/Archives/edgar/data/1423053/000110465920130010/tm2037217d1\\_sc13g.htm](https://www.sec.gov/Archives/edgar/data/1423053/000110465920130010/tm2037217d1_sc13g.htm)\n\n&#x200B;\n\nPAY ATTENTION HERE:\n\nEach Citadel listed is a different company of Ken’s. Each owning...6.9 ;)\n\n&#x200B;\n\nhttps://preview.redd.it/t9va4hk1hjf71.jpg?width=1904&format=pjpg&auto=webp&s=cbe572b28f116776ceabda0df4550b35cfa20f71\n\n&#x200B;\n\nPine Island is a company that is described as being a company that focuses on defense contracting. This could easily mean something regarding contractors working alongside the military. However it could also mean defense in the sense of warding off covid. Which is precisely what it is.\n\n[Firm Tied to Biden Contenders Tony Blinken, Lloyd Austin, Michele Flournoy Looks to Cash In On COVID Response (thedailybeast.com)](https://www.thedailybeast.com/firm-tied-to-biden-contenders-tony-blinken-lloyd-austin-michele-flournoy-looks-to-cash-in-on-covid-response)\n\n&#x200B;\n\nPine Island has ties to many within the Biden Cabinet such as Blinken and Flournoy. While I’m not sure exactly \\*what\\* this company does regarding covid, it’s defense contracting plan is aligned with doing what they deem to be making money off of their unique knowledge and position and ability to exploit the situation.\n\n&#x200B;\n\nhttps://preview.redd.it/9t2akbr8hjf71.jpg?width=1387&format=pjpg&auto=webp&s=8e15bc400445f4619e58cc4a1d6adc7cc21d1860\n\n&#x200B;\n\nhttps://preview.redd.it/g8ivewp9hjf71.jpg?width=1919&format=pjpg&auto=webp&s=4b0f9f517c55b1c4ffc8ca730af58159c81303fa\n\n&#x200B;\n\n&#x200B;\n\n# How this relates to the SPAC crackdown\n\nPine Island (Both Capital Partners and the Acquisition business) are listed as being located in Deleware and Ft. Lauderdale (Ken’s stomping grounds. Go check my aviation logs of his Bombardier). \n\nBack in November a financial statement audit was done regarding this company. It also sheds light on certain agreements regarding warrants that can be moved and when. \n\n&#x200B;\n\nhttps://preview.redd.it/3zds1slphjf71.jpg?width=1916&format=pjpg&auto=webp&s=2c5b979f7f819fb0763abace8d10d184ae60f7df\n\n[https://www.sec.gov/Archives/edgar/data/1822835/000110465920129527/tm2037104d1\\_ex99-1.htm](https://www.sec.gov/Archives/edgar/data/1822835/000110465920129527/tm2037104d1_ex99-1.htm)\n\nIn May they were delisted for failing to provide their financial filings. It was also stated by the SEC that they needed to amend regulations regarding their warrants. \n\n[https://www.sec.gov/Archives/edgar/data/1822835/000110465920131022/tm2037182d1\\_ex99-1.htm](https://www.sec.gov/Archives/edgar/data/1822835/000110465920131022/tm2037182d1_ex99-1.htm)\n\n[Pine Island Acquisition Corp. Announces Receipt of Continued Listing Notice From NYSE Relating to the Impact of Recent SEC Guidance on Accounting for Warrants :: Pine Island Acquisition Corp. (PIPP)](https://www.pineislandac.com/news/press-releases/detail/4/pine-island-acquisition-corp-announces-receipt-of)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/cizxlkushjf71.jpg?width=1918&format=pjpg&auto=webp&s=a9ca1512d951194743aed27df701275eb83ed59f\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nRemember how there has been information circulating regarding Bank of America and Citadel? Well it looks like they have seen where their clients were significantly impacted by this crackdown. \n\nhttps://preview.redd.it/j3zua87fhjf71.jpg?width=1920&format=pjpg&auto=webp&s=fef6a52e6a002c2b590c7d22bb7f5d52be85fb52\n\n&#x200B;\n\n&#x200B;\n\nHold on tight. What seems to have been the SEC going on wild goose chases that were unrelated are, in fact, completely related. Everything related to the markets is related to GME. Especially when they are in the hands of Ken Griffin via Citadel and are being delisted by the SEC.",
    "title": "👀🐱‍🏍SPAC Crackdowns. Ken Griffin's Company Pine Island was DELISTED IN MAY🐱‍🏍👀 Bank of America says their SPAC clients have slowed significantly.....I wonder why?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/oyhcte/spac_crackdowns_ken_griffins_company_pine_island/"
}