{
    "author": "Yonsei",
    "created_utc": 1615415809.0,
    "distinguished": null,
    "edited": 1615416005.0,
    "id": "m2ayql",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m2ayql",
    "num_comments": 80,
    "permalink": "/r/GME/comments/m2ayql/detailed_analysis_to_explain_what_happened_today/",
    "score": 616,
    "selftext": "**TLDR: Volume during 12:20pm - 12:41pm crash indicates this was either a large whale sell order (unlikely) or algorithmic short selling (likely). Keep HOLDING!**\n\nJust like you, I was stunned, amazed, bewildered, and intrigued as the price of $GME fell like a falling knife within minutes. As I watched the price plummet, the relatively low volume that transpired during that cliff dive didn't make sense to me.\n\nLet's dive in.\n\n&#x200B;\n\n[Today's Daily Chart w\\/ Volume](https://preview.redd.it/rzgy5t19x9m61.jpg?width=1320&format=pjpg&auto=webp&s=c766a3489225bfdb7fa8ce554cd1d0e517264d67)\n\nLet's zoom into the drop that started around 12:20 PM.\n\n[Price and Volume Chart in Minute Increments](https://preview.redd.it/yzmipqjzy9m61.jpg?width=1320&format=pjpg&auto=webp&s=516210096bb28774da52c10cb3241e302e923828)\n\nAs the price dropped, the peak minute volume was 936.7K. From 12:20 PM to the bottom at 12:41 PM, the total volume traded was 4.32 million shares. In the grand scheme of things, this is NOT A LOT of volume for such a violent price move.\n\nThis points to two possibilities in my mind.\n\n**Possibility #1 (Unlikely)**\n\nThe first possibility is that this was a large sell order by a whale looking to cash out. This is less likely in my opinion. If an actual whale was trying to sell out of its position, it would not sell all of its shares at one time cratering the stock price and inducing halts. They would trickle in sell orders throughout the day to get out of their position and maximize profit. This was definitely NOT retail selling, you could barely even put in a sell order fast enough when this was dropping.\n\n**Possibility #2 (Likely)**\n\nThe second possibility is that this was an algorithmic short attack to induce fear and panic selling. This is more likely in my opinion. If you look at the total volume during this time-frame along with the rate the stock was falling, this screams of a deliberate short attack. The volume throughout the week was not high enough to indicate shorts have covered. Conversely, there are actually less shares available to short at the end of the day. According to multiple websites, there are now only 150,000 shares available to short.\n\n**Conclusion**\n\nIn conclusion, this was most likely an algorithmic short attack from 12:20pm to 12:41pm. GME's thesis has not changed. A gamma squeeze is also a likely possibility tomorrow through Friday. I believe GME is restricted to short on upticks only (SSR) till tomorrow so it should be an exciting Thursday. Keep holding and remember... ALL SHORTS MUST COVER!",
    "title": "Detailed Analysis to Explain What Happened Today. Just Look at Volume.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m2ayql/detailed_analysis_to_explain_what_happened_today/"
}