{
    "author": "Scalpel_Jockey9965",
    "created_utc": 1616600238.0,
    "distinguished": null,
    "edited": 1617058544.0,
    "id": "mc8trw",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mc8trw",
    "num_comments": 301,
    "permalink": "/r/GME/comments/mc8trw/dtcc_just_filed_another_rule_yesterday_that/",
    "score": 5243,
    "selftext": "Taken from [https://www.dtcc.com/legal/sec-rule-filings](https://www.dtcc.com/legal/sec-rule-filings)\n\nSR-NSCC-2021-004\n\nAmend the Recovery & Wind-down Plan (R&W)\n\nA few excerpts:\n\n\"The R&W Plan is structured as a roadmap that defines the strategy and identifies the tools available to NSCC to either (i) recover, in the **event it experiences losses that exceed its prefunded resources** (such strategies and tools referred to  herein as the “Recovery Plan”) or (ii) wind-down its business in a manner **designed to permit the continuation of NSCC’s critical services in the event that such recovery efforts are not successful** (such strategies and tools referred to herein as the “Wind-down Plan”). The recovery tools available to NSCC are intended to address the risks of (a) uncovered losses or **liquidity shortfalls resulting from the default of one or more of its Members,** and (b) losses arising from non-default events, such as damage to NSCC’s physical assets, a cyber-attack, or custody and investment losses, and the strategy for implementation of such tools.\"\n\n\"Additionally, with respect to the second entry in Table 5-B, “Loss Allocation,” the descriptive text in the “Responsible Body/Personnel” column would be revised to more closely align with the same language contained in Rule 4. The revised text would state, “Members will be obligated to pay the loss allocation on the second business day\"... **However, this is not the same language used to describe this timing in Rule 4. In order to be consistent with the language formulation set out in Rule 4, the proposed rule change would revise this sentence to state, “Losses charged to Members are required to be paid by Members on the second business day after the Corporation issues any such notice of a loss allocation charge and, if not timely paid by any Member, the Corporation may treat that Member as having failed to satisfy its obligation and apply the Clearing Fund deposit of that Member to satisfy its loss allocation obligation.\"**\n\n\\^This looks oddly familiar to the  to DTC-2021-003 which clarified that members must report their positions daily. (It previously stated that it was both daily and monthly which caused many members to just ignore the reporting rule altogether). More clarification means less ability to wiggle out of paying for major losses.\n\n\"Section 5.3 (Liquidity Shortfalls) of the **Plan identifies tools that may be used to address foreseeable shortfalls of NSCC’s liquidity resources following a Member default.** The goal in managing NSCC’s qualified liquidity resources is to maximize resource availability in an evolving stress situation, to maintain flexibility in the order and **use of sources of liquidity, and to repay any third-party lenders of liquidity in a timely manner.** This section includes a table (Table 5-C) that lists NSCC liquidity tools and resources.  The proposed rule change would update this section to include a reference to cash proceeds from outstanding term debt issuance in addition to the other examples of NSCC’s qualifying liquid resources. A footnote would also be added providing the citation to NSCC’s advance notice filing covering the term debt issuance.\"\n\nThe big point is the one above\\^\n\n**They want to have this D-day plan crystal clear in the case that shorters can't pay back shares**\n\nI'm still in the process of reading it but it looks like they are trying to change the rules so that they have enough resources to continue operating in the event of what they are defining as a \"crisis continuum\"\n\nTLDR: looks like the CYA on part of the DTCC is continuing. Also, its very interesting that this was put out after Rule 801 and the clarification on reporting positions. It's a long document so I don't think this was written after they started looking at Citadel's books, but evidence is mounting that they are preparing for the worst. \n\nJust to be clear, THIS IS NOT PLAUSIBLE DENIABILITY, This is them overhauling their plan and resources to pay back shares in the event the shorts can't.\n\nEdit 1: added a few more interesting excerpts\n\nEdit 2: thanks for the awards! Our biggest defense from FUD is information (and of course 💎🙌)\n\nEdit 3: A warm thank you to u/Leaglese for picking this apart bit by bit. The rule is indeed active due to an exception clause in SEC filing rules. So NCSS-2021-004 is active as of Tuesday.\n\nEdit 4: Well guys and galls (and apes of all shapes and sizes) NCSS-2021-004 just passed today 3/29/2021, effective immediately and likely implemented ASAP. Seems to me like someone in high places is preparing for a \"crisis continuum\". (Note: because this is only a legal rewording to reduce the ability to wiggle out of the W&R plan, the DTCC does not need to wait for the end of the comment period and can enact it ASAP)",
    "title": "DTCC just filed another rule yesterday that overhauls their plan in the event of an economic crisis such as a major member default",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mc8trw/dtcc_just_filed_another_rule_yesterday_that/"
}