{
    "author": "Leaglese",
    "created_utc": 1616626691.0,
    "distinguished": null,
    "edited": 1616639267.0,
    "id": "mcj8ly",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mcj8ly",
    "num_comments": 235,
    "permalink": "/r/GME/comments/mcj8ly/failure_to_deliver_ftd_dd_can_shorts_escape/",
    "score": 3627,
    "selftext": "\nWelcome to another in my legal series DD, where short whales naked short and create FTDs, **and oh baby, does it matter**\n\nAs is the norm, TLDR at the top:\n\nTLDR: FTDs and Fail to Receive (“FTR”) shares are treated as ‘real’ any other share to the NSCC, and so **will be paid out by the NSCC if shorts are forced to cover, which they will be**\n\nI just wanted to take a moment to thank all of the apes who have read and enjoyed my DD’s so far, and even tagged me in posts for my view. I’m flattered.\n\nWhilst I do come from a legal background, it is very rare in this profession anyone gives even half a damn about your research as opposed to the results you provide.\n\nSo thank you.\n\nI also apologise to those apes who requested my DD into the ‘wind down’ plan for the NSCC to be first, this is coming!\n\nBut after today’s price manipulation it felt more important to address whether market makers have some kind of backdoor to settle out their naked shorts or FTDs, either via the backdoor dark pool as my previous DD may have inadvertently caused FUD for, or otherwise.\n\n**Spoiler alert, NOPE**\n\nAs always, this is not financial or legal advice, ape fling poo, invites you to fling it back.\n\n**STFU already, on with the DD**\n\nFine, so before I start providing walls of text whilst apes await rocket emojis 🚀, I will provide below a brief summary on real shorts, naked shorts and their pros and cons, as they are directly linked to FTDs.\n\nNormal short selling is one party locating a share to borrow from another, selling it at current market price on the assumption the price will fall, to then buy it back later and pocket the difference; together with a borrow fee being given to the lender each day until they can settle for their target lower price.\n\n**Usually when a traditional short sale occurs, the proceeds of the sale, together with extra capital, are left as collateral with the borrower.**\n\nNaked short selling is the practice of a seller, who allegedly has the “reasonable belief” they will be able to buy a share back later, creating a “phantom share” and selling it at market price, and promises to buy it back later **WITHOUT a borrow fee.**\n\nThe benefit for a naked short seller therefore is **no borrow fee and the ability to short attack with shares that don’t form part of the float without limit as they don’t even exist**\n\nEdit: I think it's necessary to say here if the shorts exceed the float, any member **can't say they have a reasonable belief to buy back the share at this point as we think is the case with GME**\n\nAn FTD occurs when a seller of a borrowed or naked short fails to provide that stock to the person they sold it to within the standard three day settlement period.\n\nThis can be extended by market makers provided they engage in *bona fide market making*, which is stupidly broad and both the SEC and FINRA have brought numerous actions against market makers who did not engage in bona fide market making , examples include via complex conversion options as our friend /u/EliteWarden has described, to even short stocks on the SSR. **Yes, I’m looking at you Kenny.**\n\nYou still with me apes? Buckle up\n\n**So who deals with FTDs?**\n\nThe NSCC and DTC. The NSCC ‘clears’ the stocks by ‘net settlement’ of all members, i.e. the total sales and buys are calculated amongst all members of each stock and arranged into a nice neat (or messy) little package of who is owed what.\n\nThe DTC then uses the above information from the NSCC to determine who *pays* what by debiting and crediting members, and actually facilitates the process of the “stock” changing virtual hands.\n\n*As a tasty aside, a lot has been said about the NSCC’s SLD and Clearing Fund, but the DTC has one too!*\n\n**So what happens when a fail occurs?**\n\nWhen a fail occurs, the short position **remains open** and is called an FTD and the NSCC is therefore unable to deliver the stock to those who bought the counterpart long position, and **those who hold a long position owing to buying this, obtain a Fail to Receive or FTR position**.\n\nThis is essentially an IOU from the NSCC, **but those with an FTR lose the ability to vote and lend this stock, but for all other purposes, they hold a ‘phantom long’ to the opposite ‘phantom short’ of the other party**\n\n*It is important to note, you will NOT know whether the stock you hold is an FTR or an actual share, as the NSCC’s settlement system randomises who holds a real share or an FTR each day, therefore in GME’s situation, it’s likely each ape holds some real shares and some FTRs, especially for those who bought recently*\n\n**Whilst your cash is still taken, the FTD or IOU is held by the NSCC as collateral until the FTD is delivered, and for each day that passes, the difference in price is scalped from the holder of the FTD, equivalent to what the NSCC would have to pay on the market to purchase it.**\n\nBut as you may imagine, this is rightly critcised as it incentivises the naked short holder to *create more naked shorts and crash the price so they pay less, and this is in my view is definitely the case for GME*\n\nThe NSCC therefore essentially becomes the **lender of the naked short to the long and there is no time limit for this lending via its “Stock Borrowing Program\"**\n\nI know this seems doom and gloom so far. But don’t worry. \n\n**Do you really think the NSCC wants to be on the hook for infinite naked shorts and to pay back the FTRs?**\n\nDo you start to see why the SLD 801 filing and **daily** reports on positions make sense?\n\n**Enter the Buying-in process**\n\nWhere a naked short seller FTDs, they can **be forced to purchase and deliver the stocks to the buyer, should another member with a long position file a Notice of Intention to Buy-In.**\n\nThis process essentially forces naked shorts to provide the damn stock to the FTRs either on the day, or within T+2 and allocates the buy in depending on how long that member has held the FTD.\n\nIf the member fails to provide and satisfy the FTDs, the NSCC will;\n\ni. Buy the shares from whatever marker it can;\n\nii. Deliver the real shares to the buy in party;\n\niii. Cancel the FTDs equivalent to what has been purchased; and\n\niv. Charge the naked short seller the difference to settle.\n\nNormally, this would not cause much harm as the settlement of other real shares would be allocated to the member requesting the buy in on the day. \n\nHOWEVER, if no ‘real’ shares are actually being traded as we suspect with GME; this will cause a catastrophic price hike as all naked positions for, I don’t know, a long whale with a shit load of FTRs could cause.\n\n**Either way, the thing to take away is that no matter what, if you hold FTR or real shares, you are treated as holding a real share to the NSCC and therefore, WILL be paid. The Buy-in procedure also provides a potential golden gun to the long whales to really pop this thing off if FTDs increase.**\n\nEdit: I feel it's important to note the 801 SLD filing and Clearing Fund DD I have done, soon to be calculated daily, **will likely increase the sums owed by naked shorts every  day as this presents a substantial risk to the NSCC**\n\nOh, sorry 🚀🚀🚀🦍🦍🦍",
    "title": "Failure to Deliver (\"FTD\") DD - Can shorts escape settlement? Nope and the potential Notice of Intention to Buy-in Catalyst",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mcj8ly/failure_to_deliver_ftd_dd_can_shorts_escape/"
}