{
    "author": "GoldenSheriff",
    "created_utc": 1616614753.0,
    "distinguished": null,
    "edited": 1616633881.0,
    "id": "mcelm5",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mcelm5",
    "num_comments": 1075,
    "permalink": "/r/GME/comments/mcelm5/if_you_dont_understand_why_gme_could_moon_even/",
    "score": 12661,
    "selftext": "There is a lot of wonderful DD out on this subreddit, and a lot of wonderful apes that have realised that if the apes hold, they moon. It doesn't matter whether or not the price is dropping. However, it is a huge bunch of technical and advanced theories that is required to understand why the MOASS is very likely to happen even though (or because) the price is dropping.\n\n&#x200B;\n\nIn this post I have tried to create an easy explanation of why this stock can take off so that everyone can get on board with reading the more technical DD.\n\n&#x200B;\n\n**Nothing I write in this post is financial advice. Don't use it to decide whether or not to invest.**\n\n&#x200B;\n\nNow to the explanation:\n\n**SHORTING**\n\nLets say Gamestop issued 100 shares on the open market. This means that there are only 100 shares availiable in total.\n\n&#x200B;\n\nAn institution called The Institution buys all 100 shares.\n\n&#x200B;\n\nNow a hedgefund called Shitadel think that gamestop stock price is dropping because of COVID-19. Therefore they borrow theese shares from the institution. They have to pay a fee every month to keep holding on to this share so the institution agrees to the deal. They also have an expiry date where they have to buy and deliver the share back to the lender (The Institution).\n\n&#x200B;\n\nNow Shitadel sells the 100 shares in the open market. They sell it for 10$ a share.\n\n&#x200B;\n\nShitadels plan is to wait until the price drops so that they can buy the share back at a lower price. Lets say 1$. Now if they succed they sold it for 10$ and bought it back at 1$ before they delivered the share back to its lender The Institution.\n\n&#x200B;\n\nIf this is the case then Shitadel won 9$ for every share they bought.\n\n&#x200B;\n\nThis process is called shorting a stock.\n\n&#x200B;\n\n**SUPPLY AND DEMAND**\n\nNow lets talk about the most basic economic theory on why prices increase and drop.\n\n&#x200B;\n\nLets say you live in Norway. There is a lot of fresh water where ever you go. This means the supply is high.\n\n&#x200B;\n\nYou have 10 bottles of water that you want to sell. The market is the 100 people living nearby. So you walk door to door asking if they want to buy a bottle of water. The answer is NO. Nobody needs to buy water, they can simply get water from the spring for free. This means that the demand is low compared to the supply. Everyone can have 100 tonns of water for free, so why pay for a bottle of water? It makes no sense.\n\n&#x200B;\n\nTherefore you move to the Sahara desert. You bring your 10 bottles of water and the new market is the 100 people living nearby. Now in the Sahara desert there is no water. This means thet the supply is very low. It is very hot so people living here really need the water. This means that the demand is very high.\n\n&#x200B;\n\nWhen you walk door to door and ask if they want water they will say YES! Then they will ask how much you charge, and you can charge a huge amount since the people living there needs the water. Lets say 5000$. If they dont get the water they might not survive. Therefore you can charge as much as you like.\n\n&#x200B;\n\nThis is obviously highly unethical and should not be done. Give them the water for free. Don't be a douche. But it is a story that shows that when the supply is low and the demand is high the price will increase. This goes for Gamestop too.\n\n&#x200B;\n\n**NAKED SHORTING**\n\nBack to our example.\n\n&#x200B;\n\nGamestop issued a 100 shares.\n\n&#x200B;\n\nThe institution bought them and lent them out to Shitadel.\n\n&#x200B;\n\nShitadel is now waiting for the price to drop so they can buy the share back and deliver it to the lender for a cheaper price.\n\n&#x200B;\n\nSince The Institution owns all 100 shares of the 100 shares that are issued, we say that the institutional ownership is 100%.\n\n&#x200B;\n\nSince Shitadel borrowed and sold alle the 100 shares we say that the short interest is 100%.\n\n&#x200B;\n\nNow Shitadel feels certain that Gamestop is going bankrupt. If they do go bankrupt, Shitadel won't have to deliver the shares back.\n\n&#x200B;\n\nTherefore they use the ace in the sleeve. They are allowed to naked short a stock. This means that they sell a stock on the open market that DOES NOT EXIST, with the promise of delivering back a real share when the expiration is due.\n\n&#x200B;\n\nSo Shitadel naked shorts another 100 shares. They sell it on the open market and get money. Then they wait until Gamestop is bankrupt so they dont have to deliver a real stock back at all. HAHA, they think. We will get rich.\n\n&#x200B;\n\nWhen they sell theese shares The Institution buys the 100 naked shares. This means that the intitutional ownership is 200% of the 100 real shares. It also means that the short interest is 200%.\n\n&#x200B;\n\nThe best part is that when they naked shorted another 100 shares the price dropped automaticly since the supply increased and the demand was still the same. High supply + medium demand = lower price.\n\n&#x200B;\n\nNow the GME price is only at 5$. In the beginning it was 10$.\n\n&#x200B;\n\nThis is wonderful, Shitadel thinks, so they do it AGAIN.\n\n&#x200B;\n\nThey naked short another 100 shares.\n\n&#x200B;\n\nThis time retail investors buy theese 100 shares (buying the dip).\n\n&#x200B;\n\nNow retailers own 100% of the 100 real shares. Institutions owns 200% of the shares. The short interest is at 300% of the real shares that gamestop issued to begin with.\n\n&#x200B;\n\nThe supply is even higher now, and the demand is still the same. High supply + low demand = lower price.\n\n&#x200B;\n\nThe new price is 3$.\n\n&#x200B;\n\nShitadel is very happy. They have made the price drop a lot.\n\n&#x200B;\n\nAll of a sudden Gamestop comes with horrific news. They have changed the board, they are doing extremely well, THEY WILL NOT GO BANKRUPT.\n\n&#x200B;\n\nShitadel panicks.. They know they have to deliver the shares back to the lenders at some point. Because GAMESTOP IS NOT GOING BANKRUPT.\n\n&#x200B;\n\nTherefore they make an evil plan. They will drop the price even more so that people paninck and sell all their shares and Shitadel can buy them at a low price and give them back to the lenders.\n\n&#x200B;\n\nTherefore they naked short another 100 stocks. But nobody is selling their shares.\n\n&#x200B;\n\nThey try again with another 100. But nobody is selling their shares. People are only bying the dip.\n\n&#x200B;\n\nHow are Shitadel supposed to cover now? There are nobody willing to sell their shares.\n\n&#x200B;\n\nThis means that the tables have turned. Shitadel has to get the shares back before the expiration is due. This means that the DEMAND IS HIGH! The demand is more than 100 shares. They have to buy back 500 shares and deliver them. But nobody is selling so the supply is SUPER LOW!\n\n&#x200B;\n\nWhat does this do to the price? Well.. The price will skyrocket.\n\n&#x200B;\n\nHowever the retail monkeys have to look at the panick naked shorting that Shitadel is up to. This brings the stock price down a lot. This is nervewrecking for the retail investors. But they know that Gamestop is not going bankrupt, so at smoe point Shitadel HAS to buy their shares back. And when the do, they are strapped in their seats ready for launch off to Alpha Centauri.\n\n&#x200B;\n\nIn short: The more the price drops, the higher the price will shoot.\n\n&#x200B;\n\nNow.. This sounds unrealistic. Institutional ownership cannot be more than a 100%. It sounds like a fairytale. So lets take a look at a couple of stocks.\n\n&#x200B;\n\n[https://www.nasdaq.com/market-activity/stocks/coke/institutional-holdings](https://www.nasdaq.com/market-activity/stocks/coke/institutional-holdings)\n\n&#x200B;\n\n[COKE has 49&#37; institutional ownership](https://preview.redd.it/upiko90q21p61.png?width=605&format=png&auto=webp&s=1234dfb6aff547130393d2206ef8c927c254010b)\n\n&#x200B;\n\n[TESLA has 45&#37; Institutional Ownership](https://preview.redd.it/9xrvv3yt21p61.png?width=605&format=png&auto=webp&s=565917116625a6c122c9ba160c4a67fa288e9ac4)\n\n&#x200B;\n\nNow how about gamestop?\n\n&#x200B;\n\n[GAMESTOP HAS 105&#37; INSTITUTIONAL OWNERSHIP?! WHAAT?](https://preview.redd.it/n85qxe8y21p61.png?width=605&format=png&auto=webp&s=fa93b75fa743a33c4f47c5fc985bb3f0cbd98891)\n\n&#x200B;\n\nThis cant be right. Let's look at another source.\n\n[https://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=14%3A0P000002CH&sdkVersion=2.59.0](https://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=14%3A0P000002CH&sdkVersion=2.59.0)\n\n&#x200B;\n\n[COKE has 58&#37;](https://preview.redd.it/manb2uf731p61.png?width=605&format=png&auto=webp&s=9647710e65a6d8327033cc88fc0b00619ad58188)\n\n&#x200B;\n\n[TESLA has 74&#37;](https://preview.redd.it/3u69hx5931p61.png?width=605&format=png&auto=webp&s=79b798131b02007fc80a038e78806af7dd1ab908)\n\n&#x200B;\n\nNow how about gamestop?\n\n&#x200B;\n\n[GAMESTOP HAS MORE THAN 200&#37; INSTITUTIONAL OWNERSHIP?!?!](https://preview.redd.it/9hbx188c31p61.png?width=605&format=png&auto=webp&s=26f951210770a1a8c92113a1c53cde31c13ada3f)\n\n&#x200B;\n\nWell.. I don't believe what i read in the news anymore. I dont believe the price I see on GME. The only thing I truly believe in is that the price of gamestop will launch to Alpha Centauri some time in the future.\n\n&#x200B;\n\nTLDR: When the price is dropping, the rocket will take off even harder!\n\n&#x200B;\n\nIf you want to read a little fluff I have also posted this not too long ago. Have a nice day Apes!\n\n[https://www.reddit.com/r/GME/comments/m8f0ho/this\\_was\\_posted\\_back\\_when\\_gme\\_was\\_at\\_40\\_and/](https://www.reddit.com/r/GME/comments/m8f0ho/this_was_posted_back_when_gme_was_at_40_and/)\n\n&#x200B;\n\nNow I will go back to eating a taasty crayon (I love the taste of the red ones) <3 <3\n\n&#x200B;\n\n&#x200B;\n\n**EDIT1 : In the last picture, Fidelity is reported two times. Keep this in mind when reading the 200 number. There are other institutions counted multiple times too. Thank you DiamondBagz for letting me know.**\n\n&#x200B;\n\n**Another ape says that this is just different parts of the institutions owning different amounts of the shares. If this is true the 200% can be a real number. Thank you to**  \n\n[**TheUncleverestDev**](https://www.reddit.com/user/TheUncleverestDev/) **for pointing this out.**\n\n&#x200B;\n\n**\" If you read through all the institutions, Capital, Blackrock, and Fidelity all are counted number of times. This is because each company has multiple ETFs, Mutual Funds, etc, that make up various \"entities\" at each company. I.e. Fidelity can be broken down into 1) Fidelity Management and Research Company LLC, 2) Fidelity Management and Research Company, and 3) FMR Inc. 1) Might be comprised of Freedom Fund 2060, New Age Retail ETF, and Gaming ETF. 2) Might be comprised of Freedom Fund 2055, Russell 2000 Index, and FucktheHF Mutual Fund. 3)... you get my point. The idea is that each \"company\" can own different amount of shares of any company. For example, New Age Retail ETF own 100k shares of GME and FucktheHF Mutual Fund has 1M shares of GME. They are two separate entities in two different subgroups within the larger umbrella that is Fidelity. Don't forget that these \"shares\" are actually owned by individual people through 401ks, IRAs, or Individually. So it can definitely get confusing. But the moral of the story is that the numbers DO NOT GET COUNTED MULTIPLE TIMES. This means that Fidelity is literally holding 1.1M shares of GME, not just 1M with 100k being counted twice. OP is stating things properly.**\n\n**Why they need to split up the company into multiple subgroups, is beyond me... probably to keep track of the hundreds of mutual funds and ETFs they manage. Most of these trillion dollar companies operate this way. Just bear that in mind. \"**\n\n&#x200B;\n\n&#x200B;\n\n**EDIT2 : Naked shorting is not done out of thin air. They have to go trough a process of shorting a share that is allready shorted. You can read more about it on the link below. This is just ment as an easy explanation of the situation.**\n\n[https://www.investopedia.com/terms/n/nakedshorting.asp](https://www.investopedia.com/terms/n/nakedshorting.asp)\n\n&#x200B;\n\n**EDIT3 :**  [**kylac1337kronus**](https://www.reddit.com/user/kylac1337kronus/)  **the kind ape saw an important mistake I have written in the post. Short positions don't have an expiration date. However, they can be forced to cover their short due to a margin call.**\n\n&#x200B;\n\n**When the price of the stock increases, the shorts have to put more money in to show that they are capable of bying the share back at the current price. Now if you shorted at 40$ and the price suddenly increase to 500$ you have to pay up and show the money. Or else, the stock will be bought back at the current price with force. This will increase the price further. The name of this action is a margin call.**\n\n&#x200B;\n\n**EDIT4: Thank you for all the awards! You rock :D**\n\n&#x200B;\n\n**EDIT5 :**  [**33a**](https://www.reddit.com/user/33a/) **the other kind ape pointed out another simplification in my post. This is the comment:**\n\n&#x200B;\n\n***\" At a high level this is correct, but you are missing a really big detail:***\n\n***In order to naked short they need to be able to locate shares to borrow. The whole GME shorting trick is only possible if there are shares they can borrow, and to do this they really need retail investors.***\n\n***I believe Robinhood and other memebrokers are trading out their customers and loaning out their shares for cheap to the big brokers like Citadel. Without this supply they can't keep shorting.\"***",
    "title": "If you don't understand why GME could moon even though price is dropping. Please read this easy explanation. Not financial advice!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mcelm5/if_you_dont_understand_why_gme_could_moon_even/"
}