{
    "author": "dat-danku",
    "created_utc": 1621318468.0,
    "distinguished": null,
    "edited": 1621321985.0,
    "id": "nf303t",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nf303t",
    "num_comments": 65,
    "permalink": "/r/Superstonk/comments/nf303t/challenge_accepted_glacier_capital_exists_and_has/",
    "score": 1075,
    "selftext": "Glacier Capital is real as fuck, fellow 🦍.\n\nUnless the Commission de Surveillance du Secteur Financier (CSSF, financial regulator of Luxembourg) is deceiving my eyes....\n\n([http://glaciercapital.lu/wp-content/uploads/2017/09/FINISHED-GC-Fact-Sheet.pdf](http://glaciercapital.lu/wp-content/uploads/2017/09/FINISHED-GC-Fact-Sheet.pdf))\n\nThis  indicates launch of 9/6/17 (June 9th for us AmeriApes? Tinfoil hat **INITIATE**..?). They appear to be registered under the *Commission de Surveillance du Secteur Financier (CSSF)*, which is a financial regulator in Luxembourg. I kind of found out how to navigate the CSSF website and found Glacier Capital. It was difficult to find them because I couldn't find hedge funds initially, but they are under an Alternative investment fund managers registered (AIFM) and I have no clue what it means. **It appears they definitely do exist, and have been incorporated in Luxembourg for 4 years.**\n\n([https://searchentities.apps.cssf.lu/search-entities/search?&st=advanced&entNames=Glacier](https://searchentities.apps.cssf.lu/search-entities/search?&st=advanced&entNames=Glacier))\n\n\n\n([https://searchentities.apps.cssf.lu/search-entities/entite/details/2620136?lng=en&q=&st=advanced&entNames=Glacier](https://searchentities.apps.cssf.lu/search-entities/entite/details/2620136?lng=en&q=&st=advanced&entNames=Glacier))\n\nThis link above indicates that they are still active and have been constituted since March 22, 2017.\n\n&#x200B;\n\n([https://www.datocapital.lu/companies/Glacier-Capital-S.á-R.L..html#reports](https://www.datocapital.lu/companies/Glacier-Capital-S.á-R.L..html#reports))\n\nThis dato website (above) contains some reports but are behind a paywall. Seems like a financial data website for Luxembourg. On this website, is a universal entity code (4638-2765-7303-8541), along with a chart showing their website visits spiking in May. They had a *slight* bump in January, but not much else. Idk what the number means but imma research and report back.\n\n(Edit: seems like something for the website? idk, too smooth rn. Here is the beginning portion of the definition: *The Universal Entity Code (UEC) is the internal identifier for all the companies and directors in Dato Capital database. It's a 16 digit numeric string composed of a 15 digit number and a validation control number.)*\n\nI would continue on my dive, but it seems like the answer is **clear** so I decided to stop here.\n\nConclusion: If I had to bet, I'd say **Glacier Capital does, in fact, exist** and that they are foolish for opening short positions on $GME at the price they stated. I'd be shocked if they faked financial reports for years and somehow falsely registered back in 2017 too...it seems more likely that they got bought out or something along the lines of corruption/collusion/being an actual retard that believe Cohen won’t be able to transform a company in the e-Commerce industry. \n\nI figured I'd be researching this for hours but found some pretty definitive information within 20 minutes of a google search. Not mad or anything, but that's what is confusing me: why is that post on the front page getting so much traction and such little vetting? I am also curious on the information posted in that article written by Marc D from Glacier Capital; not saying we should believe a bear, but saying we should analyze all DD out there and come to our own findings as to why we like the stock.\n\n&#x200B;\n\n***If I'm wrong in any way and have fell short of the challenge, please let me know. I accept all constructive criticism.***\n\n&#x200B;\n\nEdit: tagging u/timmmmmmmyy, OP of original post claiming Glacier Capital does not exist and offering the challenge. I'd like to see any counterpoints from anyone as well.\n\nEdit 2: appreciate any awarding 🦍 out there, just trying to help this wonderful community as we are on our way to Tendieland. Now, I must return to my favorite crayón.",
    "title": "Challenge Accepted: Glacier Capital exists and has existed since 2017, according to the CSSF.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nf303t/challenge_accepted_glacier_capital_exists_and_has/"
}