{
    "author": "PowerHausMachine",
    "created_utc": 1621396832.0,
    "distinguished": null,
    "edited": false,
    "id": "nfvefa",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nfvefa",
    "num_comments": 75,
    "permalink": "/r/Superstonk/comments/nfvefa/icc_members_may_have_paperhanded_gme_long/",
    "score": 993,
    "selftext": "Credit to  [u/FriedrichWeyland](https://www.reddit.com/user/FriedrichWeyland/)  who explains why Morgan Stanley may have sold their GME positions.\n\n[https://www.reddit.com/r/GME/comments/nfqkgv/sricc2021005\\_and\\_morgan\\_stanley/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/nfqkgv/sricc2021005_and_morgan_stanley/?utm_source=share&utm_medium=web2x&context=3)\n\nOn page 6 of  SR-ICC-2021-005 ([https://www.sec.gov/rules/sro/icc/2021/34-91806.pdf](https://www.sec.gov/rules/sro/icc/2021/34-91806.pdf)), one of the recovery tools/actions ICC can use is :\n\n\\--Partial  tear-up of remaining  positions  (ICC Rules  20-605(f)(iii)  and  809)  where ICC terminates  positions  of non-defaulting  CPs that exactly offset those in the defaulter’s remaining  portfolio;  and \n\n \\--Reduced gains distributions  (“RGD”) (ICC Rule 808) for up to five consecutive business days,  allowing  ICC to reduce payment  of variation,  or mark-to-market,  gains  that would otherwise  be owed to  CPs, as ICC attempts  a secondary  auction  or conducts  a partialtear-up. \n\nWhat this clause is saying is that if the defaulting member has positions like say short GME, any non-defaulting member who has an offsetting position (in this case long GME) would have that offsetting position terminated. \n\nThe question is how does the ICC define the term \"terminating\" a position. Do they force the non-defaulting member to sell their offsetting position? Is the offsetting position taken away from the non-defaulting member and just used outright to cancel the position the defaulter passed to ICC members? \n\n&#x200B;\n\nIn options, when an option is terminated it means the buyer is legally allowed to cancel an executed trade. I just don't know how \"terminate\" would be defined in this case. Anyone care to chime in?",
    "title": "ICC members may have \"paper-handed\" GME long positions because of SR-ICC-2021-005 and that they believed MOASS was coming.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nfvefa/icc_members_may_have_paperhanded_gme_long/"
}