{
    "author": "SpaceXGonGiveItToYa",
    "created_utc": 1621333354.0,
    "distinguished": null,
    "edited": 1621342090.0,
    "id": "nf71qg",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nf71qg",
    "num_comments": 922,
    "permalink": "/r/Superstonk/comments/nf71qg/suspiciously_high_number_of_awards_given_to/",
    "score": 12696,
    "selftext": "By now most of you have probably seen the recent posts about Glacier Capital. What started off as a mildly amusing news story is now being treated as SHFs possibly trying to hide short positions using Glacier as a facade. I was just scrolling through Hot and came across [the Glacier post](https://www.reddit.com/r/Superstonk/comments/nezcn1/glacier_capital_does_not_exist/) again, except this time I noticed it has an absurd number of awards, especially compared to it's upvote count.\n\n[It has 3,400 awards and counting](https://preview.redd.it/mu2w19wwquz61.png?width=806&format=png&auto=webp&s=cc544bf4a15fbccf9ce821f0282661fff100a15f)\n\nNow, obviously I didn't know how many awards posts with a lot of upvotes tend to get, but this number seemed a tad suspicious, so I had a look at Top Posts of All Time. What I found is, with the exception of House of Cards (3400), Warden's DD last week (1270) and Rensole's apology post (1130) (there may be other posts but you get the gist), the top posts on this sub get a few hundred awards at most. Something else to bear in mind is, this was only posted 7 hours ago and is already on par with the most awarded post on this sub, yet with fewer upvotes. Then i clicked on the award breakdown and it became a lot clearer. Unlike the other top posts which have a smorgasbord of different awards, this post has nearly 3,000 All-seeing upvote awards and 400 other awards. Compare this to HoC which only has 245 All-seeing upvotes.\n\nMake of this what you will but someone REALLY wants this post to be seen. I'm not going to speculate whether this is Kenny and his Mayo gang or DFV or whatever, but someone wants this post to be seen. There's 2 obvious reasons, this post is really onto something and is worth investigating even more, or it's a false narrative they're attempting to sow to distract us.  [Here](https://www.reddit.com/r/Superstonk/comments/nf2q78/glacier_capital_exists_and_its_much_spicer_than/) is another post, worth having a look at that explores this second possibility in detail. Again, draw your own conclusions, I'm not picking sides, just highlighting something that seems a little fishy.\n\n[Also notice the 'normal' number of awards](https://preview.redd.it/j7ankby1uuz61.png?width=807&format=png&auto=webp&s=308be232244fe6c2fe1ec33f58c8142bbba9ac4a)\n\n&#x200B;\n\n&#x200B;\n\nEdit: Just to clarify the reason I made this post because I feel like some people are missing the point. This isn't a groundbreaking discovery, I just wanted to highlight the likelihood that the Glacier post was given A LOT of artificial exposure as a distraction and to clog up the sub. Well they seem to have managed that somewhat but apes figured it out pretty quickly. We all need to move on now and forget about Glacier, it's all noise. Buy. Hodl. Vote.",
    "title": "Suspiciously high number of awards given to Glacier Capital post",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nf71qg/suspiciously_high_number_of_awards_given_to/"
}