{
    "author": "rmrthe5thofnov",
    "created_utc": 1621393979.0,
    "distinguished": null,
    "edited": 1621396733.0,
    "id": "nfufdh",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nfufdh",
    "num_comments": 92,
    "permalink": "/r/Superstonk/comments/nfufdh/wes_christian_ama_typically_the_issuer_has_the/",
    "score": 1591,
    "selftext": "First of all, thank you to all of the mods, Dave Lauer, and Wes Christian for putting on this AMA.  It was so enlightening and really gave a lot of hope for some justice coming in the near future.  I absolutely can not wait for round 2 AMA with Wes.\n\nGME announced they had completed their at-the-market equity offering on April 26th, 2021, to the tune of 3,500,000 shares sold for proceeds of $551,000,000.  The program had been approved for raising up to $1 billion.\n\nAssuming the voted shares count ultimately shows 200% of the float voted, (do any of you really believe it will be that low?  What could it be, 300%? 400%?  Higher??) then it should be fairly simple to argue the share price, on the date of the equity offering, should be higher at a multiple equal to or greater than the multiple of shares over voted.  This should easily satisfy the minimum requirement of $100 million in losses for a lawsuit against the market manipulators on behalf of a law firm such as Christian Smith & Jewell.\n\nExciting, indeed!  Here's to RC and crew pursuing this to the fullest!\n\nEdit:  Thank you for the awards, and obligatory 💎👐🚀🚀🚀🚀🚀🌕",
    "title": "Wes Christian AMA: \"Typically the issuer has the largest amount of damages\" GME left HALF A BILLION DOLLARS on the table from their recent at-the-market equity offering program! This could easily be proven to be losses!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nfufdh/wes_christian_ama_typically_the_issuer_has_the/"
}