{
    "author": "bobsmith808",
    "created_utc": 1623370521.0,
    "distinguished": null,
    "edited": 1623441283.0,
    "id": "nx2mg4",
    "text_only": true,
    "flair_id": "3d403642-b1c0-11eb-9505-0e759e60d835",
    "flair_text": "🚨 Debunked 🚨",
    "name": "t3_nx2mg4",
    "num_comments": 445,
    "permalink": "/r/Superstonk/comments/nx2mg4/statistical_proof_that_hedgies_r_fuk_and_the_repo/",
    "score": 2903,
    "selftext": "# DEBUNKED UPDATE:  Because the R^2 value says there is other things at play in the observed relationships, this means that the title of this post is wrong, but you can still learn from it, so I'll leave it up.  It's important to build knowledge and admit when you're wrong - that's how we find truth.  Thanks to all the stats apes that helped point out the flaws in this.  Back to the drawing board...\n\nHi Apes, Bob here again. I got a bit interested in the repo rates and how they might relate to GME. So I told my wife she cannot see her boyfriend until she runs the numbers. Naturally, she did this as fast as possible so she can get back to spending time with those that matter most to her in life, so please forgive me if anything is out of place here.\n\n**TADR at the bottom**\n\nAs you’re probably aware, the reverse repo rate has been steadily climbing in the last couple weeks, and we’ve seen 3 record high days in a row now, with today (6/10 being $534B). That’s a lot of tendies piling up …\n\n&#x200B;\n\nhttps://preview.redd.it/889hrclb4j471.png?width=624&format=png&auto=webp&s=fbfd255d193a1f699b24a911854b0c35200cee10\n\nNow, the best way to see if there is a relationship between two variables, from a scientific perspective is to run some statistical analysis on it. So, we compared the daily reverse repo rate to a few things I was interested in.\n\n**Before we get started, remember** [**correlation is not causation**](https://en.wikipedia.org/wiki/Correlation_does_not_imply_causation)**.  But such a strong p value looking at data over the last 2 years does imply there is a very strong relationship between the compared values.**\n\n**Running a** [**bivariate analysis**](https://en.wikipedia.org/wiki/Bivariate_analysis)**...**\n\n**Edit**: Thanks all the stats apes that picked this apart, and a big fuck you to the ones that did it in a dickhead way.  I'll be running more analysis on the numbers as suggested and may do an updated post later.  **The takeaway here is that, while there** ***is*** **a statistically significant relationship between the variables presented, they do not explain the entire situation, as the R\\^2 value is too low to provide a good fit. AKA, nothing is conclusive at this point, and we need to do more research to verify exactly things fit.**\n\n# Thesis:\n\nReverse repo has a positive correlation to:\n\n· The total value of FTDs for GME;\n\n· The Opening Price; and\n\n· The average price for any given trading day.\n\n# Reverse Repo Daily vs FTD Daily Value\n\n## Why is this relationship expected?\n\nI would expect there to be a positive correlation between the reverse repo amount and the value of the FTDs in GME *if* our beloved stonk is so shorted and manipulated that it is affecting the liquidity requirements of all the sHFs and upper layers to the extent that they have to borrow BILLIONS (edit: of collateral) PER DAY to meet their obligations.\n\n## What are the results?\n\nThere is a clear relationship between the reverse repo and GME FTD value on a daily basis, with a p value of < .0001, meaning it’s statistically related.\n\n**Edit**: the R\\^2 value is low, so that means the observed relationship here only accounts for roughly 8% of the correlation.\n\n## What does this mean?\n\nWell, besides HFs r Fuk, it means the rise in repo rate is likely correlated to the rise in FTD value for GME on a daily basis… To The Chart!\n\n**Edit**: Remember, the R\\^2 value being low means there are more things at play here than a direct 1-1 cause and effect correlation\n\n&#x200B;\n\nhttps://preview.redd.it/mfoihlzc4j471.png?width=410&format=png&auto=webp&s=31d2260900e43f1194ab8fbc77adc27132b39652\n\n# Reverse Repo Daily Vs Avg Price\n\n## Why is this relationship expected?\n\nI would expect there to be a positive correlation between the reverse repo amount and the average price of GME on any given day *if* our beloved stonk is so shorted and manipulated that it is affecting the liquidity requirements of all the sHFs and upper layers to the extent that they have to borrow BILLIONS (edit: of collateral)  PER DAY to meet their obligations.  We use average price to capture the daily price-related roller coaster.\n\n## What are the results?\n\nThere is a clear relationship between the reverse repo and the average price of GME on any given, with a p value of < .0001, meaning it’s statistically related.\n\n**Edit**: the R\\^2 value is low, so that means the observed relationship here only accounts for roughly 29.26% of the correlation.\n\n## What does this mean?\n\nIt’s more confirmation that Hedgies r fuk, and we are on the right track with our DD. STATISTICAL confirmation. Bonus, the chart is green because its such good news!\n\n**Edit**: Remember, the R\\^2 value being low means there are more things at play here than a direct 1-1 cause and effect correlation\n\n&#x200B;\n\nhttps://preview.redd.it/uqstojqd4j471.png?width=497&format=png&auto=webp&s=75f4e2fe745687fd84ab20ad37b33baffaace00d\n\n# Reverse Repo Daily vs Opening Price\n\n## Why is this relationship expected?\n\nI would expect there to be a positive correlation between the reverse repo amount and the opening price of GME on any given day *if* our beloved stonk is so shorted and manipulated that it is affecting the liquidity requirements of all the sHFs and upper layers to the extent that they have to borrow BILLIONS (edit: of collateral) PER DAY to meet their obligations.  We use average price to capture the daily price-related roller coaster. This is especially true, given the timing of the repos.\n\n## What are the results?\n\nThere is a clear relationship between the reverse repo and the opening price of GME on any given, with a p value of < .0001, meaning it’s statistically related.\n\n**Edit**: the R\\^2 value is low, so that means the observed relationship here only accounts for roughly 27.42% of the correlation.\n\n## What does this mean?\n\nWell, this one’s really exciting! The chart exhibits a classic long-neck ape formation with a bullish AF correlation that means…\n\n**Edit**: Remember, the R\\^2 value being low means there are more things at play here than a direct 1-1 cause and effect correlation\n\n&#x200B;\n\nhttps://preview.redd.it/q6pjueje4j471.png?width=503&format=png&auto=webp&s=3f803e1a06a85370200a03e732dfd12bef5905d8\n\n**TADR**: We ran the numbers, and they came back saying hold, buy, and … well we already voted (great job everyone)! The numbers say that it’s likely that as GME has more FTDS and higher prices, it puts more and more and more pressure on the entire financial system.\n\n**Edit**: That said, the other numbers started arguing with us and pointed out that GME's prices and FTDS only affect a portion of the growing RRepo bubble.\n\nhttps://preview.redd.it/2da8ul3f4j471.png?width=544&format=png&auto=webp&s=569e7ba17117486f69c3a6ca010e4e4ea4db37f0",
    "title": "Statistical Proof that Hedgies r Fuk and the Repo Rate is Related to GME",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/Superstonk/comments/nx2mg4/statistical_proof_that_hedgies_r_fuk_and_the_repo/"
}