{
    "author": "Schwaggaccino",
    "created_utc": 1615581102.0,
    "distinguished": null,
    "edited": 1615597937.0,
    "id": "m3qflo",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m3qflo",
    "num_comments": 435,
    "permalink": "/r/GME/comments/m3qflo/reminder_shorts_have_not_covered_and_are_lying_in/",
    "score": 5290,
    "selftext": "#They are lying.\n[First, read this excellent DD about borrow fees and short shares discrepancies.](https://www.reddit.com/r/Wallstreetbetsnew/comments/m3gyey/short_shares_available_under_500k_borrow_rate_1520/) Why is one source giving us one number and another source giving us a completely different number? It doesn't make sense. Both of them can't be right. Also, it's not like it's a small discrepancy by a percentage or two. It's a HUGE discrepancy and the further you dig into it, the more you realize that someone is either really wrong or is blatantly lying. People who work on Wall St usually aren't wrong. They are **very good** about what they do so that pretty much narrows it down by process or elimination.  \n\n#226-942% SI, realistically it's around ~600%\n\n[Secondly, here's another very interesting DD where our very own autists attempt to calculate short interest](https://www.reddit.com/r/wallstreetbets/comments/m19sa7/true_short_interest_in_gee_em_ee_could_be/) It can be anywhere from 200% to as high as 900%. OBV tells us that the overwhelming majority of retail investors are HOLDING. Citadel could have NOT bought back their SHARES which they absolutely NEED to do. We've seen the short ladder attacks and hundreds of thousands of shorts borrowed almost daily. \n\n#They will continue to lie until they go down in flames\n\nThird, everyone needs a history refresher. Corporate fraud is something that's always existed and something that will always continue to exist no matter what Acts Congress passes. There's always loopholes to abuse. It's not easy to expose it but rest assured, it's there. The only thing that can expose it is time. They can't hide it forever. A mistake here and there on a balance sheet or earnings report is fine and might go unnoticed but as time goes by, more mistakes will attract prying eyes and eventually open an investigation or audit.\n\n# 'Member Enron?\n[Take for example Enron who was able to hide billions of dollars of debt across two solid years before anyone figured it out.  ](https://en.wikipedia.org/wiki/Enron_scandal) \n\n# 'Member WorldCom?\nFollowing Enron's collapse, we got Sarbanes Oxley Act which helped protect investors from fraudulent reporting. Around the same time, the WorldCom scandal was exposed where they overstated their assets by over $11 billion. [Get this, their scandal went on longer than Enron's before it was exposed.](https://en.wikipedia.org/wiki/WorldCom_scandal)\n\n# 'Member the 2008 crash?\n\n[A few years later, Bear Sterans fell in 2008 due to the subprime mortgage crisis.](https://en.wikipedia.org/wiki/Bear_Stearns#Subprime_mortgage_hedge_fund_crisis) If you haven't seen it, go watch The Big Short. Understand that the shorters (the good guys at the time) had to hold 2 fucking years before people realized they were right and they ever saw a return as the fat cats continued to lie until the day they went up in flames. Does this mean we need to hold out til 2023? Nope. DFV already had you covered and started the wheels rolling last year. So does that put the squeeze in 2022? Still nope. They are hemorrhaging cash and the squeeze is likely to happen sooner rather than later. Let's take a look at their losses so far.  \n\n# Shitadel is FUCKED\n\n[So far Citadel/Melvin lost 6 billion shorting GME in January alone. ](https://www.yahoo.com/entertainment/game-stop-stock-on-a-roller-coaster-once-again-as-short-interest-drops-193227331.html) Last Monday on March 8th, Citadel & other shorters lost 600 million IN ONE DAY.  The next day losses were up to 1.5 billion as reported by Yahoo finance. And this is only what was reported. Imagine what WASN'T REPORTED. Citadel has $35 billion in assets while Melvin has $8 billion. Despite managing $43 billion in assets between the two of them, losing $500 million (EDIT: m not b) a day will quickly take a toll on your finances and have you bleed out in around 3 months (assuming it's just Citadel & Melvin who are shorting). Also assuming they haven't liquidated all their assets yet or didn't take on any loans (they probably did but getting margin called by the banks is a great thing for our side), their collapse is very near. \n\n# Be patient. It's not every day that you can take down a hedgie for 100,000% gains. \n\nThere are many other examples in the wikipedia corporate scandals page if you are bored. They happen almost yearly when corporations LIE to the general public about their financial standings. Hell, it's not limited to corporations either. People lie in general. Countries lie. It's human nature. Back in WW2, a lot of German citizens didn't even know they were losing the war until the Soviets showed up on their doorstep. What interests me more is how the hell they managed to keep it a secret for so long but hey, history repeats itself. People lie. This is nothing new and will continue to happen. Like I said earlier, the bigger the lie, the quicker it gets exposed and if it's a big enough lie, they can't keep it a secret forever. The only thing you need to do is sit back and HOLD. Be patient. Could the squeeze happen today? Yes. What if it doesn't happen today? That's okay, it'll be postponed for next week. Or the week after. Or the month after. Don't set any dates. Don't have any expectations. Just be patient and HOLD. We are close. When it happens, you'll be pleasantly surprised.  \n\n#You **WILL** be rewarded for holding. \n\nThis shit will be one for the history books and you will be a part of it. I like the stock. I like to eat crayons. Not a financial advisor.\n\n/////////////////////////////////////////////\n\n**EDIT 1:** M not B typo\n\n**EDIT 2:** Several users including u/boneywankenobi clarified something really important. There's a lot of misinterpretations regarding shorts and how much they have to buy back in. iBorrow only pulls data from Interactive Brokers and this does not represent overall shorts. In other words, while they may be correct, we are still viewing only a slice of the whole pie and we don't know how big or small that slice really is. This is why we look at interest rate. It is more predictive. Only Citadel knows how many shorts they owe and that information is obviously private. u/mboubs95 pointed out another great indicator - FTDs. Shorts are also being hidden in deep ITM calls. There are approximately over $100 million worth of options however more data is needed for us to accurate estimate how many shares they are hiding. This is obviously for very good reason too.\n\n**EDIT 3:** The Yahoo linked I posted where Citadel & Melvin lost 600 million on Monday and around 800 million on Tuesday isn't limited to just Citadel & Melvin but Citadel, Melvin and other shorters in general, which begs the question - are there any other hedgies shorting GME? I appreciate all the constructive criticism guys. I wanna stay as accurate as possible. I'm still learning. One thing is for sure, since January we can't find accurate enough numbers to make everyone happy because a lot of information has gone private or doesn't add up with other sources. Yes I'm aware there could be disinformation out in the wild as well. Use caution, hedgies are watching.",
    "title": "Reminder: Shorts have NOT covered and are LYING in their fintel & iborrow reports. Despite new market regulations and congressional acts to minimize fraud, it is still widely and easily practiced today.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m3qflo/reminder_shorts_have_not_covered_and_are_lying_in/"
}