{
    "author": "_Badtothebone_",
    "created_utc": 1615585236.0,
    "distinguished": null,
    "edited": 1615585665.0,
    "id": "m3rvq6",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m3rvq6",
    "num_comments": 1071,
    "permalink": "/r/GME/comments/m3rvq6/stop_and_listen_if_you_want_this_rocket_to_take/",
    "score": 8818,
    "selftext": "Okay, now that i have your attention, please take this whole heartedly and do not call me a shill or a traitor or whatever, i am BEYOND BULLISH of where we are right now. \n\nHear me out...\n\nSetting dates on when things will happen is a TERRIBLE idea...\n\nWhen someone sets a date and says for instance “march 19th is the squeeze date” it lets the HEDGE FUNDS know that we have our hopes up for that specific date so.... they will obviously push it back farther and delay it to make everyone get discouraged, make people paper handedly sell, and then start conflicts between people with seriously great DD and say its all bullshit.\n\nMr pixel, i love what you do, i love your DD. I think its genius and your killing it(doing amazing), but PLEASE stop setting dates for squeezes and events\n\nFor instance Mr Pixel said that Friday(today) there is a very high chance at a gamma squeeze.. the hedge funds saw how hyped up everyone was for this massive squeeze today that never happened.. why is that? Because the hedge funds purposely pushed it back to DISCOURAGE YOU and make you think all this DD is bullshit!!!!!!! \n\nIll tell you what, if there was no date and everyone just said the “squeeze is coming, just hold on” i bet that yesterday and today would have went A LOT differently, its these hedge funds trying to destroy us. \n\nThe more dates we set, the farther back the squeeze goes, STOP SETTING DATES, and maybe the apes can  catch these bastards red handed and hit them with a surprise attack!!!! \n\nI fully support what all of you do with your God tier DD and i give you the most props for taking the time out of your day to do the work and make a post to share it!!! But please just stop with the date setting, its only setting the squeeze back farther and farther.\n\nI love you all, please take this as a positive outlook to the future, the squeeze is on its way and will be here soon, just hang in there and hold on tight because a rocket flight to the moon isnt a smooth ride🚀💎🙌🏻\n\n\n\nTl:DR - stop setting dates, hedge funds see that and purposely use manipulation to hold the squeeze off to discourage the apes! Spread the word, there is alot of great guys out there with phenomenal DD just stop adding dates!!! Hold on tight were in for the ride of our life time!🚀🚀🚀\n\nShoutout to u/heyitspixel and u/Rensole for there amazing work and DD I support you guys to the fullest extent!!! TO THE MOON APES🚀",
    "title": "STOP AND LISTEN; IF YOU WANT THIS ROCKET TO TAKE OFF THEN READ THIS",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/m3rvq6/stop_and_listen_if_you_want_this_rocket_to_take/"
}