{
    "author": "herrschoftszeitn",
    "created_utc": 1617777196.0,
    "distinguished": null,
    "edited": 1617801379.0,
    "id": "mlw1pe",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion 🦍",
    "name": "t3_mlw1pe",
    "num_comments": 320,
    "permalink": "/r/GME/comments/mlw1pe/i_wanted_official_consultation_about_gme_at_my/",
    "score": 2657,
    "selftext": "Short story-time for amusement reasons only:\n\nsome days ago, I went to my bank (Austria). I am the owner of quite a number of GME shares and my broker app is actually just the bank-intern bond trading app, where I need to pay transactional feed everytime I buy (what is sell?) GME shares. I informed myself about the reasoning of those transactional fees beforehand and found out that by paying them, I have the right of consultation by my bank about the shares they‘re trading/I‘m buying. \n\nSo, I went to the main national building of my bank, they were really friendly at the beginning, enthustiatically, I mentioned GME to them and that I wish for professional consultation about the financial details involved with that stock (I am not a financial guy, actually, I don‘t exactly know what‘s going on, it‘s all pretty crazy to me). \n\nSuddenly, their posture and mimick changed pretty suddenly. I was told, they are not allowed to consult about GME. To my question, why this was the case, they told me, because GME is „too irrelevant for the big stock market“. They are „aware of the past short squeeze, but one should no longer focus on GME“. They acted as if GME was some „childish financial playground“ that should be forgotten about. When I confronted them with the huge recent naked short attacks and if they could explain to me possible effects of them if they were not covered, they just repeated themselves how „GME is not relevant, please focus on stocks like Apple or Amazon to be safe“. \n\nI left the bank, buying more GME shares.\n\nEDIT: This very same post has just been deleted from r/wallstreetbets for no reason that I am aware of.",
    "title": "I wanted official consultation about GME at my bank and they refused because „GME is irrelevant“",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mlw1pe/i_wanted_official_consultation_about_gme_at_my/"
}