{
    "author": "AvidTreesFan",
    "created_utc": 1619871059.0,
    "distinguished": null,
    "edited": 1619895762.0,
    "id": "n2h4ss",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_n2h4ss",
    "num_comments": 72,
    "permalink": "/r/DDintoGME/comments/n2h4ss/companies_destroyed_by_hedge_funds_how_gamestop/",
    "score": 666,
    "selftext": " Your favorite caffeine-addled, sleep deprived, tree chomping ape is back with a fresh pack of crayons, glitter and glue. Let's get to it.\n\nConflicts of interest, predatory financial organizations and potential large scale racketeering through the process of leveraged debt; just another day on Wall Street.\n\n[Toy's R' Us store closing down circa 2018 with a 60% off sale banner displayed on the front windows.](https://preview.redd.it/n7a2uri0o7w61.jpg?width=660&format=pjpg&auto=webp&s=1efe0388aab4cc24cd796da1d05bc132f676614a)\n\nHow about we begin with the **calculated bankrupting of Toys R' Us;** Similar to Gamestop, Many of us have fond, nostalgic memories of Toys R' Us. I've loved Toys R' Us since I've had (and still have) a proclivity towards trading cards and collectibles; Toys R' Us hooked it the fuck up and ya'll know it).\n\nBeing cornered by debt in March 2005, Toys R\" Us was forced to sell the entire company to a group of investors led by **KKR Group, Bain Capital (founded by Mitt fucking Romney of all people) and Vornado Realty Trust** for $6.6 billion, **plus the assumption of debt....** \"According to the announced deal, each of the investors -- New York-based **buyout specialist firm** Kohlberg Kravis Roberts & Co, Boston-based **private equity** firm Bain Capital and New York-based **real estate investment** **trust** Vornado -- will own equal stakes in the company upon completion of the transaction.\"\n\n[https://money.cnn.com/2005/03/17/news/fortune500/toysrus/](https://money.cnn.com/2005/03/17/news/fortune500/toysrus/)\n\nOkay so KKR is a **specialized buyout firm**; meaning they buyout **distressed debt.** It's important to understand that individuals like **David Tepper (Head of Appaloosa Capital) made $7.6B in one year following the GFC crash of 2008 by buying distressed debt (before the federal reserve enacted monetary policy then), selling at a obscene gain (they'll often go short before, or as they sell their long position too).** [**https://www.businessinsider.com/hedge-fund-manager-rubs-brass-balls-makes-7-billion-2009-12**](https://www.businessinsider.com/hedge-fund-manager-rubs-brass-balls-makes-7-billion-2009-12)\n\nA bullish trade strategy/scenario is not the only way funds operate within the distressed debt market. **KKR and friends purchased this distressed debt with leverage at a stupid valuation of $6.6B (which was then leveraged up to $7.5B as I'll discuss later) with the intent of driving down the price of the company and it's stock. This does not reduce debt but rather creates more debt, since they are buying the rights to ownership of debt, with debt.**\n\nThis article can shed light on this acquisition and the changes to business operations shortly after: [https://www.theatlantic.com/magazine/archive/2018/07/toys-r-us-bankruptcy-private-equity/561758/](https://www.theatlantic.com/magazine/archive/2018/07/toys-r-us-bankruptcy-private-equity/561758/)\n\n\"**The company eliminated positions, loading responsibilities onto other workers. Schedules became unpredictable. Employees had to pay more for fewer benefits, Reinhart recalled. (Bain and KKR declined to comment; Vornado did not respond to requests for comment.)\"**\n\nThis is often the **Modus Operandi of Hedge Funds involved in distressed debt acquisitions.** They cuck \"distressed\" companies over by **leveraging acquisition debt** then, **(also mentioned in the above article**) **letch onto existing company assets** next to **risk free.** Be it through negative reports from their \"own\" news agencies, cutting off employees or even implanting moles into the boards of these very companies. Greetings from Jim Bell! (Gamestop's old CFO who mismanaged debt).\n\nAlso mentioned in article:\n\n**\"Josh Kosman, the author of The Buyout of America, agrees: “All it takes is for earnings to stop rising and level off, or even decline a little bit, and you’re in a whole heap of trouble.”**\n\nKosman describes how a slight decline in sales can lead to \"a whole heap of trouble\". I would highly recommend reading The Buyout of America. Incredibly well researched.\n\nWhen discussing reasons for bankruptcy:\n\n\"**Less attention was paid to the albatross that Bain, KKR, and Vornado had placed around the company’s neck. Toys “R” Us had a debt load of $1.86 billion before it was bought out. Immediately after the deal, it shouldered more than $5 billion in debt.\"**\n\nThat's right. As soon as Toys R' Us was purchased the **new owners of the company purposefully acquired as much debt as possible** (to **prevent their ability to raise capital at critical points** like GME just did) **while downsizing and removing benefits for their employees** (ensuring higher turnover/lower quality labor, leading to a **diminished quality of service** in their stores, **further contributing to loss of customer retention)**.\n\nThis debt number is disputed as Wharton has it listed differently:\n\n[https://knowledge.wharton.upenn.edu/article/the-demise-of-toys-r-us/](https://knowledge.wharton.upenn.edu/article/the-demise-of-toys-r-us/)\n\n\"The day of reckoning may have been delayed through a **$7.5 billion leveraged buyout** in 2005 by private investors\". **I believe this $7.5B figure represents the initial $6.6B + $1.1B ADDITIONAL LEVERAGE. That is a ridiculous amount of debt to take on for any retailer of Toys R' Us' size.**\n\nThat Wharton article above is a perfect example of a fund manager manipulating the market through media resources.\n\nThis WSJ article describes the power dynamic between companies and their creditors (specifically when the company is over-leveraged)\n\n[https://www.wsj.com/articles/who-killed-toys-r-us-hint-it-wasnt-only-amazon-1535034401](https://www.wsj.com/articles/who-killed-toys-r-us-hint-it-wasnt-only-amazon-1535034401)\n\n**\"Creditors have long played a key role in determining whether companies operating under chapter 11 bankruptcy protection will live or die. The five funds in this case—they also included Angelo, Gordon & Co., Franklin Mutual Advisers, Highland Capital Management and** [**Oaktree Capital**](https://www.wsj.com/market-data/quotes/OAK) **—were exercising their rights as creditors and their duties to generate returns to their investors.\"**\n\n**Notice that it can be observed in the photo in the WSJ article that Toys R Us was selling product at a whopping 70-90% discount days before closing.** Not that sales are uncommon for a company going out of business but wouldn't the creditors would want to do their best to recoup on as much of their investment as possible? **This was done so Toys R' Us wouldn't be able to pay their biggest vendor: Mattel (which is also publicly traded). This would allow anyone aware of the Toys R' Us situation to take a short position on Mattel.**\n\n[Going out of Business signs in a Toys R' Us circa 2018 also displaying 70% to 90% off discounts.](https://preview.redd.it/6hhyzejlz7w61.jpg?width=700&format=pjpg&auto=webp&s=f2dffa1d5255110d2e9c324f9447bf96f61c2028)\n\n**When KKR, Bain and Vornado purchased Toys R' Us they purchased it through a structured debt agreement along with the four listed funds above. They then intentionally mismanaged the company and defaulted on over-leveraged loans BY CHOICE. I believe this acquisition also served to eliminate the biggest competitive threat to Walmart and Amazon seeing that 2 of Toys R Us' creditors hold positions in those companies.**\n\n**By viewing Highland Capital's SEC Report 13F filed 2006/4/26, it can be seen that they owned 572,171 shares of Walmart.**\n\nHighland Capital : [https://sec.report/Document/0000860486-06-000004/](https://sec.report/Document/0000860486-06-000004/)\n\n**By viewing Oaktree Capital's SEC Report 13F filed 11/14/2006, it can be seen that they owned an absolutely staggering 8,800,000 shares of Amazon stock:**\n\nOaktree Capital: [https://sec.report/Document/0000949509-06-000015/](https://sec.report/Document/0000949509-06-000015/)\n\n**THIS IS A HUGE CONFLICT OF INTEREST AS WALMART & AMAZON GAINED ACCESS TO A MUCH LARGER MARKET SHARE WHEN TOYS R US WENT BANKRUPT.**\n\n**Oaktree Capital and Highland Capital likely made efforts to reduce the market share and stock price of Toys R' Us; resulting in increased market share of to Amazon and Walmart to raise the value of their own portfolio, while pocketing (or re-investing) the proceeds from naked shorts. In fact, a Hedge Fund can take proceeds from a naked short (sourced through MM) and stack it into their long position (who say, is a DIRECT COMPETITOR OF THE COMPANY YOU JUST SHORTED).**\n\n**I know. What the fuk?**\n\nTying this back into Gamestop; it can ben observed that Citron had a bullish outlook on major Gamestop competitor **Five Below, Andrew Left has since deleted his video where he compares many aspects of Gamestop to Five Below in an effort to turn people bearish on GME, while turning people bullish on Five Below (the video is mentioned in the article below).**\n\n[https://markets.businessinsider.com/news/stocks/gamestop-stock-price-retail-traders-shorts-citron-andrew-left-gme-2021-1-1029994276](https://markets.businessinsider.com/news/stocks/gamestop-stock-price-retail-traders-shorts-citron-andrew-left-gme-2021-1-1029994276)\n\nIt can also be observed that **CITADEL SECURITIES HELD SIGNIFICANT POSITIONS IN NUMEROUS COMPANIES THAT COMPETE DIRECTLY WITH GAMESTOP.**\n\n**Citadel Advisors' 13F shows holdings as 12/31/2020 show:**\n\n**660,186 SHARES OF FIVE BELOW; 220,500 SHARES IN CALLS FOR FIVE BELOW.**\n\n**1,382,462 SHARES IN WALMART**\n\n**565,709 SHARES IN TARGET; A WHOPPING 1,123,400 IN CALLS ALSO!**\n\n**You'll notice that Five Below fell significantly between Jan 16th and Feb 3rd. This may have occurred because Citadel had to liquidate THE NAKED SHORT PROCEEDS ACQUIRED FROM GAMESTOP THAT HAD BEEN STACKED INTO FIVE BELOW to meet margin requirements.**\n\nI think I'm noticing a trend here....\n\n[https://fintel.io/i13f/citadel-advisors-llc/2020-12-31-0](https://fintel.io/i13f/citadel-advisors-llc/2020-12-31-0)\n\nAfter Toys R' Us was acquired by KKR and friends In 2005, **Toys R' Us lost significant market share of their market due to Amazon introducing toys and baby products in 2006.**\n\n[Amazon and Walmart were major competitors of Toys R' Us.](https://preview.redd.it/anq6dynt28w61.jpg?width=630&format=pjpg&auto=webp&s=ffb654a66f50082d7f958cee1fe09225fb96fa0c)\n\n[**https://www.usatoday.com/story/money/2018/03/15/toys-r-us-liquidation-amazon-target-walmart/427209002/**](https://www.usatoday.com/story/money/2018/03/15/toys-r-us-liquidation-amazon-target-walmart/427209002/)\n\n\"With Amazon, Walmart and Target wiping out Toys R Us as a **brick-and-mortar chain**, attention may quickly turn to the fate of the retailer's brand name and **website.**\"\n\n**I mean, just lol, they have the website listed right there, so shameful.**\n\nThere's more of that familiar **dissemination of information** from media conglomerates that I've come to expect. IMO this article (and many others) had a financial incentive to mention Amazon, Target and Walmart. It seems as though this narrative was built throughout media organizations multiple times. But many of these articles fail to explain the distressed debt situation. IMO this is establishing a \"legitimate\" explanation for Toys R' Us going out of business while minimizing the perception that poor fiduciary execution by private equity firms may be responsible.\n\nNotice how they use the term **brick and mortar** even though Toys R' Us was one of the earliest online retailers in their industry: \"In 1998 the company joined the **online** **retailing boom** with the **launch** of the **toysrus.com web site**\"\n\n[https://www.zippia.com/toys-r-us-careers-42082/history/](https://www.zippia.com/toys-r-us-careers-42082/history/)\n\n[Toys R' Us was still doing $912M in toy sales in 2016.](https://preview.redd.it/548b8ngp38w61.jpg?width=960&format=pjpg&auto=webp&s=1970b06af76f524ece932b10fc49176407a6ec0e)\n\n**Solos Alternative Asset Management acquired Majority ownership of Toys R' Us by 2018 through their ownership stake in TruKids but eventually sold it to WHPGlobal.**\n\n[**https://www.reuters.com/business/toys-r-us-parent-sells-controlling-stake-management-company-whp-global-2021-03-15/**](https://www.reuters.com/business/toys-r-us-parent-sells-controlling-stake-management-company-whp-global-2021-03-15/)\n\nI believe Solos Alternative Asset Management **only acquires companies after they have been bankrupted for the** **sole purpose of taking on their debt at a loss**. I would label this as a \"**schmuck fund\"** that **raises capital from unsuspecting investors and uses that capital as an instrument to abandon debt. Let's observe Solos following this debt acquisition.**\n\n[**https://www.fnlondon.com/articles/clients-pull-money-from-hedge-fund-that-helped-kill-toys-r-us-20191209**](https://www.fnlondon.com/articles/clients-pull-money-from-hedge-fund-that-helped-kill-toys-r-us-20191209)\n\n\"Assets at Solus have **dropped steeply, by $1.7bn, from about $6bn** last year, said one of the people familiar with the matter. The drop is related to **performance losses, client redemptions and the firm returning capital on previous investments**\"\n\n**The link below heavily supports the thesis that Solos is a \"schmuck fund\" as it appears by March 2020 they had to restructure the entire fund due to lack of access to liquidity meaning the remaining $4.3B they had in December 2019 may have been used up completely to \"return capital on previous investments\" or in other words; burn investor money paying off the Toys R' Us debt they knew was oversized when they co-signed as a creditor. That way none of the other funds involved took a loss on this play.**\n\n[https://www.bloomberg.com/news/articles/2020-03-11/solus-to-restructure-flagship-hedge-fund-as-liquidity-dries-up](https://www.bloomberg.com/news/articles/2020-03-11/solus-to-restructure-flagship-hedge-fund-as-liquidity-dries-up)\n\nOh and here's an article detailing how **Solos and Angelo Gordon** forced privatization on Puerto Rico during a hurricane. More of the wholesome behavior we've come to expect from psychopathic financial scoundrels. Shit is so whack.\n\n[https://caribbeanbusiness.com/report-hedge-funds-that-killed-toys-r-us-prey-on-puerto-rico/?cn-reloaded=1](https://caribbeanbusiness.com/report-hedge-funds-that-killed-toys-r-us-prey-on-puerto-rico/?cn-reloaded=1)\n\nThis link details a more specific explanation of the events that lead to bankruptcy.\n\n[https://www.bloomberg.com/news/features/2018-06-06/toys-r-us-the-world-s-biggest-toy-store-didn-t-have-to-die](https://www.bloomberg.com/news/features/2018-06-06/toys-r-us-the-world-s-biggest-toy-store-didn-t-have-to-die)\n\n**\"Sycamore Partners produced a plan that could have kept open half the U.S. stores, but the retailer’s senior creditors calculated they would see a better return if the company were liquidated and its assets sold off. By February some of the lenders were insisting on that approach.\"**\n\nSycamore partners wanted to purchase the company at a fair valuation (which would have been a financial opportunity for Toys R' Us to stay in business and keep people employed) but the hedge funds (senior creditors) decided it **was worth more to them bankrupt. This is a very important point as they admit that creditors would receive a BETTER RETURN if the company went bankrupt.**\n\nLooking at the process in which Toys R Us went bankrupt, it can be observed that the debtors in control of the company **wanted to INFLICT LOSSES AS SEVERE AS POSSIBLE.**\n\nThis is very common in the \"distressed debt\" industry but that's a whole other DD for another time and so I digress.\n\nThankfully this bleak fate is no longer a possibility for GameStop since they've paid off their debt, and I think I heard about a few apes that like the stock so that sounds extremely promising if they want to raise capital for any reason in the future. Credit to [u/sfjetsetter](https://www.reddit.com/u/sfjetsetter/) for suggesting this perspective\n\n**The narrative being fed to you is false, the \"power\" of a competitive marketplace is 140% bullshit smoke and mirrors.**\n\n**Criminals have been extracting billions from our economy every year.**\n\n**Toys R' Us cost impact to society:**\n\n**. 33,000 workers lost jobs without receiving ANY severance.**\n\n**. Vendors such as Mattel lost of over $350M**\n\n[Here's one of the last photos taken before the complete closure of Toys R' Us. This entire staff lost their income, work community and health benefits.](https://preview.redd.it/jblmyh5d98w61.jpg?width=660&format=pjpg&auto=webp&s=0b19e72132c1d34470849225446bcc7ccc1a4b31)\n\nEach and every one of the staff members in this photo represents an individual who, through no fault of their own, had their life disrupted by Wall St. Whoever's in that Geoffrey the Giraffe suit still had financial responsibilities after losing their job that day. IMO these individuals are unsuspecting victims and represent the real world cost to society and economy.\n\n**This can't keep happening.**\n\n**This is why I will continue to hold, and hold, and hold until the system that allows for this type of predatory behavior is brought to it's knees and forced to change. This isn't even about money for me anymore, money's nice sure but it comes and goes, and a chance to force change sounds a whole lot better. Plus I mean have you seen Gamestop lately? that is one pristine, top of the line, Canyonero caliber quality stonk. An emerging e-commerce giant with plenty of cash ready to make a run at capturing market share in one of the fastest developing industries today.**\n\n**I posted this is to evaluate the tactics used when hedge funds attempt (and often succeed) to bankrupt companies. Expect more DD in the future discussing companies that have been bankrupted through distressed debt takeovers and overleveraging, cause there's A LOT OF THEM.**\n\nI'd also like to thank [u/Ren3666](https://www.reddit.com/u/Ren3666/) for contributing crucial improvement to this thesis presentation and strength. Kudos good sir \\*waves hat in the air\\*\n\n**TLDR:** (sorry there's a lot to explain any way I put it haha)\n\n**You want to learn How to Win on Wall Street?**\n\n1. **Hold long positions in companies which support your thesis (e.g AMZN, WAL);**\n2. **Acquire any company that stands to compete with your long position at a valuation that will drown them in debt for years to come (e.g Toys R' Us).**\n3. **Instantly spend that capital to needlessly open and remodel a bunch of stores (providing more capital to Vernado and further entrenching controlling interest to the existing creditors).**\n4. **Aggressively** **mismanage the company, ruining it's reputation and jacking up prices.**\n5. **Default on debt to your lenders (who also stand to gain from Toys R' Us going out of business) all the while; naked shorting the living shit out of the stock.**\n6. **Take your proceeds from naked shorting/shorting a stock and invest it into your long positions (which are direct competitors with the companies you just shorted) raising their stock price. This is essentially taking capital from one companies market cap and stacking it into another.**\n7. **Contact every media source that will take your money in exchange for drawing attention to the stock price disparity between the shorted company (Toys R' Us) and your long positions (AMZN and WAL) while promoting your bear thesis for your short position and your bull thesis for your long position.**\n8. **Control the narrative. Looks like** [u/controlthenarrative](https://www.reddit.com/u/controlthenarrative/) **has known what this market is about all along haha.**\n\n**Before you know it you'll have profited by retaining your short sale proceeds while abandoning your debt to a \"Schmuck fund\" like Solos Alternative Asset Management. You then short Mattel at the same time.**\n\n**Because as the biggest supplier for Toys R' Us \"they\" would have taken a of $350M loss; since Toys R' Us was forced to clear their remaining in-store products AT DISCOUNTS BETWEEN 70% AND 90%, they could not service the payments to Mattel in a timely manner, which is why Mattel was likely heavily shorted \"at this time\" as the stock price plummeted/squeezed several times between 2005 - 2018.**\n\n**This sounds an awful lot like Racketeering endorsed by the SEC IMO but I'm open to criticism and counterpoints as this is the best way to strengthen any thesis; through the exchange of sound information. A concept is often improved upon from it's counterpoints.**\n\n**AMERICAN PRIVATE EQUITY THE FRAUDULENT.**\n\nEdit: I changed the last line after a fellow ape brought up a few great points in the comments",
    "title": "Companies Destroyed by Hedge Funds: How Gamestop was almost the next Toys R' Us",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n2h4ss/companies_destroyed_by_hedge_funds_how_gamestop/"
}