{
    "author": "FreshestCremeFraiche",
    "created_utc": 1627324938.0,
    "distinguished": null,
    "edited": 1627340193.0,
    "id": "os54va",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_os54va",
    "num_comments": 197,
    "permalink": "/r/DDintoGME/comments/os54va/why_do_we_always_get_stuck_in_the_170s180s_i/",
    "score": 2094,
    "selftext": "Hi folks, I have been speculating a bit about why we always seem to be fighting over the same $170-$180 range, and always end up drifting back to these prices whether from the low or high side. I have a quick theory that I would love some help with validating, and integrating with the rest of our DD. I really apologize if this has been analyzed before, but I didn't see anything.\n\n### tl;dr - $170-180 price point is 50% of what we suspect is SHF margin call threshold from the NSCC ($350). 50% of capital cushion used is the point at which NSCC issues a warning and raises capital charge premiums.\n\nSo, first things first: based on several data points, we know that whenever we reach the ~$350 range or above, short hedge funds react brutally/desperately and do whatever is necessary to drop the price immediately. This has given rise to a theory that $350 or so is the trigger threshold for margin calls, and represents 100% exhaustion of their capital cushion. Some notable examples of this pattern:\n\n1. GME opened at $354.83 on Jan. 27, during our first attempt at a squeeze. Jan 27 is the day when we first saw enormous single-day price gains in the $XXX range. And of course, Jan 28 is the day where SHFs/RobinHood consipired to stop GME buying and halt the squeeze. One could speculate that SHFs got margin calls during/after hours on Jan 27 in the $350+ range, and acted desperately to drop the price the following day. Banning/restricting GME buys succeeded in dropping the price from $483 ATH on Jan 28, to a low of $112.25 that same day. We are all familiar with this part, I imagine.\n\n2. After trading in the $40s and $50s for most of Feb, we saw another big run up from Feb 25 to Mar 10. On Mar 10, GME opened at $269.43, and ran to a daily high of $348.50. The moment we reached the $350 range again, GME lost 50% of its value and dropped to $172 within a few minutes (paging SEC...). Here is a news story for those who weren't around when this happened: https://www.cnbc.com/2021/03/10/gamestop-surges-40percent-then-wipes-out-gain-completely-and-is-halted-again.html\n\n3. Over the next few months (mid-March to late May), we traded sideways and fought over that $170-180 price point constantly. If we were pushed down below that range, we drifted inexorably back up to $170-180 closes. If we rose above that range into the $200s, we would inevitably get pushed down to $170-180. I wish I had better data on the number of times we crossed this range in both directions during trading hours.\n\n4. We experienced a surge in buy volume and another run-up from May 26 to Jun 9, due to retail proxy vote hype and anticipation of the Jun 9 shareholder meeting. After running up the price through the $200s, we opened at $292 on Jun 8. We hit a high of $344.66, and saw another major/immediate drop (to $281) immediately that same day. On Jun 9, we hit a high of $328, then an immediate drop to $291.51.\n\nSee: https://finance.yahoo.com/quote/GME/history/ for the full price history and daily volume.\n\nSo, assuming we are correct about the ~$350 range representing a red line for SHFs, and likely an exhaustion of their capital cushion, that makes $170-180 the point at which 50% of their capital cushion is used. I found something relevant in a DTCC statement about the January mini-squeeze and risk, published in mid-Feb: https://www.dtcc.com/-/media/Files/PDFs/DTCC-Statement-February-2021-Mike-Bodson.pdf\n\nThis is a pretty short and approachable document as far as the DTCC is concerned, so please read the whole thing (6 pages). I've added a few of my favorite quotes below, mostly from pages 2-3:\n\n> NSCC collects clearing fund, or margin, at the start of each day and intraday in volatile markets. The calculation of clearing fund component charges and the timing of collection are set forth in NSCC’s rules, which are known to every member and changes to which must be filed for public review and comment and approval by the SEC. Most of these charges – generally referred to as core clearing fund components – directly address the estimated risk of the clearing member’s unsettled portfolio. The largest component is the value-at-risk or “VaR” charge.\n\nDiving a little deeper...\n\n> NSCC’s rules-based clearing fund requirements also include certain “non-core” charges that address specific issues. These are also set forth in NSCC’s rules. For example, if a clearing member’s portfolio is highly variable from day to day, core charges may not adequately capture the risk. If so, the clearing member could be subject to a backtesting charge that addresses this gap. Other charges are intended to encourage operational resiliency and reduce settlement risk. One example is the fails charge that applies when a clearing member fails to deliver securities for settlement. One such non-core charge that became important during the week of January 25 is the capital premium charge. This charge was adopted in 2006, following market disruptions caused by the failure of a clearing member of NSCC and other clearinghouses. The capital premium charge is intended to discourage clearing members from taking on more risk in their portfolios at NSCC than their capital levels can reasonably support. Because a clearing member may be obligated to quickly provide funds to NSCC and other clearinghouses, a clearing member that is over-leveraged presents a heightened risk of default. NSCC looks to a clearing member’s excess net capital (a measure of generally available capital for broker-dealers) as an important 3 cushion against such risks. The capital premium charge applies if a specified portion of a member’s core requirement (including the predominant VaR charge)2 is greater than its excess net capital. The charge is calculated using a simple formula in NSCC’s rules that scales upward based on the degree of leverage. A clearing member with a core requirement that barely exceeds its capital cushion will have a small charge. A clearing member with a core requirement that greatly exceeds its capital cushion will have a much larger charge. **NSCC provides a warning to clearing members in their daily clearing fund statements on any day that their core requirement exceeds 50% of their capital cushion, to remind them that this charge will be applied if their core requirement grows to exceed their capital cushion.**\n\nSo, $170-180 could be the threshold (a.k.a. 50% of margin call) at which major SHFs start getting margin warnings, and potentially higher premiums (not quite sure how this works in detail). Now how about some nice confirmation bias:\n\n> As volumes and volatility in the meme securities spiked on Wednesday, January 27, NSCC calculated and imposed a special charge under its rules that essentially accelerated collection of a portion of the following morning’s VaR charge for many clearing members with exposure to these securities. The imposition of the special charge, in addition to NSCC’s collection of intraday mark-to-market charges, reflected significant growth in risk in many clearing members’ unsettled portfolios. Final VaR charge estimates were updated at the end of day in the NSCC risk portal to reflect changes in each clearing member’s portfolio through the end of the trading day, and then updated overnight to reflect the impact of security price changes using Wednesday’s closing prices. Clearing members would have observed these updates in the NSCC risk portal. Shortly after 5 a.m. Eastern Time on Thursday, January 28, NSCC’s daily margin statements were released to clearing members in NSCC’s risk portal and excess/deficiency notices were emailed according to NSCC’s standard operational timeline. Many clearing members whose unsettled portfolios were exposed to volatile meme stocks saw significant increases in the VaR charges that derived from the risk posed by increased volume and price volatility in these securities. Substantial VaR charge increases also generated capital premium charges for clearing members whose core requirements exceeded their capital cushions. Several clearing members were subject to capital premium charges, which were automatically generated by NSCC’s systems based on the formula in NSCC’s rules.\n\n...and confirmation that the NSCC **did not request members halt GME buying**:\n\n> NSCC’s role in the market is a neutral one. It does not impose trading restrictions upon its clearing members or their customers, and it did not instruct any clearing member to impose restrictions during the market volatility events of late January. NSCC expects all clearing members to employ effective tools to monitor and manage their risk, and to maintain an appropriate level of capital to support any expansion of or change in their business activities.\n\n...but the NSCC **did give SHFs a free pass that time due to \"market volatility\" (sigh):**\n\n> NSCC examined the market activity and clearing member margin requirements to consider whether it would be appropriate to adjust or waive the capital premium charge, as permitted under the applicable rule. NSCC determined that the spike in market volatility, particularly in the so-called meme stocks, was a material contributor to elevated VaR charges for several clearing members, including most of those subject to capital premium charges. NSCC determined that it would be appropriate to waive the capital premium charge for all clearing members, using the discretion provided in the rule to reduce or waive this charge.4 Just after 9 a.m., prior to the market opening at 9:30 a.m., updated daily margin statements reflecting the waiver were released in NSCC’s portal and revised excess/deficiency notices were emailed to clearing members. All clearing members timely satisfied their clearing fund requirements.\n\nAlright, that is it for now. I would love some deeper exploration of this and other clearing house rules by people with a deeper understanding. Thanks for reading.",
    "title": "Why do we always get stuck in the 170s-180s? I might have found a reason.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/os54va/why_do_we_always_get_stuck_in_the_170s180s_i/"
}