{
    "author": "Most-Averagist",
    "created_utc": 1628102991.0,
    "distinguished": null,
    "edited": 1628194054.0,
    "id": "oxzh8l",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oxzh8l",
    "num_comments": 59,
    "permalink": "/r/Superstonk/comments/oxzh8l/i_really_really_do_hope_that_gg_is_serious_about/",
    "score": 3675,
    "selftext": "I have noticed a drop in the momentum of people filing complaints and writing to their elected officials and regulatory bodies. I assume this is because the responses that are received in return are fluff filled garbage.\n\nBut, if there is one thing that government employees hate worse than doing actual work, it is hearing from the public about how they are not doing actual work. Had these agencies been doing their job all along, the current apparent financial situation that seems to be looming would not even be a thing. I for one will not let one utterance about darkpools by GG on MSM strip away all the P-Hubbing that has cock blocked retail from a fair market.\n\nI do think that it is good that he is mentioning the issue with \"finance and technology\" and \"dark-pools\"  but please don't forget that many of the regulatory actors are not regular people as I consider myself to be. They don't live paycheck to paycheck and they certainly are not your friends no matter how friendly and interested they appear to be. These are the same people that will rub elbows with the people that are suspected of complete and utter fuckery!\n\nGG's responses make me cringe a bit. \"We are looking really close at\" is usually government speak for \"we acknowledge there might be an issue\"...and 99% of the time that is all it means. It does not mean they are doing anything about it. The other thing that makes me doubt that this is being addressed as a serious issue is the nomenclature that is still used when speaking about GME. ALWAYS referred to as a \"meme\" stock. I don't think I need to go over GameStop's fundamentals with any of you to convince you that it is a serious company with serious assets and a serious leader. When \"they\" start addressing GameStop as \"GME\" or \"GameStop\" and drop the meme moniker then we might be on the right path. Until then I believe in nothing but my diamond hands.\n\nActions taken are the only thing that should be applauded because at the end of the day talk is just talk.\n\nI hope the positivity toward a better future for the stock and company I/we love continues to be expressed loudly and proudly.\n\n&#x200B;\n\nEdit: Usual spelling repairs\n\nEdit 2: Thanks to all you beautiful APES for supporting this message. I am not sure how else to attach the following \"form letter\" to this post so I am putting the text here. Please copy and use it. I will be sending copies (weekly) of this letter to all of my elected officials as well as any regulatory bodies that I can find for which this might have an impact. Finally, I appreciate any feedback or edits that might help with the intent of the letter...I am not a literary genius just a concerned investor.\n\n&#x200B;\n\nAugust 5, 2021\n\nRe: Transparency and Fair Trading Related to All Regulated Securities\n\nDear (fill in recipient)\n\nAs a retail investor in a variety of securities I have become concerned with state of the overall market conditions that are being uncovered on a daily basis; all of which seem to point to the manipulation of what I always thought of as a free and fair market. My confidence in the ability to invest in companies that I believe in, has been shaken. It seems that no longer are the days of investing in X, Y or Z company because of solid financials, excellent leadership or innovation, as it was for many of my older relatives. Instead, it seems that the market has been molded to be easily manipulated by large organizations with loopholes and regulations that are designed to facilitate fraud and abuse. Slow and steady growth is no longer the norm, but rather an anomaly. The volatility across markets seems to make it clear that high frequency trading by funds with billions of dollars dictate the worth of a security.\n\nSpeaking in relatively simple terms, the laws that dictate most citizens day to day activities are mostly clear and have relatively straight forward repercussions for violating said laws, most of the time. So, it is difficult for me to fully understand why the regulations set forth by regulatory bodies such as the SEC, DTCC and FINRA are so diluted with legalese and wording that seems to allow for manipulation of the market as a whole. And while I do understand that from time to time there is enforcement action taken against some of the more public and egregious violations of securities regulations, the penalties are far less punitive than the penalties for lesser crimes committed by the general public. As someone else once mentioned to me with regard to this very issue: “If the penalty for theft of one hundred dollars was a $1 fine, what is to deter me from continuing to steal?”\n\nTo provide a real-world example:\n\nFINRA Case ID: [2015046927801](https://www.finra.org/sites/default/files/fda_documents/2015046927801_FDA_JG412303%20%282019-1563209358994%29.pdf) deals with a violation by the company “Citadel”. In the Letter of Acceptance, Waiver and Consent it is stated that: “The firm became a FINRA member on February 25,2005 and its registration remains in effect. The firm has no prior relevant disciplinary history.” The resulting disciplinary action was a fine in the amount of seven thousand five hundred dollars along with a “censure”. The document also states: “This AWC will become part of the firm's permanent disciplinary record and may be considered in any future actions brought by FINRA or any other regulator against the firm;”\n\nWhat is striking and, to be frank, quite appalling to me is that the very same language of …”the firm has no relevant disciplinary history”… can be found in 13 of the 19 FINRA disciplinary action documents that I located on the FINRA website. With 19 “documented” violations and disciplinary actions over the course of 16 years, some of which span more than a year and involve multiple acts within those time frames, it seems to be quite apparent that the “discipline” in response to the violations is not a deterrent to committing future acts in violation of the “rules”. I am unaware of any real-life situation in which I or any other person could so blatantly and continuously violate the “rules” without enduring much more serious consequences.\n\nI would like to close this letter with the request that actions are taken to effect change in this apparently broken system to hold people and firms that violate the rules and regulations accountable for their actions. The very actions taken by various firms such as “darkpool trading” and “payment for order flow” are clearly being manipulated to create a ponziesque scheme in which the price of securities is manipulated to channel wealth to those who are connected. And the fact that current regulations seem to allow or at a minimum “tolerate” these actions implies a complicit regulation system. This is no longer something that can be denied or hidden from public view.\n\nI would greatly appreciate a response addressing my concerns with any information you can provide on what actions are proposed or in effect that will:\n\n1. Ensure transparency and fair trading.\n2. Hold firms and individuals accountable with penalties that are strict deterrents for firms and/or individual from committing the same or repeated illegal acts.\n\nSincerely,",
    "title": "I really really do hope that GG is serious about doing his job, BUT speaking as a government employee please DO NOT stop writing to your elected officials and do not stop putting pressure (politely) on GG, the SEC, DTCC and anyone else you can think of.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/oxzh8l/i_really_really_do_hope_that_gg_is_serious_about/"
}