{
    "author": "HelloYouBeautiful",
    "created_utc": 1628100621.0,
    "distinguished": null,
    "edited": 1628266464.0,
    "id": "oxymbc",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oxymbc",
    "num_comments": 91,
    "permalink": "/r/Superstonk/comments/oxymbc/imo_apes_should_continue_and_start_to_route/",
    "score": 644,
    "selftext": "You may think your one share buy dosen't make a difference, but if everybody thinks like that, well.. Your buys probably won't contribute to the price discovery. I know many apes before me have suggested it, but I feel like most people seem to forget to do it, mainly due to their broker's interface.\n\nIf you broker dosent allow routing your buys through IEX, I would urge you to call them. Most of the time they are able to do it over the phone.\n\nMany people are raging at the darkpool activity, and are still not doing everything they can to avoid it as much as possible on their own side. Call your broker, dont give up. Remember how apes all over the world forced brokers to give them the chance to vote? Well, there's your motivation.\n\nBe the change you wish to see. \n\nIf anybody could comment with their own broker and experience with routing through IEX, I will gladly update this post to spread more information about it.\n\nApeTogetherStrong\n\nNot financial advice.\n\n\nEdit: \nSaxo Bank offers IEX routing, However you probably have to call them. I believe Saxo Bank is available to most of the World.\n\nFidelity: u/digi-transformation suggested routing through ARCX. Should be the way to go if you ask him. Other apes have confirmed this aswell.\nDownload their Active Trader Pro desktop app, and you can route your buy order through ARCX. I currently dont have enough information about ARCX to know wether its as good as IEX. Apes please chip in here.\n\nSources: http://help.tradestation.com/09_05/eng/tradestationhelp/routes/arcx_exchange.htm\nYou can also comment on this thread to encourage them to allow IEX routing https://www.reddit.com/r/fidelityinvestments/comments/oxyxe2/this_morning_gary_gensler_admitted_retail_buying/?utm_medium=android_app&utm_source=share\n\nEdit: Interactive Brokers (IB) should allow you to route through IEX. Call them if you are in doubt on how to.\nPlease someone confirm in comments on how to.\n\nEdit: TD Ameritrade should offer routing through IEX. \nGuide is found here: https://www.reddit.com/r/Superstonk/comments/mq8opq/how_to_use_investors_exchange_iex_with_td/?utm_medium=android_app&utm_source=share\n\nEdit: IBKR is offering IEX routing aswell. Confirmed by a fellow ape. u/Da_Squirrel_Monkey with a guide:\nhttps://www.interactivebrokers.com/lib/cstools/faq/#/content/faq%3A%2F%2FpageId%3D115045191?articleId=32657551\n\nEdit: Tradestation offers routing through IEX, says u/Ginger_libra \nhttps://imgur.com/gallery/MgMwg7g\n\nThis is in the mobile app. \n\nTradeStation is available in the following countries:\n\nAustralia, China, Germany, Hong Kong, India, Ireland, Japan, Malaysia, Netherlands, Singapore, South Africa, United Arab Emirates, United Kingdom, United States. \n\nThey are European based. Mostly self clear. Didn’t stop trading in January.\n\nEdit: For E-Trade you should easily be able to do this on their E-Trade pro desktop app, thanks to u/There_are_no_gods - would love a guide.\n\n\nUpdate: I have updated this post, and I still need all the information, confirmations, and guides I can get my hand on. End goal is to have an infographic ready by the end of the week.",
    "title": "IMO apes should continue and start to route through IEX to minimize darkpool activity.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oxymbc/imo_apes_should_continue_and_start_to_route/"
}