{
    "author": "jessish_337",
    "created_utc": 1622096979.0,
    "distinguished": null,
    "edited": false,
    "id": "nm18xg",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nm18xg",
    "num_comments": 308,
    "permalink": "/r/Superstonk/comments/nm18xg/now_that_hoc_2_3_are_out_i_have_something_you/",
    "score": 5127,
    "selftext": " \n\nhttps://preview.redd.it/bqhzxjzexl171.png?width=1515&format=png&auto=webp&s=9f0b09c339dc59d0d9e61a63e1355022f77e7d9d\n\nThis is 114 months from 4/14/21 there are so many data points you can't see it's absurd\n\nSo a beautiful autist wrote some code and put the data on tableau, it's the harvested FINRA FTD data for all tickers available.\n\nLink: [https://public.tableau.com/app/profile/gmeshortsqueeze/viz/SECFails-to-DeliverData/SECFails-to-DeliverData](https://public.tableau.com/app/profile/gmeshortsqueeze/viz/SECFails-to-DeliverData/SECFails-to-DeliverData)\n\nThis is worth playing around with. But, when you do, you will come to the conclusion that this has been going on a long time, and has been predatory and systematic in nature.\n\nGME is an outlier in these 2,287 trading days GME has had FTD's on 2,014 of them, so everyday except 273 trading days that's roughly 9 out of 10, well I sure all stocks have that right since they make it seem so trivial and just a case of happenstance.\n\nWell in those 2,287 trading days there were a total of 36,839 tickers traded, that has us coming in at a incredible ranking of #17 they probably all have something similar to that going on... right?! WRONG the bar chart distribution graph on the bottom shows you how many tickers have had fails on, how many days during this period. Well GME's stats just like our rocket is out of this world the number 2,014 isn't even displayed it's so high. GME is in the 99.999% percentile of the most consistently failed to deliver stock on the market for the last 10 YEARS!!\n\nFor some kicks lets compare it to a stock like AAPL that's a blue chip stock with Billions of shares with all of that trading there's gotta be some trivial happenstance type stances happening trivially there too right. It's had fails on 1931 days a stock with 16.7 Billion shares outstanding so many shares they don't even round down to GME's shares in existence. Average volume of nearly a 100 million shares, and there numbers aren't near GME's think about that.\n\nGo ahead and look at TSLA's the just went through a short squeeze correct, I feel like that's more of an upset stomach, while more consistently failed, the number of fails is nowhere near GME's and their shares outstanding are over 950 Million.\n\nClosely ranked in the top 10 also are the two ETF's that contain GME that have been borrowed to hell XRT and IWM.\n\n📷\n\nhttps://preview.redd.it/eihqw2nfxl171.png?width=1552&format=png&auto=webp&s=82a029028b7b87984261d0d25be03834391a806e\n\nFor full context GME paid a quarterly dividend up until March of 2019, which would make it less attractive to short, but you know that wasn't stopping them completely. Jim Bell the canned CFO who they wanted out of there so bad, they gave him \"Good Reason\" and he collected a 2.8 Million dollar bonus, that was to get him out a whole 4 months early. He was hired in June 2019, and you can't make me believe that he wasn't Steve Cohen, Gabe Plotkin, Virtu, Susquehanna, Citadel's man on the inside. It isn't these guys MO to throw a dart at a board they like to have an inside scoop. He had already ran Coldwater Creek down, a stint at Red Lion Hotels then sunk PF Changs before Gamestop, and he's currently at Backcountry in Park City, Utah. I wonder how those interviews go, so... how many of your former employers are out of business CFO dickhead?\n\nWe also, know how many FTD's they have had to conceal through married puts.\n\nI want to take a little Poll how many shares real and counterfeit do you think exist?\n\nPrice is wrong style, closest without going under in the comments",
    "title": "Now that HOC 2 & 3 are out, I have something you have to see, Just take a look and see the stats, and let your mind extrapolate.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nm18xg/now_that_hoc_2_3_are_out_i_have_something_you/"
}