{
    "author": "_Amberson_",
    "created_utc": 1628126555.0,
    "distinguished": null,
    "edited": 1628144343.0,
    "id": "oy73cw",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_oy73cw",
    "num_comments": 111,
    "permalink": "/r/GME/comments/oy73cw/none_of_this_seems_real_to_me_i_cant_believe_it_i/",
    "score": 1239,
    "selftext": "Everywhere online says people like me are delusional. I’m told I need help. Buy real stocks. Or that Im listening to Q anon. But, I’m doing my own confirmation bias reading. I’ve been here since the start for gods sakes.\n\nMost of the public isn’t aware of the fuckery that keeps them going financially. What keeps their jobs. Their retirement. Their home. And no matter how much we scream, it falls on deaf ears and they just won’t listen. And nor do most of the public ever pay attention half the time anyways.\n\nIM READING NEW APPROVED DD EVERY OTHER DAY FFS. There’s thousands of investors with GME who know a lot more about the market then some of us smooth brains do and that’s what helps me learn. THANK YOU. \n\nBut regardless of how much I’m on here, I feel super alone while I’m holding a lot of money in one stock. No matter how much I read the DD, I feel like the main character and just feel powerless sometimes. Sometimes I wonder, maybe I’m crazy?\n\nBut for some reason, I feel total.fucking.zen. I’m under thousands of dollars in the red and for the first time playing the stock market this is the only time where I don’t care. \n\nThe price isn’t real. Many times in the past I told myself stop being a little bitch and deleted the sell limit orders in the past after realizing holy fuck what am I doing. \n\nRC, DFV, GameStop’s growth, the media, the threats, everything. It’s all confirmed. It all proves to me this is beyond a simple stock. And I know I’m missing hundreds of more reasons why. \n\nI mean, literally my marketing professor jgave me a grade A on my project assignment about GameStop, the future growth, potential and value it has. And that was nonstop back to back 34 pages worth assignment that took 4 months to do. (All with my own words of course and citations) AND IT TOPPED EVERYONE ELSES ASSIGNMENT EVEN BOEING. \n\nI wish I had a copy to show you guys, it was fun to make.\n\nFor fucks sakes, I have NEVER seen a stock chart look this fucky either. And it even resembles previous movements from the past.\n\nI am fully dedicated to seeing the corruption end. I’m paying good fucking money to see Wallstreet get fucked. And the tickets are god damn worth it.\n\nYOU GO GARY GENSLER, ROCK ON DFV, RC YOU DA MAN. GAME STOP WONT STOP.\n\nEven if this takes a year, or years, I’ll be holding.\n\n🦍 🍻 🦧 ook ook\n\nEdit: thank you for all the support. You guys are too wholesome.",
    "title": "None of this seems real to me. I can’t believe it. I mean. My life had revolved and studied for a bullshit market. God, what a plot twist. But, my gut is 100% okay with this but I feel alone surrounded by a bunch of NPCs.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/oy73cw/none_of_this_seems_real_to_me_i_cant_believe_it_i/"
}