{
    "author": "guerrilla32",
    "created_utc": 1628121386.0,
    "distinguished": null,
    "edited": 1628121617.0,
    "id": "oy5mbs",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_oy5mbs",
    "num_comments": 34,
    "permalink": "/r/GME/comments/oy5mbs/the_most_important_thing_i_hope_apes_learn_from/",
    "score": 579,
    "selftext": "What we have accomplished, as a group of unrelated, unsophisticated poor’s, is to discover an opportunity to defeat the unconscionably criminal profiteering and secured a death grip on its nuts. \n\nWhat we’re seeing in response is the flailing of a beast who’s never faced an enemy such as the apes. This is new ground for them which is why they were unprepared and unable to level a useful attack against ape mentality, but do not think that they have not been at this shit for a long, long time. \n\nFor decades, these monsters have used their familiar tactics of manipulation , crime, and fuckery to milk Everyman of their hard earned salary to prop up their minute and guarded basis of power. Pension funds, 401Ks, IRA’s; these are all advertised to the masses as the great retirement equalizer. “The MARKET!” they scream, “you’ve got to get in the market if you want to build real wealth.”\n\nWell, that was a fucking lie.\n\nThey’ve skimmed so much off of the everyday worker for so long, we’d hardly notice it. Achieving a few percent gains YoY in your fund seemed like you were really getting somewhere. And if your employer was generous enough to kick in another few “profit sharing” points for good behavior, well then, just maybe you COULD achieve that time share in the tourist trap by the time you reach 75. Meanwhile, the real money was getting skimmed off the top to provide the eLiTeS with jets and yachts and global vacation properties. \n\nFUCK ALL THAT. \n\nThe Game Stops Now. \n\nCan’t Stop. Won’t Stop. Game Stop.\n\nGG Apes. EZ.\n\n\n\n\n\nEdit: a word.",
    "title": "The most important thing I hope Apes learn from this saga is this; The Wealthy don’t use the stock market to get rich. The use it to STAY rich. All the shenanigans, crime, and TomFuckery we’ve seen are just the tip of the iceberg.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/oy5mbs/the_most_important_thing_i_hope_apes_learn_from/"
}