{
    "author": "unloud",
    "created_utc": 1616631322.0,
    "distinguished": null,
    "edited": 1616645452.0,
    "id": "mckxra",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mckxra",
    "num_comments": 321,
    "permalink": "/r/GME/comments/mckxra/can_we_put_the_diligence_back_into_dd_please_we/",
    "score": 1656,
    "selftext": "What good is DD if we don't vet it?\n\nWatching this community, I've been working on this post in my head for a while. I have 10 GME shares and averaged down on the dip today with another; I believe no matter what happens going forward that Gamestop has a bright future ahead. I am not here to prove to you I am no shill; you can check my history if you feel insecure about my intentions.\n\nThat said, my intentions are irrelevant compared to the truth. The truth of the matter is, as February has transitioned through March, the tangible proof for the **current** state of GME as a squeeze play **going forward** has nearly vanished.\n\n---------------------------------------------------------------------\n\nAdditionally, there is straight up **incorrect** information in the \"God tier\" DD. Here are a list of incorrect statements in no particular order:\n\n1) The NSCC 2021-801 rule change is **not** \"imminent\". In fact, I looked at the timelines of previous NCSS rule-change requests since January 21 of this year (new administration); the average time it takes the SEC to approve a rule change from NCSS seems to span 10-15 days. Since the rule was submitted March 5th, we are three days outside of the typical time it takes for approval - that indicates that there is more going on behind the scenes that **will** delay this indeterminately. \n\nAlso, it would not go into effect for a minimum of 60 days from filing (**May 5th**) - without special permission from the SEC to implement early. The SEC is also unlikely to fast-track this rule change because if that early implementation permission created a debilitating squeeze it would open the SEC to lawsuits by broker dealers accusing the SEC of purposefully bankrupting them.\n\nOne final consideration about this rule change: it could take an indefinite amount of time to implement **even after approval by the SEC**. The rule change proposal even states this - \"The proposal shall not take effect until all regulatory actions required with respect to the proposal are completed. \n\nI worked in the federal government; this type of change with effects on Billions of dollars doesn't happen without planning groups, advisory boards, risk analysis determinations, and sometimes even an actual act of Congress. The \"god tier\" DD says this is \"coming soon\", but the truth is that we need more information before we can accurately claim that this rule is imminent.\n\n2) We do not know what the majority of institutional ownership looks like since *JANUARY*. No seriously, look for yourself: https://www.reddit.com/r/GME/comments/mb5bfr/holy_uranus_look_at_this_institutional_ownership/ . See that column on the right? That is the date that these institutions filed these numbers and MOST of them are from December 2020. \n\nDo you see the problem about this assumption we are making now? It has been **three months** since those numbers were updated **and** there has been sufficient volume over the past month for shorts to have slowly covered without triggering a significant squeeze. We need more information before we can accurately claim that institutional investment is greater than the float at this time.\n\n3) The GME 10K mentioning short squeeze does **not** indicate that Gamestop believes that short squeezes are possible going forward. They are legally obligated to point out the known risk observed during last quarter, but that doesn't mean that they have any insight on the short position going forward. This is serious legal crap; Gamestop isn't blinking morse code to investors while under duress to send a message, it is literally just pointing out the squeeze that we knew about and the uncertain possibility that it could happen again.\n\n4) This volume glitch with **no bid size** literally proves nothing at all: https://www.reddit.com/r/GME/comments/mbs1kb/so_theres_a_643m_order_sitting_on_tos_right_now/\nhow is there any diligence happening there?\n\n5) Failures to Deliver (FTDs) from February tell us nothing about if there are FTDs happening NOW. Comeon guys; FTDs are expected after the January short squeeze that was halted mid-squeeze. The HFs have had almost two months to work on those and they have some cover now because **The SEC so far is not posting the March FTDs**. \n\nNow, you can make a strong argument that the SEC apparently ceasing public reporting of FTDs is sus. However, if you can't rule out another cause for the lack of March data then you can't *actually* prove that there is any nefarious activity occurring or even that GME FTDs are still being rolled forward.\n\nBecause of the change in incoming data, we now need more information before we can accurately claim that FTDs of GameStop are significant at this time. This critical because it means that the selling of fake shares through EFTs on the open market may not match our understanding of share volume.\n\n---------------------------------------------------------------------\n\nI've only gotten through five examples. I was literally just going down from the top of the list of the god-tier DD. I don't intend to keep going because these individual examples are a symptom, **NOT** the true problem. The true problem is that, in our pursuit of keeping the eye on the prize and hodling, WE ARE NOT STAYING DILLIGENT.\n\nWe are an army of APES people; we have many eyes and ways of thinking about these things. Why are we rehasing the same old information while HFs keep evolving to outwit us? If our DD can't stand up to the smallest amount of true scrutiny and revision then how good is it really?\n\nWhen we read DD, it is our jobs as apes to be Devils' Advocate (https://en.wikipedia.org/wiki/Devil%27s_advocate). Just like the Catholic Devil's Advocate stood in opposition, so must we be diligent in truly finding new methods of determining the state of the stock.\n\nI believe that we hurt our community when we are unable to challenge our understanding of the stock at this moment with new data. I hope that maybe we can all be motivated to hunt out the truth some more in order to edify (or dismiss, if necessary) the case for a GME squeeze going forward.\n\nAs for me? I keep hodling and buying because I believe that fire often burns where smoke is seen and I like both the stock and each of you. \n\nI greatly appreciate each of the people on this subreddit that put effort into DD. I really hope that we can do them justice by challenging their assumptions going forward in ways that improve our understanding of this stock.\n\nThanks for your time!",
    "title": "Can we put the \"diligence\" back into DD please? We are getting complacent.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/GME/comments/mckxra/can_we_put_the_diligence_back_into_dd_please_we/"
}