{
    "author": "niftynafty",
    "created_utc": 1616604566.0,
    "distinguished": null,
    "edited": 1616616313.0,
    "id": "mcaijt",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mcaijt",
    "num_comments": 492,
    "permalink": "/r/GME/comments/mcaijt/does_anyone_else_feel_like_the_whole_world/",
    "score": 5744,
    "selftext": "I’ve told everyone I talk to, to look into what’s happening and how it’s a fucking historical moment. I eventually have to give an in-depth explanation and only then do they start to understand why this stock can go to [insert number that I can’t even comprehend] $$ but then they just toss some thoughts on why it won’t - which I then rebuttal (like a god damn wrinkle brain ape - thanks to top notch DD). After this, they might say “yeah I’ll probably buy a couple” or I can see in them they shrug it off and go about their day.. this is a once in a lifetime certainty (in my mind) that those people will look back on our conversation and just go “ohh I was gonna get in just never got around to it, that was lucky it ended up happening tho” or some shit and they won’t see it is and always was a mf ticket to the end of the universe that will most likely never be up for grabs again! Whatever.. I’m jacked to the fucking tits and I can’t wait to watch my wife’s bf fuck her in my bed from space. Hedgies are fukt- BUY AND HODL 🦍🦍🦍🚀🚀🚀\n\nEdit: I know everyone does this “first award bs” edit but... ya kinda gotta.. MY FIRST AWARD! 💎🙌🏻",
    "title": "Does anyone else feel like the whole world understands what’s going on with GME but then realize we are a very small portion that after the squeeze people will look at this group and say “who’d of thought, some people really got lucky”",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mcaijt/does_anyone_else_feel_like_the_whole_world/"
}