{
    "author": "OhBabah",
    "created_utc": 1616612988.0,
    "distinguished": null,
    "edited": 1616654594.0,
    "id": "mcdw5x",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mcdw5x",
    "num_comments": 1398,
    "permalink": "/r/GME/comments/mcdw5x/gme_down_25_today_on_almost_no_volume_this_is_not/",
    "score": 17502,
    "selftext": "*This is an opinion piece based on my own DD. I do not sit on the board of a hedge fund nor have I worked for one. This should be considered theoretical methodology in practice and not empirical absolution*\n\nFor those who are unfamiliar with short laddering, it’s when two bad faith actors (i.e. hedge funds) short and swap synthetic shares (fabricated shares that don’t really exist) at a loss, back and forth to create a downward trend in price. \n\nThis is only done when shares of said stock are heavily shorted to generate retail panic selling to relieve the premium, or at best, even profit when they will eventually have to cover their short interest. \n\nWhen a stock price plummets on lower than expected volume, this is the most obvious indicator of a short ladder attack. This is likely what we are seeing in the last few days with GME. If the price drop were associated with high volume, this would be a real price drop indicator because the only way a stock price drops at this speed without this kind of artificial price suppression is when the selling pressure has increased by volume of sales exceeding the buys. That was not occurring with GME until the price suppression of the shorts triggered institutional stop losses, retail stop losses and paperhands selling off out of fear of loss. Some of that down price is artificially baked in. \n\nIt’s a high risk play for hedge funds because they are banking on retail panic selling to realize the price drop in the real supply/demand economics. If the short ladder doesn’t sweep out retailers, all it does is tighten the coil on the launch of a short squeeze.\n\nThey are basically pulling a “fake it til you make it” strategy here. If everyone holds, the price will return and exceed the real demand price because synthetic shorting is a zero sum game if no one sells out of real shares, which they desperately need retailers to do for it to be effective. \n\nAll we have to do is be Diamond Hand apes and this will not work. Don’t fall for their psychological tricks! Diamond Hand and the moon will be closer than we’ve ever seen it.\n\n———\n\nEdit 1: When I say almost no volume, I mean the volume relative to the price drop. If this were a real drop in price, the volume would be much greater than what we are seeing considering the strong buying sentiment today.\n\nEdit 2: The volume picked up after I made this post making the title misleading but the point remains the same. There was only about 1M volume for two hours mid-day while the price continued to drop. Now sell volume has increased which is an indication of paperhands getting out in late afternoon.\n\nEdit 3: Some of you are taking my “almost no volume” phrasing completely out of context.\nFirst, the volume was around 11M when I posted this but spiked to 20M in the last couple of hours.\nSecond, 20M volume is less than half of the 44M daily avg for GME. (44M daily average according to Yahoo! Finance)\nThird, price movement of this magnitude is extremely atypical for the RELATIVE low volume of the average day.\n\nEdit 4: Some of you don’t like the term “short laddering” and prefer it be called “High Frequency Trading”. Call it whatever you want but the result is the same. Maybe we can call it HFF trading (Hedge Fund Fuckery trading).\n\nEdit 5: For those who are questioning the “short ladder” method, I recommend going to this link and scrolling down to *The Anatomy of a Short Attack*.\nI am not endorsing this as a verified source as I do not know the author, but rather an in-depth explanation of the method for those wanting to understand how this works.\n\nhttp://counterfeitingstock.com/CounterfeitingStock.html",
    "title": "GME down 25% today on almost no volume. This is not possible without massive Hedge Fund short laddering. The price loss is not real.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/mcdw5x/gme_down_25_today_on_almost_no_volume_this_is_not/"
}