{
    "author": "TowelFine6933",
    "created_utc": 1616640409.0,
    "distinguished": null,
    "edited": 1616731606.0,
    "id": "mco0gg",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mco0gg",
    "num_comments": 311,
    "permalink": "/r/GME/comments/mco0gg/squeeze_etiquette/",
    "score": 5360,
    "selftext": "So, we all know the squeeze is coming. When? Dunno. I'm just HODLing until it does. And, when it does, please keep the following in mind.\n\n# During the squeeze it is vital that apes are able to communicate and share DD that informs everyone what is going on behind the scenes and impacts the decision to sell.\n\nI can assure you that all the apes will be watching the chart and price closely. You do **not** need to create a post informing everyone that it just passed 500; 1000; 2000; 5000; 10,000; 50,000; 69,420; 100,000 or any other number. We all know.\n\nYou do not need to post memes of rockets or diamond handed apes. \n\nYou do not need to repeatedly tell anyone to HODL. They got this far, they'll figure it out.\n\nYou do not need to inform others that you are still hodling or that you just sold some or all of your position.\n\nYou do not need to create any post unless it is actual DD or a request for specific information. And, no, asking if it is a good idea to transfer from RH in the middle of the squeeze is not a request for specific information.\n\nIn short (pun intended), during the squeeze, if your post is meant to make others laugh, say \"Yee-ha!\", or do anything other than focus their entire soul and being on the the huge amounts of money that can be made, then you are a shill and really just need to shut the fuck up. Just imagine that you missed out on hundreds of thousands of tendies because too many apes were posting rocket emojis. There will be time to party after the squeeze is over. \n\n# TL/DR: During the squeeze, please allow those who are looking for real and vital information to find it easily by keeping the board free from fluff, silliness and stupidity.",
    "title": "Squeeze Etiquette",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mco0gg/squeeze_etiquette/"
}