{
    "author": "Dismal-Jellyfish",
    "created_utc": 1624400053.0,
    "distinguished": null,
    "edited": 1624401782.0,
    "id": "o5yqcr",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o5yqcr",
    "num_comments": 48,
    "permalink": "/r/Superstonk/comments/o5yqcr/is_it_possible_because_of_covid_canadas_clearing/",
    "score": 338,
    "selftext": "Salutations r/Superstonk neighborhood Jellyfish here, hope everyone has had a great day! I was diving into the DTCC's Latest Important Notices and came across this:\n\n[It looks like Clearing and Depository Services Inc. \\(CDS\\) is setting up an account for Bank of Nova Scotia for tomorrow, we keep seeing that happen... ](https://preview.redd.it/dy263wxxyv671.png?width=987&format=png&auto=webp&s=f30fdf76629c485fa00ade872d28f2ae014e8dad)\n\nAnywho, Clearing and Depository Services Inc. (CDS) had me scratching my head since I haven't heard of them in our saga to this point.\n\nHeading to the trusty Internet (and successfully avoiding PornHub), I came (hehe) across the following:\n\n[Gah, get to the point Jellyfish! ](https://preview.redd.it/4ea60y5pzv671.png?width=1224&format=png&auto=webp&s=8f9d8c3ebdc69a9d2cb771fa7af23f368c337d9a)\n\nRight, so digging along their page further I come across these rules that are in place for Covid:\n\n[Hmm, closed to physically accept US deposits and withdrawals still? Let's try and take a look at this notice ](https://preview.redd.it/ydavc9rxzv671.png?width=1232&format=png&auto=webp&s=00bb798cf392ff1eaf542cbfa446b31edb59ec6a)\n\nOk, this is where I would like to rant a little and give a 'little credit' to DTCC. Thumbing through the CDS  site, it was going to cost $1,200 to find this damn bulletin! I am probably not rubbing my three brain cells together properly after my afternoon snack of magenta crayons, but at least this stuff is free and easy to find on the DTCC...\n\nOk, back on topic, and I think I found a version of the rule Interneting extra hard (pretty sure the link was actually in the comments section of a video on PornHub, but I digress...):\n\n[2020-0024C: A PDF copy can be accepted?!?!? Can anyone else find CDS bulletin # 2020-00033C?](https://preview.redd.it/hi9t2v1k0w671.png?width=875&format=png&auto=webp&s=9da2962eb57187a21562cddfa5e1d3e836612ffc)\n\nSo if I am reading the bulletin correctly and that it is a version of the rule we are looking for but older (This is a big assumption mind you), because of Covid and the CDS window still remaining closed, at their discretion, they will allow for a PDF copy of the transaction to suffice.\n\nErrr, is this a system set up ready to be abused? [PDF substitution scams](https://www.accountingweb.co.uk/tech/tech-pulse/pdf-substitution-scam-targets-finance-departments) target AP departments all the time, is it that big of a leap to think it wouldn't be dialed up to 11 at this level?\n\nFurthermore, wasn't [Paul Manafort](https://www.businessinsider.com/paul-manafort-bank-fraud-pdf-word-document-2018-2) caught in part because he didn't know how to use Word and Adobe 'properly' to cover his tracks when trying to submit fraudulent documents?\n\nTL:DR - I believe there is a chance because of Covid, Canada's Clearing and Depository Services Inc. (CDS) current rules of accepting pdf's can be abused to facilitate FTD's for US securities.",
    "title": "Is it possible because of Covid, Canada's Clearing and Depository Services Inc. (CDS) is being used to facilitate FTD's for US securities?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5yqcr/is_it_possible_because_of_covid_canadas_clearing/"
}