{
    "author": "Csmbird",
    "created_utc": 1624392704.0,
    "distinguished": null,
    "edited": 1624393224.0,
    "id": "o5w43o",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o5w43o",
    "num_comments": 66,
    "permalink": "/r/Superstonk/comments/o5w43o/need_more_wrinkly_brains_gone_down_an_aviation/",
    "score": 635,
    "selftext": "# tl;dr:\n\nThis might be nothing.....but I found some weird shit that I need help with. Think there may be other companies swept under the rug. I'm looking to close and can't see what's under my nose.\n\nSo I posted earlier breaking down some behaviorism shizzz as it related to the market.\n\n&#x200B;\n\nWell u/cashmeresquid2309 and u/itsunclejerry [mentioned](https://www.reddit.com/r/Superstonk/comments/o5rl2l/behaviorism_girl_here_lets_talk_about_this_shiz/h2obvmr/?context=3) there having been a [thread  about Ken G.](https://www.reddit.com/r/Superstonk/comments/mou8ww/ken_griffin_exposed/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\nAfter going to the thread I noticed  something interesting talking about how he owned a 2012 and 2001 bombardier. I thought this sounded interestingly familiar. Then I realized....Oh duh, it's familiar because I saw these make and same models when I was looking at Cessna's on [Controller.com](https://Controller.com). There are quite a few of the same make and models that he has.\n\n&#x200B;\n\nSo I started digging around\n\n&#x200B;\n\n[Uno](https://preview.redd.it/yfweyhh9av671.png?width=1897&format=png&auto=webp&s=5344649637b8c880567788a120b6360b94e2be6c)\n\n&#x200B;\n\n[dos](https://preview.redd.it/h3jfvdrnav671.png?width=2014&format=png&auto=webp&s=9a2772231a1fa128e121615a28e46c7388c19631)\n\nQuite a few of the same...could be coincedental.\n\n&#x200B;\n\nAfter digging through some of the sellers I saw this one...there's also some in London but they don't have interesting ties.\n\n&#x200B;\n\n&#x200B;\n\n[New Jersey is close to NYC...and Citadel](https://preview.redd.it/60iy13c3bv671.png?width=1803&format=png&auto=webp&s=9d4fd45fda8073bb719bfb6bc2617a8e031b816e)\n\n&#x200B;\n\nStill speculation yeah.\n\n&#x200B;\n\nSO I looked up Leading Edge Aviation Solutions. I started going through their [team members.](https://leas.com/team/) And they're all quite incestuous with other aviation companies. I can't find exactly where it is or remember precisely what it was...but something made me look at DuckDuckGo with keywords \"ken griffin aviation company.\"\n\nThere is a [Griffin Aviation.](https://flcompanydb.com/company/L06000067245/griffin-aviation-llc.html)\n\n&#x200B;\n\nThere also is a [Griffin Asset Managemen](https://www.griffingam.com/about)t (interesting [article](https://www.businesswire.com/news/home/20210426005957/en/Griffin-Global-Asset-Management-Closes-1-Billion-Warehouse-Facility)out of Dublin and LA which works closely with aviation. I find this interesting as Griffin Aviation has been dead and inactive and this is an asset company that does alot within the aviation world. Interestingly another [Griffin Asset Management ](https://newsroom.aviator.aero/griffin-global-asset-management-closes-1-billion-warehouse-facility/)company closed on a warehouse deal on April 23rd, 2021\n\n    DUBLIN--(BUSINESS WIRE)--Griffin Global Asset Management DAC and Griffin Global Asset Management (Servicer) LLC (together, “Griffin”) announced today that on April 23, 2021 Palisade Aviation Holdings Warehouse, Ltd. and Palisade Aviation Holdings Warehouse, LLC (together, the “Borrowers”), closed a five-year senior secured warehouse facility with an initial committed amount of $1,000,000,0000 (the “Facility”). The Borrowers were jointly established by Griffin and funds managed by Bain Capital Credit, L.P. as part of a joint venture focused on building a diversified aviation portfolio in conjunction with a world-class commercial aviation leasing and alternative asset management platform.\n    \n    The Facility includes innovations that provide the Borrowers with maximum flexibility to offer its airline partners a variety of financing solutions, ranging from operating leases to finance leases to direct loans across a diverse spectrum of asset types and ages. The Facility is also unique in providing more flexibility on concentrations of certain airline exposure than a traditional warehouse facility, providing the joint venture with a powerful bridging tool to long-term capital markets solutions.\n    \n    “We are grateful for the support from our banks as we grow the Griffin platform into a leader in the aircraft leasing and financing sector. This warehouse facility has significant capacity and flexibility that will allow us to create customized capital solutions for our airline customers going forward,” said Ryan McKenna, Founder and Chief Executive Officer of Griffin.\n    \n    “Developing this warehouse facility was a collaborative process with our lending partners and resulted in a first-of-its-kind facility in the aviation industry. The overwhelming support from these seven financial institutions is very meaningful as the growth of Griffin accelerates. Going forward, we will continue to create innovative financial products that will meet the evolving needs of the airlines and OEMs in this dynamic market,” said John Beekman, Chief Financial Officer of Griffin.\n    \n    Goldman Sachs acted as the structuring agent for the Facility. Initial commitments for the facility were provided by Goldman Sachs, Barclays Bank PLC, Mizuho Americas, Morgan Stanley, Wells Fargo Bank, National Association, Bank of America, N.A. and Deutsche Bank AG, New York Branch.\n    \n    Hughes Hubbard & Reed LLP acted as U.S. legal advisors to Griffin and the Borrowers, Milbank LLP acted as legal advisors to the Lenders, Maples and Calder (Ireland) LLP acted as Irish legal advisors for the Borrowers, Maples and Calder (Cayman) LLP acted as Cayman Islands legal advisors for the Borrowers, A&L Goodbody LLP acted as Irish legal advisors to Griffin and PWC acted as Irish tax advisors for Griffin and the Borrowers. UMB Bank, N.A. is acting as the administrative agent and the security trustee.\n    \n    About Griffin Global Asset Management\n    \n    Griffin is a commercial aircraft leasing and alternative asset management business with offices in Dublin, Ireland and Los Angeles, USA. Griffin’s team of aviation professionals works closely with airlines, OEMs, and financiers to deliver customized fleet solutions and innovative financing products to airlines globally.\n    \n    For more information, please visit www.griffingam.ie or www.griffingam.com.\n    \n    About Bain Capital Credit\n    \n    Bain Capital Credit, L.P. (“Bain Capital Credit”) (www.baincapitalcredit.com) is a leading global credit specialist with approximately $48 billion in assets under management as of December 31, 2020. Bain Capital Credit invests up and down the capital structure and across the spectrum of credit strategies, including leveraged loans, high-yield bonds, distressed debt, private lending, structured products, non-performing loans and equities. Its team of more than 200 professionals creates value through rigorous, independent analysis of thousands of corporate issuers around the world. In addition to credit, Bain Capital Credit invests across asset classes including private equity, public equity, venture capital, and real estate, and leverages the firm’s shared platform to capture opportunities in strategic areas of focus.\n    \n    \n    \n    Contacts\n    Press Inquiries\n    \n    For Griffin Global Asset Management:\n    Lauren Groom\n    lgroom@griffingam.com\n\nOriginally I was going to only show the first paragraph till i realized Goldman and Sachs and JP Morgan was also included. THIS IS EFFING WEEEEIRD.\n\nI went to the CFO's linkdin....Cause it was [linked in](https://www.linkedin.com/in/rmckenna13/) on something I stumbled [upon](https://finance.yahoo.com/news/griffin-global-asset-management-announces-130000802.html).\n\n&#x200B;\n\n[BLIND POOL!?](https://preview.redd.it/3cs2077dgv671.png?width=1168&format=png&auto=webp&s=119a488f2ffe299e93241a09e84e353967d14d09)\n\nNotice how she was the Senior VP and head of strategic planning and lead formation and capital raising of PRIVATE EQUITY PLATFORMS WITH A BLIND POOL OF CAPITAL?!\n\n&#x200B;\n\nT[his article s](https://finance.yahoo.com/news/griffin-global-asset-management-closes-050000754.html)he's mentioned in also states info regarding a business in Cayman Islands....isn't that where some of Kenny G's money is?\n\nWent on down the line and there's a Griffin Global hiring company out of Jupiter...Right next to KGs Palm Beach town. Look at who they are hiring. Notice how they're all related to software development...? Interestin, no?\n\nInterestingly there is also a G[riffin Asset Management](https://www.griffinasset.com/) in New York.\n\n&#x200B;\n\n[Notice the address?](https://preview.redd.it/s2v56bzhhv671.png?width=1890&format=png&auto=webp&s=86d16c8c8f3ceb5050fcec7a01e47836dc64f4ad)\n\n&#x200B;\n\nJust a smidgen away from Citadel\n\n&#x200B;\n\nhttps://preview.redd.it/8oybixdmhv671.png?width=1592&format=png&auto=webp&s=24349c3dbd632850a5848573a062ae153732bf13\n\nI could be wrong but this is freakin weird.\n\nGuess what? Griffin Assets is a[Hedge Fun](https://whalewisdom.com/filer/griffin-asset-management-inc#tabsummary_tab_link)d....Right by Citadel....with 632 investors.\n\n&#x200B;\n\n[Look who they've invested in....](https://preview.redd.it/ax22yoj8iv671.png?width=1914&format=png&auto=webp&s=1e57044e729b508ba93cd18d9386fcd1f2bf0f37)\n\n&#x200B;\n\nSee Boeing. See the connection with aviation at the beginning?\n\n&#x200B;\n\nI'm missing alot of shit. This really might look more like swiss cheese than DD....but I NEED help filling some of the gaps! I really should stick to studying behavior...but the fuck something is off here. Help help.\n\n&#x200B;\n\nThis aint no financial advise.\n\n&#x200B;\n\n\\[who would take advice from someone who hasn't the clue about the difference between advise/advice lol....or someone who uses double negatives....just don't\\]\n\n&#x200B;\n\nEdited to add: u/donutolu was the one who linked me to the thread about him having bombardiers. Sorry for not originally linking you bud. You are right. Somethings off with the guy. ",
    "title": "🐱‍🏍🐱‍🏍Need More Wrinkly Brains. Gone down an Aviation Asset Manager Hole that might have ties to Ken G...and another Hedge Fund at 230 Park AVE NY......Right beside CITADEL. Plus Possible Cayman Islands Location of Hiding Funds?🐱‍🏍🐱‍🏍",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5w43o/need_more_wrinkly_brains_gone_down_an_aviation/"
}