{
    "author": "Criand",
    "created_utc": 1624352775.0,
    "distinguished": null,
    "edited": 1624352899.0,
    "id": "o5ingt",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o5ingt",
    "num_comments": 1084,
    "permalink": "/r/Superstonk/comments/o5ingt/wait_is_nscc002_about_to_turn_the_t21t35_loop/",
    "score": 18681,
    "selftext": "# 0. Preface\n\nI am not a financial advisor. I do not provide financial advice. Many thoughts here are my opinion, and others can be speculative.\n\nSo, NSCC-002 just got approved, along with NSCC-801 for one-hour margin calls. Not only did it get approved, it got **accelerated** approval and will be in effect **Wednesday, June 23rd**.\n\nThis got me **JACKED**. But of course don't get too hyped just because of me. It could all be a nothing burger in the end. But, there's some crazy shit going down that I think is telling of what is about to come.\n\nThere's also comments of \"these rules mean nothing until they are enforced\". Yes, I agree. But, consider the fact that the NSCC, ICC, OCC, DTC **have all been drafting up rules to protect themselves** **in the event of member defaults and extreme market stress**. They aren't just drafting these up to say, \"Meh. Nevermind\". The NSCC, ICC, OCC, DTC are full of members who are **NOT** short on GameStop or other positions that put these entities at risk. The other members have influence and do not want to be dragged down either. It's a battle of survival.\n\nI also apologize if anyone has already posted about this. I do know that /u/dentisttft had identified these SLD periods in their post about T+35 when tying in the spikes of price! Such a smart ape! I'm going to expand on their post here, identifying the importance of NSCC-002 to the theory.\n\nA comment by [/u/minnowstogetherstonk](https://www.reddit.com/u/minnowstogetherstonk/) also encouraged this discussion, first identifying [that T+35/T+21 could turn into T+0 that feeds on itself.](https://www.reddit.com/r/Superstonk/comments/o4y2so/nscc2021002_approved_with_partial_amendments/h2k0os3?utm_source=share&utm_medium=web2x&context=3) If this is what is about to happen... genius ape!\n\nI personally think that NSCC-002 will trigger a death-spiral for SHFs as we approach Q2 end, and shit is about to hit the fan across all markets.\n\n[Awww shit](https://preview.redd.it/q1te0jsbzr671.png?width=1686&format=png&auto=webp&s=4407f66bc6efcdd10e5d6323bea7bc2611371385)\n\n# 1. NSCC-002 And It's Effects On Liquidity Deposits\n\nNote: Like I said above, this is expanding off of /u/dentisttft's post of T+35 found here: [T+35 Is The One True Cycle](https://www.reddit.com/r/Superstonk/comments/o155a6/t35_is_the_one_true_cycle_evidence_to_back_my/). It visually showed the NSCC liquidity cycle times and the effects it had on FTDs, which never really clicked until thinking about NSCC-002 a bit more. Give their post a read! :)\n\nSomething big to remember is that **NSCC-801** now goes into effect **along with NSCC-002**, which allows for **one-hour margin calls**. This means that when a member does not have sufficient liquidity, they will be asked to post it within **one hour** to the NSCC. If they do not post the liquidity, then the member defaults. And thus, the snappening begins.\n\nLet's investigate the most important bits of NSCC-002. First, a glance at what the rules **used to be** and the NSCC's concern driving the rule change\\*\\*:\\*\\*\n\n[NSCC-002 Part 1; Old Liquidity Requirements](https://preview.redd.it/yjhyg0vrzr671.png?width=793&format=png&auto=webp&s=1c593670c431dca25f897bf1ffa26197b3b60fc9)\n\n[NSCC-002 Part 2; Old Liquidity Requirements](https://preview.redd.it/k7sfq4iszr671.png?width=784&format=png&auto=webp&s=61deac31a63ecb823c3ea5939792043b2b890a87)\n\nPrior to this rule change, the NSCC would collect liquidity deposits **only during Monthly Options expiry periods**. What is a monthly option? It is the **third Friday of each month:**\n\n* January 15\n* February 19\n* March 19\n* April 16\n* May 21\n* June 18\n* July 16\n* Etc.\n\nThe NSCC realized that shit could get really wonky between those liquidity periods of the monthly options. These volatile movements in the markets would put the NSCC itself at risk due to some of its members positions. So, they decided to draft up this rule which allowed them to not only grab liquidity around monthly options, **but to be able to ask for more liquidity on a daily basis**. This allows the NSCC to take hold of volatility and say, \"enough is enough, you're done for\".\n\nNow, check this out:\n\n[NSCC-002 Part 2; New Liquidity Requirements](https://preview.redd.it/754z0dte1s671.png?width=799&format=png&auto=webp&s=736bb773f6515211f916788f10fe1ba914c1569c)\n\n[NSCC-002 Part 2; New Liquidity Requirements](https://preview.redd.it/wp8f279f1s671.png?width=741&format=png&auto=webp&s=cae04b68606972c68160dc782ad61d53a9bbac03)\n\nThe NSCC defined a period of grabbing liquidity and holding it to be 2 business days prior to monthly expiration, and ending 7 days after monthly expiration. From the dates listed above, this gives you the following time periods of liquidity deposits for monthly expirations:\n\n|Monthly Option Date|Liquidity Deposit Given By Member To NSCC|Liquidity Deposit Returned To Member From NSCC|\n|:-|:-|:-|\n|January 15|January 13|January 27|\n|February 19|February 17|March 2|\n|March 19|March 17|March 30|\n|April 16|April 14|April 27|\n|May 21|May 19|June 2|\n|June 18|June 16|June 29|\n\nAnd if you remember from /u/dentisttft's posts, these periods **all contain the T+21/T+35 dates of January 25, February 24, March 25, April 26, May 25, and June 24**. So it appears that, as /u/dentisttft concluded, that they struggle with liquidity during these time periods of FTD deliveries and the price gets much greater upward momentum.\n\nGoing back to the images above of NSCC-002... notice that in the old rule that the amount of liquidity that needed to be posted for monthly expirations was **based on settlement activity of the prior 24 months**. That's a lot of leeway on how much liquidity is needed per member as it was not checking real-time data.\n\n**NOW**... the NSCC is changing it to a **daily calculation**. **It's no longer a one-and-done deal of the monthly liquidity based on the prior 24 months**. It is going to be based on a **constant check of real-time data**. This can shift the total liquidity required from the previous rule up significantly, mainly because it is no longer based on the **prior 24 months** of settlement activity.\n\n# 2. T+21/T+35 Loop Turns Into A T+0 Death Spiral\n\nRemember how shit went absolutely wild around March 10th? That was outside of a liquidity deposit phase. And then, **the price was tanked and brought down severely JUST BEFORE the next liquidity deposit was required.**\n\n[GME Price Action Prior To Next Liquidity Requirement](https://preview.redd.it/yv2xmolw2s671.png?width=251&format=png&auto=webp&s=972401702a7cdee5648397fb0a827f137d3c1902)\n\nIn fact, something curious is that **the price has never been above $228 entering the next liquidity posting date, and has never been above $300 during these liquidity dates**. Hmmm? Margin call price could be **dangerously** close. And with NSCC-002/801, it can absolutely screw the SHFs.\n\nWhat does this all mean in the end? **Well, it can turn the T+21/T+35 loop into a T+0 death spiral.**\n\nThey used to have to post liquidity two days prior to the monthly options. But now, the NSCC has the discretion to ask for **MORE** liquidity at **ANY** time based on daily movements of prices. The previous liquidity posting was a **one-and-done deal** instead of a liquidity requirement that would constantly update **every day of the year**. And if they fail these new liquidity checks? **One**. **Hour**. **Margin calls**.\n\nHere's a figure based on /u/dentisttft's liquidity deposit phases identifying what could happen starting Wednesday, June 23rd:\n\n[GME Price Action And Liquidity Deposit Phases](https://preview.redd.it/ebuouwrl4s671.png?width=1536&format=png&auto=webp&s=adb54e7938d647d2f1d43f1b9ccbaeeac3701cad)\n\nThis could very well be why they are trying to obliterate the price at the moment.\n\nThe next FTD spike can cause the price to absolutely soar into a price range which requires more liquidity, making it harder for them to suppress the price, and pushing GME more towards the margin call price. Which then feeds on itself requiring more liquidity, and it continues on an absolute death spiral.\n\nWhich can then lead to this:\n\n[Happy GME TA](https://preview.redd.it/emkfeo659s671.png?width=1536&format=png&auto=webp&s=a1459a1ed24e63e7193930567c2dbcd1c4917884)\n\n# 2. Urgency to Approve NSCC-002; Quarter End Of June 30th; Meeting Between Biden, Powell, Yellen, Gensler\n\nGuess what? The 2008 crash \"started\" around the end of Q3 with the collapse of Lehman Bros on **September 15**, 2008. **End of quarters are when the system gets really strained due to the underlying plumbing of the markets and the necessity to pump balance sheets**.\n\n>Banks’ “reporting” dates are known inflection points in the short-term funding markets and typically fall at the end of the month, quarter, and of course the year. But periodically, **the 15th of the month is also a pressure point.** \\- [Source](https://blog.pimco.com/en/2019/09/repo-rate-spike-a-tail-of-low-liquidity)\n\nFast forward to when the Fed attempted to reverse QE. A year after performing QT (reverse of QE), the repo market blew up to 10% interest on **September 15**, 2019 due to way way way too many loans that had to be handled. **You can see how strain on the markets starts to amplify around particular dates of Quarter-ends and occasionally the 15th of months.**\n\nWe're approaching the end of Q2 which is June 30th. Hm. **Quarter end**?! Sound familiar? 👀\n\nThe NSCC-002/801 is having **accelerated** effectiveness. There is huuuge urgency to get this passed for margin requirements and margin calling members. **Why would they be pushing this to get it out the door?** I think shits about to hit the fan. They NEED to protect themselves.\n\nSomething else to note is that Biden, Yellen, Gensler, and Powell all met for \"Climate Change\" discussions today.\n\n>“The regulators reported that the financial system is in strong condition,” the White House said in a readout of the meeting. - [Source](https://www.washingtonpost.com/politics/2021/06/21/joe-biden-live-updates/)\n\nThat's the entire context of the quote. That the financial system is \"in strong condition\". What are they **actually** doing at this meeting? Something similar to discussing letting X Y and Z fail just like they discussed letting Lehman Bros fail in 2008?\n\nThe [Jungle Beat Monday Post](https://www.reddit.com/r/Superstonk/comments/o54hl2/the_jungle_beat_monday_06212021/) talked about this very briefly and it was something I latched onto immediately. I remembered [the meeting for 2008](https://www.cnbc.com/2018/09/12/bernanke-paulson-and-geithner-say-they-bailed-out-wall-street-to-help-main-street.html) but did not connect the dots to this meeting between Biden, Powell, Yellen, and Gensler possibly being similar in scope.\n\nWild times we live in. But remember - don't fuckin' dance.",
    "title": "Wait... Is NSCC-002 about to turn the T+21/T+35 loop into a death spiral of T+0 as we approach Q2 end?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5ingt/wait_is_nscc002_about_to_turn_the_t21t35_loop/"
}