{
    "author": "RobinGoods",
    "created_utc": 1624401593.0,
    "distinguished": null,
    "edited": 1624424764.0,
    "id": "o5z8vc",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o5z8vc",
    "num_comments": 129,
    "permalink": "/r/Superstonk/comments/o5z8vc/working_theory_the_shf_white_square_that_just/",
    "score": 1000,
    "selftext": "None of this is my original findings just not seeing much on this sub about White Square that closed down from taking double digit losses from GME. \n\nYou can read these articles for more details:\nhttps://www.ft.com/content/397bdbe9-f257-4ca6-b600-1756804517b6\nhttps://www.barrons.com/articles/hedge-fund-closes-white-square-gamestop-losses-51624384451\n\n/u/go_do_that_thing/ had this post that broke down their findings on who white square is. \n\nhttps://www.reddit.com/r/Superstonk/comments/o5jp6s/we_all_know_white_square_is_some_fud_but_heres/\nOriginal image here: https://i.redd.it/kkb1x3f2ms671.png\n\n\nSome things from this post that caught my eye are:\n1. They own 687k shares of GME (if my math is right that’s where the 7% comes from in the title, ~~what does this mean with the current rules in place. They have to cover in the next few days from their margin call? I’m a dumb ape)~~ **EDIT:  Looks like /u/go_do_that_thing found they are long GME, so how did GME bust them? And what happens to their shares? They get sold all at once from margin call or does ownership and positions go to the parent company?**\n2. All income derives from a parent company\n3. Their address is also matching an identity in the panama papers \n4. And this comment from u/taimpeng\n\n&amp;amp;amp;gt; So, I’ve got a crazy theory.. I’ve previously argued one way a big player would’ve prevented little guys from collapsing would’ve been to buy out their positions and take them on (at the last possible moment, because it’s un-ideal, but better than letting dominos fall). It might look like some big unexplained, collateralized, debts showing up on their books … maybe done through Archegos-style total return swaps, against the short positions being held in shell companies:\n&amp;amp;amp;gt; https://www.reddit.com/r/Superstonk/comments/o4ut4p/shitadel_buying_lots_of_iou_notes/\n&amp;amp;amp;gt; In which case closing off one of those debts might look a lot like White Square… anyone able to poke holes in that idea?\n\n5. And u/DrGraffix reply https://www.reddit.com/r/Superstonk/comments/o5jp6s/we_all_know_white_square_is_some_fud_but_heres/h2nj72t?utm_source=share&amp;amp;amp;amp;utm_medium=web2x&amp;amp;amp;amp;context=3\n\n&amp;amp;amp;gt; i firmly believe that this is what Point72 and Citadel did w/ Melvin Capital. I believe they took on their positions because is Melvin was margin called and had to close out their positions, it would have raised prices even more and the dominos would fall\n\n(This would means Plotkin wasn't lying when he said they'd closed their position. By \"closed\" he meant off-loaded to Citadel)\n\nCan we get some wrinkle brains on this?\n\nEdit: made edit to #1\n\nCallouts from comments:\n1. https://www.reddit.com/r/Superstonk/comments/o5z8vc/working_theory_the_shf_white_square_that_just/h2pk546/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3 \n > ; You can mislabel short positions as long.  One of the tricks that they get a small fine for.\n\n> ; On November 13, 2020, FINRA fined Citadel Securities $180,000 for failing to mark 6.5 million equity trades as short sales.",
    "title": "Working Theory: The SHF (White Square) that just went bust is a burner Hedge Fund (and has over 7% of GME float)",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5z8vc/working_theory_the_shf_white_square_that_just/"
}