{
    "author": "No1Important_4real",
    "created_utc": 1624591858.0,
    "distinguished": null,
    "edited": 1624592469.0,
    "id": "o7fiyf",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o7fiyf",
    "num_comments": 74,
    "permalink": "/r/Superstonk/comments/o7fiyf/1000_cuts_how_its_going_reported_si_at_967_million/",
    "score": 574,
    "selftext": "Well, the SI numbers have been published and the reported SI is 9.67 mil.\n\n[https://www.morningstar.com/stocks/xnys/gme/quote](https://www.morningstar.com/stocks/xnys/gme/quote)\n\nThat means that they did not simply report their shorts for June 1st - 14th like I believed they would.\n\nI still stand by my logic however. I don't think they hid the shares in options, I don't think they merely falsified their reports, and I don't think they simply mismarked all their shorts as long. Conservatively there should of been around 50 million short shares generated those weeks and with best case scenario (for them) there still would of needed to be 20 million shares reported (20/58=35% SI).\n\nSo there's 10 million shares hidden away in some new strategy.\n\nCouple all of that with these past two days and the T21 cycles not manifesting and I'm quite confused as to how they're doing it.\n\nWe still know they're synthetically generating more shares than they could possibly be closing day after day, and the fundamentals are still sound (why else would the price be at $200 now after a full week of trying to keep the price down).\n\nIf nothing else, please understand I am in no way doubting the end point of this ride, it's the moon. There are too many strong data points showing us those large signals. What this question is, is the tiny details, the day to day trading.\n\nThe real kernal of truth here is this: They have used one strategy for over 6 months now. It's been working for terms of month to month. They managed to drag the price down over and over using the strategy. Clearly though it wasn't working, if it was they would of kept doing it. Their strategy wasn't working.\n\nMy gut tells me they've moved on from a month to month strategy to a shorter term strategy. I just can't understand how though. For the first time since March I don't understand a fundamental part of this stock's price.\n\nI'm going to keep digging into this, looking for possibilities. I have a few threads I'm pulling on, but I need more data. If I figure something out before MOASS, I'll report back.",
    "title": "1000 cuts. How it's going. Reported SI at 9.67 million",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7fiyf/1000_cuts_how_its_going_reported_si_at_967_million/"
}