{
    "author": "carbon_atoms",
    "created_utc": 1627450309.0,
    "distinguished": null,
    "edited": false,
    "id": "ot3mtr",
    "text_only": true,
    "flair_text": "🖥️ Terminal | Data  👨‍💻",
    "name": "t3_ot3mtr",
    "num_comments": 175,
    "permalink": "/r/GME/comments/ot3mtr/sp400_inclusion_gme_will_be_the_top_5_market_cap/",
    "score": 2444,
    "selftext": "**Executive Summary: GME with a market cap of $13+ billion (*****so far*****) joins the S&P 400 Midcap. That market cap will be the fifth biggest among the index's 400 companies. ETFs that track the index in total have about $90 billion AUM. As the top 5 market cap, GME is expected to make up 0.61% of the funds. Therefore, about $550 million (0.61% \\* $90 billion) worth of GME is expected to be bought once the index rebalancing completes.**\n\n# - What is the [S&P Midcap 400 Index](https://www.spglobal.com/spdji/en/indices/equity/sp-400/#overview)?\n\nMid-cap exposure generally captures a phase in the typical corporate life cycle in which firms have **successfully navigated the challenges specific to small companies**, such as raising initial capital and managing early growth. At the same time, mid caps tend to be quite **dynamic** and not so large that **continued growth** in unattainable.\n\nTo be included, companies must have an unadjusted **market cap of $3.6 billion to $13.1 billion**.\n\n# - What portion of the related funds will buy GME?\n\nAs market-weighted ETFs, those that track S&P Midcap 400 will buy shares of companies proportional to their market cap. So how much can we expect? Let's look at an example ETF, IVOO:\n\nhttps://preview.redd.it/kez6n9e22wd71.png?width=971&format=png&auto=webp&s=af970302529f7480d67a7a84da0e036ee7e9625e\n\nThe fourth and fifth highest market cap companies in the index are Fair Issac (\\~$15 billion) and SolarEdge (\\~$12 billion), respectively. Each of them make up 0.61% of the fund. **GME is expected to take the top 5 place** and be allocated 0.61% of the fund.\n\n# - What is the total AUM of ETFs related to S&P Midcap 400?\n\nThere are 10 ETFs tracking the index with the **total AUM of about $90 billion**. Blackrock's (*surprise*) fund, IJH, is by far the largest with $62 billion.\n\nhttps://preview.redd.it/vax31cyq2wd71.png?width=1117&format=png&auto=webp&s=20f1e712e1ff6e4aeffe5b3235e32bfd7e228902\n\n# - How much $ inflow to expect from the index rebalancing?\n\nGME is expected to be allocated 0.61% of the $90 billion. That leads to **$550 million worth of GME** needing to be bought by the rebalancing due Aug 4th. These ETFs will buy and hold just like apes. Happy GME day everyday!",
    "title": "S&P400 Inclusion: GME will be the TOP 5 market cap in the index. $550 MILLION inflow expected from index efts with $90 BILLION AUM 🚀🚀🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/ot3mtr/sp400_inclusion_gme_will_be_the_top_5_market_cap/"
}