{
    "author": "BigBrainBets",
    "created_utc": 1614998738.0,
    "distinguished": null,
    "edited": 1615009705.0,
    "id": "lysax2",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lysax2",
    "num_comments": 204,
    "permalink": "/r/GME/comments/lysax2/i_believe_gmes_new_baseline_price_is_12942_here/",
    "score": 830,
    "selftext": "# TL;DR.\n\nGive it a read you lazy bozo. (~17 minute read time)\n\nSkip to \"This is where it get interesting\" if you have a short attention span.\n\n&#x200B;\n\nThe real TL;DR.\n\n**I believe the new baseline price for GME is $129.42.** This is the breakeven price of a huge fucking whale that spent \\~$167M (\\~$187M if exercised) on call options spanning the last five days, March 1st-March 5th.\n\n**The theory has been consistent since its inception; whether that be by luck or coincidence. No matter what the cause, there is an undeniable correlation up until this point.**\n\n* On March 3rd, GME closed at $124.18, 17 CENTS ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.\n* On March 4th, GME closed at $132.35, $4.33 ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.\n* On March 5th, GME closed at $137.74, $8.34 ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.\n\nIt is my belief that **this multi-hundred millionaire (more likely billionaire, or entity, at this point), has much deeper pockets** than what they leveraged on the options. They'll almost certainly be willing to exhaust millions more to ensure the success of their $186M+ options play. This can be achieved by **proactively keeping the price above their $129.42 breakeven** and simultaneously prevent any steep price drop that may affect the current **positive sentiment** until this rocket takes off.\n\nIf I was a smart man, which I'm probably not considering how much time I spend in here, I would see this as extremely BULLISH. It is a strong indicator that encourages ME, maybe others, to buy more GME.\n\nDo not misconstrue this as a whale out there protecting GME retail investors, they have their own agenda and intentions which are completely unknown to anybody but themselves. The stock market is a dog-eat-dog, or Ape-eat-Short, world. Do your own DD and come to your own conclusions. Thanks for your attendance.\n\nLastly,\n\n**🐻 🌈's will be 🐻 🌈's** and ask if this is a short trying to scoop up shares under the radar. I acknowledge this possible, but I am not personally convinced this is the case here. This is my own opinion, and I've been wrong about many things. Just like you were wrong about your wife loving you until death did you part.\n\nScroll to \"Counter Argument\" at the bottom if you are interested in why I believe this.\n\n&#x200B;\n\n# Begin Post (lots of math, skip ahead if you don't care about the data)\n\nIf you missed my first post on Wednesday afternoon, that's okay, I've included all of my original data and analysis with more nuanced explanations in this post.\n\nAs of now, my theory has stood on its own two feet, whether by truth, coincidence, or pure luck, but there is an undeniable correlation supported by *FACTS* and *MATH* with a sprinkle of my own *Autistik Insight*.\n\n&#x200B;\n\nLet me fully reiterate, this could be an absolute coincidence, but my tinfoil hat and Alex Jones voodoo doll suggested otherwise. So, I took Eddie Bravo’s advice, and I “LOOKED INTO IT.” These are my (updated) findings.\n\nThis is NOT financial advice; nor should it be construed as such. I am a broke law student (important later) with a vested interest in the success of GME. I do have an innate ability to decipher logic and rational behavior, so I’ve decided to share my opinion with you all for your own preponderance. Feel free to discuss and/or disagree. I sincerely encourage and embrace the importance of evaluating a set of facts from various perspectives.\n\n&#x200B;\n\nIf you have not done so already, please skim the (updated) OP below, and pay homage to both [u/dan\\_bren](https://new.reddit.com/user/dan_bren) and [u/tapakip](https://new.reddit.com/user/tapakip) for their service in bringing this information to my attention. Once you’ve done so, return here. If you’re up to date on my previous post, AND u/dan_bren’s then continue to the math lesson and extensive speculation below.\n\n[(2) UPDATE (3/5): $131 Million of DEEP ITM GME CALLS have been purchased since 3/1(Monday) : GME (reddit.com)](https://new.reddit.com/r/GME/comments/lxxaty/update_34_131_million_of_deep_itm_gme_calls_have/)\n\n&#x200B;\n\nAs I said last time, don’t be a dick. *ALEAST SKIM IT* if you haven’t already.\n\n&#x200B;\n\nIf you’re new to this theory, there is a very strong presumption that these calls were all purchased by the same buyer. *Why do we think this?* Keep reading.....\n\nFirst, they are the only one purchasing calls that are this deep ITM within the last week. Second, they have all been purchased out of the Philadelphia exchange.\n\nAnd third, *look at the execution times of the trades*. The block purchases are executed at the same millisecond, indicating they were linked transactions by the same buyer. Based on the information available to us, it makes the most logical sense that these options have all been bought by the same individual, or entity. If that's not enough to caress your tin-foil hat, then you're probably a god damn boomer that doesn't even believe Area 51 exists. I'll keep going anyways.\n\nWhen I originally evaluated this data, I was personally perplexed by the prospect of someone having the confidence to shell out this much premium and take on the exponential risk of these deep ITM calls. But, to each his own.... do you whale, by all means, DO YOU!\n\nIn my first post, I broke down the numbers of the exercising costs first. Some smooth-brains were dumbfounded by this and had a meltdown, so this time I will start with the Premium (i.e., cost paid upfront).\n\nAs you know (you god damn better after I taught you the first time), each call option is the right to purchase 100x of the underlying stock. In the calculations below, I am assuming you can comprehend the following equation:\n\n    Options x Premium = Cost Basis (x100)\n\nFor the new scholars here, before you say some dumb shit in the comments, \\*\\*Do not confuse purchase price (i.e., premium) with the exercise cost of the option. \\*\\* We'll get there soon enough. Thanks in advance, dumbass.\n\nNote: All of the options have an expiration date of April 16, 2021 except for those marked with an \\*\n\n**March 1, 2021 Premiums Paid**\n\n* 540 @ 98.45 = 5,316,300\n* 540 @ 96.05 = 5,186,700\n* 1200 @ 105.85 = 12,702,000\n* 600 @ 101.25 = 6,075,000\n* 600 @ 99.60 = 5,976,000\n* \\*515 @ 106.55 = 5,487,325 (Jan 2023 expiry)\n* \\*500 @ 110.90 = 5,545,000 (Jan 2022 expiry)\n\n**March 2, 2021 Premiums Paid**\n\n* 1200 @ 108.15 = 12,978,000\n* 600 @ 104.95 = 6,297,000\n\n**March 3, 2021 Premiums Paid**\n\n* 1,300 @ 108.40 = 14,092,000\n* 600 @ 105.15 = 6,309,000\n* 600 @ 103.15 = 6,189,000\n* 580 @ 107.15 = 6,214,700\n* 580 @ 107.15 = 6,214,700\n* 550 @ 109.00 = 5,995,000\n\n**March 4, 2021 Premiums Paid**\n\n* 1,300 @ 126.60 = $16,458,000\n* 600 @ 123.20 = $7,392,000\n* 600 @ 121.15 = $7,269,000\n\n**March 5, 2021 Premiums Paid**\n\n* 1,150 @ 129.40 = $14,881,000\n* 550 @ 125.10 = $6,880,500\n* 400 @ 122.55 = $4,902,000\n* \\*400 @ 120.75 = $4,830,000 (Mar 19, 2021 expiry)\n\nWhat do all of these add up to?\n\n&#x200B;\n\nI’ll save you idiots the trouble. **This whale has paid a combined $167,195,225** **in PREMIUMS for these DEEP ITM CALLS.**\n\n&#x200B;\n\nNext, let’s find the updated dollar value regarding the exercise cost for all of these ITM options collected by Mr. PimpStick.\n\nNew equation:\n\n    Options x Strike = Exercise cost (x100)\n\n**March 1, 2021 Purchases' Exercise Fee**\n\n* 540 x 12 = $648,000\n* 540 x 12 = $648,000\n* 1200 x 12 = $1,440,000\n* 600 x 12 = $720,000\n* 600 x 17 = $1,020,000\n* \\*515 x 7 = $360,500 (Jan 2023 expiry)\n* \\*500 x 5 = $250,000 (Jan 2022 expiry)\n\n**March 2, 2021 Purchases' Exercise Fee**\n\n* 1200 x 12 = $1,440,000\n* 600 x 15 = $900,000\n\n**March 3, 2021 Purchases' Exercise Fee**\n\n* 1,300 x 12 = $1,560,000\n* 600 x 15 = $900,000\n* 600 x 17 = $1,020,000\n* 580 x 12 = $696,000\n* 580 x 12 = $696,000\n* 550 x 12 = $696,000\n\n**March 4, 2021 Purchases' Exercise Fee**\n\n* 1,300 x 12 = $1,560,000\n* 600 x 15 = $900,000\n* 600 x 17 = $1,020,000\n\n**March 5, 2021 Purchases' Exercise Fee**\n\n* 1,150 x 12 = $1,380,000\n* 550 x 15 = $825,000\n* 400 x 18 = $720,000\n* \\*400 x 20 = $800,000 (Mar 19, 2021 expiry)\n\nI won’t even ask, so don’t try, I know you can’t add or subtract, or divide, or even afford a calculator. **The total exercise costs for all these options owned by Mr. PimpStick is $19,503,500.**\n\nIn other words, this *leviathan* has the RIGHT, but not obligation, to exercise these call options for an additional $19,503,500.\n\nQuick little aside:\n\n>When a *Leviathan* is hungry, he sends forth from his mouth a heat so great as to make all the waters of the deep boil, and if he would put his head into Paradise no living creature could endure the odor of him.\n\nDoesn't sound too good for the shorts, does it?\n\n# \n\n# This is where things get interesting.\n\n&#x200B;\n\nNow, as OP also pointed out, **the buyer has the right to purchase** **1,442,500  shares by April 16** (note: a few options above identified with an \\* expire on Jan 20, 2023, Jan 21, 2022, or March 19, 2020, respectively). It's only three of the blocks though, so its notvery significant for our purposes. Nevertheless, they are all ITM, so the buyer can exercise them whenever they feel enlightened.\n\nLet’s do some more math; apes love math. This behemoth has already shelled out \\~$167MM for these options and has the RIGHT, not obligation, to shell out an additional $19,503,500 for the actual shares.\n\n167,195,225 + 19,503,500 = **$186,698,725 (purchase price + exercise price)**\n\nWe also know the total # of shares to be \\[potentially\\] exercised is ~~942,500.~~ 1,442,500.\n\nUsing this information, we’ve (me, mostly) done enough work to extrapolate a rough break-even price for this colossus of clout buyer.\n\n$186,698,725 / 1,442,500 = 129.42\n\n**This big whale’s total breakeven price has increased to $129.42/share.**\n\n&#x200B;\n\n# \"SO WTF DOES THIS EVEN MEAN?\" (fluff; skip 4 paragraphs)\n\nI know you just mumbled to yourself \"this doesn't really mean anything, does it?\" Just consider yourself a smooth brain. That's why I'm here.\n\nNow, I will admit, when I wrote my first hypothesis on this, I thought I wasted all of our time. But, my dart may have hit the bullseye.\n\nIf you followed the proper directions from my first post, now that you’ve smoked some weed or finished gulping down that Moscow mule, along with having been verbally abused by me a few times, I think you’ll like what I’m telling you.\n\nIf you are new here or are still too incompetent to understand my first post, again confirming how smooth your brain is, I will *once again* explain this shit to you like its your favorite bedtime story.\n\n&#x200B;\n\n**Analysis**\n\nA *massive fucking buyer* has exposed themselves to an exorbitant amount of risk over the last five days; they could LOSE *tens of millions* within minutes, yet they continue adding to their position, therefore increasing their breakeven, thus, maximizing their risk exposure.\n\nThat being said, I can guaran-fuckin-tee that nobody on this planet would over-leverage themselves in the amount of **\\~$186,698,725** without having (A) some extremely important information regarding the state of GME; (B) some serious fucking diamond kahonas; or (C) a dying declaration to save retail investors. My wager would be on A and B, but C is a dark horse candidate at this point.\n\n**In any case, anyone who drops \\~$167M over the course of five days has some deeeeeepfuckiinngggpockets. They have more money, that’s a fucking fact.**\n\nCompound that with this buyer’s breakeven at **$129.42**. According to this data **we (I at least) can make a logical inference that this our new BASELINE PRICE for GME.**\n\nLet me explain further.\n\nRelying on my aforementioned ability to deduce logic and reason, I am resolute in my opinion that this big bag dickslanger will be valiantly defending his/her breakeven price at **$129.42.**\n\nDo not get this confused with them giving a fuck about us or anyone else. They might, but its in their own best interest to hold that line, whether it benefits us or not is probably the least of their concern. Furthermore, think about it yourself, if you dropped (or YOLO'ed) a combined $167M over the course of five consecutive days, you must have a contingency plan or some unprecedented conviction in GME. It is my belief that this multi-hundred millionaire (more likely billionaire, or wealthy entity, at this point), has much deeper pockets than what they have leveraged on the options. It goes without saying they’ll be actively bootstrapping their own bet using millions more to ensure the success of their $167M+ options play. You may say, wouldn't that only raise their cost basis? The answer is, yeah duh.... BUT there's some paper handed clowns out there whom you just can't trust. Therefore, **Big Whale Dale has an INTEGRAL VESTED INTEREST in maintaining the POSITIVE public sentiment** by sustaining his own breakeven price. As a result, he can effectively secure his bet by making sure retailers don't get scared by huge dips, despite the fact it will increase his overall cost basis.\n\nIt stands to reason, if you had hundreds of millions of dollars at your disposal, Wouldn’t you do the same? I sure as fuck would.\n\nAs I mentioned the first time, I would be remissed if I didn't acknowledge there's a slight possibility this person is just a dumbass Ape like us hitting a ballsdeep YOLO play with his entire Trustfund inheritance. But I doubt it, and this has become increasingly less likely with each day that goes by.\n\n&#x200B;\n\n# THE THEORY HAS STOOD UP.\n\n**March 3rd**\n\nConsider all of this information with what happened on March 3rd. **GME CLOSED at $124.18 JUST 17 CENTS ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.**\n\nWhat ensued in AH? A back-and-forth teetertotter throughout the entire AH session. Ultimately, every time GME dropped below $124 it hit a springboard back above the closing price and finally finished at $125.00 flat.\n\n**March 4th**\n\nOn March 4th, the entire market got plastered and GME dipped all the way down to \\~$115 in early in the day. A short time later, it made a triumphant return up past our projected baseline in the afternoon session. Using the data I mapped out above, our whale’s break even price after his March 4th purchases was at $127.02 (151,480,225 cost + exercise / 1,192,500 exercisable shares). **GME CLOSED at $132.35, $4.33 ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.**\n\n**March 5th**\n\nToday, March 5th, the market continued to get slaughtered across the board. Not GME though. Ironically, GME has become the calm eye of a massive market storm. With the help of some cryptic tweets from DFV and Ryan Cohen, we experience a short-lived NOS injection into the GME rocket. We got a nice boost but resumed our normal flight pattern by days end.\n\nOur whale once again dropped hits nuts on the Philadelphia exchange and picked up some more calls bringing his new breakeven price to $129.42. **GME CLOSED at $137.74, $8.34 ABOVE THIS BUYER’s BREAKEVEN ON THAT DATE.**\n\nIn effect, this theory has stood on its own two feet since its inception. In the end, it could still be a coincidence, but there is no denying the correlation between our megatron whale’s breakeven and GME’s relative ability to stay above that price.\n\n&#x200B;\n\n# SHUT UP  🐻 🌈  ! (Counter-Argument)\n\nAlright, now we all know it’s coming….. just what you’ve been scrolling to the comments for...**Queue up the 🐻 🌈 COMMENTS.**\n\n>**“Omg, but what if it’s the hedgies buying these DEEP ITM calls to scoop up shares on the low-low \\[to dump and stifle the price or return borrowed shares\\]?”**\n\nI’ll confess, there is a possibility it is Greasy Gabe aka Mel Fibson, who didn’t close his position, trying to slither his way into the GME cookie jar for some sweeeet goodies of his own. Of course this slimey bastard has a sweet tooth for GME now, who doesn’t. We all want as much as we can get our monkey paws on.\n\nBut **let me explain why** ***I THINK*** **this IS NOT DJ Melly Mel or any of his counterparts who have drawn the short end of the stick on this one.** (pun intended).\n\n&#x200B;\n\n**Analysis**\n\nIN MY OPINION, one of the predominant issue with shorts engaging in this type of activity is the immense amount of volatility making these ITM options so expensive. For example, our big player here forked out >167M for just the opportunity to buy 1,442,500 shares.\n\nIf my rough estimate is correct (my brain isn’t all wrinkles, sorry), they would lose somewhere around \\~$1.5M every time the price drops a dollar below their break even..... I don't think this makes any sense for a short who wants to acquire, and subsequently dump shares to suppress the price and save their short positions from being obliterated. Generally speaking, as they offload shares it would be a staggered decline in terms of loss for each sell, depending on how the market reacts, however, that’s a ginormous gamble to take if you’re in their position…. But who knows, apparently, they actually enjoy sweating their tits off at the dinner table while their wife’s boyfriend cooks sloppy joes (since they can’t afford top-shelf caviar anymore at this point).\n\nI admit, in the grand scheme of things, this sounds like a good idea for the shorts. For example, if they took a loss of $50M on these call options but were able to influence the market enough to start a big sell off and save money on their current short positions, then it could possibly be a net gain. But to me, that seems unlikely, and extremely tough to predict given the way retailers and Apes have continued to hold strong, and continue to buy more on the dips. (great job, btw). Furthermore, we haven't really seen the price drop much. So wouldn't they have done this already? Who knows, they could be strategically waiting for a more opportune time, but there's no identifiable indication of this, so I am personally making the assumption it is not the case. Plus, it's only 1,442,500 shares, is that even enough for them to make much of a dent when you probably owe 10, 20, 30+ million? This could be argued, but I'll keep it moving.\n\n**This next section is comprised of a bit more speculative analysis, but is still rationally and logically supported. Most importantly, there are many underlying facts unbeknownst here, so take my opinion with a grain of salt.** Because it is just that, my opinion.\n\nAlternatively, Greasy Gabriel and Co. could be interested in these options as a means of picking up shares with the intent of passing the bag of steaming hot potatoes to the MM’s. Theoretically possible, I’m not oblivious, but I’m still not convinced this is the case. From my perspective, I believe this is due to the inevitable string of events that are destined to come at the conclusion of this entire saga.\n\nAs others have pointed out, like u/dan_bren, there are some inherent legal repercussions to this perverse style of options trading activity. These hedges are underwater, and they know it. So do we, so does Congress, so does the SEC. THERE WILL BE A COMPREHENSIVE REVIEW OF EVERYTHING THAT HAS TRANSPIRED SURROUNDING GME\\*\\*.\\*\\* **My view is that if anyone who is short on GME abuses these ITM calls to manipulate the integrity of the options market, there will be hell to pay.**\n\nIf executed in this manner, the shorts will effectively be passing the “I’M FUCKED BATON” to the market makers. In essence, the MM’s will have to locate and buy those shares on the market where trying to find authentic GME shares is currently like trying to match with a 9/10 on Tinder; it’s just not happening. Thus, exercising the options will likely result in exacerbating the phantom share dilemma due to the scarce availability of shares right now.\n\nIf you forgot already, I study law. And I can tell you with confidence, this level of negligent behavior, if not CRIMINAL, will not slide under the radar when everything is said and done. **If the shorts, in** ***bad faith***\\*\\*, transfer the “I’M FUCKED BATON” to the MM’s, they will have to answer for this conduct in the court of law.\\*\\* If you’re the MM you won’t just get rick rolled by these short hedges and go on with your day while holding a heavy portion of the bag caused by Greedy Gabe and his gang of crooks. Don't get me wrong, the MM's likely have their own fault in this by writing naked calls, so I don't necessarily feel bad for them. Regardless of the semantics, it will be a massive fucking lawsuit (probably will be already anyways), where every single order book and account history statement by all of these entities will be scrutinized like Brett Kavanaugh’s high school yearbook; NOTHING IS SAFE.\n\nKenny G and Melvin McMuffin can spend as much as they want on legal counsel, but facts are facts. This type of unlawful behavior merits not just fines, but severe criminal repercussions.\n\nUnder the **Exchange Act, 15 U.S.C. § 78i(a)** clearly states that\n\n>\"it shall be unlawful for any person, directly or indirectly, by the use of the mails or any means or instrumentality of interstate commerce, or of any facility of any national securities exchange, or for any member of a national securities exchange -- (2) to effect, alone or with 1 or more other persons, a series of transactions in any security registered on a national securities exchange, any security not so registered, or in connection with any security-based swap or security-based swap agreement with respect to such security creating actual or apparent active trading in such security, or raising or depressing the price of such security, for the purpose of inducing the purchase or sale of such security by others.\"\n\nAdditionally, section 78i(f) makes it clear that **\"any person who willfully participates in any act or transaction in violation of subsections (a), (b), or (c) of this section, shall be liable to any person who shall purchase or sell any security at a price which was affected by such act or transaction.\"**\n\nI know you have no clue what any of that means, so I'll explain like your 5, it means SEC trading penalties can impose both fines and jail time for unlawful trading activities which most likely include this type of conduct.\n\nGenerally speaking, however, if a securities trader can somehow show they “didn’t know” \\*cough cough\\*—*lie out their fucking ass*—\\*cough cough\\* that they were breaking the law, then they can usually avoid jail time and be charged with a measly fine. If you recall, Steve “my Mets suck ass” Cohen (ironically involved here as part of the monetary support for the Melvin Capital AA-rehab program) pleaded guilty to insider trading for shady financial dealings in 2013 and received a $1.8B fine, and narrowly avoided jail time. Then again, watching Mets baseball is arguably worse than going to jail. But I digress.\n\nBack to my point, THE CONDUCT AT ISSUE IN THIS CASE WOULD BE MUCH MUCH MORE SEVERE than Slippery Steve’s insider trading scandal. **There is no way in hell for the short HF’s to prove they “DIDN’T KNOW” that they were breaking the law by passing the “I’M FUCKED BATON” to the MM’s.** To that extent, if they have to buy back 40, 30, 20, or even as low as 10 million shares, is it even worth it to risk this kind of legal exposure/repercussions for ONLY \\~1.5M shares from these call options? FUCK NO!!! At least, in my opinion. (THIS IS NOT LEGAL OR FINANCIAL ADVICE, PLEASE DON’T QUOTE ME IF YOU’RE READING THIS GREASY GABE!)\n\nThanks for showing up **🐻 🌈's.**\n\n&#x200B;\n\nThat being said, I think the only person/entity who would make this type of play, and assume such risk (financial, and not legal, for all intensive purposes) is someone who is genuinely interested in going long on GME. In addition, **I'd wager it is most likely someone who knows GME is bound to rise well above their** ***new*** **$129.42 breakeven.** But let me reiterate, this is ALL MY OPINION, there's just way to many unknown variables for anyone, including my semi-wrinkled brain self, to have a clear picture of what's going on beneath all of these layers.\n\n&#x200B;\n\nEDIT: TL;DR moved to the top for the illiterate crybabies.\n\nEDIT 2: Less spaces\n\nEdit 3: Making it an easier read for smooth brains. Should have known better.",
    "title": "I believe GME's new baseline price is $129.42 -- Here is my (updated) theory and (deeper) analysis to back it up.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/lysax2/i_believe_gmes_new_baseline_price_is_12942_here/"
}