{
    "author": "idontdislikeoranges",
    "created_utc": 1614977956.0,
    "distinguished": null,
    "edited": 1614979646.0,
    "id": "lylqs4",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lylqs4",
    "num_comments": 105,
    "permalink": "/r/GME/comments/lylqs4/short_interest_minimum_8528/",
    "score": 711,
    "selftext": "Ok guys, short interest (SI) has always been such a moving target. The FINRA data is published twice a month and it's already 2 weeks old by the time that comes out. We get ''Predictive analytic's'' from companies who's customers are the HFs and Wall Street, not retail. We see press releases saying they have covered and yet we suffered 80% loss as they supposedly bought millions and millions of shares and yet the price went down.  We don't know the formulas they use so we can't verify there numbers.\n\nI thought I would take it into my own hands to help me develop better DD and to see if I can't shed some light on the subject.\n\n\\-----------\n\nI started off with 1 assumption. That GME had 0% SI. No one was shorting it, not by one share. I had to make this assumption as we have no idea what the actually SI is. **So it might as well be 0 right?**\n\nWith this I have used the daily shorted volume data from 12th Feb-March 4th. As I understand it this data is not a complete picture of all market activity, but it's large enough to form a good statistically probability.\n\n\\-----------\n\n**Starting from 0** I summed the Shorted Volume (181m) and subtracted that total from the Total Volume(316m). This gives us 134m shares that were exchanged over this period that was not shorted. My next assumption is that the **HF 100% covered** this shares over the same period. Again we have no way of knowing if they have or not so we might as well **assume the 100% covered.** This gives us **46M shorts that they could not cover** within this period, assuming 100% coverage. This results in a **85.28% SI** over the last couple of weeks alone.\n\n&#x200B;\n\nNow if they covered 50% of these new positions we would have **166.47% SI** and if 20% then **266.36% SI.**\n\nBelow are my workings :\n\n[SI up to 266&#37;](https://preview.redd.it/esfkjkr1w9l61.png?width=736&format=png&auto=webp&s=abfb88bcc0849e589e11f4f7472ff98a0e9f87bc)\n\nAnd link to my sheet so you can play with the numbers [https://docs.google.com/spreadsheets/d/1GIKNzBoVexkcZEd-3LmdT8bI3S5NXdhJeJX3Pw-yBfk/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1GIKNzBoVexkcZEd-3LmdT8bI3S5NXdhJeJX3Pw-yBfk/edit?usp=sharing)\n\n&#x200B;\n\n\\-----------\n\n&#x200B;\n\nSo I have made a couple of assumptions with this and as such we still don't know for certain what there position is. There SI could indeed be higher if we know what there SI was for certain, but we can not know. All we can know is what the absoulte min SI is and in this case it is 85%. I might try on a larger data set and publish the results on this submission.\n\n&#x200B;\n\nApes with more wrinkles than me please critique and feedback on this to help me and others.\n\n&#x200B;\n\nThis is not advice. To the moon!\\\\\n\n&#x200B;\n\nEdit: Few questions about the source of the data. [https://www.shortvolumes.com/](https://www.shortvolumes.com/)",
    "title": "Short interest minimum 85.28%",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/lylqs4/short_interest_minimum_8528/"
}