{
    "author": "sydneyfriendlycub",
    "created_utc": 1620156259.0,
    "distinguished": null,
    "edited": 1620175253.0,
    "id": "n4vrxu",
    "text_only": true,
    "flair_text": "📟 News 📰",
    "name": "t3_n4vrxu",
    "num_comments": 590,
    "permalink": "/r/GME/comments/n4vrxu/melon_news_banks_filling_sec_424b2_in_mass_wtf_is/",
    "score": 2713,
    "selftext": "\nCheck what a form 424B2 is here…\n\nhttps://www.investopedia.com/terms/s/sec-form-424b2.asp\n\nI need wrinkle brains to be in this please, this suppose to be prior filling and IPO?? Is this a common practice?\n\nBut also, he’s common standard practice, but does anyone have a look what is inside those? I would love to see if some or many of them maybe have a portion or a lot of maybe Naked shares inside??? Maybe some juicy GMEs?\n\nPeople in the comments say that is an standard practice because it’s been happening for a while constantly…. Seem like long time fuckery to me. But I’m just a pessimist :P\n\nMight be just nothing, you decide \n\nhttps://sec.report/Form/424B2\n\n**A smart ape said this in the comments**\n\n“Good call... there were all those 0% interest bonds being issued today that expire/mature in 4 weeks time on 1st June. Someone speculated that they’re good to have in the event of a market crash.\n\nBut I’m a smooth brain so don’t get it!”\n\nThis could be related https://www.reddit.com/r/Superstonk/comments/n19kgr/zerocoupon_bonds/\n\nIf they are going for the 0% bonds seems to me they are taking advantage of Libor for as much as they can until SOFR comes and bite them in the bum. \n\nApparently this bonds can default and be worthless if the bank bankrupt.\nhttps://www.fidelity.com/learning-center/investment-products/fixed-income-bonds/when-bonds-go-bad\n\n\nSo far I’ve counted 420 fillings and all by major banks.\n\nhttps://imgur.com/gallery/MxgdgRW\n\nLet’s poke this and I’ll keep updates!\n\nLove you all!!\n\n🍉\n\nEdit: another 20 dumped \n\nEdit 2: they might be buying bonds with 0% interest to prepare for a market crash, confirmation?\n\nEdit 3: https://www.fidelity.com/learning-center/investment-products/fixed-income-bonds/when-bonds-go-bad\n\nNo financial advice, a melon lying on the sun!\n\nEdit: **new FUD strat is to try and deflect the real problem with some antisemic and “social issues” FUD**. \n\n**But don’t let that FUD get you out of focus, apes are here because apes like the stock, apes don’t like to be manipulated and scammed!!!**",
    "title": "Melon news!!! Banks filling SEC 424B2 in mass!!! Wtf is going on??",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/GME/comments/n4vrxu/melon_news_banks_filling_sec_424b2_in_mass_wtf_is/"
}