{
    "author": "sydneyfriendlycub",
    "created_utc": 1620117622.0,
    "distinguished": null,
    "edited": 1620127844.0,
    "id": "n4jg96",
    "text_only": true,
    "flair_text": "📟 News 📰",
    "name": "t3_n4jg96",
    "num_comments": 257,
    "permalink": "/r/GME/comments/n4jg96/melon_news_apollo_bought_a_gigantic_portion_of/",
    "score": 1454,
    "selftext": "**Hi guys**, it’s your boy Melon here with **important stuff!!!**\n\n**Apollo capital just bought a massive portion of media by acquiring Verizon Media Assets for $5 billion.**\n\nIt will rename the business **”Yahoo”.**\n\nhttps://techcrunch.com/2021/05/03/private-equity-firm-apollo-agrees-to-buy-verizon-media-assets-for-5-billion/\n\nhttps://www.ft.com/content/ef0992ec-1d4f-4030-95a9-d950e47338e1\n\nNoooooo!!!!\n\n**But Melon, what does that mean??**\n\nThis is huge, this means that they are preparing for another **media attack** but this time not only using the financial targeted media but **THE GLOBAL MEDIA!!**\n\n**They will be manipulations me controlling using “social issues in a last bid to get GameStop “canceled” and “suppressed”!!!**\n\nThat’s right! They are going to **control the narrative** as they have been to **make Reddit look like the villains to the people that is unaware** of what’s going on right now!! **They are pressuring us to sell!**\n\nEMBRACE FOR IMPACT!!\n\n**Prepare for serious FUD from everyone outside the financial world!!**\n\nA fellow ape told me that in the Melvin capital subreddit they are treating us and spreading FUD about us being “Nazis” because of certain tread of antisemic comments perfectly positioned and baited by THEM!!\n\n**I will dig deeper into it later on and update!!**\n\nNo, Reddit is not sexist, or antosemist, or racist NOOOO!!\n\nWe are a massive diversity of people of all colors, sexes, religions and cultures that like a certain stock and say NO MORE MARKET MANIPULATION AND SCAM AGAINST PEOPLE!!!!\n\n**This is just another one of their attacks against RETAIL IN AN EFFORT TO MAKE US SELL!**\n\nWE ARE NOT SELLING!!!\n\nWE KNOW WHAT KENNY AND FRIENDS ARE HIDING AND ITS MATTER OF TIMES COMES TO LIGHT!\n\nI will be updating as some more info comes to light, this is melon being one step in front of them!!\n\nEdit: please check the comments and the work of this ape u/warthogexternal regarding to this matter!\n\n**I love you all!!**\n\nApe help Ape\n\nTill next time,\n\n🍉",
    "title": "Melon news!!! Apollo bought a gigantic portion of media. This is how they plan to control the narrative!",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/n4jg96/melon_news_apollo_bought_a_gigantic_portion_of/"
}