{
    "author": "Ryantacular",
    "created_utc": 1622779443.0,
    "distinguished": null,
    "edited": 1622862405.0,
    "id": "nrw4fx",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nrw4fx",
    "num_comments": 146,
    "permalink": "/r/Superstonk/comments/nrw4fx/i_want_all_of_us_to_make_money_a_story_of_how_our/",
    "score": 705,
    "selftext": "Incoming Karma downvote - but I’m taking one for the team. For fucking history. For our fucking financial freedom and for the sake of our own intellectual integrity. \n\n\nOur kindness has become our biggest weakness and it is actively being used to strategically manipulate us apes. We knew amc was a big counter play by them back in Jan/feb. The Hail Mary hedge against their inevitable demise. \n\nIt was okay to talk about the truth then. \n\nBut it’s not now. \n\nOver time it slowly got pushed to stop speaking down about it - to be indifferent towards it. Now we even see posts accepting it saying things like “I’m in both but we all know GME is the main one”. \n\n\nThe combination of our natural tendency to look out for each other, and a 6 month long psychological onslaught of coaxing has led to them successfully getting us to become silent on the matter and let the truth slip slowly through the cracks. \n\nNobody wants to be an asshole, but that’s what they’ve done. They’ve made it where we can’t get the truth out without looking like assholes and this allows them to silence us and proceed without resistance. \n\nI’ve been victim of this myself. In my group chats, I’m just ignoring the people that slowly started talking about AMC while also wishing them luck because why would I ever root against them? \n\nOver the past few months, we have slowly shifted away from being allowed to expose the truth about AMC. \n\nIt’s become a taboo subject and you are attacked if you bring it up in any way that’s not slightly supportive toward the stock or the apes invested in it. \n\nThis stance of neutrality and silence on the matter has led to the decay in awareness and exposure of the truth about AMC; this has allowed them to use their mainstream media propaganda to push AMC and successfully siphon volume and buying pressure from GME without any pushback from the one source where people can actually get this truth. Here. From us. \n\nWE ARE THE ONLY SOURCE FOR THE TRUTH BUT WE HAVE BEEN GROOMED INTO AVOIDING THE TOPIC ALL TOGETHER.  \n\nThis means the biggest weapon they have- mainstream manipulation - is being allowed to be successfully used while we just sit back and quietly watch.  \n\nThis truth is with us and has slowly been suppressed through the sub shifting and being emotional led into thinking that being quiet on the matter is for the best. \n\nThe narrative is trying to be made that staying quiet about it is simply for the better - that it limits unnecessary internal conflict. After-all, we have enough shilling to deal with, right?\n\nHowever, this notion is bullshit. By staying quiet all we are actually doing is helping the bad actors in the market by giving them uncontested reach to the general unaware population. \n\n\nI’ll be the one to say it. I’ll take the down votes. \n\nIf you still own AMC, you are directly helping the parties who are on the wrong side GME. We have not won yet. \n\n\nThey’re literally rolling their hail Mary plan out with very minimal friction from the community.\n\nThey even built Twitter accounts to gain trust and now are pumping both amc and GME and we ignore it snd let them and unsuspecting parties on Twitter who don’t use Reddit think it’s okay to buy both because we are just standing back and doing nothing to spread real awareness and are sitting back watching their biggest strategic counter attack happen while we do nothing to combat it. \n\nDFV came out of retirement to do his part to counter this AMC counter attack and now we need to do ours. \n\nAlso, I don’t care if you think house of cards proves it’s okay to invest in stocks directly helping bad players in GME. Nothing is even close to GME. \n\nLike Michael burry said. There is NO other GME and will never be another GME. \n\n\nNobody is selling GME to buy AMC. I’m not saying that and neither is anybody else. Claiming thats my prerogative reveals you are aren’t hearing what I’m saying or are trying to keep discussion of this matter quiet. \n\nRaising awareness is not irrelevant  and it’s not something “everybody knows” because we don’t all know. \n\nIf we did all know then why are we still allowing their counter attack to partake completely unfiltered? \n\nWhy are we aiding them in their manipulation campaign by remaining silent and chanting “ape don’t fight apes” like puppets? \n\nThe thing is - Apes don’t fight apes. That’s extremely true. And by exposing the truth I am not fighting anybody. As adults we can communicate our concerns to each other without it being considered a fight. \n\nLet’s discuss this in a healthy way. \n\n\n\nEven the hedge funds realize at this point that nothing can get us to sell. So what other options do they have to try to buy time? They can slow down the GME buying pressure by siphoning volume by distracting new and less informed investors while we sit back and watch and do nothing because that’s what we’ve been groomed to do over the last 6 months\n\n\n\n—edit*\n\nSome  food for thought \n\nAdam Aaron is really loud and Ryan Cohen is really quiet. \n\n\nAdam Aaron is conveniently able to price real time numbers of short interest in the stock, and of individual investor % while Ryan Cohen is not. \n\n\nA lot of what Adam Aaron is doing is extremely convenient actually. \n\nOne is loud and and doing everything they can to try to get the into spotlight so they can talk a big game and appear legit - trying to be extra friendly and capitalize on a situation. Making multiple appearances on amateur YouTube streams - (Also selling millions of new shares into the market 34 days after promising to investors not to sell any new ones at all in 2021 if they approved the shares) \n\n\nThe other is extremely quiet and not trying to convince anybody of anything. Not trying to sway or entice new investors over - not making false promises. Just letting their actions speak. \n\n \n\nAsk yourself why such stark contrasts between the two parties?",
    "title": "I want ALL of us to make money! - A story of how our kindness has strategically been used against us to silence us from speaking out against AMC and allowing hedge funds to roll out their biggest counter play to date completely unabated. We have not won yet! Buy. Hold. Vote.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/nrw4fx/i_want_all_of_us_to_make_money_a_story_of_how_our/"
}