{
    "author": "KxKen",
    "created_utc": 1622775097.0,
    "distinguished": null,
    "edited": 1622809895.0,
    "id": "nruuwf",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nruuwf",
    "num_comments": 323,
    "permalink": "/r/Superstonk/comments/nruuwf/notice_how_amc_ape_figureheads_are_being/",
    "score": 2348,
    "selftext": "Matt K went on Fox Business yesterday. \nhttps://twitter.com/tradestrey/status/1399803305757454338?s=21\n\nMatt K today with Benzinga. \nhttps://twitter.com/benzinga/status/1400547511044034562?s=21\n\nTrey Trades went on Fox Business today. \nhttps://twitter.com/matt_kohrs/status/1400513773216190464?s=21\n\nTrey Trades to be on CNBC tomorrow morning. \nhttps://twitter.com/tradestrey/status/1400613993006481412?s=21\n\nMatt K and Kevin O’Leary exchange on Twitter: \n(O’Leary seemingly supports apes but if you read between the lines, he’s setting us up as the ones causing the squeezes and not the shorts.)\nhttps://twitter.com/matt_kohrs/status/1400492048210448393?s=21\n\nThe message these guys are spreading is also that we’re organized and forcing a squeeze. This sets us up as the bad guys in this saga even though it is the fault of the shorts if there’s a market collapse or crater. \n\nAlso both Trey and Matt didn’t make any mention of naked short selling when they had the chance on national television. \n\nAMC ticker is spammed on MSM and GME isn’t even ever displayed or mentioned. \n\nIn my opinion this shit is too coincidental and seems pretty sus. \n\nNot trying to spread any FUD here. I just found this very suspicious and wanted to bring it up here for discussion or visibility for those not following on Twitter.\n\nEdit: Yes, I know we shouldn’t be discussing theatre stock here but I’m using it as a reference to validate further how much GME info is being suppressed and naked short selling was entirely ignored as a topic as well.\n\nEdit 2: Okay so I just want to address the point a few of you made about these two YT apes not mentioning naked short selling to avoid being threatened or for legal reasons. In one of my comments below I wrote there are ways of saying it without saying it directly. Frankly, these guys didn’t even ‘try’ to hint at anything suspicious or wrong with the the stocks movement that first made people get behind them. No real reasons beyond “we’re sending a message”. For what purpose? I believe they could have said “on the surface it looks like stock movement of failing brick and mortar companies. But apes have been researching the stock and it’s a little scary what you find below the surface when you start digging”. Or even something more cryptic than that. Just enough to actually draw some attention to “well something is wrong”. \n\nTo just simply say we’re sending a message to short sellers sounds like you’re proving the media’s narrative that apes are performing pump and dumps. I think Matt and Trey are great on their streams. I just think they not only missed a golden opportunity to put some thought into the message and deliver it but they also played right into the media narrative. Sure it’s David vs Goliath. But David is apparently doing a pump and dump…?",
    "title": "Notice how AMC Ape figureheads are being repeatedly invited by MSM to speak but no one from GME side of things is…",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/nruuwf/notice_how_amc_ape_figureheads_are_being/"
}