{
    "author": "cearka_larue",
    "created_utc": 1622745983.0,
    "distinguished": null,
    "edited": 1622790980.0,
    "id": "nrkqok",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nrkqok",
    "num_comments": 234,
    "permalink": "/r/Superstonk/comments/nrkqok/we_arent_dumb_money_were_the_natural_evolution/",
    "score": 4933,
    "selftext": "My wife asked me how we're going to explain all this to our parents when the dust has settled.  I've spent a long and hard time thinking about everything that's happened in the last six months.  For us apes, who have been watching this thing unfold, it's incredible and amazing; but from the outside it's easy to write off because it requires countless hours of DD and memes to get to where we are now.\n\n# RETAIL HAS ALWAYS BEEN PAINTED AS DUMB MONEY.\n\nBut, *we are not that*.  We're an aberration, something new.  We're a disruption in a current ecosystem.  Do you know why there are laws against transporting and planting certain seeds to different places?  Big money agriculture aside, it's primarily because *an external plant* can actually completely disrupt an ecosystem.  And that's what the internet does in every human system.\n\n* Amazon and online retailers changed the way we shop.\n* Uber/Lyft changed the way we view transportation\n* AirBnB changed the way we think of shelter when traveling\n* Instacart changed the idea of buying groceries.\n* Facebook/Twitter/Insta/Reddit/Wechat/Whatsapp/TikTok/etc changed how we communicate\n* Google changed how we find information and advertising\n* Wikipedia changed how we store and peer review public knowledge\n* Zillow/Redfin/Zip changed real estate.\n* Netflix/YouTube changed how we consume media\n* edit: Someone suggested I add Tinder/Match has changed how we date.\n\n**The list can go on and on and on,** ***right?***\n\nWhat's important to take from this is that these things all offer **services and experiences** *that are fundamentally different* than what they were before.  They have an entirely different set of strengths and weaknesses that hinges on the internet, and that's what makes it disruptive.  Additionally, it's important to keep in mind that every disruptive system eventually gets used in ways, for good and bad, that it was never originally intended for.\n\n**And this**, I argue, is what makes r/Superstonk a disruptive force in which the rest of the ecosystem will have to accommodate for now, going forward, in the same way other existing elements in other markets had to adapt to new disruptive forces or face extinction.  We are the element that financial elites *least wanted* to evolve, but I argue we are an inevitable market force meant to balance against their abuse of the system.\n\n[notice u\\/rick\\_of\\_spades on the main screen.](https://preview.redd.it/xvle5q3933371.jpg?width=677&format=pjpg&auto=webp&s=5255a0641c5c4962cb1b71522eb700db493c099a)\n\nAnd it's wonderful because its warm and full of little ironies.\n\n# IT'S ABSOLUTELY TRUE MOST OF US\n\nwill never be able to do the level of due diligence that our best DD writers are doing (like u/atobitt u/criand u/homedepothank69 and dozens of others) on our own.  And that's ok, remember every disruptive system is disruptive *because it's different, and the metaphorical cogs and gears we've naturally settled into all have their own purpose.*\n\n*Yes, it takes a certain amount of knowledge, tools, and work to write good DD.*\n\n# But it also takes a baseline level of knowledge to consume DD.\n\nI argue that the true smooth brains, myself included, have grown more wrinkles than we give ourselves credit for.\n\n**ANYONE can watch an oscar-bait movie and tell you what the plot is** but it takes a minimal level of knowledge to tell you what the story is **about.**  *Likewise,* ***anyone***  can read our DD and be like \"there is fuckery in our market,\" but it takes a base level of knowledge to understand how it's happening.\n\nGrowing up, our education system did very little to teach financial literacy in school.  Whether by design or not, my public school education in finance involved learning to write checks in 1st grade, and pretend buying and selling of stocks (and back then we used newspapers) that mysteriously goes up and down.  Multiple market crashes and the MSM narrative that billionaire hedge fund managers are smarter than us (which is a lie, the key word should be more criminal than us), turned me off from ever entering the market for a long time.  \"*The game is* *rigged against the little guy\"* is a sentiment that everyone *feels.* What's happened as transformed that *feeling* into *knowing.*\n\nI think there are many like me.  A year ago, I didn't know what NBBO, bid-ask spread, DTCC, option, margins, shorting, etc. even was.\n\n**If the me from a year ago read today's DD, I'd be clueless.  Even the memes wouldn't be funny, because 90% of the memes actually require some understanding of the DD to understand.**\n\n&#x200B;\n\nLet's take a little walk through what this disruptive force has **done** **so far, and how we're changing investing forever.**    (THIS IS THE TLDR).\n\n**~~Uncovered~~** **Deconstructed a naked shorting scam**\n\n* Dissected said scam mechanically, to understand how it's being carried out, and then distilled this information down to a base level that the average of group can interpret. We've had DD writers look at every aspect:\n   * Their motivation for the scam (making tax free money by manipulating companies into bankrupting)\n   * Their means of getting away with it, as the regulatory agencies have a direct conflict of interest.\n   * Rehypothecation of shares\n   * Naked Shorting\n   * Shorting indirectly by pulling apart ETFs\n   * FTD cycles, and how they extend these by hiding them in options.  (What a huge one this turned out to be!)\n   * How they criminally mark shorts as long and get away with a slap on the wrist\n   * How the SI reporting is a complete scam to begin with\n   * Orchestrating pump and dumps to extract more money\n   * Manipulating media in order to manipulate public sentiment, and directly timing price movements with a narrative that they create, not what is actually true.\n   * Paying \"bad actors\" to directly infiltrate retail communication in a psyop campaign\n   * When shit really hits the fan, they directly disable buying and execute flash crashes.\n   * probably some other shit I'm forgetting\n\n&#x200B;\n\n**Raised the average level of knowledge of everyone that frequents the subreddit.**\n\n* **bUt wHaT about FunDamenTals herp derp**.  I think apes have analyzed gamestop's fundamentals far more than most people analyze fundamentals, period.  And we've learned that fundamentals aren't the true driver of stock price in our heavily manipulated market, but we're backing a stock that has strong fundamentals anyway, so that MSM argument is shit.\n\n&#x200B;\n\n**Deep dived for** ***real information, not MSM fluff***\n\n* We have apes that have dissected every DTCC/ICC/OCC/NSCC document that's come out the last few months.  We've examined how the entire stock market actually functions on a mechanical level.\n   * there's even an ape that is out there filing FOIA requests with the SEC\n   * edit: more on this point, we have ballsy apes straight up writing and calling politicians, regulatory agencies, and brokerages for information\n* We have apes breakdown every legal filing GameStop puts out.\n* We have apes breakdown 13F and all sorts of filings from financial institutions\n* edit: We have apes literally writing mini biographies of the new C-Suite.  Apes literally straight up contacting them on linkedin and twitter, researching their track record in business.  <=== if this isn't some solid fucking due diligence on fundamentals, than what the fuck is.\n* edit: We have apes studying the villians in this narrative and how they're connected to different pieces of the puzzle.\n* We have mods bringing in and consulting veterans, u/dlauer, Wes, Lucy, Dr. T, Carl who have spent their lives fighting financial crime\n* We have apes doing technical daily and educating others how to read charts.  Most of us would never be able to tell you what OBV, RSI, macD, VWAP, etc etc etc was before this.\n   * EDIT: I've seen posts with AI anaylsis, fourier sound analysis, and even stenography.  Regardless of accuracy or relevance, apes are literally looking at things from every conceivable angle, and presenting said information to the forum to counter or support.\n* We have apes cross analysing the entire financial market for correlations.  VIX, S&P 500, Russell 2000, treasury bonds and ONRRP, other meme stocks, block chain coins.\n* We have apes examining the unusual in building late night activities of large institutions\n   * And going as far as driving hours to post pictures of buildings with lights on.  EDIT:  We also have apes that get off on these pictures of buildings with lights on, so there's that.  maybe we need to get a #TIWTUA (this is what they're up against) going.\n   * one really special ape went a flew a drone.\n   * We even had apes to and take pictures of the Glacier Capital Mailbox.\n* Most importantly, Apes then share their findings, analysis, and thesis's for everyone to peer review.  And **all is this is happening simultaneously** next to apes making memes and sticking bananas in the wrong orifice.\n\n&#x200B;\n\n**MEMES & MEME CULTURE & QUALITY SHITPOSTS**\n\n* It's easy to blow this off, but I argue the memes are important as hell.  MEMES one of our natural immune defenses against FUD\n   * Some memes serve as MORALE boosters.  They're funny and get us laughing, or their infuriating and get us motivated.\n   * Some memes are actually informative.   They distill an important information into something an instantly digestible bite, and point users to a DD they may have missed.\n   * Some memes are esoteric.  They get people talking and discussing what the true intentions are behind them (looking at you, genius of genius's u/deepfuckingvalue , and RC)\n   * Some memes are simply historic, like u/buttfarm69 's Chairman Cohen.  Fucking kudos to you that you're still doing quality shitposts instead of just letting that be your peak.  EDIT: you peaked again while I was writing this, you legend you.  [This is for you, mate.](https://www.reddit.com/r/Superstonk/comments/nrm4z1/this_ones_for_you_ubuttfarm69/)\n   * And some shit is truly unexplainable, but I think still very important (like banana's in ones ass).  The truly unexplainable stuff is what I believe is the best point I that made long ago that was highly upvoted:  **WE DON'T MANIPULATE THE MARKET, WE ARE THE FUCKING MARKET.**  We're millions of *individual investors, and no one is manipulating shit.*\n\n&#x200B;\n\n**The Immune System:  Defending against an ongoing psyop campaign by the shorts**\n\n* When the body is under attack, an immune response of white blood cells, Lymphocytes, histamines, and physical reaction work in tandem to repel the invader.  Like the immune system, this system has fucking *EVOLVED to repel shill invaders.*  I'm so fucking blown away by this. Forget repairing organs, we've literally grown new *bodies* by migrating forums multiple times.  Hedgefund's shoveling money to pay \"basher\", as Wes Christiansen called them, and we've developed an immune response against it.  Like a virus, they keep evolving, but so do we.\n   * We've developed a culture of questioning everything, which is healthy in moderation (this is like the histamine response.  Too much can cause an allergic reaction, so it careful to keep this at a nice medium).\n   * We've got our knights of new (white blood cells) upvoting and downvoting thousands of posts.\n   * We've got SATORI (Lymphocytes), an AI analyzing how shill individual posters are.\n   * Mod Banhammers, karma and age requirements (physical reactions).\n   * We've developed the ability to pick apart MSM articles and their sad excuse of DD (I just equate this to pooping.)\n\n&#x200B;\n\n**We've changed everything because we got involved.  This alone is a solid indicator of how important we are.**\n\n* If you look at the graph for people that watch House Committee Services livestreams, you'd think you'd be looking at the chart of the MOASS.  Seriously.  The long ass boring, mostly useless hearings generally garnered less than a few hundred viewers and we broke 1000 fold.\n* We're forcing brokerages to *cater to us*.  Brokerages have seen how retail has exited Robinhood *en masse*, and they're all acutely aware they could become the next Robinhood.  Even more so than damaging their businesses, these brokerage CEO's likely don't want to be the next boy in bulgaria meme.\n* Brokers are having to change there automated messages *just to deal with the volume* of apes calling them.  Services reps are literally dealing with apes calls all day everyday now.\n* To quote u/ohcrookedwarden in the comments below, a top US broker Fidelity, is in the process of \"*chang\\[ing\\] their entire app* to cater to the inflow of the next generation of brokers.\"\n* We're **exercising shareholder rights**.  This is where the meaning of \"voting with your wallets\" has been all along, right under our noses.\n   * Seriously, this was such an underutilized power, that many brokers didn't even have fucking systems set up to **VOTE** in the first place.\n\n&#x200B;\n\n[Updated for the 3rd time based on today's posts.  I've been keeping track of all the international brokers that rose up to retail demand \\(and the few shitty ones that didn't\\)](https://preview.redd.it/grevjvtxi3371.jpg?width=1020&format=pjpg&auto=webp&s=963e07fc37070954b21a05d60b1b2c0ba6f6d2d0)\n\nSeriously.  I'm so proud to be an infinitesimally small part of this.  Some Apes (like our DD writers), are the fucking superheroes in our scene.  The rest of us but one of a million boots on the ground, and that's OK.  Individually, we're nothing. But remember, APES STRONG TOGETHER.\n\n&#x200B;\n\nEDIT: BONUS:  We've possibly collected evidence that we're actually living in a simulation 😆😆😆\n\nEDIT2: fixed some typos and grammar I think.\n\nEDIT3: more shit grammar fixing.  expanding on a few points.",
    "title": "We aren't dumb money, we're the natural evolution when internet meets investing.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nrkqok/we_arent_dumb_money_were_the_natural_evolution/"
}