{
    "author": "parish712",
    "created_utc": 1619167151.0,
    "distinguished": null,
    "edited": false,
    "id": "mwqsz4",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_mwqsz4",
    "num_comments": 186,
    "permalink": "/r/GME/comments/mwqsz4/i_dont_trust_blessons_sorry_bud/",
    "score": 982,
    "selftext": "Hedge funds have had plenty of time to buildup miniboss shills.  We are starting to see the early signs of the squeeze with hedgies margin called, rampant market manipulation, and banks closing shops.  We just had a post reveal to us that we never really owned our shares (did you really think that a bought share gets a \"belongs to parish712\" on it?), and the subs are on edge due to the anticipation.  Lo and behold, blessons blows up on here about how he is an insider who knows everything down to how kenny pinches his loaves, but has never been with him one-on-one.  This is too damn convenient.\n\nDon't get me wrong, blessons might really be an insider, and he might really be feeding us \"for Kenny'seyes only\" type info.  But is he giving us something that expedites the squeeze?  No.  Is he giving us reasons to believe that the squeeze is a bust?  No.  All we have is a potential ally or foe, whose word is being treated like gospel and is swaying the masses.  This über qanon-style conspiracy stuff only deters others away from GME subs and the information available in them.  Sound familiar?  Its one of the strategies shared by u/thegooombler about how groups can be manipulated.  And why do I trust Mr. Gooombler?  Because all he told us is to question our sources more critically.  I trust u/rensole, I trust u/atobitt, I trust them all, but blessons seems too good to be true\n\nWe don't need him to feed us crumbs to get to the truth.  We aren't a movement to change the world.  We are individuals who are here for tendies.  All world changing for the better, happy go lucky stuff is coincidental.  I hodl because I just like the stock.  Whether the squeeze happens or not, GME is worth $500+.  I will make good cash no matter what, as long as I am patient.  Do with this what you will.  \n\nNone of this is financial or investment advice.  I am so dumb that I once forgot which day I had a final and missed it.",
    "title": "I don't trust Blessons, sorry bud.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/GME/comments/mwqsz4/i_dont_trust_blessons_sorry_bud/"
}