{
    "author": "paul-allen66",
    "created_utc": 1618736989.0,
    "distinguished": null,
    "edited": false,
    "id": "mt9eiw",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_mt9eiw",
    "num_comments": 222,
    "permalink": "/r/Superstonk/comments/mt9eiw/why_im_100_certain_dfv_will_hold_through_the/",
    "score": 4410,
    "selftext": "DFV's actions in this saga make it perfectly clear to me that he will hold all the way through the MOASS. I have zero doubt about that in my mind now.\n\nWe already know he's not in it for the squeeze, never has been. Check out his [GME bull thesis on youtube](https://youtu.be/GZTr1-Gp74U), where he lays it all out perfectly: he believes in GameStop's transformation. *He likes the stock*. He knows it'll be worth several thousand even after the squeeze, and he's just helping us Apes along the way.\n\nHe sees the deep fucking value.\n\nRemember what he did. He doubled down on 50k the day after appearing in Congress, he held the options *until the very last moment*, only to reveal he yolod another 50k on top just to double down again on the double down.\n\nThose additional 50k weren't $12, those were regular $150 shares. Go figure.\n\nHe's literally stock Jesus and **I'm 100% positive that he is going to hold his shares all the way through the squeeze.**\n\nHe's not like Ken, he doesn't need to be the #1 richest fucker in the world at the expense of everyone else. He's already crazy rich, he'll be so much richer with GME growing, and he's only getting started.\n\nHe's gonna help apes succeed. By doing what he does best, what he's always done. He's the most diamond handed ape there is, and has proven that over and over and over again, against all resistance.💎🙌\n\n-----\n\nDFV's final update is the most incredible move I have ever seen, and I am ready to yolo every cent I have left come monday. It made me realize there's a game even bigger than the MOASS, **and betting on that game will both maximize the squeeze, and still make everyone rich by holding.**\n\nIt comes down to this:\n\nHelping Apes succeed with MOASS will make GameStop the #1 Company in the world. DFV knows that, Ryan Cohen knows that. This means that GME is the most amazing long-term opportunity for *value investors* in the history of mankind, and MOASS will amplify that by another fuckton. Now, who is the greatest value investor of our generation? Bingo. DFV stands to hold 200k shares of **that** company. DEEP value, in a post-MOASS economy. This is the bigger picture.\n\n[Abundance is Coming](https://i.ibb.co/5jdtp5y/newapeorder.jpg)\n\n*That potential* is worth so much more to him than any specific dollar amount. It's why DFV will be the next Warren Buffett.\n\n> \"*that's good cause I'm a value investor, so I don't need to be precise*\" - DFV\n\nEven money is fleeting, GME is not. It's simply the best place to hedge against whatever is about to come.\n\nDFV is a *value* investor, never forget what that means.\n\n[Cheers!](https://i.ibb.co/fYRs345/whatifitoldyou.jpg)",
    "title": "Why I'm 100% certain DFV will HOLD through the entire squeeze, and how he inspires me to do the same. I realized selling just 1 or 2 shares after the peak is enough to be set for life. The rest is for diamond handing, and the Post-MOASS world will be glorious for any GME shareholder 💎🙌♥️🚀🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mt9eiw/why_im_100_certain_dfv_will_hold_through_the/"
}