{
    "author": "swede_child_of_mine",
    "created_utc": 1616195933.0,
    "distinguished": null,
    "edited": 1616219562.0,
    "id": "m8ty6o",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m8ty6o",
    "num_comments": 513,
    "permalink": "/r/GME/comments/m8ty6o/a_retrospect_why_friendlys_didnt_launch_the/",
    "score": 5397,
    "selftext": "Happy Friday fam!  You know what this post is?  *Not financial advice.*\n  \nIf you haven't already, I highly suggest reading u/beowulf77's post of u/WuzGoodieN1gz 's DD, [here](https://www.reddit.com/r/GME/comments/m844o8/not_all_sells_are_enemies/).  It's really good.  \n  \nNow, you might be left asking after closing at 200 today: wHy DIdN't tHeRe bE sQueeZEs FoR mUh TEnDieS tOdAY?  \n  \nTwo key points from the above link that you'll need to understand before I answer:\n\n1. **Covert options strategies** - \"Enemy\" options were in play in places you might not expect.  Price going high might have been the hedgies trying to pull an \"uncle Bruce\" and offload share purchases onto options sellers.  Also, friendly whales might have been going for \"focused\" max pain (against the hedgies) instead of general market max pain.  So, instead of a rocket, we ended up at $200.\n1. **Friendly whales BELIEVE** in us.  Like, ***really believe in us.***   Remember all of these \"guys I think we own the whole float!\" posts?  Uhh, you think that just, magically happened?  Like, nobody at any of the firms has done calculations into retail purchase volume flow, and just scratched their asses saying \"gee the pile of GME shares sure looks like it's getting low, wonder if it'll ever run out?\"  u/WuzGoodieN1gz awesomely points out that friendlies have been *intentionally feeding us.*  We are like a fucking BANK of pitbulls that do. not. let. go. of GME shares.  So friendly's have been putting the burden of share ownership on us while they hoard cash for the be battle ahead.  Fuck yeah.  Teamwork, bitches!\n\n***But whyr no squerze, Mr Monker?***\n  \n**NUMBER A.**  Pretend we live in a world where Citadel & co have relaxed rules, good capital reserves, a decent volume of GME shares available in the market, and a \"reserve bank\" of GME shorts.  The reserve bank is generally less effective and more expensive, but it has the benefit of resetting true GME shorts settlement and somewhat hiding the short activity.  Citadel also has several additional tactics they can employ in a pinch.  \n  \n**LETTER 2.** Now pretend we live in a world where Citadel & co have tightened rules, depleted capital reserves, a desert of GME shares in the market, and basically no \"reserve bank,\" so no way to reset the GME shorts as easily.  They have also almost no backup plays.  \n  \n**Now the moon ticket question:** *if you were a friendly whale, which of these two worlds would you want to fight Citadel in?*  \n  \nIf you chose Roman numeral Beta., the second one, congrats!  You win a trip to the moon!  That's what the friendly whales have chosen.  \n  \n*A world with a bleeding Citadel that's almost bled out, stricter DTCC reporting with a congressional hearing underway, every share is already held by a sea of vindictive retail investors who have turned off margin accounts and glued the GME shares to their balls while screaming some weird form of financial jihad, ETF's who have lowered their GME share balances and can't be effectively shorted anymore, and nearly all other Citadel plays exhausted.*  \n  \n***And if you haven't figured it out, Number A was up until today.***  \n***Part II (the second world) starts Monday.  With Ryan Cohen GME earnings call Tuesday.***   \n***\n***TL;DR***: enjoy what is quite possibly your last weekend on earth :) (but who cares about dates and timelines, anyway.  HODL.  Which is easy, and costs you nothing.  Aren't they glued to your balls, anyway?)  \n  \nedit: a word  \n  \nedit 2: king midas is guilding the shit out of everything.  Everybody get in here!!! 🤣🤣🤣  \n  \nedit 3: u/theThirdShake asked: How could / why would friendly whales “feed us shares”? - my reply: \n>...they don't want to tie up their capital with a huge GME position. They need some shares, but not so many that tie up their resources to buy options or otherwise stay in the black.\n\n>That's where we come in. Friendly whales have discovered diamond hands aren't good with tactical plays, but are really good for 1) holding unreasonably, and 2) buying unreasonably - like at dips or dogpiling on squeezes. So they \"feed\" us shares - release shares to be sold to the market to be held. Generally, these shares won't be released back into the market, either sold or shorted.\n\n>If you need to cause a squeeze but don't have the capital to buy up all of the shares, diamond hands are literally your best friends.",
    "title": "A retrospect: Why Friendly's didn't launch the rocket today",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m8ty6o/a_retrospect_why_friendlys_didnt_launch_the/"
}