{
    "author": "GotSodium",
    "created_utc": 1616202653.0,
    "distinguished": null,
    "edited": 1616209258.0,
    "id": "m8w34p",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m8w34p",
    "num_comments": 250,
    "permalink": "/r/GME/comments/m8w34p/how_the_rocket_will_takeoff_and_why_it_is/",
    "score": 1139,
    "selftext": "**DISCLAIMER: THIS IS NOT FINANCIAL ADVICE, THERE IS NO FINANCIAL ADVICE IN HERE. PLEASE MAKE YOUR OWN SMART DECISIONS.**\n\n------------\n\n**THERE WILL BE NO DATES IN THIS POST.** If you are looking for dates fuck off. I respect the DD, but forecasting and predictions just feed the FUD.\n\n**TL;DR: Shorts are fuk, do the DD yourself if you have to. its so fucking obvious**\n\n-----------\n\nOkay hi. Earlier today I posted [a question](https://www.reddit.com/r/GME/comments/m8bhfk/daily_discussion_chat_start_here/grid6un/) in the daily thread that was a bit controversial about how the market price would actually go up to the millions and how I could be able to sell my shares for that high. So **I decided to do a little DD myself and figure this whole thing out.**\n\nI'll start with some of the basics and move onto some more details about what actually would happen in the event of a short squeeze.\n\n**1. Why do shorts need to cover their position?**\n\nOkay this is actually a really important question. Why would a short cover a position for $1 million dollars when they could just wait for after the squeeze and cover for a lot less?\n\nWell, they can't.\n\nI'll start with a World of Warcraft analogy since I saw one earlier that explained things pretty well.\n\nSay right now you are a hedge fund with a massive naked short position. Right now you are under the effect of a DOT (Damage over time) that doesn't end. What happens if you keep taking damage from a DOT that doesn't end? **You die.**\n\nHowever! Thankfully you have an ability where you take 50% of your remaining health to clear all DOT. **You survive.**\n\n**SHORTS HAVE TO CLEAR THE DOT OR THEY DIE.**\n\nLet me explain why:\n\nNaked short positions mean that they BORROWED shares and then SOLD them for money with the intent to buy them back at a lower price. But, shorts have to PAY INTEREST (damage over time) on the shares they borrowed if they haven't already given them back.\n\nWhat happened with Gamestop is that a lot of short positions borrowed shares and sold them when the price was around $10. Although the interest on these shares is probably relatively low, if the short doesn't cover that position, the maximum loss is theoretically INFINITE.\n\nHowever if they cover their position when the stock price is say $200, they take an immediate $190 loss along with the interest they've already accrued, but the DOT goes away.\n\nRight now shorts are waiting and trying everything they can to get people to sell and get the price back as low as possible. But that takes us to the next point.\n\n\n**2. How can the price go to $2 MIL + ?**\n\nThis question has been answered numerous times, I suggest reading the sticky posts. But essentially the shorts have an enormous (100%+ of the number of shares) short position. So if they want to clear the DOT then they have to buy back pretty much everyone's shares and perhaps more for ANY PRICE.\n\n\n**3. How will the price go to $2MIL +?**\n\nOkay, so I realized a lot of people here don't actually know what a stock price actually is. The market price is based on supply and demand. Some people want to buy a stock at a given price (this is referred to as a BID) and some people want to sell at a given price (this is called an ASK). The actual market price ~~(correct me if I'm wrong) is the mid / average of these two values.~~ is the price of the last completed purchase, not the average of bid/ask.\n\nSo in order for the GME price to go up, the BID ~~and ASK prices~~ have to go up.\n\n**When the rocket inevitably takes off, here is what will (probably) happen.**\n\nShorts will buy up all of the remaining sell orders out for GME (because they want to minimize the damage they take by ending the DOT from interest on the borrowed shares). They will buy these at WHATEVER the ASK price is (assuming it's under a reasonable number like $1000 which is where most ASKS are right now).\n\n**However this only covers maybe only <1% of their positions.**\n\nFrom there they will have to BID higher and higher until people who own GME stock decide to actually sell it to them.\n\nThe stock price will probably rise somewhat slowly (so you don't have to worry about missing the squeeze) because shorts will want to cover at the lowest price they possibly can, bidding higher and higher to weed out the paper hands.\n\nBut since they have to buy more and more and more and more, they will keep having to bid higher and higher and higher and higher until the price theoretically reaches the point where they can't afford it anymore.\n\n**THEN THEY HAVE TO BORROW MONEY OR CRY TO THE FED UNTIL THEY GET BAILED OUT BECAUSE THEY HAVE TO BUY THE SHARES OR THEY WILL KEEP LOSING MONEY INDEFINETLY BECAUSE NOBODY IS SELLING UNDER $100 AND ESPECIALLY NOT UNDER $10.**\n\nYOU CAN LITERALLY SET ANY FLOOR YOU WANT IF THEY ACTUALLY HAVE THAT MANY SHORT POSITION. $100 MIL $5 BIL $500 TRIL.\n\nThis is why I think /u/rensole 's prediction that I read a week or two ago will likely be true. The govt will have to step in and bail out the shorts and buy back our shares for a predetermined price (if it's below $1m then FUCK the government).\n\n**However all this is speculation. I just like the stock.**\n\nLet me know if there are mistakes or any missing details please, and thanks for everyone in this subreddit who posted amazing DD, I honestly just stole from a lot of those but hopefully can put a few people at ease.\n\n**EDIT: I FORGOT TO MENTION AN IMPORTANT POTENTIAL CATALYST. IF GAMESTOP BOARD RECALLS SHARES THEN M()()()()N.** 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀\n\n**EDIT 2: By Damage Over Time, Shorts could technically lose INFINITE MONEY (borrowed shares continue to accrue interest indefinetly), this is part of why the government might step in (even though that might be a disaster on their end).**\n\n**EDIT 3: I forgot about margin calling. The shorts might have to be forced to return the shares if they lose too much money. More info in the comments from some smarter apes than myself.**\n\n**EDIT 4: IM REALLY NOT TRYING TO SPREAD FUD. THE GOVERNMENT STEPPING IN IS JUST SPECULATION, AND HONESTLY WOULDN'T BE BAD IF THEY SETTLE FOR $2MIL+ A SHARE IMO, SEE RENSOLE'S EARLIER DD**\n\n**EDIT 5: I tried to answer as many questions as possible to calm any FUD, this is in the bag. However, I won't be able to answer any more questions right now. I will be holding with you all !**",
    "title": "How the rocket will takeoff 🚀 and why it is inevitable",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/m8w34p/how_the_rocket_will_takeoff_and_why_it_is/"
}