{
    "author": "WardenElite2",
    "created_utc": 1616158575.0,
    "distinguished": null,
    "edited": 1616298924.0,
    "id": "m8gn1h",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m8gn1h",
    "num_comments": 1496,
    "permalink": "/r/GME/comments/m8gn1h/live_charting_for_3192021_predicting_the_days/",
    "score": 11404,
    "selftext": "**This is not financial nor investment advice. These are ideas and opinions for information purposes only. Seek a certified financial professional for investment advice.**\n\n*This post will read bottom to top. It's easier for people to refresh the page and see edits at the top*\n\n**Add me on Twitter!** [https://twitter.com/warden\\_elite](https://twitter.com/warden_elite). I'll be using that as a backup location to post notifications in the event of a Reddit outage. Here is my YouTube. I may post videos in my future and build my channel out after GME is over. [https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM\\_g](https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM_g)\n\n**If you want to support me, check my Reddit profile bio. I appreciate you guys!**\n\n&#x200B;\n\n**Historical support and resistance levels for reference today:**\n\n152.5, 172, 182, 197.5, 209, 211.5, 214.5, 218, 226, 230, 234, 243, 250, 253, 256.5\n\n172 diagonal support\n\n# I will not be accepting private messages today just in case one of those messages is from a shill trying to ban me again.\n\n&#x200B;\n\n**Edit 1 million 4:18PM:**\n\n**Seems Yahoo Finance and Webull lagged. It only just updated. We finished at 200.27, -1.48 and -0.73%. Still above 200.**\n\n**Edit 100000 4:09PM:**\n\n[https://finance.yahoo.com/quote/GME/history/](https://finance.yahoo.com/quote/GME/history/)\n\nClosing price for today according to Yahoo is 202.44.\n\n**Edit 69420 4:05PM:**\n\nVolume right between 20mil and 30mil at about 25mil. So the average of my early morning and midday volume estimates. Guess the whales tapped out midday and came at the last second today to keep the price above 200.\n\n**Edit 420 4:01PM:**\n\nWOW. We spiked in the last 3 seconds and closed above 200!\n\nWe ended in the green today up 0.69 dollars and 0.34%.\n\nMost of today's interesting action was midday from that large buy-in. We finished above 200 and I can affirm that we are still way above the 172 diagonal, and on track for another week of gains!\n\nI hope you all have a good weekend.\n\nStay hydrated.  💦\n\nRelax and have some fun. 😀\n\nNext week will be certainly be another interesting week with the earnings call coming up.\n\n**Some things I will be looking for in the earnings report:**\n\n* Excellent sales from the recent console cycle\n* GPU sales may boost earnings due to how quickly they are bought. However the limited supply may be a bottleneck\n* **Sustainable new revenue streams**\n* Signs of shifting to a higher margin business. Eliminating leases and other PP&E should help GameStop shift towards an e-commerce business model\n\nI will read their 10Q financials and let you guys know my thoughts after the earnings call. Will post quickly if I see any red flags.\n\n**I think what's most important is that GameStop proves themselves capable of achieving higher long term sustainable growth.** Just like how the stock is rising sustainably, the business must do the same. Even if there's a spike in short term sales, you need positive long term prospects to impress analysts.\n\n**Edit 71 3:44PM:**\n\nThe sagging consolidation, by linear extrapolation of this descending channel, is headed straight for 200. Seems we'll end the day with a fight for 200. Long side will probably win.\n\n**Edit 70 3:25PM:**\n\nHard to say what price we will end at, especially since anything can happen during Quadruple Witching day, so I will make a general prediction. I think we will end between 192 and 218. What's the probability of finishing above 200? 50-50 I think.\n\n**Edit 69 3:14PM:**\n\nDepends on the buy volume that comes in, but the red trajectories are more likely as MACD and RSI favor the upside.\n\nHehe. Edit 69.\n\nhttps://preview.redd.it/ytraypq7b1o61.png?width=2140&format=png&auto=webp&s=cd81bde4a75611ea1d9e51901c1aee95323dccd0\n\n**Edit 68 2:56PM:**\n\nSmall correction across VWAP. Volume a bit higher but still relatively low.\n\n**Edit 67 2:42PM:**\n\nLet's put this trading halt knowledge into practice.\n\nRemember that for individual stocks, the Level 1, 2, 3 rule does not apply for individual stocks, only for an index like the S&P 500.\n\nLast Wednesday, we saw halts at every large drop. We were halted for 5 minutes after each drop. **We weren't halted for the rest of the day because Level 1, 2, 3 rules don't apply for individual securities.**\n\n&#x200B;\n\n**Edit 66 2:40PM:**\n\nUseful chart for understanding what time of the day = what threshold for trading halt.\n\nhttps://preview.redd.it/cr8tes3751o61.png?width=619&format=png&auto=webp&s=75665382c801c5fb27c2046a20e5541bca30c969\n\n**Edit 65 2:38PM:**\n\nOh my, AMC looks straight up like a penny stock right now. It's strangely stuck at a resistance line. Anyone know what's up with it?\n\n**Edit 64 2:35PM:**\n\nWe're continuing a sagging consolidation as expected. We should see some volume pick up on or before power hour.\n\n**Edit 63 2:30PM:**\n\n**For individual stocks.**\n\n>Under SEC rules, a stock is required to undergo a trading pause if the stock price moves up *or* down by 10% or more within a five-minute period. These rules vary depending on the price of the stock and whether it is a Tier 1, Tier 2, or other NMS listed security.\n\n**Edit 62 2:24PM:**\n\nSmall clarification. The below rules are in regards to market indeces. For individual stocks, it's a bit different following the LULD rules.\n\n**Edit 61 2:13PM:**\n\n**When a (edit: index) increases in value**\n\nEdit: The opposite of dropping. It's basically the same.\n\n**Edit 60 2:08PM:**\n\nThe modern circuit breaker is a mechanism to temporarily halt trading on an exchange in an attempt to curb panic-selling. It can also be triggered from a steep buying rally.\n\n**When a (edit: index) drops in value**\n\n**These are the rules for a market wide circuit breaker**\n\n**Level 1**\n\nWhen the index drops below 7% of the previous day's close before 3:25PM EST, we get a 15 minute trading halt.\n\n**Level 2**\n\nIf we drop further to 13% below the previous day's close before 3:25PM EST, we get another 15 minute halt.\n\n**Level 3**\n\nThe last threshold is 20%. This halts trading for the rest of the day.\n\nIn the next edit, we will talk about how the breaker is triggered when a rally happens.\n\n**Edit 59 1:58PM:**\n\nAfter Black Monday, it became evident that certain market dynamics, such as a feedback loop of selling leading to more fear and then more selling, needed to be counteracted with changes.\n\nEnter the circuit breaker. **If (edit: the market) plummets 7% within a short period of time, trading would be suspended for 15 minutes.** This helps reduce the problem of the rapid selling feedback loops.\n\nIn the next edit, we'll talk about how the modern circuit breaker works.\n\n**Edit 58 1:57PM:**\n\nThis drop created widespread **fear**. A fear of higher interest rates and a seemingly endless 5 year bull run had led to selloffs prior to Black Monday. In particular, the Louvre Accord, an agreement to stabilize exchange rates and halt the decline of the US dollar, was one such catalyst for rising interest rates.\n\n**Edit 57 1:49PM:**\n\nOn October 19, 1987, in a single day, the Dow Jones Industrial Average fell by 22.6%, the largest drop in a single day.\n\nhttps://preview.redd.it/ugb49bl951o61.png?width=594&format=png&auto=webp&s=51f59f544b2ef0091d2bf4cfa16b1fe0b02666a0\n\nThe story continues in the next edit...\n\n**Edit 55 1:33PM:**\n\nJust a reminder that midday predictions are usually pretty vague as the volume is extremely low.\n\n**Edit 54 1:27PM:**\n\nFor now, expect a sagging consolidation as buy volume is not back yet.\n\nhttps://preview.redd.it/44czu83rs0o61.png?width=2140&format=png&auto=webp&s=1b02924080a15605e05e855543bf9ce9d329d5b5\n\n**Edit 53 1:21PM:**\n\nRegarding livestreams, I currently have classes occasionally so I'm doing this while in a Zoom call half the time lmao. I can probably do periodic streams after GME, but I can't stream daily as it's midterm month right now.\n\nWord of advice for the younger viewers. Find some smart buddies in your classes and have them hit you up ;)\n\n**Edit 52 1:18PM:**\n\nBuy volume is missing. Consolidation and further sagging is more likely at this point.\n\n**Edit 51 1:16PM:**\n\nOption B it is.\n\n**Edit 50 1:11PM:**\n\nVolume flat. When the volume is flat, typically what happens is an upwards prediction will sag and transform into an extended consolidation period. I believe what's most likely right now is sideways or option B from edit 46.\n\nhttps://preview.redd.it/62ghnmo9s0o61.png?width=593&format=png&auto=webp&s=03ff6613cf6f83dcee8db216d500bca293d347e9\n\n**Edit 45 12:48PM:**\n\nThis is really impressive. No one is selling. This allows for RSI and MACD to reset and let us continue on our third leg up.\n\n**Edit 44 12:45PM:**\n\nFurther speculation: They borrowed millions of shares this week. Possibly a large short attack midday today.\n\nToo bad for the hedgies. We are immune to short attacks.\n\n**Edit 43 12:44PM:**\n\nSpeculation: This could be a combination of MMs delta hedging, big whales buying in, RH buying real shares finally, and short coverings possibly triggered by XRT rebalancing.\n\n**Edit 42 12:41PM:**\n\nWe're a bit too overextended. MACD favoring the downside. Some possible consolidation levels are 214.5, 218 and 222.5 if we manage to hold strong.\n\n**Edit 41 12:37PM:**\n\nGiven how early the action has picked up, **I must increase my volume target to at least 30 million for the day**. Good catch by u/FDAz\\*\\*.\\*\\*\n\n**Edit 40 12:36PM:**\n\nWow we consolidated briefly and now we're continuing our climb up! 222.5 is now a support level!\n\n**Edit 39 12:32PM:**\n\nConsolidation around 218.5 seems likely. MACD favoring the upside but RSI overbought. These mixed signals usually mean more consolidation.\n\nhttps://preview.redd.it/wta6l8kbi0o61.png?width=2135&format=png&auto=webp&s=b0f306bcecc617a58dc36237b0efcdcdcd439478\n\n**Edit 38 12:29PM:**\n\nVolume ramping up again. Possible 2nd leg of the push? **218.5 and 222.5 are the next resistance levels.**\n\n**Edit 37 12:25PM:**\n\nJust a clarification on the sideways arrow. Bouncing at 204 is still sideways, because the regression line remains sideways. We're still moving sideways, but a 204 bounce may see the price returning to 209 and continuing the sideways trend. Given how strong I see the price holding, I think a 204 bounce is not as likely.\n\n**Edit 36 12:21PM:**\n\nI am thoroughly impressed by how strong this stock is holding above VWAP.\n\n**Edit 35 12:14PM:**\n\nI believe our 209 support will soon give way. Expect either a bounce on 204, or a bounce somewhere between 204 and 197.5. We're way overextended above VWAP.\n\n**Edit 34 12:12PM:**\n\nShorts are desperate to keep this thing down. Available shares declining fast. They likely knocked it down from a 211.5 support to a 209 support. This is like trying to stop the Blitzkrieg with sticks and stones.\n\n**Edit 33 12:08PM:**\n\nAll directions are fair game. Volume has settled down and now the price is attempting to find a support to consolidate on. **I believe the sideways arrow is most likely as MACD and RSI will return to neutral soon.**\n\nhttps://preview.redd.it/awqdjc16i0o61.png?width=594&format=png&auto=webp&s=db89b59ac360dbd42191f624333ab91a05d7053b\n\n**Edit 30 11:55AM:**\n\nI'm gonna watch the rocket fly and see where it goes. Sit back. Relax. Enjoy the show.\n\n**Edit 29 11:54AM:**\n\n204 acting as a temporary support now.\n\n**Edit 28 11:51AM:**\n\nSeems like they timed this push with the S&P climbing. This causes the HFTs to go long biased and pump the stock up.\n\nhttps://preview.redd.it/ofoasb24i0o61.png?width=592&format=png&auto=webp&s=89730f29fa71d7d0457816047d626ad409074a08\n\n**Edit 25 11:44AM:**\n\nA couple comments. First, I'm replacing the images below with a screenshot grouping the images together. This allows me to overcome the 20 image limit per post. You might think my charts disappeared, that's normal. Reddit is reprocessing the images.\n\nSecond, I'm using Webull. I use a white background because it's easier to see my crayon marks than on a black background. I have the default RSI, VWAP and MACD indicators turned on. These are 3 of the most popular indicators for understanding price action.\n\nLastly, I believe Cohen hasn't done a share recall, because he is opting for a controlled burn. Remember we want the price to climb sustainably to avoid any crazy downswings. By climbing slowly, we build **consolidation** and a **stronger support**, **making it next to impossible to short attack.** This is like a rocket. You need to control how much fuel you let out at the beginning, before the rocket can enter the stratosphere and go to the moon. I believe Cohen understands this basic principle.\n\n**GME climbing slowly is a good thing. I believe it is currently on track to hit the stratosphere in the coming weeks.** Cohen might time the share recall when our rocket has entered Max Q and is ready to leave Earth. Timing it too early is dangerous for our rocket.\n\n**Edit 24 11:36AM:**\n\nI believe we are nearing a critical junction point. The 172 diagonal will intersect with the 192 horizontal resistance. I believe the price will mini squeeze up sometime during power hour and the price will jump above 192 acting as a support.\n\nhttps://preview.redd.it/y4nemya2i0o61.png?width=600&format=png&auto=webp&s=a225cde3646ede44b6c2de23e6bebb2256b8081d\n\n**Edit 21 11:19AM:**\n\nu/jiligalaxy good idea\n\nhttps://preview.redd.it/6apizhw0f0o61.png?width=594&format=png&auto=webp&s=3c981987fbd433c04baee41b78e5884320f2253d\n\n**Edit 19 10:59AM:**\n\nhttps://preview.redd.it/9mys1djr70o61.png?width=598&format=png&auto=webp&s=f022fae3d42ae67ef264487ccae1010e7f7608fb\n\n**Edit 17 10:42AM:**\n\nhttps://preview.redd.it/n9lbqi2q70o61.png?width=603&format=png&auto=webp&s=ade09f019f73074754d75d0f74d6500498a29c68\n\nThe MACD and RSI strongly favor a 172 diagonal bounce. So option A is most likely.\n\n**Edit 15 10:24AM:**\n\nA comment about my speculation that shorts may use Calls to cover. Yes they can do that, but it comes with risk which is why I'm not sure if they are actually doing that. It shifts the responsibility of buying shares onto the Market Maker. Thus this type of hedging still results in a net buying of shares. Furthermore there are not enough Call options for shorts to full cover I believe.\n\n**Edit 14 10:20AM:**\n\n**The dome is my own version of the \"Rounding Top\".** The rounding top is a sign of reversal. My version called the \"Dome\" is different in the sense that it is not used to find reversals, but rather to identify periods of waning momentum. **When volume decreases and the market is bearish, we usually see a dome form** as the price sags downwards. This does not necessarily signal a reversal.\n\n**Edit 13 10:19AM:**\n\nThe broader market is down with the S&P down half a percent right now. The tech selloff continues.\n\nWith inflation fears and increasing rates, high P/E stocks that are valued mostly based on future expectations of earnings will see selloffs like TSLA and  PLTR. **These high growth tech stocks are mostly valued based on future expectations, so that does not square well with inflation fears.**\n\n**Edit 12 10:16AM:**\n\nGME finishing most of the dome, and now consolidating across VWAP.\n\nhttps://preview.redd.it/tblyp0eo70o61.png?width=596&format=png&auto=webp&s=1fd0ed14d05a7a4a14d8e9e5fdc8f303047dbe03\n\n**Edit 10 9:56AM:**\n\nSpeculation: It was the long whales that prevented SSR. What if the longs are shorting this stock so that fewer OTM Calls become ITM? What if shorts are using these Calls to cover?\n\n**Edit 9 9:51AM:**\n\nSeems to be covering of the shorts spent at market open.\n\nhttps://preview.redd.it/2k2s8jpm70o61.png?width=599&format=png&auto=webp&s=7db046b4103296a0f72b4a758f527faeb8bfd1cc\n\n**Edit 5 9:32AM:**\n\nOkay super interesting, **very low volume first minute** at 550k. Seems we'll start quietly in the morning.\n\n**Edit 4 9:30AM:**\n\n**I think it will bounce early around the 183.5 support. Shorts trying to prevent SSR possibly!**\n\n**Edit 3 9:17AM:**\n\nSmall edit. **The SSR threshold is 181.58**. Remember though that SSR probably doesn't matter too much. They have other ways to short on a downtick.\n\n**Edit 2 9:11AM:**\n\nI believe today could start quiet, and then go straight up parabolic up or down later in the day. Let's find out at market open and watch the volume.\n\n**Edit 1 9:03AM:**\n\nI just discovered that they may have somehow hacked my main account and deleted my 3/12/21 post about their Conversions and their market manipulation! Fishy...\n\n# Begin Reading Here\n\n**If you want to donate, check my Reddit profile bio. I appreciate you guys!**\n\nhttps://preview.redd.it/91hwtqoybzn61.png?width=681&format=png&auto=webp&s=a6ea6a7322ed9da8f0c4a0e84aeeef33580e797a\n\nGoooooooooooooood morning my fellow apes, it's good to be back!\n\nTHIS IS A BATTLE. The enemy is strategically sniping DD contributors on this sub. First me. Then Pixel.\n\n**THIS IS HOW YOU KNOW WE ARE WINNING THE GOOD FIGHT. LISTEN TO ME (NOT FINANCIAL ADVICE), I LIKE THE STOCK, SO I WILL HOLD. THIS GOES TO $40? I WILL HOLD. THIS GOES TO $5? I WILL HOLD.** Shoutout to u/plumdragon, u/rensole and all the mods for helping me get up and running on my second account!\n\nI believe the shorts have prepared all month for this fight. I believe they have all teams ready, manned up on the ETF desk, the equities desk. They have assembled an entire team of traders to short the shit out of GME **today**.\n\nhttps://preview.redd.it/px5hpoyk70o61.png?width=592&format=png&auto=webp&s=bb052f5f777e8792654530ed710734649429b5b4\n\nOverall, I remain bullish on this stock. **In fact, my bullishness has only increased after seeing this stock collide head-on into support levels multiple times over the course of this week.** Each time, I almost thought it would smash through the supports and tumble lower, but it didn't. **I was honestly astounded at how strong our support levels held.** I do not make long term predictions lightly, but based on all the evidence before me, I must conclude that our trajectory remains upwards. If the mother of all short attacks happens today, I predict we will respect the strong support levels and bounce sharply.\n\n**Furthermore, there is no evidence of panic selling or dumping by institutions.** As you all have probably seen the Bloomberg terminals, buying and holding has remained strong.\n\nI was one of the people to predict the R\\_K\\_T pump and dump before it happened. I also called out the S\\_L\\_V and Tilray pump and dumps a while back.\n\n[https://www.reddit.com/r/GME/comments/lw7e1j/why\\_tlry\\_slv\\_and\\_rkt\\_could\\_potentially\\_be/](https://www.reddit.com/r/GME/comments/lw7e1j/why_tlry_slv_and_rkt_could_potentially_be/)\n\n**I see absolutely 0 similarities between the recent down trend in GME and the dump in R\\_K\\_T.** No matter how I look at it, I reach the same conclusion, **GME's recent downtrend was a failed manipulation attempt by short sellers.** We see incredibly low volume, and almost no sellers. Volume was only 11.7 million and there is a clear downtrend in volume and liquidity. We've been gobbling up all the shares at the dips!\n\n**In fact, we outperformed much of the market.** We did better than Palantir, better than Apple, the list goes on. Relax if you see GME in the red. The whole market was down because of bond yields spiking up.\n\nI saw some incredible support at the 200 level. This stock struggled to go lower than 200, reaffirming my belief that the true floor of this stock has risen from 40 to at least 150. Heck I think the 172 diagonal will prove to be an unbreakable shield. I call it the 172 diagonal because that's where we bounced a couple days ago.\n\nhttps://preview.redd.it/zjkvlyz2dzn61.png?width=2139&format=png&auto=webp&s=d2c09e4c2dc5a4b68cafb73c4058265c9eefdc98\n\nThe MACD and RSI look great for the long term. We're about ready for an upwards correction. **It's possible we may bounce on the 172 diagonal today. Keep in mind the SSR threshold for today is  181.58.**\n\nIn terms of the long term outlook, I don't view it as a bad thing if we don't squeeze today or next week. **There's nothing bad about a slow and steady climb. It's both sustainable and harder to short attack.** I believe the wild up and downswings of the unsustainable runup during the January runup led to more paper handed and easier short attacks. I see strong evidence in this runup that people have much higher confidence in holding and are most probably buying more and more shares. This is great news for our potential to reach the moon!\n\nIf we end in the red again today, no problem. **We're still way ahead of schedule and way above the 172 diagonal.** We're following a clear uptrend and I expect earnings to only help propel us further up.\n\n# Strategy Analysis\n\nI believe today will certainly be unpredictable. There's just so many variables at work on Quadruple Witching Day. I've been through 2 of these days in the past. They were rather uneventful, but who knows, I think GME may be an exception from the norm.\n\nImplied volatility has continued to decrease, allowing for Call contract premiums to be cheaper. **This supports my bull thesis that institutions are gaining increased buying power due to the lower premiums.**\n\nIf we take a look in ThinkorSwim at the ImpVolatility (Cyan) and HistoricalVolatility (Purple) indicators, we can get a sense of where we're at in terms of options strategies. Historical Volatility is a measure of a stock's actual volatility based on historical prices, while Implied Volatility is future oriented and calculated with a derivative pricing model.\n\nhttps://preview.redd.it/b5kkeww1v0o61.png?width=593&format=png&auto=webp&s=79c89141605cb21bc9b4acb48f86c8a66eae8124\n\nIt seems our fellow wrinkle brain [u/Quiet-Finish7848](https://www.reddit.com/user/Quiet-Finish7848/) has again found some interesting data. It would appear that shorts are increasing on Puts to apply selling pressure on Market Makers who need to delta hedge. **I believe this also means their short attack and Conversions failed miserably yesterday.** They are so desperate, they are now spamming Puts trying to get MMs to drive the price down. HAH!\n\nhttps://preview.redd.it/hn4tc15adzn61.png?width=1992&format=png&auto=webp&s=462441f9cbeb8004fe5952c87a13591193d6eacf\n\nYou can check on [OptionSonar.com](https://OptionSonar.com) for this chart (they require you to pay though for up to date data).\n\n# Premarket Analysis\n\nI expect a large downswing today to scare retailers. We aren't on SSR yet and they seem to have a lot of shares ready to unload. **If we see the mother of all short attacks happen today, I don't give a damn.** I will hold the stock like I held through the last short attack at $348 because I just really like the stock. **Again, from a purely unbiased technical perspective, I see 0 evidence of retail paper handing. We are holding strong.**\n\nI think today should show significant volume. I will confirm by reading the first minute candlestick volume. Usually anything over 1 million is decent volume. 2 million is fairly strong and anything over that signals a battleground day.\n\nRemember the SSR threshold for today is 181.58. We may see it dip to that level around 9:50AM and bounce on the 172 support.\n\nhttps://preview.redd.it/qjniimcv50o61.png?width=599&format=png&auto=webp&s=fa3151a8a5b6a17c0ed851aa6df402fb617a0e7c",
    "title": "Live Charting for 3/19/2021, predicting the day's price action in detail with Warden. PREPARE FOR WAR EDITION",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/m8gn1h/live_charting_for_3192021_predicting_the_days/"
}