{
    "author": "lawrgood",
    "created_utc": 1626875421.0,
    "distinguished": null,
    "edited": 1626879614.0,
    "id": "ooqa3p",
    "text_only": true,
    "flair_text": "🖥️ Terminal | Data  👨‍💻",
    "name": "t3_ooqa3p",
    "num_comments": 105,
    "permalink": "/r/GME/comments/ooqa3p/the_real_price_of_gme_over_the_last_year/",
    "score": 1386,
    "selftext": "T+35 is very real, we've just been looking at the wrong bit. We've been looking at the peaks when we should have been looking at the dips.\n\n&#x200B;\n\nhttps://preview.redd.it/9grnqjoqykc71.png?width=804&format=png&auto=webp&s=3c15bedfdb5a3fe672c6aacae7461f945eaecb77\n\n[https://i.imgur.com/ChZFxPm.png](https://i.imgur.com/ChZFxPm.png)\n\n**Why the dips?**\n\nBecause of how you reset an FTD. When shares are hard to borrow, in order to get shares to deliver on the contracts you took out before, you need to manufacture some. One way to do this is through married puts, another is through shorting ETFs, but what both have in common is, you are selling shares that you don't have.\n\nTrader A, let's call him Dodge, is supposed to deliver 100 shares today, but he doesn't actually own any. Because he is too cheap to buy them back at the current price, he comes up with a plan to sell a new call to his friend with a strike price way below the current value so that his friend can exercise it immediately. The friend then turns around and sells them back to Dodge for a slight profit so that he can make good on those FTDs.\n\nHere is the SEC warning us to look out for exactly this.  [https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf)\n\nWhy doesn't Dodge buy one from his friend instead so that he can just get his hands straight on the shares? Because then, Dodge has offloaded the problem of eventually delivering the shares to his friend. His friend likes Dodge, but not enough to ruin themselves trying to help them out of the hole.\n\nNow, selling shares for less than they are worth, then buying them back again at a slightly different price. That sounds an awful lot like trading action we see that tends to come right when GME's price hits a peak. You know that rapid price drop that sends the price shooting down.\n\n**Why T35?**\n\n35 days is the period to deliver on FTDs resulting from a short sale. Rule 204 from this doc  [https://www.sec.gov/investor/pubs/regsho.htm](https://www.sec.gov/investor/pubs/regsho.htm) \"the firm has up to 35 calendar days following the trade date to close out the failure to deliver position by purchasing securities of like kind and quantity.\"\n\nSo let's map it. If price goes down during a can kick, and apes buying shares and holding them leads to prices going up, what we should see is that, every 35 days the lows should be going up. Using data from Yahoo finance, for each date in the last year, I graphed the lowest low seen in the 35 days previous. [https://finance.yahoo.com/quote/GME/history?period1=1595337110&period2=1626873110&interval=1d&filter=history&frequency=1d&includeAdjustedClose=true](https://finance.yahoo.com/quote/GME/history?period1=1595337110&period2=1626873110&interval=1d&filter=history&frequency=1d&includeAdjustedClose=true)\n\n&#x200B;\n\nhttps://preview.redd.it/buy7190uykc71.png?width=870&format=png&auto=webp&s=60a4afd098ffce02fc93ee6228ff82338d18fa8d\n\n[https://i.imgur.com/HWh0COE.png](https://i.imgur.com/HWh0COE.png)\n\nAnd what I got was the real price graph for GME. Stonks go up. All the action in between is noise. Every 35 days the price keeps ratcheting up and up as things get worse and worse for the HFs.\n\n&#x200B;",
    "title": "The real price of GME over the last year",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/ooqa3p/the_real_price_of_gme_over_the_last_year/"
}