{
    "author": "Particular-Salt146",
    "created_utc": 1623573236.0,
    "distinguished": null,
    "edited": 1623574279.0,
    "id": "nyrzfb",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nyrzfb",
    "num_comments": 69,
    "permalink": "/r/Superstonk/comments/nyrzfb/its_time_to_expose_dtcc_finra_and_all_this_gang/",
    "score": 1394,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/xxuir9dsuz471.png?width=1200&format=png&auto=webp&s=ab912f5c3ce816dd67e3260a9519277711c48ced\n\nDear apes, I'm sickened to see all these MSM lies, to not be able to tell my friends without playing crazy, to know that the big financial players are continuing their schemes to try to divide us.\n\nDuring all these months we have been waiting for a catalyst and I still believe RC has a plan. Nonetheless, I believe the only force we owe is there in Superstonk. It is time to expose this massive fraud, we need relays, our story deserves to be written. \n\nI think the mods should have an AMA with representatives from the ICIJ. For information, the ICIJ is the international consortium of investigative journalists. **They revealed the panama papers, Luxleak, Swissleaks, the paradise papers.**\n\nI think that we should not only contact them but also organize an AMA with them for the time of a conference to discuss the very good results of the research of our investigators: the apes.\n\nIt is time for all of this to explode, let us count only on ourselves to lead the assault. Apes together strong!\n\nPlease dear mods, consider this opportunity u/atobitt u/pinkcatsonacid u/rensole\n\nThe link to ICIJ is here : [https://www.icij.org/](https://www.icij.org/)\n\nPS: Forgive the mistakes, I am only a French ape in your beautiful forest.",
    "title": "It's time to expose DTCC FINRA and all this gang of corrupt people OURSELVES and ICIJ can help us.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyrzfb/its_time_to_expose_dtcc_finra_and_all_this_gang/"
}