{
    "author": "FreelancerWells",
    "created_utc": 1623598648.0,
    "distinguished": null,
    "edited": false,
    "id": "nyyxzt",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nyyxzt",
    "num_comments": 163,
    "permalink": "/r/Superstonk/comments/nyyxzt/its_not_just_the_squeeze_you_should_be_excited/",
    "score": 1713,
    "selftext": "The GME squeeze provides a once-in-a-lifetime opportunity to gain more money than you ever thought possible. Oh, but it doesn't end there. As soon as you have that money, it ceases to be a one-off thing. Because stock market gains are % based, it basically means the more money you have, the more money you make. Welcome to compound gains, one of the main reasons people become so disgustingly rich (aside from, you know, crime).\n\nIn fact, there are 2 significant post-MOASS opportunities waiting for us. First is the inevitable market-wide crash as a result of the squeeze. If you put some of your money into a few of those stocks, simply having them recover to normal levels could net you some pretty substantial profits.\n\nThen there's Gamestop itself. My guess is that it'll settle back down to a few hundred, and with the ongoing expansion / transformation, it could be multiple times that within a couple of years. Depending on how much you put back in, we're talking potentially MOASS level gains all over again.\n\n\\-----\n\nThis brings me to another point - there's really no reason to risk pre-MOASS swing trading. I used to look wistfully at the March peak / drop and think \"what if?\". But it only crossed my mind because of doubts about what I'd end up getting. Thing is, if I really do sell most of my shares for 20m each, there's no way I would want to take huge risks to increase my gains. And in the event that I don't get that much, I have the same potential to scale up my gains afterwards.\n\nNot only that, but if you allow yourself to sell at those small peaks, how are you going to react when the price is regularly swinging by hundreds and then thousands? No, best course of action is to condition yourself to hold no matter what. Otherwise you risk paperhanding far too early, or acting on the impulse to swing trade during the squeeze, only to misjudge it and wind up panic buying back in at a massive loss.\n\nTL:DR\n\n🍌🍌🦧🚀🚀🚀🚀 -> 🌛💰🍌🥂 -> 💵💥🍌🍌🍌",
    "title": "It's not just the squeeze you should be excited about. The power of compound gains. 💰🚀 Also a word of warning against swing trading.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyyxzt/its_not_just_the_squeeze_you_should_be_excited/"
}