{
    "author": "DerButterkex",
    "created_utc": 1624613761.0,
    "distinguished": null,
    "edited": 1624614400.0,
    "id": "o7kcy4",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o7kcy4",
    "num_comments": 248,
    "permalink": "/r/Superstonk/comments/o7kcy4/citadels_office_activity_is_a_rare_and_crucial/",
    "score": 5408,
    "selftext": "As many of you, I love seeing lit up buildings or google activity data from our SHF Citadel. Quick upfront: Europoor Ape who likes to make memes, works in emerging technology and studied Philosophy.\n\nOne thing I took away from university is the principle of bottom-up / top-down analysis. If done properly and emotionless, it gives a very clear image of a situation, no matter what opinions, pre-determinations or majority consensus thinks about a situation. So I thought, let's do this together. If you know something to add to the what we know section, we can come up with neutral assumptions.\n\n&#x200B;\n\n**What we know:**\n\n\\- GME is a highly shorted stock which made the original shorting thesis of bankrupcy obsolete by raising capital and changing their direction and management team\n\n\\- Assumptions point to a high probability situation in which the stock is multiple times over shorted\n\n\\- Retail is overwhelmingly bullish on GME to a point where price discovery seems to not line up with buying pressure\n\n\\- Citadel is a Market Maker and facilitates almost all retail trades for $GME\n\n\\- Citadel is not a neutral entity: They oppose a bull theory and have gone short a long time ago\n\n\\- Citadel pays various Neo-brokers to gain insights on retail activity, BEFORE they get executed\n\n\\- Citadel is a leader in high frequency trading and essentially built programs that print money on arbitrage in the best case and blatant market manipulation in all others\n\n\\- It has been known that various online platforms and MSM are used as datapoints to create technical analysis \"patterns\" and front run retail and leave them as the bag holders while profiting from the expected response to the action their HFT bots create\n\n\\- Citadel is much more active with more people present in the office at any given moment than usually + they know we know this\n\n\\- This tactic is USELESS in the example of GME: Buying and Holding a stock, no matter how many traditional sell signals there are, breaks their entire system. Sure, they can drop the price but if nobody to very few execute at these numbers, their gain might be less than their electricity cost\n\n\\- Like it or not: Some of the smartest developers and mathematicians work for Citadel in order to perfect the gold shitting goose that HFT + Retail Manipulation and the ownership of the entire chain of transactions + the rights to naked shorting, is\n\n\\- Our Forum is PUBLIC, now it should stay that way but it comes with benefits and risks: Open flow of information is our secret weapon and Achilles heel: We are way past the stage in which some guys scrape the forum and input some numbers, we got machine learning algos doing that a thousand times a second.\n\n&#x200B;\n\n**Ok now lets try to make some assumptions and then prepare for various results:**\n\n\\- Citadels HFT Bots are probably useless and need to be updated\n\n\\- Citadel is well aware of all the information on reddit and twitter readily available to be read by scraping programs and could use this to re-write their algos\n\n\\- Superstonk is a lost cause for them, sure they can try to create dilution of information by having bots spam negative messages but we are basically the die hard GME fanclub and whatever you do, you will not be able to change the opinion of hooligans and ultras' towards their favourite football team\n\n\\- Reddit is much, MUCH more than just Superstonk. And the internet is MUCH more than reddit. There is plenty of narrative and unknowing people to control.\n\n\\- They used to do that, to the point where they basically mock us by putting up their logo in multiple screens on MSM\n\n&#x200B;\n\n**Now what could results and motivations of these actions be?**\n\n\\- By playing a long game of controlling our emotions, they want us to feel angry and hateful towards their manipulative behaviour, mentally and financial market-ly\n\n\\- Mainstream is so far on our side but scapegoating isn't a tactic for good will, its a tactic because it used to work, a lot. Human psyche does not change fast, we are very close to our versions 400 years ago. It could work again\n\n\\- Activity at Citadel suggests that they A) lobby for rescue at various parties B) update their bots to counteract our actions by not simply lowering the price but actually giving us mental \"floors\" only to then break them, multiple times over. Posts suggesting that holding makes people tired is not a direct shill attack, its the result of their indirect attack. We need to be there for our community members feeling stress and anxiety from this insane situation.\n\n&#x200B;\n\n**So what can we do about it?**\n\n**- Detach ourselves emotionally**\n\n**- Take away any focus or eyes from mainstream media. They win every time we post something about Cramer or Fox News**\n\n**- Don't make this political**\n\n**- Don't expect any dates or outcome other than what's certain**\n\n**- Be above the enemy. If he slaps you on one cheek, you turn the other. If slapping doesn't hurt you, it will break the enemy in the long run**\n\n**- This is not a game of time: this is a game of persistence**\n\n&#x200B;\n\n&#x200B;\n\nAs always: Buy, Hold, be patient\n\nPlease feel free to add anything you think others could find useful to make their own assumptions in the comments.",
    "title": "Citadels Office Activity is a rare and crucial datapoint we have towards them",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7kcy4/citadels_office_activity_is_a_rare_and_crucial/"
}