{
    "author": "dlauer",
    "created_utc": 1624535775.0,
    "distinguished": null,
    "edited": false,
    "id": "o6zdgm",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o6zdgm",
    "num_comments": 34,
    "permalink": "/r/Superstonk/comments/o6zdgm/finras_new_pfof_and_best_execution_guidance/",
    "score": 813,
    "selftext": "FINRA has just [issued new guidance](https://www.finra.org/rules-guidance/notices/21-23)\"reminding\" firms of their obligations of best execution when accepting or paying payment for order flow (PFOF). There are definitely some key things to see here. It's clearly focused on recent issues with Robinhood, and how they give hardly any price improvement, while accepting huge amounts of PFOF.\n\n&#x200B;\n\nhttps://preview.redd.it/d78rw9ipc7771.png?width=822&format=png&auto=webp&s=52d1e51c438a9423170a696918e93a670c738465\n\nFINRA is re-iterating that best execution and best price trumps payment and inducements. FINRA then reminds firms of a notice sent in 2015, and lays out that firms have to prioritize price improvement opportunities:\n\n&#x200B;\n\nhttps://preview.redd.it/a4o6oz5xc7771.png?width=841&format=png&auto=webp&s=6ae22ad753b784686d4eb967dcd9f20165aeb6a9\n\nI think the next part is one of the key passages. It's directly targeted at internalizers, and goes to the practice of them offering to give brokers either PFOF or price improvement - FINRA appears to be saying that this is no longer allowed:\n\n&#x200B;\n\nhttps://preview.redd.it/6f7ycg95d7771.png?width=833&format=png&auto=webp&s=35a8da5b402d9a929e8564dc73ecad1b6834cbd4\n\nI believe this suggests that FINRA is putting firms on notice that new rules are coming, and they need to change their practices right away. This is a good step in the right direction, but it will be wholly inadequate without new rules and stepped up enforcement.",
    "title": "FINRA's New PFOF and Best Execution Guidance",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6zdgm/finras_new_pfof_and_best_execution_guidance/"
}