{
    "author": "gme_noob",
    "created_utc": 1619582022.0,
    "distinguished": null,
    "edited": 1619602269.0,
    "id": "n06b7r",
    "text_only": true,
    "flair_text": "💭 Opinion 💭",
    "name": "t3_n06b7r",
    "num_comments": 243,
    "permalink": "/r/GME/comments/n06b7r/your_shares_act_as_a_multiplier_why_selling_on/",
    "score": 1943,
    "selftext": "**TADR: Selling a portion of your position to cover your initial investment will take the stress out of timing the peak because you are essential playing with house money. But doing so decreases your multiplier and handicaps your gains/profits.**\n\nI’m unsure of the true origins of this strategy but taking out your initial investment so that you are playing with “house money” is a gambling tactic we have all probably used at the casino.\n\nYou go to the $5 blackjack table and play with $200. Time passes and you have accumulated $500 in chips. You want to be responsible, so you put $200 worth of chips in your pocket, and play with the remaining $300. All is well because regardless of what happens, your initial investment is in your pocket and you are playing with the casino’s money.\n\nThis works because removing the initial $200 doesn't affect your future earnings. In the game of blackjack, your multiplier for each hand is essential (for the sake of argument) 1x. It does not matter how much you bet or how many chips you have on the table, you can only win 1x what you have bet.\n\nIt is different with stocks, however. The game is completely different, and the number of shares you own acts as the multiplier. If the stock goes up $3, and you have 1 share, your gain is $3\\*1=$3\n\nIf you have 10 shares, your gain is $3\\*10 = $30\n\n20 shares, your profit is $60. Etc. etc.\n\nLet's say you had bought 10 shares of GME at the peak back in January. It starts to squeeze and now you sell 2 shares on the way up to cover your initial investment. Sure, there is the peace of mind knowing you are now playing with house money, but you just decreased your multiplier by 20%. Your gains from that point forward are now 8x instead of 10x. At $10 mil a share, you will be missing out on an additional $20,000,000. Is your peace of mind worth that much? You hodl’d through all the mind tricks, price manipulations, and ill emotions of the past couple months. Why are you going to sell yourself short now? (pun intended)\n\nI understand the logic behind selling a couple shares to cover your initial investment but doing so in this situation will handicap your gains when the MOASS is all said and done. Not to mention, it slows down the rocket for your fellow apes as you’re paper handing those shares.\n\nNo one knows where the peak will be and how high the price will go. To say a certain price is or isn’t likely is pure conjecture. You have hodl'd this long because you believe the squeeze will be squoze. Don't limit your gains during this one-time event just to cover pennies. Don’t buy into the FUD. Shills are among us and misinformation is possible, but several things remain constant. All shorts must cover, I like the stock, and Apes strong together.\n\nAs Warren Buffett says, the stock doesn’t know you own it, and it certainly doesn’t care what you paid for it. HODL! Apes don’t need pit stops on this rocket. Exit because you’ve reached your (price) destination, not because of FUD.\n\nI hope I articulated the multiplier thing well enough and that it makes sense. If my logic is flawed, please let me know. There’s been a great number of write ups regarding exit strategies and why it isn’t a good idea to sell on the way up. This ape just wanted to add more food for thought to the concept of selling on the way up, but these crayons from the dollar store must have lead in them because my smooth brain just keeps getting smoother.\n\nWe are all in different financial situations so the squeeze will be a true test of your diamond hands. In the end, use your own judgement, read the DD, and trust and listen to no one.\n\nThis is not financial advice.\n\nedit: a \"you're\" to \"your\" ",
    "title": "Your shares act as a multiplier. Why selling on the way up to cover your initial investment is a bad strategy.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/n06b7r/your_shares_act_as_a_multiplier_why_selling_on/"
}