{
    "author": "hunnybadger101",
    "created_utc": 1624296137.0,
    "distinguished": null,
    "edited": 1624297931.0,
    "id": "o50d8u",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o50d8u",
    "num_comments": 89,
    "permalink": "/r/Superstonk/comments/o50d8u/the_citidel_algo_the_cup_and_handel_the_5_mill/",
    "score": 750,
    "selftext": "Sup Ape's\n\nSo its been brought up in the pas that Kenneth Griffin has created an algorithm that can trade on human behavior in other words to give them the advantage.. However it main use to instill FUD Fear Uncertainty and Doubt.....\n\n**This is their last straw getting the last drop \"**\n\n&#x200B;\n\n[Damit, why wont apes sell...I can feel the rope around my neck getting tighter](https://preview.redd.it/0x0m0yp0kn671.png?width=275&format=png&auto=webp&s=341e9e050281dc74720bb8dd81995aed65314c99)\n\nThe algorithm truly was debunked without apes even knowing it simply buy \" buying and hodling\" ,it was only until recent finding that such an algorithm was brought to our attention on a wider scale. These hedgies are panicking but in the face of their investors they are spitting lies upon lies while the rope gets tighter and tighter. And as of late the move from the Russel2000  to the Russel1000 adds even more you guessed it **pressure.**\n\n**I have listed out a bunch of hurdles that the hedgies are facing**\n\n* Apes are not selling\n* Apes learned the FTD cycles T+21 / T+35\n* The $350 number opens up large green dildos\n* Russel1000\n* ~~NFT Crypto Dividend~~   To date has not been confirmed ?\n* FOMO\n* Those are just a few,,, and Shitidel, other shorts consciously know that we know what they know.\n\n&#x200B;\n\nThe only option for the shorts, is to continue dropping the share price ... While the whole worlds financial investors have their eyes on GME...and its on a major discount as we just had the recent share offering that was completed right when we formed the **cup and handle**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n[This Cup & Handel is ready for launch](https://preview.redd.it/j6qk369uen671.png?width=1689&format=png&auto=webp&s=ea63a6a7e2be715fa71961c88628dfcbb6532e08)\n\nSO now that we have the perfect cup and handel, combined with the share offering...I cant help but say that nipples are getting super twitchy...\n\n&#x200B;\n\nIf apes combine this with the move to the Russle1000, add in some T+21 and T+35 Fails to deliver apes have the perfect package actually apes didnt do this this was all the doing of the hedgies....now more than ever will there be the most fuckery,... the media has moved on to not even talking about the discount share price \" just imagine if they admitted its on sale and whhheeeeeu good gracious...Yes not to be forgotten the movies are still highly correlated to both price movements, not much to speak about there other than I'm happy for them as they have lots of good things happening as well.\n\n&#x200B;\n\n&#x200B;\n\n[They don't know which was to go](https://preview.redd.it/pd5un301gn671.png?width=275&format=png&auto=webp&s=e6c11500ac474a50ba1f633581aa9d4332617ab7)\n\n&#x200B;\n\nThe price drops apes buy the dip, the price goes apes stare blank faced......Speaking of the share price.....the **dark pools / off exchange trading** is where a large portion of the trades end up...but have no worries the squeeze cant happen there...\n\nMy guess is the SEC and DTC are constantly asking kenny boy \" what are apes doing, which way are the apes going\" The answer is he doesnt know our apes move because apes are too retarded and only know buy and hodl.\n\n**NO DATES but.....**\n\nIt would be a good idea to take into consideration the amount of taxes that will be needed to keep money flowing hence **capital gains**...and the fed, banks, all of them know this...so IMO we may have the opportunity to add more shares to the tendie box\n\nI asked google for the capital gains definition\n\n\" **You should** generally **pay** the **capital gains tax you** expect to owe before the due date for **payments** that apply to the quarter of the sale. The quarterly due dates are April 15 for the first quarter, June 15 for second quarter, September 15 for third quarter and January 15 of the following year for the fourth quarter. \"\n\nThe feds will fuk themselves raw with a cactus dildo, if the delay\n\n.\n\n.\n\n**Apes, I must attend other matters of business, I hope you  enjoyed this quick summarization.** Remember the data , TA, everything has pointed to the end game where there is always a calm before the storm....when nothing is happening that is when everything is lining up to happen.\n\n&#x200B;\n\n**TL;DR**\n\nCalm down, hedgies r fuk, unjack your tits, go about your daily routine of not looking at the chart all day....nothing has happened  until $1.6 million per share...only then may the squeeze have started\n\nbuy/ hodl\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nEDIT 1 - Lest you forget, the hedgies are fight this battel on all fronts with the whole market....let that edit rest assure that they are fighting a loosing battle this time around.\n\n&#x200B;\n\nEDIT 2 - As stated below I have put a strike threw in the NFT dividend as it is still not confirmed and to date is only speculation  as u/StuckOnAutopilot has brought it to my attention below in the comments. much appreciated bud.\n\n&#x200B;",
    "title": "The Citidel Algo, The Cup and Handel, The 5 Mill Offering, Russel 1000 /// I think the stars have aligned.",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/Superstonk/comments/o50d8u/the_citidel_algo_the_cup_and_handel_the_5_mill/"
}