{
    "author": "Perciptify",
    "created_utc": 1625234106.0,
    "distinguished": null,
    "edited": 1625263517.0,
    "id": "ocal4q",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ocal4q",
    "num_comments": 436,
    "permalink": "/r/Superstonk/comments/ocal4q/superstonk_is_being_censored/",
    "score": 3596,
    "selftext": "# Preface\n\n**TL:DR at bottom.**\n\n**I'll start this by saying that this post is hearsay, and I while I feel like I'm providing evidence that points to the conclusion that** r/Superstonk ***IS*** **being censored, all of this evidence is** ***circumstantial.*** **Given that, I included counterpoints to each points. If you think of other** ***LOGICAL and REASONABLE*** **counterpoints, feel free to message me.**\n\n**If this really is happening, I want to make it known. If you are experiencing any of this yourself, or feel the same as I do, please upvote for visibility. I expect this post to be an easy target for shills to hide with downvotes.**\n\n**\\*SHILL WARNING\\*** This is an easy post for shills to comment on given it's nature. Please take the comments of this post with a grain of salt. With that being said, if this indeed is not happening to you, then feel free to let me know in the comments.\n\n# Point 1: Superstonk is not on many users' home page.\n\nThere is a few posts talking about a reddit setting \"*Next Generation Recommendations\"* that is turned on by default. [Post here](https://www.reddit.com/r/Superstonk/comments/oaaygv/reddit_feed_showing_superstonk_less_how_to_fix/). This has not worked for me in this situation.\n\nI *personally* have not seen Superstonk in my home feed for a couple weeks, even with that setting turned off. Most of the time, the post I see first is from a certain movie company's subreddit. I haven't visited this sub in at least a month. When it is from there, it's from a subreddit I visited once or twice in the past month.\n\nSomething to note: I personally think that if you are not subscribed to many subreddits, reddit is forced to show it on your home feed in order to fill it. The more subreddits you have, the less you will see superstonk. (Theory)\n\nI'll link a few posts that support this theory.\n\nFrom u/damn_nation_inc: [Anyone else seeing less Superstonk in their feed?](https://www.reddit.com/r/Superstonk/comments/obo93w/anyone_else_seeing_less_superstonk_in_their_feed/)\n\nFrom u/t-dac:  [Is reddit recommending superstonk less to anyone else's feed?](https://www.reddit.com/r/Superstonk/comments/oa87k3/is_reddit_recommending_superstonk_less_to_anyone/)\n\nFrom u/WifesBF69:  [Anybody else notice their home reddit feed isn’t showing as many...](https://www.reddit.com/r/Superstonk/comments/o6mcpp/anybody_else_notice_their_home_reddit_feed_isnt/)\n\n**Counters to this point:**\n\n* This could be circumstantial, and only happening to certain people.\n* This could be an algorithmic error, and not the result of human fuckery.\n\n# Point 2: Superstonk is not on the list of top 5000 subreddits.\n\nI don't know about the reliability of this site at all, as is not affiliated with reddit. For all I know, it could be an old site with outdated data, or using an API that is outdated. On that assumption that it is using accurate data, Superstonk is not on the list of top 5000 subreddits, as seen in this picture here.\n\n&#x200B;\n\n[This screenshot was taken at 7\\/2\\/2021 with superstonk at 503k members.](https://preview.redd.it/zzm2rp15hv871.png?width=1415&format=png&auto=webp&s=3944c28ab1ea140b63b47d526379c11bef99518f)\n\nWhether this site was bought out by our resident bedpost handler, or is using an API from reddit that doesn't even contain superstonk, this is weird.\n\n**Counters this point:**\n\n* This could be using outdated data.\n* This could be using an outdated API.\n* There could be a minimum subreddit age for something to appear on this list.\n\n# Point 3: Superstonk is not in the community directory.\n\nI feel like a picture is all I need to explain this point.\n\n&#x200B;\n\n[Most of these subreddits are a fraction of the size of Superstonk.](https://preview.redd.it/tos4ly29hv871.png?width=1148&format=png&auto=webp&s=911f0d8fb9df5ecc4fb5b6db95df64d1aa46fb79)\n\nFeel free to check this one out for yourself. [Community Directory sorted by \"S\"](https://www.reddit.com/subreddits/s-1)\n\n**Counters to this point:**\n\n* There could be a minimum age for a subreddit to appear here.\n* There could be a minimum member count, and a subreddit must be added manually to this list. This could have just not happened yet given how fast Superstonk has grown.\n* This could be an API/Computer error of some sort.\n\n# Possible Solutions:\n\nIf my suspicions are correct, this censorship is coming from Reddit itself. Given that we are on their platform, there is not much we can do. They maintain full control over their platform, and at the end of the day, they do what they want with the content on it. *However,* as I said before, this post is all hearsay. Many other possibilities as to why this is happening exist. This very well could be an algorithmic error.\n\nMy hopes are that ***IF*** this really is being done purposely, then we can make enough noise to be noticed. I went ahead and submitted a request through Reddit's [Submit a Request](https://reddit.zendesk.com/hc/en-us/requests/new) feature. Mine looks like this.\n\n&#x200B;\n\n[Please don't be stupid, and put in stupid requests\\/complaints](https://preview.redd.it/bal6yfcbhv871.png?width=711&format=png&auto=webp&s=488ca7f1312c62eb3c41a64bb509570eb1ef7bba)\n\nFeel free to make your own.\n\n# Conclusion/TL:DR\n\nSomething is wrong with Reddit. Superstonk is being censored, whether it be a purposeful censorship, or algorithmic error, and I have never seen something like this happen with a subreddit.\n\n**Side note: BUY AND HODL YOU BEAUTIFUL APES!**\n\nEdit: Removed a section regarding the reddit request. Originally made it more urgent looking than I meant to. Feel free to do this if you wish.\n\nEdit 2: As u/trCCper said in a comment, there is no urgency in this. I linked the reddit help request in case anyone felt like doing it. Regardless of whether this is happening or not, the motto is the same. **BUY and HODL**\n\nEdit 3: There is a lot of conflicting comments on this post. Many are agreeing, and many are disagreeing. I want to list out what I’ve seen. Pardon the formatting, on mobile for this edit.\n\n1. It seems that old reddit is not having this problem.\n2. It seems that some of the reddit suites are also unaffected.\n3. Some users are saying they saw this post on their homepage. I’m curious if the people saying they are unaffected are only using old reddit. Considering making a poll for this when I get home.\n4. Seems that some android mobile app users are also unaffected.\n\nEdit 4: Seems my picture links are giving 403 errors. Not sure why, but it may be a formatting issue. I’ll attempt to fix it when I am home.\n\nEdit 5: Fixed the pictures.",
    "title": "Superstonk is being censored.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/ocal4q/superstonk_is_being_censored/"
}