{
    "author": "Memoishi",
    "created_utc": 1625232637.0,
    "distinguished": null,
    "edited": 1625240392.0,
    "id": "oca54w",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_oca54w",
    "num_comments": 185,
    "permalink": "/r/Superstonk/comments/oca54w/there_are_waaaay_too_many_put_options_today_and/",
    "score": 1746,
    "selftext": "First of all you dumbass, 200 or even 210 makes a difference to you? Like c’mon, if you’re playing the big squeeze jackpot 🎰 why would you even give a fuck if you buy at 180 or 200 or 220?  \nSecond, https://finance.yahoo.com/quote/GME/  \nGo to the options chain for the love of God. There’s plenty of OI into puts at strategic prices, the biggest ones are at 200 strike price. This could lead to a massive drop if these are executed, we’re talking about 15k puts (with strikes at 200$-130$), which are 15.000x100= 1.500.000 shares only on that span.  \nJust buy and hodl if you like the superstonk that is GME, what’s even the point of purchasing at 200 when it’s at 204?  \nEDIT: All right guys, this is not bitching about these who somehow can't afford to pay 4$ more or 10$ less or whatever, it's not for snubbing people. I don't have many shares so calm the fuck down, I'm not Bezos neither Ken G, I'm a small ape hodler. What I beg you to UNDERSTAND here, it's that you should think before typing things. Doing memes about triggering orders at x price is okay, but this week has been FULL of comments/posts about specific prices (200$ to be clear). When people read this, they think they should do the same. They think 200$ is good and 210$ is not. I DON'T FUCKING CARE - NO ONE FUCKING CARES- about what you buy in and what you sell out. HOWEVER, HEDGIES CARES! You don't scream here \"YEEE LET'S PUT A 200$ LIMIT ORDER\". NO. You post \"bought some more\" because you're happy and want to share with others, WE DON'T POST OUR POSITIONS, WE DON'T POST OUR AVERAGE, WE DON'T POST OUR INFOS BECAUSE THESE ARE MITIGATED AND USED AGAINST US.  \nBuy with limit orders at 200$ or 190$ or 250$, I DON'T GIVE A FUCK! Do the fuck you want and stop posting these, it's both FUD for many others and also a bullet for HF who wants to know our positions.  \nNow quit your bullshit with such things as \"you're jelly because you bought at 220$\". Gotta go work. Have a nice day y'all.",
    "title": "There are waaaay too many put options today, and there’s a strange surge here of “it’s gonna trigger my 200$ order”",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/oca54w/there_are_waaaay_too_many_put_options_today_and/"
}