{
    "author": "Somerandomperson21",
    "created_utc": 1623004637.0,
    "distinguished": null,
    "edited": false,
    "id": "ntscux",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ntscux",
    "num_comments": 78,
    "permalink": "/r/Superstonk/comments/ntscux/naked_short_summer_july_16th_put_options_and_how/",
    "score": 348,
    "selftext": "Hello I would like to start off this rambling by saying that I am a proud ape. Many of you may have seen me in the daily chats. I enjoy talking and learning with my ape family. I love Gamestop and this community.I stumbled into something today and I wanted to share what I found! \n\nOn July 16th there is over 280,000 out of the money put options. As we know each option accounts for 100 shares. 280,000 x 100 is 28 million! That means there are 28 million shares that are tied up just in one day of  put options! \n\nNow I tell myself that is a bunch of shares! \nGME has only issued 73 million shares ever. That is over 1/3 of the shares ever issued in one option day! Now I question how this is even possible. \n\nWhat I think: not financial advise (don’t sue me SHF). \nI think the SHF is hiding some of their naked shorts on this day. If they hide naked shorts in options it won’t show up in their short percentage on ORTEX. They want apes to believe that they really did lower their short percentage when we went from 480 to 40. \nI don’t believe they covered at all!\nWhen you cover a short the price goes up not down because covering is a buying mechanism. But ORTEX reports show that their short interest went down from over 200 percent of the float to 20. Now where did the shorts go? The shorts went to the July 16th put option Naked Short Pool party.  The hedge funds thought that would be sufficient enough time to shake out the apes and for retail to give up and go away. So they put over 28 million shares tied up in just this one day. \n\nThe hedge funds never thought apes and retail would stay with GameStop. They kicked the can down the road thinking the apes would forget and go away. But we apes did not give up. Our diamond hands would not let go of our precious shares. We took months of FUD, short attacks, dark pools and more. Our hands didn’t waver but strengthened. Apes have proven to be smarter, better and stronger than the SHF could of ever imagined. I am for one humbled by my fellow apes grit and determination. I will forever be in your gratitude my fellow diamond handed apes. We took on the Goliath SHFs who have run Wall Street for decades. We are but humble apes of modest means taking on financial goliaths. The media said we had no chance to win! That we are dumb money that will be stomped in. But everyday we are getting stronger. \n\nBelieve in the beauty of your dreams apes. Apes make the world a better place. We are on the verge of making history. Remember these SHF have bankrupted companies and cost people their jobs and livelihoods. They have brought great pain on the world. We will make things right apes. Good will prevail over evil! \n\nLastly, I found all this data on gmecrazyawesomecompany.com. \nI look forward to hearing what apes have to say about my ramblings. Look forward to sharing and learning with my fellow apes.\nStay strong apes!",
    "title": "Naked Short Summer: July 16th Put Options and How it Relates to FTDS. Ramblings of An Ape. Not Financial Advice!",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/ntscux/naked_short_summer_july_16th_put_options_and_how/"
}