{
    "author": "HeyItsPixeL",
    "created_utc": 1616402088.0,
    "distinguished": null,
    "edited": 1616414348.0,
    "id": "maikv1",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_maikv1",
    "num_comments": 1635,
    "permalink": "/r/GME/comments/maikv1/after_my_ban_was_revoked_hedgies_are_trying_to/",
    "score": 29086,
    "selftext": "**PSA: IF YOU ARE A PAID SHILL, YOU ARE MAKING YOURSELF GUILTY OF MARKET MANIPULATION. YOU CAN WHISTE BLOW AND RECEIVE A HUGE AMOUNT OF MONEY FOR THAT. KEEP THAT IN MIND.**\n\n[https://www.sec.gov/news/press-release/2020-266](https://www.sec.gov/news/press-release/2020-266)\n\n[https://www.sec.gov/page/whistleblower-100million](https://www.sec.gov/page/whistleblower-100million)\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\nUnder almost every post and comment section I go to, there are brand new accounts with negative Karma talking about how I shouldn't be trusted, because my 99 % prediction didn't become true, or that I am a quote \"agent saboteur\" (best one yet lol.)\n\n&#x200B;\n\nhttps://preview.redd.it/22hzy3r8gjo61.png?width=720&format=png&auto=webp&s=917e2b16877397825b9ed8fa847f2bf729b41194\n\nhttps://preview.redd.it/oady7fbogjo61.png?width=668&format=png&auto=webp&s=1a7e9169b19622b6d3558c41908b762d57377173\n\n&#x200B;\n\nThat's the kind of comments under every single post and comment at the moment. NOT EVERYONE OF THEM IS A PAID SHILL. Some of them are legit retarded and altough I retracted the 99 % bullshit immediatly after posting, talked about it in 3 interviews in 4 livestreams, comments, posts, Twitter and in the Endgame DD, they seem to have never received the message.\n\n&#x200B;\n\nI. **Why now?**\n\nThis started immediately after I was unbanned. Why was that? Hedgies are scared, because March 19th was probably a date, where shit was destined to go down. They overshorted themselves, borrowing almost every single share in existence on March 19th and most of the effects are to be seen this week (ETF rebalances and Quad Witching). Warden and I were banned that day, my account kept getting mass reported after my unban and now there is a shilling campaign about how I shouldn't be trusted anymore, because I am a saboteur or a shill myself.\n\n&#x200B;\n\nII. **Why are they doing it?**\n\nThey are scared that I and other researchers (like rensole, warden, iamnotafinancialadvisor) will find out and share new timespans, dates or set events, where shit could go down. Therefore they will try to discredit us (me specifically, because I was an easy target with the post), so no one will listen to us, we don't have a big voices in the sub anymore and we all get seperated and only follow the people and posts we trust/like. If they are able to destroy the trust in people, they won't be followed and listened to anymore, no matter how fundamental their research is.\n\n&#x200B;\n\n**TL;DR:** FUD and shilling campaign is entering the next stage. Keep an eye out for people calling researchers saboteurs, shills and they shouldn't be trusted. Look at their accounts. Every single account i checked was brand new, revived (years old but started posting again) or simply never posted in stock-related subs and starts spamming them now.\n\n&#x200B;\n\nEdit: I just read about all the messages people have been receiving from bots and shills. Seems like they entered the final stage.\n\nhttps://preview.redd.it/lstuw8m23ko61.png?width=828&format=png&auto=webp&s=265998cb557afc1bf337ae556b65bc2a3dc6b34a\n\nhttps://preview.redd.it/qsw77nm23ko61.png?width=828&format=png&auto=webp&s=abf942c13f6aa0cbc93aad89e5f33163edfbaf1e\n\n&#x200B;\n\nAlso: They are hiring Shills at the moment. They really are desperate.\n\nhttps://preview.redd.it/udskpkt43ko61.png?width=1284&format=png&auto=webp&s=4fc796dcfbc1c0a9f15717c59ef18b64e14608a0\n\n&#x200B;\n\n**PS:** To all the people spamming the 99 % or hype thing and are not paid shills. You are not funny, just some annoying fuckwits. Here a are some of the examples, where I talked about it. So if you feel the need to keep talking about it or trying to get me mad at it, go ahead. Your lifes seem to be lacking hobbies.\n\n1. [https://twitter.com/HeyItsPixel1/status/1372633163571281926](https://twitter.com/HeyItsPixel1/status/1372633163571281926)\n2. [https://www.reddit.com/r/GME/comments/ltkphc/my\\_response\\_some\\_thoughts\\_on\\_uheyitspixels/](https://www.reddit.com/r/GME/comments/ltkphc/my_response_some_thoughts_on_uheyitspixels/)\n3. [https://www.reddit.com/r/GME/comments/ltk830/lets\\_talk\\_my\\_thoughts\\_regarding\\_my\\_final\\_dd\\_right/](https://www.reddit.com/r/GME/comments/ltk830/lets_talk_my_thoughts_regarding_my_final_dd_right/)\n4. [https://www.reddit.com/r/GME/comments/ltua0n/endgame\\_dd\\_how\\_last\\_weeks\\_actions\\_all\\_come/](https://www.reddit.com/r/GME/comments/ltua0n/endgame_dd_how_last_weeks_actions_all_come/)\n5. [https://www.youtube.com/watch?v=32f9CPxGW10&](https://www.youtube.com/watch?v=32f9CPxGW10&t=4s)\n6. [https://www.youtube.com/watch?v=99Vc-irYsL4&](https://www.youtube.com/watch?v=99Vc-irYsL4&)\n7. [https://www.youtube.com/watch?v=1Mqw4qXHU0Q&](https://www.youtube.com/watch?v=1Mqw4qXHU0Q&t=272s)\n8. [https://www.youtube.com/watch?v=5nCmx8I0bTk&t=14s](https://www.youtube.com/watch?v=5nCmx8I0bTk&t=14s)\n9. [https://www.youtube.com/watch?v=cZv6py5NUls&](https://www.youtube.com/watch?v=cZv6py5NUls&)\n10. [https://www.youtube.com/watch?v=xs-ngMun4LE&t=1s](https://www.youtube.com/watch?v=xs-ngMun4LE&t=1s)\n\nAnd more comments that I won't search up for you now. You have enough time to spam that under every comment, so you have enough time to search for yourself. Just wanted to clarify on that. Because I \\*wink wink\\* haven't talked about it yet. So if you feel the need to keep spamming that under every post or comment, go ahead. You are neither original nor funny.\n\n&#x200B;\n\nEdit: To the people telling me: ThAt's WhAT YoU GeT fOr CalLiNg YouRseLf NoStRaDaMus!!!. I didn't.  I adopted that name, because a lot of people called me that. I found it funny at first, after I adopted it, found it cringy and removed it. Read the comments under that post: [https://www.reddit.com/r/GME/comments/lrijdv/my\\_theory\\_for\\_todays\\_market\\_close\\_get\\_ready\\_for\\_a/](https://www.reddit.com/r/GME/comments/lrijdv/my_theory_for_todays_market_close_get_ready_for_a/)\n\nThat's were the Nostradamus thing came from.\n\n&#x200B;\n\nEdit2: All of my recent comments dropped from 10 - 20 upvotes to -5 - 0 within a second. Nothing shady going on here lol.",
    "title": "After my Ban was revoked, Hedgies are trying to discredit me and other DD Researchers. Now more than ever",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/GME/comments/maikv1/after_my_ban_was_revoked_hedgies_are_trying_to/"
}