{
    "author": "PCP_rincipal",
    "created_utc": 1616286639.0,
    "distinguished": null,
    "edited": 1616299122.0,
    "id": "m9k5rp",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_m9k5rp",
    "num_comments": 69,
    "permalink": "/r/GME/comments/m9k5rp/dear_general_public/",
    "score": 1535,
    "selftext": "When this thing explodes, which it inevitably will, and you go looking for someone to blame, don’t look here. Don’t blame retail, Reddit, r/GME, apes or kitties. \n\nApes have tried their hardest to bring this situation and impending rocket launch, to the attention of all relevant authorities, including both the SEC (regulators) and Congressional members (politicians). Apes even tried to bring it to the attention of the financial and mainstream media, which continues to distort fact and present articles in a dishonest, suspiciously biased manner.\n\nWhen you come looking for someone to blame, start here: \n- **The perpetrators (Melvin Capital, Citadel, Point72, any other hedge funds / brokers / MMs / entities involved or complicit, such as research firm S3)** who exploited loopholes and made reckless bets across the market\n- **The regulators (SEC, regulatory boards, committees)** who were complicit by omission, a lack of enforcement, a limp-wristed organisation who wouldn’t know or care to know what a “conflict of interest” may or may not mean\n- **The politicians (Senators / Reps)** who permitted ineffective legislation (and indirectly, regulations and enforcement framework) to remain in force despite countless examples of its incessant abuse by large market participants\n- **The media (Bloomberg, Reuters, WSJ, CNBC)** who reported dishonestly on the GameStop saga, and continue to do so, thereby restricting key information from being consumed by the general public\n\nNotice that apes and kitties don’t appear on the list. We’ve given everyone everything they need. \n\nApes aren’t responsible and will not accept any blame for this. Whatsoever. \n\n💎🙌🦧🚀",
    "title": "Dear general public",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m9k5rp/dear_general_public/"
}