{
    "author": "Zacwel",
    "created_utc": 1619475141.0,
    "distinguished": null,
    "edited": 1619479936.0,
    "id": "mz9hu7",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_mz9hu7",
    "num_comments": 605,
    "permalink": "/r/Superstonk/comments/mz9hu7/gme_goes_from_300m_in_debt_to_half_a_billion_in/",
    "score": 13083,
    "selftext": "AND THE PRICE NEVER DROPPED??\n\nCAN THIS STOCK GET ANY MORE BULLISH??\n\nThis shows how gamestop **cares** about us. They could've sold in the future when the price would be higher to make even more money but they didn't so that it doesn't cancel the short squeeze. They would rather take less profit and contribute to the squeeze.\n\n[https://www.cnbc.com/2021/04/26/gamestop-shares-jump-after-the-reddit-favorite-raises-more-than-500-million-in-stock-sales.html](https://www.cnbc.com/2021/04/26/gamestop-shares-jump-after-the-reddit-favorite-raises-more-than-500-million-in-stock-sales.html)\n\nCNBC on our side?? What is this?\n\n\"[GameStop](https://www.cnbc.com/quotes/GME)’s stock price climbed in extended trading Monday after the video game retailer said it sold 3.5 million additional shares, raising $551 million to speed up the company’s e-commerce transformation.\"\n\nThey literally sold their 3.5 millions shares and we didn't even feel the drop, hell all we are seeing is green. These guys are **legends.**\n\nThey erased their debt and now they have half a billion dollars in capital which will be reinvested in the company. I've never been this hyped about GME for some time.\n\nThe market at open tomorrow will be wild, could this week be the moment we've all been waiting for? Only time will tell...\n\nIf it is, hold strong in the 300$-1000$ region, this will be the real test and will be the takeoff leading to the a short squeeze. Expect a bumby ride.\n\nEdit: Sorry I said in the title the debt was 300M but it was around 226M and i can't change it",
    "title": "GME GOES FROM 300M+ IN DEBT TO HALF A BILLION IN CAPITAL IN MONTH",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mz9hu7/gme_goes_from_300m_in_debt_to_half_a_billion_in/"
}