{
    "author": "sukkitrebek",
    "created_utc": 1623581516.0,
    "distinguished": null,
    "edited": 1623602619.0,
    "id": "nytt2i",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_nytt2i",
    "num_comments": 994,
    "permalink": "/r/Superstonk/comments/nytt2i/remember_when_the_moass_is_over_and_done_with_it/",
    "score": 13415,
    "selftext": "I know a lot of us are ridiculed by our family/peers that think we are just following a cult-like meme promising fake riches in a dying company.\n\nThe reality is we all know what’s really coming and put in the hours of research day after day.\n\nSome of us put our life savings into this, some weekly paychecks, others every little penny scrounged up til they could just buy that one share. \n\nWe do it because we have a conviction and belief based on sound judgement, hard facts, and scientific method by the many wrinkle brained among us.\n\nSo, when you finally cash those shares in and set a new course of history with the rest of us, remember you didn’t get here by luck.\n\nLuck didn’t make you read hours and hours of posts and data. \n\nLuck didn’t put all your hard earned money on the line.\n\nLuck didn’t make you hold out everytime the stock price crashed from hedge fuckery.\n\nThe only luck involved was discovering this community and accidentally pulling back the curtain to reveal the world with clear eyes.\n\nForget the haters and doubters.\n\nApes strong together.\n \nIt wasn’t luck, but we are lucky.\n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\nEdit: thanks for all the love and awards friends. Glad I seem to have struck a positive chord with the community.  \n\nI see it as an antI-FUD post. Sometimes we just need that reminder of what we’ve done, what we are doing and what will soon be if we are successful.",
    "title": "Remember when the MOASS is over and done with, it wasn’t luck",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nytt2i/remember_when_the_moass_is_over_and_done_with_it/"
}