{
    "author": "pinkcatsonacid",
    "created_utc": 1619517620.0,
    "distinguished": null,
    "edited": 1619532538.0,
    "id": "mzl0dq",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_mzl0dq",
    "num_comments": 690,
    "permalink": "/r/Superstonk/comments/mzl0dq/superstonk_daily_04272021/",
    "score": 10944,
    "selftext": "&#x200B;\n\n[Banner submission by u\\/NitroDildo](https://preview.redd.it/b8veyvpdblv61.png?width=4000&format=png&auto=webp&s=8a53cf543bedde9e0c88c57feed158723d55275e)\n\n# Good Morning Superstonk!\n\n\\*Passes out green crayons to the class\\*\n\nHow about them after hours?!\n\n&#x200B;\n\n[Big fat green crayon in AH](https://preview.redd.it/ksrphy0y9pv61.jpg?width=960&format=pjpg&auto=webp&s=a506e249caefdc2d9011854a49f83449ef48e43d)\n\nBefore we hand the banana over to Brick Tamland for today's top story, I want to make sure everyone has seen [u/atobitt's AMA update](https://www.reddit.com/r/Superstonk/comments/mz37ds/dr_trimbath_ama_questions/?utm_source=share&utm_medium=web2x&context=3). **The official AMA question thread** [is now live!!](https://www.reddit.com/r/Superstonk/comments/mzknu6/official_ama_dr_susanne_trimbath_phd_thursday/?utm_source=share&utm_medium=web2x&context=3)**.**\n\nu/atobitt has been an absolute champ and in addition to modding, finishing up HOC II, and just living life with a big ol' wrinkly brain, he has also been cramming Dr. Trimbath's Books to prepare for our [Superstonk Live YouTube Livestream](https://youtu.be/9rKS92zwh_o). Do you see how dedicated this guy is? I'm so proud we have people of this caliber serving this community on the mod team!! 💪🧠🦍\n\nAnd speaking of Dr. Trimbath's book Naked Short & Greedy, I want to add links and clarify some information.\n\n[IPG](https://www.ipgbook.com/naked--short-and-greedy-products-9781910151341.php?page_id=21) is the North American Distributor\n\n[Spiramus](https://spiramus.com/naked-short-and-greedy) is the Independent Publisher (Which also has a chapter by chapter summary)\n\n&#x200B;\n\n[She is lurking 👀](https://preview.redd.it/ur5g2fqlbmv61.jpg?width=1079&format=pjpg&auto=webp&s=dc4a20bccc42895475a4c313aebc8e71095874a0)\n\nPlease keep in mind as you peruse the sub, this week and always, that we are garnering some *highly esteemed* attention. And we deserve it!!! But we need to behave as the good apes do when Jane Goodall comes to teach. Don't you want to evolve to learn how to make crayon? Let's keep being excellent, reading, discussing ideas civilly, and evolving. Dr. T is watching.\n\n&#x200B;\n\n[Dr. T when she reads our sub](https://preview.redd.it/xkj494mgumv61.jpg?width=539&format=pjpg&auto=webp&s=2634aaa650b2e2743cf74143c534ca5851a4ca23)\n\nSo with that, here's u/Bye_Triangle with today's top story.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Top Story- Gamestop Completes At The Market Equity Offering\n\nYesterday was very exciting for everyone, that price increase was the perfect morale booster. Also a nice appetizer for what is likely to come next. Besides the pleasing price-action, something big was officially announced yesterday:\n\nNot only is GameStop now free from long term debt, but they have completed their aforementioned At The Market Equity Offering Program.\n\n&#x200B;\n\n\" Why is that a good thing? Sounds like they just sold a bunch of shares? \" - My wife's boyfriend\n\nVery astute of you to point out, well done.\n\n&#x200B;\n\nWell, this is a good thing for a bunch of reasons! First off, the capital raised from their ATM offering didn't go to paying off their debts, that was done with capital the company already had. GameStop sold their 3.5mil shares at an average price of $157 which means they raised a WHOPPING... $551,000,000.00 ,  All of which can go to funding all of the plans that Ryan Cohen and Co. have in store. Furthermore, the remaining debt that the company had, coupled with the concern over raising enough capital to actually pivot, were both key pieces of the remaining Bear-Thesis' for GME. With that out the window, there isn't any evidence that GameStop is bound for failure.\n\n&#x200B;\n\nSo let's quickly review:\n\n\\[✔\\] Debt Free\n\n\\[✔ \\] Name recognition\n\n\\[✔\\] Amazing, Competent Leadership team\n\n\\[✔\\] Clear path forward\n\n\\[✔\\] Funding for transformation\n\n\\[   \\] CEO + CFO\n\n\\[   \\] Predatory Short Sellers in jail\n\n&#x200B;\n\nGameStop is looking so hot right now 👀 Looks like just a few more matters to handle.\n\nThough, with the debt crushed, the capital raised, and the newly selected (and highly talented) board on its way... I personally find it harder and harder to find the risk here. Just as our boy Cat Not-a-cat u/DeepFuckingValue saw, many, many moons ago, there is a lot of value in GameStop.\n\nBack to you, u/pinkcatsonacid\n\n[Papa Cohen is debt free and swimmin in tendies](https://preview.redd.it/6c0qtvxiqmv61.jpg?width=1500&format=pjpg&auto=webp&s=ee31696febeb078de715f769c1ff0b80e22cf5aa)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# DTCC Liquidity test and the new SEC Filing\n\nSo the DTCC performed a liquidity test yesterday, and they also decided the minimum fund deposit requirement needed to be lifted from $10,000 to $250,000. What does that mean? (Edit: Earlier version implied a direct connection between the 2. [These comments](https://www.reddit.com/r/Superstonk/comments/mzl0dq/superstonk_daily_04272021/gw1c4jj?utm_source=share&utm_medium=web2x&context=3) help explain the procedure in more detail.)\n\nThis is an annual test (simulation), as outlined [here](https://www.dtcc.com/~/media/Files/Downloads/Clearing-Services/FICC/CCLF-Annual-Test-Reference-Doc.pdf). Basically it's a simulation of what happens to NSCC members if SHTF.\n\nSearching the DTCCs [Important Notices](https://www.dtcc.com/legal/important-notices?q=Capped+Contingency+Liquidity+Facility+Test&pgs=1), we can find out the following information on when they are usually held. Feel free to speculate in regards to the revert of dates back to April from August.\n\nYear\tDate\n\n2021\tApril 26th\n\n2020\tAugust 31st\n\n2019\tAugust 26th\n\n2018\tApril 23rd\n\n2017\tApril 24th\n\nThere are two parts to the test, part 1 dates are above, where all members from the Government Securities Division (think treasury securities) and Mortgage-Backed Securities Division’s (think 2008) need to partake.\n\nThe simulation of a member defaulting is performed in a non production environment (It won't affect any thing in the real world).\n\nWell the sim seems to me to have failed yesterday (LOL) and what do you know? We also got some shiny new [SEC Filings](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-005.pdf).\n\nBasically, hedgies have to keep more money in the bank to keep playing their games. And that money is up for grabs if they step out of line. (Plus a whole lot more).\n\n&#x200B;\n\n[All those minimum deposit requirements](https://preview.redd.it/xfv7a05v8nv61.jpg?width=726&format=pjpg&auto=webp&s=a5b9e1c8ef864ab9da9029f6142e875dd3ff57bb)\n\n# Automod Posting and Commenting Requirements\n\nOk listen, it's hard to steer a tight ship while also allowing you drunk ass sailors to run freely around the place, so we have had to come to some pretty strict requirements, at least until after MOASS. I've seen a lot of mod-mail about this, so let's break it down.\n\n## Automod is currently set to do the following:\n\n* remove **comments** by accounts less than **30 days old** or with less than **250 karma**\n* remove **posts** by accounts less than **60 days old** or with less than **500 karma**\n* remove posts and comments that violate our banned word list (the message you receive will have the word detailed)\n* some words are merely reported to mods since they are not always removable offensives (you won't notice this)\n* remove text posts if they don't have a minimum of 250 characters (about one paragraph)\n* change flair of \"DD\" or \"Possible DD\" posts to \"Discussion\" flair if they don't have a minimum of 2000 characters (about 8 paragraphs)\n* remove comments if they are longer than 1500 characters (about six paragraphs)\n* remove posts and comments that utilize cryptocurrency discussion unrelated to $GME - there are other subs for that and this removal stops a lot of spam\n\n[Don't have enough karma?](https://zapier.com/blog/how-to-get-karma-on-reddit/) Get out there and get to socializing a bit! 🦋\n\n&#x200B;\n\n[No speaky](https://preview.redd.it/crns4cgy1nv61.jpg?width=640&format=pjpg&auto=webp&s=45e94e8c6f24f3eb4550184dc74cdf7b557cf5b0)\n\nWe realize these rules kinda suck for some apes. That's why I'm providing the resources here to help you interact with the sub. But have you noticed how relatively quiet and peaceful it's been? That's because mods are working around the clock through some [crazy stuff](https://twitter.com/RedChessQueen99/status/1386463002363404290) behind the scenes to keep it clean.\n\nPink Cats don't do drama and I don't think we need to go into detail here of why certain conversations have been limited or banned. Everyone is requested to bring receipts if you're going to make claims in your post. Just like I did in my post [Blowing my Diamond Whistle.](https://www.reddit.com/r/Superstonk/comments/ms6yvq/blowing_my_diamond_whistle_as_a_highly_visible/?utm_source=share&utm_medium=web2x&context=3) We want to run a respectable sub with trustworthy resources for all apes.\n\n&#x200B;\n\n**We operate primarily through modmail, so if you see something sus, say something.**\n\n&#x200B;\n\nAs I said yesterday, I am reading through your comments, taking notes, and we are adapting to build a Superstonk platform that is **NON MONETIZED** and **RESEARCH DRIVEN.** I love this community and the only motivation I have is GME tendies and to see happy apes growing a wrinkle or 2. Also, THANK YOU SO MUCH for all the love yesterday. All the mods were overwhelmed with the love and support for the new daily format!\n\n&#x200B;\n\nThis place is a gem. It's no wonder they try so hard to tear it down. 💎💎💎💎\n\n&#x200B;\n\nhttps://preview.redd.it/km3w56dq4nv61.png?width=554&format=png&auto=webp&s=55b556e32fd6fa8eb96478021a5a8196b7b27d06\n\n**Be excellent to each other!!!**\n\nBe friendly, help others!\n\nas always we are here from all different walks of life and all different countries.\n\nThis doesn't matter as we are all apes in here, and apes are friends.\n\nDoesn't matter if you're a silverback a chimp or a bonobo.\n\nWe help each other, we care for each other.\n\n**Ape don't fight ape, apes help other apes**\n\n**This helps us weed out the shills really fast, as if everyone is helpful, the ones who aren't stand out**\n\nremember the fundamentals of this company are great, so for the love of god if someone starts with trying to spread FUD, remind yourself of the fundamentals.\n\nThere is no sense of urgency, this will come when it comes, be a week, be it a month be it six.\n\nWe don't care, just be nice and lets make this community as Excellent as we can!\n\n&#x200B;\n\n[HODL](https://preview.redd.it/i1fn7ie26nv61.jpg?width=650&format=pjpg&auto=webp&s=77699b152a2e2aa13afa399ea8bee23474d37260)\n\n&#x200B;\n\n**Links you should read if you have time:**\n\n[**https://www.reddit.com/r/Superstonk/comments/mz7c7h/put\\_anomalies\\_pt1\\_were\\_127\\_million\\_synthetic/?utm\\_source=share&utm\\_medium=web2x&context=3**](https://www.reddit.com/r/Superstonk/comments/mz7c7h/put_anomalies_pt1_were_127_million_synthetic/?utm_source=share&utm_medium=web2x&context=3)\n\n**Links to socials:**\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n**Edits**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_",
    "title": "Superstonk Daily 04-27-2021",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mzl0dq/superstonk_daily_04272021/"
}