{
    "author": "CuriousCatNYC777",
    "created_utc": 1620885440.0,
    "distinguished": null,
    "edited": 1620948208.0,
    "id": "nb9pon",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nb9pon",
    "num_comments": 2461,
    "permalink": "/r/Superstonk/comments/nb9pon/european_financial_news_is_reporting_major_margin/",
    "score": 21052,
    "selftext": "&#x200B;\n\nOriginal article: [https://www.money.it/Fed-repo-miliardi-Wall-Street](https://www.money.it/Fed-repo-miliardi-Wall-Street)\n\nTranslated from Italian to English using Google Translate (Italian Apes, feel free to correct)\n\n&#x200B;\n\n**The Fed has guaranteed repo for 400 billion in two days: what happens on Wall Street?**\n\nBy Mauro Bottarelli (Money.it)\n\n May 12th 2021\n\n*After yesterday's $181 billion, today another $209 towards 39 requesting institutions. Is someone running into margin calls that risk turning the snowball into an avalanche? Two clues: the greatest contribution to the record leap in inflation came from used cars (consumer credit). While the largest corporate bond ETF has just seen short interest soar over 20%. A tip: fasten your seat belts*\n\n&#x200B;\n\nhttps://preview.redd.it/g0g840rgtty61.png?width=680&format=png&auto=webp&s=1a3629686110ec4830068c0f6b54325eb8553d1a\n\nIt is not the deep red numbers of the indices that are scary, but what moves under the track. **After the 181.8 billion in reverse repo kindly guaranteed by the Fed** at zero interest to 28 financial institutions yesterday, it was repeated today. **Another $ 209.25 billion at 0% against 39 bidders.** In fact, in two days the Federal Reserve \"lent\" about 400 billion dollars to interest-free banks against collateral whose real mark-to-market seems to be implicitly priced in the crashes in progress. Translated further, **someone in the last 48 hours had to cover something.**\n\nMost likely, margin calls ready to explode. Exactly as happened overnight on the Taiwan Stock Exchange. There is no point in using polite euphemisms: **for two days in a row, someone on Wall Street was bailed out by the Fed.** And to do so they were forced to field just under half a trillion dollars. It means that what was about to happen was of enormous magnitude. The mind obviously runs to the wild leverage of subjects like ARK Investment or Ponzi schemes like that of Archegos or Greensill. In short, Level 3. But unfortunately, perhaps what is taking place is **the classic historical moment in which resorting to Occam's razor guarantees the most effective result.** Quite simply, the system is imploding from its excesses. And, even worse, the Fed is increasing its exposure in an emergency and forced attempt to plug the biggest holes.\n\nToday, **the US CPI figure made an impression, the highest since 1981 with its + 0.9% on a monthly basis against expectations for 0.3%.** But the disturbing data is contained in this graph:\n\n&#x200B;\n\n[Source: Pearkes](https://preview.redd.it/hwnu7vmrtty61.png?width=528&format=png&auto=webp&s=38b2ca1b3f751e0f2e1ea8815e113f0c30c1ebbc)\n\nfrom which it is clear that the greatest contribution to that leap comes substantially from the used car sector. **In fact, a critical multiplier within the real economy.** On the one hand, in fact, it acts as a proxy for the production difficulties in the \"new\" branch due to the shortage of semiconductors, on the other it shows the nefarious and immediate effects of the deluge of liquidity that rained down on the current accounts of millions of Americans with the federal check Biden pandemic support plan.\n\nFurther problem? **Consumer credit based on this trend is, in fact, securitized in real time:** when the frenzy of transfers through subsidies will end and purchasing power will be halved, what dynamics will be activated in the sector? **The mind runs to subprime mortgages.** But even worse is the scenario that this second graph shows us:\n\n[Source: Bloomberg](https://preview.redd.it/fltyylzutty61.png?width=1200&format=png&auto=webp&s=486bb2934b4e4eb95cdf63be55da63515c5ad41d)\n\nwhich shows how the largest ETF linked to corporate debt, iShares iBoxx $ Investment Grade Corporate Bond (LQD), a $ 41 billion colossus, **has just registered a short interest at 21.5% of the outstanding.** The boiling price is frightening credit investors, so much so that in the face of a $ 15 billion inflow in 2020, **the fund has already suffered $ 11.3 billion outflows since the beginning of the year.**\n\nExcessive fear? Maybe. But only on one condition can a trend similar to a passing jolt be realistically declassified: **a Fed that does not move an inch from its expansive profile.** And, indeed, you increase the value of the intervention. Otherwise, the pressure will become unbearable. And those 400 billion reverse repo put in place in the last two days, in the light of all this, appear more and more the canary in the mine of a credit event waiting to be revealed. On the other hand, i**t was precisely an overnight jolt in September 2019 that brought the Fed back into the field after ten years on autopilot:** it had to be a buffer intervention with repo auctions for a week. They turned into over seven months of billionaire tri-weekly allotments, in repo but also term mode. Dèjà vu, definitely dangerous?\n\nHOLY MOLY",
    "title": "European Financial News is Reporting Major MARGIN CALLS are Already Happening on Wall Street... and the Feds Have Quietly Issued Billions in Emergency Bail Out Loans to Financial Institutions Over the Past Two Days",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nb9pon/european_financial_news_is_reporting_major_margin/"
}