{
    "author": "LascarRamDass",
    "created_utc": 1620934411.0,
    "distinguished": null,
    "edited": 1620937789.0,
    "id": "nbp8ci",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nbp8ci",
    "num_comments": 4,
    "permalink": "/r/Superstonk/comments/nbp8ci/how_do_you_write_this_story_and_not_mention_keith/",
    "score": 8,
    "selftext": "[https://www.esquire.com/lifestyle/money/a36395893/wallstreetbets-investment-fortunes-gamestop-inside-story/](https://www.esquire.com/lifestyle/money/a36395893/wallstreetbets-investment-fortunes-gamestop-inside-story/)\n\nThe Fortunes Won—and Lost—in the Mind-Boggling Rise of r/WallStreetBets\n\n^(This is the inside story of how a bunch of bored, jaded Millennial dudes become expert investors and kings of chaos.)\n\n^(📷By) [^(John McDermott)](https://www.esquire.com/author/221761/john-mcdermott/)^(May 13, 2021)\n\nJames never paid much attention to the stock market. The 41-year-old has worked for 20 years at the same aerospace company in Cincinnati, coating jet-engine parts with a protective layer of aluminide. He lives in Cheviot, a working-class Ohio suburb just minutes from his childhood home. He’s not particularly emotive, and his goals in life are modest—his greatest ambition is to own a house of his own, maybe a new car. He is a thoroughly ordinary guy. But when lockdown orders were issued last spring and the economy cratered, James, a longtime Reddit user enamored with the swashbuckling environment of r/WallStreetBets, a subreddit for high-risk retail investors, saw an opportunity to turn a quick buck in the stock market. Less than a year later, his account in the mobile stock-trading app Robinhood had grown to $80,000. \n\nThis past January, WallStreetBets was the staging ground for a populist uprising against the financial establishment that took the stock market and media by storm. The news primarily revolved around GameStop, the struggling video game retailer, and how WallStreetBets pumped its stock price to unprecedented heights, nearly bankrupting institutional investors who had [shorted its stock](https://www.esquire.com/news-politics/a35339535/game-stop-stock-short-squeeze-explained/) in the process. In the months since, the prevailing narrative to emerge about WallStreetBets is one of renegade trolls waging guerrilla warfare by betting big on “meme stocks,” like GameStop. And it is that, but it’s also, according to financial experts, a historic reshuffling of power in the world of finance, one that gave the middle classes the ability to challenge Big Money interests and allowed everyday guys like James to amass life-changing wealth. The fallout from the mass trolling effort continues—WallStreetBets is still hyping up meme stocks—and if current political trends hold, it will fundamentally change how the industry is regulated.\n\nThis tectonic shift began in March 2020, when a bunch of bored, homebound, mostly millennial dudes turned to Reddit to learn how to trade stock options. Reddit has several groups (called subreddits and delineated with the prefix “r/”), such as r/investing and r/stockmarket, where [retail investors](https://www.investopedia.com/terms/r/retailinvestor.asp) can find the kind of sensible investment guidance you might receive from an Oppenheimer advisor: balanced portfolios filled with ETFs, S&P 500 index funds, blue-chip stocks, and the occasional hot stock tip. If those subreddits advocate investing like a boomer dad, then WallStreetBets is a swarm of rowdy bros playing out their wildest *Wolf of Wall Street* fantasies. When they aren’t throwing around offensive terms of endearment like “gay” and “retard,” they are encouraging each other to “go YOLO”—that is, wager their entire account balances on risky option plays. These bros have no interest in generating steady returns of 10 percent each year. They want to get rich fast.\n\nGetting rich fast appealed to James, who requested the use of his first name only. Air travel had dropped 50 percent due to the pandemic, and James’s work hours had decreased with it. In a matter of weeks, he went from saving up for a down payment on a home to living paycheck to paycheck. “My plans for the future just evaporated,” he says.\n\nOn April 21, 2020, James deposited $1,000 of his first federal stimulus check into Robinhood and started spending his free time at his kitchen table, drinking Mountain Dew and smoking Newport 100’s, scrolling WallStreetBets for inspiration, and executing trades on his iPhone SE. Within weeks, his Robinhood account value increased by thousands. “I was in disbelief I could make this much money in my off time pushing buttons,” he says. But his biggest win didn’t come until January 25, 2021, when he bought a single call option in GameStop for a $120 premium.\n\nOptions are attractive because they have essentially infinite upside. For a premium, a buyer can purchase the right, but not the obligation, to buy or sell a stock at a predetermined price within a specified period of time. If the price doesn’t move as anticipated, no big deal—all that’s lost is the premium (in James’s case, $120). But [they’re usually a sucker’s bet](https://twitter.com/GerberKawasaki/status/1361685408954769411). Three-quarters of options contracts [expire worthless](https://www.investopedia.com/articles/optioninvestor/03/100103.asp)—some finance professionals place that figure higher, at 90 percent—which is why, traditionally, only the most well-heeled investors dabbled in them. That power dynamic shifted to the people during the pandemic, and not just any people but the financial shitlords of WallStreetBets.\n\nTruth is, some of the WallStreetBets fellas were racking up six-figure account balances long before the GameStop short squeeze—it was almost impossible not to. The stock market initially took a dive in March 2020, when the world economy was brought to a screeching halt by quarantine orders. Then the Federal Reserve made it clear it would do anything to keep the U.S. economy afloat, including slashing interest rates to zero and injecting trillions of dollars into the arms of big business, inflation be damned. “[Printer goes brrr](https://knowyourmeme.com/memes/money-printer-go-brrr),” a meme mocking the Fed’s willingness to print infinite amounts of cash, became [something of a battle cry](https://www.reddit.com/r/wallstreetbets/comments/h7jgr8/i_guess_they_didnt_like_my_printer_goes_brrrrr/) for WallStreetBets investors. The monetary policy worked wonderfully, at least in terms of the stock market; it has been on a bull run ever since, and the Redditors who bought the Covid dip made thousands. Or in Brad’s case, millions.\n\nThe son of a cattle farmer, Brad’s primary motivation growing up was getting away from his family’s troubled, working-class existence. “When people think of people from small town Midwest, they either think of them as hard-working, salt-of-the-earth farmworkers, or as backward rednecks,” Brad, who requested the use of a pseudonym, says. “Half my family is the former, half is the latter.” Not only did Brad, 35, get out—he was the first person in his family to graduate from college—but he went on to attend a fancy East Coast med school. During his residency, he became enamored with Tesla, the electric car manufacturer headed by Elon Musk. (Musk, who’s long had a contentious relationship with Wall Street, [tweeted in support of WallStreetBets](https://twitter.com/elonmusk/status/1354891972406865922) once the subreddit started causing fits for the same financial institutions that had previously shorted Tesla.)\n\nBrad hated cars. He hated the smog they produced and the startling number of patients admitted to his hospital each year from car accidents. Tesla cars had zero emissions and used artificial intelligence to prevent collisions, and he was convinced the company would one day dominate the automobile industry.\n\nBrad signed his first hospital contract in spring 2018 and used the $10,000 signing bonus to start a Robinhood account. Options trading was a hobby at first. Brad wasn’t willing to spend more than $200 in premium on a contract, and he didn’t realize he could sell a contract if it was out of the money. “I just kinda learned on the fly,” he says. Some people thumb Instagram or check their fantasy football team when they have downtime at work. Between testing biopsy samples for cancer cells, Brad checked Robinhood and researched stocks. Emboldened by his early success, he bought dozens of call options on Tesla throughout 2019, and as Tesla stock soared, his hobby turned into an obsession. He started voraciously following stock tickers on his phone and posting to the r/teslainvestorsclub subreddit. By February 2020, his Tesla options were worth $1 million. Brad was a paper millionaire. Then the pandemic hit, the stock market fell off a cliff, and his account value shrunk to $300,000.\n\n Most people would have been devastated by a $700,000 loss, but Brad was elated. He had long been fascinated by [famed options trader Nassim Nicholas Taleb](https://www.esquire.com/lifestyle/money/a19181300/nassim-nicholas-taleb-money-advice/) and his musings on the nature of randomness. Taleb was one of the few investors to thrive during the 2008 financial collapse, carried by his [barbell investment philosophy](https://www.investopedia.com/articles/investing/013114/barbell-investment-strategy.asp). Medium-risk investments make no sense under the barbell method. Instead, Taleb argues people should be both hyper-conservative and hyper-aggressive, placing their investments on either end of the financial risk spectrum so they can simultaneously guard against and take advantage of rapid, unexpected change. The pandemic was the exact kind of outlier event Taleb adherents dream about. So Brad spent another $80,000 in premiums on Tesla call options. “I texted my wife, ‘We’re going to get really fucking rich off this,’” he recalls. \n\nThe highest compliment one can receive on WallStreetBets is to have “diamond hands.” A person with “paper hands” has a weak constitution. They exit their position the moment the market moves against them. A person with diamond hands rides out the swings. Brad’s hands were encrusted with jewels. Sure enough, Tesla’s stock price more than rebounded after the initial pandemic dip, and Brad’s account balance swelled along with it, to $7.8 million as of this writing. (He liquidated $1 million for a down payment on a 4,000-square-foot house in Denver.)\n\nBrad’s success puts him in an elite group of WallStreetBets users who have become bonafide millionaires during the pandemic. Others include u/dhsmatt2, aka “The Mattress King” of WallStreetBets, a 33-year-old guy from Salt Lake City who made [$4.7 million](https://www.reddit.com/r/wallstreetbets/comments/k3lsm6/feeling_cute_might_quit_my_job/) betting all his retirement savings on the mattress company Purple. Or u/Fog_, the WallStreetBets user who [turned $250 into $165,000](https://www.reddit.com/r/wallstreetbets/comments/bhs0qg/dis_250_to_165k_inspired_by_nvdia_puts_bro/) betting on Disney stock, lost 75 percent of his entire account balance, then made more than $24 million on Tesla call options. Even among this distinguished class, Brad stands apart. On December 5, 2020, he [posted](https://www.reddit.com/r/wallstreetbets/comments/k7anqp/200000_return_4_presplit_tsla_options_purchased/) a screenshot of his Robinhood account showing how he had turned $460 worth of options into a little less than $1 million, a 200,000 percent return. Many WallStreetBets members believe it is the single most successful trade in the history of the subreddit.\n\nThe promise of free money brought a million new members to WallStreetBets in 2020. As some of them have since learned, every gold rush inevitably goes bust.\n\nOscar, a 42-year-old litigation attorney in Los Angeles who is not identified by his real name, discovered WallStreetBets during the pandemic, but he had already been trading options for 10 years—and poorly at that. He’d made several comically bad calls, such as six-figure bets against Amazon and Netflix, only to watch those companies become two of the biggest in the world. He estimates he’s lost roughly $600,000 on options bets over the years, but the number’s so high he’s not even sure of the exact figure. For Oscar, though, this was the price of doing business. He figured he had to be willing to kiss away half a million dollars if he ever wanted to make enough money to escape the drudgery of middle class, workaday living.\n\nThat cavalier attitude made him a natural fit with the masochists of WallStreetBets, and their strange mix of aspiration and nihilism. As much as WallStreetBets loves a story about someone earning a 10 “X” return, it loves stories about massive losses more. “On any given day, 90 percent of the people on WallStreetBets are losing money,” says Michael Haupt, a former financial advisor who moderated WallStreetBets from 2019 to 2020. “People are laughing at each other, enjoying each other’s misery. It’s gallows humor.” Arguably no one is more responsible for shaping WallStreetBets’ sensibility than Haupt. Until the recent frenzy, he held the proud distinction of being the top poster of all time, [according to analytics site Subreddit Stats](https://subredditstats.com/r/wallstreetbets).\n\nBefore he ascended to WallStreetBets’ most decorated memelord, Haupt (his real name) was a genuine finance bro, working as a retail banker at Wells Fargo and later as a financial advisor at Morgan Stanley in Tampa. The jobs underwhelmed him. “You’re not allowed to have any vision at any of those brokerage houses. There’s no creativity, no risk. I was having a quarter-life crisis. *Is this it? Is this my life?*” he remembered. WallStreetBets provided an escape, a place to combine his interest in finance with his creativity and warped sense of humor. “I’d be in my office at Wells Fargo with the door closed, making huge plays on Robinhood, posting about it and laughing at my losses.”\n\nHaupt eventually gravitated to a more conservative investment style but found his calling as a WallStreetBets gif maker. His signature was adding finance terminology to TV clips and famous movie scenes, like one from *A Beautiful Mind* with [Russell Crowe portraying Elon Musk](https://www.reddit.com/r/wallstreetbets/comments/e1g3es/a_beautiful_design/), and “[I see dead hedge funds](https://www.reddit.com/r/wallstreetbets/comments/l6l6b2/i_see_dead_hedge_funds/),” a *Sixth Sense* parody of WallStreetBets short squeezing hedge funds. The posts racked up tens of thousands of upvotes and would frequently make it to the front page of Reddit, where they could be seen by users outside the WallStreetBets community. Fellow Redditors would send him messages like, “I put my dog down today, but your gif had me cry-laughing.”\n\nThat sense of humor would eventually put an early end to Haupt’s career. In November 2019, he wrote and filmed [a satirical CNBC interview](https://www.youtube.com/watch?v=l_R5853irU0) with two of his Morgan Stanley co-workers, a stunt for which they were promptly terminated. (The interviewee in the sketch, a stereotypical WallStreetBets character, twice mentions masturbating to photos of Elizabeth Warren.) The video was a hit on WallStreetBets, though, as it captured the group’s disdain for Wall Street elitism. “These are people who saw their parents lose their life savings, maybe lost their house. We don't have the reverence to those financial institutions our parents’ generation do. If anything, we have some resentment,” says Haupt. He now sells windows for a living and has no immediate plans to return to finance.\n\nFor WallStreetBets members like Haupt and Oscar, it wasn’t enough to just get rich playing the stock market—they had to dupe Wall Street in the process. “If I had just been basic and thought, *Girls look hot in Lululemon pants, Pelotons are fun, Chipotle burritos are popular, and Teslas are cool cars*, I would have tens of millions of dollars. I’d be retired already,” Oscar says. “But I have a thing of being right. And not just right, but contrarian right—right when other people were wrong.” Oscar’s antagonism was informed by being the only middle class student at his tony Los Angeles private school. Both his parents were educators. His friends, meanwhile, lived in enormous Beverly Hills manses and had second homes in Hawaii. “The pressure of having to make money your whole life scares me,” he says. “I don’t want to be retired, just barely getting by on a teacher’s pension.”\n\nThe opportunity to break free came in the form of BlackBerry, the former smartphone giant that you probably assumed was out of business but Oscar saw as grossly undervalued. BlackBerry, once the go-to device maker for serious business executives, had long since jettisoned its cell phone division to focus on cybersecurity and enterprise technologies, and specifically, operating systems for electric vehicles, an industry that was rapidly growing. (WallStreetBets, if you haven’t noticed, has a thing for electric cars.) Oscar spent $35,000 on Blackberry call options last fall. Little did he know BlackBerry would be one of the stocks that would fuel a revolution in retail trading.\n\nLate last year, a few enterprising WallStreetBets members pointed out that a lot of the meme stocks WallStreetBets members were long on, such as BlackBerry and GameStop, [were also being shorted by hedge fund investors](https://www.reddit.com/r/wallstreetbets/comments/k3gn91/people_pumping_gme_melvin_capital_management/). Not only could WallStreetBets members make tons of money, they realized, they could simultaneously pummel those bastards on Wall Street. By January, word got out that a bunch of [day traders](https://www.investopedia.com/articles/trading/05/011705.asp) were costing institutional investors billions. People poured into the subreddit with the hope of doing their part to bankrupt a few hedge funds. BlackBerry was one of the handful of companies the crowd rallied behind, and all the action pushed the value of Oscar’s BlackBerry calls to $1.8 million on January 27. By the end of trading the next day, half of his TD Ameritrade balance was gone. “I didn’t lose that money. It was stolen from me,” Oscar says of the $908,000 that evaporated from his account.\n\nAmid the turmoil caused by WallStreetBets, [TD Ameritrade and Robinhood had announced](https://www.esquire.com/news-politics/a35363149/why-robinhood-blocked-gamestop-wall-street-controversy/) they would no longer allow their users to buy shares of BlackBerry, GameStop, and other meme stocks. The announcements sent the share prices of those companies plummeting and caused an absolute uproar among day traders, as well as anti-establishment political and cultural voices. Everyone from Congresspeople Ted Cruz and Alexandria Ocasio-Cortez, to Dave Portnoy, the boorish founder of Barstool Sports, screamed about a mass, white-collar conspiracy between Wall Street and its Big Tech cronies to put down the WallStreetBets insurrection. Scatterings of protestors took to actual Wall Street in New York and street corners around the country. Oscar was understandably furious and channeled his frustration into posting “loss porn,” showing WallStreetBets a [screenshot of the colossal dip](https://www.reddit.com/r/wallstreetbets/comments/l7gz56/blackberry_loss_porn_robbery/) in his account value. “Even when we won, they found a way to change the rules and make sure we lost,” Oscar says of himself and his compatriots. “We were all victims of a crime that day.”  \n\n\nThe outrage eventually made its way to Capitol Hill, where on February 18, the House Financial Services Committee called on Robinhood, Melvin Capital (the hedge fund that shorted GameStop and [posted a 50 percent loss in January](https://www.cnbc.com/2021/01/31/melvin-capital-lost-more-than-50percent-after-betting-against-gamestop-wsj.html)), and Citadel Securities, an institutional investor that had both bailed out Melvin and paid Robinhood millions for the right to execute its users’ trades, to answer for any supposed collusion. Their testimonies all denied wrongdoing. Robinhood CEO Vladimir Tenev gave a non-apology, saying he was “sorry” about betraying his users’ trust but defending the company’s decision to halt trading. He even went so far as to suggest that the true culprit was overregulation. Robinhood only halted sales of meme stocks, Tenev said, to comply with capital requirements codified in Dodd-Frank, a law passed in the wake of the 2008 recession that aimed to prevent financial institutions from engaging in overly risky behavior. The irony was rich—Robinhood, a company named after the English folk hero who stole from the rich and gave to the poor, defending a decision that hurt retail investors to the benefit of hedge funds, by citing a piece of legislation intended to protect the everyday Joes on Main Street from the fat cats of Wall Street.\n\nFinancial experts are now re-examining Dodd-Frank’s weaknesses, and financial policy changes seem likely. At the very least, more Congressional hearings are scheduled. Maybe Oscar and the others who witnessed thousands of dollars vanish from their trading accounts will one day see justice. But the path forward for WallStreetBets is uncertain. Old-timers complain the subreddit is useless now that it’s gotten so big. Prior to the pandemic, it had 900,000 subscribers, and one could find actually thoughtful market analysis amid the juvenile shitposting. Now the group has 10 million subscribers trying to jump on the latest gold rush. Original members have splintered off into niche groups, such as r/wallstreetbetsOGs and r/WsbELITE, an invitation-only sub for serious investors. “WSB was a lot better before GameStop,” says The Mattress King, the Redditor who made a fortune buying call options on the mattress company Purple. “Before GameStop, you actually had people posting different opinions. Now you have everyone posting about the same two or three stocks.”\n\nWhile the rise of WallStreetBets has since been subject to endless concern-trolling about jaded, Extremely Online men gambling their savings away for a joke (which isn’t entirely untrue), others argue the subreddit unleashed seismic change. Institutional investors can no longer rely on due diligence; when evaluating a company, they must also account for the fickle hive mind of online retail investors, who can wreak havoc. One financial analyst, who spoke on the condition of anonymity, described WallStreetBets’ influence this way: Whenever he prepares a report for his boss, he includes WallStreetBets in his research.\n\nThat’ll certainly remain the case for the immediate future. In January, retail investors accounted for twice as much trading volume as the pre-pandemic average. That same month, WallStreetBets added more than 6 million new members. “WallStreetBets’ future as a market mover is pretty much cemented at this point,'' Haupt says. “The little guys have a seat at the table now. And it looks more like a throne the more you dig into the numbers.”\n\nJames doesn’t trade stocks much anymore; he doesn’t have the time now that his work has picked back up. But he was able to take advantage while the getting was good.\n\nThree days after James paid $120 for his GameStop contract in January, he sold it for more than $20,000. He’d earned enough by trading options during the pandemic to pull out $50,000, about two-thirds his annual salary at his factory job, and help his daughter’s mother buy a Ford Fusion. He jumped ship before the GameStop boom went bust. “I just got lucky,” he says, shrugging it off.",
    "title": "How do you write this story and not mention Keith Gill?",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/Superstonk/comments/nbp8ci/how_do_you_write_this_story_and_not_mention_keith/"
}