{
    "author": "Shaddowork",
    "created_utc": 1624870268.0,
    "distinguished": null,
    "edited": false,
    "id": "o9gaku",
    "text_only": true,
    "flair_text": "Stonky Pets 🐱‍👤",
    "name": "t3_o9gaku",
    "num_comments": 793,
    "permalink": "/r/Superstonk/comments/o9gaku/psa_do_not_buy_a_pet_ape_or_monkey_with_moass/",
    "score": 12769,
    "selftext": "Hi there - keen ape here, and I also happen to be a Great Ape Behaviour expert. Over the years I’ve conducted behavioural research in Western Zoos and in Africa both in the wild and in primate sanctuaries. Apologies that this is slightly off topic here compared to usual DD but there’s a potential problem I foresee happening after the MOASS that would absolutely break my heart, so I hope the mods allow me to share a bit of my knowledge to stop it happening.\n\nWe’ve already seen this year the Superstonk community wholeheartedly take on the ‘ape’ mantle, with incredible gestures such as the money raised through ape adoptions for the Diane Fossey foundation and other organisations. This was a really good thing, and if you want to help apes after the MOASS, I would strongly encourage such behaviour. \n\nWhat I would strongly discourage though is for anyone to take this a step further and buy a pet monkey or (perhaps even worse) a pet ape, something which sadly is still possible in many parts of the world through both legal and illegal avenues. \n\nThis is for a few reasons. Firstly, the illegal pet trade of primates is decimating wild populations across Africa, Asia, and South America. Most primates sold as pets are taken from the wild as babies when they are still easy to transport and not aggressive. Any adults found at the same time are killed and butchered to be sold as bushmeat. Many infant primates that are ripped from their families and smuggled across borders like this don’t survive, and those that do are often psychologically traumatised. Those sanctuaries I said I worked at in Africa - they specialised in rehabilitating great apes rescued in such circumstances. Each would need substantial care and treatment to recover, and though they are now in far better hands, many will never be able to be reintroduced to the wild again due to habituation around humans. A lot of the apes I observed showed behaviours suggestive of mental disorders in humans ranging from depression to PTSD, and these were the lucky ones. \n\nLeaving that aside, primates do not make for good pets, despite what you might see on YouTube and Instagram. They are animals with very complex social needs that you as a human cannot possibly fulfil alone. Unlike dogs or cats they are not domesticated, and will revert to aggression to solve issues as they would with their troop. There are many recorded instances of this occurring, sometimes (in the case of chimpanzees especially) fatally. I love chimpanzees - they are my favourite animal in the whole world. But I am under no illusion that they can be dangerous, aggressive, and violent when they think it necessary, and that includes if they think they can move up the dominance hierarchy by beating your ass. Many smaller primates that are sold have their teeth and claws removed to get round the aggression issue. This is extremely cruel and painful, renders them unable to eat properly, kills a good portion of those that have the procedure, and ultimately just maims an innocent animal for someone’s vanity. \n\nFurthermore a primate is not suited to life as a pet. They most often live in very large social groups, in vast territories offering a wide array of specialised dietary and life needs. Even a MOASS mansion can’t offer that, and the life they live would be much poorer and more sad as a result. \n\nTo finish - I love this community and I love how much we love apes. I have also been continually amazed at the levels of altruism and kindness shown on this subreddit. I know no good person would buy a pet primate if they had all the facts in front of them, but most people are unaware of why it is such a problem. So please do share this with anyone who might be interested, and help spread the word. This is the way!",
    "title": "PSA: Do not buy a pet ape or monkey with MOASS earnings",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9gaku/psa_do_not_buy_a_pet_ape_or_monkey_with_moass/"
}