{
    "author": "babyfacedjanitor",
    "created_utc": 1624317285.0,
    "distinguished": null,
    "edited": false,
    "id": "o58bmy",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o58bmy",
    "num_comments": 821,
    "permalink": "/r/Superstonk/comments/o58bmy/let_me_be_very_clear_and_concise_about_the/",
    "score": 12439,
    "selftext": "I want to make it very simple for you, apes;\n\n**If this market/economy were in a healthy place there would be no reverse repo.**\n\nThere would be no reason for institutions to throw ALMOST A TRILLION DOLLARS into it, AT INTEREST. \n\nBanks would not be basically throwing fucking loans and credit cards at people to take their liabilities off of their hands. \n\nHOUSING WOULD NOT BE 20-30% ABOVE ASKING PRICE. \n\nAlternate currencies would not be pumped and dumped CONSTANTLY and always on a fucking weekend as if being used BLATANTLY by liability dodging financial institutions and a complicit government who is afraid of people fleeing to an alternative when their inflation rates are consistently fucking high. \n\nApologies for this next bit, but I tend to speak softly- \n\nTHIS MONEY WOULD BE IN THE MARKET IF THE MARKET WERE HEALTHY. THESE INSTITUTIONS ALL HAVE SPECIAL CONNECTIONS AND VERY INTELLIGENT ECONOMIC SPECIALISTS. DO THE PEOPLE ON INSIDE JOB SEEM LIKE THEY WERE CAUGHT OFF GUARD?\n\n**THEY DO NOT TURN DOWN THE OPPORTUNITY TO MAKE MONEY IN THE MARKET LIGHTLY. THE OPPORTUNITY IS GONE**\n\nThey want to slow the velocity of money, and they want to stave off the inflation until their specific political agendas can be filled. \n\nWe need government to stand up and be HONEST. I am tired of being lied to and gaslit by dickheads in suits.",
    "title": "Let me be very clear and concise about the comments on today’s meeting. I am done with the lying bullshit from the US government. I am not tired of holding GME. I am tired of being lied to.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o58bmy/let_me_be_very_clear_and_concise_about_the/"
}