{
    "author": "nimrod8311",
    "created_utc": 1617974253.0,
    "distinguished": null,
    "edited": 1619088871.0,
    "id": "mngzp0",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mngzp0",
    "num_comments": 187,
    "permalink": "/r/Superstonk/comments/mngzp0/chasing_70_trillion_waterfalls/",
    "score": 2053,
    "selftext": "**\\*This is not advice, financial or legal, just another fellow ape searching for answers.**\n\nHi fellow Apes,\n\nAs excitement of the impending MOASS builds, numbers about the expected floor have been rising: \"$1m? Pffft. Floor is $10m now!\" \"What, Shitadel takes over r/gme? My floor is now $50m!\"\n\nThere have been amazing DDs covering the need for apes to hodl in order to push the squeeze to infinite levels, so I don't see a need to cover that topic of whether these floors are realistic. However, I have seen this question popping up a lot, which I haven't found an in-depth DD on: \"**Where will the money come from? Is there enough to pay every share of $\\[*****insert your minimum floor here*****\\]? Will it lead to a market crash**?\"\n\nIn response to that, many an ape with wrinkles on their brain have replied: \"Don't worry, the **DTCC** is **insured for $70 trillion** \\- even if the peak hits $20 million, that will only cost $5T based on [geometric mean](https://www.reddit.com/r/GME/comments/m9td6w/estimations_for_the_total_payout_of_gme_based_on/) \\- we can hodl for even more!\"\n\nWell, this is *literally* the $70 trillion question: **Does DTCC REALLY have $70 trillion to pay? If not, who will foot our bill to Andromeda?**\n\n&#x200B;\n\n**1.** ***DRAMATIS PERSONAE***\n\n**a. DTCC**\n\n[https:\\/\\/www.investopedia.com\\/terms\\/d\\/dtcc.asp](https://preview.redd.it/d8kzfh86t3s61.png?width=1232&format=png&auto=webp&s=7c3727e53e0d59416b32c5f4d7a167931bfc9795)\n\nThe vast majority of securities clearing and settlement and the custody of our shares is done by DTCC - in 2019 alone, it processed **$2.15** **quadrillion (Yes, QUADRILLION) in securities. Every day, DTCC processes more than $1 trillion in securities.** The ownership of DTCC is interesting: it is privately owned by the hundreds of banks, broker-dealers, who are participants and users of DTCC's services. This ingenious concept aligns the interests of DTCC with the interests of the main users of its services, who are key market participants. This is \"Inception\" level stuff: if the customer is the owner of the same shop, is the customer really a customer?\n\nAnyway, DTCC has several subsidiaries which perform different functions: with NSCC and DTC being the most relevant to this discussion.\n\n[https:\\/\\/corporatefinanceinstitute.com\\/resources\\/knowledge\\/trading-investing\\/depository-trust-and-clearing-corporation-dtcc\\/](https://preview.redd.it/w5fq50gu64s61.png?width=1540&format=png&auto=webp&s=f635b82e4025dd8c85ba6b71fe466451fe530e4e)\n\n&#x200B;\n\n**b. NSCC**\n\n[https:\\/\\/www.investopedia.com\\/terms\\/n\\/nscc.asp](https://preview.redd.it/0nf5ivnjx3s61.png?width=1262&format=png&auto=webp&s=e70ddff408cac29ac2118e55b33c0fde3441596b)\n\nEssentially, what NSCC does is multilateral netting for the U.S. securities markets. It allows all participants in the market to deal with one central counter-party (\"CCP\"), thereby increasing transaction efficiency and certainty, and reducing risk between all market participants. This means that the settlement of our GME trades will go through our brokers, who may in turn deal with market makers, who are most likely in turn to deal with NSCC as the CCP.\n\n&#x200B;\n\n**c. DTC**\n\n[https:\\/\\/www.investopedia.com\\/terms\\/d\\/dtc.asp](https://preview.redd.it/29xu84xjy3s61.png?width=1268&format=png&auto=webp&s=b5c9b2820c8d37569d6a51c3fef8ba344d0050b1)\n\nDid you know that in the past, your ownership of shares was evidenced by a paper share certificate? Obviously, trading paper shares with each other will severely hamper the transaction speed of publicly listed company shares, and with the advent of the internet, electronic share certificates could be held. To further increase the efficiency and speed of securities transactions, the central securities depository  is created to hold on to these shares. DTC is the central securities depository in the U.S., and when we buy and sell U.S. securities, DTC corresponding records the change in the owner of the share in its \"book\". According to the [DTC website](https://www.dtcc.com/about/businesses-and-subsidiaries/dtc), DTC retains \"custody of more than 1.3 million active securities issues **valued at US$54.2 trillion** as of 7/31/2017\".\n\n&#x200B;\n\n**d. Cede & Co**\n\nSeems straightforward right? Now, let's put a wrinkle in your smooth brain. While it is common to say that DTC acts as custodian for the shares, this is not strictly accurate. The entity holding on to the shares is actually an entity called **Cede & Co** (which supposedly came from shortening \"Certificate Depository\"). Cede & Co is a New York based partnership made of certain employees of DTC, and is supposedly structured as a partnership (instead of a corporation) in order for each partner to sign off on corporate matters quickly. However, in my view, the **real reason** for Cede & Co to be the custodian of **more than $54 trillion of securities** is risk management - after all, the real owners of these securities are the public who are trading them, and isolating these assets from the potential liabilities of DTC (which is exposed to the securities market through its participants) protects the public interest. We will come back to this \"ring-fencing\" of the securities in Cede & Co in a bit.\n\nThere are also other parties besides DTCC who are likely to play a part in the MOASS, such as Options Clearing Corporation (\"OCC\"), which is the clearing house for options. But to not overcomplicate matters, let's focus on NSCC and DTC as the main players.\n\n&#x200B;\n\n**2.** ***DTCC SETTLEMENT PROCESS***\n\nI won't go in depth into this process. All we need to know is that, when we hit the buy (or sell only after the MOASS 🚀🚀🚀 dip) button on our brokerage platform, this triggers a process whereby our broker will provide information up the settlement foodchain of this order, and ultimately to DTCC, who will then through NSCC (in relation to payment and netting clearance) and DTC (in relation to transfer of ownership) to settle the transaction. Currently, this whole process generally takes up to T+2 days for settlement. Greater detail on this process can be found [here](https://www.dtcc.com/understanding-settlement/index.html). However, for this discussion, it is sufficient for us to know that both NSCC and DTC will be involved in the settlement process.\n\n&#x200B;\n\n**3.** ***PASSING THE BUCK DURING MOASS - THE \"LOSS ALLOCATION WATERFALL\"***\n\nNow, we come to the meat (or bananas, since we are apes) of our discussion. **What is likely to happen at DTCC just prior to and during MOASS?** Let's try to break this down as simply as possible:\n\n**Step 1: DTCC takes further steps to manage risk**\n\nThis is where the DTCC currently seems to be at - there have been many DDs on the various filings NSCC and DTC have made to prepare for a potential default, so I will not go into this. This includes NSCC-2021-801 / NSCC-2021-002, which gives NSCC the right to ask for further collateral through Supplemental Liquidity Deposits (\"SLDs\") on **a daily rather than monthly basis** and DTC-2021-003, which requires DTC participants to provide daily reconciliations of their activities, eliminating a loophole taken advantage by participants previously to submit monthly reports.\n\n**The most significant DTCC filing for me is NSCC-2021-004 and DTC-2021-004** which are amendments to the **Recovery & Wind-down Plan** of DTCC's key subsidiaries, including NSCC and DTC. As stated in the NSCC-2021-004 (pp 3-4):\n\nhttps://preview.redd.it/y2hhwpp5j4s61.png?width=1032&format=png&auto=webp&s=c0f87d0049ed2f8a3bfaf3a3786746dc5766efc5\n\nhttps://preview.redd.it/udgx35mfi4s61.png?width=1066&format=png&auto=webp&s=e7ecfcf01a3bc943daefd193179d46336865d440\n\nThis is basically DTCC's doomsday prep for the MOASS and the **clearest indicator yet that DTCC is fully aware of the incoming MOASS. Why would you relook and amend your doomsday plan unless you believe doomsday is on the horizon?** \\[Edit: For a more in depth look at 2021-004, please see u/Leaglese excellent DD [here](https://www.reddit.com/r/GME/comments/mdc40j/dtcc_recovery_and_wind_down_rw_procedure_dd/).\\] Unfortunately, the details of the R&W Plan (Exhibit 5 to the filing) are confidential and not disclosed in the filing, so I am unable to analyse it in depth. I can, however, analyse what the NSCC and DTC rules and their risk disclosure frameworks allow them to do - this is covered below.\n\n&#x200B;\n\n**Step 2: Default**\n\nNSCC and DTC have broad discretion to hold that Members (for NSCC) / Participants (for DTC - they both use different terminology to refer to the same parties) are in default, and this is most likely to occur once a catalyst occurs at GME (perhaps 420 share recall or 69 AGM RC's appointment as Chairman of the Board) and the price of shares skyrockets, resulting in increasing FTDs, margin calls, the Participant being unable to perform its obligations to NSCC and DTC. This is the start of the MOASS, and when NSCC and DTC call default (under Rule 46 of NSCC rules and Rule 9(B) of DTC rules), this will add light speed fuel to the rocket\n\n&#x200B;\n\n**Step 3: Application of Clearing Funds**\n\n**Step 3 onwards is important.** Each Member / Participant is required to make a prior deposit to the Clearing Fund (calculated based on a formula) in the form of cash or securities. This is used to secure each Member / Participant's obligations to NSCC / DTC.\n\n**A. In a default situation, NSCC / DTC can call upon the Fund Deposits made by the defaulting Member / Participant to satisfy any outstanding.**\n\nB. B and C below are unique to DTC (and not NSCC). If there are still outstanding obligations owing (ie. insufficient collateral to pay off the shortfall), DTC can call on the whole Clearing Fund (ie. the total Fund Deposits by all Members / Participants) to pay.\n\nC. In addition to B., DTC can also use (i) any retained earnings or undivided profits they have or (ii) any other liquidity resources that they have (this includes the Credit Facility which DTC is looking to renew on 4 May 2021 (see NSCC-2021-802)).\n\nAlso note that, as DTC and NSCC are separate entities, they would not bear the other entities' liabilities apart from where they have provided certain limited cross-guarantys (from the cross-guarantys I found, it appears limited to using any deposits / collateral provided by a defaulting Member / Participant to one entity, to set-off liabilities of the other).\n\n&#x200B;\n\n**Step 4: LOSS ALLOCATION WATERFALLS**\n\n**Now comes the interesting part. MEMBERS / PARTICIPANTS WILL BEAR THE LOSSES AND LIABILITIES STILL OUTSTANDING AFTER STEP 3 ABOVE. DTCC calls this the \"Loss Allocation Waterfall\".** NSCC Rule 4 section 4 at page 44:\n\nhttps://preview.redd.it/dcjym228w4s61.png?width=1066&format=png&auto=webp&s=a4b04361af7000e632c69e16fcaa689187f2ae3b\n\nDTC Rule 4 section 5 at page 42 is equivalent to the above. **Corporate Contribution is a fixed calculated sum which NSCC / DTC has set aside in a separate account to pay, but if there is still outstanding after that Corporate Contribution, ALL REMAINING LOSSES WILL BE APPLIED PRO-RATA TO ALL MEMBERS / PARTICIPANTS. These guys are going to be the ones at the bottom of the waterfalls if NSCC / DTC do not have sufficient money to pay all outstandings.**\n\n&#x200B;\n\n**4.** ***LIQUIDITY CALCULATIONS***\n\n***But, DTCC is insured for $70 trillion right?***\n\nWell, no. NSCC and DTC's only recourse in the event of default by Members / Participants is that set out above. I have not found any mention of third party insurance provided to DTCC in any official document. If you know of such a document, please let me know. \\[Edit 1: To be clear, Rule 34 of NSCC and Rule 14 of DTC Rules do provide for insurance coverage, but this does not appear to apply to default situations of Members / Participants. Likely to be more usual insurance coverage, such as natural disasters, accidents.\\]\n\n**So how much does NSCC / DTC have?**\n\nBased on Annual Financial Statements for the Year ended 31 December 2020:\n\n**NSCC**\n\n|***Clearing Fund***|***$12,972,776,000 (i.e. $13 billion)***|\n|:-|:-|\n|***Commercial Paper***|***$3,843,290,000 (i.e. $3.8 billion)***|\n|***MTN Notes***|***$3,723,942,000 (i.e. $3.7 billion)***|\n|***Credit Facility***|***$10.9 billion (to be reduced to $10.1 billion under NSC-2021-802)***|\n|**Total**|**$31.4 billion**|\n\n&#x200B;\n\n**DTC**\n\n|***Clearing Fund***|***$1.9 billion***|\n|:-|:-|\n|***Credit Facility***|***$1.9 billion***|\n|**Total**|**$3.8 billion**|\n\n***But, doesn't DTC have $54 trillion of securities in its custody?***\n\nDTC does not have these assets on its balance sheet and Financial Statements. It is Cede & Co that is the entity who holds these securities and as mentioned above, Cede & Co is a completely different entity that is ring-fenced from DTC.\n\n***The above figures are only as at 31 Dec 2020 though...***\n\nThis is a good point - as seen above, DTCC has been taking steps to call for more margin under the Clearing Fund (it seems to have done so for RH back during the baby squeeze in Jan 2021, as per VT's claims of DTCC asking for $3b in margin but ultimately settling for less). **If and when the SLD in NSC-2021-002 come into effect, the Clearing Fund and SLD may be significantly more than the 31 Dec 2020 numbers and can make a bigger difference.**\n\n***So does that mean that the Members / Participants are likely to have to bear insane losses if we hit Andromeda?***\n\nI really don't think so, because I believe the Fed will have no choice in such a scenario, like in 2008, but to step in rather than have FIs suffer huge losses.\n\n&#x200B;\n\n**5.**  ***THE FED***\n\nDTCC's key subsidiaries: NSCC, DTC, and the Fixed Income Clearing Corporation (FICC), and OCC are 4 of the 8 **Designated Financial Market Utilities by the Fed.** What does that mean?\n\n[https:\\/\\/www.federalreserve.gov\\/paymentsystems\\/designated\\_fmu\\_about.htm](https://preview.redd.it/utbc5hev35s61.png?width=1404&format=png&auto=webp&s=57e9f1ae6348bb5ea65b54eaf500523f43de8c93)\n\n**What can the Fed do?**\n\nThe Fed has the power, under sec 806(b) of Title VIII of the Dodd-Frank Act, to \"to provide to a designated financial market utility discount and borrowing privileges\", but only in :unusual or exigent circumstances\". If a situation arises that threatens not just the DTCC and its subsidiaries, but also Members / Participants (i.e. the banks and key financial institutions), I believe that the Fed will have no choice but to step in, because the failure of NSCC, DTC, OCC as the central counter parties to most of the securities and derivatives trading in America, would have unprecedented and catastrophic consequences in not just America's but the global economy. \n\n\n&#x200B;\n\n**6.** ***FINAL THOUGHTS***\n\nI was first drawn to this topic because I wanted to see how the DTCC rules would affect the MOASS playing out - and it has led me down this rabbit hole. While NSCC / DTC rules indicate that they look to resolve all outstandings within the day in order to maintain an orderly market, I believe that the MOASS will significantly stress the systems that NSCC, DTC and OCC have, especially if the squeeze is not related to GME alone, but AMC and the other shorted stocks. There is likely to be much ups and downs and long halts as they seek to implement their rules, and this will last many days and impact other parts of the market too. The good news however, is that DTCC appears to be preparing for this scenario, and hopefully even engaging actively with SEC and the Fed on worst case scenarios already.\n\n**In any event, the position remains the same: HODL and diamond hand. Remember, its not the Apes who caused the situation, but the refusal of the SHFs to admit defeat and bear their losses. 🦍🦍🦍💎💎💎**\n\n&#x200B;\n\n🚀🚀🚀 **TDLR: DTCC will have to pay whatever it needs to pay - so HODL AND DIAMOND HANDS TILL ANDROMEDA still applies. However, the money will be coming from (a) the banks and broker-dealers as members of the DTCC and its subsidiaries, and/or (b) the Fed. There is** **NO** **magical $70T pot of gold in insurance or liquid funds.**\n\n**Edit 2: If you'd like to understand the NSCC R&W Plan in greater detail, do check out my other DD: https://www.reddit.com/r/Superstonk/comments/mq0dln/the_crisis_continuum/**\n\nEdit 3: Cleared up the reference to SLD for RH during the Jan squeeze. SLD in NSC-2021-002 has not been implemented yet, and so the margin call for RH must have been under general margin for the Clearing Fund.\n\n**Edit 4: Corrected the Fed's power under the Dodd-Frank Act, they can bail out directly.",
    "title": "Chasing $70 Trillion Waterfalls",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/Superstonk/comments/mngzp0/chasing_70_trillion_waterfalls/"
}