{
    "author": "JustBeingPunny",
    "created_utc": 1617980217.0,
    "distinguished": null,
    "edited": 1617992305.0,
    "id": "mnizvo",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mnizvo",
    "num_comments": 75,
    "permalink": "/r/Superstonk/comments/mnizvo/paging_uatobitt_you_needed_some_help_with/",
    "score": 1808,
    "selftext": "&#x200B;\n\n# EDIT - POST ATTACHED - [CONVERTIBLE BONDS](https://www.reddit.com/r/Superstonk/comments/mmz5yx/convertible_bonds/) FROM u/ATOBITT\n\n&#x200B;\n\nI started going down the rabbit hole of convertible bonds and boyyyyy are you on to something u/atobitt\n\n&#x200B;\n\n&#x200B;\n\n**TA;DR - SO, you want an ELIA? I think** u/atobitt **is going to do a DD on this and he'll explain it much better than I.**\n\n**But for the meantime lets ape it down;**\n\n&#x200B;\n\n* A convertible bond pays fixed-income interest payments, but can be converted into a predetermined number of common stock shares.\n* The conversion from the bond to stock happens at specific times during the bond's life and is usually at the discretion of the bondholder.\n* A convertible bond offers investors a type of hybrid security that has features of a bond, such as interest payments, while also having the option to own the underlying stock.\n\n&#x200B;\n\nYou buy the bond, you get interest on the bond and at specific points, you can convert that bond into stock of the company. It's effectively a bond with a call option on the stock.\n\n&#x200B;\n\n*As an example, let's say Exxon Mobil Corp.* [*(XOM)*](https://www.investopedia.com/markets/quote?tvwidgetsymbol=xom) *issued a convertible bond with a $1,000 face value that pays 4% interest. The bond has a maturity of 10 years and a convertible ratio of 100 shares for every convertible bond.*\n\n*If the bond is held until maturity, the investor will be paid $1,000 in principal plus $40 in interest for that year. However, the company's shares suddenly spike and are trading at $11 per share. As a result, the 100 shares of stock are worth $1,100 (100 shares x $11 share price), which exceeds the value of the bond. The investor can convert the bond into stock and receive 100 shares, which could be sold in the market for $1,100 in total.*\n\n[link](https://www.investopedia.com/terms/c/convertiblebond.asp)\n\n&#x200B;\n\n# Arbitrage\n\n&#x200B;\n\n**Arbitrage** is the simultaneous purchase and sale of the same asset in different markets in order to profit from tiny differences in the asset's listed price.\n\n&#x200B;\n\nSo basically what Kenny would do is take both positions in Convertible bonds and the actual stock.\n\n&#x200B;\n\nIf the stock goes down - Kenny has a short position, he's fine\n\nIf the stock goes up - Kenny has convertible bonds that he can convert to actual stock to sell for a profit.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nSo...\n\nEDGAR was pretty easy to find anything relating to convertible bonds and Citadel. Just type in 'convertible citadel' into EDGAR and every filing that mentions both Citadel and the word convertible shows up.  That sounds extremely patronising (I don't intend it to be!).\n\nFunny how when I do this, all of these wonderful therapeutic companies show up....\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/iwiyk5jov5s61.png?width=1899&format=png&auto=webp&s=3cab9d4a6a10bbe1f1a1b7d8ac941979241a1327\n\n&#x200B;\n\n&#x200B;\n\nSecondly, I'm not sure if you're looking into it from this angle but **Convertible Bond Arbitrage** is what made Kenny G a very rich man in the late 80's. I'm still trying to wrap my head around it but I believe the information would be much easier for a wrinkled brain like you to digest. Here some of the answer I found by digging into Ken and convertible bonds.\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nIn answer to your question “**Why was Ken Griffin so successful with his convertible bond arbitrage strategy in 1987?”**\n\nI’m glad you asked WHY he was so successful with convertible arb. Because of the reasons or what made the trade possible.\n\n**CONVERTIBLE ARBITRAGE TRADE**\n\nI worked for an arbitrage firm in the early 80s, so in answering your question, I’ll also describe the markets at that time. Convertible Arb was “classic arbitrage” where the trader bought the convertible bond and shorted the common stock - the difference between the value of the bond and the value of the stock (amount sold = the conversion ratio of the convertible bond), resulting in a profit.\n\nIn the 1970s - early 1980s, with the stock market depressed and interest rates high, very few retail clients purchased converts. Without that demand, the convertible bonds tended to trade cheap. It was this type of misalignment in value which presented the arbitrage. Which made good money until 1982.\n\n**DOW RALLIES, CONVERTIBLE BONDS FOLLOW**\n\nIn March 1982, the dow began a multi-year rally, more than doubling from 2170 to 5768 in October 1987. Interest rates started to go down from the highs of 1981 (30 yr treasuries traded as high as 14% in 1981 and as low as 7 1/4 in 1986).\n\nAgainst this market backdrop, investors began purchasing convertible bonds again. This narrowed the spread, leaving little arbitrage opportunity.\n\n**THE CRASH OF 1987, WHERE KEN GRIFFIN COMES IN**\n\n**Then in 1987, when the market “crashed”, convertible bonds sold off much more than the common stock. The convertible bonds became so cheap relative to the common stock the arbitrage window opened again and Ken Griffin was clever enough to notice this and have the capital to commit to the trade.**\n\n**After the crash in 1987, stocks restarted their climb higher bringing back demand for the convertibles. In this market, Ken reversed his position, locking in a substantial profit.**\n\n**POST CRASH MARKET DYNAMICS**\n\nThe demand for convertibles grew from there. As mutual fund company’s opened convertible funds and real investors were holding the bonds long term.\n\nOnce again spreads narrowed, leaving little arbitrage opportunity on the table. By 1999 most convertibles traded at a hefty premium to the common stock. Convertible Bonds have hybrid benefits from both the stock & bond markets and both markets rallied during that time.\n\n**SUMMARY**\n\nKen Griffin, in 1987 recognized the market sell-off caused convertibles to weaken relative to the common stock and put on the “classic arb” of long convertibles and short stock.\n\nHe waited until the spread between the two normalized (narrowed) and reversed position. Locking in his profit. Clever man, Mr. Griffinn is. Clever man, indeed.\n\n&#x200B;\n\n# \n\n# AND\n\n&#x200B;\n\nIn many “stock market crashes” the principle reason for the dramatic decline is liquidity. An otherwise relatively normal down day becomes a disaster as more and more people decide to sell and less people want to buy, driving prices down rapidly and encouraging the cycle to continue. [Image](http://image.minyanville.com/assets/FCK_Jan2013/images/Josh/buysell.jpg)\n\n&#x200B;\n\nhttps://preview.redd.it/3fwoyuv4w5s61.png?width=602&format=png&auto=webp&s=9b5a59254cdc4b592ac338243f9557edfa10e15b\n\nIn 1987, convertible bonds declined more than the underlying stock for this very reason. The market for these bonds was a lot smaller than the market for the stock (generally the more specialized the product the smaller the market), so any sellers were essentially looking into a blank void of buyers. They had to lower their ask to pretty obscene levels just to tempt somebody to take the bonds off their hands. In hindsight this seems foolish but once the market is down 10%+ in a matter of minutes rational behavior tends to fly out the window.\n\nKen Griffin may have had on what’s referred to as a [Chinese Hedge](http://www.investopedia.com/ask/answers/09/chinese-hedge.asp) whereby he was short the convertible bonds and long the underlying stock, in anticipation of collecting a small premium so long as the stock price doesn’t fall (if a convertible is a bond + equity option, then as time passes the equity option will expire worthless- thereby driving down the price of the convertible over time even if the stock price stays flat).\n\nIronically, he would have been short vol due to this and only ended up with a profit (instead of a massive loss) because the market fell **so much** that the comparatively small liquidity on his short bond position saved his long stock position. In other words, he likely would have lost a lot of money if the market had fallen only -5% or -10% but was saved because the market fell -20%. If this is indeed what happened, then it would seem the reason for his profit in 1987 was merely a stroke of luck.\n\n&#x200B;\n\nWRINKLESSSS\n\n[link to the above](https://www.quora.com/Why-was-Ken-Griffin-so-successful-with-his-convertible-bond-arbitrage-strategy-in-1987)\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**I'll just be adding on as much information as possible for you to hopefully reference through and pick out anything valuable. Should stop incessant scouring across the web.**\n\n&#x200B;\n\nIn one filing, convertible bonds are also referenced as ***Equity linked securities***\n\n*“equity-linked securities” are to any debt or equity securities that are convertible, exercisable or exchangeable for shares of our Class A common stock issued in connection with our initial business combination including but not limited to a private placement of equity or debt;*\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nCitadel seems to have a big holding Bolt Therapeutics and convertible bonds\n\n&#x200B;\n\nhttps://preview.redd.it/chvq5h6i76s61.png?width=816&format=png&auto=webp&s=1afcdb0a1286a431eafb2a3d4b7ecb4f6de0a8c1\n\n# \n\nhttps://preview.redd.it/dii68g7s76s61.png?width=871&format=png&auto=webp&s=c49ec1f195b27fc16a87bf5e046b76f5b1db079e\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "Paging u/atobitt - You needed some help with convertible bonds?...",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mnizvo/paging_uatobitt_you_needed_some_help_with/"
}