{
    "author": "International_Gold20",
    "created_utc": 1615864796.0,
    "distinguished": null,
    "edited": 1615873069.0,
    "id": "m5zt6n",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m5zt6n",
    "num_comments": 97,
    "permalink": "/r/GME/comments/m5zt6n/citadel_did_not_issue_60_billion_worth_of_bonds/",
    "score": 849,
    "selftext": "So, I've seen multiple posts reference this $60 billion number, but it's not correct. I point this out because **I want every one of my fellow equity owners to make smart decisions based on objective truths and accurate information.**\n\n***The better informed each of us are, the more likely we are to make the appropriate individual decisions that will maximize our profits and help the company grow.***\n\nHonestly, I went back and forth about whether to even create a post about this, but then I thought about how this misinformation might be used against retail. If the hedge funds can make us argue amongst ourselves about something relatively trivial such as the true amount of money they raised by selling bonds, then that's a small victory for them.\n\nIt could also help fuel comments like, *\"how could we possibly win against an entity that just raised $60 billion dollars, boo hoo hoo...\"* or other pathetic shit like that.\n\nOr maybe it really doesn't matter and I'm just wasting my time. Oh well, I would just be huffing gasoline under a bridge if I wasn't doing this. So, why is the $60 billion number incorrect?\n\n**Here are some links to help apes understand:**\n\n[How to read bond information](https://www.dummies.com/business/accounting/auditing/how-to-read-bond-information/) As you can see \"...the *volume* describes the total value of all bonds of a particular type being sold. So if someone were to issue and successfully sell ten bonds worth $10 each, the volume would be $100 during that time period.\"\n\n[Definition of bond \"issue size\" and other terms](https://www.thebalance.com/bond-basics-417057#:~:text=The%20issue%20size%20of%20a,of%20the%20entity%20issuing%20the)  \"The issue size of a bond offering is the number of bonds issued multiplied by the face value. For example, if an entity issues two million bonds with a $100 face value, the issue size is $200 million dollars.\"\n\n[Definitions again, including \"issue volume\" (which is the same as \"issue size\")](https://joolgroup.com/jool-academy-the-corporate-bonds-terms/)  You can see in their example table/image they list **\"SEK 200 m (or equivalent in NOK/EUR)\"** aka, 200 million Swedish Krona's worth of bonds, or the equivalent value in Norwegian Krones/Euro\n\n[Report about $600 million in bonds being issued](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/hg-bonds-citadel-finance-places-600m-of-notes-in-bond-market-debut-terms-62989441) This report literally states that Citadel is issuing $600 million in bonds.\n\nRemember, one must maintain a healthy degree of skepticism when faced with such a desperate, dishonorable, and wealthy opponent. Trust no one, least of all me. I'm just a half-hillbilly half-ape who drinks too much moonshine mixed with antifreeze and used cat litter.\n\nI look forward to seeing you all in Valhalla.\n\n💎🙌🦍💪✌🚀\n\nTL;DR: *Issue size* or *issue volume* refer to the **total** value of the bonds being issued. So the \"Issue Volume\" in the image below refers to 600,000,000 USD (U.S. Dollars) worth of bonds, not 600 million actual bonds.\n\n[Issue volume: 600 million \\(aka 600 million USD\\)](https://preview.redd.it/vquro4855bn61.png?width=845&format=png&auto=webp&s=f5049d484b5b94f40d4abb76ea8f82306fed47fb)\n\nEdit: u/sped2500 points out in the comments that these bonds are only rated BBB, as you can see in the last link above. I haven't seen any information about how many of these have actually sold, so I can't say how much capital Citadel has actually raised, just that it could be no more than $600 million.\n\nEdit 2: Thank you u/fakename5 for the minor correction. The bonds were rated as BBB-, so they just barely missed being classified as “junk” bonds. \n\n[Bond Ratings](https://www.fidelity.com/learning-center/investment-products/fixed-income-bonds/bond-ratings) \n\nA big, bad hedge fund like Citadel can't get a better bond rating than BBB-?",
    "title": "Citadel did NOT issue $60 billion worth of bonds. It is $600 million worth of bonds.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m5zt6n/citadel_did_not_issue_60_billion_worth_of_bonds/"
}