{
    "author": "word_speaker",
    "created_utc": 1621827413.0,
    "distinguished": null,
    "edited": 1621854376.0,
    "id": "njon3g",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_njon3g",
    "num_comments": 65,
    "permalink": "/r/Superstonk/comments/njon3g/been_seeing_posts_on_other_nongme_related_subs/",
    "score": 1953,
    "selftext": "I understand how apes feel when apes see others missing out on the situation with GME and how people outside of this and related subs are out of touch and ignorant about what’s happening. \n\nApes can help those who are in need post MOASS with all the gains. I have no doubt that many of the apes in the forum will in fact do what they can with their newfound wealth to make the world a better place. But rn, there is no need to convince others in unrelated subs to join the fight. Apes most likely already own multiple times the float. \n\nLike many have seen before, they’ll call apes of this community idiots, shit on the god tier DD’s, question the motives of the AMA’s, point to shitposts and non-DD’s, call apes **cultists**, etc. But they can’t back their claims bc they most likely have no idea about what’s going on with GME.\n\nThose who know and have been following this situation closely know all the fuckery that’s been going on and have more knowledge and understanding than those on the other subs. When the time comes, trust me, FOMO will kick in. Like with Dr. Burry and DFV, the apes time will come. \n\nTL;DR: \n\nJust wanted to say that there is no need to try to convince folks on the other subs to join in on GME. I know the intentions are good and want to educate and help others. Apes can do that with the new found wealth post MOASS. Take care of yourselves and your loved ones first.\n\n\nAll that is required is to\n\n **BUY HODL VOTE** 💎🙌\n\n\nThank you ❤️\n\nEdit: \n\nA warm welcome to all those who have decided to join the apes in this journey!! Please take the time to read the DD’s in support of the MOASS theory, which brokerages are safe to use, FUD tactics, how to protect new found wealth, direction the company is headed towards etc. and make your decisions based on your own due diligence. \n\nAlso, please don’t get me wrong, apes don’t alienate potential apes. Remember the message to be excellent to each other!!",
    "title": "Been seeing posts on other non-gme related subs about the situation with MOASS. Most of them don’t know much about it and will argue with you calling you a cultist. We don’t need to convince anyone about GME. FOMO will kick in when time comes. Just follow the golden rule, BUY HODL VOTE💎🙌",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/njon3g/been_seeing_posts_on_other_nongme_related_subs/"
}