{
    "author": "ButtFarm69",
    "created_utc": 1626558338.0,
    "distinguished": null,
    "edited": false,
    "id": "omdh53",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_omdh53",
    "num_comments": 1369,
    "permalink": "/r/Superstonk/comments/omdh53/buckle_the_fuck_up_new_changes_in_the_moderating/",
    "score": 2971,
    "selftext": "[Read this first. Statement from Bye Triangle](https://www.reddit.com/r/Superstonk/comments/omdfg4/everythings_fucked_up_and_there_are_no_good/)\n\nhttps://i.redd.it/5owoyoim8ub71.gif\n\nGod fucking dammit, what a dumpster fire this week has been. From the Red/Pink/Madie fiasco, to the Ape Fest, and then to the random dude starting that gofundme for Wes…it has been exhausting and I know you guys want some answers. Detective ButtFarm did some digging and I wanna lay it all out for you.\n\n**Red/Pink/Madie situation:**\n\nRed has stepped down as an admin and has been demoted to a regular mod. She will also be taking a leave of absence. She has been here since the beginning, putting so much into this community and we would not be where we are today without her. But with that said, many of us have lost faith in her ability to effectively lead the sub after how she mishandled herself on multiple occasions and there needs to be consequences. We will figure out how to move forward from this point.\n\nPink was a spicy flamethrower kitty and she was banned because she sent out doxxing material which is against the rules. With that said, having her rejoin the mod team is not in the best interest of moving forward. Pink, you’ve done a lot for the community and I truly do appreciate the impact you've had all these months. Take care, friend.\n\nI think Madie was misunderstood amidst all of the crossfire. I have to get to know her myself to fully get a grasp of the situation. But here are some facts: Madie had different ideas in the early beginning about stocks than us, she changed her mind, and has now lent us her expertise. I don’t wanna doxx her too much, but she’s a fellow war veteran with an impressive resume and she was just at the wrong place at the wrong time. There were never any nudes exchanged and Madie didn’t act inappropriately in any way. If blame is on anyone for this “inappropriate relationship,” it’s on Red for letting her feelings get in the way. As for the “Madie honeypotted Red” theory…Sharkbait was the one who suggested Madie become a moderator and then the process was democratically voted upon by the rest of the mods and they majority accepted her. I’ll vouch for her for the time being while I get to know her. If you want her to leave then you’re gonna have to boot me too. Madie is not the shill that you want her to be so put your fucking pitchforks down! When she's ready, she will make her own post to clear her name in her own way. But for the time being, CHILL THE FUCK OUT.\n\n\\------------------------------------------------\n\nI wanna be clear about my perspective in all of this, as an outsider to the Mod team looking in: everyone who was involved with this story fucked up. Plain and simple. From start to finish, this was a raging inferno of bullshit from every imaginable angle and ALL parties to blame.\n\nFuck that shit. As an Ape, I didn’t care about it, I didn’t wanna see it, so get the fuck out of my view, you’re blocking the damn memes and DD goddamit! (those Ape Fest memes from the last couple days are fucking fire btw 😂)\n\nWith that said, amidst all of the other bullshit going on, I felt I needed to do something. So I accepted their invitation from many weeks ago to become a moderator of Superstonk. I came on board this morning, got in for the votes and deliberation and here we are. \n\n[actual footage of me joining the modchat, courtesy of u\\/Captain-Fan](https://i.redd.it/0la8adl1aub71.gif)\n\nRed stepping down was a necessary condition of my acceptance of moderator. With that said: here were my other stipulations that we all agreed to before I officially accepted:\n\n1. I will only stay on as a mod until Dec 31, 2021 (or I get booted for doing shitty stuff, whichever comes first lol).\n2. I have to start at the bottom, just like all of the other mods (this is because some of you guys have privately messaged me to take over and I do not agree with that sentiment so this just makes it clear I want no special treatment).\n3. (This one is a work in progress but I'll give you a hint, it involves a banana and a butthole 😂)\n\nLet me be clear: I don’t want to be a mod. I just wanted to shitpost and make memes and every now and then post a spicy take on something. That’s what you love me for and that’s what I love doing. But circumstances outside of my control have called me here to step up and do something about this shit storm because like many of you, I felt heartbroken to see everything transpire. Loads of you reached out to me and I not only heard you, but I am one of you. I felt this pain.\n\nOver these past months you guys have become my family. And Superstonk, to me, feels like it is our Last Stand. We met our final form when we started doing the AMAs. No one is selling. No one has changed their mind about the stock so this is all just REALLY LOUD noise. Trust RC, Trust DFV, Trust the Board. GME is still an amazing long term value play. That has been and always will be the core tenet of this community. And that's the kind of team that I would be proud to help moderate. I hope that with my addition to the team, that we can move past the bullshit.\n\n\\------------------------------------------------\n\nIn Japan, they have this beautiful artform called *Kintsugi*.\n\n[isn't it pretty?!](https://preview.redd.it/9ij161e85ub71.png?width=624&format=png&auto=webp&s=a58ab44d1235597c94634295144e2d2c08ac327d)\n\nWhen a bowl is dropped, it’ll shatter into different pieces. When you finally get all the pieces together, you can throw it away, or you can glue the bowl back together. Kintsugi uses a lacquer that mixes gold, silver, or platinum to make the bowl whole again. And in its own way, I think it becomes even more beautiful. As a philosophy, Kintsugi treats breakage and repair as part of the history of an object, rather than a blemish to disguise. So let's use this as a learning moment, a part of our history, and keep building.\n\nThis week, we got dropped. And now we’ve got to glue ourselves back together. So I’ll ask you this, are you guys willing to help us rebuild and become stronger? Can we go back to the things that made this place home?--The world class DD, the side-splittingly hilarious memes, and the shitposts 😂 (FEEL THESE DIAMOND HANDS!!!)\n\nAre you ready to get back to business?\n\nCause if you are then\n\n# BUCKLE UP 🚀🌕",
    "title": "BUCKLE THE FUCK UP. New changes in the Moderating Team.",
    "upvote_ratio": 0.66,
    "url": "https://www.reddit.com/r/Superstonk/comments/omdh53/buckle_the_fuck_up_new_changes_in_the_moderating/"
}