{
    "author": "nive3066",
    "created_utc": 1626698323.0,
    "distinguished": null,
    "edited": false,
    "id": "ond82z",
    "text_only": true,
    "flair_text": "💎🙌🚀",
    "name": "t3_ond82z",
    "num_comments": 79,
    "permalink": "/r/GMEJungle/comments/ond82z/the_one_good_thing_about_this_drama_is_i_can_now/",
    "score": 835,
    "selftext": "\nSo expecting a sweet dip last week i had transfered money to my schwab account. On that I have both an individual trading account and a roth ira account. I transferred the money to the roth to have those sweet tax free gains on gme. Well the roth is technically the secondary account on the settings when buying shares\n\nYou can guess what happened.. I accidentally bought the shares on my individual account and realized it after the purchase. So I had positive net cash with both accounts but a negative in the individual trading account. I refuse to be on margin in any capacity so I had to make a decision. \n\nMy options.\nA: transfer money from roth to individual\nB: send more money to individual account\nC: sell gme on individual and buy it back on roth\n \n\nI didn't want A cause taking money out of a roth can cause issues and it's best to just not do that.\n\nB would've taken atleast a day and that just wasnt acceptable.\n\nSo i started looking at the gme shares in the individual account (note I already had shares in that account). I typed in the amount I purchased looked at the dreaded sell button but I just couldn't do it. These were my shares now. Why would I give them back... My precious..\n\nSo I went with option D:\n\nI looked at everything else i owned on the individual account and just started selling until I was positive again. Liquidated every other stock I had on that account. I had some fond memories with them. Years of gains. Companies I grew up on...but it had to be done. Another day after the moass i may see them again but not till.\n\nSo yeah I can't even sell shares I accidentally bought and only owned for one minute. I guess I really am buckled up.",
    "title": "The one good thing about this drama is I can now tell this story since my lurker ass didnt have enough karma.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ond82z/the_one_good_thing_about_this_drama_is_i_can_now/"
}