{
    "author": "SixStringSuperfly",
    "created_utc": 1626657708.0,
    "distinguished": null,
    "edited": false,
    "id": "on3wc4",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_on3wc4",
    "num_comments": 65,
    "permalink": "/r/GME/comments/on3wc4/gamestop_and_ethereum_a_match_made_in_stonk_heaven/",
    "score": 505,
    "selftext": "A GME/Ethereum Crash Course\n\n\nGo to nft.gamestop.com \n\nScroll down to below the graphic and click on \"Copy\"\n\nThat is an address on the Ethereum blockchain.\n\nGo to etherscan.io\n\nPaste the Ethereum address into the search bar and hit enter. \n\nBEHOLD\n\nGameStop is on Ethereum!🔥🔥🚀🚀🎉🎉\n\nTHIS IS BIG\n\nScroll down to the bottom of the page and take a look at the transaction history.\n\nTHERE ARE MULTIPLE TRANSACTIONS WITH COINBASE.  THIS IS BIG.\n\nIf you don't know, Coinbase is an American cryptocurrency exchange and a big player in the cryptocurrency world. \n\nThey are up to something for sure.\n\nMy guess would be planning for an ICO.\n\nAn ICO is an Initial Coin Offering.  It's similar to an IPO (initial public offering) for stonks.\n\nTypically, with an ICO, a certain amount of \"coins\" or another type of blockchain asset is released to the public and a market is created for the new digital asset.  \n\n(There can be other methods of coin releases because Ethereum smart contracts can be programmed in any way, but I'm giving you a basic example here.) \n\nI'm no crypto expert, but I've been following the space for a number of years.\n\nMy speculation here is that GameStop is in partnership with Coinbase in preparation for an Initial Coin Offering (ICO) of some sort. \n\nTHIS IS HUGE 🚀🚀🚀🚀",
    "title": "GameStop and Ethereum. A match made in stonk heaven 🚀🚀🚀",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/on3wc4/gamestop_and_ethereum_a_match_made_in_stonk_heaven/"
}