{
    "author": "slash_sin_",
    "created_utc": 1620842991.0,
    "distinguished": null,
    "edited": false,
    "id": "navb0c",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_navb0c",
    "num_comments": 228,
    "permalink": "/r/Superstonk/comments/navb0c/gamestops_stier_tweeting_is_a_signal_to_apes_that/",
    "score": 2740,
    "selftext": "**TLDR: GAMESTOP IS MAKING IT EXPLICITLY CLEAR THAT THIS MIGHT BE THE LAST TIME TO BUY BEFORE MOASS. THEY ARE GIVING YOU ONE LAST CHANCE TO BUY**\n\nI'm sure that all of you have already seen GameStop come out of 5 months of silence with a BANG. Their social media team has been excellent and have been hyping up apes all day yesterday and today.\n\nWhat this tells me is that MOASS is imminent and is giving APES one last chance to buy this dip before MOASS. Thank you for letting us know GameStop. If you're a smooth brain ape that hasn't liquidated all other positions to buy $GME... well GameStop is making it real clear that something BIG is gonna happen soon. For GameStop to come out with provocative tweets such as the \\*moass\\* tweet means that they have already considered the ramifications of this and that it literally does not matter anymore.\n\n&#x200B;\n\n[I support u\\/Peachy-DMN-'s opinion](https://preview.redd.it/2l0bqlvqbqy61.png?width=725&format=png&auto=webp&s=1c87c7f296b6982f16b8605078fe01ca2aad1415)\n\nGameStop is prowling this sub daily and they WONT let us down. Power to the Players  💎🤲\n\nCan't Stop. Won't Stop. This is where the GAME STOPS.\n\n[GameStop Twitter hitting us with the BACK-TO-BACK Tetris](https://preview.redd.it/3d3i4b74cqy61.png?width=960&format=png&auto=webp&s=d9f0b21f0b97245da65b8e5eb55befe114b5dabf)\n\nDisclaimer: All of this is my opinion and please do not twist it into \"tHiS pOsT sUgGeSts GaMeStOP iS mAnIpUlAtInG tHe MaRkEt. sHiLl FuD\". Of course this is not financial advice.",
    "title": "GameStop's S-tier tweeting is a signal to APES that this might be the last dip before MOASS",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/navb0c/gamestops_stier_tweeting_is_a_signal_to_apes_that/"
}