{
    "author": "Pubertus",
    "created_utc": 1619214704.0,
    "distinguished": null,
    "edited": 1619296195.0,
    "id": "mx60cw",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mx60cw",
    "num_comments": 206,
    "permalink": "/r/Superstonk/comments/mx60cw/got_em_423_fadf_dark_pool_data_bloomberg_data/",
    "score": 3828,
    "selftext": "Edit: u/WSBdickhead has informed me that the Bloomberg terminal data for 4/22 is likely incorrect.\n\n>Change your Custom Condition Codes to match quoteline and you'll get the right numbers.  \n>  \n>VWAP screen: Settings>Edit Custom Condition Codes> 2 (Set To)> Match Quoteline> 1(Save)> Back\n\n**Since I do not have access to a Bloomberg terminal, I am completely relying on the screenshots provided by others to be accurate. Once I have an updated screenshot of the terminal data from 4/22, I can amend my post for correctness.**\n\nEdit2: Below is the screenshot u/WSBdickhead provided for me for 4/20. The data for 4/20 aligns much closer with my data from Fidelity, showing that Bloomberg is not misrepresenting/falsifying data. **Bloomberg is working as intended, the screenshots being provided were not configured properly. I am sorry Bloomberg and thank you** u/WSBdickhead.\n\n[4\\/20 - Bloomberg data thru 8pm](https://preview.redd.it/2rhhgud8f1v61.png?width=763&format=png&auto=webp&s=12b9952a81699098403546287feacdfbceb2e01c)\n\n[4\\/20 - Fidelity data thru 8pm](https://preview.redd.it/gr2jb5k0c1v61.png?width=1073&format=png&auto=webp&s=d75b7bba300c345873e32f26122b3f344f4d55e2)\n\nAlso please see [this comment](https://www.reddit.com/r/Superstonk/comments/mx60cw/got_em_423_fadf_dark_pool_data_bloomberg_data/gvn17jw?utm_source=share&utm_medium=web2x&context=3) from u/nayboyer2. His work is leagues ahead of mine. Please check [his post.](https://www.reddit.com/r/Superstonk/comments/mx4j9p/dark_pool_dd_summary_and_a_quick_update_on_all/?utm_source=share&utm_medium=web2x&context=3) Thank you everyone for the support, and please keep focusing on the dark pool transactions.\n\nFor the past 2 days I have been compiling Finra ADF dark pool transaction data for analysis purposes. My posts have been vastly overlooked and I have been trying to get some traction for big brain help in figuring some discrepancies out. ~~Well, I think I figured out the discrepancies - Bloomberg has been misreporting or falsifying data.~~ I need more Bloomberg terminal data from previous days to compare to data sets I am currently compiling for further verifications, ~~but at least for now I think I caught them with their pants down.~~\n\nI am retrieving Finra ADF data through Fidelity using Time & Sales and running it through some spaghetti code I threw together. As always, if you notice any errors in my data please point them out as **I am prone to making mistakes and I'm no wrinkle brain**.\n\n&#x200B;\n\nhttps://i.redd.it/weayhfswf0v61.gif\n\n[Here's my post from yesterday observing the discrepancy](https://new.reddit.com/r/Superstonk/comments/mwfowb/fadf_data_drop_422/)\n\n[Here's my post from 2 days ago beginning to analyze the data (without BB comparison but will return to perform)](https://www.reddit.com/r/Superstonk/comments/mvwdc8/adf_trade_data_42121/?utm_source=share&utm_medium=web2x&context=3)\n\nI will not be performing a control analysis against other stocks today unless popular vote requests it. It's time consuming as hell to extract the data from Fidelity, especially if the transaction volume is massive. I think the control analysis from yesterday does a sufficient job of showing the buttfuckery happening through the dark pools for GME.\n\n**~~This post is just to call out Bloomberg on their shenanigans and to jerk myself off for potentially revealing it.~~** **Looks like I owe Bloomberg a juicy, apologetic handy-j.**\n\nLet's start by reviewing yesterday's data.\n\n[4\\/22 - GME data thru 8pm](https://preview.redd.it/7gjz1tf0g0v61.png?width=1414&format=png&auto=webp&s=5c853e91a82437f2ed67cae279761c1e534f89e0)\n\n[4\\/22 - Corrected Bloomberg Terminal data](https://preview.redd.it/ha3rbv9fk6v61.png?width=764&format=png&auto=webp&s=be32b37f77aa3e18a7d7da01c3e095acb04658dd)\n\n[ 4\\/22 - Fidelity vs Bloomberg data comparison ](https://preview.redd.it/jvvmx4rrk6v61.png?width=530&format=png&auto=webp&s=b9340a7159b83ecb1ece652a35818ca022854395)\n\n**With the corrected Bloomberg terminal data, everything aligns much closer. My sincerest apologies to Bloomberg and to anyone that the incorrect data may have misled.** Thanks again, u/WSBdickhead. \n\nNow let's look at the data for today.\n\n[ 4\\/23 - Gamestop data thru 4pm ](https://preview.redd.it/pz41uue7g0v61.png?width=1492&format=png&auto=webp&s=ec3aa35539b120b525c4c4280f63b44132689c98)\n\n[ 4\\/23 - Bloomberg terminal data ](https://preview.redd.it/bqyrnae9g0v61.png?width=1920&format=png&auto=webp&s=d97fdcde2dd7f24063b55d3a0e606e1b09818c55)\n\n[ 4\\/23 - Fidelity vs Bloomberg data comparison ](https://preview.redd.it/e2o34o1bg0v61.png?width=233&format=png&auto=webp&s=c0b29b72b1530da2fca3450f58923be69064dd19)\n\nEdit: **The data discrepancy appears to be due to the terminal that was screenshot wasn't properly configured to detect odd-lots.** I have an updated image for 4/22 and corrected this post. I wish I could change the post title for correctness. **Bloomberg did not misreport data.**\n\n**~~There's a possibility it was a 1 time fluke,~~** ~~but for now I'm saying Bloomberg be a lying~~. **I need additional screenshots of the previous 30 days from Bloomberg terminals of trade volume by exchange to verify. Please help if you can.**\n\nPlease check [my post from yesterday](https://www.reddit.com/r/Superstonk/comments/mwfowb/fadf_data_drop_422/?utm_source=share&utm_medium=web2x&context=3) because there are still some significant data points that need further examination. Fuckery is afoot.\n\n~~I'm gonna go rub out a massive celebratory load now.~~ Gotta put this load back in me, because **Bloomberg was not incorrect**. Please continue paying close attention to the dark pool transactions though. Thank you everyone for the support, but I'm sorry there is nothing to see here in regards to Bloomberg. There's still a lot of dark pool fuckery going on, though.\n\nEdit: Updated post to remove incorrect Bloomberg Terminal data from 4/22 with the updated screenshot containing odd-lot data. Everything is much closer aligned now.",
    "title": "Got Em! - 4/23 FADF Dark Pool Data & Bloomberg Data Falsifications",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/mx60cw/got_em_423_fadf_dark_pool_data_bloomberg_data/"
}