{
    "author": "DSmith2430",
    "created_utc": 1619192135.0,
    "distinguished": null,
    "edited": 1619197643.0,
    "id": "mwxz5c",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mwxz5c",
    "num_comments": 41,
    "permalink": "/r/Superstonk/comments/mwxz5c/the_head_of_dtcc_chris_childs_and_ken_griffin_the/",
    "score": 819,
    "selftext": "Been doing some digging into Chris Childs and have found some interesting stuff. First off there are a couple articles. Big ones which I will attach the links and the photos where when you google them together the key words hit in the article but when you pull up the article the part where Ken Griffin chimes in has been REMOVED.\n\n&#x200B;\n\n[First part from Hedgeweek in 2013 the relationship goes deep. ](https://preview.redd.it/uaq0agk1uxu61.png?width=1328&format=png&auto=webp&s=0913248ee03700c8491530deadc09f7b703292c8)\n\nHeres the link to the story [here!](https://www.hedgeweek.com/2013/04/12/182972/dtcc-supports-legislation-ensure-continued-market-transparency-and-global-data-sha) which you can clearly see the part about KG has been removed.\n\n&#x200B;\n\n&#x200B;\n\n[Now we have at least 4 years of relationships](https://preview.redd.it/a7xnucsjuxu61.png?width=1230&format=png&auto=webp&s=9cb64c55a2fff303dfcbf75a62cb76fe0d6e8722)\n\nHere is the link to the story [here!](https://www.hedgeweek.com/2017/01/09/247372/dtcc-selects-ibm-axoni-and-r3-develop-distributed-ledger-solution) Where you can see where Ken's part was removed. This story however plays pretty heavily into what is happening. Let me highlight a few areas of this story. I wish we could see what Ken Griffin of Citadel had put in this piece.\n\nThis story is about the DTCC selecting IBM to create Distributed Ledger Technology (DLT) which creates \"The solution that will enable DTCC and its clients to further streamline, automate and reduce the cost of derivatives processing across the industry by eliminating the need for disjointed, redundant processing capabilities and the associated reconciliation costs.\" Nice to know KG had his hand in the creation of the system maybe that's why he is fucking over the retail trader... because he knows he can get away with it.\n\nAnother VERY INTERESTING part of this post is the banks that are involved in this system upgrade:\n\n\"The solution has been developed with input and guidance from a number of market participants including **Barclays, Citi, Credit Suisse, Deutsche Bank, JP Morgan, UBS and Wells Fargo**, and key market infrastructure providers, IHS Markit and Intercontinental Exchange. \"\n\nIf I'm not mistaken those are the banks that are making the news lately for various reasons. Cutting credit limits, Margin Calls, liquidation, etc.\n\nWHAT THE FUCK IS DISTRIBUTED LEDGER TECHNOLOGY (DTC)?\n\nDLT is a major advance in books and records technology, with these capabilities::\n\n* The ledger itself, which contain a history of all transactions, contract terms and programmable instructions, or “smart contracts,” to use for payment of coupons or automatic enforcement of exchanges within the ledger.\n* “Nodes” which are assigned various rights and tasks -- administrator, issuer, proposer, validator and auditor -- for generating the consensus that certifies the ledger.\n* Cryptography, employed to secure a DL and serve as a gatekeeper for access to the DL.\n* Tokenization, the digital representation of real-world assets within a DL, analogous to the dematerialization of share certificates within DTCC.\n\nSimply put, in a DL’s nodal system, nodes can certify parties’ transactions as they are entered into the DL, reducing or eliminating the need for costly and time-consuming reconciliations. Nodes also let the DL be a golden data source for all members, reducing reconciliation to the individual books and records of member firms.\n\nDLT can bring significant record-keeping improvements to the securities industry, but can it do the same for clearing and settlement processes?\n\nDLT “maximalists” propose that the technology could remake the settlement system by eliminating the need for central counterparties, thanks to the tokenization of assets and cryptographically-secured, self-enforcing contracts This would make settlement instantaneous, therefore abolishing the need to post collateral – freeing up capital that could be used for other purposes.\n\nDISTRIBUTED LEDGER TECHNOLOGY (DLT) Could FIX the volatility and fake shares in the market!! Why are we not using it. After all, cryptocurrencies are using without any issues. Here is your answer, with none other than VLAD from ROBINHOOD chiming in with his opinion.\n\n[DTCC proposes move to shorten US settlement cycle to T+1 by 2023](https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224569)\n\n&#x200B;\n\nTL:DR Chris Childs head of DTCC and Ken G go way back. As of late the articles where they collaborated the part with Ken G has been removed from the article. Upon discovering this I found the Distributed Ledger Technology (DLT) which is the blockchain system they use for cryptocurrencies today that requires the actual transfer of a token (Stock) instead of having a central clearing house CEJE and CO. System was introduced in 2017 and plans on being launched in 2023 which will end all the fake share bullshit going on. When you buy a share you get the token of the actual share making it yours. Currently it's all going to a central clearing house where its stored and you are getting IOU's.\n\nSO MUCH FUCKERY!!!!",
    "title": "The head of DTCC Chris Childs and Ken Griffin the DELETED past!! BONUS ROUND - DISTRIBUTED LEDGER TECHNOLOGY (DTC) WHY AREN'T WE USING IT!!!",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/mwxz5c/the_head_of_dtcc_chris_childs_and_ken_griffin_the/"
}