{
    "author": "rensole",
    "created_utc": 1615199193.0,
    "distinguished": "moderator",
    "edited": 1615227024.0,
    "id": "m0cxjl",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_m0cxjl",
    "num_comments": 840,
    "permalink": "/r/GME/comments/m0cxjl/synopsis_for_03082021_what_we_need_to_know_before/",
    "score": 5117,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nAnd seriously does no one smell that? smells like someone shat themselves.\n\n&#x200B;\n\nhttps://preview.redd.it/g3wpg2nbmll61.png?width=680&format=png&auto=webp&s=d59b42948402728757ab9d47807307ae5d4088c3\n\nThis is not financial advice as it's all just my opinion, don't invest on my thoughts invest because of your own research.\n\nI hope everyone had a great weekend and is refreshed ;)\n\n# The mod team\n\nGuys I want to thank each and every member of this sub, we put a lot of trust in you guys by letting this entire sub be self governing and decide for themselves what is good info and what is BS.\n\nThe only thing some people seem to overlook is that I am not the \"main mod\" or anything like that, this is a group effort.\n\n[**u/BearBiPolar**](https://www.reddit.com/user/BearBiPolar/)\n\n[**u/Toasterrrr**](https://www.reddit.com/user/Toasterrrr/)\n\n[**u/chickthief**](https://www.reddit.com/user/chickthief/)\n\n[**u/SpaceMillionaire**](https://www.reddit.com/user/SpaceMillionaire/)\n\n[**u/thr0wthis4ccount4way**](https://www.reddit.com/user/thr0wthis4ccount4way/)\n\n[**u/oxxadam**](https://www.reddit.com/user/oxxadam/)\n\n[**u/redchessqueen99**](https://www.reddit.com/user/redchessqueen99/)\n\n[**u/plumdragon**](https://www.reddit.com/user/plumdragon/)\n\nAll these people mentioned here are the mod team, and only because of their work am I able to do my DD, otherwise I'd be modding all day every day. these guys keep the sub good and healthy.\n\nThese guys put in so much god damn work it's amazing, weeding out bots and shills (which we can only do because of you guys flagging them), making sure that FUD gets removed, and keep this sub wholesome as fuck.\n\nSo be sure to give them credit, they do more for this sub then you might first think or know.\n\n&#x200B;\n\nhttps://preview.redd.it/qzk9lvxdpll61.jpg?width=577&format=pjpg&auto=webp&s=f42adbb06f2d4a8a9056438e1853dc3ad6870584\n\n# New rules imposed by DTCC signed this weekend.\n\nwell it seems someone is scared some people wont be able to pay up.\n\nCredit goes to [u/LongTermTendieLoser](https://www.reddit.com/u/LongTermTendieLoser/)  for initially finding this and bringing it to the boards attention.\n\nThe DTCC just posted this over the weekend\n\n[https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-801.pdf](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-801.pdf)\n\nSo just to get back to some basics, as I'm sure we will be seeing a lot of new members in the coming days.\n\n&#x200B;\n\nhttps://preview.redd.it/m5fyprvxjml61.png?width=577&format=png&auto=webp&s=f8a9373b38ac3722981b71fff16414981f364730\n\n## What Is the Depository Trust and Clearing Corporation (DTCC)?\n\nThe Depository Trust and Clearing Corporation (DTCC) is an American financial services company founded in 1999 that provides clearing and settlement services for the financial markets. When the DTCC was established in 1999, it combined the functions of the Depository Trust Company (DTC) and the National Securities Clearing Corporation (NSCC).1﻿ The NSCC is currently a subsidiary of the DTCC\n\nIf you want more info on this I'd say check out this website:\n\n[https://www.investopedia.com/terms/d/dtcc.asp](https://www.investopedia.com/terms/d/dtcc.asp)\n\n&#x200B;\n\nI'd like to thank u/neversell69 for doing a great writeup which boils this down to it's basic points.\n\nThings found in these pages:\n\n**(page 22):**\n\nAs described above, the proposal would strengthen NSCC’s ability to maintain sufficient liquidity to complete end-of-day settlement in the event of the default of a Member. a member like for example, Melvin and Citadel.\n\nThe proposal would do this;\n\nby allowing NSCC to calculate and collect, when applicable, SLD every Business Day from those Members that pose the largest liquidity exposures to NSCC on that day.\n\nThe proposal would also include a mechanism to allow NSCC to collect SLD on an intraday basis, including on the first Business Day of the Options Expiration Activity Period, when liquidity exposures are historically higher.\n\n**(page 41):**\n\nThe Corporation may require any such Member to deposit additional amounts to the Clearing Fund pursuant to Rule 15.\n\nRule 15 basically says the members can't be fucking idiots and if they are wilding out the NSCC can protect themselves by demanding more money to reduce their risk\n\n**(page 88/89):**\n\n(iv) increased Clearing Fund deposits (including additional amounts required in respect of trade activity received by the Corporation after calculation of the applicable Required Fund Deposit);\n\n(v) additional payments to the Corporation in such amounts as may be determined by the Corporation each morning reflecting a percentage of up to 100 percent of the participant’s (i) average amount of total daily net debit positions or (ii) morning gross debit activity;\n\nWhat's a net debit position? Here's the fucking Investopedia summary because I know your too lazy to Google it:\n\n    If the income collected from all options sold results in a lower money value \n    than the cost of all options purchased, the result is a net debit to the account,\n    hence the name debit spread.\n    If shit gets really fucked the DTCC can ask for a supplemental liquidity deposit\n    (SLD), which basically means when the market is fucked and the member is looking\n    at a fat options loss the dtcc can make them pay an extra fee to make sure \n    they can cover the loss \n\n**(page 52):**\n\nOverview. The Corporation requires sufficient liquidity to enable it to effect the settlement of its payment obligations as a central counterparty. The two principal sources of liquidity for the Corporation currently are deposits to the Clearing Fund and a committed line of credit. A substantial proportion of the liquidity needed by the Corporation is attributable to the exposure presented to the Corporation by its Members who would generate the largest settlement debits during options expiration activity periods in stressed market conditions. In order to ensure that the Corporation has sufficient liquidity to meet its payment obligations, it is appropriate that such Members provide additional liquidity to the Corporation in the form of supplemental liquidity deposits to the Clearing Fund.\n\nThe new rule changes basically means the DTCC can now calculate this **'fat loss fee'** everyday and even during the day and force a payment.\n\nSo the DTCC is covering their ass and are going to liquidate the member themselves when shit hits the fan.\n\naka the DTCC will fucking crucify Citadel/melvin and other Short sellers the day this pops off, and if it does, they will be forced by them to cover all at once. and remember it's not just us retailers, it's also other sharks swimming with us who smell a golden opportunity to take out the competition all at once.\n\nWhat does this mean? it means that the DTCC is covering their own ass, it means they can force the whales who are itm to buy, they can force people who's short contracts are up to pay up and buy back in.\n\nfor the noobs: see this as a Patch being installed, they're correcting the PVP combat because someone was OP and they just now got Nerfed.\n\nI've said it before but the new head for the SEC is someone I actually respect, he was at the helm when the 08 crash happened and he took action to make a hefty legislation against this ever happen again.\n\nGary Gensler, he passed the  *Dodd*\\-*Frank* Act, giving regulations to swaps (the thing caused the crash) which until he came along where not regulated at all!\n\nAlso with  Senator Elizabeth Warren  wanting a investigation into the GME saga.\n\n&#x200B;\n\nThese two combined are already making waves right now, so stop asking IF or When the Squeeze will happen, know that we are on the right side of history and this shit is going to get FUCKING wild.\n\n&#x200B;\n\nhttps://preview.redd.it/u26k4q6dsll61.png?width=960&format=png&auto=webp&s=759bbca99cc5b2ccfec92499569dbb7b4eb7e641\n\n# New FUD tactic.\n\nI've gotten a lot of pings this weekend and have just looked at most of them.\n\nLet me be clear because there seems to be a lot of misconceptions floating around.\n\nThe DTCC does NOT only have 63 trillion in money, the DTCC has an insurance which INSURES them in case of something like this happening the insurance will cover up to 63 trillion.\n\nThe DTCC has more money than this, this is just their insurance.\n\n&#x200B;\n\n**Q: But what if they wont pay?**\n\nA: Not our problem seriously stfu about it shilly.\n\nHere is how it go's, people who are short need to pony up at some point. if the price gets high enough they will be forced to do so.\n\n**Q: Now what if the people who are short go bankrupt?**\n\nA: not a god damn thing, it then transfers it's contracts to their clearing houses.\n\nMelvin/shitadel: lets say for example these guys have 15 billion (remember they have more than stocks, they have properties, bank accounts etc, they are only forced to disclose the amount their stock is worth not everything they own).\n\nIf they go bankrupt the contracts go to their brokers and clearing houses, these guys also have lots of money, if these guys can't pay then it go's to the DTCC and the FED.\n\nThe Fed has a literal money-printer.\n\nSo stop with these questions. it's bogus and at this point just a version of spreading fud.\n\nif you don't know about these things you should look into it, you need to have basic knowledge when you enter the stock market, but it's up to YOU to educate yourself.\n\nGoogle is your friend.\n\nhttps://preview.redd.it/foevus9jsll61.png?width=611&format=png&auto=webp&s=14d9c002294fc3bf6f5ff26d5f757a30fb278cee\n\n# Forbes Article\n\n[https://www.forbes.com/sites/georgecalhoun/2021/03/05/gamestopgamestonk-has-nothing-to-do-with-the-madness-of-crowds/?sh=53ead02825d0](https://www.forbes.com/sites/georgecalhoun/2021/03/05/gamestopgamestonk-has-nothing-to-do-with-the-madness-of-crowds/?sh=53ead02825d0)\n\n&#x200B;\n\nForbes just posted this article but one thing really stood out to me as factually wrong:\n\n\\- \" It is a premeditated, predatory take-down of a cornered and defenseless counterparty.\"\n\nNo it's not, Short sellers wanted to bankrupt a company and overexposed themselves to this, the fact that retail investors saw this as an opportunity to make money and give back to the community, the same communities that where constantly the ones who got fucked when they messed up does not make us \"predators\" or them a \"defenseless counterparty\".\n\nRemember the 08 crash THEY caused, which made people lose their houses? their jobs? their family members? because I sure as fuck do.\n\nThey are the predators and have always been. None of this was predetermined or agreed upon, there is no \"we\" to speak of, everyone here buys and sells as they feel like doing. the only \"WE\" you'll see on this sub is the \"Royal We\".\n\nThere are no agreed upon buy or sell dates or prices. we as a sub take a hard stance against this. so Forbes by the off chance you are reading this, bad paper, bad.\n\n&#x200B;\n\nhttps://preview.redd.it/4q2plwb89ml61.png?width=546&format=png&auto=webp&s=7a3f84d231ca55a64e1790b806d3b614e9665d17\n\n&#x200B;\n\nhttps://preview.redd.it/axg2pljqull61.png?width=640&format=png&auto=webp&s=a1738394653cfb313cd2461434bbb5caf340ca2c\n\n# FTD?\n\n[u/DigitalSoldier1776](https://www.reddit.com/user/DigitalSoldier1776/) posted this over the weekend and thought it was interesting, I still have to find the source of this graph but if this pans out.... Holy fuck I'm gonna try to get some more to yolo into this because this would be insane if true. there is still a lot of outstanding now, remember most of this shit is self reported (just like the number of shorts) so who knows what the actual factual data right now is.\n\n&#x200B;\n\nhttps://preview.redd.it/281mqgrjvll61.png?width=960&format=png&auto=webp&s=04973f69832feb35e6e560b56bad0c504a3d3d83\n\n[His Thread.](https://www.reddit.com/r/Wallstreetbetsnew/comments/lyzale/straight_from_the_sec_website_on_gme_the_failure/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[https://sec.report/fails.php?tc=GME](https://sec.report/fails.php?tc=GME)\n\n&#x200B;\n\nAlso this:\n\n&#x200B;\n\nhttps://preview.redd.it/agyicnu5hml61.png?width=807&format=png&auto=webp&s=ef32c1be548ab09e8a0533092bec53b367632dda\n\nNot sure how factual this last image is, someone feel free to correct me/it\n\n# What will happen this week?\n\nNo clue, But what I do personally think will happen is that this will go higher and then they will try to push this further down, but the question is with the new DTCC ruling, would they still have the liquidity to do this?\n\nThe thing is I'm sure they will try to get people to paperhand this bitch as much as possible, but remember Buffet's quote?\n\n**it's ok to be greedy when others are fearful**\n\nSo with that in mind, people will try to get others to fold at around 1k or bellow while we kind of figured out this can and most likely (not financial advice again) go into the thousands, we don't know where the ceiling is on this bitch but we know its a lot higher than 1k if we enter the squeeze territory.\n\nSo like I've said before, our \"HODL the line\" works, but if we want it to succeed we need to keep that up even when the 1k comes, remember it's a checkpoint not the goal, and if we keep holding the line... the sky is the literal limit.\n\n&#x200B;\n\nSo relax guys, if we see heavy red this week, I'm personally going to see it as a \"steam sale\".And I'm going to average down my portfolio again, because at this point I believe this is going to go up no matter a squeeze or not, with all previous data from Domo and RC, and I believe in this company, so 1k is the minimum we will most likely see.\n\nagain not financial advice, just what I think.\n\nSo once we go past the 1k, and if we where all to hold the line we would see 10k and more, because if they keep buying the price go's up, and if no one is selling, the price go's up faster.\n\n&#x200B;\n\n&#x200B;\n\n**How much is a glass of water worth to you now? $1? $2 maybe?**\n\n**How much is a glass of water if you're stuck in the desert and dehydrated?**\n\n**Whatever the fuck the seller is asking.**\n\n&#x200B;\n\n&#x200B;\n\nwe will most likely see trolls like the guys from r/gme_meltdown which I don't understand tbh, why the fuck are people so salty that we believe in something? did they paperhand or something? or just mad they don't have the money to join in?\n\nBut other than just trolls we will also see bots and shills.\n\nRemember to always ask yourself, why the fuck would someone say buy or sell? it's your money and YOU should decide what you do with it. and don't let others belittle you.\n\nI've never in my life had anyone worry about my money, but suddenly.... people are worried ? fuck  m\n\nJust remember the most important rule of all\n\n# APES DONT FIGHT APES\n\n&#x200B;\n\nhttps://reddit.com/link/m0cxjl/video/fk535qfuxll61/player\n\n# $GME in top 10 holdings of iShares US Fundamental Index ETF which selects companies based on fundamental factors\n\n[u/pianoforte88](https://www.reddit.com/user/pianoforte88/) thank you for sharing this!\n\n&#x200B;\n\nhttps://preview.redd.it/ccwgzjtd4sl61.png?width=960&format=png&auto=webp&s=0130c0a3e06ab39a66d86565647991841d82724a\n\nThe other side is finally getting it as well, Fundamentally speaking GME is not what it was a year ago, and it isn't today what it will be in a year.\n\n&#x200B;\n\n[ Former PM at a Goldman Sachs founded $1.2 Bn hedge fund](https://preview.redd.it/n7qwsc3k4sl61.png?width=640&format=png&auto=webp&s=9678cfa42c940db80b29253e48109d2fce2db690)\n\nRemember, it's not just us who believes in GME anymore, at this point GME has been discussed by so many people that it has reached people higher up, and they started doing their own DD.\n\nThey most likely knew years ago that standard news outlets are such bullshit that when they heard them scream they paid attention and boom here come the traditional investors.\n\n&#x200B;\n\n# Calls - Puts for 03/12 Variations - Before Market - 03/08\n\n[u/Bukikoa](https://www.reddit.com/user/Bukikoa/)  has a big wrinkly brain and put some spreadsheets together for us.\n\nbe sure to check out his thread !\n\n[https://www.reddit.com/r/GME/comments/m0c7yq/calls\\_puts\\_for\\_0312\\_variations\\_before\\_market\\_0308/](https://www.reddit.com/r/GME/comments/m0c7yq/calls_puts_for_0312_variations_before_market_0308/)\n\n&#x200B;\n\n&#x200B;\n\n[thx for the stimmy daddy](https://preview.redd.it/tn5xh42p5sl61.jpg?width=960&format=pjpg&auto=webp&s=d2f5c0d32e218bcc25855db9e7d42c685c87d3e3)\n\n&#x200B;\n\nJust remember expect fuckery, hope for the best prepare for the worst.\n\nI hope this fucker will rocket so hard we will rip a hole in the space time continuum, but at the same time I want it to dip to 40 to get some on sale.\n\nJust keep one thing in mind, there are big whales on the other side, and they are losing a lot of money so they will try to let this drag out as long as they can, and they'll try any tactic to get out of this.\n\nThey will use Fear uncertainty and doubt as a weapon, they will try to knock the stock down as low as they can to try and get some new guys to paperhand this bitch. they will do everything they can to make you doubt yourself.\n\n&#x200B;\n\nsee it as an animal backed into a corner, it will do everything to survive. so don't expect them to take this lying down, I expect a lot of fuckery to be tried.\n\nso don't worry, focus on the fundamentals of the company, focus on what RC will do to the company how the company is changing.\n\nthe more knowledge you have, the better armed you are against FUD.\n\nhttps://preview.redd.it/ccvzllyo6sl61.jpg?width=400&format=pjpg&auto=webp&s=d7dd4a3a4a86c583e87c51cbe0ade2564a726483\n\n&#x200B;\n\nAgain nothing in this post is financial advice, I'm actually retarded and know nothing about anything.\n\nAgain if I've missed anything please let me know and I'll include it here.\n\nAlso some useful websites for ya'll\n\n&#x200B;\n\n[https://www.nasdaqtrader.com/trader.aspx?id=TradeHalts](https://www.nasdaqtrader.com/trader.aspx?id=TradeHalts)\n\n[https://gme.crazyawesomecompany.com/](https://gme.crazyawesomecompany.com/)\n\n[https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)\n\n[https://finviz.com/map.ashx?t=sec](https://finviz.com/map.ashx?t=sec)\n\n[https://isthesqueezesquoze.com/](https://isthesqueezesquoze.com/)\n\n&#x200B;\n\nEdit 1:Market isn't even open but we are seeing proof RC is being tapped as the next CEO.\n\n[https://www.reuters.com/article/us-gamestop-activist-idUSKBN2B019T](https://www.reuters.com/article/us-gamestop-activist-idUSKBN2B019T)\n\nGameStop Corp has tapped shareholder Ryan Cohen to lead a shift towards e-commerce, Bloomberg reported on Monday, sending the company’s shares up 10.3% before the bell.\n\nCohen’s RC Ventures activist firm reached a settlement with GameStop in January, giving Cohen seats on the company’s board.\n\n&#x200B;\n\nEdit 2:\n\nGameStop offered a press release,  Board Has Established New Strategy Committee\n\n[https://news.gamestop.com/news-releases/news-release-details/gamestop-provides-corporate-governance-update](https://news.gamestop.com/news-releases/news-release-details/gamestop-provides-corporate-governance-update)\n\nstrap in boys we are going to see waves.\n\nEdit 3:\n\nDeepfuckingvalue just tweeted!\n\n[https://twitter.com/TheRoaringKitty/status/1368952570874654730](https://twitter.com/TheRoaringKitty/status/1368952570874654730)\n\nI have no clue on wtf he's trying to communicate with this XD\n\nEdit 4:\n\nBut it seems pixel may have found out, his take on this does make sense to me!\n\n[https://www.reddit.com/r/GME/comments/m0j6bz/is\\_dfv\\_congratulating\\_ryan\\_cohen\\_on\\_probably/](https://www.reddit.com/r/GME/comments/m0j6bz/is_dfv_congratulating_ryan_cohen_on_probably/)",
    "title": "Synopsis for 03-08-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/m0cxjl/synopsis_for_03082021_what_we_need_to_know_before/"
}