{
    "author": "somuchofnotenough",
    "created_utc": 1622388771.0,
    "distinguished": null,
    "edited": false,
    "id": "nodmb4",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nodmb4",
    "num_comments": 115,
    "permalink": "/r/Superstonk/comments/nodmb4/gamestop_is_hiring_business_intelligence_and_data/",
    "score": 3693,
    "selftext": "So I saw this post, \nhttps://www.reddit.com/r/Superstonk/comments/noa96h/just_what_is_rc_brewing/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nAnd finally my field of work and I can add some information! I’m a senior business intelligence consultant and worked for some of the largest companies in the world, mainly within retail, finance and infra structure. And I can tell you, when you want to pivot and change your company there is nothing more important than taking decisions based on data and facts. So what is business intelligence? To simplify, we are creating the programs/graphs/spreadsheets for the people in charge to make better decisions and not rely on good ol’ gutfeeling. I mean we will always need good people feeling shit in their stomach but we rather back it up with numbers as well. In short you can say that we take the copious amounts of raw data and make it into something that humans can understand. What data scientist do are adding to that raw data, perhaps creating machine learning and AI algorithms that predict where we should be heading or where we should be looking. That gamestop is investing in this department seriously makes me so bullish, I cannot stress enough what a good BI department can do for a company, especially when we want to take it to the next level and be ahead of the market.\n\nTD;DR: RC is doing so much for the company in all the right directions and even without the MOASS (that is coming) this is going to be the amazon of gaming, no doubt! 💎👋",
    "title": "Gamestop is hiring business intelligence and data scientists and its making me so bullish!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nodmb4/gamestop_is_hiring_business_intelligence_and_data/"
}