{
    "author": "Blanderson_Snooper",
    "created_utc": 1621427513.0,
    "distinguished": null,
    "edited": 1626486125.0,
    "id": "ng4ja0",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ng4ja0",
    "num_comments": 775,
    "permalink": "/r/Superstonk/comments/ng4ja0/wargame_theory_ii_the_mother_of_all_fud_moafud/",
    "score": 6204,
    "selftext": "Blanderson Snooper here, back with another page of toilet reading for all you Apes. Does an Ape shit in the woods? Only if there's wifi.\n\nIf you want a shot of feel-good confirmation bias, skip to the last section, \"The Good News.\" See you back here in a minute. If you're ready to take the whole wild ride, buckle up and enjoy.\n\n🚀🚀🚀🚀🚀🚀\n\nFour weeks ago I published [the Wargame Theory](https://www.reddit.com/r/Superstonk/comments/mvov2f/the_gme_wargame_a_new_theory_of_everything_my/), a cultural DD that used narrative as a way to explain some of the unexplainable parts of the GME saga. That theory explained events up to 4/17, and made some fairly accurate predictions about where we were heading. This one skips ahead to the present day. If the Wargame Theory was about plot, the sequel is a character study of the antagonist.\n\nI called that one my Charlie Day-DD because it was my Theory of Everything. This is my Vizzini-DD, where I try to reason through a problem using only the psychological traits and life experiences of my opponent as premises.\n\n[It's all in the names](https://preview.redd.it/h415beipr1071.jpg?width=680&format=pjpg&auto=webp&s=3c89c0e8cb5f8ff8f66156a2bf7b08c28ba28730)\n\nBefore we get into the new timeline, I want to highlight the most important prediction of the Wargame Theory:\n\n&#x200B;\n\n>\"I think the Good Shills have been winning the war for the Apes. I also think we have one last boss to fight. It’s not Citadel shorts. It’s the MOAFUD.\"\n\n**Big Bad confirmed: The Mother of All Fear, Uncertainty, and Doubt**\n\nBy last month, I was convinced that the shorts were trapped in a black hole of their own making, that they could neither stop shorting nor extract themselves through any market mechanics, even illegal ones. People I trust were fond of using that analogy, and the technical DD suggested it even though it was incomplete.\n\nThe Wargame Theory was based primarily on u/c-digs’ analysis of the regulatory environment (I’m also posting his ongoing DD because I find it excellent and bullish).\n\n[Why We are Trading Sideways](https://www.reddit.com/r/Superstonk/comments/mu9xed/why_were_still_trading_sideways_and_why_we_havent/)\n\n[Why SR-OCC-2021-004 is So Important](https://www.reddit.com/r/Superstonk/comments/mnpzu5/srocc2021004_why_this_proposed_rule_change_is/)\n\n[The Brakes Might Be Off This Week](https://www.reddit.com/r/Superstonk/comments/nfagu1/this_week_might_be_it_the_brakes_are_possibly/)\n\n**tl;dr – SR-OCC-2021-004 is scheduled to drop on or before this Friday, May 21. That, along with the OCC raising its Clearing Fund by almost $600,000,000 (due today, May 19), means that we may now have the regulatory framework** ***and*** **institutional action in place to give Marge the go-ahead.**\n\nThat’s why I’m writing this now.\n\nWe’ve understood them technically, and beaten them technically.\n\nWe’ve understood them culturally, and beaten them culturally.\n\nAll that’s left is the MOASS. Oops, our bad.\n\n# The Wargame Theory II\n\nThe Wargame Theory was a cultural DD trying to fill in gaps in the technical DD by thinking about what was happening in the community. It sought to answer questions about trading and reporting anomalies, SEC inaction, and how our communities have functioned in the absence of clear evidence around any of them. At the end, as I did in [my original cultural DDs](https://www.reddit.com/user/Blanderson_Snooper/comments/m793qf/gme_apes_a_cultural_due_diligence_part_1/) (with way more memes), I tried to impress upon Apes the importance of learning to recognize and counter FUD.\n\nThe Wargame Theory II, on the other hand, is based on a series of technical DDs that I have had my eye on for some time regarding the short interest and methods of hiding it in the strange options plays we had seen from time to time. This time the technical DDs help us understand gaps in our cultural knowledge.\n\nWhat I mean is, I think these theories help explain Glacier Capital's appearance, why its appearance signals an imminent MOASS, and what it might look and feel like.\n\n(One caution, I’m not a financial guy, so I hope that the more technical folks (or even original DD authors tagged here) will come in and fill in gaps. Also if I have missed important pieces of the puzzle let me know. Something tells me u/HomeDepotHank69’s DD should fit in here somewhere, but I am not sure how. Maybe I'm just a fan.)\n\nIn chronological order, I think these are the technical DDs that suggest the story I’m about to tell.\n\nu/dejf2 \\- [The SI% is Fake](https://www.reddit.com/r/GME/comments/mhv22h/the_si_is_fake_i_found_44000000_million_shorts/)\n\nu/broccaaa \\- [The Naked Shorting Scam/Dark Pool Activity](https://www.reddit.com/r/Superstonk/comments/mvdgf5/the_naked_shorting_scam_in_numbers_ai_detection/)\n\nu/eastrod \\- [A Method for Hiding FTDs in Useless Puts](https://www.reddit.com/r/Superstonk/comments/mzgtvx/a_method_for_hiding_ftds_that_uses_the_109mil/)\n\nu/Criand \\- [Estimating Current SI% using Deep ITM Call Purchases](https://www.reddit.com/r/Superstonk/comments/nc1lny/ive_estimated_the_current_si_based_on_the_si/) and [May 20 ICC, DTC, OCC Rules Updates](https://www.reddit.com/r/Superstonk/comments/ngru15/the_flurry_of_rules_before_the_storm_dtc_icc_occ/)\n\nNow to the story.\n\n# Kenny’s Greatest Weakness: A Weird Obsession with Names\n\nOne thing we know about Ken Griffin is that [he thinks very carefully about names](https://www.chicagotribune.com/business/ct-ken-griffin-children-1109-biz--20141107-story.html).\n\nKenny used a spreadsheet to pick names for his children, despite his wife reporting that “he has shown little interest in them” after they were born. He used the spreadsheet “trying to ensure that any name or combination of letters wouldn’t doom his three children to ridicule.”\n\nNow look, I’m not saying Glacier is the tip of the iceberg or anything, buuuuut maybe I am.\n\nMy belief is that Kenny is obsessed with names that are evocative of real things but which also serve as metaphors for understanding what they do. I think it’s an attempt to be clever, and to hide private jokes in plain sight as a way to feel superior.\n\nKenny: \"Haha, I'll use Glacier first because it's only the tip of the iceberg! But they'll never know it because I'm going to get them to sell!\"\n\nI don't think Ken's a very funny guy, so if that doesn't seem funny it's because it isn't lol.\n\n**I have come to think of his this weird relationship with names as his supervillain weakness. He just can’t help himself, and it reveals everything about his plans.**\n\n# Evolution of the Apes and the MOAFUD\n\nI want to start by saying that I have more confidence in Apes than ever before. Apes have absolutely mastered the art of FUD War, now regularly calling out Forum Sliding, Anger Trolling, and coordinated shilling in nearly real time. Even more encouraging, Apes have done this by clearly defining their community rules and then *taking responsibility for enforcing them*.\n\nApes have intentionally learned together how to approach trolls and shills, how to recognize and deal with coordinated FUD, and how to maintain emotional control when under duress. The mods of Superstonk have been incredible at guiding this community through these troubles, but they couldn’t have done it had the Apes not constantly gotten better and better.\n\n**This is exactly what was needed to face the MOAFUD, which I believe has now been revealed.**\n\nAs I watched Apes swat aside threat after threat this past weekend, I knew the Apes had become the formidable diamond-handed badasses necessary to deal with any threat. Still, I knew the MOAFUD loomed and still hadn’t seen anything that pointed to it. Not until Glacier Capital.\n\nIt wasn’t long before I was convinced this was FUD, but I didn’t know its magnitude until [this crowdsourced DD came out theorizing that Glacier was one of many shell companies where Kenny had been hiding his shorts](https://www.reddit.com/r/Superstonk/comments/nf8nsd/theory_glacier_and_other_new_hfs_are_just_shells/). (I prefer the term shill companies to shell companies. Some of them are real and subservient to Kenny.)\n\n**That’s when it hit me: the emergence of Glacier means that the MOASS is imminent.**\n\nWhy? Because Glacier is just the tip of the iceberg. Haha Kenny, it’s neither funny nor clever. But it reveals everything.\n\n# The Games and the Names\n\nLike I said, it wasn’t until I saw Glacier that I realized Kenny’s obsession with names might be the key to revealing his endgame plans. Before I get to the crazy part, here’s the tl;dr:\n\n&#x200B;\n\n1. Kenny has been hiding the true SI% since January by using worthless puts to reset FTDs\n2. He has been using dark pools to funnel the scheme privately to his \"fortresses\"\n3. These shell companies will now act as a firewall to protect Citadel once the MOASS begins\n4. One by one they will be margin called, each time forming a plateau during the rise\n5. These plateaus will involve sideways trading for potentially days at a time\n6. During each plateau there will be a 24/7 multiplatform shill attack trying to get Apes to paperhand\n7. This is what 💎🙌 has been training Apes for. **It wasn’t for the wait, it was for the climb**\n\n&#x200B;\n\nHere are three names I will focus on:\n\nCitadel\n\nGlacier\n\nSessa\n\nThere is a bonus fourth hidden in the text, and even more in edits at the bottom thanks to commenters who are making some amazing connections.\n\nFirst, let’s look at Citadel.\n\nKenny is a medieval war history nerd. I don’t know it, I just feel it in my bones. His last name is Griffin, a medieval animal that appears on shield and flag heraldry. He likes to tell “war stories” about how he will fight to the last penny. He named his companies Citadel. All of them.\n\nAmerican Heritage Dictionary defines a citadel as,\n\n>\"A fortress or castle in or near a city, intended to keep the inhabitants in subjection, or, in case of a siege, to form a final refuge and point of defense.\"\n\nI think Ken called his company Citadel because it is a place of rulership, a place of refuge, and because he envisioned building it at the center of a network of fortifications that would extend his reach in times of prosperity and fall on their swords to protect him during times of war.\n\n[Maybe this DD is a partial list of the fortresses](https://www.reddit.com/r/Superstonk/comments/nf6i4o/the_chicago_code_how_a_whole_city_wants_to/). (I’ve only skimmed it.)\n\nI believe we’ve seen the first two fortresses leak in the last couple of days: Glacier Capital and [Sessa Capital](https://whalewisdom.com/filer/sessa-capital-im-lp). I know Glacier’s been the big talk, but u/hc000 alerted us to this as well:\n\n[Uhhh why dudes?](https://preview.redd.it/nmpzy1zss1071.jpg?width=1031&format=pjpg&auto=webp&s=3848f368f670229e57c352283e2cc5dff91287d0)\n\nRemember how Kenny named his children things that couldn’t be made fun of via any combination of letters or sounds? Well, “sessa” is literally a word that doesn’t exist. Look it up and the best you’ll find is that it’s an exclamation found only in Shakespeare. But that’s not the only thing interesting about sessa. The argument over what it means also fits into this theory.\n\nRemember that each of Kenny’s fortresses is meant to attack when strong and defend when under siege? Well, the most common understanding of sessa is that it means something like [“peace, be quiet” or “leave, have done, or let alone.”](http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.03.0067:entry=sessa&highlight=sessa)\n\nBut Dyce’s General Glossary to Shakespeare’s works (1904) has another interpretation, an opposite one, a martial one. In Dyce’s words,\n\n>“I must confess that I do not feel satisfied with these notes on sessa: if the word, as used in at least the second and third of the passages above referred to, may be illustrated by the following lines of Sylvester's *Du Bartas*, ed. 1641? Joshua urges on his troops:  \n>  \n>“Sa, sa, my Hearts! turn, turn again upon them,  \n>  \n>They are your own; now charge, and cheerly on them.”  \n>  \n>*The Captaines*, p. 182; where the original has “Cà, cà, tournons visage, allons!”\n\nKenny is smart, educated, and from a wealthy family. He learned Shakespeare, and may have even mastered it as a superficial sign of erudition. It could also lead him to being fond of medieval history, as I have suspected, and particularly stories of kings and armies. If he had mastered Shakespeare, maybe he had stumbled upon *Du Bartas* through Dyce and found the dichotomy perfect for one of his fortresses.\n\n**You know what else is a medieval story? Robinhood.** You know what else would be a \"joke\" hiding in plain sight? Calling something Robinhood that actually steals from the poor and gives to the rich. Just sayin’.\n\nAnyway, last thing about sessa. It appears only three times in Shakespeare, once in *Taming of the Shrew* and twice in *King Lear*. King Lear, like Kenny, had three daughters. Is the “shrew” his ex-wife? **Is Kenny sacrificing Sessa first as a fuck you to his ex-wife and their three children?**\n\nHey, it’s my theory, so I’m gonna say YES.\n\nYou know Kenny loves sessa. He probably imagines himself with a whip and a sword, telling paperhanded retail to sell faster, screaming “SESSAAAAAAA!” like a medieval *captaine* atop the ramparts of his Citadel.\n\nAnd just to bring this full circle, I think Kenny picked Glacier to go first because of the tip of the iceberg joke. Just look into his eyes and tell me that’s not his version of a serial killer leaving clues for the police.\n\n[Dem eyes doe](https://preview.redd.it/71booio6t1071.jpg?width=242&format=pjpg&auto=webp&s=f74161729ce70afd6ac35f7993943490bc2b1175)\n\n# Kenny's MOASS Strategy and the Mother of All FUD Revealed\n\nLet me just repeat what I said earlier. I believe the revelation of Glacier and Sessa means the beginning of the MOASS is imminent. I want to also repeat that I am not a technical or financial analyst and have no experience in markets whatsoever before January. This is just my theory of how the MOASS will play out, based on the analysis above and my own synthesis of everything I’ve read here during that time.\n\n**If what I say next is in any way FUDDY please let me know and I will clarify and/or retract it immediately!** I’ve avoided technical speculation in all my DDs because I know how much I don’t know, but this is my operating theory of how the MOASS will play out when it comes. I’m happy to adjust it if something is just dead wrong. This is just what I think Kenny's strategy is, I have no clue how it's going to actually play out.\n\nOk.\n\nIt’s long been suggested that the MOASS could take days or weeks to reach its peak, but that it wouldn’t look like a straight peak as in past squeezes. Rather, it could look like a series of sharp increases that represent margin calls, followed by a plateau as Apes still aren’t selling but the buying pressure of the margin calls dissipates.\n\nHouston Wade [laid this theory out](https://www.reddit.com/r/Superstonk/comments/n5b75j/houston_wade_says_the_hedge_funds_want_the/), that the hedgies would try to drag things out at a consistent lower price rather than let it all happen at once leading to a massive peak. I think that is accurately predicting Kenny’s strategy, but that it’s impossible because Apes own the float and the SI% is so, so, so high. He also says the DTCC might try to settle the outstanding shares once all the hedgies are gone. I have a third DD in the works that takes this premise and runs with it.\n\nBut, if the theory that Kenny has been spreading out the shorts is true, then I think one reason he’s doing it is to mitigate the damage any one margin call might do. I believe he knows what we know, though: **the only way Apes can lose is if they paperhand,** because we own the float so many times over that any reasonable margin call will almost certainly lead to a domino effect all the way back home.\n\nWell, what if Kenny has hidden the short interest in so many small firms that it’s no longer a huge weight around his neck, but “[thin, sort of stretched, like butter scraped over too much bread.](https://www.youtube.com/watch?v=fksu6FENojY)” The plan would be to trigger a margin call so small that the price of Gamestop jumped significantly but didn’t cause a domino effect. These firms can be small enough to avoid reporting requirements, or [in a favorable foreign territory such as Luxembourg](https://www.reddit.com/r/Superstonk/comments/nfcnp1/luxembourg_home_to_the_mysterious_glacier_capital/) where even more shenanigans might be available.\n\nKenny knows that Apes are diamond-handed, so as the buy pressure dissipates the stock’s action will resume its “normal” sideways trading pattern for a while. Could be hours, could be days until the next margin call, but a plateau that can be exploited nonetheless.\n\nI know Apes hate thinking about any kind of squeeze control, but I think it's wise to prepare for the worst, *particularly because we have nothing to lose by it*. We control everything, the only decision Apes have is sell or no sell. Thus, I believe that is what Kenny will attack with all his might.\n\n&#x200B;\n\n[We ready](https://preview.redd.it/mmfmo9dcv1071.jpg?width=1238&format=pjpg&auto=webp&s=b19709a92517fda8c6cb0fe66ecc54d832dc672d)\n\n**The Mother of All FUD is the all-out, 24/7, multi-platform blitz of** ***every shill at Kenny’s disposal***  **during the MOASS.**\n\nWarning: The next section imagines some scary scenarios. It's not meant to scare, it's meant to help us prepare.\n\nYouTubers, internet trolls, the mods of popular subs (not just GME subs), old media, new media, everything is going to be yelling at you to sell. They will call you stupid, lazy, young, a mob, terrorists…whatever they can to get you to sell.\n\nThey will try to get you to think about your broker balance. They will post gain porn and loss porn so manipulative you won’t believe it.\n\nI’m sorry to all of the genuine folks who post stories about “Why I hold” on here, but there will be amazing stories of what people have been able to do with their gains in the tens or hundreds of thousands. They will get sick children out of the hospital. They will post videos of their lambos. They will pay off their parents' debt for the first time in their lives. They will make you think about your own balance, and what you could do with it as it looks now. They are going to try to get at you however they can.\n\nThe Mother of All FUD is everything we have seen to date, and things we can’t imagine. Diamond hands are going to have to trust themselves, and everything they have built here over the past few months. Trust your knowledge, trust your exit strategy. Print everything, because reddit may go down.\n\n[If you don’t yet have one, I made a list of important MOASS and Exit Strategy DDs here.](https://www.reddit.com/r/DDintoGME/comments/n69qhp/compilation_of_moass_and_exit_strategy_dds_and/)\n\nAnd when we tune it out long enough, the next domino will fall. Kenny will once again try to set a plateau and hammer Apes to paperhand yet again. You thought it was hard to hold through a few hundred thousand in your account? What if your account shows $7 million and every news channel in the country plays a variation of this story,\n\n&#x200B;\n\n>“Citadel LLC has finally called it quits, ready to pay reddit army to save the U.S. economy. Founder Ken Griffin pleads with shareholders to save America from another financial crisis, speaking from an emergency meeting with President Biden and his top economic advisors.”\n\n&#x200B;\n\nLike any good villain, Kenny knows how to attack you by threatening those close to you. You start getting calls from your family. Your grandmother read in AARP magazine that GME is threatening her Medicare. Your coworkers think you’re putting their jobs in danger.\n\nYour partner’s father calls and says he’s worried you are going to bankrupt his retirement account. He’s heard that suicides are becoming common on Wall Street because you are holding GME and won’t let go. He asks your partner if the two of you have joined a cult. Their relationship is straining.\n\nYou’re looking at $7 million if you sell now. Life can go back to normal. Can you hold?\n\nThis shit is coming, Apes. This is the Mother of All FUD.\n\n**But it doesn’t matter, because Kenny’s weird obsession with names has given it all away.**\n\n# The Good News\n\nWe did it. I believe it. The MOASS is imminent, and we are the catalyst. I know we all want an external one, but let’s just take pride that our 💎🙌 and amazing community have fought so hard and so long for this moment to come. Let's take pride that we don’t need a catalyst, because the power is all in our hands. We need only the courage to hold it and to wield it.\n\nAfter everything, it comes down to the mantra.\n\n**Buy. Hodl. Vote. The shorts must cover.**\n\nThe longer we hold, the farther we will go, and we will have to go FAR if we want to touch Citadel. I know many of you want to go even farther than that, and to you I say GO FOR IT. We all came here for our own reasons, and we all HODL for our own reasons. Each of us is going to take this as far as we want it to go.\n\nNothing about this has been easy, just like Mark Cuban said. But the amount of change we have the ability to bring to the world is staggering.\n\nThe amount of growth we as a community have fostered in one another is equally staggering.\n\nWe are on the verge of the greatest economic event in history, the MOASS, the age of the Apes, where wealth and political power will be bent toward the good of humanity and away from the vanity and greed of psychopaths. And who did this?\n\nYou did. And you.\n\nYou beautiful x holder and you xxxx baby whale.\n\nYou reformed day trader, and you soon-to-be-retired daycare worker.\n\nYou crayon-eating monke, and you intelligent-but-perpetually-annoyed explainer.\n\nYou poet. You meme-maker.\n\nYou know-it-all. You dream-maker.\n\nYou shill-hunter, You upvoter\n\nYou DD authors, wrinkly as they come\n\nAll of our hearts will beat for yours forever.\n\n💓💓💓\n\nThis is it. The MOASS is coming. I do not know when, I am not implying when.\n\nI am saying that we will now know it when it comes, and as I have watched you for the past month, I  know that you are ready to see it through to change history.\n\nI’m proud to be an Ape. See you on the other side of space and time.  💎🙌💎💓🦍🚀🚀🌜\n\nBlanderson Snooper\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nP.S. Say something cool below and [you might make it into the FAQ](https://www.reddit.com/user/Blanderson_Snooper/comments/myi3zb/the_gme_wargame_dd_faq/)!\n\nP.P.S. Try out this awesome  [MOAFUD Simulator](https://www.reddit.com/r/Superstonk/comments/nh1129/the_moadfud_simulator_ultimate_diamond_hand/) designed by [u/ljtmudokon](https://www.reddit.com/user/ljtmudokon/). Let him know how you did and show him some love!\n\n**EDIT 1:** u/FutureR1chApe adds:\n\n>\"I'll also add something on this potential obsession with names: One of the way HF tried to get us to paperhand was by using a company named Rocket. And now, we are certain that it was a distraction because no one talks about it anymore, while there's been a lot of MSM articles about GME and other meme stocks.\"\n\nJohn Oliver: \"OF COURSE he did.\" --BS\n\n**EDIT 2:** tl;dr courtesy of u/Georgesoliman\n\n>\"This is serious boys. We have seen just how loyal the media has been with these funds both in January and over the past few months. If citadel and Kenny play this smart, they’re going to drag it out as long as possible, while using every psychological play in the book. It will be the true test of our diamond hands. We have seen dips, but what will all time highs with media vilification do? Will you give in to a friend of a friend or a family member telling you to paper hand out of fear for their livelihood? It’s going to be long and excruciating.  \n>  \n>But I believe in the apes. We have seen the DD. We have seen the psychological strategies. We have seen the reasons why we hold. We have learned just how corrupt the system is. We have gone as far as to recreate entire communities from the ground up several times. We’re ready. I truly believe in us. I believe that when we see the FUD we will remember every post, every fellow ape who has invested with us, and fall even more into the mindset of our namesake: Ape holds until we see the moon. Cheers my guys. Buy. Hodl. Vote. 🦍🦍🦍🚀🚀🚀\"\n\n**EDIT 3:** u/Site_rules drops a bomb.\n\n>\"The name Cordele means \"Warm-hearted.\" and is of \"Latin\" origin. The Cordele name has a total \"7\" characters and it starts from the character \"C\". It's an attractive name, easy to pronounce and is primarily considered for the baby girl names.\"  \n>  \n>Maybe having a girl's middle name is at the root of Kenny's obsession with names, \"trying to ensure that any name or combination of letters wouldn't doom his three children to ridicule.\"  \n>  \n>Is Kenny G our modern-day \"Boy named Sue?\"\n\nBS - Cordelia is the name of one of King Lear's three daughters. She is the one who tells him she can only love him out of family loyalty, causing him to banish her. Remember how his ex said that Kenny showed \"no interest in the children after they were born?\" 👀👀\n\n**EDIT 4:** u/pino_brown bringing the heat\n\n>I think Palafox Trading LLC, the repo market arm of Citadel is also part of the name game.  \n>  \n>Per Google: “The noble Spanish surname Palafox is of toponymic origin, derived from a place name where the original bearer resided or held land. The surname appears to derive from the Latin term “palatiolos,” which means “small palaces.”  \n>  \n>It’s also the name of two Spanish generals, Jose de Palafox y Melzi, 1st Duke of Zaragoza and his brother Luis Rebolledo.\n\nBS - General Jose de Palafox was 1st Duke of Zaragoza, which is in the autonomous community of Aragon. From 2003 to 2009, \"[Griffin was the lead investor in Aragon Global Management](https://en.wikipedia.org/wiki/Kenneth_C._Griffin).\" WTF is happening?\n\n**EDIT 5:** u/boomverz getting Biblical.\n\n>Fascinatingly Archegos is also a biblical term meaning a sacrifice, one who goes first\n\nu/Muertomus adds\n\n>Archegos also is derived from Greek which means \"One who leads the way\" \"The First to Go\" First Hedge Fund to collapse, an omen to say the least.\n\nBS: A different modern translation comes out as \"captain,\" which we already know Kenny likes.\n\n**EDIT 6:** u/MontyRohde confirms that the wealthy use meme names to flex their crime.\n\n>Enron hid loses from Joint Energy Development Investment Limited (JEDI limited) in a limited partnership called ChewCo.  \n>  \n>The elites also meme. Instead of images slathered with impact font, they give their shell companies silly names. Same frivolity but on a much grander scale with far grander stakes.\n\nBS - From the Wikipedia entry: \"Chewco Investments L. P. was a limited partnership associated with the Enron scandal, which resulted in the bankruptcy of Enron. It was named after the Star Wars character Chewbacca, because it was created to hide losses from the Joint Energy Development Investment Limited, known by its acronym \"JEDI\". Like Chewbacca, the Jedi Knights were prominent characters in Star Wars.\"\n\nSo, one of the scams that Kenny has based his on is confirmed to have used meme names for its shell company. 👀👀\n\nu/GrubWurm89xx points out more evidence this is a game the wealthy play.\n\n>Don't know if it's been posted but Enron had another joke name on there books. Mr. M. Yass, which probably stood for My Ass. Money was disappearing off the books and being paid to this person\n\n**EDIT 7:** u/ProgressiveOverlorde bringing some fun.\n\n>I think u may be right about his medieval naming obsession thing. Motley Fool is like his Court Jester\n\n**EDIT 8:** Just heard about Ashler Capital from [this thread unraveling all of Citadel's umbrella companies](https://www.reddit.com/r/Superstonk/comments/nghov2/the_final_nail_for_citadel_and_youre_holding_the/). According to the Free Dictionary an ashler is,\n\n>a rectangular block of hewn stone used for building purposes building block - a block of material used in construction work stone - building material consisting of a piece of rock hewn in a definite shape for a special purpose; \"he wanted a special stone to mark the site\"\n\nAshlers would be used to build citadels and fortresses, and may denote something special where they are used. What's so special about Ashler Capital, formed in 2019 and doubled in size since, according to their LinkedIn profile?\n\n**EDIT 9:** u/catsinbranches with the French lesson.\n\n>An alternative to your interpretation of “Sessa” is the French “cesse ça” which means “stop it”. Remember that his wife is French, and he has 3 young children. I’m willing to bet that gets said A LOT. If you say “cesse ça” quickly, it sounds exactly like “Sessa”. Maybe he’s hoping Sessa Capital can somehow put a stop to things?\n\n&#x200B;",
    "title": "Wargame Theory II: The Mother of All FUD (MOAFUD)",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ng4ja0/wargame_theory_ii_the_mother_of_all_fud_moafud/"
}