{
    "author": "Deceptiprawn",
    "created_utc": 1623148349.0,
    "distinguished": null,
    "edited": 1623158188.0,
    "id": "nv17eq",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nv17eq",
    "num_comments": 312,
    "permalink": "/r/Superstonk/comments/nv17eq/reddit_is_down_for_most_it_seems_if_you_can_read/",
    "score": 3524,
    "selftext": "\n Adding text for the sake of the 250 character rule. \n\ngot notification from @heyitspixel69 on Twitter this morning that Reddit was kicking a 503 error.\n\nAs suggested by others I use NordVPN and it seems to work fine.\n\nI love you all, see you on the moon!\n\nThat is all\n\nEdit: that was all…\n\nQuestion that came up that I’m unsure of:\n\n-What are angles of approach if/when the internet goes down and our floor has been savagely surpassed? More specifically, how do we sell our shares i.e. email, phone, etc?\n\nInversely, FORCE us to hold forever, I fucking dare them 🤣\n\nEdiit: better VPN suggestions have been made MullVad VPN and ProtonVPN\n\nfor NordVPN I found that loading different locations finally landed me on a server that got me through.\n\nAs well, redditstatus.com has a list of the fastly servers that are operational. Thanks u/s1609\n\nAlso, I was recently made aware of plan b: \n\nhttps://m.youtube.com/watch?v=9bZkp7q19f0\n\nEdiiit:\n\nFrom u/adno8854\n\n“Please consider changing your final link to the exit plan the mods spread every day. Your link is not on it. \n\nSuperstonkLive YouTube - Emergency Broadcast System\n\nhttps://m.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA\n\nhttps://twitter.com/ByeTriangle\n\nhttps://twitter.com/PinkCatsOnAcid\n\nhttps://twitter.com/RedChessQueen99\n\nhttps://twitter.com/rensole\n\nhttps://twitter.com/u_sharkbaitlol\n\nhttps://twitter.com/BradduckF “\n\nEdivt:\n\nConclusion: due to mechanisms that I don’t completely understand one or more major CDNs (content delivery networks) went down this morning for no reason that I have supporting evidence to point to. \n\n“Internet go down, I report ASAP for ape benefit and dissemination” tinfoil hat tightly wound. \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n 💎🙌",
    "title": "Reddit is down for most it seems. If you can read this spread the word, get a VPN if you don’t already have one, buy, and hold!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nv17eq/reddit_is_down_for_most_it_seems_if_you_can_read/"
}