{
    "author": "iSqueezeM",
    "created_utc": 1620313548.0,
    "distinguished": null,
    "edited": 1620346903.0,
    "id": "n69dwf",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n69dwf",
    "num_comments": 1297,
    "permalink": "/r/Superstonk/comments/n69dwf/how_about_we_freeze_superstonk_when_moass_takes/",
    "score": 18879,
    "selftext": "To protect superstonk from becoming WSB all over again, how about we put a plan to prevent that from happening. (If that’s not already in place) \n\nIf not now, maybe when MOASS takes off. \nWhen in time of war the first thing you do is protect your borders \n\n- No new members will be able to join during MOASS\n- mods cannot be replaced during MOASS \n- whatever other actions to freeze the sub. \n\nOnce we reach a new high it’ll be chaos here, just saying.\n\nEdit: wow I never imagined this will get so much traction, i guess I’m not the only one worried about this awesome sub. \nAfter reading your comments, it seems that most of us agree on taking preemptive action to protect our sub integrity. IMO the attack on WSb contributed in slowing the squeeze and they can do it again, that’s their only weapon. \n\nHere’s some more detailed ideas we can take to clean up from shills, like many of you suggested: \n\n- many are saying that shills are already here, if that’s the case let’s all report them each time they post FUD so mods can block them or remove them. \n- it is easier and faster to clean up shills accounts when no new ones are joining. We can either stop accepting new members or Allowing only trusted new members based on karma level, or by invite only. \n- mods can take them by surprise and implement these rules now before they start an attack on the sub. If we all agree\n- mods who open the gates during MOASS will be \nConsidered compromised and should be removed. Money can buy people, Vedgies have a lot of money to buy mods. \n- of course, trusting your DD and your own judgment  is key. But that’s exactly what shills are after when they attack.\n\nEdit 2: \n\n- Censorship is when you silence people who disagree with your opinion even when providing facts, that’s not what is meant here. we’re after bots, and hedge fund managers waging psychological warfare on apes, paying people to spread misinformation for their own financial gain. \n\n- yes Shills and sleeping cells are already in this sub, we don’t want new ones. \n\n- i love this sub and community so much and i hate to see it fall apart like wsb. it may need tweaking by the mods if they decided to do something concerning legality and such as some mentioned here.",
    "title": "How about we freeze Superstonk when MOASS takes off? No new members, no new mods",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/n69dwf/how_about_we_freeze_superstonk_when_moass_takes/"
}