{
    "author": "Chickenbutt82",
    "created_utc": 1620333220.0,
    "distinguished": null,
    "edited": false,
    "id": "n6gxmu",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n6gxmu",
    "num_comments": 100,
    "permalink": "/r/Superstonk/comments/n6gxmu/i_didnt_wanna_piss_in_anybodys_cheerios_this/",
    "score": 896,
    "selftext": "1. Gary Gensler’s released statement where the first point to be made involved the so-called “gamification” of investing.  If he was interested in doing the right thing, the FIRST, NUMERO UNO, point to be made should’ve been the rampant naked short selling of GME. PERIOD. But oh dear GOD save us from the fucking confetti after a trade is made in RH. What. In. The. Actual. FUCK?!  I mean for real?! That’s gonna take prime position over all of the corruption going on with a double dipping micro weenie whose job is to “provide liquidity in the markets” and is doing so on two different fucking fronts via short selling AND being a market maker?! Hello MCFLY?! It’s pretty damn liquid from where I’m fucking sitting. \n\n2. Nobody and I mean N O B O D Y in Congress or any of these regulatory, alphabet soup agencies are going to reform or change a financial system that they personally benefit from EVERY FUCKING DAY.  They don’t want us to have tendies. THEY WANT TO SHUT US DOWN! All of us. They are the very reason that Wall Street got a bailout in 2008 and all we got on Main Street was “aw too bad so sad.”  They got fat bonuses via our taxes to keep their fucking jobs and we got Dodd-Frank which is another fucking joke. After all of that bullshit with mortgages, if you are subprime, guess what? You get to pay PMI, primary mortgage insurance, to the lender. Is that insurance to protect YOU? Fuck no it ain’t. You’re paying an insurance premium to protect the lender in case YOU default.  All that worthless waste of paper got me was an extra $50/month on an FHA mortgage. But yet these banks are still sipping champagne with all their buddies in Congress laughing at all of the unwashed masses. \n\n3. We don’t fucking matter to them. We are of no consequence to any of them. This was just a fucking show to make it look like they give a flying fuck about average Joe investors. Don’t you know they want us to stay in our fucking lane?\n\n4. Whatever House Bill with all these awesome bullet points people we’re sharing a screen shot of earlier, it’s going to die in obscurity. It had all the fine points that would benefit average Joe investors, but it’s all part of the act. It’s going to sit on some intern’s desk and die. \n\nAnd if anything does come out of these congressional hearings it’s gonna be a smack down on retail and more leverage to the likes of Shitadell. They’re gonna be more concerned about the confetti graphics because they’ve made up a big ten cent word, gAmIfIcATion, to make it sound so much more serious. They have to protect us from making “bad investment decisions” or treating investing like a casino. Well I don’t know which one of those fucks needs to hear it but guess what? IT IS A FUCKING CASINO! It’s the biggest god damn casino in the world. You make a BET, you pull the fucking lever and you wait. \n\nI hodl XX shares and if this MOASS never pops off, they will have to pry them from my cold dead hands. Moon or zero. I ain’t fucking selling to nobody!",
    "title": "I didn’t wanna piss in anybody’s Cheerios this morning, but I knew that Congressional hearing was gonna be a shitshow for the following reasons…..",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6gxmu/i_didnt_wanna_piss_in_anybodys_cheerios_this/"
}