{
    "author": "the_nebraskan",
    "created_utc": 1624075794.0,
    "distinguished": null,
    "edited": false,
    "id": "o37tlh",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o37tlh",
    "num_comments": 41,
    "permalink": "/r/Superstonk/comments/o37tlh/the_two_lines_of_002_that_gets_my_tits_absolutely/",
    "score": 741,
    "selftext": "[Source Document](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-002.pdf)\n\n**NSCC-2021-002, SEC. 8. Satisfaction of Intraday Supplemental Liquidity Calls.**\n\nUnless otherwise determined by the Corporation, within one hour of demand of an Intraday Supplemental Liquidity Call from the Corporation, a Member shall make an additional Supplemental Liquidity Deposit to the Clearing Fund in the amount of the Intraday Supplemental Liquidity Call.\n\n**NSCC-2021-002, SEC. 11 Obligations of Affiliated Families and Supplemental Liquidity Providers**\n\nIn the event of any failure of a Supplemental Liquidity Provider to satisfy a Liquidity Obligation in full when due, the Corporation may \n\n(i) debit the amount of any such deficiency to the account of such Member, \n\n(ii) collect such amount in system wide settlement, and \n\n(iii) credit such amount as a Supplemental Liquidity Deposit for the account of such Member. \n\nThe Corporation may also exercise any and all of its other default rights under these Rules.",
    "title": "The two lines of 002 that gets my tits absolutely jacked \"Unless otherwise determined by the [NSCC] within 1 hour of demand of [liquidity] from the [NSCC], a member shall make a [deposit]\". \"In the event of any failure of [liquidity] ... the [NSCC] may collect such amount in system wide settlement\".",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o37tlh/the_two_lines_of_002_that_gets_my_tits_absolutely/"
}