{
    "author": "fortifier22",
    "created_utc": 1625450338.0,
    "distinguished": null,
    "edited": false,
    "id": "odxmwd",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_odxmwd",
    "num_comments": 284,
    "permalink": "/r/Superstonk/comments/odxmwd/crack_theory_the_united_states_government_needs/",
    "score": 3223,
    "selftext": "The US Government has a lot to gain from the MOASS happening, and so much more to lose from preventing the MOASS from not happening. And it's not just 37% capital gains taxes either.\n\n[As other DD has proven, Citadel has far too much power within the stock market.](https://www.reddit.com/r/Superstonk/comments/od4bb1/the_sun_never_sets_on_citadel_part_2/) And with their recent actions and numerous violations without solid consequences, it is in the government's best interest to stop them.\n\nWe also know from the actions of the financial regulators that they have been pumping out new rules like there's no tomorrow which protects themselves and ensures that no matter who falls they'll be covered and the destruction of any hedge funds won't have too significant of an effect on the markets.\n\nBut most importantly, the more the MOASS is delayed, the more the general public becomes aware of all the corruption within the US Financial Markets, and the less control they have over the people and the narrative.\n\nWith so many topics related to financial regulators, GME, MSM mistakes, and SHF's trending on Twitter every week, and with how much attention r/superstonk is now garnering (and of course with so many GME investors refusing to sell), they've practically already lost their ability to control the narrative despite all their money, fame, and power.\n\n**With all these things in mind, the government needs SHF's to fall as scapegoats for the mess they got themselves in, and for those who went long on GME to be rewarded with their inevitable tendies (and of course the capital gains taxes for the government). It is the only way to minimize the fallout of ANOTHER impending market crash; especially one that's coming just as society is just starting to recover from the pandemic.**\n\nI still know that there are going to be protests and angry mobs; even towards the HODLers of GME who were able to make unimaginable wealth off \"manipulating the system\" (even though they've done nothing wrong and did anything but manipulate the system).\n\nBut hopefully with time, and with the newfound power of GME holders, the general public will be able to solve the actual manipulation that has been going on for too long.\n\n# TL:DR; The US Government desperately needs to get rid of Wall Street funds that have gotten too powerful, scapegoats to shift blame off them for the next crash, and for them not to lose control of the general public once the crash happens. The MOASS is their best chance for all these things to happen, and they more than likely know this as well and are doing what they can to make it happen.",
    "title": "Crack Theory: The United States Government needs the MOASS to happen, and wants corrupt agents like Citadel to fall",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/odxmwd/crack_theory_the_united_states_government_needs/"
}