{
    "author": "1FuzzyPickle",
    "created_utc": 1625458782.0,
    "distinguished": null,
    "edited": 1625485190.0,
    "id": "odzlm3",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_odzlm3",
    "num_comments": 240,
    "permalink": "/r/Superstonk/comments/odzlm3/hyping_everyday_will_make_us_appreciate_that/",
    "score": 3970,
    "selftext": "Think about it, it’s the morning of the MOASS. The premarket opens, not much happens. You think it’s just another day of sideways trading. Then all of a sudden the spike happens. It hits $350 in a matter of seconds.  $420. $500. $750. $1000. \n\nThe adrenaline rush kicks in, suddenly you need to take a seat. You’re dizzy. You take a drink of water and go back to watching the ticker climb. You call off work for the rest of the day.\n\n$10,000. \nYou log on to /r/superstonk, 500,000 people are online. Confusion and excitement floods the sub. The memes are off the charts.\n\n$50,000.\nYou’re in disbelief, but you’ve known for months this would happen. The countless hours you’ve spent reading DD were right. You’ve done your best to prepare for this moment. Now you’re wondering how high will this actually go.\n\n$100,000.\nThe balance between the 1% and 99% are beginning to teeter. Suddenly the mega rich are fearing for their wealth while dumb money is becoming multimillionaires in a matter of hours.\n\n$1,000,000.\nA few days go by. You quit your job. You begin to realize you’ll never have to work another day in your life. You won’t have to fight and slave away anymore at a job that doesn’t appreciate you.\n\n$10,000,000.\nA week passes. You’ve found generational wealth. Your friends, family, children, will never have to work another day in their life. Euphoria takes you.\n\n$25,000,000.\nYou’ve probably sold a few shares. You’ve secured generational wealth. You quit your job, you hug your significant other and tell them to pick out their nicest outfit because you’re going to drop $10,000 on dinner tonight. Now it’s time to decide on what your ultimate vacation destination is.\n\n$50,000,000.\nYou’ve sold a few mores. Now you’ve left the remaining bit in the infinity pool. How far will this actually go? It doesn’t matter, you have more money than you will ever need. It’s time to return some of that wealth back into the community.\n \nI can’t wait for tomorrow.\n\nEdit: As others in the comments have pointed out, only sell on the way down! This blew up a lot more than I anticipated!",
    "title": "Hyping everyday will make us appreciate that first day of the MOASS more than anything.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/odzlm3/hyping_everyday_will_make_us_appreciate_that/"
}