{
    "author": "Royaltycoins",
    "created_utc": 1624462171.0,
    "distinguished": null,
    "edited": 1624492694.0,
    "id": "o6f5bm",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o6f5bm",
    "num_comments": 105,
    "permalink": "/r/Superstonk/comments/o6f5bm/002_was_never_meant_to_be_a_moass_trigger_its/",
    "score": 1487,
    "selftext": "There's probably never going to be a world in which this sub won't hype up something like 002 - but as others have suggested, it's unlikely that it will be a MOASS trigger on its own.\n\nIf indeed the GME outstanding short interest is as big as we believe it to be, it is essentially a 'nuclear bomb' lying beneath the capital markets. We know that other long positions held by Citadel and SHFs, (which consist of major holdings in major American companies) would be force liquidated following a margin call, producing loss of value for every mom and pop who religiously bought their Google and Apple for the last 30 years and don't deserve to be in the blast radius when the bomb goes off.  THIS is what the powers that be want to prevent. They do not see MOASS as a good thing obviously, its instead something for them to defuse and limit wherever possible.\n\nThus, seeing it through this lens of systemic risk, I wouldn't be surprised if the Fed is simply printing infinity money for Citadel to use to keep the price exactly where it is so that they can get everything in line so that MOASS goes down exactly as they want it to.\n\nIt's clear that the implementation of the new rules this year are to A) build out procedural infrastructure where there previously was none, B) prevent something like this from ever happening again while consolidating power within major market players (as u/Criand has mentioned). And C) get the capital markets in place EXACTLY as they want them before any MOASS occurs. The point of DTCC, OCC, ICC rule implementation this year is not to KICK OFF the MOASS, it's to get the house in order so that the bomb detonates in a specially constructed, 'reinforced safe room' below the house.\n\nEnter 002. 002 is implemented NOT so that they can margin call Citadel at all hours of the day, but to send out a kind of 'radar signal' to determine which other unrelated funds/institutions would be force liquidated in the event of a MOASS. It's both a warning call to anyone who's close to falling below their net-cap requirement - 'Hi, this is DTCC calling before Marge, get your shit together please,' and as well paints an hourly picture to the DTCC (and by extension, the Fed, the White House?) of what the collateral damage would be at any given moment. It could also allow for early forced liquidations to get rid of risky parties on the verge of default to prevent a chain reaction.\n\nOthers have said that when it happens, MOASS will occur on some random day, at some random time, and I believe that because it will be at the time most ideal for the powers that be. This isn't to say that MOASS won't happen, it's to say that it happens on their time and not our time.\n\n**TLDR:** 002 allows for an hourly radar ping for the DTCC, a 'bomb sniffing dog' if you like. It is first and foremost meant to alert the DTCC to OTHER problematic players whose balance sheets are at risk, and get them to either shore up their net capital, or take them out quietly before any MOASS so that it happens exactly as they want it to be with limited collateral damage to other institutions and players.  Nothing changes. Buy and HODL.\n\n&#x200B;\n\nDisclaimer: This is not financial advice. It is pure theorization and speculation. I eat crayons by licking them like lollipops until they melt.",
    "title": "002 Was Never Meant to Be a MOASS Trigger - It's Meant to Be a DTCC Bomb Dog.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6f5bm/002_was_never_meant_to_be_a_moass_trigger_its/"
}