{
    "author": "shroomz11",
    "created_utc": 1624491574.0,
    "distinguished": null,
    "edited": false,
    "id": "o6ouxn",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o6ouxn",
    "num_comments": 114,
    "permalink": "/r/Superstonk/comments/o6ouxn/ken_griffin_was_in_meeting_day_before_bear_sterns/",
    "score": 4037,
    "selftext": "The day before Bear Sterns crashed, the Federal Reserve held a private, non recorded meeting with many of the investment banks, with the exception of Bear Sterns. In attendance was Fed Chief Ben Bernanke, the NY Fed President, Jamie Dimon, and the rest from Goldman Sachs, Morgan Stanley, Merrill Lynch among a few others and none other than our mayo loving boy Kenneth Griffin.\n\nThe same day this meeting was held, someone spent $1.7 million on options, betting they would crash within 9 days, and made $270 million. The SEC said they would look into it but nothing ever came about, yet they are known to travel internationally to investigate insider trading from a $2000 profit. The article below explains how all the investment banks ganged up on Bear Sterns toward the end and colluded them into bankruptcy, and through many tactics resulted in consolidated financial and political power during 2008. Of course they are equally to blame in the crash, but these psychopaths are extremely intelligent, and their collusion knows no bounds.\n\nI’d recommend reading the full article here: [Wall Street’s Naked Swindle - Rolling Stone](https://web.archive.org/web/20210213125246/https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/)\n\nSome excerpts below. \n\nOn Tuesday, March 11th, 2008, somebody — nobody knows who —made one of the craziest bets Wall Street has ever seen. The mystery figure spent $1.7 million on a series of options, gambling that shares in the venerable investment bank Bear Stearns would lose more than half their value in nine days or less. It was madness — “like buying 1.7 million lottery tickets,” according to one financial analyst. But what’s even crazier is that the bet paid.\n\nAt the close of business that afternoon, Bear Stearns was trading at $62.97. At that point, whoever made the gamble owned the right to sell huge bundles of Bear stock, at $30 and $25, on or before March 20th. In order for the bet to pay, Bear would have to fall harder and faster than any Wall Street brokerage in history.\n\nThe very next day, March 12th, Bear went into free fall. By the end of the week, the firm had lost virtually all of its cash and was clinging to promises of state aid; by the weekend, it was being knocked to its knees by the Fed and the Treasury, and forced at the barrel of a shotgun to sell itself to JPMorgan Chase (which had been given $29 billion in public money to marry its hunchbacked new bride) at the humiliating price of … $2 a share. Whoever bought those options on March 11th woke up on the morning of March 17th having made 159 times his money, or roughly $270 million. This trader was either the luckiest guy in the world, the smartest son of a bitch ever or…\n\nOr what? That this was a brazen case of insider manipulation was so obvious that even Sen. Chris Dodd, chairman of the pillow-soft-touch Senate Banking Committee, couldn’t help but remark on it a few weeks later, when questioning Christopher Cox, the then-chief of the Securities and Exchange Commission. “I would hope that you’re looking at this,” Dodd said. “This kind of spike must have triggered some sort of bells and whistles at the SEC. This goes beyond rumors.”\n\nCox nodded sternly and promised, yes, he would look into it. What actually happened is another matter. Although the SEC issued more than 50 subpoenas to Wall Street firms, it has yet to identify the mysterious trader who somehow seemed to know in advance that one of the five largest investment banks in America was going to completely tank in a matter of days. “I’ve seen the SEC send agents overseas in a simple insider-trading case to investigate profits of maybe $2,000,” says Brent Baker, a former senior counsel for the commission. “But they did nothing to stop this.”\nThe SEC’s halfhearted oversight didn’t go unnoticed by the market. Six months after Bear was eaten by predators, virtually the same scenario repeated itself in the case of Lehman Brothers — another top-five investment bank that in September 2008 was vaporized in an obvious case of market manipulation. From there, the financial crisis was on, and the global economy went into full-blown crater mode.\nLike all the great merchants of the bubble economy, Bear and Lehman were leveraged to the hilt and vulnerable to collapse. Many of the methods that outsiders used to knock them over were mostly legal: Credit markers were pulled, rumors were spread through the media, and legitimate short-sellers pressured the stock price down. But when Bear and Lehman made their final leap off the cliff of history, both undeniably got a push —especially in the form of a flat-out counterfeiting scheme called naked short-selling.\n\nThat this particular scam played such a prominent role in the demise of the two firms was supremely ironic. After all, the boom that had ballooned both companies to fantastic heights was basically a counterfeit economy, a mountain of paste that Wall Street had built to replace the legitimate business it no longer had. By the middle of the Bush years, the great investment banks like Bear and Lehman no longer made their money financing real businesses and creating jobs. Instead, Wall Street now serves, in the words of one former investment executive, as “Lucy to America’s Charlie Brown,” endlessly creating new products to lure the great herd of unwitting investors into whatever tawdry greed-bubble is being spun at the moment: Come kick the football again, only this time we’ll call it the Internet, real estate, oil futures. Wall Street has turned the economy into a giant asset-stripping scheme, one whose purpose is to suck the last bits of meat from the carcass of the middle class.\n\nWhat really happened to Bear and Lehman is that an economic drought temporarily left the hyenas without any more middle-class victims — and so they started eating each other, using the exact same schemes they had been using for years to fleece the rest of the country. And in the forensic footprint left by those kills, we can see for the first time exactly how the scam worked — and how completely even the government regulators who are supposed to protect us have given up trying to stop it.\n\nThis was a brokered bloodletting, one in which the power of the state was used to help effect a monstrous consolidation of financial and political power. Heading into 2008, there were five major investment banks in the United States: Bear, Lehman, Merrill Lynch, Morgan Stanley and Goldman Sachs. Today only Morgan Stanley and Goldman survive as independent firms, perched atop a restructured Wall Street hierarchy. And while the rest of the civilized world responded to last year’s catastrophes with sweeping measures to rein in the corruption in their financial sectors, the United States invited the wolves into the government, with the popular new president, Barack Obama — elected amid promises to clean up the mess — filling his administration with Bear’s and Lehman’s conquerors, bestowing his papal blessing on a new era of robbery.\n\nThen, on March 11th — around the same time that mystery Nostradamus was betting $1.7 million that Bear was about to collapse — a curious thing happened that attracted virtually no notice on Wall Street. On that day, a meeting was held at the Federal Reserve Bank of New York that was brokered by Fed chief Ben Bernanke and then-New York Fed president Timothy Geithner. The luncheon included virtually everyone who was anyone on Wall Street — except for Bear Stearns.\n\nBear, in fact, was the only major investment bank not represented at the meeting, whose list of participants reads like a Barzini-Tattaglia meeting of the Five Families. In attendance were Jamie Dimon from JPMorgan Chase, Lloyd Blankfein from Goldman Sachs, James Gorman from Morgan Stanley, Richard Fuld from Lehman Brothers and John Thain, the big-spending office redecorator still heading the not-yet-fully-destroyed Merrill Lynch. Also present were old Clinton hand Robert Rubin, who represented Citigroup; Stephen Schwarzman of the Blackstone Group; and several hedge-fund chiefs, including Kenneth Griffin of Citadel Investment Group.",
    "title": "Ken Griffin was in meeting day before Bear Sterns crash where investment banks colluded to bankrupt them",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6ouxn/ken_griffin_was_in_meeting_day_before_bear_sterns/"
}