{
    "author": "mybustersword",
    "created_utc": 1627753296.0,
    "distinguished": null,
    "edited": 1627753641.0,
    "id": "ovbhjd",
    "text_only": true,
    "flair_text": "Unreviewed 𝘋𝘋",
    "name": "t3_ovbhjd",
    "num_comments": 152,
    "permalink": "/r/DDintoGME/comments/ovbhjd/brazil_puts_derivatives_and_quantum_computingthe/",
    "score": 993,
    "selftext": "Two funds in brazil recently opened a LARGE amount of puts on gme. Derivatives market is off the chain right now. Lets take a closer look into this. Recently I discussed how IBM technologies is at the center of the hedge funds and retail trading battleground. I'd like to discuss a bit what/how it is actually happening here. \n\n******\n\nhttps://www.investopedia.com/ask/answers/051115/when-was-first-swap-agreement-and-why-were-swaps-created.asp\n\nIBM essentially created the first derivative market using a swap. Per the article :\n\n\"IBM and the World Bank entered into the first formalized swap agreement in 1981, when the World Bank needed to borrow German marks and Swiss francs to finance its operations, but the governments of those countries prohibited it from borrowing. \nDuring the 2008 financial crisis when credit default swaps on mortgage-backed securities (MBS) were cited as one of the primary contributing factors to the economic downturn.\"\n\n\n\nhttps://www.risk.net/derivatives/7729656/goldman-ibm-lay-out-quantum-roadmap-for-derivatives-pricing\n\n\" The pricing of derivatives is computationally intensive, and becoming more so as derivatives become more complex. It’s a process that could – and perhaps one day will – be improved using a quantum computer, according to executives at Goldman Sachs and IBM.\"\n\nhttps://www.americanbanker.com/miscellaneous/-65070-1.html. \n\nIBM has a history of speeding up derivatives markets-a new strategy developed in 1995 to change how derivatives market is priced. This is a continuing issue-ibm has been at the forefront of new investment technologies and staying 2 steps ahead of the market. \n\n\nhttps://www.zdnet.com/article/ibms-newest-quantum-computer-is-now-up-and-running-heres-what-its-going-to-be-used-for/\n\nIn fact, IBM \"just released\" their new quantum computer.... Hm\n\nhttps://www.ibm.com/thought-leadership/institute-business-value/report/exploring-quantum-financial\n\nExplanation of use of quantum computing for stock prediction and risk analysis. \n\n\nhttps://outsideinsight.com/insights/how-hedge-funds-employ-ai-to-facilitate-trading/\n\n\"Bridgewater Associates, notably the world’s largest hedge fund with $160B under management, built a machine learning algorithm taken straight from its employees’ brains, according to a NYT article from December 2016. Intended to do more than improve accuracy, billionaire founder Ray Dalio claims he wants to “ensure the company can run according to his vision even when he’s not there.”\n\nTheir team, the Systematized Intelligence Lab, is led by David Ferrucci who worked on IBM’s Watson. They have famously taken AI internally as well, with meetings recorded and staff asked to grade each other throughout the day using a ratings system called “dots”. These ratings are incorporated into “Baseball Cards” that show employees’ strengths and weaknesses.\"\n\n\nRay Dalio was a big bet on gme in 2018 when gme dropped from 18 to 12. \n\nhttps://www.investopedia.com/news/ray-dalio-made-big-bet-gamestop-q1-13f/\n\n******\n\nSo we have a connection with IBM and their tech to change the way we approach the \nstock market and trading. What about these Brazilian banks? \n\n\nhttps://www.research.ibm.com/labs/brazil/\n\nIBM Research – Brazil was established in June 2010, with locations in São Paulo and Rio de Janeiro. Developers, engineers, scientists and other experts at these labs are dedicated to advance artificial intelligence, hybrid cloud, security and quantum.\n\n\nhttps://finance.yahoo.com/news/bm-fbovespa-cetip-deal-heads-162358858.html\n\nOddly enough in Brazil, they have one market maker completing majority 90% of transactions. B3 is pretty much the only market maker.\n\n\nhttps://www.bnamericas.com/en/interviews/this-is-ibms-biggest-investment-in-latin-america-in-recent-years\n\nIBM is building 3 data centers for ai and cloud computing in Latin America. \n\n\nhttps://quantumcomputing.com/whurley/hedge-funds-start-experimenting-with-quantum-investing\n\n2017 Renaissance Technologies, DE Shaw, and Two Sigma Are All Testing Quantum Investing. Where have we seen these names before? \n\nPer recent  posts the Brazilian banks have been replaced with griffo hedging by credit suisse, a hedge fund located in Sao Palo. Same place ibm is located. Interestingly.. \n\nhttps://www.reuters.com/article/us-credit-suisse-brazil-stuhlberger-idUSBREA381U520140409\n\nHedgingGriffo was started by Luis Stuhlberger. Sold majority stake to Suisse in 2006. \"Since then, the Swiss bank has pocketed over 4 billion reais in profit from Hedging-Griffo.\" \n\nNote - while these links are juicy, keep in mind if you cannot verify it independently for yourself, it's worth questioning its veracity. I cannot find anything on griffo wea,per the Superstonk posts. \n\n\nLink to criands comment on short interest with math\n https://www.reddit.com/r/Superstonk/comments/otn94a/can_anyone_explain_the_over_one_million_put/h6x2h7a\n\n*******\n\n**Speculation.**\n\nIt appears to me, that the tools used by hedge funds are ai and quantum powered computing, through companies like IBM. IBM appears to be a large provider of such services to the major hedge funds in play.\n\nOf note, IBM and hedge funds-mainly citadel, Jane St, Five Rings, etc... have a long history with poaching MIT interns for investment and trading. Griffin hosts a large intern summer camp in fact, stuhlberger ceo of griffo hedging had a breakfast  with mit alumni in Brazil in 2020.\n\nhttps://brazil.alumclub.mit.edu/s/1314/bp19/interior.aspx?sid=1314&gid=135&pgid=52053&sparam=Stuhlberger&scontid=0\n\nIf anything, the Brazil puts and connections with IBM and MIT show that market manipulation itself is not a conspiracy, but the industry norm, with new traders literally being groomed and cultivated while still in school. IBM also owns citadel data center (which I cannot link as it gets removed, Google lakeside data center and Tahoe reno 1).",
    "title": "Brazil puts, derivatives, and quantum computing-the market is changing faster than anyone can keep up.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/DDintoGME/comments/ovbhjd/brazil_puts_derivatives_and_quantum_computingthe/"
}