{
    "author": "DavidNIO",
    "created_utc": 1613383251.0,
    "distinguished": null,
    "edited": 1613407645.0,
    "id": "lkal7q",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_lkal7q",
    "num_comments": 652,
    "permalink": "/r/GME/comments/lkal7q/warning_there_are_several_people_trying_to/",
    "score": 2269,
    "selftext": "Fundamentals of share trading is different to the fundamentals of a business. Business can make profit or have losses like Tesla,  However share trading is based on the following principles,  and this is core of trading. \n\nSupply & Demand,  Bids & Asks. This is the formula of share trading.  What they did is , they took out the Bids from the equation by getting brokers to restrict. \n\nRobinhood said liquidity was the issue,  they had to make sure they had enough cash before letting us trade. That is an UTTER LIE. If they had liquidity issue they shouldn't have allowed any trades for any instrument. But they allowed only sell and most of the attacks were done during premarket and after hours to lower the next day opening price.\n\nSo taking the Bids out of the equation hasn't worked well so they wanted  to control  the ASK price. So Fidelity came here and asked people to make the switch.  We need to investigate to see who are the people posted those posts and if they are linked to Fidelity customer service support. I'm sending out a detailed report to the Congress. Whether Fidelity has done anything wrong or not I WOULD IMMEDIATELY SWITCH AWAY FROM FIDELITY TO MAY BE WEBULL,  INTERACTIVE BROKERS, OR REVOULT OR SOMETHING WHO DOESN'T RESTRICT YOUR SELL PRICE.\n\nNow we have too many idiots here working on behalf of Hedge Funds and trying to convince us to settle for less than  what we deserve. \n\nIf we don't let the buyer to decide my house sale price, if we don't let the buyer to decide the sale price of my car sale price, then why the heck would I let them to decide my share sale price?\n\nWe all know the simple rule about shorting. Shorting can bring potentially infinite amount of losses. So $10000/share or $69420/share or $77,777/share  IS NOT A MEME. Value of a stock is the perception,  what people think? At which price I want to sell my asset. legally I do have the right to have my say in the market.  \n\nIf my broker only allows me to put only 50% from market price the  I would immediately switch. Always have more than one broker as a back up. Someone posted Fidelity allows you to put high price if you pay extra. NO YOU SHOULDN'T HAVE TO PAY EXTRA TO HAVE YOUR SAY. \n\nI think this week I'm going to value my stock at $77,777 and next week $88,888 and the following week $99,9999 Lets see where they want to settle. \n\n\nWhy do I value like that? \n\n1.I like the stock,  I own it, my asset so I can value however I want. Only one reason I need to buy a stock, so I bought it.\n\n2. Share trading is all about Supply and Demand,  I understand that what I hold now has more demand than GOLD or Diamonds.  Because they have shorted more than the amount that they are legally allowed to short. Which means we could see them going to jail after the hearing and possible court case. We haven't done anything wrong. They are just trying to spread fear because that's what they do when they fail big.  They need to buy probably more than 70-100 million shares in my view. Reports are manipulated. So even if the entire institutional owners sell their shares Hedge Funds still need to buy my shares to cover.\n\n$77,777 this week =>  $88,888 next week => $99,999 and so on week by week.\n\nHEDGE FUND dumb idiots don't even have shares to short now , how the heck would you say short squeeze done? It hasn't even begun.  They never went to school? If they  did they  wouldn't shorted more than the float would they?\n\n\nThis is not a price coordination,  this is me setting price targets for my assets based on growing demand just like Wall Street analysts do on CNBC for their holdings.  If you guys agree with my statement then you can value however you want. It's upto to you.  \n\nSo if any Hedge Fund moron wants to comment to this post then get a broom stick and stuck it up there.  Don't come here to tell me what to do after conducting robbery in day light.\n\n\nUpdate:  via active trader pro (Fidelity), you can set a limit sell order.\nvia Trade Armour in the Sell Trigger Bracket for whatever price you want.\nPlease confirm this update that I received.",
    "title": "⛔ WARNING ⛔ There are several people trying to convince us $1000/share is reasonable but I want $77,777/share. So read this DIAMOND UPDATE 📣",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/GME/comments/lkal7q/warning_there_are_several_people_trying_to/"
}