{
    "author": "holzbrett",
    "created_utc": 1628175987.0,
    "distinguished": null,
    "edited": 1628235439.0,
    "id": "oykaws",
    "text_only": true,
    "flair_text": "Unreviewed 𝘋𝘋",
    "name": "t3_oykaws",
    "num_comments": 248,
    "permalink": "/r/DDintoGME/comments/oykaws/google_survey_for_germany_germany_owns_the_boat/",
    "score": 1997,
    "selftext": "**TL;DR: Germany owns the boat \\~1x with around** **~~79,600,000~~** **69.476.000 shares.**\n\n**TA;DR: There should be no way that armitards or other europoors own even a single share of this great company.**\n\n&#x200B;\n\nEdit: There are many criticisms to this analysis. I will try to address most of them here. I am glad that ppl are sceptical and I urge you to disprove these numbers because they are just insane.\n\n1. The analysis is only married couples adjusted, not couple adjusted in general: Yes that is true, not every couple holds one account but to stay conservative we can use 19% couples, 51.4% married couples and the rest singles. The resulting number is **69.476.000 shares**. 10mm less but still insane!\n2. There must be a huge bias because not everyone is on the internet and answers polls like this: Almost every single person younger than 65 years old uses the internet. Google is truly amazingly capable of reaching most of these users through ads on videos, if one downloads apps or reads articles. Furthermore I would argue that tech savvy people use ad blockers and can't be reached far more likely than the generation of my parents. Check out this link for more information:[ https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Einkommen-Konsum-Lebensbedingungen/\\_Grafik/\\_Interaktiv/it-nutzung-alter.html](https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Einkommen-Konsum-Lebensbedingungen/_Grafik/_Interaktiv/it-nutzung-alter.html)\n3. The data is not reliable, because it is google survey and people just click randomly and don't really answer questions: Yes it is possible that online surveys and surveys in general are flawed instruments. Yes there will always be and error in the data. But in general there is a scientific understandment, that surveys conducted like this have some value and can be used scientifically. Check out the FAQ to google survey to find out more about their approach so that you don't have to trust me here [https://support.google.com/surveys/answer/2753080?hl=en#zippy=%2Cin-this-article](https://support.google.com/surveys/answer/2753080?hl=en#zippy=%2Cin-this-article)\n4. The numbers are just insane and way to high, there must be a huge error in this analysis: Yes the numbers are insane af, and even I don't know what i should think of them. If this was the only indicator of uckery I would highly doubt them, but for me there are flashing red lights everywhere in regards to GME. Nonetheless I am still sceptical. The number of Germans active in the stock market rose lately by a lot, possible in regards to GME too. I can see that in my close friend and family circle too, just check out the link for more informations:[ https://www.ft.com/content/31c4d453-498e-4cc2-b14f-d7e8b17b9221](https://www.ft.com/content/31c4d453-498e-4cc2-b14f-d7e8b17b9221)\n\n# 1. Shout-out and Introduction\n\nAs you guys probably already know there was a google survey done by [u/Get-It-Gotand](https://www.reddit.com/u/Get-It-Gotand/) he pretty much found out that the official numbers are most likely bullshit. I myself as a mid xxx holder wanted to know how Europe and especially my country of origin is doing in regards to my favorite stock. My expectations were conservative with around 0.5% to 1% of the population as GME owners, I even was worried that there were so few stockholders, that it would be statistically insignificant. Boy oh boy was I wrong.\n\nMy survey is a translated copy of the above mentioned survey in armitardland, so that comparisons with it and similar future surveys are possible. Countries like France, UK, Netherlands, Italy and Russia would be really interesting to investigate further, so if one of you guys are willing and still have money to spend on something else than shares, do it!\n\n# 2. Methodology\n\n**“Representative, Randomized sampling and why does it make sense for this project?** Representative sampling allows researchers to understand the behaviors and/or characteristics of a population by identifying the behaviors and/or characteristics of a subset of the population. In the case of this research, this was done through a randomized, internet-based survey that asked a very simple question about the status of $GME share ownership.\n\nResults from this survey to draw conclusions about the behaviors and characteristics of a wider group, in this case, the whole of the U.S. adult population. In combination with randomized sampling, it’s possible to understand things about a population of millions by surveying only hundreds or thousands of individuals.\n\nRepresentative, randomized sample is especially valuable to simply, binary data (do own, don’t own), as well as grouping (how many shares owned). Given this, and the affordability of GCS as a surveying tool ($.10/sample), this approach was sensible.”\n\n\\- This is a direct quote from [u/Get-It-Got](https://www.reddit.com/u/Get-It-Got/)\n\nThe survey population is the german population above 18 years old. In the survey the number of shareholders above 65 was miniscule, so it was decided to exclude everyone from this age cohort in this analysis to stay conservative. The total number (excluding below 18 and above 65) is 51.2 million people. The percentage of married persons is about 51.4% and every married couple will count as only one possible stockholder. All in all the relevant population of this analysis is 38.03 million.\n\nCheck out the following two links for population numbers:\n\n[https://service.destatis.de/bevoelkerungspyramide/#!y=2021&a=18,65&l=en&g](https://service.destatis.de/bevoelkerungspyramide/#!y=2021&a=18,65&l=en&g)\n\n[https://www.bib.bund.de/DE/Fakten/Lebensformen/Zahlen-Anteile.html](https://www.bib.bund.de/DE/Fakten/Lebensformen/Zahlen-Anteile.html)\n\nThis analysis will take a conservative stance at every level. For this reason the share count of the answer categories will always be on the lower side:\n\n1-5 shares = 1 share\n\n6-20 shares = 10 shares\n\n21-50 shares = 30 shares\n\n51-100 shares = 70 shares\n\n101 and more = 101 shares\n\nThe result of this conservative approach should be an underestimation rather than an overestimation. The survey took place from 07.04.2021 to 08.05.2021.\n\n# 3. Survey Result\n\n* The RMSE Score is 5.9% (not perfect but not bad either)\n* 94.9% of all Germans are not stockholders of GME, 1.5% of these are former stockholders\n* 5.1% of all Germans are currently stockholders\n* The average german stockholder holds around 41 shares\n* The german population holds around 79,600,000 shares\n\n&#x200B;\n\n[https://preview.redd.it/0oa8aux11kf71.png?width=1344&format=png&auto=webp&s=9e41ada9e53c2b2118bf07852cbb92ee05cabdbd](https://preview.redd.it/0oa8aux11kf71.png?width=1344&format=png&auto=webp&s=9e41ada9e53c2b2118bf07852cbb92ee05cabdbd)\n\n&#x200B;\n\n[https://preview.redd.it/f0ru39g3qof71.png?width=810&format=png&auto=webp&s=ad9ede3f19b91546717b31e773c53c3bca7a079e](https://preview.redd.it/f0ru39g3qof71.png?width=810&format=png&auto=webp&s=ad9ede3f19b91546717b31e773c53c3bca7a079e)\n\nCheck out following link for the Survey:\n\n[https://surveys.google.com/reporting/survey?survey=zpchvaq5cu4efhyfhjkk5c7p6q](https://surveys.google.com/reporting/survey?survey=zpchvaq5cu4efhyfhjkk5c7p6q)\n\n# 4. Parting Thoughts\n\nFor me, this is confirmation bias, but keep in mind that I am no financial advisor and that english not my native tongue. Pls correct me if i made an honest mistake in my math and keep it if you find one in my language. In my opinion this data can be used for Mountaingermany (Austria) and Richgermany (Switzerland) aswell. Mountaingermany is as german as it can get. Please don’t tell them, because they want to believe that they are unique. Richgermany just laughs about our wealth and can probably buy GME with just the salary of one janitor. There is a lack of data for the rest of Europe, but if you feel like it YOU can step in!\n\nCheck out the following links for the armitard surveys:\n\n[https://www.reddit.com/r/Superstonk/comments/oxjv1n/google\\_survey\\_update\\_gme\\_ownership\\_w\\_aapl\\_control/](https://www.reddit.com/r/Superstonk/comments/oxjv1n/google_survey_update_gme_ownership_w_aapl_control/)\n\n[https://www.reddit.com/r/Superstonk/comments/o2cnd4/using\\_randomized\\_representative\\_surveying\\_data\\_to/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/o2cnd4/using_randomized_representative_surveying_data_to/?utm_source=share&utm_medium=web2x&context=3)\n\nEdit 1: Joke removed.\n\nEdit 2: Discussion on top and updated spreadsheet.\n\nEdit 3: Spelling",
    "title": "Google Survey for Germany: Germany owns the Boat with around 79,600,000 Shares!",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/DDintoGME/comments/oykaws/google_survey_for_germany_germany_owns_the_boat/"
}