{
    "author": "Jufloz",
    "created_utc": 1623888865.0,
    "distinguished": null,
    "edited": 1623898433.0,
    "id": "o1jkts",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o1jkts",
    "num_comments": 231,
    "permalink": "/r/Superstonk/comments/o1jkts/jpmorgan_closing_accounts_with_dtc/",
    "score": 2815,
    "selftext": "Updated: I think I understand what it means.\n\n\nThis was filed today, I'm not sure how big of an impact this is but....\n\n  \n FICC has been notified of J.P. Morgan Securities LLC’s intent to close its JSBA, JSGU, JSCG, JSCT & JSCW Clearing and EPN accounts effective June 24, 2021.  \n\n FICC will publish the final termination notice once all obligations of J.P. Morgan Securities LLC‘s JSBA, JSGU, JSCG, JSCT & JSCW Clearing accounts have been satisfied. \n\n[https://www.dtcc.com/-/media/Files/pdf/2021/6/16/MBS991-21.pdf](https://www.dtcc.com/-/media/Files/pdf/2021/6/16/MBS991-21.pdf)\n\n&#x200B;\n\nCan any other wrinkle brain explain why they would be closing these accounts all of a sudden? And the fact that it was addressed to ALL MBS participants of the DTCC\n\n\n\nEdit: it looks like it's been posted and someone has been saying they're holding cash..\n\nI looked at the recent comments of Jaimie Dimon, he's saying that he's keeping cash because inflation is here to stay?\n\nUpdate: After seeing around certain comments and doing more digging, this is my opinion is that they're closing these accounts because they don't want these accounts to be included in the payout when the other members are forced to cover for those that couldn't when MOASS happens?\n\nhttps://www.dtcc.com/~/media/Files/Downloads/legal/rules/nscc_rules.pdf This should explain some of the reasons why these guys don't want to stick around.\n\nAnother Update /u/whiteguywhocandance commented that these accounts MAY belong to \"Jane Street LLC\"\n\nSo looking into Jane street even more, They seem to like this stock \"Gotu\" Back in January it was pumped to $143. Melvin Capital had calls on this company during the time of the pump. Suspicious?\n\n\n\nTLDR: What I'm reading is that if a defaulting member runs out of funds/assets to cover their debt, anything owing will affect other participants until all debts are satisfied. \n\nELi5 - They're jumping ship because they don't want to pay for the bill when MoASS happens. That's why they're closing as many accounts possible and just sitting on cash.",
    "title": "JPmorgan closing accounts with DTC",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1jkts/jpmorgan_closing_accounts_with_dtc/"
}