{
    "author": "lhatekale",
    "created_utc": 1623868709.0,
    "distinguished": null,
    "edited": 1623878715.0,
    "id": "o1c020",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o1c020",
    "num_comments": 83,
    "permalink": "/r/Superstonk/comments/o1c020/unusual_otm_put_activity_61621_naked_shorting/",
    "score": 760,
    "selftext": "There has been (at time of writing) over [44,000](https://i.imgur.com/h7rVWwr.jpg) volume on July 16 16p contracts today (edit: as of the start of power hour it is now over 50k). This is higher on this contract than any other point in its existence, with second place being December 22nd 2020 where a measly ~1300 volume occurred. They [dominate the largest options transactions today, coming in at 500 contract blocks](https://i.imgur.com/8jC44KP.jpg). This appears to have started at about 9am pacific time.\n\n\n[1m chart since this started.](https://i.imgur.com/fjoS0xX.jpg) Vertical red lines are minutes with at 500 blocks at the bid (usually indicative of writing or selling to close option), and green 500 blocks at the ask (usually indicative of buying to open to buying to close a short option). If these were straight up trades, such activity would cause losing at least 50% every cycle if writing/selling at red vertical lines and buying to open/close at the green sections. So something else has to be going on here- \n\n*ahem* \n\n##NAKED SHORTING\n\nBlocks of these OTM puts at the bid seem to be associated with volatile price drops, or resistance and volatility during price rising. IIRC, there have been many DD posts about how a hedge fund-MM partnership could utilize such OTM puts for “legal” naked shorting. (Thank you /u/Ifigomissing for bringing up a link to [this DD on how it works](https://reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/)) EDIT: see [this post](https://reddit.com/r/Superstonk/comments/o19g2a/10000_july_16th_16_puts_just_dropped/) for more in depth discussion on the matter \n\nOther low OTM strikes are occurring too, but not to such an extent. There appears to have been a switch to 12p since 11am pacific. Edit: as of the start of power hour, the total of 12p volume today is [now almost 70k](https://i.imgur.com/9zfyhIs.jpg).\n\nSo what does this mean? I would like to hear other wrinkle brained takes, but this to me seems like they’re panicking and trying to tamp any upward momentum.\n\nEDIT 1: more interesting things, 11:40 1min candle dropped from 217.49 down $2 to a low of 215.59. That same minute? A large split up transaction of [17p](https://i.imgur.com/NWMi7Ka.jpg) and a smattering of about 20 [ITM puts](https://i.imgur.com/cYBKmmc.jpg) that cost someone about $430,000 in premium assuming they’re all from the same party.\n\nEDIT 2: it would appear the large blocks of OTM have slowed down until 12:25. Start of power hour lead to a change to 6/18 65p, 9/17 15p, and a 146 contract transaction of barely ITM 6/18 220p at 12:10 pacific to possibly stifle upward movement. 500 blocks are back at 12:23, 12:24, 12:25, 12:26, 12:27, 12:28, 12:29 with 7/16 32p. Then 500 7/16 49p at 12:31, 12:32\n\n\nEDIT 3: starting at 12:30 there was buying of 6/18 225p, so far 206 contracts all but 6 of which occurred at the ask, price ranging from $1200 to $1250 per contract and all on NYSE. 20,000 shares worth in total. $240,000 in premium at a minimum, expiring in two days and already lost at least 75 per contract ($7500). Ended buying at 12:32 most likely. Seems to account for short downtrend from 12:30 for a few minutes. They really are pulling out all the stops.\n\nEDIT 4: 12:36, 7/16 12p 500 blocks are [back](https://i.imgur.com/cwBbes9.jpg)",
    "title": "Unusual OTM Put Activity 6/16/21: Naked Shorting? Shorts Panicking?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1c020/unusual_otm_put_activity_61621_naked_shorting/"
}