{
    "author": "kekking_ass",
    "created_utc": 1616000337.0,
    "distinguished": null,
    "edited": 1616031778.0,
    "id": "m74z4x",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m74z4x",
    "num_comments": 56,
    "permalink": "/r/GME/comments/m74z4x/this_is_a_short_squeeze_the_ftd_and_gamma/",
    "score": 671,
    "selftext": "Ok, hopefully this works as my last 2 DD posts would not upload.\n\n\\*\\*EDIT 1\\*\\* - This post is about GME... I just assumed people would know.\n\n**THE FTD SQUEEZE**\n\nFirst of all, I appreciate the DD and quality of the document which highlights the FTD compression occurring.  This presentation can be found [here](https://iamnotafinancialadvisor.com/Current-DD/) which most people have read.  It is well detailed and very well done and shows in detail that there is an FTD squeeze.\n\nWhat I'm saying is that this is not an FTD squeeze.  The FTD's are a symptom of a (edit- \"upcoming\") short squeeze.\n\n**WHY THERE IS AN FTD SQUEEZE TO BEGIN WITH**\n\nThere is no other way to look at it.  The HF's shorted the stock more than the entire float.  There are folks who say it's 120% to 400+% but the fact is it's way more than the volume available.\n\nThe FTD squeeze is a symptom because the HF's are trying to delay the inevitable and using every avenue to try to find a way out.  There would not be FTD's increasing if there wasn't a short squeeze coming.\n\n**THE GAMMA SQUEEZE**\n\nThe gamma squeezes along the way are symptoms of the FTD squeeze and the new floors being established as more shares are purchased and the FTD timeline compresses due to the availability of shares.  The Gamma Squeezes are secondary symptoms.\n\n**THE SHORT SQUEEZE**\n\nIf there had not been more shares shorted than exist, there would not be a reason for the FTD's to increase and compress.  The negative beta, the gamma squeezes, the FTD squeeze, the general price increase, the flat VWAP lines, the ETF bait and switch is all a symptom of the short squeeze.\n\nAnd this has been in the works for a long time!!!\n\nSee my other posts on this:\n\n* [Reminder of the Actual Facts](https://www.reddit.com/r/Wallstreetbetsnew/comments/m4b2jz/gme_reminder_of_the_actual_facts/)\n* [Was XRT only Added as Short Insurance](https://www.reddit.com/r/Wallstreetbetsnew/comments/ltsphh/dd_was_gme_only_added_to_xrt_to_be_used_as_short/)\n* [GME and The Bringer of Doom](https://www.reddit.com/r/Wallstreetbetsnew/comments/lpar8c/gme_the_bringer_of_doom_and_a_market_crash/)\n* [GME, A Catalyst and a Strategy](https://www.reddit.com/r/Wallstreetbetsnew/comments/ljazg6/gme_a_catalyst_and_strategy_gme_day_20210217/)\n\nThere are great folks doing great DD in here and I am in no way shitting on them but every week there's a new angle or perspective and I want everyone to remember that this is a short squeeze.  That's how you get your tendies, your lambo's and your rocket.",
    "title": "This is a Short Squeeze!!! The FTD and Gamma Squeezes are Symptoms",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m74z4x/this_is_a_short_squeeze_the_ftd_and_gamma/"
}