{
    "author": "trust-theprocess",
    "created_utc": 1622208922.0,
    "distinguished": null,
    "edited": 1622227222.0,
    "id": "nmxze3",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nmxze3",
    "num_comments": 1890,
    "permalink": "/r/Superstonk/comments/nmxze3/flash_crash_warning_4000_618_300_puts_bought_last/",
    "score": 20823,
    "selftext": "As the DD has shown they use ITM puts as an expensive last resort to drop the price. Those 4000 puts cost over 51 million.\n\nThis is by far the highest open interest for any ITM put in the entire option chain\n\nThey may unload the remaining 3000 to try bomb the price down before these mass amount of calls expire ITM today, and so there isn't a 3 day weekend of FOMO buildup.\n\n#Do not set stop losses\n\n------\n\n**Edit:** Well damn I had to go out right after posting this and came back to it being the top post on the sub, lmao\n\nWant to address this:\n \n**How do ITM puts drop the price?**\n\nI see a lot of people asking this, I read it in [this DD](https://www.reddit.com/r/Superstonk/comments/nc1lny/ive_estimated_the_current_si_based_on_the_si/), basically all options put pressure on the price, calls = upward pressure (see January gamma squeeze), and puts = downward.\n\nHow does it go down if the strike they're exercising is higher than the stock is trading and someone has to buy it from you at 300? The same way it goes up when ITM calls are exercised at a lower strike than the current price and someone has to sell it to you at 200. What are the mechanics that make it work that way? I have no idea, I'm as retarded as the next ape\n\nThey also use OTM puts to hide the SI% which can be seen when they have to report to FINRA, and they use ITM calls to satisfy FTDs which has been part of the T+21 cycles. They've been abusing options to manipulate and kick the can from the beginning.\n\nI'm not sure if that exact date+strike was used today, but quickly looking over the chain for all dates it looks like hundreds of them have been exercised since yesterday just among the top 10 highest OI ITM puts $300 or higher",
    "title": "FLASH CRASH WARNING - 4000 6/18 300 puts bought last friday, 1000 were exercised on monday to cause the end of day mini-crash",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nmxze3/flash_crash_warning_4000_618_300_puts_bought_last/"
}