{
    "author": "rensole",
    "created_utc": 1615803978.0,
    "distinguished": "moderator",
    "edited": 1615839103.0,
    "id": "m5hp8f",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m5hp8f",
    "num_comments": 1371,
    "permalink": "/r/GME/comments/m5hp8f/synopsis_for_03152021_what_we_need_to_know_before/",
    "score": 8989,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nSeriously I can't be the only one smelling that!?\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/ur1dfasps5n61.png?width=680&format=png&auto=webp&s=6c77e130486ff7e62076ce3d10f403e6ee9722fe\n\nNone of this is financial advice, just retarded opinions.\n\n# Daylight Savings.\n\nGuys starting from today NYC will have Daylight savings on, this means that the market will close and open one hour earlier for everyone outside of the DST.\n\nit's a small thing but people need to be aware of this ;)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/nf3dndrpt5n61.jpg?width=960&format=pjpg&auto=webp&s=9058ff12aa95cf3707fc07bba9f5f2505aab1e73\n\n# STIMMAY!\n\nSo as most people know a lot of people's stimmy's should be hitting the USA in the past weekend, but do keep in mind that not everyone will have received theirs by now.\n\nMeaning there will be some who have it and some who wont have.\n\nSo don't worry if you don't see everything launch into the stratosphere today.\n\nRemember this is a war of attrition, a marathon, not a race to the finish this will take some time.\n\nSame goes with other indicators, we have a lot surrounding the end of this week like the 19th, but this is not a guarantee that everything will go as planned, remember that melvin and the like will have people crawling through all the GME related subs and they want to cause as much damage as they can. and demoralizing is one of the easiest ways, so please for the love of Harambe don't set hard dates but let this bastard come at it's own pace.\n\nRemember \"the big short\" ? you know how long Dr. Michael burry waited for his bet to pay out? 2 years, so you guys should be able to wait a few weeks maybe even months if need be.\n\nNothing in this world that's worth anything ever came to you easy, it always needed pain effort and time, why should this be any different?\n\n&#x200B;\n\nhttps://preview.redd.it/1ftpa4s2v5n61.jpg?width=629&format=pjpg&auto=webp&s=b48066fe2aa1eed79d5594978e3aae9d819923c4\n\n# Hi shilly, I hope you're eating enough <3\n\nOk so in the weekend a lot of people (including me) have noticed a huge influx of shills.\n\nFunnily enough with DFV's latest tweet domo replied and got my smooth brain an extra wrinkle.\n\n&#x200B;\n\nhttps://preview.redd.it/lw04s5umv5n61.png?width=551&format=png&auto=webp&s=5134df1bdc99459d65398d000f8707c9684e1f6a\n\nDFV's tweet is the \"Clint Eastwood from the gorillaz\"\n\nThis can have several meanings, it can be referencing that WSB started donating to gorilla sanctuaries (which isn't out of the norm for them) or a reference to some part of the lyrics in there.\n\n    I ain't happy, I'm feeling glad\n    I got sunshine in a bag\n    I'm useless but not for long\n    The future is coming on\n\nBut what really got my head going was Domo capitals tweet.\n\n\" A virus that invades a host, and tricks the body it into attacking itself by pretending to be something it's not...  Sounds like something\n\n[@DOMOCAPITAL](https://twitter.com/DOMOCAPITAL)\n\nhas been discussing. \"\n\nNow  they've talked about \"false idols\" before namely the \"viking of stocks\".\n\n&#x200B;\n\nhttps://preview.redd.it/ti99u6kaw5n61.png?width=551&format=png&auto=webp&s=06936bebdefebe8025cf2e8ef25fc2b91b173aeb\n\nApparently this viking guy has been hyping GME then dropping it and has done so twice, which in and of itself is weird for someone who says they're a \"professional\" investor, or hell anyone who understands our culture in any way shape or form.\n\nSo WTF did Domo Capital mean?\n\nWell take the Virus part out and you have the basis for a \"false flag\" campaign.\n\nAnd I hear you asking... wtf is a false flag?\n\ncheck out these links:\n\n[https://www.csoonline.com/article/3512027/what-is-a-false-flag-how-state-based-hackers-cover-their-tracks.html](https://www.csoonline.com/article/3512027/what-is-a-false-flag-how-state-based-hackers-cover-their-tracks.html)\n\nyou may have heard of this term in the news in the past few years \"Hackers from Russia\" if a hacker knows how to hack he knows how to hide his trail and use so many proxy's that no one will ever find him so convenient that they left that off right in Russia right?\n\n[https://en.wikipedia.org/wiki/False\\_flag](https://en.wikipedia.org/wiki/False_flag)\n\n[https://encyclopedia.kaspersky.com/glossary/false-flag/](https://encyclopedia.kaspersky.com/glossary/false-flag/)\n\n&#x200B;\n\nSo how the fuck does this work with GME?\n\nEasy remember all the shills and the bots that we have in here? by technical terms, they are running a false flag operation.\n\nHow is that even useful? also easy, divide and conquer.\n\nThe shills are in here, nothing we can do against that, they will use all sort of tricks ranging from \"price anchoring\" [price anchoring](https://en.wikipedia.org/wiki/Thinking,_Fast_and_Slow) all the way to spreading FUD.\n\nNow first of all let's kill the price anchoring right here, RC ventures stated to his letter to the board that he thought the price of GME should be around $1000 by the end of this year (if someone can check if it was this letter or another one let me know).\n\nAlso he stated in an hour long conversation with Domo Capital that it should be around $1000 bucks a piece as well\n\nhttps://preview.redd.it/fk58ff0ky5n61.jpg?width=1284&format=pjpg&auto=webp&s=8b138c3e78977d777e8be41918e0f14627c20af1\n\n&#x200B;\n\nSo what does that mean?\n\nThe price of GME can go to 1000 usd per share, ON-ITS-OWN.\n\nThis means without a squeeze, without any other shit except fundamentals.\n\nand this is why if someone asks me \"oh it's now 900/1000 is this the squeeze?\" in my view it's easy, NO.\n\nAnyone at this point who thinks that 1000 is the goal doesn't understand how this works.\n\nAlso it would be very convenient for Melvin and Shitadel if it stays at that price, why? because if this goes to 6k or 10k they're bankrupt, someone posted here yesterday how their overall value was somewhere along the lines of 5,500 a share anything over that and they'd go bankrupt.\n\nso here is why the price anchoring comes back into play.\n\nThe people spamming 1k is enough or oh once it hits 1k we are done with everything.\n\nNo my friends that's where the Mother Of All Short Squeezes comes in, the MOASS.\n\nonce it hit's 1,000 and no one sells they're still going to need to buy all the shares, and if they can't the price will keep going up and up and up. that has been the backbone of every theory on here. if the people keep holding and the bid/ask divide gets larger the higher the price will go.\n\nThis is why you're seeing people say 100,000 is my price or 500,000 because the mechanics support this. if no one is selling and they get margin called to buy everything in the market but no one is selling **POP GOES THE WEASEL.**\n\nso this is why shills come in here, to make people waiver, to make people second guess themselves and their price. because if they succeed their company may survive, if they don't the company is done for.\n\nSo don't get divided by them, stop thinking everyone with a different opinion is a shill.**STOP INFIGHTING! APES DONT FIGHT APES!**\n\n**Be Nice, OVERLY nice to one and other. why? because this is the easiest way to weed these idiots out, if everyone is helpful and nice these fuckers will stand out like a sore thumb.**\n\nAnd for the love of god, stop worshipping people, this will only help them not you.\n\nhttps://preview.redd.it/86n97js906n61.jpg?width=640&format=pjpg&auto=webp&s=25bbd1ab7536c533e91464bb93017d046951ca2b\n\n# The Gorillaz\n\nSo there has been some bitching and moaning about the altruistic ventures of Wallstreetbets. These professional retards have donated to an animal sanctuary to help out our fellow apes.\n\nThis isn't shill tactics this is WSB doing what they've always done, spend money.\n\nDon't forget there are some actual whales on WSB, and spending a couple of hundred bucks is nothing to them nor will it ever be.\n\nAnd to be clear, during the week when the market is open this is PURE GME ALL THE TIME! Meaning we wont accept any of these post.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/7neyjbbf16n61.jpg?width=637&format=pjpg&auto=webp&s=38913d775cac5581a87f9b501e0ca218571bab58\n\nOk so instead of doing a small TLDR of all sorts of posts I will be linking to posts that I believe are important for you to read.\n\n[DFV Tweet decoded](https://www.reddit.com/r/GME/comments/m3tmnv/another_insight_into_dfvs_latest_tweet/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[juicy juicyness](https://www.reddit.com/r/GME/comments/m3xb8r/strap_in_and_open_wide_titfuckers_im_about_to/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[Citadell has no clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[MOASS FAQ](https://www.reddit.com/r/GME/comments/m4hqkc/gme_moass_faq/)\n\n[proof HF's are lying to finra](https://www.reddit.com/r/GME/comments/m4c3ki/proof_that_hfs_are_lying_to_finra_but_thats_fine/) (this one shows a good premise, lying to finra is a 2m fine vs infinite losses)\n\n[Calls are Bad M'kay](https://www.reddit.com/r/GME/comments/m4cite/buying_calls_could_actually_be_helping_the_shorts/)\n\n(seriously if you don't know all the details of Calls or options don't fucking touch them)\n\n[A psychology ape explaining HF reasoning and shill tactics](https://www.reddit.com/r/GME/comments/m56sb3/my_professionalacademic_background_has_been_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nAs someone who has always been intrigued with psychology this is a very good read, if you look at how shills have adapted and his work it shows a nice big picture, a picture that makes sense if you have the knowledge.\n\n[Tips for new apes](https://www.reddit.com/r/GME/comments/m3z64u/tips_for_new_apes_understanding_how_theres_more/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n# Some final thoughts.\n\nFirst of all people need to understand that I'm only one guy, I get tagged in a lot of things to look over, and receive over a thousand pings per day, so it's impossible to read them all and some things get missed.\n\nI've seen people in the weekend trying to discredit me because I didn't read their DD and they got pissed off over it, even going as far as calling me a shill. Guys I'd love to be able to read everything and check everything but this is not humanly possible.\n\nSame goes with DMs.\n\nWhat I do however think is that this may be a new shill tactic, Discredit the main people who are involved with this so they can take out the center players in this and it's easier to spread fud.\n\nQuestion everything and everyone, just take it easy and don't attack everyone, remember play extremely nice, treat every fucker on this board as if it's your first date with a hot chick (or dude) and you want to be nice to get a chance right?\n\nif we play overly nice they can't divide us as easy.\n\nApes together strong.Apes don't fight Apes.\n\nAnd remember guys this has been a great week, just a month ago this was at 40 and people told us this was over remember that? now we are up to $284 in premarket.\n\n**We can remain patient longer than they can stay solvent.**\n\n&#x200B;\n\nhttps://preview.redd.it/6rh0np1y46n61.png?width=400&format=png&auto=webp&s=de4f0f298c50b7bf065712025da3e1a44233fb41\n\nRemember none of this is financial advice, just one retarded ape to another.\n\nIf I forgot anything let me know and I'll add it below here\n\nbackups: [https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n&#x200B;\n\nEdit 1:\n\nI almost forgot to mention\n\n# EXPECT FUCKERY!\n\nseriously we all have such high hopes for the next 2 weeks, so don't expect them to take this laying down, they will try to knock the price down, they will try to demoralize you.\n\nExpect everything, both the price soaring up to Mars and expect it to go back to $40.\n\nWhy $40? because we've been there before and we all held through the lows and we will hodl through the highs. expect the worst and hope for the best.\n\nMelvin/shitadel if you're reading this just know, we are not your standard traders, we're retarded apes we don't care how long this takes, but we will wait you out. remember we don't care about dates we care about one single thing, tendies.\n\nAnd we can wait <3\n\n&#x200B;\n\nEdit 2:\n\nIt seems citadel is in need of money :'( poor bastards hahaha\n\n[https://www.reddit.com/r/GME/comments/m5hfjy/citadel\\_needs\\_money\\_check\\_this\\_out\\_even\\_more\\_moon/gr09i6y/?context=3](https://www.reddit.com/r/GME/comments/m5hfjy/citadel_needs_money_check_this_out_even_more_moon/gr09i6y/?context=3)\n\nThey're giving out bonds, this is done to raise capital normally\n\n&#x200B;\n\nEdit 3:\n\n**Today was a red day, we sailed these seas for weeks my apes. you will see Bots fud etc.**\n\nthe market is closed so just chill and go watch a movie, tomorrow is another day ;)  \n(fud can't reach you if you're offline :P)",
    "title": "Synopsis for 03-15-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/m5hp8f/synopsis_for_03152021_what_we_need_to_know_before/"
}