{
    "author": "TimTheToolManTayl0r",
    "created_utc": 1627678751.0,
    "distinguished": null,
    "edited": 1627697171.0,
    "id": "outsvl",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_outsvl",
    "num_comments": 605,
    "permalink": "/r/GME/comments/outsvl/i_figured_out_the_missing_puts_located_in_brazil/",
    "score": 9160,
    "selftext": "[https://www.federalreserve.gov/releases/h8/current/default.htm](https://www.federalreserve.gov/releases/h8/current/default.htm)\n\nBanks need money to work. An asset means +money, a liability means -money. Assets minus liabilities gets you net money. ***So if I have $5, I have $5 in assets. If I owe you $3, I have $3 in liabilities. $5 -$3  means I have a net of $2.***  Why this matters is if that net (row 41, labeled here as \"Residual (Assets LESS Liabilities) \") is too low, the banks can be unstable. In the event of a market crash, if they hold a lot of their assets in stocks, they can go net negative and the bank has to close. If a bank has to close, that can trigger other banks to close and everything goes to shit *real fast.*\n\n**This is** ***liabilities vs time,*** **the bigger the slope upwards,** ***the worse it is.***\n\nhttps://preview.redd.it/wm1jddw17fe71.png?width=592&format=png&auto=webp&s=ec227f7abf4b68d91f4db710cf0182ae81676bad\n\n**This is liabilities/assets, if it is going up, this means the bank is doing bad, not making as much money. For the back half of July, it only went slightly upward, a steep curve in this would have put fear in the markets.**\n\nhttps://preview.redd.it/fxnq2zh67fe71.png?width=587&format=png&auto=webp&s=6a5691210afa71babb25d686a9d6dc55b187dd6c\n\nAssets and Liabilities of Commercial Banks in the United States - H.8 due today at 4:15 PM. Earlier this week we discovered puts that mysteriously showed up in a Bloomberg Terminal screenshot, then disappeared the next day.\n\nHad these losses been kept in a secured financial institution within the United States, they would have needed to be declared in the report. This would have shown a massive loss for whatever institution was holding and would have been seen as a major liability for possibly multiple banks loaning out the credit to HF's.\n\nCONSTANCIA INVESTMENT #1 HOLDER ON SCREENSHOT\n\n[https://constanciainvest.com.br/en/](https://constanciainvest.com.br/en/)\n\n***A BANK NOT CONNECTED TO ANY U.S. FINANCIAL HOLDINGS.***\n\nKAPITALO INVESTMENT #2 HOLDER ON SCREENSHOT\n\n[***https://www.kapitalo.com.br/***](https://www.kapitalo.com.br/)\n\n***A BANK NOT CONNECTED TO ANY U.S. FINANCIAL HOLDINGS.***\n\nhttps://preview.redd.it/odytpb1i3fe71.png?width=2880&format=png&auto=webp&s=6952efd97b25414f6dac0e415706b987e550b99b\n\nThese losses were moved to a bank in Brazil to not be exposed for the general public to see. They can then keep the losses in the bank in Brazil, possibly declaring bankruptcy overseas to not be risking their loans they have on hand within the U.S. Institution.\n\nLooking further into the document, a sub-note states this: ***you can't get margin called if there is no margin requirement. This margin requirement was reduced down to 0% after COVID crash in March of 2020.***\n\nhttps://preview.redd.it/0euuwmmm9fe71.png?width=740&format=png&auto=webp&s=002419b2257c99c0d5c1c0a4f9f572988d2c56c1\n\nGary Gensler, S.E.C., DTCC, NSCC, we ***DEMAND*** a fair and free market for all Americans, we ***DEMAND*** answers and to have our voices heard. Retweet this, post this, whatever attention is needed to expose this corrupt manipulation that is being handed down to us through a financial system in which we once trusted and now is teetering on collapse because rules are not being enforced by some individuals is the most disheartening thing to see before my eyes and many, many others.\n\n***Retweet, post, get this known that we want change, civilly, respectfully, and most importantly, safely, for all Americans.***\n\n[https://twitter.com/RetroBloomberg/status/1421222977056567298](https://twitter.com/RetroBloomberg/status/1421222977056567298)\n\n# If anyone is a lawyer, please contact me, I am ready to fight for us all for fair market practice, values, and participation. ",
    "title": "I figured out the missing puts located in Brazil from Bloomberg Terminal-Assets and Liabilities of Commercial Banks in the United States - H.8 due today-they needed to hide the losses offshore to not be shown in the report-I DEMAND we take action against this",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/outsvl/i_figured_out_the_missing_puts_located_in_brazil/"
}