{
    "author": "WillyTheKid007",
    "created_utc": 1627675335.0,
    "distinguished": null,
    "edited": 1627680858.0,
    "id": "ousrl7",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_ousrl7",
    "num_comments": 127,
    "permalink": "/r/GME/comments/ousrl7/they_live_like_gods_one_reason_to_understand_why/",
    "score": 985,
    "selftext": "I was writing a response to : 'MOASS please? Work is getting on my last nerve. AKA: It's too early for this.' posted by r/GME u/exzyle2k. But I thought everyone may benefit from my thoughts too.\n\nMuch respect to you exzle2k and everyone else. Everyone has different lives. Different stresses always encountered.\n\nThe people here are becoming more and more aware of just how tiny they are in the machinations of our economy, and when you also become aware of just how corrupted that very economy, the banking sector, and even the government that seemingly prioritizes the priorities of the wealthy over your own, it becomes very disheartening to feel that betrayal. It becomes even more disheartening when the people here begin to totally unravel and reveal the corruption and horrible rot that has grown throughout the system that is supposed to support us. Because the government is supposed to exist to take care of you.  They have one job, just that one.\n\nBut you all need to stay strong. You know your job, you know how to do it, you got hired for the position, please keep at it and do well. Because games are being played with our lives and a total disregard for reality with said games. This is leading to increasing palpable levels of frustration and anger.\n\nTo understand why the MOASS may take longer and/or is being delayed:\n\nYou need to remember that these wealthy people have lived this lifestyle for decades. Their families, their children, their children’s children, have become so accustomed to living this way that the word ‘lavish’ to us is a crazy understatement to them. They cannot fathom NOT living like this, or spending even *one day* living like us.\n\nThey live like Gods.\n\nThese people have enjoyed the best foods, the best alcohol, the best drugs, never waiting for anything, being the center of attention anywhere, 1st class on airplanes or $500 million private jets, sometimes owning two or three of them, $500 million yachts and again sometimes two or three of them, a mansion in every part of the world, $50-100 million dollar helicopters so they don't have to bother with cars, but if they do they have the most expensive lambos, porches, ferrari's, just about any exotic car you can think of, dine at the best restaurants, always have a table ready for them, never needing to cook or bothering with mundane things like shop for groceries because of that and their personal chefs, personal assistants that take care of everything during the day so they never have to lift a finger, and every physical pleasure taken care of by the most gorgeous supermodel escorts in the world, and money... credit cards that give them access to private parts of a bank within a bank and elite staff, to things you and I cannot fathom, millions, billions, trillions of dollars at their beck and call... and more... They live a lifestyle that is so insulated, so alien and different to ours that they might as well be on another planet, or another fictional exotic universe. To lose that, to lose ALL that, their ENTIRE LIFESTYLE, is to drop down from a nirvana of their own making (*Edit: I first used the word 'heaven' but that desecrates the meaning of the word)* and spend their lives in their version of 'hell', which is becoming 'us'. It was documented that most of them lived such insulated lives they WERE NOT EVEN AWARE OF THE PANDEMIC.\n\nAnd that is a primary reason why they fight, cheat, lie, steal and more… rules be damned, just to live that whole different, exotic, god-like lifestyle in their nirvana, just for one more day. For them, the words ‘illegal’ and ‘prison’ are a foreign concept. They have an army of lawyers the police must wade through before they are touched. They have become untouchable.\n\nFor us to win is for them to lose. Lose their lifestyle as they know it.  I am not naive to believe they will lose ALL this.  Part of that lifestyle is to have hidden riches... just in case.  But that vast majority of their wealth will become rightfully ours.  It is a reality that clashes with theirs, a reality that clashes with the law that needs to exist to balance the world.  A world in which the government must see it is heading for utter destruction that started, among other things, with allowing the rich and wealthy to be above the law and rules.  The laws and rules exist for a reason.  To allow people exceptions and disregard core values is to invite chaos, and the price to be paid are the lives of others.  It always has.\n\nWhen did we forget our humanity?\n\nSo please HODL. We have The Winning Hand in this game. We know they became so greedy with corruption – corruption that to them has infused their very lifestyle and become normal - that they over-played their hand. And we beat them. At their own game. But now they refuse to admit their loss. They have near unlimited resources to take that winning hand away.\n\nI know you are so very tired of your job.\n\nWhat if I told you that if you hold on for one year’s time you will become a multi-millionaire?  Yes, half the world thinks we’re hyping up this whole thing, that this is just a game where we convinced ourselves is real. But keep in mind, a study done may years ago on the general public that asked them one simple question about out financial system: where is money made? Because everything in our lives is controlled by money. You would think that people would be in the know about the lifeblood that runs our lives. The answer was shocking. Over 90% of the random people questioned wrongly believed it came from the government. Some of them even refuse to believe it came from the Federal Reserve or the banks. Most refused to believe the Federal Reserve was a *private bank not controlled by the government* that printed the country’s money. Their money. These are the people telling us we are living in a fantasy world, that our beliefs about the situation is just in our heads. That is very hypocritical. It’s akin to a high school dropout telling NASA how to run the space program. Also keep in mind, inflation is taking off, but it takes at least 2-3 years before it gets totally out of hand. We have that time.\n\nWe all know that in the financial stock markets, shorting a company introduces 'infinite risk'.  This is well documented in books, articles, and experts on the subject matter.  They brutally shorted Gamestop, including with highly illegal Naked Shorts.  We bought shares.  Now they need to buy them back.  It's the way Shorting in the market works.  The worst case scenario when Shorting a company is when the company somehow turns around and becomes successful.  That activates Infinite Risk.  It's an indominable machination and rules that are too deeply ingrained for them to change.  To do so is 1) Beyond Highly Illegal and 2) Like changing reality.  None of them have that superpower.  So they need to buy back the shares we hold.  There is no other way.\n\nI am not saying this will take another year.  But as time goes on we are uncovering more lies and deceit than we every thought.  The layers of their games and magnitude of their downright visible illegal activity to delay the MOASS is becoming unbelievable.\n\nCan you hold on for that long to become rich and (*Edit 2: remake)* the ranks of the wealthy? *(Thank you*  [***Ok\\_Emergency\\_381***](https://www.reddit.com/user/Ok_Emergency_381/)***)***\n\nHODL.",
    "title": "They live like Gods: One reason to understand why the MOASS may take longer and/or is being delayed",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/ousrl7/they_live_like_gods_one_reason_to_understand_why/"
}