{
    "author": "bosshax",
    "created_utc": 1619570644.0,
    "distinguished": null,
    "edited": false,
    "id": "n02yho",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_n02yho",
    "num_comments": 73,
    "permalink": "/r/Superstonk/comments/n02yho/gme_correlations_and_the_algogonewild_theory/",
    "score": 609,
    "selftext": "**Question:** I have long wondered WHY $GME and other stocks trade in SIMILAR patterns. I have never seen a good answer to this.  \nCourtesy of: [https://www.macroaxis.com/](https://www.macroaxis.com/)\n\nI plugged in the most volatile **retail** stocks that were shorted through COVID because i**NvEsToRs** thought these companies were going bankrupt. For added fun I put in TSLA and APPL. \n\n[$GME positive correlation to $KOSS, $AMC, $EXPR](https://preview.redd.it/4cl5no1amsv61.png?width=2712&format=png&auto=webp&s=d640e6212c5180cbc2b90906ae75efe338420ea5)\n\n[View the table here](https://www.macroaxis.com/invest/marketCorrelation?s=GME,KOSS,AMC,EXPR,TSLA,AAPL&ot=table&mode=i)  \n\n\nThe values shown in the table are the correlation co-efficient which range from a maximum of 1 to -1. 0 would indicate there is no relationship. -0.5 would mean a strong opposite correlation (one goes up while the other goes down).  \n\n\nSuffice to say these, $KOSS, $AMC, $EXPR, move together 'strongly'... but WHY?  \n\n\nThe most popular explanation was 'meme-stocks', suggesting that it is retail-traders who are simultaneously bidding up the stock of various companies. I don't know about you but I am very bad at multi-tasking and have trouble chewing banana-flavoured bubble gum and walking. In January we saw many various companies see these kinds of price spikes alluded to retail-traders on a short busting hunt. \n\nSome notable are MACYS: (who TF was talking about MACYS?)  \n\n\n[Note Jan 27th 'spike'](https://preview.redd.it/xbyx5ye9ysv61.png?width=3288&format=png&auto=webp&s=15e5983a6ff9d9daad49b9a24aeb087b47f083a5)\n\n  \nThere also was MAC (a commercial real estate company):   \n\n\n[Note Jan 27th](https://preview.redd.it/cgsv2tifysv61.png?width=3283&format=png&auto=webp&s=915c0a4ced52171a752e587bfe4092d8e9c7cef6)\n\nBasically NO ONE (no volume of posts in any significance) were talking about MACYS or MAC pre-January 27th on WSB, and WSB is a (use to be) great organic indicator of true retail interest. \n\n[MAC WSB POSTS HERE](https://www.reddit.com/r/wallstreetbets/search?q=mac&restrict_sr=1&sort=new)\n\n[MACYS WSB POSTS HERE](https://www.reddit.com/r/wallstreetbets/search?q=macys&restrict_sr=1&sort=new)\n\n[You also have no mentions of $KOSS before January.](https://www.reddit.com/r/wallstreetbets/search?q=koss&restrict_sr=1&sort=new&type=link)\n\n[OR $EXPR](https://www.reddit.com/r/wallstreetbets/search?q=expr&restrict_sr=1&sort=new&type=link)  \n\n\n99% of the post/comment action is AFTER the Jan 27th action.\n\nI think the important takeaway here is that retail was not talking about many of the stocks...\n\n[$BB, nothing before January?](https://www.reddit.com/r/wallstreetbets/search?q=bb&restrict_sr=1&sort=new&type=link) and [$NOK too.](https://www.reddit.com/r/wallstreetbets/search?q=nok&restrict_sr=1&sort=new&type=link)\n\nAll the posting came AFTER we saw the price action. \n\nSo I think the explanation that it was simultaneous 'retail' interest in all of these stocks as the initial catalyst is FUD. It's MSM smokescreen as usual to simplify what I assume is a very complex problem.\n\n**A few key ideas:**  \n\n\n**1, These STONKS are all linked by some common element and trade similarly whether it be because:**  \n**a, Retail Traders (unlikely)**  \n**b, Shorts (possible)**  \n**c, Algos and Quants (hmm)**  \n\n\nI think a, Retail Traders gives us too much credit. If Retail Traders truly had immense power to move markets then we would not see Max Pain. We would not see weeks of trading sideways. We would see an elephant in a China shop. Extreme volatility and insane 'pump-and-dump' behavior like what you might see in non-adopted crypto (doge-pre-Musk). Instead we see side-ways trading, inexplicable movements up in pre-market or after-hours (Where most retail DOES NOT trade) on questionable volume. Doesn't seem like retail is wagging the dog. \n\n&#x200B;\n\n**b, Shorts.**   \nThe only reason SHORTS would move ALL OF THESE STOCKS in a similar fashion simultaneously (and there are many) would be if:  \n**a, They are the same group of iNvEsToRs** and apply their trading strategy semi-equally across their non-holdings.   \nBut this would NOT explain why we see prices GOING UP at the same time!  \nIf SHORTS DID/DO not cover, then what is responsible for these simultaneous price spikes across different companies? The only way a short hf might impact price positively is by buying back their stock (or stopping ALL new/naked shorting). There is no reason they would do this simultaneously as it's an inefficient use of resources.  \nThe Shorts, in my opinion, since January, are in defense mode. They can not afford to short ALL their target companies AT THE SAME TIME. They must conserve their capital. So I would have expected some of their short positions to BLOW UP (they actually exit) and some other ones they double down. Instead we have not really seen any evidence of ANY of these January 'meme-stocks' with high short interest blowing up OR any of the shorts there covering to any large degree! So HOW MANY companies are ticking time bombs?   \n\n\nThis does give way to theory d!  \n\n\n**D, Long Killer Whales**  \nThese Whales KNOW which funds are SHORT and simultaneously press ALL their holdings to inflict max pain. But what's their plan? If they want to be LONG they would be better to accumulate AND then blow up the Short HF where their exposure is greatest, raising the tide for all their holdings, but instead we see this cyclical UP and DOWN. That's not intelligent behavior of a long whale. \n\n  \nOk, back to theory **C, Algos and Quants:**  \n\n\nI think we have entered a new era of **ALGOS-GONE-WILD (**and naked too!)  \n\n\nIf you do not know how destructive algos can be on the market please quickly have a read about the [2010 flash crash!](https://en.wikipedia.org/wiki/2010_flash_crash)\n\nTLDR is algos are now such a significant part of the 'liquidity' in a market that at a moments notice, if conditions turn against them, they pull ALL their BIDs and ASKs and the MARKET GOES AWAY.   \n\n\nI think the reason we saw this bullshit on March 10th where the stock went from $350 to $120 in like 10 minutes is exactly this... algos-gone-wild. \n\n&#x200B;\n\nhttps://preview.redd.it/bmi6gvr05tv61.png?width=3309&format=png&auto=webp&s=c90a5028a7526d11503c167dc07401f76c2d59d2\n\nBasically as the price sky-rocketed the algos kept buying and selling for profit. I think that because most of the market activity (liquidity) are full of these algos now that they kind of feed off eachother and it can create these self perpetuating cycles of momentum that we never experienced before. That momentum can go UP and it can go DOWN. As soon as the momentum turned these algos experience it first hand and they pull all their BIDs and all their ASKs from the market. Suddenly the market is dark!   \n\n\nNow, possibly at the same time the short hf algos lay in waiting and hit every single ask with a bunch of shares and boom, the price craters in such an unnatural way. I think that's the key take away here, the behaviour here was unnatural and computer like.   \n\n\nThe other key missing element from this March run-up was there was no organic buy demand propagating the spike in price. There were NO margin calls... If there were then we would not have seen this crash. Also of course as a retail trader when it seems like the MOASS is starting YOU ARE NOT LIKELY to submit buy orders! You are slow! So the order book was totally empty...   \n\n\nOK, now that I think I've established how much algos are involved in GME let's go back to WHY other stocks are simultaneously trading IN SIMILAR WAYS... and I think you've reached the conclusion I have... These are COMPUTERS/ALGOS and NOT retail 'meme-traders'...   \n\n\nAt first I thought maybe these ALGOS are hunting stocks that have high short interest, maybe they assume if one domino falls they all will, and so the short-tide is rising and falling in beat. But if you check out a few other heavily shorted non-retail stocks like LAZR and FSLY they DO NOT correlate. So it isn't that these algos are treating high-short companies similar, so WHATS the common theme why these stocks trade similar?  \n\n\n[GME is basketed with other retail failure stories and has not been unbasketed](https://preview.redd.it/ezn79vscrsv61.png?width=2892&format=png&auto=webp&s=2c083414be3877994cd4efd2d387f2dc917721db)\n\n  \nIf you do a bit of research you'll learn that Citadel in particular is all about algos. This is the bread and butter of their business. The problem is that algo trading gets so complicated that you're not even quite sure what the fuck is going on half the time. I think this is what has happened. ALGO and QUANT trading is not Digital-Jesus and always all-knowing. The most successful pioneer of quant trading, Ray Dalio, had a horrible 2020 because the algos did not understand what the fuck they were doing in a new covid world. [Bridgewater 2020](https://markets.businessinsider.com/news/stocks/ray-dalio-bridgewater-hedge-fund-lost-12-billion-2020-2021-1-1029998262#:~:text=Ray%20Dalio%20lost%20%2412.1%20billion,in%20stocks%20in%20the%20spring.&text=%222020%20was%20the%20year%20of%20the%20hedge%20fund.%22).\n\nI think that $GME has been mathematically basketed with other 'retail-failure stocks' and it's STILL in that basket. The algos can't un-see the correlations and the beta of these stocks over many years. So the reason we see AMC move with GME is because of these algos. They are basically like the white noise of the market, trying to make a profit but really just fucking things up and creating a lot of volatility.   \n\n\nAs an, intelligent investor (LOL), you can do very well in identifying where these algos get their baskets wrong and buying big winners. It might be that these algos also had a hand in shorting companies that they saw as over-valued or a potential candidate of bankruptcy. So when Citidel tries to look under the hood they indeed might find that their computer has been shorting GME all along and since the price keeps going up the algos CAN'T HELP THEMSELES! It might be we're literally at war against the machines, but the machines don't realize:   \na, how retarded we are  \nb, hodl  \nc, diamond hands  \nd, RYAN FUCKING CHOEN  \n\n\n**TLDR:**  \nMost of the market (liquidity) are now HFT algos that 'do-their-thing'. A lot of HFT algos try to make sense of one stock as it relates to another (this is just one point of data). I think the algos have long since grouped many stocks into similar 'baskets' and drove the price up competing with eachother. I think a lot of people have no idea what's happening but it is certainty NOT the 'fault' of retail traders.   \n\n\nThe algos may have thought GME was a sure bet bankruptcy target and to keep shorting this company and others like it. The algos just CANT UNDERSTAND the price going up, and it might make them even more bullish on shorting, even beyond the immediate control of their owners because these computer systems are insanely complex. (This is not discounting intelligent actors like Melvin).  \n\n\nI think competing HFT algos are responsible for the March 10th crash (more than the shorts, anyway) and it could happen again if the order book is every empty.   \nI also think these algos can be exploited by intelligent investors who are able to adapt to new-market and new-world conditions that have not been programmed or experienced before. \n\nI would love further discussion with wrinkle apes on these ideas.  \n\n\n**TLDR APE VERSION:**  \nWe are at war with computers. Good news is computers are fast but they don't know about the real world. Algos are likely responsible for and will be responsible for INSANE VOLATILITY that we have NEVER SEEN BEFORE.   \n\n\nIn the meanwhile... buy more... HODL.  \n\n\nThis is not financial advice.",
    "title": "GME Correlations and the Algo-Gone-Wild Theory",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n02yho/gme_correlations_and_the_algogonewild_theory/"
}