{
    "author": "WardenElite",
    "created_utc": 1615903260.0,
    "distinguished": null,
    "edited": 1615934549.0,
    "id": "m69pmu",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m69pmu",
    "num_comments": 638,
    "permalink": "/r/GME/comments/m69pmu/live_charting_for_3162021_predicting_the_days/",
    "score": 3409,
    "selftext": "Again to reiterate, since this should probably be at the top. **This is not financial nor investment advice.** **These are ideas and opinions for information purposes only.**\n\n**This is the migrated thread.**\n\n***This post will read bottom to top. It's easier for people to refresh the page and see edits at the top.***\n\n**Add me on Twitter!** [**https://twitter.com/elite\\_warden**](https://twitter.com/elite_warden). I'll be using that as a backup location to post notifications in the event of a Reddit outage. Here is my YouTube. I may post videos in my future and build my channel out after GME is over. [https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM\\_g](https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM_g)\n\n**Historical support and resistance levels for reference today:**\n\n152.5, 172, 182, 197.5, 210, 218, 234, 243, 250, 253, 256.5\n\n172 diagonal support\n\n**Edit 49 4:01PM:**\n\nRemember that my predictions are opinions. They may be right. They may be wrong. **I believe tomorrow has a high likelihood of trading sideways or continuing the uptrend.**\n\n**Edit 48 3:49PM:**\n\nI believe today was a clear inflection point. I do not trade on emotion, and given the data from today, all technicals tell me that we are reversing trajectory. Melvin and friends wanted to hammer this stock and make it look bad. Well today.\n\nThis stock looks great to me. I like the stock\n\nhttps://preview.redd.it/hrwcmpps2gn61.png?width=2094&format=png&auto=webp&s=08a2e59e0d938e1c7eef274f4ee4c48bca0d3a8d\n\n**Edit 47 3:45PM:**\n\nIn support of my thesis, I have added 15 shares to my position on my other brokerage account.\n\nhttps://preview.redd.it/ta0pran22gn61.png?width=2095&format=png&auto=webp&s=b7f82f0b83e667645be75ef51d97d7d86039b437\n\n**Edit 46 3:39PM:**\n\nWhat I'm seeing today is confirming my bullish thesis. **The steady climb we saw today would have happened Monday if they didn't artificially short this stock.** I believe that given SSR is on for tomorrow, we should continue our steady climb up!\n\n**Our bounce today at 172 was exceptionally bullish**. It was a sharp rejection of a downside breakout and is a great sign of recover.\n\n**Edit 45 3:25PM:**\n\nWe've bounced a bit higher than expected. It's still really low volume so the power hour push has not yet begun. Hang in there!\n\n**Edit 44 3:17PM:**\n\nThose are only some of the many violations that exist btw. I just listed the most common ones I've seen.\n\n**Edit 43 3:06PM:**\n\nI'm probably gonna attempt an account transfer. I hope my lord and savior is watching over me as the corporate brokerage goonies slowly process my request.\n\nLadyapes and gentleapes. Given how slowly the stock is moving, I want to fill the time and educate you all on the different types of account violations so you can be better prepared for the future if you decide to day/swing trade! **(edit: after GME of course. don't day trade this)**\n\n* **Margin Call**\n   * short a stock. stock goes up. BOOM. account blow up and margin call!\n   * buy on leverage. stock goes down. BOOM. account blow up and margin call!\n* **PDT**\n   * Account size smaller than 25k. You place 4 or more day trades within a 5 business trading day period. You get flagged as PDT for 90 days!\n* **Equity Maintenance Call**\n   * you have PDT. You place a trade but your account value goes below 25k. Now they want you to bring it above 25k or you can't day trade again for 90 days! (edit: if you get it above 25k, you can day trade again)\n* **Free Ride Violation**\n   * you have a cash account. You buy and sell a stock with unsettled cash. Free ride violation for 90 days.\n* **Day Trade Call (my current violation lmao)**\n   * you buy a non marginable stock worth more than your available non marginable limit. 90 days.\n   * Depending on the brokerage, you basically can't day trade. In my case, I also have issues with selling too (most brokerages don't have this issue). You have to call some brokerage guy on the phone and get them to place trades for you while this call is active.\n\nThese are only some of the violations and calls you will experience. I've personally been through all of them except for the margin call. These rules may vary by broker. Though this would be helpful for apes looking to avoid trouble in the future!\n\n**Edit 42 3:01PM:**\n\nStair steps down probably. S&P 500 is tanking. We may bounce during power hour.\n\nhttps://preview.redd.it/xt8e2lj4ufn61.png?width=2093&format=png&auto=webp&s=c79480f5dd77630dcd0382b4c5e0132196fc207b\n\n**Edit 41 2:56PM:**\n\nIf I even mention the name of the brokerage, I bet they will hunt for me and capture me. These brokerages are up to no good. Apparently GME is nonmarginable because of its \"volatility\". Lol. This is some Vlad Tenev level fuckery. Dw my fellow apes, I'll continue doing these live chart posts.\n\n**Edit 40 2:47PM:**\n\nAlso. I swear my boomer brokerage is screwing me over in all sorts of ways. Apparently I bought GME when it was non marginable, meaning you can't buy it on margin.\n\nI had just sold another non marginable stock meaning that my gains don't recycle into my non marginable buying power. So guess what, I literally can't sell GME unless I wait 20 minutes on the phone for some guy to place the trade for me LOL.  I have a thing called a day trade call violation on my account for 90 friggin days. WTF BROKERAGE.\n\nPlease hmu my apes if I miss this squeeze  [😢](https://emojipedia.org/crying-face/)\n\n**Edit 39 2:46PM:**\n\nGuess why GME went with option B? That's right, because the broader market is down. Forces the HFT algorithms to go short biased resulting in GME trading downwards.\n\nhttps://preview.redd.it/viae7xlbufn61.png?width=599&format=png&auto=webp&s=c56ad448d60d87e3a41d1eefaca822b7054b70c7\n\nWe hit 220! Seeing a minor pullback now.\n\n**Edit 36 1:52PM:**\n\nAnddd.... we hit 218. This is a good sign. Can we make it to 220?\n\n**Edit 35 1:43PM:**\n\nhttps://preview.redd.it/6jdpdsj6gfn61.png?width=2095&format=png&auto=webp&s=6565f551bf81f4fb584798af8f0f8225c0992209\n\n**Edit 34 1:26PM:**\n\nInteresting upwards movement. Seeing some significant buying pressure. Volume ramping up, is it enough to reach 218, and then 220?\n\n**Edit 33 1:15PM:**\n\nOne valid interpretation of the macro trend is an ascending channel bounce. Let's wait and see if it can hit the 220 resistance to confirm this trend.\n\nhttps://preview.redd.it/8ocpyy5frfn61.png?width=591&format=png&auto=webp&s=99139adc81ea036013347f09b370c0708d393a49\n\n**Edit 31 12:01 PM:**\n\nGotta hop to my class for an hour. Be back soon! I don't anticipate anything major to happen during midday trading. Hang in there my fellow apes.\n\n**Edit 30 11:55 AM:**\n\nSeems like a downwards version of B. It's just sagging a bit and now attempting to return to the 197.5 resistance. IT seems to be forming a descending channel though. Again, you are watching algorithm trading. It's quite random.\n\n&#x200B;\n\nhttps://preview.redd.it/ev6n5z7ezfn61.png?width=595&format=png&auto=webp&s=5ead98b959b23c82cefd70e2aeecb7914c0163ee\n\n**Edit 28 11:42 AM:**\n\nCan it go down? Yes. MACD and RSI don't seem to favor it though... remember, midday. It's just bots and algorithms driving the price.\n\n**Edit 27 11:39 AM:**\n\n50-50\n\nRemember it's near midday, predictions are harder. I will stick to giving possible paths.\n\nhttps://preview.redd.it/sc3csv4o2gn61.png?width=591&format=png&auto=webp&s=169037879bdeaac19fd3a565f6ff585704ced9e2\n\n**Edit 24 11:26 AM:**\n\nPlease watch this awesome video if you want to learn about how to draw support and resistance lines. [https://www.youtube.com/watch?v=rq4jthS3nTA&ab\\_channel=HumbledTrader](https://www.youtube.com/watch?v=rq4jthS3nTA&ab_channel=HumbledTrader)\n\nPlease upvote her video. She's a great trader!\n\n**Edit 23 11:21 AM:**\n\nConsolidation above this support. We're at a particularly tricky spot where there are many many possible trajectories. I will just watch and see what it does for now.\n\nhttps://preview.redd.it/pzu1zzo7ren61.png?width=953&format=png&auto=webp&s=f600354dadbeea0e4ee222bf8a1ea19e80db1993\n\n**Edit 22 11:16 AM:**\n\nIt's traveled a tad higher and bounced. Lesson learned on my side. Never forget to map **every single support and resistance**. I missed the 210 resistance which is why there was no \"C\" option back in edit 15.\n\n**Edit 21 11:13 AM:**\n\nIt's testing the prior channel resistance as a support now. Bouncing would be good for us but it could descend back into the channel.\n\nhttps://preview.redd.it/rxwrp92jpen61.png?width=2105&format=png&auto=webp&s=ce2dc7b904a684eb2b40a2650a06bd1966d271b5\n\n**Edit 20 11:12 AM:**\n\nSmall mistake, 210\\*. There's a resistance there I haven't mapped.\n\n**Edit 19 11:09 AM:**\n\nIt's broken the channel! Headed towards 218.\n\n**Edit 18 11:07 AM:**\n\nAttempting to break out of the channel, but looks like it's respecting A.\n\n**Edit 17 11:06 AM:**\n\nIt's rejecting B and shifting to A. Very interesting. Sign of stronger buying power than expected.\n\n**Edit 16 11:04 AM:**\n\nCheck Edit 9. First half of my prediction confirmed.\n\n**Edit 15 11:00 AM:**\n\n60-40 favoring B.\n\nhttps://preview.redd.it/qytetz38nen61.png?width=2093&format=png&auto=webp&s=92977366e0e26852141958551aaa3e62935de5c5\n\n**Edit 14 10:43 AM:**\n\n50-50\n\nhttps://preview.redd.it/9b2ltp32ken61.png?width=2094&format=png&auto=webp&s=444972551a1ff3e4141070d6821a2222a948b9be\n\n**Edit 13 10:15 AM:**\n\nWe should bounce soon\n\nhttps://preview.redd.it/zinom122fen61.png?width=2096&format=png&auto=webp&s=60556e7a09e4540eaa19faff2c793a224c8ada37\n\n**Edit 12 10:08 AM:**\n\nIt's hitting a strong support barrier at 184 ish.\n\n**Edit 11 10:03 AM:**\n\nMy smooth brain titled the old post wrong. Moved it over here!\n\n**Edit 10 9:58 AM:**\n\nHEY EVERYBODY, IN ABOUT A FEW MINUTES, IM MOVING THIS POST INTO A PROPERLY TITLED POST. SORRY LMAO.\n\n**Edit 10 9:56 AM:**\n\nOn it's way back down to either the 182 level or the 180 diagonal.  [https://www.reddit.com/r/GME/comments/m6711i/15\\_million\\_etf\\_shares\\_to\\_short\\_were\\_just\\_borrowed/](https://www.reddit.com/r/GME/comments/m6711i/15_million_etf_shares_to_short_were_just_borrowed/)\n\nYes a shit load of shares were borrowed for short attacks. Given the SSR in place, Melvin and friends can only slowly drop the price. My assumption is they are trying to shape the price perfectly within the descending channel, so all the bots and algorithms beginning going short biased and trading the channel.\n\n**Edit 9 9:50 AM:**\n\nSuper fucking rough prediction. Bear with me. Don't mind the pun ;)\n\nhttps://preview.redd.it/9qgkwgt9cen61.png?width=2094&format=png&auto=webp&s=60d733011fa1f456bbaa7879809190d37a38ea14\n\n**Edit 8 9:49 AM:**\n\nI will read comments when things settle down a bit. Currently mapping out the new channel supports and tweaking them.\n\n**Edit 7 9:47 AM:**\n\nAdded an extra layer, it respected a different diagonal support.\n\nhttps://preview.redd.it/xvhtmjdacen61.png?width=2090&format=png&auto=webp&s=6f924c55481b0c92adc8ef035fa8276f1d18b1b2\n\n**Edit 6 9:42 AM:**\n\nToday I added a couple other supports. We're looking at a triple diagonal channel. The outer two diagonals on the left are from the short attacks overextending the price. I'm expecting the price to bounce in these channels.\n\nhttps://preview.redd.it/5y8hjvzacen61.png?width=2093&format=png&auto=webp&s=83bd1ccfec159657538352ba838ac84e3e988fad\n\n**Edit 5 9:39 AM:**\n\nBuying pressure weak, should consolidate for a bit, perhaps inch higher.\n\n**Edit 4 9:38 AM:**\n\nSorry guys I'm actually retarded. Title should say \"16th\". Anyways its headed to the 182 support.\n\n**Edit 3 9:35 AM:**\n\n1.9M volume first minute, yes this is a Stock in Play. This is definitely a short side favored Stock right now. I will help you guys find potential entry points. Today should yield the lowest dips. On Wednesday, Melvin will challenge the 172 diagonal support I believe.\n\n**Edit 2 9:30 AM:**\n\nLet's zoom out to understand the macro trend. **We are in the middle of dangerous whale territory.** Long side has backed off for now. I view this as a good thing. You apes can potentially purchase shares for cheap. Melvin and friends will **fiercely attack the 172 diagonal support.** This is the trendline from back in the first runup.\n\nhttps://preview.redd.it/3w2s8njbcen61.png?width=2114&format=png&auto=webp&s=b3c8a65b38e39f7c1723b53a987356c6563b3dbb\n\n&#x200B;\n\nOur trajectory is a descending channel. It will be hard to break but SRR can help. Any positive catalysts can disrupt the downwards momentum and make it trade sideways.\n\n**Edit 1 9:26 AM:**\n\nAllow me to check the volume during the first minute of market open to determine if this is a Stock in Play. If so, I'll resume on predictions. I believe today, this stock will have the ability to trade sideways. Again, if this is not a Stock in Play, this prediction won't be valid.\n\n# Begin Reading Here\n\nhttps://preview.redd.it/wdvdsutccen61.png?width=769&format=png&auto=webp&s=9b397b27e74834b7a2c010bf1c9633ffc563d07a\n\nGoooooooooooooood my fellow apes!\n\nIt's certainly been an unsettling time recently. Melvin and friends have hammered this stock over and over. I'm here to spit facts and let you boys and girls know their dirty tactics. I tell you what I observe and I let you make your own judgements.\n\n&#x200B;\n\n# Melvin's tactics\n\nIf I was Melvin, I'd pick two precise spots to hammer the stock. First, I'd hammer it **really fucking hard** once to make it's ascending channel into a descending channel. Then I'd hammer the sideways trend just a bit during a low volume day when the S&P 500 is down, to both cause fear in retailers and day traders, as well as cause high frequency trading algorithms to drag it lower.\n\nhttps://preview.redd.it/b4aoh1aecen61.png?width=2114&format=png&auto=webp&s=3102dee7fe3ca1a7e74eb91e6e89a594518c0a95\n\nhttps://preview.redd.it/ozlkeqwcnfn61.png?width=593&format=png&auto=webp&s=c0f649f78cb30a2cec7b9677d00d196dd535722a",
    "title": "Live Charting for 3/16/2021, predicting the day's price action in detail with Warden. Understanding the recent dips.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m69pmu/live_charting_for_3162021_predicting_the_days/"
}