{
    "author": "memebetch6969",
    "created_utc": 1623742923.0,
    "distinguished": null,
    "edited": 1623983295.0,
    "id": "o08rmm",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o08rmm",
    "num_comments": 313,
    "permalink": "/r/Superstonk/comments/o08rmm/whats_the_deal_with_reverse_repos_anyway/",
    "score": 6391,
    "selftext": "Update part 1.2: [https://www.reddit.com/r/Superstonk/comments/o28xhx/whats\\_the\\_deal\\_with\\_reverse\\_repos\\_anyway\\_dd\\_part/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/o28xhx/whats_the_deal_with_reverse_repos_anyway_dd_part/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) —————————-\n\n# Let’s talk about the Fed\n\nThe Federal Reserve’s (the Fed’s) responsibilities as the nation’s central bank fall into four main categories: **monetary policy, provision of emergency liquidity through the lender of last resort function, supervision of certain types of banks and other financial firms for safety and soundness, and provision of payment system services to financial firms and the government**.\n\nCongress has delegated responsibility for **monetary policy** to the Fed. Monetary policy can be used to stabilize business cycle fluctuations (alternating periods of economic expansions and recessions) in the short run, while it mainly affects inflation in the long run. **Monetary policy** refers to the actions the Fed undertakes to influence the availability and cost of money and credit to promote the goals mandated by Congress, a stable price level and maximum sustainable employment\\*\\*.\\*\\*  The Fed targets the **federal funds rate** to carry out monetary policy. The **federal funds rate** is determined in the private market for overnight reserves of depository institutions (called the federal funds market). At the end of a given period, usually a day, depository institutions must calculate how many dollars of reserves they want or need to hold against their reservable liabilities (deposits).\n\nThe Fed’s conventional tool for monetary policy is to target the federal funds rate—the overnight, interbank lending rate. Some institutions may discover a reserve shortage (too few reservable assets relative to those they want to hold), whereas others may have reservable assets in excess of their wants.  These reserves can be borrowed and lent on an overnight basis in a private market called the **federal funds market**. The interest rate in this market is called the **federal funds rate**.\n\n* If it wishes to expand money and credit, the Fed will lower the target, which encourages more lending activity and, thus, greater demand in the economy.\n* If it wishes to tighten money and credit, the Fed will raise the target. The federal funds rate is linked to the interest rates that banks and other financial institutions charge for loans. Thus, whereas the Fed may directly influence only a very short-term interest rate, this rate influences other longer-term rates. However, this relationship is far from being on a one-to-one basis because longer-term market rates are influenced not only by what the Fed is doing today, but also by what it is expected to do in the future and by what inflation is expected to be in the future.\n\nThe Federal Reserve uses two methods to maintain its target for the federal funds rate:\n\n* The Fed can also change the two interest rates it administers directly by fiat, the rate it charges to borrowers and the rate it pays to depositors.\n* Traditionally, the Fed primarily relied on open market operations, which involves the Fed buying existing U.S. Treasury securities in the secondary market (i.e., those that have already been issued and sold to private investors). Outright purchases of securities were used from 2009 to 2014. Because of the large increase in bank reserves caused by, open market operations alone can no longer effectively maintain the federal funds target. Normal open market operations are typically conducted through **repos** instead.\n\n# When the Fed wishes to add liquidity to the banking system, it enters into repos. When it wishes to remove liquidity, the Fed enters into reverse repos.\n\nIn a **repo operation**, the Fed lends overnight by providing cash against the collateral of securities. A **reverse repo** goes the other way: the Fed borrows overnight by receiving cash from its lenders while providing them securities as collateral.\n\n# Finally, we can talk about Reverse Repos and its significance to the current state of the markets, but first we must address the Debt Ceiling issue.\n\nThe **debt ceiling** is the maximum amount the U.S. government can borrow, as directed by Congress, to meet its financial obligations. When the ceiling is reached, the Treasury cannot issue any more bills, bonds, or notes. It can only pay bills through tax revenues.\n\nCongress previously agreed to suspend the limit through July 31, at which point the Treasury has only a few months of “extraordinary measures” before lawmakers must either raise the amount, or face consequences of **technical default**.\n\nIt has a target cash balance of $450 billion at the so-called Treasury General Account (TGA) on July 31. As of June 9, the Treasury’s cash balance was $674 billion, down from $1.8 trillion last October. It is not allowed to run up its cash balances ahead of the debt ceiling, because doing so is viewed as circumventing the borrowing limit. It has more than a month to pare back its cash, unless Congress raises or suspends the U.S. debt limit.\n\nAs the Treasury spends money from its general account, the cash ends up on bank balance sheets, often in the form of **money market funds**. With front money market yields so low – in some cases on the cusp of falling below zero — investors have opted to place cash with the Fed’s reverse repurchase facility, which pays zero interest rates.\n\nThere is so much cash at the front of the curve and low T-Bill supply from the TGA pay down that money market funds have no where else to go but the Fed **reverse repos**. It is less painful than potentially have to earn negative rates on your cash.\n\nImagine you are a money market fund manager and you have $500 million cash. This cash came from a bank like Goldman who is looking to reduce its balance sheet constraint from a recent large deposit from a client and is charging deposit fees (negative rates). Ok so now what? I have all this cash and will have to pay this fee to Goldman unless I do something with it. Since there are no interest options given the abundance of cash across the market, you go to the reverse repo at 0% Better than earning nothing and having to pay fees right? Why not just buy t-bills if you are a MMF? Well, because of the TGA pay down due to the **debt ceiling**, there is just not enough bill supply out there.\n\nOn top of that you add the money that people have been injecting into the banks, due to the fed printing money in the form of **stimulus**, and the American people have more money parked in the big banks than ever before. The big banks are currently losing money on interest payments because of all this money. The banks don't want all this money, so they perform repo contracts with the FED. The banks and the fed are using the repo market as a way to keep interest rates within their targets and control the amount of liquidity they both have. The FED wants to keep printing money to keep the economy running and the banks want to get rid of the printed money to keep the lights on.\n\n# All of the above has led to this:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/h29sjv3hqx571.png?width=1278&format=png&auto=webp&s=74efb03d8265a77b7ca42c35246b9b05b13b5deb\n\n# Fucking TNT right? Well here comes the Nuke…\n\nTraditionally this has been the flow of money in the reverse repo operations:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/scmne5qhqx571.png?width=545&format=png&auto=webp&s=156810a0b19fd689a26323e4772ebe53f11baeb7\n\nThis loop is about to be broken due to Citadel and friends. Citadel owns a company called **Palafox Trading** (market maker for repo agreements, yup) and uses them to EXCLUSIVELY **short & trade treasury securities**. Purchasing the US Treasury bond, in conjunction with mortgage backed securities, allowed the fed to keep pumping unlimited liquid cash into the repo market. Things are not as easy when Citadel comes along and borrows the bonds from Blackrock, they throw it into Palafox Trading and collect their cash. According to this case study: [https://www.localsuccess.org/shorting-the-us-treasury-bond-2021/](https://www.localsuccess.org/shorting-the-us-treasury-bond-2021/)\n\n“**Citadel has shorted more treasury bonds than are available**… With the federal reserve purchasing them monthly from the open market, it leaves room for a shortage when the repo call hits. If an entity like BlackRock hasn’t purchased more treasuries since lending them out, hedge funds like Citadel simply cannot cover unless they go into the market and PAY the bond holder for their bond. It’s literally the same story as all of the heavily shorted stocks… There is TOO much evidence, from TOO many separate events, pointing to the imminent default of something big. That’s all this is going to take. When Ted can’t repay Steve, it means the panic has already started. Just look at how easy it was for the repo rate to spike overnight in 2019. We are already starting to see the consequences of the SLR update with Archegos, Nomura, and Credit Suisse. This is just a taste of what’s to come… and now we know the bond market represents an even BIGGER catalyst in triggering this event… and it’s happening already…With that being said, things finally started to make sense… Citadel doesn’t NEED shares if their investment strategy to go short on EVERYTHING instead of going long. Why bother owning shares? BlackRock and other asset managers simply lend them to you when you need to pony up a margin call for stocks and bonds…Their HFT systems allow them to manipulate the market in their favor so there’s NO way they could fail… **unless… a bunch of retail investors all decided to ignore taking profits.** But that would NEVER happen, right?”\n\n# LET’S WRAP THINGS UP\n\nThe feedback loop will eventually be broken due to the increasing interest payments of losing short positions. When this happens, the banks won't be able to keep performing these repos, the FED won't be able to perform reverse repos, interest rates will either sky rocket or go negative-hyperinflation or depression.\n\nWhat is the FED doing about all this? \\*puts on tinfoil hat\\* Most likely **colluding**:\n\n&#x200B;\n\nhttps://preview.redd.it/tpzgwj2jqx571.png?width=1117&format=png&auto=webp&s=79e1f6653e662a97bc37b4b21a64c7578bb0ec1d\n\n[If I had went into this in detail would need a part 2, it's 2:30AM right now so you'll just have to take u/Criand word for it](https://preview.redd.it/apgzo9kavd571.png?width=624&format=png&auto=webp&s=46624db19f3752d401ef9b0e26c09daa102f8077)\n\n# So we have TNT on top of a Nuclear Bomb in the Reverse Repo Market, on top of that you have everyone borrowing money like crazy:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/5grzev1kqx571.png?width=810&format=png&auto=webp&s=4268c20be2871300888871ba6d4d2bc6e3f61b63\n\n# Which makes me think what will happen in the event of monster margin calls that lead to the liquidation of blue chip stocks? Who is safe here really?\n\nLastly, in this DD: [https://www.reddit.com/r/Superstonk/comments/nxxwqt/tldr\\_i\\_believe\\_inflation\\_is\\_the\\_match\\_that\\_has/](https://www.reddit.com/r/Superstonk/comments/nxxwqt/tldr_i_believe_inflation_is_the_match_that_has/)\n\n# u/Dismal-Jellyfish Brilliantly pointed out another ticking bomb to this entire equiation, inflation.\n\nHe says that “Inflation is going to make it impossible to earn positive rates on assets after being adjusted for inflation on anything but “extremely speculative” to “default is imminent with little prospect for recovery” risks… Because of inflation, the shorts are going to drown in their cash. **There is no place for it to go** to earn a positive yield greater than what inflation will eat, or should be acceptable for the level of risk of default…With nowhere to park this cash to generate positive yields and while having to contend with balance sheets that are having assets eaten away, participants will continue to use the Reverse Repo to buy time **until**:\n\n* Being down in real terms because of inflation is something that cannot be made back up to service the debt and will weigh on balance sheets as they try to protect from margin calls.\n* ·Their existing collateral on the balance sheet can get re-rated lower, re-appraised lower, or just eaten by inflation to the point even what they are borrowing in treasuries can’t meet the requirements to hold off a margin call.\n* They hit the 80 billion Reverse Repo limit because of nowhere else to place cash, are tapped out on treasuries, and no longer able to post acceptable collateral to meet their margin requirements.”\n\n\\------end of quote\n\n# That was a lot to recap, sadly I have no TLDR. I do however have my own conclusion from digesting this information.\n\nIt seems like their only way out is bankrupting GME. Which only then they can begin to clean up their mess, as hard as it sounds I believe they can get out of it if they straight up bankrupt a thriving growth company. The fallout from this though…\n\nI do not believe that will happen. They can however try to get us all to sell so they can cover at a much lower price in a controlled demolition style. I believe they have taken too long and our diamond hands prevailed, giving GME enough time to make the necessary changes they needed to make.\n\nI made a chart earlier regarding their most recent breakout:\n\n&#x200B;\n\nhttps://preview.redd.it/go9ovndlqx571.png?width=1621&format=png&auto=webp&s=315557c1caf7800a4e98ac585022e68a9abca0a6\n\n[trading sideways guy, exponential floor guy, and t21 guy get all the love.  But what about dorito triangle guy?](https://preview.redd.it/0yra8u9kvd571.png?width=676&format=png&auto=webp&s=5301fa30def4c424e447e9b2e3f41566c2a9eca2)\n\nI believe the fundamentals are too strong at this point and the earnings are looking better each time. It’s too late for them now. I have always believed in the company and I’m going to keep holding. They put themselves in this situation, their greed. If the entire financial system comes crashing down because I believe in a company then maybe the system was broken to begin with. I look forward to the opportunity to rebuild a more transparent free market that works for the people when this is all over though. That is just my personal opinion, it doesn’t really matter. I just really like the stock.\n\nEDIT: I’m currently working on part II which will connect the dots with GME. I know i threw it  without much context,but there is a lot of data that needs thorough explanation. As well as a new finding, that the fed is pinned in this and is working their way out. Possibly by margin calling the margin callers, due to them taking advantage of SLR benefits. There is so much to this. The purpose of this post was meant to be educational but evolved into a deep web that I’m currently investigating. There are just so many angles to this. Will post part II as soon as I have a strong enough thesis to connect GME with supporting evidence.",
    "title": "What's the deal with Reverse Repos anyway?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o08rmm/whats_the_deal_with_reverse_repos_anyway/"
}