{
    "author": "AcedVector",
    "created_utc": 1623771968.0,
    "distinguished": null,
    "edited": 1623856110.0,
    "id": "o0hey8",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o0hey8",
    "num_comments": 172,
    "permalink": "/r/Superstonk/comments/o0hey8/why_big_name_banks_like_bank_of_america_jp_morgan/",
    "score": 5968,
    "selftext": "#Edit: I just want to thank everyone for the support you guys have been giving me in the comments! I truly appreciate it and I am greatful that this community is a really nice and caring one. I wouldn't want to go to the moon any other way, this sub is really something else. :)\n\nHello fellow apes! Its been difficult finding something to properly write up about lately, but I think I've got some right now all things considered.\n\nBy now, you may have seen posts like this floating around on reddit:\n\nhttps://www.reddit.com/r/Superstonk/comments/o0ctw1/eu_freezes_10_banks_out_of_bond_sales_over/?utm_medium=android_app&utm_source=share\n\nHere is a quote that I think helps effectively summarize an alternative article the OP of the post provided regarding this topic:\n\n\"A spokesperson for the European Commission, which handles debt issuance on behalf of the European Union, said that banks found to have violated EU competition rules “will not be invited to bid for individual syndicated transactions. \"\n\n#Wut mean?\n\nBasically, the articles were saying that the EU had to literally FORCEFULLY stop banks from participating in their bonds sales because of how ridiculous their borrowing has gotten, along with their history of market manipulation in the past. The fact that a lot of these banks are common names here in the US: JP Morgan Chase, Bank of America, Citigroup, etc. speaks volumes to how bad the fuckery has really gotten.\n\nI want to just elaborate a bit: these banks are trying to not just borrow bonds from the US, but ALSO from the EU just to try to fix their balance sheet and make their debt look a little bit more reasonable. The EU saw ahead of the disaster and took IMMEDIATE action to stop it, as they didn't want the fire to spread to them and screw them as well.\n\n Its quite clear at this point that they have fucked the system, but what have they been DOING exactly to fuck the system, and fuck EVERYONE except themselves just to keep themselves afloat?\n\nI refrence another article in the following paragraph, from this source:\n \nhttps://ec.europa.eu/commission/presscorner/detail/en/ip_21_2004\n\nHere is exactly what they have been doing, according to a European article speaking on the European commission fining banks like these for violating EU anti-trust laws (keep in mind, this was from April of 2021 and are regarding different bonds but multiple big name banks are probably still doing this overall):\n\n1. Logged onto multilateral/ bi-lateral chat rooms on Bloomberg terminals and knew each other suspiciously well despite being in \"direct competition\".\n2. Because of how well they knew each other, they updated each other frequently on their trading activities.\n4. They had at times agreed to hold back on bidding and offering in the market if it meant they would come into competition with each other.\n5. They had split trades between each other to either combine or reduce their positions to meet a specific customer's request (the article doesn't specify on what customer in particular) without the customer themselves knowing they were dealing with more than one entity and thus in theory the customer's choices were limited.\n\n#Conclusion/TLDR:\n\nBasically, Bank of America, Merrill Lynch, Crédit Agricole, and Credit Suisse all aligned their trading activities in such a way that they acted as a SINGLE entity to manipulate the bonds market in April 2021 and got caught for it and fined. But remember, these were just the banks that GOT CAUGHT doing this. With the EU recently barring more big banks like JP Morgan & Chase and Citigroup from participating in their bonds sales it looks like they are suspicious of them as well in corroborating in market collusion to a similar degree.\n\nHow many more banks are in on this collusion, acting as one big entity to further their own agenda in the market and fuck everyone else over, that has been happening for MULTIPLE years now? Is their debt so big now that they are preying on EU bonds and the EU realizes what could  happen if these big name banks colluded in bonds sales together and spread their debt amongst themselves so they don't all go down together? I feel like when the whole truth comes out and more gets revealed regarding this it will possibly be the absolute WORST case of financial corruption in this \"free market\" in history.\n\n\n#Post DD Message\n\nAnd as always guys, thanks for reading my posts! :) I know I haven't posted as much lately regarding DD and in all honesty the reasoning for that was because a lot of my DD would get debunked, and I felt discouraged to continue making more without stronger sources to back up my claims. I tried to make my DD a little stronger today, and I hope you guys have enjoyed reading it! Hopefully I can continue to improve more with DD in the future and make something really good in quality.\n\n\nSources:\n\nhttps://ec.europa.eu/commission/presscorner/detail/en/ip_21_2004\n\nhttps://quebecnewstribune.com/news/business/eu-freezes-bond-sales-of-10-banks-for-violating-antitrust-laws-18190/",
    "title": "Why big name banks like Bank of America, JP Morgan Chase, Citigroup and more were excluded from bonds sales in the EU, and what banks have been doing for YEARS to manipulate the market to fuck everyone else over",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0hey8/why_big_name_banks_like_bank_of_america_jp_morgan/"
}