{
    "author": "madal2",
    "created_utc": 1619343910.0,
    "distinguished": null,
    "edited": 1619374001.0,
    "id": "my5084",
    "text_only": true,
    "flair_text": "Shitpost 🎱",
    "name": "t3_my5084",
    "num_comments": 32,
    "permalink": "/r/GME/comments/my5084/whats_all_this_negative_talk_about_market_crashes/",
    "score": 745,
    "selftext": "GDP is roughly defined as a money  measure of the market value of all the final goods and services produced  over a specific time. (thanks Wikipedia) Has anyone thought about all  of the *indirect* ways that GME  has contributed to the GDP? This list is by no means comprehensive, but  the result of a crayon sniffing binge, and is in no way financial  advice.\n\nThe first thing I think  about is all those bankers/traders/hedgies burning the midnight oil, even on  weekends all over the world trying to figure out how weasel themselves  out of what’s coming. They’re all WORKING. A lot.\n\nWhat  about keeping those lights on? Energy producers and utilities are  killing it. What about the coal and natural gas needed to keep those  lights on?\n\nThink about all of the coffee (commodity) and cigarettes being consumed.\n\nWhat about all the cocaine (local business) and Adderall (pharmaceuticals) needed to function at those hours?\n\nThey  have to eat, don’t they? 24 hour fast food is where it’s at. I keep  thinking about White Castle (private, no stonk) in Chicago. The drive  through lines are full at all hours. At all the 24 hr fast food joints.\n\nEdit: My good friend u/kevinstrong12 told me I forgot about the sex workers, and he's right. Now instead of calling it a night after bars close, they will literally be working 24/7. Mostly behind a 24hr Wendy's giving handies to the hedgies and interns who are running for food at 5am. The beauty of this is that after the MOASS, the hedgies will be there to give those handies. They'll still be gainfully employed! So no one will shed a tear because they will still have jobs.\n\nThink  about the vast amounts of junk food being consumed. When they all get  fat from working night shifts, which is an inevitability, gym  memberships will skyrocket. And then comes the diabetes, we’re back to  pharmaceuticals again, plus the medical service industries. Getting  yelled at by your managers will increase stress. And Xanax  prescriptions. Even more pharmaceuticals. This will continue to  multiply. Exponentially.\n\nThey will  need better and faster means with which to front run their orders so as  to beat their competition by a couple zepto-seconds (that’s a thing,  look it up). More newer, better hardware and servers. Think big iron.  And there’s even a chip shortage going on. The hardware manufacturers  are making BANK!\n\nNext generation  fiber and infrastructure, networking hardware, server farms will be  needed as well. Think about the tech revolution that these guys will  lead! It boggles the mind.\n\nAnd  don’t forget, they’ll be busy making so many more counterfeit shares,  we’ll be swimming in them. They’ll be making them better and faster then  ever before. Screw crypt0, mining for shares will be the next fad. You  heard it here first. These people are actually manufacturing things.  THEY MAKE STUFF! I can’t remember the last time I made anything that  didn’t float away into the sewer.\n\nWho’s  going to program and install this stuff? Coders will be churning out  better and faster algos by the hour. They’ll find the best and most  efficient new ways to move and hide money that no one ever even thought  of. Servers and network cable (copper) don’t install themselves.\n\nHow  are they getting to work at those hours? Cars (think oil and lithium).  Mass transit utilization is going through the roof. Increasing bus and  subway load factors improves efficiency. What good are empty buses at  4am?\n\nThere are armies of lawyers being put to work, right this very second!\n\nThey are employing shills to raid this and other subs to spread FUD.\n\nThere  are dozens of articles coming from the MSM daily about how bad GME is.  This clickbait generates millions in advertising revenue, no? And  ‘journalists’ have purpose again.\n\nWhat  about all the money that is made by checking google analytics and  google trends to see how late they are working? How many have looked at  this before GME? Infotech is booming.\n\nAll the books that people are now consuming, think NSG.\n\nThe  crash course in finance that everyone here is gaining. People are now  READING SEC filings. No one ever did that before. The IQ of the world is  rising quickly due to GME. Plus, an educated Ape is a dangerous Ape.\n\nThe civil servants being put to work by GG trying to figure a way out of this mess.\n\nWhat  of the upcoming boom in the repo market? Not talking about that repo  reverse-repo bond market. No one understands that shit. I’m talking  about those guys (not to be sexist, but they’re almost always guys) who  go take back toys. Lambos, Ferraris, Bentleys, Lears, Gulfstreams,  Cigarettes (boats) will flood the market. Gud for Ape.\n\nStorage Wars will go nuclear.\n\nWhat about the sudden increased demand for tendies, bananas and ramen? They can’t stock grocery shelves quickly enough.\n\nI  sleep very comfortably knowing that GME has indirectly caused an  economic boom in and of itself. I personally vow to buy a share each and  every (business) day until the MOASS or I run out of money, knowing  that by doing this, I am contributing to the broad economy.\n\nPlease take the time to add to the list in the comments.\n\nTL;DR:  As an indirect result of the interest in GME, unemployment will soon be  zero, people will continue to gain an education, and rumors of an  impending market crash are pure FUD.\n\nTA;DR: Buy and Hodl",
    "title": "What’s all this negative talk about market crashes? GME is the best thing that has happened to the broad economy. EVER.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/my5084/whats_all_this_negative_talk_about_market_crashes/"
}