{
    "author": "wladeczek44",
    "created_utc": 1626699031.0,
    "distinguished": null,
    "edited": 1626734225.0,
    "id": "ondeot",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_ondeot",
    "num_comments": 524,
    "permalink": "/r/GME/comments/ondeot/mathematical_proof_for_phone_number_prices_under/",
    "score": 4220,
    "selftext": "TL;DR: I made a calculation which justifies why Infinity Pool is the most dreaded expression by shills. Only part of the float in infinity pool makes short extremely hard to close, virtually impossible. number of shares, respectively:\n\nEDIT: automod on jungle banned it, Pink let it through few hrs later. I edited it to point to this one to keep one place for discussion.\nEDIT: updated wrong calculation for scenario of normal shorts closed first.\nEDIT: Infinity Pool expression definition used in the title and post: it's a subset of shares owned by the shareholders which won't change the owner in a foreseeable future. The definition and the post as a whole doesn't say anything about the size of this set, this is an analysis of the potential impact of it's existence.\n\nN - naked shorts\n\nF - freefloat\n\nS - normally shorted shares, 29th June on Yahoo this number is reported 18.52% of F.\n\nT - total shares bought by retail including created from naked shorts: T = F + S + N\n\nAssuming the level of shorting from most DDs T is much bigger than F. To close short positions HFs have to buy S + N shares.\n\nWhen naked short is closed the share associated with it effectively vanishes. There are some buyers who don't want to sell at any point, and some buyers who will sell only a fraction of shares. So let's say there is a number of shares which will never be sold - infinity pool.\n\nI - number of shares in infinity pool\n\nT - I is the number of shares which can be bought.\n\nIn favor of shorters, let's assume for convenience that every normal short closed gives a share which can be bought again to cover another short. The optimistic scenario for shorters also assumes that they managed to close naked shorts. After closing naked shorts there are S shorts left and T - I - N shares left in circulation to buy again. Scenario of normal shorts closed first is ~~tougher for HFs~~ equivalent- discussed at the bottom. From the definition of T:\n\nT - I - N = F + S + N - I - N = F + S - I\n\nF + S - I must be a positive number in order to close shorts. If this number is small, like 100, shares will have to be bought S/100 times to close positions. Considering a scenario where at least part of the retail are idiots who don't know anything about existence of the sell button it get's really interesting. Say, independently of each other, en average, buyer won't sell 30% of his shares: I = 0.3*T and normal shorts S = 0.18*F. So the number of shares left to close short will be\n\nF + 0.18*F - 0.3*T = 1.18*F - 0.30*(F+S+N) = F\\*(1.18 - 0.30 - 0.18*0.30) - 0.3*N = 0.826*F - 0.3*N > 0\n\n0.826\\*F/0.3 > N\n\nF > N/2.75\n\nI hope this gives you an idea of how shorters are fucked. If the number of naked shorts vastly exceeds F infinite pool doesn't have to contain all the shares in circulation to make it impossible to close. And this is a weak scenario. In fact let's put I = a\\*T where a is a fraction if idiots mentioned above.\n\nF\\*(1.18 - a - 0.18*a) - a*N > 0\n\n1.18*F - 1.18*F*a - a*N > 0\n\n1.18*F - a*(1.18\\*F + N) > 0\n\n1.18*F > a*(1.18\\*F + N)\n\n1.18*F/(1.18*F + N) > a\n\nnow there is a direct relation between N and a. In a \"big\" scenario where N = 2\\*F. Number is arbitrary, but less than some estimates [yesterday](https://www.reddit.com/r/Superstonk/comments/omdafo/final_update_of_google_consumer_survey_n2200_at/?utm_medium=android_app&utm_source=share) (rounded from 0.371, thanks for the link u/karasuuchiha) :\n\n0.37 > a\n\nEven a relatively small infinity pool cause shorts impossible to close. Appendix:\n\nIf normal shorts are closed first, then shares left to cover N are ~~T - I - S = F + S + N - I - S = F + N - I~~ \n\nT - I because shares remain in circulation. Must be higher than N to cover.\n\nF + S + N - I > N\n\nF + S - I > 0\n\nF + S - a\\*(F + S + N) > 0\n\n(F + S)/(F+S+N) > a which is ~~even more difficult.~~ equivalent.\n\nfurther read - one ape here referred to an analysis by u/pjotra123 3 months ago about how pricing during the moass could look like. It's extremely wrinkled so maybe a good idea to ask the author for some smooth crayon version:\n\nhttps://www.reddit.com/r/GME/comments/nsv3mz/moass_visualized_distributions_game_theory/?utm_medium=android_app&utm_source=share",
    "title": "MATHEMATICAL PROOF for phone number prices. Under the assumptions of naked shorts existence. If naked shorts are 200% of float, infinity pool larger than 38% of the float makes short impossible to cover and an infinite squeeze. This was banned on Jungle!",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/ondeot/mathematical_proof_for_phone_number_prices_under/"
}