{
    "author": "Anxious_Matter5020",
    "created_utc": 1628004251.0,
    "distinguished": null,
    "edited": 1628005260.0,
    "id": "ox5py3",
    "text_only": true,
    "flair_text": "News 📰",
    "name": "t3_ox5py3",
    "num_comments": 62,
    "permalink": "/r/GMEJungle/comments/ox5py3/aware_of_the_sp_400/",
    "score": 725,
    "selftext": "You are aware GME is transitioning ~~from the Russell 1000 to S&P 400 Midcap~~  from the S&P 600 Smallcap to S&P 400 Midcap **PRIOR** to August 4th opening bell.\n\nYou are aware GME's price slid last time when re-balanced into Russell 1000 **PRIOR** to being introduced.\n\nYou are aware \" Index funds that mimic the S&P SmallCap 600 will be sellers of  GameStop over the next week while funds that try to mirror the moves of  the S&P MidCap 400 will have to buy the stock. That push and pull of  supply and demand of shares could lead to some confusing price  movements over the next week. \" - [https://www.shacknews.com/article/125845/gamestop-gme-moving-on-up-to-sp-midcap-400-index-next-week](https://www.shacknews.com/article/125845/gamestop-gme-moving-on-up-to-sp-midcap-400-index-next-week)\n\nYou are aware that like competitive games, GME is being ranked and is going for minimum Plat.\n\nYou are aware, that to do so, you must not only look good in everyone's eyes, but play better than them too, including the opposition, even if they say they hate you. They hate themselves for not thinking like you do, for being able to expand beyond your boundaries.\n\nYou are now aware the Russell 1000 is like being ranked silver and GME ripped through that rank with ease.\n\n&#x200B;\n\nNow, A lower price entering a index where GME is subject to even more awareness on the stock itself as it will look like a nice price to buy in at.\n\nYou are now aware that it is not one entity driving the price, but multiple entities fighting back and forth with the price, alongside algorithms in place from long ago.\n\nRetailers only need be aware of the possibilities that come from Buy and HODL.\n\nYou are Aware, You are Ape, You are HODL, You are the Future.",
    "title": "Aware of the S&P 400",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ox5py3/aware_of_the_sp_400/"
}