{
    "author": "squidja",
    "created_utc": 1623625658.0,
    "distinguished": null,
    "edited": 1623634119.0,
    "id": "nz8k6w",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nz8k6w",
    "num_comments": 96,
    "permalink": "/r/Superstonk/comments/nz8k6w/fibonacci_retracement_a_supplemental_elliot_wave/",
    "score": 718,
    "selftext": "# Intro\n\nHello my favorite people on the internet! The goal with this post is to help more apes understand Elliot Wave Theory by explaining Fibonacci Retracement and Extension to the best of my ability. If you have no idea what I'm talking about, check out the DD from u/possibly6.\n\n&#x200B;\n\nI was inspired to write this post by comments from u/Grayfox4, u/JadedEyes2020 and u/Roman_Mastiff. When I'm looking at Elliott Wave Guy post it makes sense to me but I realized there might be apes that have no idea what the fuck he's talking about.\n\nhttps://preview.redd.it/1m7ziotz73571.png?width=1506&format=png&auto=webp&s=9edb7d327d048dbc1537dd8d9bcb0e9f60f430a4\n\nhttps://preview.redd.it/g4ftivle83571.jpg?width=400&format=pjpg&auto=webp&s=ff5f47c5aa8c6bbdb7175ed558ddae74f549072a\n\n# Brief Background\n\nI have been studying technical analysis since January when I bought my first shares of GME. In fact, this was the first time I ever bought a single share of any company and I was instantly hooked! I love that Technical Analysis is finally getting the attention it deserves!\n\nI wanted to learn more about price action so I dove deep into technical analysis courses and my understanding of reading charts went from this: (fuck you Robinhood)\n\n[1 Year 1 Day chart on Robinhood \\(suck it!\\)](https://preview.redd.it/ftgbamiv23571.png?width=1408&format=png&auto=webp&s=8835820a2c016771241eab851a0f2d27e6e143b6)\n\nTo this:\n\n[1 Year 1 Day chart on thinkorswim \\(free with TD Ameritrade account\\)](https://preview.redd.it/v1cbmzo033571.png?width=4446&format=png&auto=webp&s=52dc161af06b467a770f5e0f5c50a575a1288f88)\n\nI wanted more context on the price action so I learned indicators like:\n\n* Candlestick Reversal Patterns\n* Moving Averages\n* ParabolicSAR\n* StochasticsFull\n* OnBalanceVolume\n* MACD (Moving Average Convergence Divergence)\n* ForceIndex\n* Fibonacci Retracements\n\n&#x200B;\n\n# Fibonacci Retracement\n\nhttps://preview.redd.it/3wackmkez3571.jpg?width=1142&format=pjpg&auto=webp&s=410b4c9853bd48680ac2b8808e3365e8b31b9a7e\n\nFibonacci Retracement sounds like complicated wizardry but it's actually really simple. It's a very powerful tool in TA and can be used very effectively, as shown by the amazing work of u/possibly6.\n\nNow, the stock market moves in waves and trends, the price doesn't just go up in a straight line forever (until MOASS). It goes up, it goes down, it follows a trend line of impulsive waves (price goes up) and corrective waves (price goes down).\n\nThis is a simplified version of an uptrend that's making higher highs and higher lows. Within this uptrend we have the impulsive waves and corrective waves.\n\n[Impulsive Uptrend Wave](https://preview.redd.it/ouq7n4av53571.jpg?width=1366&format=pjpg&auto=webp&s=6eccf2a6b632562905f004c15e81f283ccb4a6bd)\n\nAgain, the price doesn't go up forever, it has to correct down before going into the next impulsive wave.\n\n**So is there a way we can predict how far a wave will correct before it begins the next impulsive wave?** Yes, with Fibonacci! The price doesn't correct randomly, it comes down by certain ratios.\n\n&#x200B;\n\n# Fibonacci, also known as Leonardo Bonacci did some crazy shit with numbers\n\n[Leonardo Bonacci](https://preview.redd.it/jc59kqxkl3571.jpg?width=1260&format=pjpg&auto=webp&s=7a34d3f05001b538d291fdfa6f8c5afd94bffd25)\n\nHe started with 0 and added 1, which equals 1, then he added 1+1 and got 2 (really difficult stuff), then 1+2=3, 2+3=5... add the previous number to your answer and continue the pattern.\n\nFibonacci Numbers: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233...\n\n&#x200B;\n\nhttps://preview.redd.it/huyhzlk514571.jpg?width=681&format=pjpg&auto=webp&s=dd32efef33a955a9759401534980fd05e6a275bf\n\nSo what? Well, The key Fibonacci ratio is dividing a number in the sequence by it's previous number. For example if you divide 233 by 144 you get 1.618.\n\n# The inverse of 1.618 is the 61.8% Golden Ratio (Another important ratio is 1 - 0.618 = .3821 or 38.21%)\n\n&#x200B;\n\nhttps://preview.redd.it/vsqqcpehd3571.png?width=561&format=png&auto=webp&s=df8a8c2d632e3a18b163b174ae626cee81a259ef\n\n# This golden ratio of 61.8% can be found everywhere!\n\n&#x200B;\n\n[Shells.](https://i.redd.it/c5jpkh3vd3571.gif)\n\n[Flowers.](https://preview.redd.it/7b4li3dpe3571.jpg?width=1200&format=pjpg&auto=webp&s=654bddf12c7a318fdd1d48ed7c04750398cb8852)\n\n[DNA.](https://i.redd.it/yzg6d1fjf3571.gif)\n\n[Branches of a tree.](https://preview.redd.it/9y4tmszuf3571.png?width=1215&format=png&auto=webp&s=6c7d02663071c6f51478467b6fae62698e41c192)\n\nSeriously guys it's everywhere!\n\nhttps://preview.redd.it/hvrxbp9ke3571.jpg?width=1067&format=pjpg&auto=webp&s=1f9892ef21c79f5e4436a198c89bbe767457a27a\n\n&#x200B;\n\n[It's everywhere.](https://preview.redd.it/k34k3ijbf3571.jpg?width=400&format=pjpg&auto=webp&s=592389bb5292a91ec0b686873b8ed6d168b8bf2d)\n\n# So how does this work in the stock market?\n\nBack to our impulsive and corrective waves, it turns out that price action moves in waves in the golden ratio. Below is a simplified example of a trend starting, or A, the top or high of the trend, or B, and the correct wave C, or the low of the trend. (side note, this is also why we say higher lows)\n\n&#x200B;\n\n[50&#37; or 61.8&#37; Fibonacci Retracement](https://preview.redd.it/a3dhp6azh3571.jpg?width=1366&format=pjpg&auto=webp&s=715c612aa8a8bed265e6dfb0949bf86fd7d61d84)\n\nIt can also correct to the shallow 38.2% ratio. However, if I were to enter a long swing trade I would only enter at the 61.8% level because it has a greater chance of starting the next impulsive wave.\n\n[Shallow 38.2&#37; Fibonacci Retracement](https://preview.redd.it/2l5b97kmi3571.jpg?width=1366&format=pjpg&auto=webp&s=7da00f4a779ebbec44154f64aad23fd012d847d4)\n\nAs of this posting AMP is the first stock on [finviz.com](https://finviz.com) in the channel up trend section.\n\nAs you can see, it's on a clear uptrend but it doesn't move up all at once, it impulses up, and corrects down in Fibonacci ratios.\n\nhttps://preview.redd.it/12rxx42664571.jpg?width=1410&format=pjpg&auto=webp&s=81c92eebd3737f6031ab86b1c29f7f3ed0621e4e\n\nA = Low of the trend.\n\nB = High of the trend.\n\nC = Correction (38.2%, 50%, or 61.8% of the impulsive wave)\n\n&#x200B;\n\nNow lets apply it to GME:\n\nhttps://preview.redd.it/qu479nyoj3571.jpg?width=1366&format=pjpg&auto=webp&s=13bb18697464cedaaf18cde61e0cb6350e94c5d5\n\nOur most recent uptrend follows this ratio, appears to be bouncing off the 61.8% golden ratio, and we can predict the next price points using Elliott Waves (I won't try to explain this because u/possibly6 has it covered).\n\n# Conclussion\n\nIf you were struggling with Elliott Wave Theory, I hope this post helped you understand how these waves work and how we can apply the Golden Ratio of 61.8% to GME. If you have any questions I'll be around for awhile.\n\nGreat TL;DR by u/1991cale Basically there’s a pattern which is present in everything in the universe and that includes humans. Since it’s a behavioural thing it can also be witnessed in the price graphs. Since we are aware of that pattern we can calculate it using math. And now that we can calculate it ourselves and we know what it is we can use it as a tool to measure the price action.\n\nEdit: Correcting Elliot to Elliott. Dumb ape.",
    "title": "Fibonacci Retracement - A Supplemental Elliot Wave Theory DD and My Attempt to Help Apes Understand EW. It's Not Wizardry After All!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nz8k6w/fibonacci_retracement_a_supplemental_elliot_wave/"
}