{
    "author": "gherkinit",
    "created_utc": 1623606864.0,
    "distinguished": null,
    "edited": 1623637937.0,
    "id": "nz1x01",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nz1x01",
    "num_comments": 237,
    "permalink": "/r/Superstonk/comments/nz1x01/jerkin_it_with_gherkinit_forward_looking_ta_for/",
    "score": 3249,
    "selftext": "What's up GME Stonkhodlers?\n\nIt's me Gherkinit here to drop another load of technical analysis and some fundamental predictions on you.\n\nAs always later tonight I will post a consolidated [Video DD of this on my YouTube](https://www.youtube.com/c/PickleFinancial) for those of you that don't have the time to read through this, or have reading comprehension issues it will be posted by 10pm EDT.\n\nEdit 1: Up @ 10:30pm EDT\n\n\\**a note on this in the conclusion*\n\nThis last week was a pretty wild ride so let's look into what happened and why.\n\n# Preamble : ATM Offering and the Future of GME\n\nSomething we definitely need to cover this week, as It greatly affects all the TA being done on this stock whether it is the exponential floor, Elliot Waves, or my own indicator back strategies. Whichever TA you follow you must understand that a fundamental change of this nature with no warning is going to affect them all negatively.\n\nGME has more than likely sold **most or all** of it's ATM offering. While this action makes sense and ultimately benefits the companies long-term transition plans, I still want to address some of the concern I've heard over the last several days and dispel any FUD that may arise from this.\n\n1. There are multiple indicators that correlate an ATM share offering, I covered OBV and VWAP in my daily threads this week. These two DD's cover a lot of concerns and hopefully will help shed addition light on this sometimes confusing topic [DD1](https://www.reddit.com/r/Superstonk/comments/ny9l3t/hypothesis_the_gamestop_at_the_market_offering_is/) and [DD2](https://www.reddit.com/r/Superstonk/comments/nxkuvw/clarification_of_when_gamestop_will_issue_a_press/). I will be basing my TA this week on this sale being completed.\n2. **The shorts are going to cover!??**....No, the shorts didn't cover at 40 they didn't cover at 157 (the last offering of 3.5m shares) and they definitely are not going to cover at 255. Even if they got their hands on all 5M shares the primary thesis that backs GME already assumes a SI% greater than 140% (80M+ shares) of the free float, so 5M shares wouldn't even make a dent.\n3. **Why would they do this right away?** Well with RC now official at the helm, and the CEO CFO announcements I think we will start to see a lot more moves out of GME. GME has been sitting through a lot of stagnation over the last few months as we waited for many of these changes to take place. Now that control of the company has been ceded over to Cohen & Co. I think we are going to start see announcements of the bigger shifts in company direction start rolling in. These things cost money, they should now have the capital on hand to pay for them.\n4. **What Happens Now?** Well with the new leadership officially at the helm the first thing we are going to see is renewed interest from long funds as GME is now going to be seen as a strong long term investment with lots of growth potential. The lack of leadership during this transition period has definitely kept them and other more conservative investors at bay. The Russel Reconstitution occurs this month as well. As of May 7th (Rank Day) GME had a market cap of $11.97B, the Russel 1000 requires a market cap of $7.3 billion for transition. It would appear that GME will in fact be making the transition according to a statement by Catherine Yoshimoto (FTSE Russell’s director of product management). Both of these changes indicate greater interest from a much broader swath of investors. These factors should create lots volatility in the Short term as investors scramble to pick up shares of what we have know all along to be a damn good stock.\n\n[Russel Reconstitution Schedule for June, 202. Changes take effect after market close on the 25th ](https://preview.redd.it/9eo2rd5c72571.png?width=982&format=png&auto=webp&s=feaee5b9fc91eb9d184d86bacbd78a4fa7719369)\n\n# Technical Analysis\n\n**The Ascending Channel**\n\nThis [broadening formation](https://www.investopedia.com/terms/b/broadeningformation.asp) trend I think will continue into this week. We will either ascend back into our original channel or begin a continuation of the previous weeks trend in this new lower channel. This Monday and Tuesday's price action will determine where the new channel will form. This shift accounts for any deviation that occurred from the ATM offering. I do believe that the underlying thesis that backed the start of this formation still holds true. Interestingly, most of the volume traded during the downtrend on Thursday and Friday was traded within the bounds of the original channel so this deviation may not be as severe as it appears.\n\n[Diagram of original channel and possible new channel accounting for ATM offering. 4h timescale. ](https://preview.redd.it/ssr99lj3d2571.png?width=2022&format=png&auto=webp&s=33c930a95dae228ed44df7b849ece0912671ee57)\n\nThe bounce we saw on Friday from the low of $206.13 also seems to be confirmed by ADX [(more here)](https://www.investopedia.com/articles/trading/07/adx-trend-indicator.asp)\n\n[ADX indicator on the 4hr](https://preview.redd.it/5ot4q03cf2571.png?width=1493&format=png&auto=webp&s=bd42c59bca30e4678cb70dbccc04e280133a0eb9)\n\nLastly the exponential rate of growth at the beginning of each week still held true this week even though the possible share offering ate into that growth. This is my predicted price action for the week. Likely test of 320 with a possible test of 350 before the end of week consolidation begins.\n\n[Exponential Growth Pattern](https://preview.redd.it/b803svogh2571.png?width=1489&format=png&auto=webp&s=66e8c389352eac7286d1ba3845a79e1819f1b109)\n\nI still stand by my [short inflation theory](https://www.reddit.com/r/Superstonk/comments/n8qlbh/jerkin_it_with_gherkinit_forward_looking/) and continue to assume a lack of value in GME short sales. As such I expect the pattern from the previous 23 trading days to resume on Monday.\n\n**The Perfect Cup & Handle**\n\nWhile this is one of my least favorite [indicators](https://www.investopedia.com/terms/c/cupandhandle.asp), sometimes they are just to perfect to ignore. The presence of other indicators and it's basically perfect three month formation are signaling that this one has some merit.  As ADX and 50/200 Moving averages also confirm the potential breakout. When cup and handles work they are a beautiful thing, realizing potential price targets of 1.5-3x the upper resistance which in this case would be between $525 and $1,050.\n\n[Potential breakout to all time highs](https://preview.redd.it/csixp0hrk2571.png?width=2455&format=png&auto=webp&s=cff058dd9c6d976f1fe7f553f45be8b7cf35345f)\n\n# Conclusion\n\nIt looks like everything is back on track for another week of steady growth. But, please remember as we move closer to these high volatility events, such as the Russel 1000 listing, that we will see a breakdown in the accuracy of some technical indicators and improvement in others. As always these indicators present a way to understand constantly changing information and in no way predict the future just the probability of certain movements. I will as always update the daily live charting with any relevant signals on CV\\_VWAP if we have any notable arbitrage.\n\nIf you want to see more information on this subject matter feel free to join me in the :\n\nDaily Live charting (always under pinned posts on my profile [u/gherkinit](https://www.reddit.com/u/gherkinit/)) from 8:45am - 4pm EDT on trading days\n\nOn my [YouTube Live Stream](https://www.youtube.com/c/PickleFinancial) from 9am - 4pm EDT on trading days\\*\n\nOr over on my communities [Discord](https://discord.gg/BGmjnrvHnw)\n\nor for memes and other fun stuff on [r/dillionaires](https://www.reddit.com/r/dillionaires/)\n\nAs always thank you for the support\n\n🦍❤️\n\n\\- Gherkinit\n\nP.S. For those of you with positions in [$PERM](https://www.youtube.com/watch?v=zV_Mf7SbA34) I'm off to facilitate this...\n\n# Disclaimer\n\n*\\*My YouTube channel is \"monetized\" if that is something you are uncomfortable with, I understand, while I wouldn't say I profit greatly from the views, I do suggest you use ad-block when viewing it if you feel so compelled.* *My intention is simply benefit this community. For those that find value in and feel compelled to reward my work, I thank you. For those that do not I encourage you to enjoy the content. As always this information is intended to be free to everyone.*\n\n*\\* Although my profession is day trading, I in no way endorse day-trading of GME not only does it present significant risk, it can delay the squeeze.*\n\n\\**This is not Financial advice. The ideas and opinions expressed here are for educational and entertainment purposes only.*\n\n\\* *No position is worth your life and debt can always be repaid. Please if you need help reach out this community is here for you. Also the NSPL Phone: 800-273-8255 Hours: Available 24 hours. Languages: English, Spanish.* [*Learn more*](https://suicidepreventionlifeline.org/)",
    "title": "Jerkin' it with Gherkinit Forward Looking TA for 6/14/21-6/18/21",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nz1x01/jerkin_it_with_gherkinit_forward_looking_ta_for/"
}