{
    "author": "JustBeingPunny",
    "created_utc": 1623595390.0,
    "distinguished": null,
    "edited": false,
    "id": "nyxs1f",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nyxs1f",
    "num_comments": 366,
    "permalink": "/r/Superstonk/comments/nyxs1f/learn_from_the_past_when_they_didnt_care_to_hide/",
    "score": 4632,
    "selftext": "Have you heard of Max-D? No, nor had I. I searched for ‘naked short selling’ through EDGAR (SEC’s public database’ and amongst all of the filings, I stumbled upon their wonderful little company. \n\nWhat makes them so special? Why even bother with a post? Well, they were subjected to manipulative stock trading that was driving their share price into the ground, much like the attempt on GameStop. However, like overstock, this company fought back hard. The went public to expose the naked short selling with figures and number to prove just how bad it was.\n\n**Rather than a long TL;DR at the end, I’ll be posting recap summaries throughout. You should be able to follow the entire post reading these summaries… I hope. The whole thing is a good read, I promise!** \n\n*As always, if any information or interpretation is incorrect, help me correct it! I'm happy to edit accordingly!*\n\n# _______________________________________________________________________________\n\n# Background – \n\n**June 14, 2018 – 19.09pm ET**\n\n&#x200B;\n\n*Max Sound Corporation (OTC:MAXD) and its Shareholders are being continuously victimized by Manipulative Trading Practices and Abusive Naked Short Selling orchestrated by Knight/Virtu (NITE), Cantor Fitzgerald (CANT), Canaccord Genuity (CSTI),* ***Citadel*** *(CDEL) and eTrade/G1 (ETRF) for the past three years with the objective to systematically lower the MAXD share price by selling billions of counterfeit shares that generate enormous free money for the market makers who have no intention of ever covering a short position. In fact, they have paid bashers that spew lies and libel wherever legitimate shareholders congregate.* \n\n*Yesterday the Company reported that it had engaged a leading provider of Regulation SHO compliance monitoring, short sale trading statistics and market integrity surveillance related to substantial naked short selling of its stock.*\n\n*Max Sound has now registered complaints related to these activities with the Securities and Exchange Commission (SEC) and Financial Industry Regulatory Authority (FINRA).* ***The Company encourages MAXD investors and shareholders who believe they have been harmed, to file complaints as well. Remember, the value is being stolen from your investment, only because well-organized criminals are able to operate with absolute power, unmonitored inside the industry that handles, manages, trades and ultimately steals the total value of your asset.***\n\n&#x200B;\n\n**This is a direct statement. The gigantic titanium swingers these mofos have. I guess I’m not surprised Citadel are in there. Though things continue to get REALLY interesting…**\n\n&#x200B;\n\n&#x200B;\n\n**June 14, 2018 – Earlier the same morning – 08.49 ET**\n\n*Max Sound Corporation has engaged a leading provider of Regulation SHO compliance monitoring, short sale trading statistics and market integrity surveillance related to substantial short selling of its stock. Regulation SHO requires bona-fide market-making activities to include making purchases and sales in roughly comparable amounts.*\n\nSo you’re being naked shorted right into the ground. You feel helpless and have nowhere to go. What do you do? You bring in the experts and that is exactly what they did. \n\n*The Securities and Exchange Commission has stated that bona-fide market-making DOES NOT include activity that is related to speculative selling strategies for investment purposes of the broker-dealer and is disproportionate to the usual market making patterns or practices of the broker-dealer in that security. Likewise, where a market maker posts continually at or near the best offer, but does not also post at or near the best bid, the market maker's activities do not qualify as bona-fide market making. Moreover, a market maker that continually executes short sales away from its posted quotes is not considered to be engaged in bona-fide market making*\n\nApe talk – The SEC has stated market-making can’t be genuine if they’re ‘shorting away from its’ posted quotes’, missing bids from the buy side every now and then, whilst the sell side ALWAYS has something there, or diverts away from its’ regular market making patterns. (Sound familiar?) *This is my interpretation. My knowledge on market making is little, so if anyone can add a better easy explanation, I’ll be happy to add.* \n\n&#x200B;\n\n&#x200B;\n\n**So let’s take a break here and recap.** \n\nMAXD are a company that were fully aware that they were being shorted (also naked) into the ground. They hired some experts in the field to take a look into the trading and market making activities for compliance. What they found was….\n\n&#x200B;\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Did they comply? \n\n&#x200B;\n\n*MAXD market makers have been monitored daily for compliance with Reg SHO and Fair Market-Making Requirements.* *Here is a trading analysis of MAXD.* \n\n*BuyVol = real buyers at offer.* \n\n*SellVol = real sellers at bid.* \n\n*ShortVolume = short sale trade identifiers for both EXEMPT (market makers)*  \n\n*NON-EXEMPT (everyone else) shorts sales.* \n\n***The short selling as a percentage of daily trading volume in MAXD by your firm is abnormally high; the market-making math related thereto does not reconcile and is not at all compliant with Federal Securities Laws*****.**\n\n*As is common during these orchestrated short selling campaigns, bad actors with no real interest in MAXD’s success, or any small public company for that matter,* ***has consistently engaged in false accusations and libel on the Company’s stock chat boards in attempts to scare and demoralize MAXD’s legitimate shareholders****. It is noteworthy that as soon as Max Sound sent this report to the market makers perpetrating the naked short sales on the company, the bad actors disappeared at least for the time being..* \n\n&#x200B;\n\n**Acknowledging the shills, reporting the shills and then telling the shorts that they know. I’m beginning to love these people more and more.** \n\n**Recap – The experts took a peek behind the curtain and did the math on the market making activity. They concluded that there was absolutely no way that they could be complying with federal securities law. They also found shills in their message boards and compiled a report highlighting all of this. This forced the shorts to back off for a small while.** \n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n# The data \n\n&#x200B;\n\nThis is the thick of it. MAX-D just didn’t publicly state all of this was happening. They posted clear numbers detailing how and **WHO.** ***I’ll continue to quote their statement and break it down further. Buckle up.***\n\n&#x200B;\n\n*We have analyzed the last year of daily short volume data and correlated it to recent market making activity in MAXD.* ***In 27 of the past 31 trading days, 87% of the time, the combined selling and short selling in MAXD has far exceeded the amount of buying (See NetNet column below).*** ***Market makers, by definition, are required to PROVIDE LIQUIDITY not extract or remove liquidity****. The math provided below demonstrates that instead of matching orders, market makers, Knight/Virtu, Cantor Fitzgerald, Canaccord Genuity, Citadel, eTrade/G1 are heavily shorting MAXD stock BOTH on the offer and on the bid, which by definition means they have a “speculative short selling strategy” running on MAXD. They are carrying net short positions overnight and continuing to claim the market maker’s exemption, which is in VIOLATION of the Fair Market Making Requirements of Regulation SHO.* ***We are able to mathematically prove this because there is not enough BuyVol (buy volume) to match the amount of selling and short selling. The chart below identifies the top 5 market makers, in MAXD for May 2018 (highlighted below) accounting for 2,257,870,595 shares of trading, or 88.22% of total trading volume in May.***\n\n&#x200B;\n\n&#x200B;\n\n**Ape talk/Recap – There was lots and lots of short selling from many market makers. They continually claimed their exemption to naked short sell, which is a violation of regulation SHO. Better yet, they could mathematically prove it…** \n\n&#x200B;\n\n&#x200B;\n\n*Total Volume* *Name* \n\n*(Last Month)*\n\n*643,662,180* *Knight/Virtu,* \n\n*154,447,100* *Cantor Fitzgerald,* \n\n*203,762,081* *Canaccord Genuity,* \n\n***769,731,954*** ***Citadel, - These fuckers yet again***\n\n*247,276,817* *Trade/G1*\n\n*Highlighting these Market Makers abusive activities in-concert with each other for just the one month of May, allows regulators, the SEC, FINRA, the U.S. Attorney as well as the media to easily identify the manipulative trading activity and counterfeiting of MAXD shares engaged in by their traders for the past year and well beyond. When overlaid for the entire year (back to June 1, 2017) the math is shocking. 8,117,878,650 total shares have been shorted representing in excess of 40% of MAXD’s total trading volume and it demonstrates that these market makers have knowingly participated in manipulative trading practices and counterfeiting of MAXD shares.*\n\nWe provide the following data in this report:\n\nDAILY TOTAL SHARES SHORTED (volume and price), which includes all shares shorted even by exempt institutions such as market makers.\n\nFAILURES TO DELIVER (naked shorts).\n\nMARKET MAKER SHARE VOLUME (exposing exactly how many shares are being traded and the name of the market making firm traded through).\n\nMARKET MAKER DATA (showing whether or not a fair market is being made in each trading day).\n\nCUMULATIVE TOTAL SHARES SHORTED data showing large short positions and the volume weighted average price that a short squeeze will start.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xlb7iptlo1571.png?width=568&format=png&auto=webp&s=4f83254f4d02b5f4996ab05191a6937bc1cc1b73\n\n&#x200B;\n\nhttps://preview.redd.it/kdft08vmo1571.png?width=555&format=png&auto=webp&s=ec83f53d39b609f687ef86a37103320504121f3e\n\n&#x200B;\n\n**Recap – They proved mathematically that the game was rigged and that Kenny boy (Citadel) was the biggest culprit. The first image shows the potential squeeze value. The second image shows just how bad the market making activity was. Just look at that buy volume vs sell volume.** \n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# The final comment \n\n&#x200B;\n\n*MAXD is making this report available to the investment world to create a substantial short squeeze opportunity with the goal to return to its shareholders the massive amount of equity stolen by unscrupulous market makers.*\n\n&#x200B;\n\n&#x200B;\n\n**They openly advocated for people to invest to start a short squeeze. There was no hidden riddle. It was there in black and white**. \n\n&#x200B;\n\n**TL;DR – MAX-D are a company that were being shorted into the ground. Market makers were using their liquidity exemptions to naked short, further driving the price. MAX-D brought in the experts and found the market making activity was fraudulent and in breach of Federal securities law, as it was mathematically impossible they were doing everything ‘by the book’.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Bonus round – Citadel and the inadvertent ‘mini bomb’ \n\nLet’s look at the chart. Citadel were the biggest shorts for the company? Looks like Kenny had to cover some of them other shorts positions.\n\n&#x200B;\n\nhttps://preview.redd.it/b2sv9zxto1571.png?width=672&format=png&auto=webp&s=7e5bf6e1aecffc9b61ab9dcad35a16d87246a691",
    "title": "Learn from the past, when they didn't care to hide.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyxs1f/learn_from_the_past_when_they_didnt_care_to_hide/"
}