{
    "author": "Magistricide",
    "created_utc": 1619717548.0,
    "distinguished": null,
    "edited": 1619757034.0,
    "id": "n19kgr",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n19kgr",
    "num_comments": 573,
    "permalink": "/r/Superstonk/comments/n19kgr/zerocoupon_bonds/",
    "score": 4469,
    "selftext": "Recently, the US treasury just announced 40 billion of sales in Zero-Coupon Bonds. What are they?\n\nhttps://preview.redd.it/gafo22axd5w61.jpg?width=590&format=pjpg&auto=webp&s=2f6be1d55132e6c2dabaa130b03b56e75f60a1c4\n\n# How do they work?\n\nZero-Coupon bonds pay no interest but trade at a deep discount and pay a profit when the bond matures. The difference between the purchase price and the value of the bond is the investor's return. For example, if a zero-interest bond has a face value of 1000 in 5 years, they may sell for 800 right now. In five years, you would be paid 1000. However, you would not get any interest for this bond.\n\nIf a market has high-interest rates, these bonds are worth little because they do not give you any interest. If the market has low interest rates, the bonds are worth a lot because you get returns much higher than the market interest rate. The bonds are also valuable if the market is expected to crash, as you would still get guaranteed returns on the bonds.\n\nSo why would you buy a Zero-coupon bond? There are several reasons\n\n1. When interest rates go down\n2. **When STOCK PRICES FALL**\n\nBut wait, the skeptic in you says, what if it's just the first one? Well, the federal government usually will drive interest rates down if they think the economy is suffering in order to promote lending and spending. The economy tends to suffer during financial crises, so in reality, both of these reasons are met **IF THERE IS A FINANCIAL CRISIS SOON.** They're perfect for investors to HEDGE AGAINST THE STOCK MARKET. I took a deeper look into this and found some interesting information.\n\n&#x200B;\n\n[Look at the first one on the list, the 4-week bond](https://preview.redd.it/9zdq6nm4e5w61.jpg?width=770&format=pjpg&auto=webp&s=3cc63b8aed57f43f8b7891446fb79a6debdc742d)\n\nAnother thing that makes this alarming is that they expire in 28 days. That's right. This isn't the typical 2 or 5-year bonds you're used to. These are 4 week bonds with 0 interest. It might be nothing, but it's just kind of odd how **they're selling an asset that you only want to buy if people think the stock market will crash in the next four weeks.**\n\n# How rare is this event?\n\n \n\n\"I grabbed the raw auction data from their query tool: [https://www.treasurydirect.gov/instit/annceresult/annceresult\\_query.htm](https://www.treasurydirect.gov/instit/annceresult/annceresult_query.htm)\n\nIt would only let me go back as far back as 7/31/2001 for 4-weeks, but there are 1032 total auctions. [Of those, 89 of them since 2001 have been offered at 0%](https://ibb.co/W6C6rnQ)\n\n[Here's a look at this data charted over time.](https://ibb.co/CM3fz7C) Blue is the rate the 4-week was offered at, the red flag pole is a 0% event on its own axis so it's visible.\n\nQuick take-aways:\n\nHave these been issued before? Yes.\n\nAre they common? No. 89/1032 = 8.6% of total auctions since 2001, but that doesn't even tell the story.\n\n3 in 2021 - Market = fukt\n\n1 in 2020 - Pandemic\n\n**23 in 2015** \\- Market got gaped that year. Worst year since 2008.\n\n**23 in 2011** \\- Black Monday S&P BABEEEEEEEEEY\n\n**17 in 2008+2009** \\- C'mon, you living under a rock? \"\n\nCredit to 9551HD for his research. Very helpful. This means basically THESE ONLY OCCUR WHEN THE MARKET IS IN TROUBLE.\n\n# What does this mean for the government?\n\nThey are willing to pay people extra money four weeks into the future for more money right now. They also believe that many buyers are interested in HEDGING AGAINST LOW-INTEREST RATES OR A MARKET CRASH and so selling zero-coupon bonds are the best way to increase liquidy for the NEXT FOUR WEEKS.\n\n# COUNTER-COUNTER DD\n\nSome people have pointed out in the comments that 4 weeks and 8 weeks are common. That is true. THAT DOES NOT DISCREDIT THIS POST because those are not 0 interest. Unless someone finds proof that 4 week 0 interest are common, I'm leaving this post up.\n\n&#x200B;\n\nNot a financial advisor but what I am is a person with jacked tits.\n\n**IMPORTANT NOTE**\n\nI DON'T THINK YOU SHOULD BUY THESE THINGS. THEY'LL GIVE YOU PEANUTS COMPARED TO GME. NO INVESTMENT IN THE WORLD IS AS GOOD AS GME.\n\nEdit: I legit forgot to write a part of this article because I was so retarded. Fixed it tho.\n\nEdit 2: Misspelt Retarded as regarded because my spelling checker doesn't like that word.\n\nEdit 3: Two people somehow thought we should buy these things so I just wanted to put the note up there.\n\nEdit 4: Explaining how these bonds work.\n\nEdit 5: Added date of last time similar bonds were released. Aka 2015.\n\nEdit 6: Fixed some possibly misleading wording.\n\nEdit 7: BIG INFO ADDED\n\nLinks:\n\n[https://twitter.com/Bitcoin/status/1387815038568722433/photo/1](https://twitter.com/Bitcoin/status/1387815038568722433/photo/1)\n\n[https://www.treasurydirect.gov/instit/annceresult/annceresult.htm](https://www.treasurydirect.gov/instit/annceresult/annceresult.htm)\n\n[https://www.investopedia.com/articles/investing/062513/all-about-zero-coupon-bonds.asp](https://www.investopedia.com/articles/investing/062513/all-about-zero-coupon-bonds.asp)",
    "title": "Zero-Coupon Bonds",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/n19kgr/zerocoupon_bonds/"
}