{
    "author": "TheGreatHodl",
    "created_utc": 1613657852.0,
    "distinguished": null,
    "edited": 1613688937.0,
    "id": "lmnr4b",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_lmnr4b",
    "num_comments": 832,
    "permalink": "/r/GME/comments/lmnr4b/this_is_absolutely_criminal_you_cant_just_pull/",
    "score": 11368,
    "selftext": "We should not have to hold the bags. The corrupt criminals literally think okay yea we loss but the system was about to crash so we needed a way out. Im diamond handing on principle alone now.\n\n\nEdit: To those saying this is over.\n\nThis is clearly not over. The crooks took the bid out of the market after we started hitting new AH crumbling the share price by manipulating supply/Demand and even letting some of these hedgies escape at artificially low manipulated prices. They parted the sea so these crooks could bail out even though they had plenty of opportunities to cover when the price hit $20, $30, $40. No way around them admitting they can control the price of any security.  They have caused millions in losses through price manipulation and trying to control the narrative. Someone has to be on the hook for this and not the people. We were 100%  right on this play.\n\nEdit: Based on the hearing. Thank you Michael San Nicolas for speaking the truth.\n\nThey all benefited from manipulating and driving the price of GME down. Hedge funds, MM's, Clearing Houses and even Robinhood themselves. The lawsuits will be plentiful. Stay strong boys.\n\nEdit: To all the comments belittling folks and calling us bag holders.\n\nYou have to be kidding me. Even to you smooth brains out there. I dont understand how this is so hard to understand. They were able to choose who the bag holders would be. Hedge funds were going bankrupt and Brokers, Clearing houses etc refused to carry the bags which is the rule to the current system. The criminals changed the rules so retail would be left with the bags. Let that sink in. Biggest financial heist of our time right in our faces and they think it was neccesary.\n\n💎💎💎💎✊✊✊",
    "title": "THIS IS ABSOLUTELY CRIMINAL. YOU CANT JUST PULL THE PLUG AND CAUSE THE WINNERS TO TAKE NEARLY 100% LOSSES AND THINK OH WELL. THEY LITERALLY STOPPED THE GREATEST TRANSFER OF WEALTH BECAUSE GREEDY HEDGIES OVERLEVERAGED AND LOST. EVERYONE SHOULD BUY GME TO STAND UP AGAINST THIS CRIMINAL ACT.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/GME/comments/lmnr4b/this_is_absolutely_criminal_you_cant_just_pull/"
}