{
    "author": "thomas798354",
    "created_utc": 1622586454.0,
    "distinguished": null,
    "edited": 1622587593.0,
    "id": "nq6fiv",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nq6fiv",
    "num_comments": 128,
    "permalink": "/r/Superstonk/comments/nq6fiv/what_happened_last_week_and_how_its_affecting/",
    "score": 779,
    "selftext": "There was without a question a forced buying phase last week for FTDs and the hedge funds used this to their advantage by willingly covering some shares then shorting the price violently with all of their ammo on Friday to hit stop loss orders.\n\nTo understand what happened there is first a math prerequisite to this post: Algebra.\n\nAssume you are in a short position:\n\n&#x200B;\n\n[MMR example](https://preview.redd.it/tczf6bfmbq271.png?width=483&format=png&auto=webp&s=763d5fbb48514f29b9b57f26fc5cf00715d30511)\n\nThis helps us understand our enemy.\n\nThey continue to short for the same reason we average up.  Eventually the price must come down and they will make money.  Notice that as the price goes up the total maintenance margin requirement drastically increases past the equity in the account.  In order to prevent your friends that are smaller from margin calls someone must suppress the price.  They take turns doing this as the price gets higher so members that shorted at 20$ can stay alive (Melvin).\n\nMay 28th that someone who had to suppress the price was Bill Gross.  He had options for the 250$ call strike and the 300$ call strike.  Both of which just so conveniently for us fell OTM at the last second.  Why this is a good thing….I’m getting to that so Bill Gross had to use those “shares” that only become shares if the contracts end ITM to short GME in order to prevent a margin call of a buddy.  Then something crazy happened.  The price was suppressed below 250$ and his contracts expired OTM.  When this happened it created\n\n11,709+ 10,720=2.2M FTDs instead of leaving the bad guys net positive 100k shares…….\n\nPrime Brokers have 6 days to deliver shares before they FTD or T+3 ( and they are the people who provide customers with shares to short).  The bad guys are on the clock and are running out of time.  What else happened last week?\n\n[Call Stats](https://preview.redd.it/wa7wqpmsbq271.png?width=917&format=png&auto=webp&s=d904bccddd87b4a8b427f0da6f4b0f502f547b91)\n\nA lot of good guy calls from 180$ to 245$ slid ITM.  And a lot of good guys including myself (haha) exercised for equity instead of selling for cash.  This means that the MM had to deliver those shares set aside by Thursday or if they weren’t hedged say because a huge order was OTM last second, they have to buy at the market price to deliver on those shares.  Also last week we had a price spike that could have most likely led to a margin call….It is also very possible we see a clearing house buy go down as early as Thursday this week. Why do you think our buddy DFV is back to spur retail to buy and not miss out?  They are leaking FTDs like crazy and have to make a huge market buy before the shareholder meeting this week and personally hand out margin calls to their friends.  Which will make share holder meeting week very exciting, because it would mean more clearing houses buying it up.  Maybe this cycle will help explain where they are in the process:\n\n&#x200B;\n\n[Bill Gross Last week in Detail with Ape Pics](https://preview.redd.it/s265xs5egq271.png?width=385&format=png&auto=webp&s=e59ba771c39b54f46ba590c2d8c4f73fff4d2511)\n\nI saw the info on who these options belonged to on twitter by “Zero Hedge” a financial twitter account I follow.\n\nThere is also a lot that went down with a favorite movie theater stock by the media. I’d just like to remind everyone that DFV and Michael Burry never said anything about AMC stock.   Don’t you think if it was better \"value\" than GME the dude named “u/DeepFuckingValue” would have sold GME to play that?  I’ll leave it at that for fear of being called out for not talkin about GME.  Just saying we all wouldn’t be here if it wasn’t for these two OG apes, don’t double cross them because the media showed you a shiny turd the stock market works in percentages not prices.  I’d hate to see some apes left on deck while the rocket goes off soon...\n\n&#x200B;\n\n\\*Disclaimer\\* I am not a financial advisor and while I have been very right in the past do not trade off of my sole advise, there's this dude on twitter putting out John wick Gifs he's a great advisor! JK. Be careful counting hedge funds out as this price gets higher and shorts start to cover the price and clearing houses are in this other hedge funds who have been sitting on the sidelines will try to profit off of the drop (if a crypto dividend doesn't cuck em in time).  Be careful assuming this entire thing is over whenever the buy pressure settles. \\*",
    "title": "What Happened Last Week and How it's Affecting this Week-My Opinion",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nq6fiv/what_happened_last_week_and_how_its_affecting/"
}