{
    "author": "CuprimPilus",
    "created_utc": 1617923907.0,
    "distinguished": null,
    "edited": 1617953515.0,
    "id": "mn475i",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_mn475i",
    "num_comments": 210,
    "permalink": "/r/GME/comments/mn475i/just_got_off_with_fidelity_almost_every_call_she/",
    "score": 2674,
    "selftext": "She’s actually only a year older than I am and might actually see this post since I mentioned my handle (if you’re seeing this yes, welcome to 2011’s 2012)If anyone still has like .001 shares of GME on RobinHood Gold for the UX and watching the ticker, I’ve been seeing the ask side stay stable at 115k and a bit down to 95k, but it dropped hard on buy side, from 60k this to below 45k.Before she fully changed my account to cash only, her manager tried giving me the option of having full voting rights and ownership of my stock without losing my margin trading account status.\n\n&#x200B;\n\n**Don’t Take The Bait** They will still lend out your shares if you do this, even if you request for full ownership to place this stock in cash holdings and having voting rights.\n\nThat means Fidelity and others are making bank right now on lending out shares and it absolutely exploded today. Everyone’s been swamped with calls for the exact same thing.\n\nShare this, comment this, put it out there: make sure you have a cash only trading account, get verbal authorization you have full ownership, voting rights and will not allow your shares to be lent (you only get the profits anyways if you’re worth more than $250k so why??)The more we take out of the available float, the more they just push the spring down tighter in the dark pools until a catalyst releases the tensions.\n\nI honestly believe this entire past month has been causing even more synthetic shorts to be created. The fact that GME is now being leveraged against the USD if you’ve read the Everything Short DD on SuperStonks is the most horrifying thing I I’ve seen.\n\nWorse than spending my entire annual bonus at 277 the Friday before it dropped and still holding on (would’ve only made an extra 3-4 shares if I waited, no point letting go with how I’m leveraged dar in the green as is)Like I think when this squeeze launches, y’all better be buying gold in person, stable coins, 20 year treasury bonds, real estate, forex, IDEK if you can buy OPEC stock, I haven’t seen it available on Robinhood or Fidelity, but I’m legit scared of hyperinflation of the USD.\n\nHonestly if anyone knows how to buy OPEC stock as an American, let me know, I may be wearing a tinfoil hat, but we could possible lose the status of being the petrodollar. It’s not like Russia or the ME loves us that much\n\n.Anyways! **CASH ACCOUNT CONVERSIONS FROM MARGIN FULLY** The less they can use, the better odds we’ll have a catalyst spring the 200>250>300 gamma ramp and from there... well, we’ll see how far we go to space before Uncle Sam does a Mr. Fantastic reach to pull us back to earth\n\n&#x200B;\n\n&#x200B;\n\n**Edit** Transferred three times to Fidelity. First took me 7 business day. Next took me 3 and the 3rd only took two. Do it now, It's moving like lightning which in of itself is strange as hell\n\nAlso, you idiots, I'm dumber than you are, stop asking me for advice. I smoke ketamine, I'm the last person you'd ever want financial advice from. Which I do not give and am not one.",
    "title": "Just got off with Fidelity. Almost every call she got has been about GME & changing from margin to cash accounts",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mn475i/just_got_off_with_fidelity_almost_every_call_she/"
}