{
    "author": "apegoneinsane",
    "created_utc": 1628029101.0,
    "distinguished": null,
    "edited": 1628054503.0,
    "id": "oxeefh",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oxeefh",
    "num_comments": 76,
    "permalink": "/r/Superstonk/comments/oxeefh/im_tired_of_the_robinhood_posts_but_we_need_to/",
    "score": 1394,
    "selftext": "**33K upvotes:** [**https://www.reddit.com/r/Superstonk/comments/owg05j/vlad1\\_douche\\_canoe/**](https://www.reddit.com/r/Superstonk/comments/owg05j/vlad1_douche_canoe/)\n\nNo one applying any critical thought and fact checking this shill?\n\n[Let me fact check this shite.](https://preview.redd.it/5e2tfjm3w7f71.png?width=2732&format=png&auto=webp&s=e3706241ac0fd42b325acf4922eee2171edbd043)\n\n&#x200B;\n\nhttps://preview.redd.it/23konqc7w7f71.jpg?width=2732&format=pjpg&auto=webp&s=216d1a5414a10ec3a4cbc62b91336306949b2035\n\nVlad the Impaler sold 1,250,000 shares at $36.40, which amounts to $45.5m. This represents a grand total of **2.5% disposed.**\n\n**Sources:**\n\n1. SEC Filing (see footnotes): [https://secfilings.nasdaq.com/filingFrameset.asp?FilingID=15125984&RcvdDate=07/28/2021&CoName=ROBINHOOD%20MARKETS,%20INC.&FormType=4&View=html](https://secfilings.nasdaq.com/filingFrameset.asp?FilingID=15125984&RcvdDate=07/28/2021&CoName=ROBINHOOD%20MARKETS,%20INC.&FormType=4&View=html)\n2. Nasdaq website (see Page 2): [https://www.nasdaq.com/market-activity/stocks/hood/insider-activity](https://www.nasdaq.com/market-activity/stocks/hood/insider-activity)\n\n*But he recently acquired 52m shares and disposed off 100m shares on Page 1 at non-open market? Well, I don’t know what the fuck Vladimir is doing here. I’m here to shit on* ***Unusual\\_whales.*** *For what it is worth, I would still consider this insider selling/buying. It’s just on a “different exchange” - directly with brokers.*\n\n*It looks like Mr Vladimir is trying to hide (m\\*\\*k is censored by auto mod?) the sale of his entire holding.*\n\nOther Material Sales:\n\n* Chief Marketing Officer - **100%** disposal (99,884 shares at $35.28, over $3.5 million USD)\n* Chief Financial Officer - **25%** disposal (125,000 at $36.40, over $4.5 million US)\n\n**Unusual\\_whales is a Shill**\n\n[RestartingMyLife0918 with 85 upvotes:](https://www.reddit.com/r/Superstonk/comments/owg05j/vlad1_douche_canoe/h7fy3e1?utm_source=share&utm_medium=web2x&context=3)\n\n>Reminder that the entire unusual whales team was banned by reddit admins last year for shilling their service and they remade accounts to shill their product here again. Not saying OP is working for them, at least not knowingly, but they are doing nothing other than jumping on hype trains to help get their name spammed everywhere. Seems to be working. I see more unusual whales posts per week than any other twitter account.\n\nThis isn’t my first encounter with this user. To provide further context since unusual\\_whales seems to have a following here on Superstonk. They are actively selling a service. They bait you in with their Tweets, representing “free data” and then you’re hit with subscription offers for the full package. For as much as this subreddit likes to throw around the label “shill”, here you go.\n\n**Conclusion:**\n\n**I don’t give a flying fuck about what the boy from Bulgaria is doing, he’s pumping and dumping without a doubt. But I am finding myself having to play the role of ‘devil’s advocate’ a lot here - I think this community really needs to put aside confirmation bias and fact check and critically analyse anything we are presented with. It leaves us wide open to FUD.**\n\n**LinkedIn Users**\n\nWe also hold up random LinkedIn users quite a lot here, just because they have a CFA designation and work in some unrelated role?\n\nI have a CFA designation (almost didn’t given how brutal Level 3 was). It doesn’t make me an authority on anything. LinkedIn users just regurgitate DD and no, they do not provide ‘exposure to the DD’ via a professional platform. I’ve seen their connections and likes, it‘s fucking nothing outside of being recycled on here.\n\nWhy do I say this? Because where we start to hold up LinkedIn users as authority (and I know that there are a lot of Ape that do), we begin to let in FUD:\n\n&#x200B;\n\nhttps://preview.redd.it/9ltki88cw7f71.jpg?width=1089&format=pjpg&auto=webp&s=ceccc2f6c93d2aefcf4714964557d6a8cea46cf2\n\nYes Peter, tell me more about the government intervention you speak of, ie the limitation of any squeeze and the designation of a ‘clearing price’. There are a few substantive arguments against this, and he tries to balance it with reference to what the DTCC and NSCC is proposing to do via \\*market mechanisms (\\*managing the squeeze themselves).\n\nBut this is a) his interpretation of the proposals b) baseless speculation (of government intervention) that will be promoted as authority by Apes. These warrant separate DDs, but all I ever see is screenshots of this guy on Twitter and this subreddit.\n\nI actually had 2 friends read this and reach out to me separately, asking if regulatory intervention or “managed squeezes” are likely then wouldn‘t it be better to sell the shares before any clearing price. I didn’t know they followed Peter Hann CFA because I only gave them a link to this subreddit. They only came across on highly upvoted posts here.\n\n***EDIT:*** *As for my own disclosures, I have a direct financial interest in providing positive information relating to GameStop to enhance the possibility of a short squeeze.*\n\n*I also work for BlackRock. However, this does not relate to GameStop and I work for a UK entity with no involvement in this specific stock.*",
    "title": "I’m tired of the Robinhood posts, but we need to address the misinformation propagated by the shill “unusual_whales”. As a community, we need to fact check and apply critical thought to everything that is posted. Otherwise, we are open to FUD and confirmation bias. This also goes for LinkedIn Users.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/oxeefh/im_tired_of_the_robinhood_posts_but_we_need_to/"
}