{
    "author": "Godibraku",
    "created_utc": 1617350444.0,
    "distinguished": null,
    "edited": 1617634254.0,
    "id": "mifp9e",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mifp9e",
    "num_comments": 582,
    "permalink": "/r/GME/comments/mifp9e/stop_saying_there_is_only_60_trillion_available/",
    "score": 5913,
    "selftext": "**Edit3:** Stop it you apes. STOP IT. I dont want your Awards, use that money to buy GME and HODL. If i get another Award i´ll go to Walmart and buy EVERY banana until there are no more left for you. YOU´VE BEEN WARNED *goddamn apes dont push me*\n\n**Edit4:** Well this ehm.... got out of control. I guess i cant be mad at the **MADLAD-HEADGEFUND-IMPALER HIMSELF?** [https://i.imgur.com/d6OLEwO.jpg](https://i.imgur.com/d6OLEwO.jpg) **(I SEE YOU TOO MF. KEEP HODLING)**\n\n  \n**Edit**05.April:  **I know this is about the ATM offering by Gamestop but ... it kinda fits ... doesnt it** [**https://twitter.com/TheRoaringKitty/status/1379071447633698819**](https://twitter.com/TheRoaringKitty/status/1379071447633698819)\n\nEdit5: I cant answer all questions, everytime i go to my inbox its just full of \"*All-Seeing Upvote Award icon*\" notifications\n\n&#x200B;\n\n[Daddy](https://preview.redd.it/g3n6fmhz8rq61.jpg?width=650&format=pjpg&auto=webp&s=b57709ac63879361255bcf6e0746bba9c4618fb6)\n\n# Start reading here:\n\nI am getting annoyed with all these \"*We can get 1-2 mil a share cause the dtcc has 60trillion bla bla bla*\" **This is not about the DTCC alone.**\n\nAll these Banks and Brokerages have insurances that cover **alot**. This is not about the US i am talking globaly. Even if the DTCC goes down there are still insurances that can cover in a crisis, Take Credit Suisse for example in Switzerland.\n\nNow apply that for **every Bank and Brokerage** that is involved in GME.\n\nThere is **WAY more money for us to grab than 60Trillion**.We can demand 5mil -> they can cover.Same with 10, 20 ,50, 100mil .HELL EVEN 1 BILLION A SHARE. (*ceiling not floor*)\n\nThis is not just the US and DTCC. **THIS IS GLOBAL**, global Players, global Banks, global Brokerages.\n\nStop pinning a pricepoint on GME. We have to be realistic. Not everyone will hold. **THATS FINE**. Hell stop thinking these PaperHandBiotches will ruin anything the only thing they´ll ruin is their Ego when they sell at 10k 50k who knows. my 1 share will be worth more than 100 of theirs.\n\nWE CAN STILL GET MILLIONS.\n\nStop thinking this is about the US **you damn Monkeys.**\n\nEdit. I am sorry for screaming. I had to get this out. Thinking this is only about Citadel and the DTCC is so naive and annoys me. Stop thinking this is about your small world. Think About Asia and Europe. There is so goddamn much money and so many Banks involved. With all these new Rules coming in it is POSSIBLE to short a Company even After GME to over 100% but it will be SO MUCH MORE EXPENSIV. it wont happen again.\n\n# Use your goddamn chance in life or shut the f*ck up about being poor and the world being unfair. NOW OR NEVER\n\n**Edit2: Please keep downvoting. All you Paperhands will leave more money in the tank for them to pay my DiamondShares. Drop like flies**",
    "title": "Stop saying there is only 60 Trillion available. We can grab more.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/mifp9e/stop_saying_there_is_only_60_trillion_available/"
}