{
    "author": "dlauer",
    "created_utc": 1622210877.0,
    "distinguished": null,
    "edited": 1622232573.0,
    "id": "nmymbk",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nmymbk",
    "num_comments": 1974,
    "permalink": "/r/Superstonk/comments/nmymbk/short_interest_numbers_and_naked_shorting/",
    "score": 15675,
    "selftext": "Hi all,\n\nI'd like to point out an irony that I found funny today. Earlier I [tweeted](https://twitter.com/dlauer/status/1398271311617662980) about AMC's intense move up:\n\n&#x200B;\n\nhttps://preview.redd.it/bit0u2l5av171.png?width=597&format=png&auto=webp&s=ed6f8d3e9eb282aff59dc04caebe341e8fb8c50f\n\nAnd I received all sorts of negative replies, as you'd expect:\n\n&#x200B;\n\nhttps://preview.redd.it/qgb74m09av171.png?width=589&format=png&auto=webp&s=dc14970afa73f6f88a788f282d6e8c3c3541fb05\n\nhttps://preview.redd.it/1ajqk4fbav171.png?width=593&format=png&auto=webp&s=41443db07e5f8eefc436a2becac4efa442c7cf5c\n\nhttps://preview.redd.it/jmypqpidav171.png?width=587&format=png&auto=webp&s=3292eb520cdec0eb7ba4a7f924767fad557799e5\n\nI hope I don't offend anyone by posting their twitter handle, and if I do, let me know and I'll pull it down. I'm not trying to call anyone out here, and I appreciate all of the interactions on Twitter and Reddit!\n\n**Markets are made by people who disagree.**\n\nI want to hammer home that point - if you think something is worth X and I think it's worth Y, then we have a market. It's beautiful.\n\nBUT I'd also like to point something out. I'm seeing a lot of references to \"short interest\" levels or CNBC, or interpretations of trading dynamics and activity. These references are being made to convince me that there is no short squeeze happening in AMC right now, and that all we're seeing is more retail buying / FOMO.\n\nIn the same breath though, on this sub-reddit and others, you'll be told that you can't trust any of the short interest numbers, that CNBC is a bunch of shills, and that the data simply does not exist to understand the true level of shorting which may be so high that it imperils the global economy!\n\nSo, just to be frank, you can't have it both ways. If the data isn't there, it's not there for you to know what's going on in the stock at the moment. When I make a comment that there's a squeeze taking place, I'm making that comment based on my observations of the price activity. I could certainly be wrong. But when I see the kind of price movement in AMC that we've seen over the past couple of days, I can't see any other possible conclusion.\n\nThis post in no way is meant to feed into AMC FOMO or distract from GME. I just think it's directly relevant to GME, and to what is taking place. **Short squeezes can be violent and fast**, or they can be slower and methodical. You're talking about the absolute most sophisticated trading firms in the world with advanced technology and analytics. If you don't think they can start to exit a short position slowly, over time, without impact the market, then I've got some bad news for you. **That doesn't preclude the possibility of a much larger, sudden squeeze - that can come too once they've exhausted their ability to exit the position without dramatic market impact.**\n\nPlease be careful with market narratives. When it comes down to it, we generally like to impose stories on price action that confirm our biases. I'm probably doing it myself when I look at what's happening with AMC. But I try to combine it with data and with a lot of experience observing price action, and hopefully come out the other end with an educated guess.\n\nEdit: Changed the flair to opinion.\n\nEdit 2: I've suddenly been accused of being a shill and spreading FUD. That's not my intention at all. I added some emphasis in the second-to-last paragraph, because everyone seems to be taking one sentence (about exiting a short position slowly) out of context with the sentence **immediately** after it that says once they've exhausted this ability the squeeze can be large and sudden. It should be obvious by now that I think such a squeeze is coming. I only posted this movietheater tweet because reactions to it seemed relevant to GME. I'll make sure not to post any further movietheater-mentioning posts. Also, someone said that I was a shill and paid to do the AMA, and I'd like to know why I didn't know about that, and who I can collect my check from?",
    "title": "Short Interest Numbers and Naked Shorting",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nmymbk/short_interest_numbers_and_naked_shorting/"
}