{
    "author": "jarofmy",
    "created_utc": 1622920440.0,
    "distinguished": null,
    "edited": 1623097109.0,
    "id": "nt31x2",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nt31x2",
    "num_comments": 135,
    "permalink": "/r/Superstonk/comments/nt31x2/came_for_the_memes_stayed_for_the_fundamentals_a/",
    "score": 3302,
    "selftext": "# **Intro/Observation:\n\nGod damn, god damn! Some of us have really come a long ass way since January. Might’ve even gained a few wrinkles along the way. Like many, I joined the party on the hype regarding “meme-stocks”. I joined for the “squeeze”, or more importantly, the MOASS. After months of constant hedge-fuckery, straight overdosing on hardcore DD, and everyone talking about squeeze this and squeeze that, I had completely forgotten that normally, people would simply invest in companies for FUNDAMENTAL reasons.\n\n&#x200B;\n\n[Snorting god-tier DD, I said god damn!](https://i.redd.it/1qn8uqovkn371.gif)\n\nThis thought occurred to me when talking to someone this past week about other rising stocks. They said: “if you inflate the value of (insert rising meme-stock) to drive out the short sellers but in the end you own a company that was struggling. What gives?”\n\nAs fun as the squeeze will be, I wanted sound reasons to definitively YOLO. I wanted concrete evidence to harden my resolve. I wanted to be assured that, even without a squeeze, the company would still be a great investment. And so my goal is to completely ignore any potential squeeze theories, and explain why the current valuation of GME, on a fundamental basis, is STILL deeply undervalued. None of this is financial advice. I just like the freaking stock.\n\n# TL;DR:\n\nFundamentally, there are so many reasons why Gamestop is still deeply undervalued. By simply expanding their total accessible market, this stock is worth 100x AT A MINIMUM WITHOUT THE SQUEEZE. This is only possible due to the unique situation GME has, which is having a small amount of public float of shares “available to trade”.\n\nI am not a financial advisor, and none of this is financial advise. I am just documenting what I've observed after shoving some crayons too far up my nose.\n\n# **Thesis:\n\nTo some, the valuation of GME may seem absurd in isolation. However, when compared to its potential accessible market, it becomes clear that Gamestop is deeply undervalued.\n\nFor example: “GME at $250 per share is a really high price!” vs “GME at $250 per share means that it’s market cap is valued at only $17 billion, in a potentially $2 TRILLION accessible industry”\n\n&#x200B;\n\nhttps://preview.redd.it/585vflo8on371.jpg?width=500&format=pjpg&auto=webp&s=83eebc5024e774f8150da93efa094fe983e423de\n\nGamestop’s previous brick-and-mortar focused model limited the company’s accessible market. The new transformation under Ryan Cohen's helm will lead to the company's explosion into capitalizing on various untapped, and growing markets. And if you want to see what someone can do, you should look at what they’ve already done...\n\n&#x200B;\n\n[Brief History Lesson, Chewy was the Blueprint](https://preview.redd.it/7y3b6z8zkn371.jpg?width=512&format=pjpg&auto=webp&s=b4f4413c93d039dcc0125da7aabbd4e935da511f)\n\nRyan Cohen founded Chewy in 2011, in the face of industry competition such as Petsmart, Petco, and Amazon. He began by poaching talents from Amazon, Petsmart, and Wayfair (any of this sound familiar?). In their first year, despite losing money in the first half year, Chewy had a $26 million dollar revenue. It is widely known that Ryan Cohen follows a business model that priorities customer experience.\n\n&#x200B;\n\n[\\\\\"If you take a carload of this, you'll make more money. But if you take a carload of that, you'll make less money, but you'll keep the customer. So take a carload of that.\\\\\" - Ryan's father](https://preview.redd.it/vr62shj1ln371.png?width=1574&format=png&auto=webp&s=7ab3ee8bdb1a4ca98104265e15d923c665ebdd8a)\n\nWith a heavy focus on customer service and user experience, by 2017, Chewy was offered a merger deal by both Petco and Petsmart, and was finally acquired by Petsmart for $3.35 billion dollars, which at the time was the [largest merger acquisition](https://www.vox.com/2017/12/6/16681040/ryan-cohen-chewy-recode-100) of an e-commerce business. How’s it doing now? Thriving. Not only did Chewy survive against established industry players, Chewy now has a respectable portion of the pet industry market.\n\n\\*\\*CHEWY:\n\nCurrent market cap: $32b @ $77/share\n\n[Pet Industry TAM](https://www.americanpetproducts.org/press_industrytrends.asp): $103b in 2020\n\nMarket percentage: 30% of market\n\n&#x200B;\n\n[Gamestop's back alright!](https://i.redd.it/chwh6fj5ln371.gif)\n\n# Where are we now?\n\n# **GAMESTOP:\n\nCurrent market cap: $20b @ $280/share (at the time of writing this)\n\nVideo Game TAM: $159b\n\nMarket percentage: 12.5% of market\n\n&#x200B;\n\n# **Previous Business Model (Pre-Cohen):\n\nVideo Game Retailer: limited to games, relying on seasonal console releases to help boost general sales.\n\nAs a result, while Amazon has been the most popular stop for digital/online video game purchases, Gamestop still remains the leader in hard copy video games and consoles.\n\nThis business model “over-prioritizes its brick-and-mortar footprint, and stumbles around the online ecosystem.” - a direct quote directly from Ryan Cohen.\n\nPLEASE TAKE SOME TIME TO READ RYAN COHEN'S LETTER TO THE GME Board on 11/16/2020. This man has been planning everything we’ve talked about all along.\n\n[https://sec.report/Document/0001013594-20-000821/rc13da3-111620.pdf](https://sec.report/Document/0001013594-20-000821/rc13da3-111620.pdf)\n\n&#x200B;\n\n# **New Business Model (Since Ryan Cohen):\n\n**\\*Retail Expansion:**\n\nWe are already seeing an influx of computer hardware, GPUs, TV's, Cameras, Audio, Clothing, and general expansion of consumer electronic products added to Gamestop’s accessible inventory.\n\n**Why is this important?**\n\nGME is not only transitioning to remain a leader in the video game retail industry, but they are also expanding their market into the [computer hardware industry ($863 billion market)](https://www.thebusinessresearchcompany.com/report/computer-hardware-global-market-report-2020-30-covid-19-impact-and-recovery) along with [general consumer electronics](https://www.statista.com/study/55488/consumer-electronics-market-report/) (\\~$1 trillion dollar market). We’re not even talking about e-commerce yet either. This is simply general product/market expansion.\n\nJust think about this: The bear thesis of GME being undervalued implies that expanding to a $1.8 trillion market (while being debt-free by the way) will somehow decrease revenue.\n\n&#x200B;\n\n[So you're telling me expanding to a $1.9 trillion accessible market will decrease GME's value?](https://preview.redd.it/qg2cia78ln371.jpg?width=500&format=pjpg&auto=webp&s=14dee08399be0f8faf2b6e4646d88e802f7d4084)\n\n[**\\*New Microsoft Deal:**](https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/)\n\n“This partnership aims to advance Gamestop’s key strategic pillars and extend its digital omni-channel ecosystem” - Microsoft\n\nIn other words, Microsoft is jacked to the tits about Gamestop’s move into digital sales. How jacked are they? This deal gives percentage royalty on all digital goods bought on xbox consoles that are sold at gamestop. This deal also notes that Microsoft is essentially decking out Gamestop retail locations with tech/hardware necessary to improve the workflow/life of the people actually working at Gamestop and therefore indirectly improving customer service.\n\nSo on top of already leading video game retail revenue, and adding the expansion of accessible market revenue, GME will also pull revenue percentages from all digital sales on xbox consoles.\n\n&#x200B;\n\n[Yo we heard you liked revenue, so we added revenue on your revenue on top of your revenue!](https://preview.redd.it/ublyks2aln371.jpg?width=622&format=pjpg&auto=webp&s=adab0189f62f3cb8fe3fd5842dd04f537c067c5e)\n\n[**\\*Service and Delivery:**](https://www.gamestop.com/collection/same-day-delivery)\n\nGamestop has already proven that it can out-price-match and out-deliver current “giant” Amazon. On top of brand new [major distribution warehouses](https://www.foxbusiness.com/retail/gamestop-opening-new-distribution-center-to-support-e-commerce-push), Gamestop has started utilizing their (already 4,816) locations as smaller distribution centers.\n\nBy expanding their retail locations to act as mini-distribution centers, Gamestop has potential to deliver products within [2 hours or less](https://www.reddit.com/r/GME/comments/mgo5df/gamestop_2_hour_delivery/).\n\n&#x200B;\n\n[But wait, there's more!](https://i.redd.it/vevbawfbln371.gif)\n\n[**\\*eSports/Gaming:**](https://gspc.gg/)\n\nGamestop has signed a [multi-year deal](https://esportsobserver.com/gamestop-jan2021-market-upset/) with multiple esports companies, such as Complexity Gaming, sharing a new 11,000 sqft Gamestop Performance Center with the Dallas Cowboys. This expansion into the eSports industry opens Gamestop’s exposure to an additional [$1 billion market](https://www.statista.com/statistics/490522/global-esports-market-revenue/#:~:text=In%202021%2C%20the%20global%20eSports,billion%20U.S.%20dollars%20in%202024).\n\n&#x200B;\n\n&#x200B;\n\n# Conclusion:\n\nGamestop is primed to be transformed by Ryan Cohen, the same way he transformed Chewy. (PLEASE REFER TO HIS LETTER TO THE BOARD)\n\nWhile Chewy occupies about 30% of the pet industry, if we assume Gamestop can access 30% of it's new total accessible market (modest estimate of $1.8 trillion), that puts GME at $8,400 per share. If we assume only 10% of its new market, that still puts GME at $2,500 per share. **THIS IS ALL STILL ASSUMING NO SQUEEZE!**\n\n&#x200B;\n\n[Don't just take it from me....](https://preview.redd.it/zw4su4yejw371.jpg?width=640&format=pjpg&auto=webp&s=94c1288754523bf25762787a8297d4c8184a2f9f)\n\n(I hadn't even brought up their NFT-platform yet because the automod keeps deleting my post, but just know that this would further open GME's accessible market.)\n\nI cannot emphasize this enough, GME is currently debt free with over half a billion dollars in additional cash on hand to jumpstart Ryan Cohen's transformation. As of writing this, Ryan Cohen still is not \"officially\" chairman of the board yet (this will happen on 6/9). The proxy votes have not been released. There has been no official announcements from Ryan at all. The stock is still up $25 from last week's close. I'm so freaking jacked.",
    "title": "Came for the Memes, Stayed for the Fundamentals: A Look into GME Without The Squeeze",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nt31x2/came_for_the_memes_stayed_for_the_fundamentals_a/"
}