{
    "author": "LetTheBandPlay777",
    "created_utc": 1628437568.0,
    "distinguished": null,
    "edited": 1628441852.0,
    "id": "p0h0fw",
    "text_only": true,
    "flair_text": "📰 News | Media 📱",
    "name": "t3_p0h0fw",
    "num_comments": 90,
    "permalink": "/r/GME/comments/p0h0fw/bank_of_america_branch_closing_down_in_new_mexico/",
    "score": 720,
    "selftext": "Hi everybody, \n\nIt's been awhile since I've posted anything as I feel posts should only be made if it's a dank meme or amazing footwork, or of course everyone's favorite fix, some of that sweet sweet DD.\n\nThis is more of the middle here reporting from the ground in Rio Rancho New Mexico. We have two Bank of America branches in this city and always have. I'm reporting to my fellow apes that one of those two branches is out of business. This branch survived COVID and the Great Recession and recently got the for sale sign staked in front of the property and those sweet black bags to cover the name of the building. It's now just a hollow shell of itself with ATMs which I'm sure will be removed once the property is sold (unless a competitor buys the property) \n\nI'm reporting this because recently a fine ape did a brilliant deep dive into Bank of America's financial situation and they seem to be preparing to declare bankruptcy. The timing was very peculiar to me as you can imagine. If the economy is so strong and is roaring back like our overlords tell us then why is a branch that's been where it's been as long as I've lived here suddenly go out of business? Like mentioned above this branch has survived the Great Recession and COVID lockdowns. New Mexico had some of the strictest COVID lockdowns in the United States only matched by the New York. And in the middle of the \"greatest recovery\" they go out of business? Very strange.\n\nHave any other apes out there in other cities or states noticed Bank of America branches shuttering down suddenly? Feel free to check in and drop your knowledge in the comments\n\nNone of this is financial advice and is extreme speculation into the inner workings of a mega banks dealings and should not even be remotely taken seriously in any context regarding your financial decisions. \n\nHave a great Sunday everybody, tomorrow we ride ! Buckle up! 🚀 🚀 🚀\n\nEdit 1 : due to popular demand and of course the rules of the forum here is the link to the photographic proof https://imgur.com/a/S9EwNb0\n\nEdit 2 : Commenting further on the ATMS, they were there literally 3 days ago but looks like they took them out too. I work next door to this bank. Hence how I noticed them shutting down.",
    "title": "Bank of America Branch closing down in New Mexico",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/p0h0fw/bank_of_america_branch_closing_down_in_new_mexico/"
}