{
    "author": "catsinbranches",
    "created_utc": 1623768002.0,
    "distinguished": null,
    "edited": 1623802773.0,
    "id": "o0fx3q",
    "text_only": true,
    "flair_id": "3d403642-b1c0-11eb-9505-0e759e60d835",
    "flair_text": "🚨 Debunked 🚨",
    "name": "t3_o0fx3q",
    "num_comments": 413,
    "permalink": "/r/Superstonk/comments/o0fx3q/how_many_gamestop_shares_are_there_get_hyped/",
    "score": 6862,
    "selftext": "&#x200B;\n\n# --- EDIT: DEBUNKED. Bloomberg geographic data seems to be garbage. Sorry folks. End of Edit ----\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/vhceawxjsf571.png?width=800&format=png&auto=webp&s=cf609e25ab084b678e7eb42b74433ec1e9b0d727\n\n&#x200B;\n\nAbout a week ago, I came across a [comment](https://www.reddit.com/r/Superstonk/comments/nw9uq4/the_number_of_votes_equals_the_entire_float_on/h180tw4?utm_source=share&utm_medium=web2x&context=3) by u/evertwindelen referencing[ an official report](https://www.afm.nl/~/profmedia/files/onderwerpen/afm-market-watch/afm-market-watch-3-nl.pdf?la=nl-NL) that was published by the Netherlands Authority for the Financial Markets (AFM) discussing the GameStop phenomenon and how it impacted Dutch investors ([Link to an English version of the report](https://www.afm.nl/~/profmedia/files/onderwerpen/afm-market-watch/afm-market-watch-3-eng.pdf?la=en), but it downloads a PDF). These guys are basically the Netherlands' version of the SEC. The whole report is super interesting, but I'm only going to cover the highlights that are relevant to this particular discussion.\n\n&#x200B;\n\n* The report covers GameStop trading activity by private Dutch investors (aka retail) during the period of January 18 2021 - March 18 2021.\n* During this timeframe, 29,394 investors traded GME, none of whom had invested in GME before (*though if someone wants to confirm this translation, it’s just under figure 1 -* Edit: Translation confirmed)\n* The average total purchased value within this group of investors was $11,532.\n* The average purchase price within this group of investors was $189 per share.\n\n&#x200B;\n\nSo let's start with that. $11,532 / $189 = 61.015873 shares on average, multiplied by 29,394 investors = 1,793,501 shares purchased in the Netherlands between January 18 and March 18. A note here: this is a cumulative number, so if someone bought 10 shares, sold them all, bought 10 more, sold them all, then bought 10 more again, it would be represented here as 30 shares, not as 10 shares.\n\n&#x200B;\n\nGreat, that's cool, but... so what? Well, if we know what portion of shares were held in the Netherlands at that time, then we can establish how many shares there were worldwide. Let's take a look at what the Bloomberg terminal has to say about share distribution across different geographic locations around this timeframe (huge thank you to u/ravada for providing these screenshots!) - the Bloomberg terminal doesn't allow specifically selecting a mid-week date, so we'll see what the data shows for the beginning of the week of March 18th (a Thursday) as well as after that week ended.\n\n&#x200B;\n\n[Link](https://prnt.sc/15fk0qd) for first screenshot, if you want it\n\n[Screenshot from a Bloomberg terminal where we can see geographic ownership on March 14 2021, the beginning of the week in question](https://preview.redd.it/o3vuufo7rf571.png?width=1374&format=png&auto=webp&s=72c544b6332ca97983bcc994f8bd511bcc4ac558)\n\n[Link](https://prnt.sc/15fk1l2) for second screenshot, if you want it\n\n[Screenshot from a Bloomberg terminal where we can see geographic ownership on March 21 2021, the end of the week in question - note that there is no difference for the Netherlands when comparing these two data points.](https://preview.redd.it/zlm28delrf571.png?width=1374&format=png&auto=webp&s=1b39bacf0ed55d943b6f50789b4873bd167ba0af)\n\n&#x200B;\n\nSo we can see from the Bloomberg terminal that the shares held in the Netherlands made up only 0.19% of the worldwide GME share ownership at that time.\n\nBut wait! Maybe some of the Dutch apes who are discussed in the report sold their shares! Yes, that's a good point. You may have seen the many posts with screenshots from Fidelity, showing that on any given day, [Fidelity](https://www.reddit.com/r/DDintoGME/comments/nx8d77/stonk_goes_down_82_27_and_fidelity_apes_like_all/) users generally have approximately a 75%-80% buy ratio, with only about 20%-25% of orders being sell orders. Similarly, there have been screenshots of [eToro](https://www.reddit.com/r/Superstonk/comments/n6y85s/100_of_etoro_traders_are_buying/) and [Webull](https://www.reddit.com/r/Superstonk/comments/nzhv7b/bullish_af/) showing 100% buy ratios on the day of those screenshots. Obviously, these are just point-in-time references and don’t necessarily reflect the average buying trends of those brokers, but it gives us an idea of where to start. Interestingly, the report also mentions that for some Dutch broker, GME was the most traded stock in February and March - this matches up with a lot of those screenshots we saw about GameStop being the most popular stock in most European countries around that time. But... wait... the aborted squeeze (when many brokers shut off the ability to buy GME) happened in January... so GME was the most traded stock AFTER the aborted squeeze had already happened, so the people buying up GME at that point were probably a whole lot of HODLer apes.\n\n&#x200B;\n\nSo we'll take a look at 5 scenarios:\n\n* a very conservative option where only 30% of those shares were held, while the rest were sold (or possibly bought & sold repeatedly, like in my example at the beginning)\n* a conservative option where 50% of shares held\n* a cautious but realistic option (based on the Fidelity / Webull / eToro screenshots) where 70% of shares were held\n* a cautiously optimistic option where 80% of shares were held\n* a very optimistic option where 90% of shares were held\n\n&#x200B;\n\n[Even if we're being really conservative, there are way too fucking many shares](https://preview.redd.it/1o1e1fycsf571.png?width=530&format=png&auto=webp&s=bc4e6e9ee0472992b1a15e58bb8b49510ae0d1a5)\n\nNow, I’m sure someone with more wrinkles than me can take this info and come up with a model to show how share ownership may have increased (I assume) over time as more and more naked shorts were dumped into the market and apes gobbled them up. Remember that the estimates I laid out above were for share count up to March 18th, which was after u/deepfuckingvalue initially doubled down from 50K to 100K shares (Feb 19), but before his final call options expired and he posted that update showing us that he had doubled down again to 200K shares (Apr 16). How many other people have potentially doubled their positions in the last 3 months? Also missing from this data are the shares that Dutch retail investors may have already been holding prior to January 18th, and any shares that may have been held by Dutch financial institutions.\n\n&#x200B;\n\n**The TLDR is the infographic at the top.**\n\n&#x200B;\n\nEdit: There is some contention around the accuracy of the location data in Bloomberg, and whether or not it can be used in this context. My understanding was that the location info is based on brokers (and that the unknown segment is largely driven by brokers who service multiple countries) but there is some discussion in the comments about this breakdown possibly being specific to institutional holdings. Can't seem to find a solid source one way or the other, if you have one please add it to the comments! In the meantime, take this calculation with a grain of salt in case the geographic breakdown is not applicable to this dataset.",
    "title": "How many GameStop shares are there? Get hyped cause it's A LOT! Plus, I made you an infographic 🚀🚀🚀",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0fx3q/how_many_gamestop_shares_are_there_get_hyped/"
}