{
    "author": "fsocietyfwallstreet",
    "created_utc": 1617543294.0,
    "distinguished": null,
    "edited": 1617553153.0,
    "id": "mjwcpm",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mjwcpm",
    "num_comments": 577,
    "permalink": "/r/GME/comments/mjwcpm/does_the_dtcc_005_rule_turn_gme_an_infinite_money/",
    "score": 3621,
    "selftext": "#Tldr; the setup is the same as january, but call option open interest + the new 005 rule makes the rocket more like a shuttle, that will launch over and over again without intervention.\n\nShorting results in more shares in circulation.  It doesnt matter whether the amount of shares shorted is lower than, or exceeds the amount of real shares in existance during a squeeze, because they ALL need to get bought and returned to the lender in order to ‘cover’ aka close out the short position.   The new 005 rule pretty much guarantees that happens with gme, and probably does it much sooner than later too.  No more resetting ftd’s &amp;amp; disguising short interest in options ✅ No more rehypothecation (naked shorts) ✅ = shorts are fucked 💯\n\n#BUT -WHEN that happens, I think an even bigger problem occurs.\n\nWhen the shorts begin to squeeze and buy to cover - the price soars.  When the price reaches $901 every single call option that exists - whether it expires next week or next year - is all ‘in the money’.  This was the case in january as well - but back then they could play games with ftd’s and at least have the tools to kick that can down the road and smooth it over, given time, as call writers will essentially be ‘short’ gme just the same as the 🌈🐻 like melvin &amp;amp;amp; friends.  The 005 rule makes this situation even more problematic for the system, because it completely removes those tools for shorts, and call writers who will then also be ‘short’ on shares.  \n\n(Skip on to the next paragraph if you have a basic understanding of call options)\n\nA call option is a tradeable security, like a share - but it is a contract which gives the owner the opportunity (but not the obligation) to purchase 100 shares at a set price called the strike, anytime before it expires (european market options work a little different, but lets stick to usa options as that’s what applies here).  When the price of the stock exceeds the strike price, the option is ‘in the money’ (ITM), because if the owner exercises their right to purchase the shares according to the contract, they could now sell them for a profit (minus the cost to buy the option itself).  When exercised- the seller of the call option (this could be an individual investor, or a market maker) - is obligated to take the money - 100x the strike price, and deliver 100 shares.  \n\n*If someone with an options scanner could please let me know the exact sum of open interest for all calls at all strikes at all expiration dates, that would be a huge help*\n\nI recall during Thomas Peterffy’s interview (Interactive Brokers), the number of shares that would have needed to be delivered if all call options that existed for gme exercised at the end of january, an excess of 200 million shares would have needed to be delivered, but only 50m exist.  \n\nhttps://m.youtube.com/watch?v=_TPYuIRVfew\n\nI don’t know what that number is right now, but even a quick scan through the options chain for call open interest - it’s going to be a very big number.  Now, even though some of these are covered calls (the entity who sold aka wrote the call option actually owns and has the shares, which could be an individual investor or market maker) - I don’t think it’s remotely possible all calls are covered because they probably once again exceed what exists (again pretty please someone with options scanning tools please tell me what that call side looks like)\n\nWhile there’s unfortunately no way to tell how many calls were written covered or naked - it doesn’t really matter (for my point here, at least) because shorts squeezing for cover, and whoever wrote these calls - are going to be squeezing to buy an amount of shares that simply do not exist at the same damn time.  This creates an infinite money glitch, a black hole in the system which, without intervention - would repeat itself due to the new 805 rule.  As market makers are forced to create shares out of thin air in order to deliver on these exercised calls, they will of course - fail to deliver, resetting the ftd clock to set up for yet another squeeze 13 days after they fail to deliver.  \n\nThe only thing that the regulators could do to avoid this but also not ruin the free market, is to have brokers limit the ability to exercise calls *during the squeeze*. Instead, they should only allow them to be ‘sold to close’.  Meaning, whatever the call option is worth - you would be able to sell it and walk away with essentially the stock price, minus the strike price, times 100 - which is essentially the value of any call option that is deep in the money anyway.  This seems like a win-win.  The shorts squeeze, everything we’ve got goes brrrr all the way to andromeda, but we dont actually break the entire galaxy in doing so.  Call writers would simply pay a one time fee for these calls, and it’s over.  Whether it ends up forcing their liquidation or not - isn’t my problem or concern.  I think anyone writing calls naked after what happened in january is clearly suicidal, so let them hang themselves, i certainly don’t care, but I don’t think it’s right for them to take everyone else with them either.\n\nJust like vlad turning off the buy button, i’m not aware of this ever being done before so who knows, anything can happen because this is a historic event with forces at play which are orders of magnitude bigger than anything that’s ever been seen before.  However as it stands right now - this thing is going to squeeze like fuckin crazy with shorts and call writers chasing for the same shares at the same time - and for a quantity of them that simply does not exist.  All the $10m, $25m ‘is not a meme’ posts are absolutely true if it goes down as it is set up currently, without intervention, which makes me think there has to be some level of intervention to avoid the call squeeze.  \n\n(This is not to say those ‘not a meme’ amounts arent possible either way, because I personally believe they are very much possible - but as things sit currently, there’s no reason it can’t go to 100 trillion per share, or some other equally absurd number that stands to break the global economy).\n\nThe responsible thing to do for both the powers that be, and ultimately who is going to foot the bill for all this, is to force the squeeze to not only begin as soon as possible, but also to limit the damage by nerfing call options.  Some may not share my sentiment and thats ok: I am totally fine with burning down these shorts and the establishment, but not the entire world - but if things stand the way they are, you’ll get your fire and brimstone.  There are a lot of totally innocent bystanders who are about to get clobbered when this goes down - and it wont just be hedgefund managers going long on $ROPE, jumping out of buildings etc., and that doesn’t settle very well for me personally.  \n\nWith all there is to be jacked to the tits about this new 005 rule, I haven’t seen anyone here talk about what effect it could have on a call squeeze.  Coupled with what I read and 💯💯💯 believe which is the ‘everything short’ - honestly, this is terrifying.\n\nEdit#1: a brilliant ape suggested another possible outcome: let market makers up the bid price of the options to the point it makes no sense to exercise; make it more profitable to sell to close than to exercise, then most people wouldn’t exercise.  I like this theory better than my nerf proposition as it doesn’t require any rules to be broken, would be just as effective, and puts no downward pressure on the trajectory of the moonshot.\n\nEdit #2 as per yahoo finance:\n\nDates listed:\n\n•\t⁠2021-04-09\n•\t⁠2021-04-16\n•\t⁠2021-04-23\n•\t⁠2021-04-30\n•\t⁠2021-05-07\n•\t⁠2021-05-21\n•\t⁠2021-07-16\n•\t⁠2021-10-15\n•\t⁠2021-11-19\n•\t⁠2022-01-21\n•\t⁠2023-01-20\n\n259,064 calls\n\n....so if in theory the squeeze happened right now - 25m shares would need to be delivered if they were to all exercise.  (I copied and pasted from a kind ape in the comments - please feel free to vet this). Only 69m shares exist, 20m of which cant be traded, and who the hell knows how many have been shorted (most dd’s seem to concur it is AT MINIMUM 140%, aka 65-70m shares).  If these numbers are true, it is not necessarily the black hole i feared (IV probably made sure of that, making options too pricey this time around) - but its still realllllllly bad for these call writers and shorts.  On a scale of 1-10, with 10 being the worst case scenario 🌈🐻 are basicslly infinity fukd.",
    "title": "Does the DTCC 005 rule turn GME an infinite money glitch, ON REPEAT?",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mjwcpm/does_the_dtcc_005_rule_turn_gme_an_infinite_money/"
}