{
    "author": "toderdj1337",
    "created_utc": 1627124664.0,
    "distinguished": null,
    "edited": 1627175253.0,
    "id": "oqnwru",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oqnwru",
    "num_comments": 1156,
    "permalink": "/r/Superstonk/comments/oqnwru/guys_its_happening_again/",
    "score": 10558,
    "selftext": "We literally were just talking about how whenever we talk about point 72, steve Cohen, susquehanna, the forum gets slid, hard. Look at it today, LinkedIn posts, bs interview with Charles Paine (u/dlauer called this lady out as completely full of it), some decent DD is getting through, but still, the problem remains. LOOK MORE INTO STEVE COHEN AND COMPANY.\n\nEdit: I'm not saying linked in is trash, but it is social media (I'm aware of the irony), just wondering if anyone remembers \"ants\" or \"crypto gang\"? Where are they now? Not saying it's FUD, just saying be cautious, and the sheer amount is SUS. Also, I forgot to mention posts either about movie stock, or anchoring GME to movie stock. Sorry if any of you are invested but the mainstream media attention on it makes me sus.\n\nEdit 2: this comment from u/Jmeshareholder\n\n>I think griffin and point72 Cohen are publicly élit fighting each other in the open and no one is noticing\n>\n>I strongly believe that point72 Cohen wants to throw Kenny under since he’s the one and only face we constantly blame for our beloved stock. \n>\n>I suspect the elite agreed on throwing citadel and Melvin under the buss in the upcoming boner.\nHowever, Kenny doesn’t go down without a fight. lately we’ve been seeing a lot of memes of point72 Cohen circulating around in superstonk and numerous dd trying to wake the interest of the public in point72 involvement (since they were lowkey hiding in the storm)\n>\n>Furthermore we notice an uptick of Twitter trending #darkpoolsabuse which is another citadel push against point72.\n>\n>And all of sudden we have someone talking to Charles pain the day after how (citadel is abusing the dark pool) and not getting enough fines. \n>\n>\n>I strongly believe that HF are canabalizing against each other publicly (rich man style) at the moment\n>\n>There’s nothing to proof here, just a hunch but a bloody string one. We might see citadel die in the upcoming weeks and claim the squeeze is over.\n>\n>But it won’t be.\n\n\nEdit 3: holy fuck I'm trying to work. Can't keep up. Keep the discussion going! Let's see some good threads.\n\nEdit 4: [For those of you who wanted to see Dave's point of view on the interview](https://www.reddit.com/r/Superstonk/comments/oqsgjz/i_didnt_want_to_accidentally_nuke_my_other_post/?utm_medium=android_app&utm_source=share)\n\nEdit 5: thanks to those of you with counterpoints, specifically about LinkedIn. I have no problem with them specifically, all I'm saying is there was just a tonne all at once, and that makes me suspicious. If someone has time to do due diligence on the ones spreading the word (not advocating harassment or anything of the sort here) so that we know we can trust these people as well intentioned, I would love to see that. \n\nTrust but verify, is a mantra I personally love.\n\nEdit 6: scrolling through comments and found some gems, [this one](https://m.imgur.com/0gRgxD9) that talks about the bohemian club, busier than usual I see.\n\nEdit 7: Stratfor enterprises LLC, worth looking into. Intellipro bullshit.  Came up in discussion on the jungle sub, u/DefNotAPumpkin I can't link it otherwise I would. If op gets back to me and has a post here I'll link it.\n\nEdit 8: George Friedman, former chairman and founder of Stratfor, is now the Founder and Chairman of Geopolitical Futures, source: u/DefNotAPumpkin , seriously check out his post, it's the only one, I can't do it justice.",
    "title": "Guys, it's happening again",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqnwru/guys_its_happening_again/"
}