{
    "author": "SundaySchoolBilly",
    "created_utc": 1627139349.0,
    "distinguished": null,
    "edited": 1627139588.0,
    "id": "oqruqa",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oqruqa",
    "num_comments": 238,
    "permalink": "/r/Superstonk/comments/oqruqa/paynemsm_does_an_interview_about_debunked/",
    "score": 5829,
    "selftext": "Listen, I get it. Payne is a charming guy and has been funny throughout this whole thing. Calling Portnoy a little bitch made me giggle, even though it was most likely scripted. \n\nBut I see this kind of lopsided voting and awarding on something that the man u/dlauer has debunked at least twice now, and methinks the man behind the curtain wants apes to look a certain way.\n\nI'm not saying that RCs most recent tweet is some magical code (but it probably is and we're too dum to figure it out), but I'm saying this kind of lopsided voting and awarding screams bots to me. \n\nMaybe not. Maybe I'm being paranoid. But we should stop being entertained and engaged with Payne. \n\nWe know Cramer is a rat. That's easy. But The Usual Suspects quote, \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" Has me thinking that Payne reeeeally wants to be viewed as our friend, or at least wants to encourage us to look a certain way. Or look away from something or someone important.\n\nDon't trust Payne or any MSM. Magic tricks always make you look at something unimportant or misleading. \n\nBe entertained by everything, but also do some digging and investigating. ESPECIALLY into Stevie Goomba Cohen, since all this sliding kicks in when I see beautiful Goomba memes of his stupid face.\n\nBuy.\n\nHodl.\n\nAnd enjoy your goddamn weekend.\n\n\n\nEdit: Finished an unfinished thought.",
    "title": "Payne/MSM does an interview about debunked darkpool nonsense and it gets over 17k updoots and 230+ awards. The Chair-Man himself tweets and it's around 8k and 70 awards. I call BS.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqruqa/paynemsm_does_an_interview_about_debunked/"
}