{
    "author": "nottagoodidea",
    "created_utc": 1626553295.0,
    "distinguished": null,
    "edited": 1626561925.0,
    "id": "omby2n",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_omby2n",
    "num_comments": 163,
    "permalink": "/r/Superstonk/comments/omby2n/page_redacted_in_its_entirety/",
    "score": 1867,
    "selftext": "Happy weekend all, I hope all are taking a break from the madness to enjoy yourselves after this crazy week. Yesterday was filled with major non-stock related news, so I was wondering if there was possibly some news/ info that was missed. \n\n ------------TL/DR++++++\n\n3 new clearing rules relating to risk (NSCC-2021-008, FICC-2021-006, DTC-2021-013), are effective Monday.  The rules have 85% of their information redacted, so I'm calling on wrinkles to have a look at what's left, if they so wish, to share their thoughts.\n\n_______________________________________________\n\nAfter close yesterday, I saw a link to an interesting video posted by Charlie Vids on YouTube.  It is referencing 3 new rules (NSCC-2021-008, FICC-2021-006, DTC-2021-013) that go into effect Monday July 19.\n\nhttps://youtu.be/Oa-mbL2g5C8\n\nWhat I find most interesting about the information is that portions of the rule have been redacted.  Is this normal for rules that have been approved?  It seems odd to me to have portions hidden, however I will admit I have little experience checking these.  The video below is about NSCC-2021-008 specifically, but all 3 filings are similar, and have 85% of the ruling redacted.\n\nhttps://youtu.be/pCiaO1wQxzM\n\nThere was a post last weekend sharing the filings, but it didn't get much traction.  u/BarTPL0 put out a request for an adult, and I'm here to do the same as I'm interested in what effect these could have.  The OP containing the filings is listed below.\n\nhttps://www.reddit.com/r/Superstonk/comments/ofrhjn/dtc2021013_ficc2021006_nscc2021008/?utm_medium=android_app&utm_source=share\n\nFor quick access\n\nhttps://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-008.pdf\n\nhttps://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/FICC/SR-FICC-2021-006.pdf\n\nhttps://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/DTC/SR-DTC-2021-013.pdf\n\nA few of the comments mentioned that these rules won't have much effect overall.  As we don't know what information has been redacted, we can largely only speculate on the effects it may have one way or another.\n\nBelow is the top comment made by u/JustWingIt070\n\n\"They are changing the risk modelling from static to dynamic. They're reducing paperwork and making some edits. The risk models will be more sensitive to intraday events.\"\n\nI found a description of the framework being updated in the NSCC filing.  \n\n\"The Framework sets forth the model risk  management practices that the Clearing Agencies follow to identify, measure,  monitor, and manage the risks associated with the design, development, implementation, use, and validation  of quantitative models.\"\n\nAlso this\n\n\"The Framework is maintained by the Clearing  Agencies to support their compliance with the requirements of the Covered Clearing Agency  Standards relating to  model risk management. The Covered Clearing Agency Standards require that the  Clearing Agencies take  a variety of  steps to manage the models that they employ in identifying, measuring, monitoring, and managing their respective credit exposures and liquidity risks,  including that the Clearing Agencies conduct daily backtesting of model performance,  periodic sensitivity  analyses of  models, and  annual validation of models.\n\n The Framework outlines the applicable regulatory requirements described above, describes the risks that the Clearing Agencies’  model risk management  program are designed to mitigate, and sets forth specific model risk management practices and  requirements adopted by the Clearing  Agencies in  order to ensure  compliance with the  Covered Clearing Agency Standards. These practices and requirements include, among other things, the maintenance of a model inventory, a process for rating model materiality and complexity, processes for performing model validations and resolving findings identified  during model validation, and processes for model performance monitoring, including backtesting and sensitivity analyses. The Framework also describes applicable internal ownership and governance requirements.\"\n\nWhile reading, I was reminded of this quote from the DTCC that (likely) references my favorite Stonk, GME.\n\n“The largest deficiency incurred during the quarter was mainly driven by a single security exhibiting idiosyncratic risk.” in regards to their massive margin breach Q1 (3x the previous record)\n\n------------------Speculation/Opinion+++++++++++++\n\nSince rules regarding risk are getting an update starting Monday, and GME has been the driver of significant risk over the first quarter, I think it's reasonable to say these rules relate somehow to the GME situation.  \n\nIf deep OTM puts were hiding synthetic short positions, and -005 (or the new risk rules) stop the can kicking, shorts could be forced to close risky short positions which could kickstart the MOASS AND MOAC.  \n\nSR-NYSE-2021-40, which is also effective Monday, makes previous changes permanent in regards to market wide circuit breakers, that may be needed in times of major volatility.\n\nI look forward to reading any thoughts regarding these new rules, hope some wrinkles can help clear some questions up!\n\nEdit: Here is a link to the SR-NYSE-2021-40 post as well.  Also fixed a typo.\n\nhttps://www.reddit.com/r/Superstonk/comments/olm9en/srnyse202140_new_york_stock_exchange_rulemaking/\n\nEdit 2:  exhibit 3,4, and 5 had been redacted, the omission is \"pursuant to17 CFR 240.24b-2\".\n\n\"17 CFR § 240.24b-2 - Nondisclosure of information filed with the Commission and with any exchange. | CFR | US Law | LII / Legal Information Institute\" https://www.law.cornell.edu/cfr/text/17/240.24b-2",
    "title": "\"PAGE REDACTED IN ITS ENTIRETY\"",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/omby2n/page_redacted_in_its_entirety/"
}