{
    "author": "Kaizen_Kintsgui",
    "created_utc": 1626540392.0,
    "distinguished": null,
    "edited": false,
    "id": "om7v0g",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_om7v0g",
    "num_comments": 443,
    "permalink": "/r/Superstonk/comments/om7v0g/windfall_management_guidance_and_lol_450k_otm/",
    "score": 6182,
    "selftext": "Hey Apes, I've written a couple posts about this. I'm an OG BeeTeeSea guy. A lot of what I saw back then is what I see now. People that stumbled across something they knew was going to be incredibly valuable in the future and they diamond handed and bought as much as they could.\n\nGME is another one of these opportunities which I never thought I would get again. I am a high XXXX ape soon to be a XXXXX ape thanks to dumb fucks dragging this out.\n\nIt's never a good sign to count your eggs before they hatch, but when you see those eggs moving, I think it's time to get prepared.\n\nSo what we've seen is a concentrated attack at this sub at the time of 450K puts expiring. If Citadel and co had control of the situation they wouldn't be attacking this sub because it wouldn't be worth their time or money. That isn't an algorithmic reaction, that is a human reaction. We have confirmation they need to us to sell. They lost those puts so they try and break our sub. If you would categorize this behavior as desperate, irrational and childish you would be correct. That is our adversary, just some children in big bodies that are losing. There is nothing special about them. *Imagine trading a world changing amount of money for ruin and rage.*\n\nSo here you are in the right place at the right time, just like they were. So how do we avoid their mistakes. \n\nSoon, for many of you are going to have what many would reasonably categorize as more money than you could spend in a lifetime. It's important to remember, you absolutely can fuck it up like Kenny Mayo or whoever the fuck runs other no-name vampiric corporations that are involved in this mess.\n\nSo here is the rule that those idiots didn't follow. **You do not risk what you have for what you don't need.**\n\nIn the beginning, **the money will blind your judgement.** You need to **slow down and stay humble**. KSG and co didn't do this. They thought they were invincible. This is called hubris. If you look through history, the mighty have all fallen, from empires, corporations and individuals, they all lose it due to hubris. They think they will remain on top forever. \n\nOnce you have it for awhile and done your splurging, which I urge you to skip, unlike myself. **Spending is subject to momentum, once you start, it is very, very hard to slow down.** You will start seeing where the true value in life is very quickly. **I highly recommend before you buy, see if you end up renting whatever it is regularly and frequently.** Want to buy a property with ocean view? Try seeing if you go to the same place 5 years in a row first and how excited you are when you get there.\n\nIn my experience I have learned that the **most valuable things I have are my time, health, personal growth, my family and friends**. Money can help these things develop, but they really can't buy it. When you are out of time, good luck trading all the money in the world for it. \n\nSo the question for me has become how do I spend my time since I don't have to work anymore, ever. \n\n**The formula for a fulfilling life is agency, mastery and purpose.**\n\nI focus on the trifecta, **diet, sleep and exercise**. This is the foundation of my health. I spare no expense here. This is trifecta is quite hard to spin up because they depend on each other as they power your will power and use your willpower. Exercise helps you sleep, so does diet, sleep helps you have the energy to exercise and the willpower to eat healthy. Once you get your self management to a point of excellence, the next stage to focus is on personal growth. Being healthy and having energy feels really fucking good.\n\nNow that I have more money than time, I have realized money can only help so much with skill growth. **Skill growth is really dependent on time.** You need 10K hours of focused practice to get to a world class level. Commitment to continually improving a skill is called mastery. Mastery doesn't top out you constantly can improve. It feels really good when you learn something difficult.\n\nOnce you are committed to continually improving your skill. **You can now define your purpose. Your purpose is defined as something that helps more people than just yourself. Doing nice things for people that they can't do themselves and  without seeking anything in return is the legit best feeling ever.**\n\nLet's kick back and Lol at diamond hands making 450K puts expiring worthless.",
    "title": "Windfall management guidance and lol @ 450K OTM puts expiring worthless BECAUSE YOU HAVE WON.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/om7v0g/windfall_management_guidance_and_lol_450k_otm/"
}