{
    "author": "BlitzFritzXX",
    "created_utc": 1623936953.0,
    "distinguished": null,
    "edited": 1623940674.0,
    "id": "o1xf10",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o1xf10",
    "num_comments": 112,
    "permalink": "/r/Superstonk/comments/o1xf10/s3_ranks_gme_short_squeeze_potential_1010/",
    "score": 916,
    "selftext": "S3 Partners recently issued a short squeeze score card assessing the squeeze potential of stocks according to a number of criteria an then assigning a score between 1 - 10. \n\nThe score is not based on the subjective review of an analyst (we know what those are worth...) but an algorithm which considers the following objective metrics:\n\n- short sale liquidity\n- trading liquidity\n- financing liquidity\n-market-to-market profit and losses\n\nA stock is considered to have short squeeze potential if the following criteria are met:\n\n* large amount of dollars at risk on the short side (high short interest)               check ✅\n\n* large proportion of a security’s tradable float shorted (high S3 SI % Float)     check ✅\n\n* scarcity of stock loan supply (high stock borrow fees)                                        questionable ✳️ we know that a number of institutions have recently stopped to allow shorting of GME and other risky stocks or raised the barrier but we also know that the borrowing fees are still ridiculously low \n\n* limited daily trading volume (high days to cover)                                                   check ✅\n\nResult: Not surprisingly the 2 stocks at the top scoring a 10/10 are GME and the movie stock (just mentioning the second one for completeness , we all know that GME is the real game)\n 💪💎💎🚀🚀⚡️⚡️\n\n\nHere is the link to the corresponding Forbes article : https://www.forbes.com/sites/chuckjones/2021/06/07/amc-and-gamestop-are-still-set-up-for-a-short-squeeze/\n\nPS: I know S3 are not on our side based on their relationship with Shitadel but if we take that criteria we can’t share any data anymore because we know actually no one is on our side. \nAnd since this is not based on someone’s opinion rather than objective criteria and the result corresponds with our DD I don’t have an issue if they want to agree with us. I equally don’t give a damn if they don’t.\n\nPSPS: Don’t know where the fck the background pic of the movie popcorn came from and can’t delete or change it , anyone knows how to do that ? 🙄",
    "title": "S3 ranks GME short squeeze potential 10/10 💪💎🚀⚡️⚡️",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1xf10/s3_ranks_gme_short_squeeze_potential_1010/"
}