{
    "author": "Easteuroblondie",
    "created_utc": 1623986297.0,
    "distinguished": null,
    "edited": 1624037800.0,
    "id": "o2fc2e",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o2fc2e",
    "num_comments": 109,
    "permalink": "/r/Superstonk/comments/o2fc2e/sec_responded_to_my_foia_request_and_it_makes_the/",
    "score": 1622,
    "selftext": "What's good space apes?\n\nA few weeks back, I posted about how I had FOIA'ed the SEC for any correspondence they had with the DTCC or Citadel regarding GameStop stock trading in 2021.\n\n[https://www.reddit.com/r/Superstonk/comments/nsl5cr/30\\_days\\_later\\_any\\_day\\_now/](https://www.reddit.com/r/Superstonk/comments/nsl5cr/30_days_later_any_day_now/)\n\nI finally got a response today. Request DENIED.\n\nOf course, whether or not such correspondence existed is a matter of speculation. But I couldn't help but notice that by launching the investigation, they had a legal shield to not release such hypothetical correspondence.\n\nBecause let's be real – theoretically, if such correspondence *did* exist, could be a pretty big liability, no?\n\nThe timeline of the investigation announcement lines up perfectly with my FOIA request. After all, the GameStop trading saga has been going on for months now. Why wasn't an investigation launched earlier...like, I don't know, say, January? or February? Or even March? April maybe? Curious that the day I got the denial was the day the investigation was announced...\n\nI do investigative journalism on the side, because I, like many of you, have to produce value for some one else for a living. Apparently we all owe some asshole on Wall St all of our earnings because we're alive or something.\n\nWhen the MOASS happens, I will go all in on spinning up this independent media site, which I envision as the 'Karen of the federal government.' Until then, judge not lest ye be judged\n\ncheck it out...all FOIA correspondence linked.\n\n[https://upsidechronicles.com/2021/06/17/foia-to-sec-about-gamestop-trading-activity-denied-due-to-active-investigation/](https://upsidechronicles.com/2021/06/17/foia-to-sec-about-gamestop-trading-activity-denied-due-to-active-investigation/)\n\nedit: tl;dr SEC denied my FOIA request on the grounds that it was an active investigation. Oddly enough, they announced the investigation the \\*same day\\* they sent their official response, despite this Gamestop drama dragging on for months. that may sound like a good thing, but in reality, the investigation initiation gives them legal coverage to deny the FOIA requested information, which in my humble opinion, is the smoking gun",
    "title": "SEC responded to my FOIA request – and it makes the timing of the investigation announcement quite interesting",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2fc2e/sec_responded_to_my_foia_request_and_it_makes_the/"
}