{
    "author": "lionbernd1",
    "created_utc": 1628441905.0,
    "distinguished": null,
    "edited": 1628445467.0,
    "id": "p0ic0w",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_p0ic0w",
    "num_comments": 98,
    "permalink": "/r/Superstonk/comments/p0ic0w/cnbc_deleted_a_part_in_the_middle_of_the_house/",
    "score": 4369,
    "selftext": "I found it in this post [https://www.reddit.com/r/Superstonk/comments/p04zl9/ape\\_journalist\\_here\\_again\\_some\\_thoughts\\_on\\_those/](https://www.reddit.com/r/Superstonk/comments/p04zl9/ape_journalist_here_again_some_thoughts_on_those/)\n\nwich leads here                                                                                                           [https://bettermarkets.com/newsroom/cnbc-posts-edited-video-house-financial-services-gamestop-hearing-deleting-dennis-kelleher](https://bettermarkets.com/newsroom/cnbc-posts-edited-video-house-financial-services-gamestop-hearing-deleting-dennis-kelleher)\n\nwith this important peace of shit : (from March , but at least I didn´t know this part )\n\n\" CNBC deleted a part in the middle of the hearing that included the most direct, pointed criticism of Citadel.\n\n“Specifically, I testified that FSOC should review Citadel’s wide-ranging activities in the financial markets to determine if it should be designated and regulated as a systemically significant nonbank. Citadel is a gigantic, interconnected financial firm, but it is non-transparent and unregulated in critical respects, preventing effective oversight and accountability. That’s why it is vital for Main Street Americans and retail investors to know whether or not it is a systemically significant firm, whether it poses a threat to the financial system and economy, and whether it should be regulated more comprehensively. CNBC’s viewers, however, would not know those critical issues were pointedly discussed at the hearing or deleted from the video CNBC posted. CNBC should immediately restore the deleted parts of the video.\"\n\nTo hear Kelleher’s concerns about Citadel’s substantial presence in the financial markets without the regulatory oversight necessary to protect investors and markets, visit [this link](https://www.youtube.com/watch?app=desktop&v=chogYSWCA24&t=1218s). However, Kelleher’s following comments, directly responding to a Republican witness’s unqualified defense of Citadel, during the hearing capture the essence of his concerns:  \n\n“If Citadel shut down today, even for a day, that means 26 percent of all U.S. equities’ volume in 8,900 listed securities would stop. It executes 47 percent of all U.S. listed retail volume. It represents 99 percent of the traded volume of 3,000 listed options. To say that the system would work perfectly fine if all that evaporated today and competitors would come into the market—that may ultimately happen—but until it ultimately happens, you're going to have a systemic event. And to deny that is to deny reality.”\n\nIf this was posted I will delete .",
    "title": "CNBC deleted a part in the middle of the House Financial Services’ GameStop Hearing . I make this post for visibility",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/p0ic0w/cnbc_deleted_a_part_in_the_middle_of_the_house/"
}