{
    "author": "SurVVhyNot",
    "created_utc": 1625200710.0,
    "distinguished": null,
    "edited": 1625243916.0,
    "id": "oc2w7v",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oc2w7v",
    "num_comments": 516,
    "permalink": "/r/Superstonk/comments/oc2w7v/nft_dividend_do_you_really_want_to_know_the/",
    "score": 4344,
    "selftext": "**Non-Fungible Token Dividend**  \nEvery single shareholder gets an NFT which represents the literal number of shares they own. The issuance of the NFT Dividend would take place and then...\n\nBecome instantly visible on the blockchain for the entire world to see just how many shares are held by real people. Once it's on the blockchain it's public record. We will be witnessing the first ever passive aggressive documentation of fraud the world has ever seen. Every share owned by a real person would be documented.\n\n**The Battle Has Been Won**  \nWe will be given a permanent *non-fungible* record of share ownership in the worlds greatest company. This EPIC WIN will violently destroy corrupted institutions in one fell swoop. Meanwhile, the world will cheer non-stop for weeks, months, possibly years. Any ounce of evil remaining will go into deep hiding. The people have regained their power and will not cower when evil rears its ugly head. Lest we forget.\n\n**Renaissance 2021**  \nMedia will be fully saturated with non-stop video feeds showing the rising count of NFT's appearing on the blockchain. We'll breeze past 150M redemptions on the first day alone. Maybe even 300M redemptions. People will be cheering and others will be confused and asking what's going on? What's going on?! Before you know it, the entire world is enamored with GameStop and the Apes who fought valiantly to uproot and destroy this corruption. Blockchain adoption will increase exponentially hereafter.\n\n**Hell Hath Frozen Over**  \nPeace be with you all. Go forth and give what has been taken away for generations. Heal your soul, mind, and body. Heal the world.\n\n**Knowledge Is Power**  \nThe removal of the veil is one of the greatest gifts humanity could ever receive. The evil will have been brought into the light where it can no longer hide. We need not worry anymore. No more guessing about how many shares exist, who was right or wrong. *We will know*. And we will still HODL! Because we are right!\n\n&#x200B;\n\n**This is my battle cry! If you share the same sentiment let me see and hear your battle cry!**\n\n&#x200B;\n\n**P.S.**  \nSeveral points I want to cover\n\n* Feel free to correct me. I am not an expert and this is all based on my limited understanding of blockchain. I also do not wish to mislead anyone. However, I believe in this and wanted to share my excitement and joy with you all. So dream with me until we no longer have to.\n* GameStop will choose how they issue the dividend. The share-to-NFT conversion ratio could be anything. For example, 1-to-1 or 10-to1. It won't matter so don't worry about it.\n* GME will skyrocket and for how long is anyones guess. Apes, you'll know when enough is enough. Eventually, you will stop caring about how high the ticker continues to go. You will redeem your tendies through your brokerage account like normal.\n* Ryan Cohen is taking care of us Apes. No doubt about it. He's not the selfish wallyworldstreet bigot type. He builds things. And he knows Apes are by extension building this with him. Share in the spoils of your enemies for it is the right thing to do. Apes will not hold anything against anyone who did them wrong. Being right is all we needed to continue the fight. Eat, drink, and be merry.\n\n&#x200B;\n\n**Satori Dividend** (added 7/2/21)  \nVarious people have pointed out that traditionally, brokers have the ability to offer ***Dividend Equivalents.*** You are correct. We are in unprecedented times as the faux elite like to say. And they are not wrong. However, may I convince you to come over to the **Dark Side of The Moon** for a moment?\n\nImagine capitalism being flipped upside down and onto its head. Think social capitalism. In what universe would greed ever submit itself to poverty? Never.\n\nCapitalism is focused on short term gains as evidenced by…Oh, you don’t need me to remind you of all the infractions and consequences a few select individuals have imposed on all of humanity? You’re an Ape, then!\n\nThe **NFT** will be virtually free for SHF to obtain and pass along to the rightful shareholder. That’s the point. It will not be hard for them to pass along! This is all about documenting the extent of our fraudulent markets. How many elephants can fit in a single room?\n\nTell me, what SHF can convince a Judge, let alone jury, that a free dividend will cause them imminent harm? It’s free. What’s the big deal? You rather pay for it? What? No way. That’s not capitalism. Suits will be thrown out immediately. Issue the dividend or else.\n\nLow and behold, all NFT Dividends reach their intended shareholders and at zero cost to SHF, Broker Dealers, DTCC, you name it. The public highly transparent blockchain ledger will present irrefutable proof of all counterfeit shares. The world sees the fraud for what it is and is raging against the machine.\n\nNow, what happens after all the dividends have been issued and the deadline to do so has been met? Open the casino! Parallel stock market GameStop **Coin** spike that puts (SHF leveraged) bitchcoin (oops) to shame.\n\nI will say it again. The world will be in awe of you Apes.\n\nLastly, let me reiterate that I am not an expert or anything else with similar title. I am an Ape. This is not financial advice. We are open for discourse here. Feel free to pick my opinions apart if need be. No harm will come from Ape edification. Keep your hopes in check. The people closest to you who have doubted and mocked you are not your enemy. You will not hold anything against them. Everything shall be held against the true enemy.\n\n&#x200B;\n\n\\- Fallible Ape",
    "title": "NFT Dividend - Do you really want to know the purpose? Here it goes...",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oc2w7v/nft_dividend_do_you_really_want_to_know_the/"
}