{
    "author": "locallingo",
    "created_utc": 1620224666.0,
    "distinguished": null,
    "edited": 1620250684.0,
    "id": "n5h4it",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_n5h4it",
    "num_comments": 1798,
    "permalink": "/r/Superstonk/comments/n5h4it/if_you_voted_via_fidelity_raise_your_hand_lets/",
    "score": 13545,
    "selftext": "[https://www.reddit.com/r/Superstonk/comments/n5cyq9/fidelity\\_just\\_posted\\_proxy\\_materials\\_to\\_your/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/n5cyq9/fidelity_just_posted_proxy_materials_to_your/?utm_source=share&utm_medium=web2x&context=3)\n\nThis is democracy at work in the smallest of places (your mouse and keyboard, or mobile device), and the remaining actions you take on elected officials (past, present, and future) are critical. You've exercised your right to effectively recall your share and make your voice heard.  We all know, this is just one of the focused actions we must continue to pursue. All apes, get on your Fidelity (or other broker) account and VOTE.  **Do not** vote via any other method!\n\nKeep your foot on the gas pedal and don't look in the rear view mirror.  Read your DD's, eat healthy, get exercise and good sleep, meditate, close your eyes and visualize your achieved goal carefully and patiently, do something for someone else today (and tomorrow,...), and don't get distracted by the FUD and naysayers bouncing around everywhere. They will be relentless until the end and after the end, and after the end of the end!  The top dogs are deeply ruthless and will continue to be ruthless, that's how they reached their unworthy perch.  Stay strong, positive, and don't let anyone get under your skin.\n\nX's, we see you and love you, stand strong and proud.\n\nXX's, we appreciate your sacrifice.\n\nXXX's, we are grateful for your broad stability.\n\nX,XXX's, you are our rock.\n\nXX,XXX's, your whale breath is sweet as honey\n\n*Member of the Red Headband Army (RMA)*\n\nHODL\n\nEdit1: Tried to create poll but auto-deleted by mod rules. Makes sense.\n\nEdit2: Couple of yall saying I'm karma whoring - sorry it comes across that way. I'll delete post if more think that. not intended at all. i dont care about my karma.\n\nEdit3: love the stories of sleepyheads barely awake and then spazzing out of bed on the news they can now vote\n\nEdit4: all these hands.  hope everyone used hand sani.\n\nEdit5: DFV \\*may\\* be lurking.  Hello sir <solutes!>\n\nEdit6: dont upvote this post if you've voted, go upvote u/ThatGuyOnTheReddits 's post linked at top.\n\nEdit7: Thanks for the awards ape family!  Save your coins and go buy more GME.\n\nhttps://preview.redd.it/z5yc3szhabx61.jpg?width=627&format=pjpg&auto=webp&s=6453d84ac65126f8568bc4426f8460201f5c773a",
    "title": "If you voted via Fidelity, raise your hand. Let's get ballpark count on Apes who voted. Thanks to u/ThatGuyOnTheReddits for update. Remember, your voted record (control number) is aligned on the back-end with a real share record. Stand strong, keep reading...",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/n5h4it/if_you_voted_via_fidelity_raise_your_hand_lets/"
}