{
    "author": "Minako_mama",
    "created_utc": 1625084784.0,
    "distinguished": null,
    "edited": 1625096364.0,
    "id": "ob5skj",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_ob5skj",
    "num_comments": 150,
    "permalink": "/r/Superstonk/comments/ob5skj/crypto_dividend_hype/",
    "score": 2159,
    "selftext": "EDIT 2 - This goes on the top, because it's important: I am not in ANY way saying that we should not be hyped.  I am saying that even if this *one* thing we are hyped about does not happen, there is still a LOT to be hyped about!  So *if* there is no crypto dividend, there is no need to be disappointed.  Because GME has hype for miles.\n\n\n\nI just want to take a moment to acknowledge the fact that many here are hyped over the possibility of GameStop issuing a crypto dividend. \n\nTBH, it would be awesome.  And according to everything we know, it would absolutely screw the hedgies. \n\nThat being said, I think it’s worth reminding everyone:\n\n*Gamestop may not have any plan to issue any dividend, crypto or otherwise.*\n\nThis is an assumption on our part, based solely on the facts that it would be awesome, and it would most likely launch the rocket.  \n\nBut in the event that they do not issue a dividend, don’t let it being you down.  A crypto dividend isn’t the only thing that will launch us to the moon.  *It’s one of many different potential triggers that could do it.*\n\nWe have a lot of big brains on this sub that compile all kinds of great data, pointing to one potential trigger or another.  Apes get hyped over a particular trigger, and then disappointment follows when that doesn’t happen.\n\nRemember 6/9?  Remember how low so many felt when there were no big announcements or sharing of actual vote counts?  That was a dark day here on this sub, and only because apes got too hyped over one potential trigger.  Let’s not do that over the dividend thing, OK?\n\nTrust the process, and trust RC.  He has our backs.  If they decide to issue a dividend, awesome.  I will be more jacked than ever.  \n\nBut if there is no such dividend?  Totally fine.  Because *the shorts still have to cover.*\n\nMama says HODL! 🥰\n\nEdit: I’m not saying not to be hyped.  We should always be hyped.  But don’t get disappointed if one specific thing we are hyped for doesn’t work out.\n\nIf the disappointment doesn’t get to you, that’s awesome.  Keep those diamond hands!  But I saw a lot (and I mean a LOT) of posters here act as if the MOASS was canceled when RC didn’t announce the vote count at the shareholders meetings.  I just don’t want to see anyone get disappointed or feel any FUD if there is no crypto dividend.  There is no need for FUD.  \n\n💎 🙌 🚀",
    "title": "Crypto Dividend Hype",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/ob5skj/crypto_dividend_hype/"
}