{
    "author": "Slickrickkk",
    "created_utc": 1621461029.0,
    "distinguished": null,
    "edited": 1621462760.0,
    "id": "ngi92v",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ngi92v",
    "num_comments": 47,
    "permalink": "/r/Superstonk/comments/ngi92v/blackrock_did_not_sell_gme_shares_to_ubs_asset/",
    "score": 2832,
    "selftext": "I'm referring to this post. https://www.reddit.com/r/Superstonk/comments/nggu0y/blackrock_sells_62876_shares_and_ubsmetlife/\n\nI took a look at Fintel and even though I don't have the subscription it still lets you see some numbers.\n\nFor Metropolitan Life Insurance Co., you can see that as of the 03/31/21 13F filing, they have 15,000 shares, at a $1000 value of 2,865. That would mean they're GME Shares are valued at 2,865,000. Divided that by 15,000 shares and you have an average cost basis of **191 per share**. The average cost basis that Fintel lists doesn't even mathematically compute given their total value and number of shares.\n\nhttps://prnt.sc/134x2bi\n\nhttps://fintel.io/i/metropolitan-life-insurance-co-ny\n\nGME would have been priced at 191 multiple times before 03/31/21 after the run up from 40 dollars in February.\n\nI don't know what exactly other posters were looking at but I don't see that when I go to Fintel's site.\n\nThe same goes for UBS Asset Management. https://fintel.io/i/ubs-asset-management-americas\n\n62,845 shares at a 11,929 (x1000) value of $11,929,000 equals to  an average of about **189 dollars**. GME was sitting at around that price before 03/31/21.\n\n**TL,DR: The average share cost was likely an error because it does not mathematically computer with the other numbers given in the charts.**\n\n*Disclaimer: I am an idiot and I think this is actually the first post I've made on GME besides commenting a lot, so if I'm completely wrong, go easy. Lmaooo*\n\n**Edit:** Dave Lauer also calling it as an error. https://www.reddit.com/r/Superstonk/comments/ncj6q6/fintel_showing_two_new_institutional_holders/gy5ef9b/?context=3\n\n**Edit 2:** The post where Dave Lauer is calling it an error is also 5 days old. So it's been disproven for DAYS.",
    "title": "Blackrock DID NOT Sell GME Shares to UBS Asset Management & Metropolitan Life Insurance for $95,000 dollars",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ngi92v/blackrock_did_not_sell_gme_shares_to_ubs_asset/"
}