{
    "author": "BrewsCampbell",
    "created_utc": 1621436548.0,
    "distinguished": null,
    "edited": 1621440851.0,
    "id": "ng86v2",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ng86v2",
    "num_comments": 75,
    "permalink": "/r/Superstonk/comments/ng86v2/blood_red_no_liquidity_and_no_friends_in_sight/",
    "score": 1040,
    "selftext": "Sup Apes. Long-time lurker, some-time commenter, first-time poster.\n\nToday's market and crypto bloodbath has to be due to the DTCC liquidity requirements. It may be a sign of something big, but ultimately it's the same something big the failed (and re-failed) liquidity tests were trying to plan for. Good luck with that, market.\n\nI'd like to briefly open a dialogue about institutional ownership in GME. It went down. So fucking what? We do not have \"whale friends,\" there is no institution, not even the long ones, that wants the MOASS to happen. None; not one of them. Why? Because they are the stock market. This is the game they win every time. They have never lost, they do not want to see anyone lose because that means they're capable of losing.\n\nWhat has happened, by having pinned these shorts to their fucking stupid play may actually break the foundation of the stock market. There is no publically traded company, no branch of government, no institution that wants that to happen.\n\nThere is only a group of individuals who happen to have the same goal and are primates. If that group of individuals happened to own more than the entire GME float AND holds, they will have defeated the entirety of the stock market, they will have as many tendies as they wish, and they will stand in the ashes of the most corrupt financial system ever created. In the short term, the world will not be better for it.\n\nThere is no one on the side of \"the little guy\", no one is fighting with anyone on their side, everyone stands alone, there isn't one happy rocket everyone will be hopping on. It will be a hard, solo ride to the top on a rocket you've assembled with your diamond hands from years of being held at bay, disallowed to understand or partake in the machinations of the rich. But that has changed.\n\nI am here to break the system. I hope there are others like me.\n\n&#x200B;\n\nEDIT: The only catalyst is time. If we keep holding they'll lose places to hide.",
    "title": "Blood Red, No Liquidity, and No Friends in Sight",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ng86v2/blood_red_no_liquidity_and_no_friends_in_sight/"
}