{
    "author": "mediareject",
    "created_utc": 1615585620.0,
    "distinguished": null,
    "edited": false,
    "id": "m3s0e9",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m3s0e9",
    "num_comments": 46,
    "permalink": "/r/GME/comments/m3s0e9/today_is_a_prime_example_of_why_we_need_to_stop/",
    "score": 765,
    "selftext": "Listen, I love this community and am so appreciative of all of the insight many people here have. I've learned more about stocks from this sub in the last 2 months than I have in my whole life.\n\nBUT, I've seen a lot of DD posts here that like to point to specific events triggering the squeeze. Today was a great example of this. There were so many posts and comments the past two days that talked about how the gamma squeeze was going to happen on Friday. And now here we are at market close, and GME only went up about 1% from its opening price. And now a lot of people are feeling discouraged and disappointed that there wasn't a gamma squeeze.\n\nThe truth is, I've held GME stock since the end of January, and since then I've gotten really excited anytime one of these big \"event\" days has rolled around. But every single time those days have meant nothing. Really, we've seen big swings happen on days where no one was expecting it, not on days where it was \"supposed to\" happen. Everyone always thinks something big will happen because it's a Friday or the last hour of trading, and they're usually wrong.\n\nAnd I get it, we're all excited about the squeeze, and so anytime we think we might have insight into when it's going to happen, we get optimistic. But the problem with this is that you're setting yourself up for disappointment. I'm really thankful that we have a great community of apes with the strongest diamond hands I've seen, because we could easily have given up by now. But we're stronger than that.\n\nI fully believe the squeeze WILL happen. With all of the great DD we've gotten over the last few weeks, I'm as bullish as I've ever been on this stock. But trust in the process, and don't put so much stock into specific dates. I feel like this is extremely important to keep in mind in the coming week, since March 19 has been hyped up to be a big day. With all due respect to people like Pixel that have pushed this being a big day, I think they're wrong. I'll be thrilled if something does happen, but I just can't keep getting my hopes up.\n\nI think we should absolutely keep sharing insightful DD with each other. I will keep reading it, because it strengthens my resolve and teaches me more. But I'm going to stop getting hyped up about specific dates. I will just keep holding until it squeezes at the right time. I just really like this stock.",
    "title": "Today is a prime example of why we NEED to STOP putting so much stock in specific dates.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m3s0e9/today_is_a_prime_example_of_why_we_need_to_stop/"
}