{
    "author": "Damsellindistress",
    "created_utc": 1620745677.0,
    "distinguished": null,
    "edited": 1620745982.0,
    "id": "n9z67m",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_n9z67m",
    "num_comments": 143,
    "permalink": "/r/Superstonk/comments/n9z67m/they_are_forced_to_keep_dropping_the_price_to/",
    "score": 3696,
    "selftext": "# See the funny thing is we have literally all the reason to buy, and no reasons to sell.\n\n**Current situation**\n\nCurrently at $140, GME has a market cap of  9.7 billion. That's criminally low for an e-commerce company (which it is rapidly turning into)\n\nGME has no long term debt (all paid off early), has 700 million in cash, a fresh dream team of board of directors (all ex Chewy, Amazon) who all believe so much they arent taking salary but are getting paid in shares.\n\n\n**So what can we expect?**\n\nChewy has a market cap of 30 billion without ever turning a profit. If GME reached the same (in a much bigger market, since gaming is a much bigger segment than pet supplies) that would mean $426 a share. Honestly, Id consider the transformation mission partially failed if we reached that. Im for real gunning for a 60 billion market cap, or $856 a share.\n\n\nAnything under $300 dollars is an instant buy for me.\n\n**Squeeze?**\n\nThe only reason the stock is tanking is because of obvious manipulation. You can see that without DD by looking at movements at level 2 for a week. BUT we do have mountains of DD proving shorts havent covered.\n\n\nI feel completely comfortable treating GME like a savings account. I see absolutely no reason to sell if it drops, in fact the lower it goes the more money I am going to put in!\n\nHonestly, this is the one stock they shouldnt have shorted. They never expected the strong turnaround. They felt so sure they would go under, and now its staring them in the face like the Grim Reaper.\n\nThey HAVE to drop the price in order to avoid margin call, but because of the rapidly improving fundamentals retail and institutions have no other option than seeing this as a massive discount for an amazing company.\n\nInvesting in fundamentals alone is super attractive already. On top of that, buying and holding will pretty much guarantee a squeeze. The only thing you have to do is buy and hold and be patient. Even if it takes years theoretically, your money is safe as long as the e-commerce transformation even partially succeeds.\n\nRemember, everytime the price drops you are getting a discount for more shares in a company that is rapidly growing.\n\nIt doesn't matter if you cost base is 300 average although I would average down rapidly, especially since theyre forced to tank the price. I have literally zero reason to sell this short or longterm even if they drop the price to $40.\n\n**Disclosure**\n\nHave 23X shares currently, with a goal of 25X end of week and 300 end of June.\n\nLoving every sale",
    "title": "They are forced to keep dropping the price to avoid margin calls, but by doing so they are giving you a discount in one of the best growth stocks for the next few years",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n9z67m/they_are_forced_to_keep_dropping_the_price_to/"
}