{
    "author": "SilkKringle",
    "created_utc": 1624704026.0,
    "distinguished": null,
    "edited": 1624718148.0,
    "id": "o88ejp",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o88ejp",
    "num_comments": 429,
    "permalink": "/r/Superstonk/comments/o88ejp/over_7000_resumes_including_the_words_hedge_fund/",
    "score": 9322,
    "selftext": "Hey ya'll, congrats on hodling through another week. You are stronger than you know, and we will all come out of this mess blessed.\n\n**TL;DR:**  Over 7,000 resumes including the words \"hedge fund\" are posted on [Indeed.com](https://Indeed.com) with many being updated within the last month, and ALL 7,000 within the last 6 months. Although the information presented utilizes only one of a myriad of potential keywords, we have a unique way to get an inside look at the health of banks and hedge funds over time. This information can provide valuable insight into the current corporate climate and employee sentiment, as well as forecasting potential sweeping corporate changes (layoffs, dissolution) before they are made public knowledge. If they can see our personal talks and strategy on this forum, we can delve uncomfortably deep into their private business too.\n\n&#x200B;\n\nMy specialty is intrinsic relational analysis. You can learn a lot about the inner psychology of an environment by monitoring the business' pulse (employees ) and extrapolating the info, concerning how it relates to the health of the business as a whole. As others have put it, rats simply jump off a sinking ship. You may be looking at the front of the ship and it looks brand new, but you can not see the huge hole in the back. You see the rats jumping, you know the end is near.\n\n&#x200B;\n\nMy preferred analogy is to think of a corporation as a person. If a person is calm and healthy, their demeanor will reflect the same. If the person is undergoing a health crises or a period of great stress, you will be able to hear their heart beating through their chest. You'll see the the labored breathing, the sweating, the grabbing of the left arm. When you see them reaching for the aspirin, you can begin to infer they know they are about to be on life support. What I aim to demonstrate is that we are able to make an educated guess as to how close the hedge funds are to flatlining by examining how their employees are reacting to the current environment.\n\n&#x200B;\n\nOne of the ways we are able to see the hedgies and banks reaching for the proverbial aspirin right this moment is through the resumes posted to various job search forums. I only chose [indeed.com](https://indeed.com) because it is free to search resumes, and it contains an ample sampling of a broad array of careers. However, if you want to try to really dive deep and see the true scope of the mass hedge fund and bank exodus, there are job boards that cater specifically to financial careers. You could even look on tech boards, engineering boards... The resumes listed on indeed are only the tip of the iceberg, and I encourage you to diversify your research into other job boards.\n\n&#x200B;\n\n**The Method:**\n\n&#x200B;\n\nGo to [resumes.indeed.com](https://resumes.indeed.com) and input \"Hedge Fund\" into the search bar. This will search all current resumes for those specific words. Other words to try are \"Investments\", \"Portfolio\", \"Trading\" \"Spicy Mayonaisse\", etc.\n\n&#x200B;\n\nWhat we are looking for next is the \"recently updated\" text in orange. Go back a couple months and see how many resumes have been updated or uploaded. It is an impressive amount for any search term you use.\n\n&#x200B;\n\n[Resume Data Sample 06\\/26\\/21](https://preview.redd.it/nldvu1808l771.png?width=960&format=png&auto=webp&s=d101d6ba8d5a3558c0a8177a7bd8de017b4de21a)\n\n&#x200B;\n\nUsing this data, we can start to see a tiny glimpse into the psyche of the corporate employees. Much like trading is largely based on a FOMO/Fear cycle, the fear cycle is kicking in pretty heavily at this moment for the hedge fund employees.\n\n&#x200B;\n\nTracking the information daily, we should be able to start seeing an exponential increase in updated or new resumes every time a hedge fund collapses quietly in the background, or when a bank starts announcing layoffs and giving a few weeks notice to their employees. Resumes are just one facet of data collection we can employ to get a grasp on the current situation and there are other methods of relational data collection that can be found, which will be explained in future posts.\n\n**Final Word:**\n\nThat said, I am commissioned to love on hurting people, pray for them, and read between the lines when they can't quite express what they need to be said, or when they have hidden needs that must be met.  Although there are some truly evil people in this world, many in the employ of hedge funds are wage slaves just like us. This is not to excuse their profoundly egregious behavior, however. There are consequences to everything we do, and the consequences of their actions are coming due. Do remember though, there is an abundance of good people stuck in less than desirable career choices out of absolute necessity. These hedge fund employees have the same medical bills, mortgages to pay, and children who are blissfully oblivious to their parents current financial predicament. While many are complicit in the criminal acts leading to this mess; ultimately loving your neighbor and being a true light, showing the enemy how to correctly live the right way  by your own example is the only way we can ourselves find a path to healing after all this is done. Lead by example, and show those who have lost their way, their career and identity how to change the world for the better, and be better people.\n\n&#x200B;\n\nBe the change you want to see, stay strong, buy and Hodl, and God bless.   <3 Silky\n\n&#x200B;\n\nI like cats.\n\n&#x200B;\n\n**EDIT:**\n\nSpeaking of relational analysis,  can someone please link that post about the Food Delivery Guy in the comments? If I remember correctly, his post was the one that started the wheels turning on this DD. Unique and fun bit to read if you get a chance!\n\n**EDIT 2:** Here is the food post, another unique way of  looking at relational Data. Thank you kind apes for the quick response! [https://www.reddit.com/r/Superstonk/comments/o7uf1q/citadel\\_office\\_activity\\_from\\_the\\_ground/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/Superstonk/comments/o7uf1q/citadel_office_activity_from_the_ground/?utm_medium=android_app&utm_source=share)\n\n**Secret Edit:**\n\nSpeaking of resumes, I am currently taking applications for a lady ape to share life with and marry. Maybe make some baby apes that will grow up in a world left better than when we came in. My mother says I am handsome. Thanks ma, I know its been a few decades, but i'll move out soon.",
    "title": "Over 7,000 resumes including the words \"hedge fund\" are listed on Indeed, with many being updated within the last month. We can gain valuable insight into hedgies corporate climate, as well as forecasting potential sweeping changes. We can possibly see hedge funds collapsing before it is announced.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o88ejp/over_7000_resumes_including_the_words_hedge_fund/"
}