{
    "author": "itsdaynotdave",
    "created_utc": 1619421436.0,
    "distinguished": null,
    "edited": 1619451627.0,
    "id": "myryiv",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_myryiv",
    "num_comments": 1770,
    "permalink": "/r/Superstonk/comments/myryiv/andrewmomoney_used_my_dd_in_a_live_stream_ft/",
    "score": 10661,
    "selftext": "Edit: I can't believe...I spent all weekend writing this... only for you guys... to react... the way I expected you to! How exciting!!  *pulls up soap box* So alright y'all, now that you're all here, let me make a brief comment before I go to bed and I'll see you later if the mods allow it. I see red flag, I investigate, I report my findings. You can agree, disagree, or anything in between and I will not lose a wink of sleep. What I DO care about is some sweet little chimp has more resources to make their own decisions regarding the media they buy into during arguably the most important event in their life via a case study. If you think this is just about Andrew, you're missing the point but I still love you very much.  Sound fair?\n\nEdit2: oops; sorry guys. Had to come back and ask y'all to try to keep your comments fairly respectful. At the end of the day, he's just a content creator. Like me. Like you. In this post I give him credit where credit is due and I don't hate him whatsoever, I talk about things that are trendy OUTSIDE of him, and I also make some suggestions on how he can remedy most of your concerns! Also if you think I'm losing sleep over a comment... have you ever...had a toddler? Anywho.Happy reading.\nThis goes without saying, but y’all really need to do your own research and take everything you read, watch, or listen to with a grain of salt. I don’t care who the source is and how much you trust them. So, let me give you some friendly advice using my research to back me up: **Stay away from AndrewMoMoney during the squeeze.**\n\nEdit3: you ask for an alternative, [here it is](https://youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA).\n\nAndrewmomoney has been trying to leave a comment, but can't because of karma. You can find a response copy pastes below. I'll be in contact later.\n\n**Disclaimer**: I’ve mentioned before, I’ve been working in the design and marketing field for many years. As such, there are often things I’ll talk about as if they’re common knowledge or I’ll explain them as if we were good ol’ friends sitting around the campfire. That said, I’ll do my best to provide every single resource. If I’m missing something critical for your understanding, just let me know and I’ll do my best to provide. Moving on.\n\n&#x200B;\n\n[https:\\/\\/www.noxinfluencer.com\\/youtube\\/channel\\/UC23emuGbNM7twofQIrEgPBQ](https://preview.redd.it/4h1htukgsgv61.png?width=1236&format=png&auto=webp&s=430dd8e5be9fbd2a36e77e519f2debdd239b54a7)\n\nHave you tried to start a youtube channel? Or a business? Yeah? Almost everyone I know has too. A majority of the people I know have gotten as far as making a cover photo, a banner, the about, and maybe ONE video. Then poof. It’s gone. They lose motivation. **This tends to be the case for a lot of people and the easiest way to combat this is by having a plan**. You sit down and figure out who you are and what you look like, what you do, who your audience is, why you’re better than everyone else, and how you’re going to deliver the goods.\n\nYou’ll create some things like a business canvas, a marketing strategy (which will include your voice and tone), and a content calendar among many other things. Here are some quick reads before I dive deeper:\n\n&#x200B;\n\n* [Creating a business plan](https://blog.hubspot.com/marketing/business-plan-template)\n* [Creating a business canvas](https://bmcintroduction.wordpress.com/)\n* [Content calendar](https://www.copypress.com/blog/content-calendar/)\n* [General tools](https://creately.com/blog/diagrams/the-ultimate-list-of-marketing-strategy-tools/#model)\n* [Tone and Voice](https://buffer.com/library/social-media-marketing-voice-and-tone/#examples-of-voice-and-tone-guides-online)\n\nGot some knowledge under your belt? Great. Too busy eating crayons, **great.** I’ll explain in layman’s terms anyways.\n\nI like to check out some analytics and watch content periodically throughout the channel’s history so I have a better understanding of the initial strategy, how its evolved, as well as if there are any catalysts, etc, etc.\n\nAndrew’s channel was created April 7th, 2020 and formerly titled Data Leap. His bio:\n\n“As a 26-year-old cryptocurrency **data scientist** in Silicon Valley that built **9 streams of passive income in 2020**, I want to **help you** find your own path to **6 figures in 6 months**. Subscribe to keep up with weekly uploads, cool kids are all doing it. Let's leap together.”\n\nSince it’s important enough to be in his bio, **I think it’s critical for me to understand what a data scientist is**. I did some research, I liked these videos ([Joma Tech](https://www.youtube.com/watch?v=xC-c7E5PK0Y) and [Ken Jee](https://www.youtube.com/watch?v=sHRq-LshG3U). Check out the description box of the latter for some key points), but I still found it to be unclear. However, I think it’s fair to say that there will be a lot of **CODING** on this channel.\n\nThis is obvious in his earlier videos. I’ll give you a few examples.\n\n&#x200B;\n\nhttps://preview.redd.it/3ai6k3t5dgv61.png?width=1094&format=png&auto=webp&s=666c9695a160e60744c33c886ad9e5a2fccd06ab\n\nPretty on point with what we can deduce from the bio. His tone is pretty casual, yet sophisticated. He wants to entertain you while putting some wrinkles on that brain. ~~I'd say I nailed this because Andrew says the same thing in a later video.~~\n\nNow I take a look at how often he posts. Here are the dates from his first couple months:\n\n* June 22\n* June 26\n* June 29\n* July 7\n* July 13\n* July 16\n* July 22\n* Aug 3\n* Aug 8\n* Aug 10\n* Aug 14\n* Aug 17\n* Aug 24\n\nNow, this might be my low blood sugar talking, but man, this tight production schedule is making me queasy. That’s a lot of videos in a short amount of time and you’ll notice they’re often just a few days apart.\n\nOne of the most common questions someone will ask is what they can do to grow their channel. Usually you turn to them and ask how much they’re posting, what they're posting, and when. **Rule of thumb, quality over quantity**, but **consistency is key**. You put out one really awesome video every other 6 months, you get buried by the algorithm. You put out 20 videos of garbage and you get buried by the algorithm. Most end up putting out 1-2 videos a week, but that won’t guarantee a bunch of subscribers or a ton of views. **Generally, you give them something of value and consistently provide that same value to incentivize them to come back to your channel.**\n\nFor example, I’d like a new kitchen table and the current trend is just my type, but I’m unwilling or unable to pay such a high price for someone to build it for me. **I’m willing to learn how to DIY and can buy entry level tools to do the job myself**. I turn to youtube and find a channel dedicated to simple DIY builds with minimal tools. They explain the process start to finish very well and my table turns out awesome. **Turns out they have more videos!** I decide to stick around and subscribe. Thousands of people out there end up subscribing for the same reason..\n\n&#x200B;\n\nhttps://preview.redd.it/2v41gaf2egv61.png?width=1148&format=png&auto=webp&s=a0f614c1423c947ea04e152ba82fe4fa9ab74ed5\n\n&#x200B;\n\n**It’s not always like that though**. You ever seen the video of the lady making nachos with her bare hands? What about the potato chip mashed potatoes? That person who thought they were a chicken nugget? Some things are so silly or stupid you HAVE to watch it and tell your friends or leave a comment letting everyone know how stupid they are. You may or may not subscribe, but you still hang around to see what other silly thing they’re up to. Some people become successful by being controversial.\n\n&#x200B;\n\nhttps://preview.redd.it/k9895hr9egv61.png?width=576&format=png&auto=webp&s=d73baaaf2391894a3e2088b57f48bc3064da2637\n\n**And even then, it’s not always like that!** What about the videos about stray puppies and kittens that find their forever home? Military coming home videos? Helping the homeless? Y’know, the things that pull at your heart strings?\n\n&#x200B;\n\nhttps://preview.redd.it/i8c3bcpgegv61.png?width=986&format=png&auto=webp&s=d30dd5ee969b4c9e607ee2e395fcf7eba92e47bd\n\nSee what I’m saying? Multiple ways to skin a cat. Just be consistent.\n\nAndrew uploaded fairly consistently and did the usual tips and tricks with thumbnail art, titles, etc (being click baity, but hey, I think everyone does that from time to time), but I noticed **he still had very low viewership and engagemen**t. Why is that? Ultimately, a combination of things. Check out his bio again, check out all the banners and video descriptions (I have to speculate just a LITTLE here and assume he didn’t change anything recently), what do you see mentioned everywhere?\n\n**“Your guide to 6 figures in 6 months”**\n\nhttps://preview.redd.it/re52l6hnegv61.png?width=950&format=png&auto=webp&s=7842232cdd95f185672ccafa3b7bc29e2b97d975\n\n**Rapid fire answer. Do you think his channel matches that sentiment?**\n\nHere's mine: **not really**. I’ll give you an example of a channel I found from searching “6 figures in 6 months” :\n\n&#x200B;\n\nhttps://preview.redd.it/ugflhivregv61.png?width=1202&format=png&auto=webp&s=2d44bdea196301e0e124735c70d3ddf4af46da9a\n\n**Seems to mesh better with that idea, doesn’t it?** One thing Andrew mentions in this [video](https://www.youtube.com/watch?v=LBR821Ujjpo) is that starting a business can help you make 6 figures, but doesn't provide resources for running that business on his channel. Sure, Andrew has more subscribers. I’ll give you that for now (come see me later though. We’ll talk).\n\nSo then you start looking at the content and figuring out what it's actually about. Andrew starts making videos centered around **Python**. There’s a few random videos in there, but he sticks to the code in the beginning and I applaud him for not jumping with random videos when his channel didn’t pop off immediately (and that production schedule is just crazy). Some hit better than others--it’s fairly obvious when an influencer has found something that hit right because they’ll keep doing it. Then bang. The channel evolves and we start hitting the clickbait.\n\n&#x200B;\n\nhttps://preview.redd.it/k4q34ff7ggv61.png?width=992&format=png&auto=webp&s=9aad68c5749f871c307416f355b2c693b6f0bcb0\n\n3.9k views on this video. Pretty damn solid. Then you'll notice we start sliding back down to 100-500 views per video immediately after until we hit another (what I like to call) viral video and that’s where you’ll see a key difference between Andrew’s channel and Nate’s. Nate’s lowest viewership is 4k. Nate generally has more substantial comments on his videos. Do you see where I’m going with this? More subscribers isn’t always the best indication of success. Thanks Nate, you can go now.\n\n&#x200B;\n\nhttps://preview.redd.it/ly4vl8bofgv61.png?width=1189&format=png&auto=webp&s=40c74ce394d2570b3e47da6524e1181855fac0c9\n\nSo it seems like Andrew’s channel is more so centered around how you could land a 6 figure job or increase your income to 6 figures… but likely not in 6 months and maybe not 6 figures. The content just isn’t there... there isn’t a clear set of reasonable directions for the audience regarding how they can do that in SIX months in his channel.. Consistently. Yes, emphasis on consistently. I’ll give you credit for some of these earlier \"on-target\" videos although I CANNOT confirm how filling they are in relation to the channel proposition:\n\n* [How to be a Millionaire by 30: Build one of THESE in 2021](https://www.youtube.com/watch?v=G_7inET5cx8&t=244s)\n* [My Very First Job Offer was $100K+ (and so can yours)](https://www.youtube.com/watch?v=gx2pyD0NnZ0)\n* [How I Built 9 Income Sources at Age 25 (and you can too)](https://www.youtube.com/watch?v=50F1Ql_4LN0&t=579s)\n* [$100K in Passive Income in 2021 - Making Six Figures on Autopilot](https://www.youtube.com/watch?v=nByRXaTvkjU)\n\n&#x200B;\n\nBy the way, y’all ever heard of Dr. Quarters?\n\n&#x200B;\n\nhttps://preview.redd.it/5pmtr2p8hgv61.jpg?width=480&format=pjpg&auto=webp&s=97aa58581b681e022d0e9065ffe87c042fef8ddb\n\nI’ll keep it simple. This episode of King of The Hill is based on a real guy and a real trend that was more popular (or perhaps, just popular in a different form) when I was kid. These people sold the idea you could get rich quick with minimal effort (essentially click bait). Needless to say, it backfires and Kahn is stuck in a bad situation, still working at a job he hates. He got off pretty easy in the show. People in real life? Eh.\n\n**I’m not calling Andrew a get-rich-quick scam artist**. I think he has some interesting videos of value, but I do think his content is a little off kilter and **he’s not delivering what he claims he can do for you**. Normally, a channel will fall off the radar because of this..\n\nBut then, there was a **catalyst**: Gamestop.\n\nRemember how I mentioned you can see his videos hang out around relatively low views and once he creates something people like, he keeps doing it? This is a fairly common practice so don’t come with your pitchforks ready. Think about it like this:\n\nMiley Cyrus has pivoted multiple times throughout her career. Madonna. Gwen Stefani. Taylor Swift. Katy Perry. Kanye West. Pink. Y’all know 'Hot in here' by Nelly? What about his other hit 'Over and Over' with Tim McGraw?\n\nNothing new here. This has been happening since before you were born.\n\n&#x200B;\n\n[never forgetti mom's spaghetti ](https://preview.redd.it/cnjz5eeoigv61.jpg?width=640&format=pjpg&auto=webp&s=f51d687fef7529db939031fe7cabfaf6fb35a3b8)\n\n**There are a few problems with this pivot though**. Andrew was missing his proposition value to his viewers **already** and he’s further pivoting from it--this can affect how **trustworthy** and consistent he seems. I’d say this is relatively minor and easy to fix.\n\n**This becomes a much larger problem** when you examine how the content has evolved from the first GME post. I have a specific word I’d like to use, but I’m going to abstain. Let me just talk about the video and see if you see what I see.\n\nhttps://preview.redd.it/5op9u4l6jgv61.png?width=946&format=png&auto=webp&s=25ecb51fbc276664fee6f7a3cd9bad3bbfaafbba\n\nThe first video was published **February 1st, 2021**. This is post January baby squeeze. It gives you a nice, simple explanation of the Reddit vs. Wall Street situation, and basic trading concepts. This is an entry level video. This is not for the folks already in the game. In my expert opinion, I’d describe **this video as targeting the FOMO crowd** who saw the news, said “fuck, I want in” and searched for a video from a trusted source (and the use of his job title in the video is very intentional. His channel name has changed by now too) who could explain in 10 minutes or less.\n\nGood results. Can he do it again?\n\n&#x200B;\n\nhttps://preview.redd.it/4fecb7nfjgv61.png?width=958&format=png&auto=webp&s=5cf9ab03d65312c4f4d2cb566b7afe01e05c25c9\n\n**Yes**. He goes deeper into his explanation of the situation and the market as a whole and drops more resources for beginners like links to trading apps like **Webull** or **Robinhood**. Yes, Robinhood. Even after it had been put out there they had halted trading. **He removes this in later videos but it can still be found in the description and pinned comments of older videos. Do you think he isn't getting something from that?**\n\n&#x200B;\n\n[https:\\/\\/www.youtube.com\\/watch?v=a8AJNOYKkqc](https://preview.redd.it/t4ehlk88xgv61.png?width=598&format=png&auto=webp&s=4e97a982996afbe4224745c795e5868d35af5d5b)\n\n&#x200B;\n\nhttps://preview.redd.it/0cptbbozsgv61.png?width=887&format=png&auto=webp&s=770a20bc41a180446ff4ca024c143ecbd7506753\n\nWithin a week or so of posting, he hits 5k subscribers. By March, he hits 20k. By April, 70k. That’s some aggressive growth. **Of the 100+ videos that have come out since the OG video, I’ve counted ONE that caters to his original audience**. That’s fine, people are allowed to change, but you **have** to update your brand. He hasn’t though. Nothing besides \\*looks at notecard\\* editing his original video descriptions and pinned comments to include affiliate links to anything pertaining to GME, language such “tendies”, “apes”, “moon”, “moon platoon”, and “space upgrades”. Even his first video that came out a year ago.\n\n**So pretty much everything to make money.**\n\n~~(And I have to throw in another~~ **~~disclaimer~~**~~, I don’t know Andrew personally and he seems like a pretty cool dude. This isn’t an attack on him for playing the marketing game. This post is just for you guys to remember there are good shills and bad shills and everything in between. The human brain is more fragile than you think and very susceptible to manipulation especially when emotions are running high. I remember when I started investing I listened to every account out there instead of doing my research. Within 5 minutes I bought a stock, read something, sold that stock, and bought another like a true crayon muncher.)~~\n\nThe videos become more click baity as time goes on. Remember that one video I mentioned in the last paragraph? You’ll notice a significant dip in viewership. When I talk to my friends about being an influencer, I tell them that **while it might seem like a great idea to hop on a hype train to collect some followers, it winds up being very difficult to keep those followers**. Why? Because they followed you for x, not y and you can see that here. Increase in views. Increase in engagement. Increase in subscribers. Nice. Back to business. Uh oh. Didn’t do so well. Back to Gamestop.\n\n&#x200B;\n\nhttps://preview.redd.it/aj5hjntltgv61.png?width=1120&format=png&auto=webp&s=fd646e4fceb2d3a3747a57f17e725ab30315d7aa\n\nSo now you’re stuck in a cycle of HAVING to keep making videos about this topic if you want to maintain. That’s how we wind up with videos like “Should I sell Gamestop?” (**multiple times**), thumbnails with words like “crash”, “you lose”, or “game over”.\n\nAgain, I stress that the target was the FOMO crowd, the baby chimps. They don’t know any better. They need someone who doesn’t hurt their brain, keeps it short, and funny. **Do you see how all the above is dangerous for them as we move forward?**\n\nPut it this way.\n\nUsing a recent video at 68k views (and every single one of them is a new viewer).\n\nIf all of those people are holding 100 shares that’s 6,800,000 shares total.\n\nImagine he uploads a video mid squeeze with a title of “**$GME PEAKS AT $5,000??**” with a thumbnail with something like “highest it can go?” or “game over?”\n\nEveryone is emotional, they’ve never seen this much money before. They freak the hell out. They don’t want to lose that money. **They paperhand at $5k**. $GME briefly dips before skyrocketing to $20k.\n\n**Dangerous for stockholders. Dangerous for him and the future of his channel.**\n\nLet’s go back to **trust**. He’s not currently fulfilling his value proposition. He creates click bait videos. Doesn’t give credit to the folks who provide him video content (links to atobitt's biz, but not the artist of [this](https://www.reddit.com/r/GME/comments/mi08bt/heres_my_take_on_a_movie_poster_concept_for_the/) or Pixel's Endgame DD). Half-rebranding to make it **seem** like he’s a fellow ape...\n\n&#x200B;\n\nhttps://preview.redd.it/ed7d604xtgv61.png?width=1440&format=png&auto=webp&s=25fee894f682a7b8565a49536cb90b5f78f8585c\n\nHonestly, he **might** be an ape.. The problem is **he doesn’t come across genuine** because of the above--what are you willing to compromise for views and $$? Quite a few people have made comments mentioning he doesn’t appear genuine. Some people have jumped to his defense that he’s accepted feedback and is changing some things because of it (no idea what though, but then again I don't watch his channel regularly... then again... I'm a pretty good guesser) which brings me to my next point.\n\n**He’s not changing.**\n\nThe clickbait is still there. I mean, how long have we known options were a no no? Recent video with a title that suggests options are some secret ticket to tendies (because options traders know something we don’t?). He is still missing his value proposition. He is not giving written credit to folks providing him with information. \n\n&#x200B;\n\nhttps://preview.redd.it/4a1hno7augv61.png?width=217&format=png&auto=webp&s=16117ccbe99d565bfaf35668d757850aef2eb8d9\n\n**I also found out he used my DD in a video**, which was pretty cool. I didn’t know a lot about him besides watching people bicker about him on the sub, but I never personally watched. Decided to check it out.\n\n&#x200B;\n\n[that me](https://preview.redd.it/ua3tpgozlgv61.png?width=959&format=png&auto=webp&s=6f8a6405cbd5ed412f4e65ba8a3f596a236223a8)\n\nHonestly, **I was so disappointed**. **Not only in him, but shill dog as well**. What I emphasize to EVERYONE is that we better be about our shit. You know you’re doing an interview? **Brush up on your public speaking skills. You are making history** and you never know when the camera is rolling. If you ho-hum, seem unsure, or lie, the audience will know. The media will eat you alive and you destroy the credibility of the sub. You never know what opportunities will come from this either. **Be like DFV**. **No excuses**. My inbox is always open if you need help preparing for these things. Anyways.\n\nIt bothers me how big of a joke this came off. It bothers me how suspicious I was of Shill dog because of how they handled the interview--what a massive platform to be on and...woof. **It bothered me when I read a comment that said NEITHER of the people talking in this video seemed genuine.** My name is attached to this. That’s my research. My integrity is everything so **I felt a need to reach out to Andrew**. Maybe I could come on and discuss in a way that would make people feel more at ease. I messaged on twitter, radio silence. I expected that though, no big deal. Next step, bring out my old youtube channel. Check privacy settings. I leave a comment and go to bed.\n\nI wake up the next day expecting a comment or a like based upon how recently he interacted with other commenters. \n\n**My comment is gone**. I wondered if I just hadn’t actually submitted it, but I was so sure I had. Immediately became sus, but I don’t make claims without proof. I painstakingly type up the same comment. Gone within 10 minutes.\n\n&#x200B;\n\n[go see if it's there](https://preview.redd.it/rlnt4daqmgv61.jpg?width=1080&format=pjpg&auto=webp&s=62fa86027a93b7f0c62333fd3bc58291e002fa6a)\n\nI log onto another channel. I leave a comment praising him. Still up to this moment. I won't screenshot that one. Just take a guess.\n\n**That tells me everything I need to know.** \n\n**Bonus**: I found the reveal of his offer to shill odd. Many people were skeptical as well, asking why he blurred the information out the way he did, why talk so briefly about it, why not put the company out there, etc. **So I’m gonna pull a Warden on you guys: It’s either fake, it’s real and he didn’t take an offer, or it’s real and he took an offer.**\n\nIt was a live video. Often you don’t have yourself as put together as a scripted video you can reshoot and watch and edit and tweak and so on, but I want you to notice **he never said he wouldn’t take an offer**. **There was just a funky transition that he would have shill dog in the live stream to keep him straight.** If I'm just being a skeptic and he gets upset by this because it's not true, that's on him for allowing his viewers to doubt how honest of a content creator he is. \n\n**TLDR:** A majority of you will say you don't care about Andrew and never have and this is all stuff you already figured out, but there are some apes out there who still view him as their first source of information and **you are only as strong as your weakest link**. Through a brief analysis, I've shown the foundation or lack thereof behind this channel and how **AndrewMoMoney's channel is positioned for** **maximizing earnings through sensationalism. Sensationalism is a cheap way to grow your channel, but you will lose it all unless you adjust your marketing strategy and value proposition. This type of channel is potentially damaging for the squeeze. I strongly urge you to consider what media you will surround yourself with when this lifts off.**\n\n**While I have you here Andrew, might I make some suggestions?** I don't like plain criticism. We do constructive feedback around here:\n\n* Interview the people who write the DD you discuss. All of them. Not just the \"celebrities\".\n   * Use these interviews to supplement what you don't know instead of reading straight DD.\n* Make a video for your OG subscribers on how they can use GME as a catalyst for their careers--even if that's just having the extra tendies to go back to school or coast while they figure out their life.\n   * Make a video that helps apes manage their tendies--like \"how to find a CPA\", \"how to pick a lawyer\". You don't even need to pitch it as original. Give credit to the person who posted first, say it's a video adaptation, boom.\n* [Stop deleting negative comments and use them to your advantage.](https://www.businessinsider.com/5-reasons-not-to-delete-negative-reviews-2010-11)\n* Cut back on the click bait titles. You can optimize your title for the algorithm AND give your viewers a clear understanding of what the video is about.\n   * Write what the video is about in the description.\n* Get back to engaging with your subscribers like you did in the beginning.\n* Think about the social and economic repercussions of the content you're publishing.\n* ~~Wait don't take these, they're actually pretty good I might use them~~\n\n~~Please excuse typos or grammar as my eyes are burning~~",
    "title": "AndrewMoMoney Used My DD In A Live Stream Ft. Shill Sniffing Dog And Deleted My Comment, So I Analyzed His Channel",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/myryiv/andrewmomoney_used_my_dd_in_a_live_stream_ft/"
}