{
    "author": "Big-Bedroom8783",
    "created_utc": 1627322609.0,
    "distinguished": null,
    "edited": 1627415675.0,
    "id": "os4c3s",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_os4c3s",
    "num_comments": 1036,
    "permalink": "/r/GMEJungle/comments/os4c3s/the_dtc_has_put_a_chill_or_freeze_on_gamestop/",
    "score": 3034,
    "selftext": "I've just been told by my broker that the **DTC** has put a **CHILL** on **Gamestop** stock and that is why my **DRS** transfer has been suspended and is now rescheduled for a later date. Bias confirmed that cash accounts don't protect shit because the shares initially came from Computershare in DRS form to the broker. I need some wrinkles on what the fuck this is.\n\n[https://www.investor.gov/introduction-investing/investing-basics/glossary/dtc-chills-and-freezes](https://www.investor.gov/introduction-investing/investing-basics/glossary/dtc-chills-and-freezes)\n\n**EDIT:** I believe the agent **wasn't** supposed to tell me that and I spoke to the SSG back office department and told me they weren't on the chill list. **Question \" Where does one find a database that has a CHILL list of securities?\"**\n\n**EDIT 2 AND UPDATE:** To clarify when I initially opened my Fidelity account it was a cash account with no margin ever as I didn't want my shares to be lent out. This is how my account initially was opened as I transferred shares to them when I opened it.\n\nGME DRS shares went from **Computershare-> New Fidelity account** \n\nThen this is what I'm doing now GME shares from **Fidelity account -> back to Computershare** in DRS book entry form\n\nMy concern was why would it be difficult for my broker to locate shares to send back to Computershare since I had initially sent them DRS shares from Computershare into a cash account in the first place? There was a post on Linkedin by Tom Majewski (I really don't even know who he is) on July 25th titled **\"Citadel Has Been stealing From You and Gamestop\"**\n\nHere is the entire screen grab of the article from someone else as I refuse to log into places where I may get doxed somehow until this is over. But the second picture is what made me call yesterday.\n\n[Citadel Has Been stealing From You and Gamestop](https://preview.redd.it/m9xrnlzm6td71.png?width=1536&format=png&auto=webp&s=ad5764e1c531c945dc1260105061cd624602d91c)\n\nNow here is the piece that stood out to me which initiated my phone call yesterday since my shit was taking so long to transfer.\n\n[\\\\\"Hold my beer\\\\\" and What The Fuck!](https://preview.redd.it/t0ee9w387td71.jpg?width=722&format=pjpg&auto=webp&s=98acc61bfa0ba5ca1607ab88092e7c9c56d5f42c)\n\n \n\nMy DRS transfer was delayed twice and now supposed to go through on the 29th this Thursday. \n\nLast Friday I called to ask about the delay and I was told it was suspended due to unsettles trades (not true). The broker told me that was strange because I hadn't had any trades for a while and the reason was inaccurate. He said that is was then supposed to go through on Monday the 26th which is when I called yesterday and was told about the Chill thing. I'm calling now. Please give me some time to update since I think it's going to be a big challenge to have them give me a transcript of the call. If there are any lawyers in the house that can give me some direction on how to expedite and get the call recording **please reply in the comments** as it could help. ",
    "title": "The DTC has put a CHILL or FREEZE on Gamestop Stock",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/GMEJungle/comments/os4c3s/the_dtc_has_put_a_chill_or_freeze_on_gamestop/"
}