{
    "author": "basketas87",
    "created_utc": 1623363109.0,
    "distinguished": null,
    "edited": 1623372488.0,
    "id": "nx013v",
    "text_only": true,
    "flair_text": "𝗗𝗮𝘁𝗮",
    "name": "t3_nx013v",
    "num_comments": 173,
    "permalink": "/r/DDintoGME/comments/nx013v/new_data_shows_a_large_increase_of_etf_ftds/",
    "score": 1551,
    "selftext": "This post comes a bit late since the FTD data has been out for a while, but I hope it's still relevant, at least to offer some comfort after today's shenanigans.\n\nA while back I posted on r/Superstonk an analysis of the correlation between FTDs for GME and ETFs that contain GME: [https://www.reddit.com/r/Superstonk/comments/mtlfnx/statistical\\_evidence\\_for\\_targeting\\_etfs\\_for/](https://www.reddit.com/r/Superstonk/comments/mtlfnx/statistical_evidence_for_targeting_etfs_for/)\n\nSince then, I've been updating my own plots to follow the FTDs, but didn't post anything since nothing really spectacular happened in the last month regarding the FTDs. That is until now. I just added the last available data from [SEC website](https://www.sec.gov/data/foiadocsfailsdatahtm) for the first half of May. Here's the plot showing the price and the FTDs for GME and ETFs that contain GME.\n\n[FTDs for GME and GME-containing ETFs](https://preview.redd.it/ui90e9fxgi471.png?width=360&format=png&auto=webp&s=1eec773094c30f565d6d555ff8ffd3b82be48094)\n\nYou can see that in the middle of May, when the price started the current uptrend, the FTDs for GME-containing ETFs skyrocketed. It was actually higher than it was during the January squeeze. There is no significant increase in FTDs for GME, which shows that it is targeted through ETFs. Performing the same analysis as described in the aforementioned post, it is evident that the increase is specific to ETFs containing GME and not due to generally shorting all the ETFs equally. I'm eager to see what the second half of May looks like, but will have to wait a while for that data to be available. Also, the surge started on May 12th, so I wonder what will happen 21 days from May 12th or May 14th, when FTDs were at the highest level for the available data. For these two dates the T+21 is June 11th and June 15th. But please keep in mind I'm not trying to promote any dates here, just spreading the data and pointing out what we know, since we've seen price action every 21 days in the past. Also, I have no idea what effect do FTDs for ETFs have on GME, since that's how they indirectly short GME. I guess we'll just have to wait and see. And buy and hold in the meantime.\n\nedit: After [BoatImaginary1511](https://www.reddit.com/user/BoatImaginary1511/) asked in the comments about the connection to a potential transfer to Russell 1000, I looked into the data more carefully. It appears that the vast majority of the FTDs (over 4.3mil on May 14th) comes from IWM (iShares Russell 2000 ETF). Not really sure what to make  of that... Maybe somebody smarter can make a connection.\n\nedit 2: An important question I need some help with. We have some really smart people around here, I'm sure we can figure it out. So, they borrow an ETF and redeem the underlying stocks and sell GME while going long on the rest (effectively shorting GME indirectly). Then, let's say the ETF is  restructured and GME is out. Since they borrowed an ETF, they have to return an ETF, but now they don't have to pack GME into it anymore, so no need to buy it back? Maybe somebody can find some flaws in this and clarify why it wouldn't be possible.",
    "title": "New data shows a large increase of ETF FTDs",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nx013v/new_data_shows_a_large_increase_of_etf_ftds/"
}