{
    "author": "cjh11111",
    "created_utc": 1620836237.0,
    "distinguished": null,
    "edited": 1620866100.0,
    "id": "nasl5m",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_nasl5m",
    "num_comments": 181,
    "permalink": "/r/Superstonk/comments/nasl5m/holy_shit_the_vix_has_just_broke_26/",
    "score": 2526,
    "selftext": "🎵I can feel it cominggggggg in the airrrr tonighttttttttt. Oh lord🎵\n\nOhhhhh longggggg johnsonnnnnn.............Oooohhhh longggg johnsonnnnnn!!!\n\n****TL;DR:**** VIX (Volatility index) is popping rn, most since feb spike, always travels sideways until shit is going down, it went 30+ in jan spike and we are at 26.18 at the time of posting. This and the GME chart pretty much mirror each other so it’s a very good indicator to go off. 🤣🚀🚀🚀🚀🚀🚀\n\nI’m allowing myself to be jacked now, just a teeny tiny bit 😬😬 \n\nNot advice of the financials though, don’t forget that.\n\n****UPDATE:**** nearly at 27 wtf😭😭😭😭😭😭🚀🚀🚀🚀\n\n****UPDATE #2 since this has gotten some attention:**** The whole market is burning to ashes right now, the Dow Jones is down nearly 2%, that’s a near 700 dollar drop today. Nearly 2k drop if we’re counting from open yesterday when Marge possibly started to dial in citadel’s office number. Not sure if she’s calling yet though but they’re sure expecting her 😉.\n\nOh, and the VIX has now closed on 27.59 after hitting a daily high of 28.38. We haven’t seen these numbers in a long time so get buckled up, but remember.....no dates!!!🚀🚀🚀🚀 \n\n****UPDATE 3**** I’m putting this here because this is blowing the fuck up so here I go.\n\nI think Elon just dropped the biggest bomb ever on the shorts. He has now said that Tesla will not accept Bitcoin as a payment due to the environmental impact it has. THE TIMING!!!!!!!!!\n\nThis is their only way to meet their margin requirements HOLY SHIT MY TITS ARE SO JACKED!!!!!!!!!!\n\nAlso like I said earlier this isn’t financial advice, but my confirmation bias’s confirmation bias has been confirmed 1000 times, and I’m screaming rn but the S is silent. Get jacked apes why not, no dates though.\n\nBitcoin to the ground 🌍 \n\n\n****TITS R SO VERY JACKED****",
    "title": "Holy shit the VIX has just broke 26😂😂😂🚀🚀🚀🚀🚀🚀🤯🤯🤯",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nasl5m/holy_shit_the_vix_has_just_broke_26/"
}