{
    "author": "getshankedkid",
    "created_utc": 1618433656.0,
    "distinguished": null,
    "edited": 1618451085.0,
    "id": "mqzsoa",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_mqzsoa",
    "num_comments": 143,
    "permalink": "/r/GME/comments/mqzsoa/psa_be_greedy/",
    "score": 2160,
    "selftext": " **TL;DR: 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀**\n\n The people that managed to cause this whole fiasco are the among the most elite people in this world, and they're really fucking greedy. Who the fuck would buy a 238 million USD apartment? What kind of a joke is that?\n\n If you hold double, triple or quad digit shares, then BE FUCKING GREEDY. Hold this bitch like your mothers held you when you were born - DON'T LET GO. This community has proved time and time again that WE DESERVE THIS. We (as individual apes, not a collective) are NOT in this by chance. None of this was an accident on our end. The fact that we are a part of this is just the way the universe (or simulation) meant it to be.\n\n I'm sure most of you have done calculations of how much money you will have in your account at, say, 10 millies per share. I'm sure there are future billionaires among us.\n\n **YOU WILL HAVE THE POWER AND MONEY TO CHANGE THE WORLD FOR THE BETTER. AND YOU WILL NOT BE ALONE.**\n\n At night, I dream about the things that could be accomplished by people like me. I would always think that I'm worthless, that I could never change anything. That I would never be successful. I cry when I wake up, because I would dream about the tears on my mother's face after I told her she can retire.\n\n I hold for the less fortunate single digit apes to change their lives.\n\n I hold for myself and my family to change our lives.\n\n I hold for the future billionaires of this community to change the world.\n\n Fuck climate change, we'll fix it. Fuck ocean pollution, we'll fix it. Fuck COVID, we'll fix it. Fuck cancer, we'll fix it.\n\n Don't hate our world. Stick it to the greedy people that made our world be what it is, show them the way, and bring about a better future for us, our families, and generations to come.",
    "title": "PSA: BE GREEDY.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mqzsoa/psa_be_greedy/"
}