{
    "author": "hunting_snipes",
    "created_utc": 1628198263.0,
    "distinguished": null,
    "edited": 1628215969.0,
    "id": "oys2ke",
    "text_only": true,
    "flair_text": "🎮Gamestop News🛑",
    "name": "t3_oys2ke",
    "num_comments": 96,
    "permalink": "/r/GMEJungle/comments/oys2ke/prelude_to_the_great_uno_reversal_gamestop_posts/",
    "score": 1135,
    "selftext": "This is different from [Director of Finance](https://careers.gamestop.com/en-US/job/director-of-finance/J3W48S5VYCX07F6G4ZG) which is exactly what you would expect, merchandising and how the company spends its money. [Director of Financial Systems](https://careers.gamestop.com/en-US/job/director-financial-systems/J3R8HL6HN1KLKTJ4Z2K): \"...Drive visibility on process improvement opportunities that **facilitate the success of a world class accounting and finance organization**.\" and \"Assess and obtain **relevant stakeholder buy in** on the impact of proposed process/systems changes on the internal control and SOX key control environments.\" Experience in **progressive accounting** required. Their Preferred section reads like an ape honor code btw.\n\nI'm slowly putting together a DD but my tits are jacked because I sure think GameStop's \"one and only\" NFT is going to be tied to the worth of the company, then fractionalized and paired as a unit to current shares. \\[After all, their billion dollar positive net balance is basically them holding our money to use on business ventures that will make more money to return to us.\\] Squeeze happens. New class of millionaires overnight. Apes stake their new money in E T H's \\[environmentally sustainable\\] Proof-of-Stake system instead of using centralized banks, not only because of principle but because it will give a nice 8% earnings while the stock market tumbles and inflation eats away at the USD.\n\nSounds a lot like Larry Fink, CEO of BlackRock aka the world's largest investment management and who the US Gov tapped to clean up the mess of the GFC, [directly telling CEOs that net zero \"demands a transformation of the entire economy\" and the \"fundamental reallocation of capital\"](https://www.blackrock.com/corporate/investor-relations/larry-fink-ceo-letter) \\[Read the whole letter, it's great.\\]\n\nCouldn't wait to put this up but more coming soon\n\nEdit: I wanted to highlight the stakeholder buy-in because they are really focused on stakeholders, that's not proof of anything itself\n\nEditt: Wild speculation but maybe this is what DFV was pointing to in his ATM/Bank of America tweet. BoA ATM logo blurred out, GameStop logo above the ATM...\n\nEdittt: hot take, MOASS being delayed because the infrastructure bill (they’re trying to sneak in a provision to treat miners/stakers as brokers)",
    "title": "Prelude to the Great Uno Reversal: GameStop posts job listing for Director of Financial Systems",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oys2ke/prelude_to_the_great_uno_reversal_gamestop_posts/"
}