{
    "author": "rensole",
    "created_utc": 1616753878.0,
    "distinguished": null,
    "edited": 1616786854.0,
    "id": "mdlif3",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mdlif3",
    "num_comments": 1319,
    "permalink": "/r/GME/comments/mdlif3/synopsis_for_03262021_what_we_need_to_know_before/",
    "score": 17076,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\ndo you smell that?\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/tdbc1ztmbcp61.png?width=680&format=png&auto=webp&s=2bbb0d18eecd6272bdd27cf56aa8b67f688a7739\n\nNone of this is financial advice.\n\nFirst of I want to extend a thank you to the community for extending such warm and willing hand to help out others, even when faced with threats from outsiders you all stepped up to let u/heyitspixel and me know that we where never alone.\n\nSo on behalf of both of us, Thank you ! <3\n\nnow onto the news!\n\n# Dennis Kelleher\n\nFor the people who have watched \"gamestopped part 2\" mr Kelleher is a very outspoken person who was a witness in the second hearing and  Mr. Kelleher is an internationally sought expert on financial reform, financial markets, economics, regulation, legal issues, and their intersection with political matters. In addition to testifying in the U.S. Senate and House of Representatives, he speaks frequently in the U.S. and Europe on these matters at conferences, seminars and symposiums as well as on all media platforms.\n\nThis smart man is going to do an AMA with us, here on r/GME today at  1PM EST; he'll be talking  about GameStop, citsecurities, RobinhoodApp, paymentfororderflow & much more!\n\nif you have any questions be sure to be here and to be courteous, this is a very busy man but he is taking time off to speak to all of us, which I am eternally thankful for.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xi20ooeadcp61.jpg?width=640&format=pjpg&auto=webp&s=88e7695d4fc1913c743ab695ad6190639545dfcf\n\n# SEC Meeting\n\nYesterday the SEC had a closed door meeting, now in and of itself that is not weird, as far as I know this happens once a month anyway.\n\nWhat got spoken of in there is an entirely different matter.\n\nu/Conscious-Sea-5937 was kind enough to do a dive into the minutes of the meeting.\n\nas can be seen [here](https://www.reddit.com/r/GME/comments/mdegxq/re_sec_closed_meeting_today_3252021/)\n\nThe main take-aways for me in this entire thing are thankfully easy:\n\n1. this will most likely result in a criminal lawsuit, meaning it will be more than just a simple \"slap on the wrist\" they normally receive.\n2. Confidential informant protection, this means someone is most likely stepping up and they need to make sure they are protected properly (together with the Whistleblower's payment going up recently, it may mean someone has already stepped up)\n3. to me this all reads as if someone is about to be pinched.\n4. granted this could all be a coincidence that these specific things are being discussed now, but the timing is just to perfect for me personally.\n\nbut isn't it nice that at the same time Jpow has ended the Fed's infinite money glitch for banks this comes out:\n\n&#x200B;\n\nhttps://preview.redd.it/vuac9yiajcp61.png?width=640&format=png&auto=webp&s=08004dd55b953b56879d701c9335d241f553fd6c\n\nIt seems that the inf-money glitch has been patched out and they banked on it to continue, now that it doesn't they are up against a wall.... hmmmm 🤔\n\nso take away is;\n\nBank got inf money for Covid (so they wouldn't fall), Fed says nah we financially in the clear now, SEC says lol we done with your shit and then the 31st of march happens to be the last day they can lend.... not sure what will happen when that glitch of theirs ends but it's going to be a spectacle to say the least.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/tj7dzbxsecp61.png?width=982&format=png&auto=webp&s=ba95ffe026a1808ba5e3cc135e28272802062957\n\n# Save the whales\n\nOk lets do this thing \\*cracks knuckles like a geriatric\\*\n\nAs a lot of people have been posting about the long whales and why they wouldn't pull out.\n\nu/beowulf77 the oracle of Wuz, did a great deep dive into one of the biggest whales,  **Blackrock/Vanguard.**\n\n[found here](https://www.reddit.com/r/GME/comments/md89wg/king_kong_magnum_opus_dd_posted_on_behalf_of_wuz/)\n\nIt gives a bit of background as to who they are, and I would advise you to read it in full.\n\nBut to give a quick overview lets make this a bit easier to digest, like tendies.\n\nTo reform a board RC wouldn't have enough power on his own to kick people out on his own, but you know who would? RC AND Blackrock. RC has a long background with them as Blackrock where the guys who backed RC with Chewy and made sure he had the capital to begin doing what he believed in.\n\nTo reform a company you need 2 things: voting share majority and a kickass CEO.\n\nNow while RC himself can't START the proceedings to get his preferred members instated (as we have seen in yesterdays daily he needs to stay below 19.9% shares) and he can't start picking a board until 2022.\n\nBut you know who can? Blackrock, because they don't have any contract in place, they just own a lot of shares, so even though they didn't vote last year, there may have been a good reason for them to do so, because by how it looks right now they are the ones making the plays for RC so that this company didn't have to deal with a corrupt board (shown by the CFO's shot at trying to oust RC when he got in).\n\nSo TLDR, why wouldn't the whales cash out? because they see a future brighter than we can all see right now, they're most likely in close contact with RC and know his plans, they have backed him for years so why would they suddenly flip?\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/61e09yzygcp61.jpg?width=566&format=pjpg&auto=webp&s=dde7c48c2194632a7cbd6b3f3635a7660b65a3a4\n\n# DTCC Recovery and Wind Down (“R&W”) Procedure\n\nu/Leaglese did a great write-up [here](https://www.reddit.com/r/GME/comments/mdc40j/dtcc_recovery_and_wind_down_rw_procedure_dd/)\n\nNormally I'd give a section with my personal take-aways from the filings and try to give a synopsis, but u/leaglese did a hell of a job and you should read his, my take on it lines up with his as well.\n\n&#x200B;\n\nhttps://preview.redd.it/xqd2lpijhcp61.png?width=640&format=png&auto=webp&s=d0a92855c71e7d71fe6f6948764f333e7764efe9\n\n# The Glitch of 290 Million in GME Matrix!\n\n[https://www.reddit.com/r/GME/comments/md7dwo/the\\_glitch\\_of\\_290\\_million\\_in\\_gme\\_matrix\\_this\\_is/](https://www.reddit.com/r/GME/comments/md7dwo/the_glitch_of_290_million_in_gme_matrix_this_is/)\n\n&#x200B;\n\nFor over 3 days in a row we have been seeing some weird \"glitch\" on the books, with huge volumes which are multiple times the available (total) float.\n\nThe thing is people keep pinging me and asking my opinion, but I lack the technical knowledge to say this is either a bug created because they still run things on windows XP or that it's a technical indicator so I'm pinging u/wardenelite and hope he could perhaps explain this, I will also be asking mr Kelleher about this if he would perhaps know anything about this or know how we could explain this.\n\nBecause a glitch once is just a glitch, a glitch happening consecutively day after day... that is usually not a glitch.\n\nalso this ties together with:\n\n[https://www.reddit.com/r/GME/comments/mcu6et/why\\_the\\_115\\_billion\\_buy\\_order\\_was\\_not\\_a\\_bug\\_do/](https://www.reddit.com/r/GME/comments/mcu6et/why_the_115_billion_buy_order_was_not_a_bug_do/)\n\n[https://www.reddit.com/r/GME/comments/mdhxeu/i\\_found\\_nostradamus\\_guys\\_check\\_this\\_out/](https://www.reddit.com/r/GME/comments/mdhxeu/i_found_nostradamus_guys_check_this_out/)\n\n[https://www.reddit.com/r/GME/comments/mdccra/something\\_huge\\_happened\\_at\\_193434\\_edt\\_sit\\_down/](https://www.reddit.com/r/GME/comments/mdccra/something_huge_happened_at_193434_edt_sit_down/)\n\n&#x200B;\n\nAnd for the people worried about \"BUT THE MARKET CAP\"\n\n&#x200B;\n\nhttps://reddit.com/link/mdlif3/video/bocxoc71lcp61/player\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/41t9pch6lcp61.png?width=640&format=png&auto=webp&s=f7a113cd74e6d53c22cc12f09d789573e32e4838\n\nAs RC tweeted yesterday, the bears took a massive \"hit\"\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/uqsqvlnjlcp61.png?width=554&format=png&auto=webp&s=f8f866279071847ded6592b74ca43dd8a8ee270b\n\n# EXCELLENT!\n\nBe friendly, help others!\n\nas always we are here from all different walks of life and all different countries.\n\nThis doesn't matter as we are all apes in here, and apes are friends.\n\nDoesn't matter if you're a silverback a chimp or a bonobo.\n\nWe help each other, we care for each other.\n\nApe don't fight ape, apes help other apes\n\nthis helps us weed out the shills really fast, as if everyone is helpful, the ones who aren't stand out.\n\nremember the fundamentals of this company are great, they should be above the current price point, so for the love of god if someone starts with trying to spread FUD, remind yourself of the fundamentals.\n\nThere is no sense of urgency, this will come when it comes, be a week, be it a month be it six.\n\nWe don't care, just be nice and lets make this community as Excellent as we can!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/wbf7jc8mlcp61.png?width=400&format=png&auto=webp&s=8c862e23951bd5635e35ba8475996d8a0e4f6381\n\nRemember none of this is financial advice, I'm so retarded I'm not allowed to go to the zoo 'cause they'll put me in the cage with the rest of my ape brothers.\n\nIf anything happens throughout the day I will be adding it here.\n\nbackups:\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/warden\\_elite](https://twitter.com/warden_elite)\n\n[https://twitter.com/HeyItsPixel1](https://twitter.com/HeyItsPixel1)\n\nand my btc is on my profile as always.\n\n&#x200B;\n\nAnd I'll be posting updates as they happen here:\n\n&#x200B;\n\nEdit 1:\n\n[https://www.reddit.com/r/GME/comments/mdnph0/more\\_proof\\_the\\_115\\_billion\\_buy\\_order\\_was\\_real\\_and/](https://www.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/)\n\nOk seems that the 115 billion order is not a glitch... Thanks to this I feel dumb again haha, very nice write up and go's into a lot of details\n\nlove it!\n\nEdit 2:\n\n&#x200B;\n\nhttps://preview.redd.it/77c1y7lrbfp61.png?width=640&format=png&auto=webp&s=a1f1e62e5731925ddbe19eb6c6cf42d871c48127\n\n[https://www.financemagnates.com/institutional-forex/finra-slaps-275k-fine-on-citadel-securities-for-reporting-violations/](https://www.financemagnates.com/institutional-forex/finra-slaps-275k-fine-on-citadel-securities-for-reporting-violations/)\n\n&#x200B;\n\nHmmmm.... but yeah the short interest they're reporting to finra is a 100% correct right? /sarcasm",
    "title": "Synopsis for 03-26-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/mdlif3/synopsis_for_03262021_what_we_need_to_know_before/"
}