{
    "author": "Parsnip",
    "created_utc": 1626328502.0,
    "distinguished": null,
    "edited": 1626336004.0,
    "id": "okmljs",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_okmljs",
    "num_comments": 363,
    "permalink": "/r/Superstonk/comments/okmljs/diamantenhände_german_market_is_open/",
    "score": 3445,
    "selftext": "Guten Morgen to all of you Great Apes across the world! 👋🦍\n\nWhat a dip! It is clear that the short hedge funds were attacking the price mightily on a much-hyped date, but all evidence is that apes with Diamantenhände HODLed through it, and many even bought the dip. Meanwhile, reverse-repos continue to creep upward again, well ahead of the normal quarterly cycle. We've read the DD, we know that the MOASS is inevitable, and we're ready to HODL for it. They spent $80m to short the stock just this week, leading to the highest short ratios on record and an even higher floor. Let's show them our resolve.\n\nToday is the penultimate day of trading this week, Thursday, July 15th and you know what that means! GMErican Apes are (or should be!) asleep, so join other apes around the world to watch low-frequency updates from a single German exchange!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟩 120 minutes in: **$160.33 / 135,45 €**  *(volume: 5224)*\r\n- 🟥 115 minutes in: $160.22 / 135,35 €  *(volume: 5163)*\r\n- 🟥 110 minutes in: $160.51 / 135,60 €  *(volume: 4884)*\r\n- 🟩 105 minutes in: $160.75 / 135,80 €  *(volume: 4853)*\r\n- 🟥 100 minutes in: $160.22 / 135,35 €  *(volume: 4443)*\r\n- ⬜ 95 minutes in: $161.25 / 136,22 €  *(volume: 4403)*\r\n- 🟥 90 minutes in: $161.25 / 136,22 €  *(volume: 4088)*\r\n- 🟩 85 minutes in: $161.43 / 136,38 €  *(volume: 3740)*\r\n- 🟩 80 minutes in: $158.97 / 134,30 €  *(volume: 3570)*\r\n- 🟩 75 minutes in: $158.56 / 133,95 €  *(volume: 3460)*\r\n- 🟩 70 minutes in: $158.41 / 133,82 €  *(volume: 3313)*\r\n- 🟥 65 minutes in: $155.60 / 131,45 €  *(volume: 3051)*\r\n- 🟥 60 minutes in: $157.43 / 133,00 €  *(volume: 2647)*\r\n- 🟥 55 minutes in: $158.59 / 133,97 €  *(volume: 2165)*\r\n- 🟥 50 minutes in: $160.69 / 135,75 €  *(volume: 1555)*\r\n- 🟩 45 minutes in: $161.58 / 136,50 €  *(volume: 1228)*\r\n- 🟥 40 minutes in: $161.31 / 136,28 €  *(volume: 1063)*\r\n- 🟩 35 minutes in: $161.58 / 136,50 €  *(volume: 895)*\r\n- ⬜ 30 minutes in: $161.46 / 136,40 €  *(volume: 833)*\r\n- 🟩 25 minutes in: $161.46 / 136,40 €  *(volume: 808)*\r\n- ⬜ 20 minutes in: $161.37 / 136,32 €  *(volume: 733)*\r\n- 🟩 15 minutes in: $161.37 / 136,32 €  *(volume: 694)*\r\n- 🟥 10 minutes in: $160.99 / 136,00 €  *(volume: 431)*\r\n- 🟩 5 minutes in: $161.13 / 136,12 €  *(volume: 254)*\r\n- 🟥 0 minutes in: $160.99 / 136,00 €  *(volume: 230)*\r\n- 🟥 US close price: $167.62 / 141,60 €   *($158.00 / 133,48 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from a single German exchange and converting to USD. Today's euro -> USD conversion ratio is 1.18371913. There are occasionally small differences in price that are below the rounding error to two decimal places, which can lead to colorful boxes without obvious price change. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Two weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/okmljs/diamantenhände_german_market_is_open/"
}