{
    "author": "pepsodont",
    "created_utc": 1620856011.0,
    "distinguished": null,
    "edited": 1620856681.0,
    "id": "nb0cw0",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nb0cw0",
    "num_comments": 72,
    "permalink": "/r/Superstonk/comments/nb0cw0/why_its_impossible_to_lose_this_fight_the/",
    "score": 1009,
    "selftext": "THIS FIGHT CAN'T BE LOST - if apes don't sell. Zero chance of it, ZERO. ZERO 👌. You read that right, ZERO chance of a loss, ONE FUCKING HUNDRED PERCENT CHANCE OF A WIN. It's that simple.\n\nIf we don't sell, the buyer needs to offer better and better price until we're willing to sell. That's the basic principle of a short squeeze / MOASS EFFECT, right? No sale, no shorts covered, situation still needs to be fixed. Therefore, shorts must cover.\n\nBut I've heard some of you saying \"I'm not sure if I can trust others to hold\" or \"This is Prisoner's Dillema\" and shit. So let me walk you through a simulation of a bad case scenario where the retail isn't that diamond handed as they say and you'll see that it's just FUD which has been cracked open and now it's harmless. Poof, just like that.\n\nWe already know naked shorting exists, right? It's been proven by many many DDs, that's why retail holds much more shares out there than issued, probably around 200 - 500 million.\n\nLet's say for the sake of argument that it's 100 million shares apes hold (its' much more than that but let's be pessimistic alright?) The tradable float is 23 million.\n\nSo, let's imagine a pessimistic scenario of retail selling 50% of their shares on the way up.\n\n**Even if each and every retail investor sold 50% of his shares on the way up, the shorters (and then the clearing houses and DTCC, etc) would still HAVE to buy the remaining 27 million shares from retail to fix the issue, because there just can't be more shares than issued, period.**\n\nWhat would happen if some diamond-handed and balled apes REFUSED to sell? Hm?\n\nWhen somebody wants to buy a share and nobody is willing to sell, he's going to offer a higher price. And again and again and again until somebody's willing. That's the basic principle of a short squeeze that got us here and it's still the same.\n\nDo you see now? If apes weren't diamond handed (but they are and will be), even if the other non-ape retail paperhanded on the way up, there would still be enough fuel to get us to fucking Andromeda!\n\nSee what kind of situation we're in guys?\n\n**IF APES DON'T SELL, THERE IS NO WAY THIS CAN BE LOST.**\n\nNONE. ZERO. NADA. Kenny can't do shit. Government can't do shit. Nobody can't do shit IF YOU DON'T SELL.\n\nThey can't steal your shares from you. They can only buy them. AND YOU NAME THE PRICE.\n\nAnd even if retail sells 50% of their shares, doesn't fucking matter! There still will be shares that will need to be bought!\n\nDon't be afraid to trust your fellow apes. We all want this to go as high as possible. But even if other retail sells, even if some apes get scared and paperhand...doesn't matter one bit. This thing IS SO BIG IT'S LITERALLY TOO BIG TO FAIL.\n\nGet it in your heads in preparation for the MOASS EFFECT and get them tits jacked.\n\n\"TO THE FUCKING MOON. 🚀\" - Jacques Le Titts",
    "title": "🚀 WHY IT'S IMPOSSIBLE TO LOSE THIS FIGHT: THE FUDCRACKER, TOO BIG TO FAIL 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nb0cw0/why_its_impossible_to_lose_this_fight_the/"
}