{
    "author": "sydneyfriendlycub",
    "created_utc": 1626479004.0,
    "distinguished": null,
    "edited": 1626508125.0,
    "id": "olszic",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_olszic",
    "num_comments": 251,
    "permalink": "/r/GME/comments/olszic/those_options_that_expired_worthless_they_are_off/",
    "score": 1484,
    "selftext": "Hi everyone,\n\nThose OTM puts and calls from 7/16 are not in the SHF books anymore, they cant be used as collateral anymore.\n\nI know a lot of the apes were waiting for a price increase or more of the green side, but yesterday ended in the best case possible IMO, maximum max pin for the biggest chain of the year so far!\n\nNow, things make complete sense on why we are here at this point, dropping the price for the share offering, keeping the price these levels and under 200 even with that much buying pressure.\n\nThis was not just another dip, it did help us to buy more portions of the float and own more and more shares, most importantly, caused the maximum pain and bleed.\n\nNever forget that SHF use married puts and calls, also don’t forget they are also able to buy calls and they often don’t loose because they bet going up or down, but in this case, stayed in the max pain territory.\n\nThat’s a huge huge WIN for retail and apes!!\n\nNow that the biggest accumulation of shares is gone, there is no real incentive to drive the price down or keep it down.\n\nIt’s the best change to knock them down! Kick them on the teeth and watch some margin called start from today onwards.\n\nNever been so bullish!!\n\nTo the moon!! My floor remains 15mil\n\nNot financial advice, I’m a space monkey!! Buckle up!\n\n🚀🚀🚀🚀🚀🚀🚀🍉🍉",
    "title": "Those options that expired worthless? They are off their books, no longer collateral. VICTORY. We finish In max pain for the day!!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/olszic/those_options_that_expired_worthless_they_are_off/"
}