{
    "author": "memebetch6969",
    "created_utc": 1627627130.0,
    "distinguished": null,
    "edited": 1627629413.0,
    "id": "ouff0c",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ouff0c",
    "num_comments": 68,
    "permalink": "/r/Superstonk/comments/ouff0c/i_just_filled_a_complaint_with_the_sec_and_i_cant/",
    "score": 901,
    "selftext": "I didn't know you can submit the tip anonymously and that it only takes 5 minutes to fill out.\n\n&#x200B;\n\nhttps://preview.redd.it/61gsdtg3pae71.jpg?width=982&format=pjpg&auto=webp&s=dff402ad33f533d9956197e8642534b090e82538\n\n&#x200B;\n\n&#x200B;\n\n# I have been bitching for months on reddit and twitter and never once thought to go through the proper channels.  I know for a fact that someone in the SEC will at least read my complaint and I feel better about that than bitching non stop tagging them on twitter.  The process is very simple.  This is their official link:\n\n# [https://www.sec.gov/tcr](https://www.sec.gov/tcr)\n\n&#x200B;\n\nhttps://preview.redd.it/684og3bzoae71.jpg?width=996&format=pjpg&auto=webp&s=b806d3228872bf302b9341a750744be4b1591c41\n\n# The site itself says you can file just a \"complaint\" you don't have to be an insider with whistleblower level data.  I personally submitted my favorite DD reworded in my \"own words\" (only took a minute since I know this stuff off the top of my head by now)\n\nIt's actually very user friendly, this is what the layout looks like:\n\n&#x200B;\n\nhttps://preview.redd.it/wzpsmiq7pae71.jpg?width=801&format=pjpg&auto=webp&s=aea5484b02e243cb72c0e2e8e73d2157633d3607\n\n# I feel so much better now knowing that for a fact my voice will be heard, not saying they will do something about it, but they can't deny that we know what's going on when in the end of the day this shit has to be reported somewhere and logged.  It's official now, the DD is on the record.\n\n&#x200B;\n\nhttps://preview.redd.it/54hshzbhvae71.jpg?width=800&format=pjpg&auto=webp&s=36bea80b4cc958e633dd38989940109116ad0618\n\nSEC only Receives 1k complaints a year for manipulation of securities, we got the lego guy approved with 10k in a day.  Imagine if we submit, i dunno, 140% of their yearly complaints worth in a day? Someone will have to have a meeting about that.  Just saying",
    "title": "I just Filled a Complaint with the SEC and I can't believe it took me this long",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ouff0c/i_just_filled_a_complaint_with_the_sec_and_i_cant/"
}