{
    "author": "knucklesbyname",
    "created_utc": 1627672754.0,
    "distinguished": null,
    "edited": 1627692338.0,
    "id": "ourlte",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ourlte",
    "num_comments": 470,
    "permalink": "/r/Superstonk/comments/ourlte/there_are_500k_puts_at_150_strike_price_for/",
    "score": 2765,
    "selftext": "Based on the recent Credit Suisse post with 550k. puts at 150 strike price for October 15th, IN BRAZIL. Isn't sus that they are tanking the price to 150 these 3 weeks for them to exercise, somehow, 50million shares, or the equivalent in money by trading the contract?\n\n&nbsp;\n\nThey are 10 dollars away from reaching it, right?\n\n&nbsp;\n\nSource of the post: https://www.reddit.com/r/Superstonk/comments/otzu3e/posting_some_more_info_to_help_wrinkle_brains/\n\n&nbsp;\n\n*edit: For visibility. [The Chief of Compliance (Scarlatto) left Credit Suisse 2-3 months ago and there is a New Credit Suisse Chairman Antonio Horta-Osorio from Portugal who conveniently knows Portuguese.](https://www.cnbc.com/2021/07/12/credit-suisses-swiss-compliance-officer-scarlato-leaving-.html)\nIt requires more research tho... I'll keep updating it here...*\n\n&nbsp;\n\n#What does the Head of Compliance do?#\nHead of compliance:\nThe Chief Compliance Officer (CCO) The Chief Compliance Officer, one of the most important members of the management team, is primarily responsible for overseeing compliance within an organization, and ensuring compliance with laws, regulatory requirements, policies, and procedures.\nSource: google\n\n&nbsp;\n\n*edit 2: As some have pointed out. Tanking the price also means they may prevent GME from going to the S&P 500 due to the market cap. Gonna read on it.*",
    "title": "There are 500k puts at 150 strike price for October. Aren't they tanking the price to 150 on purpose for this contract?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ourlte/there_are_500k_puts_at_150_strike_price_for/"
}