{
    "author": "TurboJesus34",
    "created_utc": 1627661319.0,
    "distinguished": null,
    "edited": 1627685027.0,
    "id": "ounkiw",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ounkiw",
    "num_comments": 254,
    "permalink": "/r/Superstonk/comments/ounkiw/we_need_to_file_sec_complaints_with_the_same/",
    "score": 5835,
    "selftext": "I think sending formal complaints/tips to the SEC with the same priority as when we voted is a good idea.  \n\nFirst time posting but I’ve been here since THAT sub. I truly think that SHF are trying to suppress the idea that sending in formal complaints to the SEC won’t help.  Posts about this get buried. Which is why I am even doing this. \n\nI saw a great post (linked below with instruction on how to file a complaint) that showed how if we use their system and it shows record breaking complaints all about the same thing they have to see it.  Since people are zen and waiting anyways, why not take 5 minutes to follow the proper channels and bring it to the people who should be on our side.  Like that post said, if we can get 10k votes on LEGO we should be able to show up where it matters.  \n\nI know one cannot count on the SEC but it literally cannot hurt. Only help.  Especially with GGs recent tweet.  Might as well give them the evidence you feel they are ignoring.\n\nAn avalanche at your door is harder to ignore than a few light sprinkles of snow.  \n\nOf course, this is not financial advice. I am retarded.  Make your own decisions. \n\nLink- https://www.reddit.com/r/Superstonk/comments/ouff0c/i_just_filled_a_complaint_with_the_sec_and_i_cant/?utm_source=share&amp;amp;amp;amp;amp;amp;amp;amp;utm_medium=ios_app&amp;amp;amp;amp;amp;amp;amp;amp;utm_name=iossmf\n\nThanks u/memebetch6969\n\n\nEDIT: Some apes have made great points that we don’t want to bombard with half assed complaints as well as avoiding the “call to action” and “hive mentality” so that it can’t be used against us as collusion. I agree and reworded my post to reflect that. This is not a call to action. I’m simply stating my opinion that if people are upset with the system, to complain to the authorities that seek to regulate the system.  If you personally feel like filing a complaint then go for it! If not do whatever you want :) I’m only speaking on my own behalf here.  I wish I could change my title and remove the “we” because there is no we here. Just individual investors who like the stock.\n\nEDIT 2: as u/BellaCaseyMR pointed out, complaining to the SEC is a constitutionally protected act and shouldn’t/can’t be able to be used as evidence of market manipulation.  Provided this is true, I’m less worried about this post having a negative impact. I feel I’m in my right as an stock holder to speak on the behalf of my company. If you feel the same nice if not nice as well.  I don’t care I’m just an individual investor.\n\nEDIT 3: have seen a few requests for a template but I don’t feel comfortable providing one for two reasons.\n1. I’m smooth brain and would fuck it up \n2. I’d rather it be individual thoughts rather than a blanket hive mind copy pasta.  Feel it’s safer for us as individual investors who are constantly trying to be set up for collusion by the real manipulators.\n\nEDIT 4: For the apes who feel the SEC isn’t doing anything and are bothered. u/JY0KER pointed out you can actually file a complaint about the SEC with the Better Business Bureau. I personally feel they have been working towards some sort of investigation so I don’t think this is needed but wanted to throw it out there as he can’t post/comment due to sub restrictions.  I’m simply a messenger ape here 🦧  \n\nNo more edits I promise!",
    "title": "We need to file SEC complaints with the same priority as when we voted.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ounkiw/we_need_to_file_sec_complaints_with_the_same/"
}