{
    "author": "Parsnip",
    "created_utc": 1627019701.0,
    "distinguished": null,
    "edited": 1627027204.0,
    "id": "opw3wl",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_opw3wl",
    "num_comments": 249,
    "permalink": "/r/Superstonk/comments/opw3wl/diamantenhände_german_market_is_open/",
    "score": 3012,
    "selftext": "Guten Tag to all of you Great Apes around the world! 👋🦍\n\nYou've probably realized by now that ultra-low-volume days are among my favorite things to get excited over. I don't know why, but I just get the sense that such days represent a standoff between the Apes HODLing with Diamantenhände against the Short Hedge Funds who really, *really*, need us to paperhand but can't afford to continue shorting. Well, yesterday's volume was the lowest in over a year, and if that doesn't get you thumping your chest then maybe then maybe spend some quality time [learning about DTC-2021-010 that was recently filed](https://www.reddit.com/r/Superstonk/comments/opuziu/visual_of_the_sft_trades_to_prevent_shorts_andor/), and how it highlights the way that the SHFs are able to hide their enormous naked short positions. The days with sudden large spikes in FTDs are merely days when they weren't quite able to reset the T+2 clock on their full naked short position, and ended up reporting a small fraction of the total shares. This is a cycle that the SHFs need to repeat *daily*, and is the only reason that GME isn't on the threshold securities list. This represents a huge piece of the puzzle as to how the Short Hedge Funds are stalling the MOASS. And that, my friends, is cause for for much excitement.\n\nToday marks the end of another trading week, Friday, July 23nd and you know what that means! Join other apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- ⬜ 120 minutes in: **$181.31 / 153,97 €**  *(volume: 563)*\r\n- ⬜ 115 minutes in: $181.31 / 153,97 €  *(volume: 559)*\r\n- ⬜ 110 minutes in: $181.31 / 153,97 €  *(volume: 559)*\r\n- ⬜ 105 minutes in: $181.31 / 153,97 €  *(volume: 559)*\r\n- ⬜ 100 minutes in: $181.31 / 153,97 €  *(volume: 557)*\r\n- ⬜ 95 minutes in: $181.31 / 153,97 €  *(volume: 557)*\r\n- ⬜ 90 minutes in: $181.31 / 153,97 €  *(volume: 557)*\r\n- 🟥 85 minutes in: $181.31 / 153,97 €  *(volume: 557)*\r\n- ⬜ 80 minutes in: $181.42 / 154,07 €  *(volume: 556)*\r\n- 🟥 75 minutes in: $181.42 / 154,07 €  *(volume: 555)*\r\n- ⬜ 70 minutes in: $181.48 / 154,12 €  *(volume: 555)*\r\n- 🟥 65 minutes in: $181.48 / 154,12 €  *(volume: 555)*\r\n- ⬜ 60 minutes in: $181.54 / 154,18 €  *(volume: 535)*\r\n- 🟥 55 minutes in: $181.54 / 154,18 €  *(volume: 533)*\r\n- 🟥 50 minutes in: $181.57 / 154,20 €  *(volume: 533)*\r\n- ⬜ 45 minutes in: $181.60 / 154,22 €  *(volume: 533)*\r\n- ⬜ 40 minutes in: $181.60 / 154,22 €  *(volume: 533)*\r\n- 🟩 35 minutes in: $181.60 / 154,22 €  *(volume: 464)*\r\n- ⬜ 30 minutes in: $181.57 / 154,20 €  *(volume: 464)*\r\n- ⬜ 25 minutes in: $181.57 / 154,20 €  *(volume: 415)*\r\n- ⬜ 20 minutes in: $181.57 / 154,20 €  *(volume: 415)*\r\n- 🟥 15 minutes in: $181.57 / 154,20 €  *(volume: 354)*\r\n- ⬜ 10 minutes in: $181.63 / 154,25 €  *(volume: 332)*\r\n- 🟩 5 minutes in: $181.63 / 154,25 €  *(volume: 322)*\r\n- 🟩 0 minutes in: $181.10 / 153,80 €  *(volume: 60)*\r\n- 🟥 US close price: $178.85 / 151,89 €   *($178.90 / 151,93 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.1775. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler, following their sudden disappearance after Memorial Day. I also am worried, as I had tried to make contact many times and never received a direct response. Three weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the curator of the series. I've been serving as host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/opw3wl/diamantenhände_german_market_is_open/"
}