{
    "author": "DigitalArts",
    "created_utc": 1628011266.0,
    "distinguished": null,
    "edited": false,
    "id": "ox8703",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ox8703",
    "num_comments": 94,
    "permalink": "/r/GMEJungle/comments/ox8703/wut_doing_credit_suisse/",
    "score": 1063,
    "selftext": " \n\nHaving taken the time to actually read and digest [this report by Credit Suisse](https://www.credit-suisse.com/media/assets/corporate/docs/about-us/investor-relations/financial-disclosures/results/csg-special-committee-bod-report-archegos.pdf) and discussing it with some of the other wrinkle brains, I NEED to write this. There is gonna be SO much fucking DD coming from this report... It's 172 pages, but I promise you it's a worthwhile read and it's FUCKING RIVETING! 😂😂 Please poke holes in this, let me know what I've gotten wrong, or need to fix. This is a bit of speculation backed by data, and I'll be the first to say options aren't my forte, so swaps are an even more dark art to me. I'll do my best though because I'm pretty sure that Archegos was balls deep in shorts for GME. Now the prime brokers are holding the largest bag of excrement known, and with the vanishing puts, you just made my tits harder Credit Suisse (CS). Also, I'm gonna do something a little different and post a visual for a TL:DR...\n\n# TL:DR\n\n&#x200B;\n\n[Pretty much this.](https://preview.redd.it/o7vs4538e6f71.png?width=719&format=png&auto=webp&s=76074ffd44c11acb9c31ffa9d22a596246ae785f)\n\n&#x200B;\n\n# What Does Archegos Have To Do With GME?\n\nGlad you asked. To answer that, we need to jump to page 110 and the only part that mentions GME by name:\n\n&#x200B;\n\n[Huh... Looks like GME was involved after all](https://preview.redd.it/30rbvva9e6f71.png?width=770&format=png&auto=webp&s=7b0b2f4d12c0d034a77961eed2ff61ff88562057)\n\n&#x200B;\n\nThe footnote reads:\n\n\"116 In January 2021, an historic rally in GameStop Corp. shares sent the company’s stock price from $19 at the beginning of the year to an intraday high of $483 on January 28, a surge of over 2500%. The rally was thought to be driven in part by enthusiasm generated on internet forums. At the same time, numerous large investors held short positions in GameStop stock, and demand for shares among short investors seeking to exit their positions drove the share price even higher. Among other things, the episode highlighted the danger that concentrated exposure to the **idiosyncratic risks** **of a particular stock** could lead to significant trading losses.\"\n\nIdiosyncratic risk stuck out to me. In all my 40+ years of being alive and 7 months of trading, I've only ever heard that one other time. Coincidentally, this very situation.\n\nStraight from the proverbial horses mouth:\n\n&#x200B;\n\n[What's this? Also, note it says SINGLE security. There can be only one. 🤔](https://preview.redd.it/1t0myu7ae6f71.png?width=979&format=png&auto=webp&s=ba8d0e69fa335f7748812cde9bce4ae9907bea2c)\n\n[https://www.dtcc.com/-/media/Files/Downloads/legal/policy-and-compliance/CPMI\\_IOSCO\\_Quantitative\\_Disclosure\\_Results\\_2021\\_Q1\\_1.pdf](https://www.dtcc.com/-/media/Files/Downloads/legal/policy-and-compliance/CPMI_IOSCO_Quantitative_Disclosure_Results_2021_Q1_1.pdf)\n\n&#x200B;\n\nThis should start to make your tits tingle by this point and I'm only getting started. I've ended up writing and re-writing this section. Because there are so many layers of complexity and obscurity, you end up on different paths all the time if you're not careful. For this, I have my own theories about the rest of the situation, but please keep in mind, this is only using information from the CS report and I'd argue we'll never find out all the details.\n\n# Enter the Tiger\n\nThis is Bill. Bill has a voracious appetite for risk and credit. Bill came from Tiger Management, and the Tiger Cub created Tiger Asia and traded mostly in Asian markets. In 2012, Bill copped to insider trading and plead guilty to wire fraud culminating in being banned from Hong Kong markets in 2014. If you're rich and get caught with your hand in the cookie jar, what do you do? Create a new company of course, which is exactly what they did. They decided to name this particular phoenix that rose from the ashes Archegos Capital Management. I shit you not, this was all they needed to do to get business with CS, no questions asked.\n\n&#x200B;\n\n[Gonna tell me it's not fueled by stupidity?](https://preview.redd.it/t30fky7be6f71.png?width=1080&format=png&auto=webp&s=b65ba677a2bcf8832cb7acd96fab7de31341c65e)\n\n&#x200B;\n\nIt's important to take this in context, because good old Chad at CS was about as stupid as they come. When your job title is credit risk manager and you systematically fail at that job for years, you have to wonder how these people can be in charge of BILLIONS of dollars daily....\n\nNow that we've peeled the layer of cat shit away and we see what we're dealing with, let's see if we can find a diamond named GME in the underlying dogshit.\n\n# The Beginning of the End of Archegos\n\nNow, I'm going to repost this clip:\n\n&#x200B;\n\nhttps://preview.redd.it/p2tup2bce6f71.png?width=763&format=png&auto=webp&s=d7871865c6a0af8b2b0e9a6f7ca59e26e1be4204\n\nAlright so numbers we need to work this is $800,000,000 which would've been the height of the squeeze in Jan. Now, we're gonna take Archegos ballooning exposure and try to see if they're close. January 6, I have two different numbers. One is $46.2m and the other is $32.5m... Odd.\n\n&#x200B;\n\nhttps://preview.redd.it/c1bj3ptce6f71.png?width=778&format=png&auto=webp&s=48f5a25b15f2bef2e9928d2611007cff62ac49b3\n\nThen the very next page, 107 specifically, and we have\n\n&#x200B;\n\nhttps://preview.redd.it/4kfqo37ee6f71.png?width=799&format=png&auto=webp&s=15cf502da259e7537f8176c81693b7e65f2ccf2a\n\nThat's some hella coincidental exposure Archegos\n\nThat's where they fucked up. Me being the retard I am, I decided to go digging a bit. Now, Bill up there had a BAD habit of being SUPER concentrated in his investments. This works in our favor because it's easier to work out the numbers. Wonder why there are two different dollar amounts given? 🤔 Probably because from their own report, we can infer how many shares short they were with JUST CS.\n\nFrom their very own notes, CS took an $800m loss to THEIR portfolio during the squeeze in Jan. The reason CS took the hit, is because Bill's favored instrument was a [bullet swap](https://fincyclopedia.net/derivatives/b/bullet-swap).\n\n&#x200B;\n\nhttps://preview.redd.it/ah357e6fe6f71.png?width=829&format=png&auto=webp&s=a9450d50531aa52a2781e460c9fb086a7586284a\n\nCS and other prime brokers are actually the ones on the hook for this and why we're basically just going through the motions. The way it works, was that Bill was shorting GME through an option known as the synthetic short call. For this magic fuckery, you short 100 shares and then buy 1 atm put (😉 yeah, cos $.50 strikes are TOTALLY legit).\n\n&#x200B;\n\nhttps://preview.redd.it/1eylawwfe6f71.png?width=763&format=png&auto=webp&s=a8d51cd7e404e2e491d6535ec24d1fda2b77db27\n\n[https://www.theoptionsguide.com/synthetic-short-call.aspx](https://www.theoptionsguide.com/synthetic-short-call.aspx)\n\nSo, in this scenario, Archegos borrows a stock from a prime broker such as CS, sells that stock short, and then sells a put to that prime broker, or possibly another, no real paper trail to follow. As bullet swaps are Bills favored instrument, these would be on terms of 24 months (if you're looking for GME fuckery, start in March of 2019 as that's the first swap if it is this stock). Funny enough, Billy did this to evade taxes benefitting from the longer capital gains, even though he got the money instantly from the short sale and just paid premiums based on the underlying. I digress though.\n\nSo, let's see if we can build a narrative around the GME run up and Archegos' implosion. Note, it wasn't just GME that took them down. As they were highly concentrated, Discovery, Tencent, and Viacom all played parts in this too since their declines eroded margins as well.\n\nFor our \"control\" we're going to use CS's loss of $800m. Highest closing price to reach that, was Jan 27 with a closing price of $347.51\n\nFor reference prices, we're gonna use Yahoo\n\n[https://finance.yahoo.com/quote/GME/history](https://finance.yahoo.com/quote/GME/history)\n\n# Control: $800m and closing price of $347.51 on Jan 27\n\nLet's do the math:\n\n800,000,000 / 347.51 = 2,302,092.02 = **2,302,092 shares rounded.**\n\n# Experiment\n\n**January 06 Archegos's Potential Exposure (PE) was either $46.2m or $32.5m**\n\n&#x200B;\n\n[Closing price $18.36](https://preview.redd.it/xlnnh5pje6f71.png?width=888&format=png&auto=webp&s=2127826d3141ce45fcb31de58f23cccf68ae70ad)\n\n&#x200B;\n\nWe'll do both just to be safe.\n\n32,500,000 / 18.36 = 1,770,152.5 = 1,770,153 rounded shares short\n\n46,200,000 / 18.36 = 2,516,339.8 = **2,516,340 rounded shares short**\n\nWell that's interesting. Let's keep going\n\n&#x200B;\n\n**January 15, Archegos's PE increased to $143.6 million.**\n\n&#x200B;\n\n[$35.50 closing price](https://preview.redd.it/5rc29hfke6f71.png?width=887&format=png&auto=webp&s=7a6cef28b77f505f31f938d5766e9065ab2ffcab)\n\n&#x200B;\n\n143,600,00 / $35.50 = 4,045,070.4 = 4,045,070 rounded shares short. Wut doing Archegos?\n\nInteresting to note, 144m volume Jan 13. \\*Speculation\\* This is probably where a lot of shorts tried to exit their positions, leaving Bill with no choice but to short more.\n\n&#x200B;\n\n**January 21, Archegos's PE is $213 million**\n\n&#x200B;\n\nhttps://preview.redd.it/n2h5dqzke6f71.png?width=925&format=png&auto=webp&s=cbaa073da0f5e1f49bd32e04ba189650e768bf5e\n\n213,000,000 / 43.03 = 4,950,034.8 = 4,950,035 rounded shares short...\n\n&#x200B;\n\nNote the volumes again. If I'm right, and Bill started shorting GME back in March of 2019, he's already hopelessly over his head. My speculation is that he tried to short more. This is also when alarm bells start to ring at prime brokers. From the report, Bill's portfolio profile by his admission was roughly the same between the prime brokers involved.\n\n&#x200B;\n\n[Any familiar names there?](https://preview.redd.it/jib7jbzle6f71.png?width=801&format=png&auto=webp&s=7dc13a1f70f0652f8ec2d2e77dea63c28205269d)\n\n&#x200B;\n\n**January 26, Archegos's PE is $331.3 million**\n\n&#x200B;\n\nhttps://preview.redd.it/uj6uhvsme6f71.png?width=905&format=png&auto=webp&s=6295e499fee63a23183c75132c76d40a4818d6ae\n\n331,300,000 / 147.98 = 2,238,816.0 = 2,288,816 rounded shares short.\n\n&#x200B;\n\n**January 27, Archegos's PE is $721.3 million. GME Closing price is $347.51**\n\n721,300,000 / 347.51 = 2,075,623.7 = 2,075,624 rounded shares short.\n\n&#x200B;\n\nWell, if you look at this and assume that's all GME, you'd think they started to cover right? What if I told you the secret ingredient is crime and that's all bullshit?\n\n# GME hits historical highs and the number of junk puts starts to increase...\n\n&#x200B;\n\n[LOTS of puts taken out at $10.00 during GME's run up to ATH's](https://preview.redd.it/uqv9s44oe6f71.png?width=961&format=png&auto=webp&s=cfee8b0859e06c3940672bf17537a42670cdeb38)\n\n&#x200B;\n\n[https://www.barchart.com/stocks/quotes/GME%7C20210319%7C10.00P/interactive-chart](https://www.barchart.com/stocks/quotes/GME%7C20210319%7C10.00P/interactive-chart)\n\nAll taken out for a March 19 expiry\n\n&#x200B;\n\n[$5.00 puts, same thing](https://preview.redd.it/ei0u0dpoe6f71.png?width=985&format=png&auto=webp&s=0d7afb2c0313451ce6fcbdecbda37e1e407cb74a)\n\n&#x200B;\n\nThat's a shit load of puts taken out that day. How about everyone's favorite coming next Jan?\n\n&#x200B;\n\n[Nothing to see here...](https://preview.redd.it/cm6zw0ipe6f71.png?width=1013&format=png&auto=webp&s=b999841f3c4094c3d5c78d116ba3e480614265b2)\n\n&#x200B;\n\nWanna see something else? How about we look at the new favorite of Oct 15?\n\n[https://www.barchart.com/stocks/quotes/GME%7C20211015%7C1.00P/interactive-chart](https://www.barchart.com/stocks/quotes/GME%7C20211015%7C1.00P/interactive-chart)\n\nTaken out exactly during our run up in March\n\n&#x200B;\n\nhttps://preview.redd.it/t0ggsluue6f71.png?width=948&format=png&auto=webp&s=017b0fe4fb04ad1b6edba6e72e7c2e0937d82055\n\n[https://www.barchart.com/stocks/quotes/GME%7C20211119%7C3.00P/interactive-chart](https://www.barchart.com/stocks/quotes/GME%7C20211119%7C3.00P/interactive-chart)\n\n$3.00 puts were all the rage back in January for a november expiry too...\n\n&#x200B;\n\nhttps://preview.redd.it/7lg89c1ye6f71.png?width=982&format=png&auto=webp&s=36210e43086e9ad6325a591dda78328c2fb64a6d\n\nI could go on and on, but you get the point. Major OI increases in worthless fucking puts during every run up INCLUDING June. Disable buy buttons on Jan 28, mark shorts as long, short sell a floats worth just to keep the price in check, and now the puts are being passed around like nuclear hot potato. Is that what's going on here? And this is just ONE prime broker..\n\n&#x200B;\n\nhttps://preview.redd.it/abayd4yye6f71.png?width=1918&format=png&auto=webp&s=871b8a56d026dd349939fce4a1869d9fb7fe40e1\n\nWonder if CS gave us a glimpse of just how fucked everyone is?",
    "title": "Wut Doing Credit Suisse?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ox8703/wut_doing_credit_suisse/"
}