{
    "author": "gherkinit",
    "created_utc": 1619012844.0,
    "distinguished": null,
    "edited": 1619035473.0,
    "id": "mvg1dg",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mvg1dg",
    "num_comments": 115,
    "permalink": "/r/Superstonk/comments/mvg1dg/live_charting_with_pickle_financial_for_gme_42121/",
    "score": 817,
    "selftext": "Hey guys I just randomly decided to do this as u/WardenElite is taking a break, we'll see how it goes let me know if you like it and I can continue doing this while he is on hiatus.\n\n**I will delete previous images as the day progresses due to 20 image cap**\n\n*Questions are welcome down in the comments*\n\n**4:00** Edit 53\n\nClosed at 158.34 down 0.12% on the day. Narrating sideways chop on no volume has not been easy. Thank you guys all for tuning in I hope I didn't disappoint I had some big shoes to fill here today. Also, a huge thanks for the awards and positivity. A lot of people have been asking about streaming I am considering it here is my YouTube link for now  [https://www.youtube.com/channel/UCYmgi8psSbIWiSR2tefHbug](https://www.youtube.com/channel/UCYmgi8psSbIWiSR2tefHbug) if you want. I will probably do this for a couple more days just to get a feel for it before I go live simultaneously. I think we may see a gap up in pre-market.\n\nSee you all tomorrow!\n\n**3:55** Edit 52\n\nLook like we are gonna be closing at 158\n\n**3:51** Edit 51\n\nSo Close\n\nhttps://preview.redd.it/wdfgdklvzku61.png?width=1523&format=png&auto=webp&s=8341f61c967452a7e943c0cb68b16b4a51ce1fc0\n\n**3:36** Edit 50\n\nGME and SPY running hot together interesting\n\n**3:22** Edit 49\n\nLost the battle for VWAP to the bears buy and sell volume are still crazy low let's see if we consolidate and push again\n\nhttps://preview.redd.it/g6gswalkuku61.png?width=1355&format=png&auto=webp&s=72381b0ea3c3a15f0b17049d6429680e32097e47\n\n**3:14** Edit 48\n\nBroke out of the bear flag but volume is still awful this is probably our shot at ending up for the day\n\n&#x200B;\n\nhttps://preview.redd.it/f9lefjyctku61.png?width=1309&format=png&auto=webp&s=34faca1c82b66f553a72741c15df57412ec119a4\n\n**3:03** Edit 47\n\nSo unless we get some volume it looks like we will end the day somewhere in the 155-157 range\n\n&#x200B;\n\nhttps://preview.redd.it/6shqsqjhrku61.png?width=1379&format=png&auto=webp&s=90ab8944c640eef35044d156f410010a687b6537\n\n**2:56** Edit 46\n\nVolume coming in looks like we are gonna break that flag to the upside\n\n**2:45** Edit 45\n\nStill trending downwards bear flags can keep traveling down till we settle at resistance. We still have no volume but power hour is coming up a decent push could set us up for a nice day tomorrow\n\n&#x200B;\n\n[Better picture for clarity](https://preview.redd.it/juqv9uwrpku61.png?width=1246&format=png&auto=webp&s=ce105c8ec2ce452d9f89373054dce09d4a97b0ce)\n\n**2:30** Edit 44\n\nLooking for the bounce at 156.50\n\n**2:25** Edit 43\n\nTrending downwards now nice bear flag forming, these tend to break up\n\n&#x200B;\n\n[New image for more clarity](https://preview.redd.it/l4jo2desoku61.png?width=1246&format=png&auto=webp&s=83905b520076340fd475a07b770726b4bfcb4e52)\n\n**2:20** Edit 42\n\nThose rarely play out on the 1-minute , fortunately it looks like nobody is taking less than 157 for their shares, it also appears nobody want to buy GME for more than 157, at least right now\n\n**2:05** Edit 41\n\nThis is the cup let's see that handle\n\n&#x200B;\n\nhttps://preview.redd.it/sifijhgngku61.png?width=461&format=png&auto=webp&s=64b49e0c088c6ae295d0fefb4c3087831ea30262\n\n**2:00** Edit 40\n\nJust want break that sweet surface tension and get my tendies all gooey\n\n&#x200B;\n\nhttps://preview.redd.it/g8sqiccvfku61.png?width=220&format=png&auto=webp&s=24c0db606f91b1e924b7eb7528c87d099b1910f0\n\n**1:52** Edit 39\n\nHow much can I talk about a stock that has 7 dollars of total range in a day?\n\nAnswer: A lot, I like this stock.\n\n**1:41** Edit 38\n\nIf this uptrend breaks expect them to push down pretty hard\n\n**1:37** Edit 37\n\nYou can see the bears really don't want us to break that resistance every time we move upward they are using more and more volume to keep the price down. It's ok they only have so much ammo.\n\n&#x200B;\n\nhttps://preview.redd.it/xl4kzk48cku61.png?width=566&format=png&auto=webp&s=9e88b575c21944b10202494406ae518cf5fdf8f5\n\n**1:31** Edit 36\n\nHopefully the breakout on this wedge puts the price above VWAP before power hour I know a lot of people with options expiring tomorrow wouldn't mind seeing a nice upswing today.\n\n**1:20** Edit 35\n\nThis could be the completion of that Head and Shoulders line at the bottom is resistance. Nobody is buying but apes sure as hell aren't selling\n\n&#x200B;\n\nhttps://preview.redd.it/pgragqi19ku61.png?width=818&format=png&auto=webp&s=b9b10b6fab9f52c009b5089724f84daa1a8b4014\n\n1:16 Edit 34\n\nBreaking below on a little volume so we could see a dip to 156 or 152\n\n&#x200B;\n\nhttps://preview.redd.it/3fi9yedc8ku61.png?width=947&format=png&auto=webp&s=20592161c1150994db10c7709adfd3ddc8f675b3\n\n**1:00** Edit 33\n\nWe need a bit of volume on this bounce to crossover otherwise this is the new wedge I'm looking at\n\nhttps://preview.redd.it/m78mntob5ku61.png?width=1304&format=png&auto=webp&s=d1beeafa056784684202ac3f25cb73e90c57938c\n\n**12:51** Edit 32\n\nPossibly another dip buy, looks like a head and shoulders formed here\n\n&#x200B;\n\nhttps://preview.redd.it/jthc8am74ku61.png?width=570&format=png&auto=webp&s=730a28de9dfa8da93c075b696f89c6bc6d60fe79\n\n**12:38** Edit 31\n\n&#x200B;\n\nhttps://preview.redd.it/x6xls8id1ku61.png?width=729&format=png&auto=webp&s=7fcbc502efff869e3a92d7b167a0cf3e80816d18\n\n**12:33** Edit 30\n\nEven though the volume is low being above VWAP helps because the algorithmic /high frequency traders are more bullish above VWAP than below\n\n**12:30** Edit 29\n\nSuper technical breakdown of VWAP broke out the crayon for this\n\n&#x200B;\n\nhttps://preview.redd.it/qvbe88f10ku61.png?width=805&format=png&auto=webp&s=962457befb708f484c176d09c1bbededc519bb6a\n\n**12:26** Edit 28\n\nIf VWAP turns from resistance to support that positions GME well for a power hour test of the 175 resistance\n\n**12:21** Edit 27\n\nThis midday volume uptick is good news, testing VWAP now\n\n&#x200B;\n\nhttps://preview.redd.it/awldavaoyju61.png?width=1049&format=png&auto=webp&s=6b3a4032db5854c01308320147a1a83faed82bb6\n\n&#x200B;\n\n**12:10** Edit 26\n\n&#x200B;\n\n[Pushing for that VWAP crossover sell wall got dropped...and it's back ](https://preview.redd.it/pd0c01wcwju61.png?width=580&format=png&auto=webp&s=ea040d4d779f6b5e6154ab44f80ee92bb5a52507)\n\n**12:07** Edit 25\n\nA little better volume on these last 2 candles triangle break out occurred earlier than I expected\n\n**12:05** Edit 24\n\nUpdated triangle with possible breakout point\n\n**12:00** Edit 23\n\nThe only real sell wall is at 162 and it is minimal any amount of decent upward volume should push us through that resistance at VWAP. That little short attack has pushed us under that previous resistance I posted earlier so I will re-draw momentarily\n\n**11:55** Edit 22\n\nFor those talking about negative beta it really doesn't effect anything the S&P is mooning right now and we are pretty stagnant\n\n**11:46** Edit 21\n\nSmall volume spike on that dip I figure they want us trading in that lower channel\n\n**11:38** Edit 20\n\nWe will probably see a nice dip buy opportunity coming up if you looking for a coupon\n\n**11:26** Edit 19\n\nLooks like we need to consolidate more might break out around the x\n\n**11:24** Edit 18\n\nTesting VWAP again\n\n**11:20** Edit 17\n\nThis stock wants to move up so badly even with no volume look at it fighting the good fight\n\n**11:12** Edit 16\n\n\\*\n\n**11:05** Edit 15\n\nI wouldn't say broke out, maybe rolled of the top, either way it will be hard to break that VWAP resistance without some volume\n\n**11:00** Edit 14\n\nThat spike earlier moved us $5 on 438,389 volume we probably would be trading in that lower channel without it. Also I am using Heikin Ashi Candlesticks I prefer them for day trading.\n\n**10:55** Edit 13\n\n\\*\n\n**10:50** Edit 12\n\nJust realized my new biggest fear; this thing taking off while I'm doing this\n\n**10:45** Edit 11\n\nLook at me reading the tea leaves\n\n**10:36** Edit 10\n\nIt would be nice to cross vwap and trade in the upper channel\n\nNice little intraday wedge on the 1min chart for you guys! Slightly downward could break up\n\n**10:30** Edit 9\n\nFeel free to shoot me questions in chat I'll try to get to them\n\n**10:27** Edit 8\n\nDogi--Up--Dogi--Down Low Volume is lame\n\n**10:19** Edit 7\n\nThese are the channels I expect we will trade in Today breaking through the upper purple line could be interesting\n\n&#x200B;\n\n[Purple \\(162.50\\) Green \\(160\\) Yelllow\\(156.50\\) Red \\(152\\)](https://preview.redd.it/0mewumskcju61.png?width=1437&format=png&auto=webp&s=2c3c83822466ce36dead2414134ba17762047b43)\n\n**10:10** Edit 6\n\nMarket is recovering from that brief correction yesterday, it's strength should help us a bit\n\n&#x200B;\n\n**10:05** Edit 5\n\n&#x200B;\n\nNever used this before but it looks like some way OTM calls came in and a few deep ITM puts\n\nLottery tickets and hedges? I really don't wanna pay for premium lol.\n\n**9:58** Edit 4\n\n&#x200B;\n\nIborrow shows there were 40k at open 5k were used at opening bell to suppress spikes?\n\nThe buy-in we saw might be these 315,000 shares returned borrow rate is still up at 1.1%\n\n**9:51** Edit 3\n\nI don't have options sonar so my analysis of the options chain may be a little weaker for the AM I'll sign up now, still very low volume. RSI got blown out a bit on the one minute probably settle between 158.5 and 162.5 for the time being\n\n**9:50** Edit 2\n\nIV is low, fire sale!\n\n**9:43** Edit 1\n\nWe are quickly approaching that Pokeball day warden was speaking of but here comes that 9:50 dip on no volume. Probably more sideways chop till volume picks up\n\n*This is for entertainment purposes only and does not constitute financial advice*",
    "title": "Live Charting with Pickle Financial for GME 4/21/21",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvg1dg/live_charting_with_pickle_financial_for_gme_42121/"
}