{
    "author": "Foureyedguy",
    "created_utc": 1619032398.0,
    "distinguished": null,
    "edited": 1619044407.0,
    "id": "mvn1nm",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mvn1nm",
    "num_comments": 70,
    "permalink": "/r/Superstonk/comments/mvn1nm/smokes_mirrors_the_asymmetric_warfare_on_americas/",
    "score": 629,
    "selftext": " \n\n### tl;dr: In the United States, it now appears that ALL private, public, civil  and commercial entities depending on the trading of Securities for their existence are OWNED by Cede & Co. as the Nominee for DTC. This indicates that, effectively, America is OWNED by Cede & Co.\n\n\\*\\*\\*\\*\\*This is not my research. I came across an interesting read \\[here\\]([http://redpillreports.com/learn/who-owns-america-cede-dtcc/](http://redpillreports.com/learn/who-owns-america-cede-dtcc/)) and decided to post it for better visibility.\\*\\*\\*\\*\\*\n\nIf You Have Stocks, Bonds Or Securities, You Do Not Own Them: Cede & Co. does.  \nWho Owns Your Residential Mortgage? Cede & Co. does.  \nWho Caused The Collapse Of The American Economy? DTCC, DTC & Cede & Co. did.\n\n1. The Wall Street Stock Market System is a very well masked and very  well developed extreme system of financial Asymmetric Warfare.  \n 2. The definition of Asymmetric Warfare is the collection of protocols  used to bring down a country and its society from within without using a  preponderance of force.  \n 3. What we, as Americans, have been taught for 100 years in reality is a lie wrapped in an enigma.  \n 4. The sad and shocking reality is that NOTHING in our Country today is as it seems.\n\n \n\nhttps://preview.redd.it/46rzfh95sku61.jpg?width=566&format=pjpg&auto=webp&s=3cc25dfbc00ee5a36bb760ec58854a2997658658\n\n5. The formation of the infrastructure that has allowed the Wall  Street Stock Market System to develop began in 1913 after the meeting at  Jekyl Island and was followed by the subsequent Congressional  Legislation that lead to the Formation of the Federal Reserve.\n  \n 6. Once the Federal Reserve was formed and approved by Congress, the  groundwork was laid for the financially related Asymmetric Warfare  protocols to begin conducting the theft and confiscation of the majority  of the financial and real assets in the Country from those Americans  who have believed for the last 100 years that they were investing in the  Country by buying stocks, bonds and securities on Wall Street.  \n\n 7. The Federal Government cannot survive without the support of the Federal Reserve.  \n\n 8. The Federal Reserve is a privately owned and controlled financial Godfather.  \n\n 9. The Federal Government, through the Congress, and because of its  bureaucratic, political and character impotence, voluntarily voted to  give Legal Godfather status to the Federal Reserve.  \n\n 10. What the Congress did was exactly what the German Congress did when  they voluntarily voted to make Hitler a Dictator for life.  \n\n 11. The Federal Government does not control the Federal Reserve.  \n\n 12. The Federal Reserve controls the Federal Government.  \n\n 13. The Federal Reserve controls the Federal Government by controlling ALL the money consumed by the Federal Government.  \n\n 14. The Federal Reserve’s control of the Federal Government is  manifested by the fact that, in 100 years, the Federal Reserve has never  allowed itself to be fully audited.  \n\n 15. The Federal Reserve discloses that it is controlled by its 12 Member Banks.  \n\n 16. The question is, “Who owns and who is the controller of the 12 Member Banks?”  \n\n 17. The answer is Cede & Co., as the sole Registered Shareholder,  through its parent holding company the Depository Trust & Clearing  Corporation.  \n\n 18. Companies, including Banks, are ultimately controlled by their Shareholders not the BOD.  \n\n 19. Money, Constitutional or fiat, is the grease which without, nothing happens.  \n\n 20. The Federal Reserve, by its own disclosure, is controlled by its 12  Member banks which are owned, and therefore ultimately controlled, by  their sole Registered Shareholder, Cede & Co.  \n\n 21. Cede & Co. is the Nominee of the Depository Trust Company  through which Cede & Co. becomes the sole Registered Shareholder of  all companies trading securities on Wall Street.  \n\n 22. The Depository Trust Company is a Member of the Federal Reserve.  \n\n 23. The Depository Trust Company, with its parent holding company being  the Depository Trust & Clearing Corporation, is by far the largest  and singularly most powerful Member of the Federal Reserve.  \n\n 24. Why? Because the DTCC, through its subsidiaries ACTUALLY owns the 12 Member Banks of the Federal Reserve.  \n\n 25. Therefore, the Federal Reserve is controlled by the Holding Company DTCC.\n\n26. The great majority of all financial activity in the Country, upon  which the national economy depends, operates through, is obligated to  and is controlled by Wall Street and the Congressionally passed  Asymmetric Warfare supporting legislation that gives Wall Street the  right to do whatever it desires.\n\n\\*\\***Conclusions\\*\\***\n\n1. The Golden Rule: He who owns the gold makes the rules and has the control.  \n 2. Through its subsidiaries, the DTCC owns the majority of all private,  public, civil and commercial financial and real assets in the Country.  \n 3. The DTCC therefore EFFECTIVELY owns and, in ACTUAL REALITY controls Wall Street.  \n 4. Since the DTCC, through its subsidiary the Depository Trust Company,  is the largest controlling Member of the Federal Reserve, the DTCC  controls the Federal Reserve.  \n 5. The Federal Reserve controls the Federal Government by controlling  its access to the funds LOANED to the Federal Government every single  time the Federal Government needs so much as a single dollar.  \n 6. These funds are LOANED to the Federal Government by the PRIVATE Federal Reserve.  \n 7. The Federal Government must collateralize this debt, through its  citizens, and pay the interest on these LOANED funds to the PRIVATE and  DTCC controlled Federal Reserve.  \n 8. This is why income taxes paid by Americans are paid to the Federal  Reserve to service ONLY A PORTION of the interest on the debt owed by  the Federal Government to the PRIVATE Federal Reserve.  \n 9. Income taxes paid by Americans is insufficient to pay 100% of the  annual interest charged on the principle debt owed by the Federal  Government to the Federal Reserve.  \n 10. The principle debt owed by the Federal Government to the PRIVATE  Federal Reserve is not serviced or reduced by income taxes paid by  Americans.  \n 11. The integrity of America and what is supposed to be an open free  capitalistic financial market has been decimated by the DTCC controlled  Federal Reserve and the financial stranglehold it has on the Federal  Government.  \n 12. The breathtaking reality is that the Federal Government gave its  blessing voluntarily and legislatively to the Federal Reserve to place  this stranglehold on America and its citizens.\n\n\\*\\***Major Players\\*\\***\n\nU.S. Congress  \n Federal Reserve  \n Depository Trust & Clearing Corporation  \n Securities & Exchange Commission  \n The Depository Trust & Clearing Corporation  \n Depository Trust Company – (SRO)  \n Fixed Income Clearing Corporation – (SRO)  \n Mortgage Backed Securities Clearing Corporation  \n Cede & Co. As The Self Regulating Organization and Nominee for DTC  \n Euroclear: Formed by JP Morgan through its Brussels Morgan Guaranty Office  \n Clearstream: DTC Cohort and Collaborator in Europe\n\n\\*\\***How Much Money Are We Talking About?\\*\\***\n\nIf $1 = .0034″ Thick, Then:  \n $1,000 is 1/3″ High  \n $1 Mil is 27′ High  \n $1 Bil is 5 Miles High  \n $1 Tril is 5,178 Miles High  \n $1 Quad is 5,178,000 Miles High\n\n&#x200B;\n\n&#x200B;\n\n### **Fueling The Financial Asymmetric Warfare Plan**\n\n\\*\\*The Initial Public Offering\\*\\*\n\n1. All companies and local, State and Federal governments issuing  stock, bonds or securities does so through the Wall Street Stock Market  System and become controlled by Wall Street.  \n 2. How does Wall Street obtain the voluntarily participation by these  entities such that these entities are willing to sell their souls to  Wall Street?  \n 3. The answer is money.  \n 4. A company founder, as an  entrepreneur, starts a company and develops  a product or service that needs to be brought to market.  \n 5. The founder does not have the money to develop and grow the company.  \n 6. The largest volume of funding available to the founder is by  developing an Initial Public Offering and selling it through the Wall  Street Stock Market System.  \n 7. As the IPO document is many hundreds of pages long and is  predominantly composed of complex, contradictory and intense legalese,  the founder, may not realize what he is doing by approving for sale the  IPO developed by his legal counsel.  \n 8. Unknowingly, the founder is giving up ownership of the company he  founded in return for what is, in effect, an up-front financial payout  of future profits not yet earned.  \n 9. In many cases, this up-front payout of not yet earned future profits is the founder’s motivation.  \n 10. After the founder realizes his up-front payout, if he is contracted  to stay on as the Chairman, CEO or in another executive capacity, he  will consider this additional financial compensation as gravy.  \n 11. In many cases, after the up-front payout is realized, the founder is  effectively paid off, has made a huge profit and does not care if he  stays on with the company.  \n 12. A recent example is Facebook founder Mark Zuckerburg who, in less  than 2 hours, went from being a person of average means to being worth  $2 Billion.\n\n\\*\\***How Wall Street Gets Control\\*\\***\n\n1. Before the IPO is offered through a Wall Street exchange, the  offering company creates the original Equity stock that represents true  ownership of the company as it exists prior to the IPO being formalized  and offered for sale.  \n 2. By SEC law and Wall Street procedure, before the IPO is released for  sale, a binding contract MUST be executed with at least one Wall Street  exchange, all of which are owned and controlled by the DTCC.  \n 3. After Contract execution and prior to IPO offering release, all  original hard copy shares representing actual equity ownership of the  company must be physically delivered to the exchange(s) conducting the  IPO.  \n 4. After receipt of the original equity shares, the exchange declares itself the Sole Depository for all hard copy shares.  \n 5. The exchange is now the Legal owner of the company.  \n 6. At this point, the common man’s ability to own actual equity in the company ceases to exist.  \n 7. Pursuant to the Securities Act of 1934, the SEC notifies the exchange  that it cannot simultaneously own and trade the equity shares.  \n 8. The SEC notifies the exchange that it can transfer ownership of the equity shares to the Nominee of the exchange.  \n 9. As the sole Nominee for all exchanges, the equity shares are transferred to Cede & Co.  \n 10. Cede & Co. now becomes the Sole Registered Shareholder of the company.  \n 11. The exchange retains physical custody of the equity shares during the IPO offering period.  \n 12. Cede & Co., as the Sole Registered Shareholder and for the  purpose of giving the exchange something to sell as a shill commodity,  creates one (1) electronic only share certificate referred to as the  Street Name Stock.  \n 13. The Securities Act of 1934 as amended requires that all traded shares must be delivered to the buyer in 1 to 3 days.  \n 14. Therefore, Cede & Co., electronically trades only the Street Name Stock on the DTC- owned exchange.  \n 15. Cede & Co. trades its Street Name Stock on the exchange floor as the meeting place for all sales and trades.\n\n16. The DTC keeps its trading protocols private such that outside  parties are precluded from discovering what goes on behind closed doors  and keeps the public from becoming aware of these acts.  \n 17. By written contract, Cede & Co. may only sell its electronic  only Street Name Stock to direct and indirect Members of the DTC on the  DTC owned exchange trading floor.  \n 18. Members of DTC may only trade and sell their electronic Street Name Stock to other DTC Members or to Cede & Co.  \n 19. Therefore, this closed-loop sales system keeps the electronic Street  Name Stock in the DTC Member family and directly under the control of  Cede & Co.  \n 20. Only Cede & Co., as the Sole Registered Shareholder who actually  owns the company, can give Beneficial Ownership Rights to any  subsequent buyer.\n\n\\*\\***What Are Beneficial Ownership Rights\\*\\***\n\n1. Beneficial Ownership Rights represent the right to vote by Proxy  when that Proxy is ONLY authorized by the Registered Shareholder.  \n 2. Beneficial Ownership Rights are those revocable and cancellable  rights to receive the major portion of a dividend, if declared.  Beneficial Ownership Rights have nothing to do with Ownership of the  Actual Equity Shares that represent Actual and Perfectible Ownership in  the company.  \n 3. This extremely important clarification between Actual and Perceived  Ownership of Equity Shares representing Ownership in the company is the  basis for the Wall Street System being able to bilk and acquire most of  the wealth in the Country.  \n 4. Thousands of these transactions take place each business day are done  so in the black and go unchallenged by the American Public.  \n 5. This is the primary reason that, since the majority of the American  Public typically doesn’t read or study and is ignorant of this legal  reality, Cede & Co. has basically been able to acquire and steal the  ownership of America.  \n 6. The American Public, thinking they are buying Actual Equity Share  Ownership, is being mislead and set up just as American homebuyers were  in the Mortgage Crisis.  \n 7. Most Public Buyers accept the assurances of their Brokers and others  and never read or research to ascertain the factual reality that they  are buying NOTHING of actual collateralized value.\n\n8. Beneficial Ownership Rights provide for the revocable opportunity to receive the net majority of declared and paid dividends.  \n 9. These rights can be terminated without notification to or recourse by the common man.  \n 10. Payment of dividends pursuant to these Beneficial Ownership Rights is what keeps a financial revolution at bay.  \n 11. These Beneficial Ownership Rights can only be held, in name only, by Members of the DTC.  \n 12. The actual legal control authority over these Beneficial Ownership  Rights is maintained by Cede & Co. as the Sole Registered  Shareholder only and not to either the equity shares or the Street Name  Stock that are owned by Cede & Co.  \n 13. By written contract, Cede & Co. will only give Beneficial  Ownership Rights to those DTC Members who have purchased the Street Name  Stock from Cede & Co.  \n 14. Derivatives, as a trading commodity, are literally a figment of the imagination.  \n 15. The Street Name Stock sold to DTC Members is the 1st Derivative  since the Street Name Stock has no connection to any physical assets of  the company.  \n 16. Without the fallacious Street Name Stock being generated by Cede  & Co., there would be no Paper to sell to the public and the IPO  would generate no money.  \n 17. The public is of the belief they are buying ownership in the company but this is a lie.  \n 18. At this point, once DTC Members receive their portions of the Street Name Stock, the IPO is announced.  \n 19. DTC Members owning the Street Name Stock now sell ONLY Beneficial Ownership Rights to the public.  \n 20. The public buys the 2nd derivative, or 2nd figment of the  imagination, and receives only the revocable and cancellable Beneficial  Ownership Rights to receive the net majority of declared and paid  dividends.  \n 21. Regarding REMIC Trusts, as an example, In Exhibit 619, Page 369, Paragraph 2, it states:  \n “If issued in book-entry form, the classes of a series of certificates  will be initially issued through the book-entry facilities of The  Depository Trust Company, or DTC. No global security representing  book-entry certificates may be transferred except as a whole by DTC to a  nominee of DTC, or by a nominee of DTC to another nominee of DTC. Thus,  DTC or its nominee will be the only registered holder of the  certificates and will be considered the sole representative of the  beneficial owners of certificates for all purposes.”  \n 22. In other words, only the DTC and Cede & Co. may distribute Beneficial Ownership Rights.  \n 23. Therefore, the only Beneficial Owners, in all cases, will be the  Direct or Indirect Participants in the DTC that are completely managed,  controlled and regulated by the DTC for its own benefit.  \n 24. If the DTC ceases to be the Sole Depository of the Securities, the  following occurs in the case of a RMBS or REMIC Trust. In Exhibit 619,  Page 370, Paragraph 2, it states:  \n “Prior to any such event, beneficial owners will not be recognized by  the trustee, the master servicer, the servicer or the Certificate  Administrator as holders of the related certificates for purposes of the  pooling and servicing agreement, and beneficial owners will be able to  exercise their rights as owners of their certificates only indirectly  through DTC, participants and indirect participants.”  \n 25. Since the Holder of the Beneficial Ownership Rights is given these  rights only by the DTC and Cede & Co., the parties in the RMBS or  REMIC Trust legally CANNOT recognize Beneficial Owners as having any  Shareholder Rights in the RMBS or REMIC Trust.  \n 26. Regarding Securities, as an example, In Exhibit 42, Page 9, Paragraph 9, the World Gold Trust, L.L.C. states that:  \n “Purchases of Securities under the DTC system must be made by or through  Direct Participants, which will receive a credit for the Securities on  DTC’s records. The ownership interest of each actual purchaser of each  Security (“Beneficial Owner”) is in turn to be recorded on the Direct  and Indirect Participants’ records. Beneficial Owners will not receive  written confirmation from DTC of their purchase.”  \n 27. This is a Fraudulent representation since ONLY the Registered  Shareholder may grant Beneficial Ownership Rights. World Gold Trust,  L.L.C. clearly states that Cede & Co. is the ONLY Registered  Shareholder.\n\n### **The Control System**\n\n It is necessary to be aware of certain astounding  facts about how the Wall Street Stock Market System operates and to  realize that these facts, for decades, have been INTENTIONALLY KEPT IN  THE BLACK and away from the American Public.\n\n1. The true nature of what you, as a Public buyer of stock, is  actually buying has been intentionally and strategically kept from the  American Public for decades.  \n 2. Some of our deep Wall Street insider sources have personally told me  that they estimate that less than 0.03% (3 out of every 10,000) of  licensed professionals working on Wall Street even know about what you  are going to be informed of.  \n 3. When you buy stock, contrary to your perception and what you have  been taught, you are NOT buying an actual collateralized stock that  represents an EQUITY ownership in the company.  \n 4. When a stock is created, actual Equity Shares are developed which represent real ownership in the company.  \n 5. The Securities Exchange Act of 1934 requires an actual physical  delivery of hard copy Equity Shares transacted between the Buying and  Selling parties.  \n 6. Because this transfer is time consuming and expensive, an electronic  Book-Entry-Only System, which MERS appears to have copied and perfected  for the residential mortgage market, was established in which hard  documents are replaced by electronic files.  \n 7. Actions detrimental to the American Public take place in which actual  ownership of the company is taken by those who DID NOT pay for the  ownership position and those that DID pay have their ownership positions  stolen and are put into positions of risk about which they know  nothing.  \n 8. The physical shares representing the actual Equity Ownership in the  company are entered into the electronic Book-Entry-Only System.  \n 9. Once entered, the Brokers and Banks selling to the Public do not sell  the physical shares representing the actual Equity Ownership in the  company. They sell the electronically generated shares that are termed  Street Name Stock.  \n 10. These electronic Street Name Stocks are themselves Derivatives since  they DO NOT represent and are NOT tied to any actual Equity Asset.  \n 11. As a sale is made to a Public buyer, simultaneously, the Broker buys  the Street Name Stock for the Broker’s own trading account.  \n 12. The Public buyer actually purchases a REVOCABLE or CANCELLABLE right  to receive the largest portion of declared dividends paid. The  Corporation DOES NOT have to declare a dividend.  \n 13. Since the Broker owns the Street Name Stock for his own trading  account, the Broker actually purchases and owns the Beneficial Ownership  Rights.  \n 14. Beneficial Ownership Rights may be revoked at any time, without cause or warning, by the Registered Shareholder.  \n 15. Usually there is ONLY 1 Registered Shareholder and that is Cede & Co.  \n 16. Due to the existence of specific language contained in all Stock,  Municipal Bond, Government Securities and Mortgage Backed Securities  offering prospectuses, the Registered Shareholder becomes the actual  Stock Exchange on which the Stocks, Bonds or Securities are traded.  \n 17. All Exchanges require that all Members and Participants trading on  that Exchange designate the Exchange as the Registered Shareholder of  all traded Stocks, Bonds and Securities.  \n 18. Since all Exchanges are Private-Member-Only Organizations, they  maintain the right to decree their own rules of Membership just like a  country club.  \n 19. The Securities & Exchange Commission, under the auspices of the  Securities Exchange Act of 1934, as subsequently amended by Congress and  signed into law by the President, can designate an Exchange as a Self  Regulating Organization.  \n 20. When an Exchange becomes a Self Regulating Organization, the Federal  Government protects the Exchange in the development of the Exchange’s  own Self-Developed and Self-Enforced Rules and Regulations.  \n 21. Being a Sole Depository of shares ideally positions the Exchange to  be declared a Self Regulating Organization by the Securities &  Exchange Commission or other Federal Regulatory body.  \n 22. The Securities & Exchange Commission actually promotes Exchanges into becoming Sole Depositories.  \n 23. The Securities & Exchange Commission has endorsed the protocol  chosen by Wall Street Stock Market Controllers of placing Equity Shares  in the vaults of a Central Depository and transferring the claims  against the Depositories accounts rather than the Equity Shares  themselves.  \n 24. The Securities & Exchange Commission endorses and supports the  goal of removing the Ownership of companies from the common man on the  street who believes he is purchasing Equity Shares.  \n 25. The effect of being the Sole Depository of the actual Equity Shares  representing true Ownership in the Company is that the Exchange becomes  the Registered Shareholder of the Equity shares.  \n 26. The Securities Exchange Act of 1934 precludes an Exchange from owning the Shares it trades.  \n 27. Therefore, and this is the KEY POINT, the Exchange must  simultaneously relinquish Share Ownership to its supposedly Independent  Nominee CHOSEN by the Exchange itself.  \n 28. The Exchange-chosen Nominee becomes the equity-owning Registered  Shareholder of the company and issues the electronic Street Name Stock.  \n 29. The effect is that the Nominee that has a binding legal relationship  with the Exchange is the actual and Sole Owner of the company.  \n 30. The electronic Street Name Stock represents the GRANTING of  REVOCABLE and CANCELLABLE Beneficial Ownership Rights to Members of the  Exchange who purchase the Street Name Stock for their own trading  account.  \n 31. The Public buyer is actually buying nothing more than the REVOCABLE Non-Equity right to receive dividends, if so declared.  \n 32. Beneficial Ownership Rights may be terminated at any time without cause or notification by the Registered Shareholder.  \n 33. Neither the Public buyer nor the Members of the Exchange have any legal recourse for fraud, loss or damage.  \n 34. The Beneficial Ownership Rights can only be held by a Member of the Exchange on which the trading is done.  \n 35. Due to the existing separation between the actual Equity Shares and  the electronic Street Name Stock, the Board of Directors of the company  is not required by Federal or State law to notify the Public of any  changes in corporate Board governance or Shareholder meetings.  \n 36. The company creates Equity Shares. The Nominee of the Exchange creates the electronic Street Name Stock.  \n 37. The electronic Street Name Stock has NO relationship to the actual Equity Shares created by the company.  \n 38. The Securities & Exchange Commission approves and endorses this procedure.  \n 39. The Securities & Exchange Commission requires that the company  notify the Registered Shareholders of all changes in Corporate Board  governance and Shareholder Meetings.  \n 40. Because the Holders of the Beneficial Ownership Rights receive these  rights from the Nominee of the Exchange and NOT the company, Federal  Law mandates that the Board Of Directors cannot communicate with the  Beneficial Ownership Rights owner.  \n 41. The Securities & Exchange Commission then requires the  Registered Shareholder, being Cede & Co., to vote whether or not  they will issue Voting Proxies to the Holders of the electronic Street  Name Stock and these Holders are actually the Brokers and Banks who sold  the electronic Street Name Stock to the Public.  \n 42. Because the Public has solely purchased the right to receive a  dividend check and their identity is only known by the Brokers and Banks  who sold the electronic Street Name Stock, there is no direct  communication allowed by Federal and State law between the Public who  bought the Street Name Stock and the Board of Directors of the company.\n\n&#x200B;\n\n\\*\\***Self Regulating Organizations\\*\\***\n\n1. The Depository Trust & Clearing Corporation is a Holding  Company that owns, controls and supports 6 primary wholly-owned  Operating Subsidiaries that carry out their marching orders, insure the  ever-increasing reach and control of the DTCC and insulate the DTCC from  both public and private scrutiny.  \n 2. The DTCC is effectively the single most powerful, Government  protected and sanctioned, monopolistic Stock Market controller in the  United States and most of the World .  \n 3. These 6 DTCC subsidiaries are:  \n a. Depository Trust Company (DTC)  \n b. National Securities Clearing Corporation (NSCC)  \n c. Fixed Income Clearing Corporation (FICC)  \n d. DTCC Solutions, L.L.C.  \n e. DTCC-Deriv/SERV, L.L.C.  \n f. European Central Counter Party Limited Euro/CCP  \n 4. Through this strategically linked set of wholly-owned subsidiaries,  the DTCC controls virtually all United States and European Securities  Trading in Corporate Stocks, Municipal Bonds, Derivatives, Government  Securities and Residential Mortgage Backed Securities.  \n 5. Based on its massive trading volumes, it can be said that the DTCC  effectively controls the majority of all worldwide Securities Trading.  \n 6. In June, 1980, the Securities & Exchange Commission determined  that “Clearing Agencies… are essential to Congressional Policy to reduce  the physical movement of Securities Certificates.”  \n 7. Because Clearing Agencies use proprietary databases, the Public has  no legal right to review or analyze the contents of these databases.  Does this sound familiar with what we know about MERS?  \n 8. Therefore, the Clearing Agency can operate in the black.  \n 9. In 1983, the Depository Trust Company was given Self Regulating  Organization status by the Securities & Exchange Commission.  \n 10. This was one of the acts by the SEC that paved the way for Wall  Street to go black and continue withholding from the Public the reality  of the risks posed to the Public by the Wall Street system.  \n 11. The Securities Exchange Act of 1934, as amended by Congress and  signed into law by the President, requires all Security Broker-Dealers  to be Members of at least 1 Self- Regulating Organization.  \n 12. You may confirm this fact by reviewing 15 USC Section 78f(b)(1) and 15 USC Section 78o-3(b)(2).  \n 13. This is tantamount to being forced to join the Mafia such that you  will then be required to follow their self-made and self-regulated rules  that insure the perpetuation of the fraudulent and in the black system.  \n 14. These Rules have the FULL endorsement of the SEC and the Federal Government.  \n 15. The tradeoff to these Members by participating is that they are allowed to trade and get a paycheck.  \n 16. The United States Congress defines Self Regulating Organization Members as:  \n a. Natural persons trading on the floor.  \n b. The associated Brokerage Firm that employs the floor trader.  \n c. Any Broker or Dealer who agrees to be regulated ie. follow the mafiosi rules.  \n d. Any Broker or Dealer with whom the Exchange or Association undertakes  to enforce compliance with the provisions of the Securities Exchange  Act of 1934, the Rules and Regulations thereof and the Rules of the  Exchange.  \n 17. The Federal Government endorses these rules and requires that all  Broker-Dealers must follow these Self-Generated and Self-Regulated rules  ONLY.  \n 18. The United States Supreme Court, in Credit Suisse First Boston vs  Billing, 426 F3d 130 (2nd Circuit 2005), granted Antitrust law  compliance exemption to ALL Financial Self Regulating Organizations.  \n 19. In other words, a Government pardon has been given and immunity from  State and Federal prosecution for crimes has been granted to these Self  Regulating Organizations.  \n 20. In the wake of the Market Crash of 1929, Self Regulating  Organizations were given the authority to monitor their own compliance  and were given the legal ability, with economic incentives, to  discipline their own non-compliant Members.  \n 21. In other words, Self Regulating Organizations who operate with no  external oversight, now control and decide if any of their country club  brothers are to be disciplined.  \n 22. The 2008 Mortgage crisis cryptically tells us this policy of letting  the foxes guard the henhouse was designed to fail from the outset.  \n 23. Self Regulating Organizations are responsible for developing and  enforcing their own rules that govern the legal relationship between SRO  Members and their Public customers.  \n 24. Self Regulating Organizations are Gatekeepers. SROs develop minimum  standards for listing Securities to create a reasonable expectation that  the Securities will trade in a “Liquid Secondary Market.” If adequate  sizzle and hype are not generated to insure continued trading, the  Exchange will not allow the Securities to be traded on the floor.  \n 25. The first rule of Stock and Exchange trading is that “you must first find a bigger fool than yourself.”  \n 26. The Depository Trust Company claims its authority to operate as an SRO under 15 USC Section 78q-1.  \n 27. This is another example of the Federal Government passing  legislation which grants powerful people and entities to operate, to the  detriment of the American people, without oversight or the fear of  prosecution.  \n 28. Therefore, the door to corruption is wide open.  \n 29. The question becomes, “Who’s interest is the Federal Government working to protect?”  \n 30. The Fixed Income Clearing Corporation, a subsidiary of the DTCC, is an SRO and contains 2 wholly-owned divisions.  \n 31. The first is called the Government Securities Clearing Corporation and is a Self Regulating Organization.  \n 32. The second is called the Mortgage Backed Securities Division.  \n 33. As of May, 2010, the MBSD applied to the SEC to become a Central  Counter Party Servicer which then positions the MBSD to be classified as  an SRO in the future.  \n 34. On June 9, 2009, Larry Thompson, the General Counsel and Managing  Director of the Depository Trust & Clearing Corporation, urged  Congress to make the DTCC the Mandatory Sole Depositor and SRO for all  Over-The-Counter Derivative Trading.  \n 35. In 2008, the Over-The-Counter Derivatives market had transaction revenues of almost $700 Trillion.  \n 36. The National Securities Clearing Corporation is a subsidiary of the DTCC and is an SRO.  \n 37. All Securities Trading in the United States is effectively controlled by the DTCC.  \n 38. The NSCC clears and settles virtually all Broker-To-Broker equity,  corporate bond and municipal bond trades in the United States.  \n 39. All Securities in the United States, without the Public knowing it,  are traded between Broker-Dealers before the Public has an opportunity  to purchase ANYTHING.  \n 40. The NSCC was incorporated in 1976 to work in tandem with the DTC to  consolidate and handle the clearing and settlement of both Listed and  Over-The-Counter Securities transactions.  \n 41. This means that these 2 DTCC organizations clear and control all Securities transactions in the United States.  \n 42. This represents a true Monopoly that has been granted immunity from  prosecution under parts of US Antitrust laws by the US Supreme Court.  \n 43. The DTCC Global Trading Repository serves as the industries  preferred provider for Global Over-The-Counter Derivatives reporting.  \n 44. Therefore, the DTCC becomes an unnamed Co-Conspirator in any Racketeering.  \n 45. The DTCC Global Trading Repository holds data on more than 98% of  Credit Default Swaps, 70% of Interest Rate Derivatives and 60% of Equity  Derivatives traded Globally.  \n 46. The Mortgage Crisis of 2008 was directly caused by the improper and  illegal use of Credit Default Swaps and Interest Rate Derivatives.",
    "title": "SMOKES & MIRRORS (the Asymmetric Warfare on America's wealth)",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvn1nm/smokes_mirrors_the_asymmetric_warfare_on_americas/"
}