{
    "author": "AStepp92",
    "created_utc": 1619052610.0,
    "distinguished": null,
    "edited": 1619058161.0,
    "id": "mvtpne",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mvtpne",
    "num_comments": 731,
    "permalink": "/r/Superstonk/comments/mvtpne/t21_ftd_squeeze_is_happening/",
    "score": 5898,
    "selftext": "*******Edit 3: last edit, my post you’ll see I added incorrectly with tomorrow’s date NOT being T+21, that would be Friday 4/23! My initial post I had the 3rd squeeze date as 3/24 by mistake, therefore my day prediction is 1 day off. 4/23 would be the next FTD squeeze! ****** I AM THINKING 4/23 WE SEE SOME GREEN DILDOS\n\n*****Edit 3.1: haha damn okay, I’m seeing a lot of 4/26 being the 21st trading day after...so in my smooth brain I included the day of the run up in the calculation! Why you ask? Because it makes it work out obviously, if you don’t none of the days work..so therefore to confirm my bias I did it that way, and it worked. Haha \n\n\nWhen lambo you ask? How about tomorrow? 🤯\n\n\nI’m a little shaken up from this discovery but I’m excited to bring it to you nonetheless. This runs along side the FTD squeeze DD we seen earlier this year that had the fancy graphs and showed how the coils are tighter and tighter.\n\nWe’ve seen more DD pop up the last few days about recognizing patterns in GME trading, things I’d also noticed but unsure the connection until now (I think).. \n\nLet’s get some things out of the way, dates don’t matter, I’m not a financial advisor, and I ate crayons for dinner. I’ll hold until the end of time to bankrupt some Wall Street douche. \n\nLet’s look at some major GME dates for movement shall we? \n\n1/26 +92%\n\n2/24 +103% \n\n3/25 +53% \n\nI don’t have any shiny graphs or pictures because I’m on my phone and don’t know how to attach them  ¯\\_(ツ)_/¯ \n\nWhat do those days have in common?? \n21 TRADING days apart. You might be saying to yourself “but ape those aren’t 21 days apart!” \n\nLet us not forget the NYSE is closed to observe\n-Presidents’ Day 2/15 \n-Good Friday 4/2\nYou take those into account and my friends you have 21 days between them EXACTLY. \n\nWant to confirm your ape bias even further, let’s go back 21 days from 1/26 and look...oh man 12/28 only +4% guess the theory is out the window...except the market is closed MLK 1/18 New Year’s Day 1/1 and back into the 2020 calendar year Christmas Day...so three trading days behind 12/28? \n\n12/22 +25% and this was before retail really piled on and realized the fuckery behind these shorts.  \n\nTL/DR; GME is on a cycle of T-21 micro squeezes and each one makes the starting floor higher and higher. Aka hedgies fucked. 🚀 \n\nThe floor is $10,000,000 now Melvin, have Elon put our tendies on the next SpaceX rocket because we’re gonna be on the moon. \n\nBonus TA: I’ve noticed big price moves the day after GME ends with really tight daily candles AKA the Doji candle and today’s is just that. (Have a look at the daily candles on 2/23 and 1/12) Also we’re sitting comfortably on the 50EMA and MacD is begging to cross! i know TA doesn’t apply to GME but Algos who pick up buy signals on these TA trends might flock to GME tomorrow giving us the volume we need for another +90% day.\n\nEdit: The 3/25 move would’ve been much larger but the earnings+shorts drove price down a mega fuck ton before hand so the mild increase was hidden behind that. In my opinion\n\nEdit 2/ I know no dates and I’ll get crucified if this is wrong and idc, this is the most fun I’ve ever had in my entire life. This entire GME saga has taught me so much about the market and economy, more than any amount of education. I love making outlandish claims, eventually some shit will stick to the wall and I hope it’s this Apes’ shits",
    "title": "T+21 FTD squeeze is happening????",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvtpne/t21_ftd_squeeze_is_happening/"
}