{
    "author": "Haiupei",
    "created_utc": 1619014082.0,
    "distinguished": null,
    "edited": 1619018558.0,
    "id": "mvgg8z",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mvgg8z",
    "num_comments": 79,
    "permalink": "/r/Superstonk/comments/mvgg8z/the_super_league_and_how_it_is_connected_to_jp/",
    "score": 590,
    "selftext": "  \n\nThis morning I sat down to breakfast and read the newspaper, as I do every day. The part that interests me the most is the sports section. I am a passionate soccer fan and have been to every game in the stadium (Germany) before Covid-19. So I know what I am talking about. First of all, what does soccer in Europe have to do with Gamestop? It's simple - the media in Europe has been full of news for the last 2 days that soccer will be played in a Super League in the future. So I read the article and suddenly one name in particular sticks out in my mind. It says **J.P. Morgan** is the financier or the bank that wants to finance this project. Why this whole project seems to be canceled, I will explain this at the end of this DD. \n\nJ.P. Morgan? Yes that's right, the bank that announced just under a week ago that it was selling just under $13 billion ($16.8 billion) worth of bonds. This news was shared by several sites on 4/15 and 4/16. Whether it's good media or not remains to be seen. After all, we on Reddit all know that most of the media is bought and much of it is not accurate. However, the mass that posted this venture concludes to me that there is a real reason. In addition, this was also confirmed by many DD's. \n\n[J.P. Morgan Bonds Sell](https://preview.redd.it/h1j7rxb0aju61.png?width=605&format=png&auto=webp&s=290d22e3825d9133f6e75a6cfb9d9839f4d1e4a1)\n\nLinks: 1. [https://www.bloomberg.com/news/articles/2021-04-15/jpmorgan-to-sell-13-billion-of-bonds-in-largest-bank-sale-ever](https://www.bloomberg.com/news/articles/2021-04-15/jpmorgan-to-sell-13-billion-of-bonds-in-largest-bank-sale-ever)\n\n2. [https://www.pionline.com/markets/jp-morgan-sells-13-billion-bonds-largest-ever-bank-deal](https://www.pionline.com/markets/jp-morgan-sells-13-billion-bonds-largest-ever-bank-deal)\n\n3. [https://www.smh.com.au/business/banking-and-finance/jpmorgan-sells-16-8b-in-bonds-in-largest-bank-deal-ever-20210416-p57jqa.html](https://www.smh.com.au/business/banking-and-finance/jpmorgan-sells-16-8b-in-bonds-in-largest-bank-deal-ever-20210416-p57jqa.html)\n\nThe question I then asked myself while reading is, why do I sell bonds as a bank? Yes exactly, to make money as quickly as possible. Not just little money, a lot of money. \n\nAnd that's where the Super League comes in. I as a fan can claim that money rules and destroys soccer, but that doesn't interest the \"fan\" who is at home in front of his TV and likes to watch the sport on SkySports, DAZN, Amazon or other streaming services and wants to see the best of the best in a league. And that's the point of soccer - It's the most secure source of revenue because no matter what, someone is watching it. That's what J.P. Morgan, the bank that wants to finance this project, thought.\n\nHow much money are we talking about? 3.5 billion USD up to 4.8 billion USD. Yes, I know, dear American Apes, that is normal money for your football or baseball contracts in the TV. But for us Europeans, this is a sum that has never been paid to any club in soccer. \n\n&#x200B;\n\n[J.P. Morgan finance Super League](https://preview.redd.it/0nf47t73aju61.png?width=605&format=png&auto=webp&s=f84cc47603244080c9d19251b8d25027fee89281)\n\nLinks: \n\nEnglish: 1. [https://www.bloomberg.com/news/articles/2021-04-19/jpmorgan-bets-4-8-billion-on-disrupting-world-s-biggest-sport](https://www.bloomberg.com/news/articles/2021-04-19/jpmorgan-bets-4-8-billion-on-disrupting-world-s-biggest-sport)\n\n2. [https://www.theguardian.com/business/2021/apr/19/jp-morgan-european-super-league](https://www.theguardian.com/business/2021/apr/19/jp-morgan-european-super-league)\n\nGerman:1. [https://www.tagesschau.de/wirtschaft/super-league-jp-morgan-101.html](https://www.tagesschau.de/wirtschaft/super-league-jp-morgan-101.html)\n\n2. [https://www.sueddeutsche.de/wirtschaft/super-league-jp-morgan-finanzierung-1.5270775](https://www.sueddeutsche.de/wirtschaft/super-league-jp-morgan-finanzierung-1.5270775)\n\nNext part is all speculation on my part and should please not serve as financial advice. \n\nSo why am I as a bank selling bonds for a lot of money and trying to create a new European Super League through investments? - There is only one answer to this question and that is fast money, which is so safe that nothing can stop it.\n\nThe thing that interests me so much is why this news of the release of a Super League was published this weekend? Who is behind it? Logically, the party that wants to make money on this construct as quickly as possible and wants to get this agreement over the stage as quickly as possible - **J.P. Morgan**.\n\nWho still remembers we have seen in the night from Saturday to Sunday that several banks and hedge funds (Shitadel) work. Everyone asked the question, why work at night? What is so urgent that it can’t be discussed until Monday. Yes, exactly the banks and hedge funds know something that we can't know until now, but we are on to them and everyone is adding a new piece to the puzzle. \n\nWhat I just read on Reddit u/JustBeingPunny found out that J.P. Morgan has now already created over 17 netting accounts. You are welcome to read more about what that means at this link: https://www.reddit.com/r/Superstonk/comments/mur8bz/srdtc2021004\\_the\\_dtcc\\_and\\_jp\\_morgan\\_theyre/\n\n  \n So much is falling into place lately and more and more things are coming to light. Many stocks are collapsing AH as one can surmise that HF and banks are liquidating their positions to have money as quickly as possible. It looks like we are in for a lot of margin calls as the shorts are running out of money and bleeding but trying to keep that hidden from the public. \n\n[No caption needed](https://preview.redd.it/w5fu4eydaju61.png?width=578&format=png&auto=webp&s=d2699e097febbf75a719ae968d8a15c932dd2b73)\n\n*TLDR*: **J.P. Morgan** is trying to make money through several attempts and it looks like we are about to have a crash like 2008. I am so “jacked to the Titts” because I know they can't hold their positions much longer like they are doing right now. \n\nFunFact: The idea of the Super League was not well received by many, especially not by the organizers of other competitions in Europe. This wanted to delete all clubs and their players from all future competitions after the announcement. Many clubs are now rowing back and pulling out after a huge shitstorm. \n\nWhat does this mean? **NO REVENUE SOURCE for J.P.MORGAN**\n\nI really have no idea if this is all as connected as I think it is, but it sounds logical to me. Please leave me constructive criticism and be kind. \n\nIf I find more, or even you know more, I will be happy to edit this post:\n\nEdit 1: by u/sososhibby Definitely suspect of timing of this league announcement.  It makes no sense with teams looking to join the Super League currently in the semi finals of the champions league.  They put these teams in a bad position by not waiting to CL is complete.  They must be raising capital fast bc why put the teams who make up the league in jeopardy with the cl committee.\n\n**HODL AND MOON SOON**",
    "title": "The Super League and how it is connected to J.P. Morgan/Gamestop DD",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvgg8z/the_super_league_and_how_it_is_connected_to_jp/"
}