{
    "author": "augrr",
    "created_utc": 1619059502.0,
    "distinguished": null,
    "edited": 1619441634.0,
    "id": "mvvmvp",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mvvmvp",
    "num_comments": 850,
    "permalink": "/r/Superstonk/comments/mvvmvp/time_to_expose_the_shell_game_ftds_can_be_reset/",
    "score": 12993,
    "selftext": "# 🚀 Time to expose the shell game.\n[The Shell Game](https://imgur.com/wKBpPdI)\n###FTDs are not “reset”. FTDs on ETFs help show the short positions on the underlying securities.\n\nEdit: Each Shell Game post is intended to be read sequentially. You've been misinformed on FTDs. You'll feel great after you go through this journey with me.\n\n* [Shell Game II]( https://www.reddit.com/r/Superstonk/comments/mwnnmj/the_shell_game_revisited_how_etfs_work_and_what/)\n* [Shell Game III](https://www.reddit.com/r/Superstonk/comments/myn9vn/the_shell_game_iii_lifting_the_final_cups_for/)\n\nMany talented DD writers have theorized that FTDs are being reset using deep ITM call options and although it appears to be a credible theory that no doubt applies to many stocks, the singular attention it receives may have clouded our vision. I invite you all to take a step back and look at the raw data with me. The truth is, FTDs are a mechanism of an illiquid stock. They are an obligation on the part of the broker/dealer that carries a clear T+5 requirement to be rightfully delivered. That obligation requires that the security be purchased off the open market to be paid back within T+13 days, otherwise, the broker/dealer is restricted from accepting short sale orders from anyone else.\n\nFor more information on FTDs (“failure to delivers”), please see my entire body of work, specifically the links DD tab to get up to speed. I promise you will not regret it:\n\n* https://docs.google.com/spreadsheets/d/1VhxsUkiMEdSFybr5E4jI0iARQ6urRvVYafjZe1uLly4/edit#gid=0\n\nSpecial call-out to the ETF document from /u/turdfurg23. It has been a huge help for me. \n\n* https://docs.google.com/spreadsheets/d/1vhbn6HqmkhwHqtSj0CDNHeCNuNOp-hPcmfur0pZUuFs/edit#gid=0\n\n\n##Now these FTD obligations can be granted extensions. \n\nSee here:\nhttps://www.finra.org/rules-guidance/notices/information-notice-120120\n\n[Settlement Dates that an FTD position can extend to](https://i.imgur.com/9zq2m3T.png)\n\n\n\n \n[In my FTD document](https://docs.google.com/spreadsheets/d/1VhxsUkiMEdSFybr5E4jI0iARQ6urRvVYafjZe1uLly4/edit#gid=0), I believe I have identified the smoking gun of how these shares have been borrowed and subsequently extended against. T+5+30 (T+35) FTD obligations of IWN created massive volume-upticks on the T+35 date. In my opinion, I have proven that ETFs were used to “reset” FTDs, but I am open for arguments against it. \n\n\n#🚀 The Train of Thought.\n\n###Imagine this scenario.\n\nYou shorted GameStop in December because you have a raging FTD problem that keeps biting you in the ass every 13 days, and you MUST exit this position. Unfortunately, GME is now too expensive to short and you are running out of options.\n\n[iborrowdesk.com screenshot](https://imgur.com/2fZBxCN)\n\nSo, you call up your friend who holds the a bunch of settled GME shares in an ETF (XRT) and you borrow those to wash yourself of the FTD problem with GME. I say XRT, because look at the GME FTD rate on 12/14/2020 and then the pop of FTD rate out of nowhere from XRT on 12/16/2020!\n\n [ETFs are the timebombs they use to hide FTDs](https://imgur.com/In1pyzJ)\n\nOn 1/29/2021, the extent of that borrow becomes obvious. At least 2 million GME shares were utilized to wash someone short out of their FTD problem that they dumped onto the SPDR S&P Retail ETF.\n\nAnd the best part. The highly advertised XRT ETF was not the only one that did this on that same day. In fact, they WEREN’T EVEN THE MOST:\n\n[If you smellllllllllll. What the Rock. Is Cooking.](https://imgur.com/kUAMqDJ)\n\nBlackrock’s IWM ETF exploded without warning and then dissipated away. What is happening here?\n\n#🚀 FPL Programs and why haven’t we talked about this?\n\n\nBecause the FTD #s were just starting to become talked about in mid-to-late January in the mainstream WSB community, the shorts knew they had to rotate that FTD reporting off the \"GME\" books and hide in internal Q1 data reporting. Coincidentally, by rotating the FTD problem internally through using ETFs, this freed up A LOT of settled shares to limit the FTD problem with OR allowed to be borrowed to short again (Blackrock). \n\n###So, with that line of thinking established, we should see a clear rise in FTDs in these ETFs of anyone who is running a “FPL Program”.\n\n###What is an FPL Program?\n\nI will let this letter from Ms. Elizabeth Baird of the SEC to Kris Dailey, Vice President of the Office of Financial and Operational Risk Policy of the Financial Industry Regulatory Authority @ One World Financial Center (phew), speak for itself.\nhttps://www.sec.gov/divisions/marketreg/mr-noaction/2020/finra-fpl-20201022-15c3-3.pdf\n\n[She said it. Not me. I’m merely just a messenger](https://imgur.com/lgWvsvm)\n\n###What does this mean to an ape?\n\nhttps://www.thebalancecareers.com/sec-rule-15c3-3-1286902\n\nRule 15C3-3 established the requirement to keep enough cash and securities in a segregated account that will cover a portion of the costs of a major market move. Here is the law for review:\n\nhttps://www.law.cornell.edu/cfr/text/17/240.15c3-3\n\nTherefore, this is my interpretation of the days to come. I know dates are frowned upon, *but I believe I can call attention to the date established by the Financial Industry Regulatory Authority.*\n\n\n# 🚀 TOMORROW (DAWN OF THE FIRST DAY) April 22, 2021: \n\nThe markets will open “frothy”. All the players are aware of the collateral requirements of their own positions. Every advancement on a position your institution is not long on, is a direct attack on that another institution’s way of life. GME will be in a very precarious position. As a negative beta stock, and the biggest one of them all, all volume on long/short will influence the direction the market moves. It is both equally possible for the stock to explode with volatility we have never seen before, or it remain pinned on the Max Pain line for another day to continue to bleed off delta. In either case, the world will be watching with bated breath.\n\nAssuming there are broker/dealers out there that did not come into compliance with Rule 15c3-3 by end of trading tomorrow, they will officially be out of compliance and everyone will be looking to the SEC for action. But… if there is a broker/dealer out there right now wondering if they have enough collateral to cover tomorrow’s many hypothetical situations… you can bet your ass they are sweating bullets right now.\n\n\n\n###The “winner” of this battleground will set the collateral requirements for the “loser” as outlined here: \n[Margin is Calling](https://imgur.com/0C5FJxu)\n \n#🚀 In Conclusion\n\n\n[IT IS TIME TO COVER](https://imgur.com/6U25Mcv)\n\n \nMoon Soon.",
    "title": "🚀 Time to expose the shell game. FTDs can be \"reset\" through borrowing from ETFs. Read the Truth.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvvmvp/time_to_expose_the_shell_game_ftds_can_be_reset/"
}