{
    "author": "Relatable_Yak",
    "created_utc": 1624325076.0,
    "distinguished": null,
    "edited": 1624329125.0,
    "id": "o5avjk",
    "text_only": true,
    "flair_text": "Social Media 📲🦜",
    "name": "t3_o5avjk",
    "num_comments": 54,
    "permalink": "/r/Superstonk/comments/o5avjk/psa_fud_seeds_are_being_planted_right_now_shills/",
    "score": 670,
    "selftext": "You may not be on social media, but this isn’t just about you. This is about all apes that are, too. It is important for seasoned apes to recognize these occurrences for the ones that may totally miss this. If enough people are scared and paperhand, I’m worried it could damage the MOASS. Please correct me if I am wrong here. (Edited this blurb in post-posting)\n\n[Example](https://i.imgur.com/ZryrMkY.jpg)\n\n[Another example ](https://twitter.com/roguethelegacy/status/1407062626849509377?s=21)\n\nWe are moving into the FUD endgame. The seeds are being planted right in the open right now. We need to be vigilant and exterminate this before it gets out of control. \n\n\nI’ve seen three accounts on Twitter today alone trying to trick people into following them. These accounts have small variances to actual real, trusted and wifey known accounts. An “i” is capitalized to emulate a lowercase “L” as they are visually indistinct. Or adding a letter or misspelling the username. I’ve seen this on Twitter and I know for a fact it’s happening on YouTube and very likely Facebook (I don’t go there.) It is very important to recognize when this is happening and get these accounts reported and deleted as soon as possible. \n\nImagine a scenario, if you will:\n\nGME gets to 5K and there’s a dip down to 2K. MSM is screaming **SELL SELL YOU FOOLS! THIS IS OVER! TAKE YOUR GAINS BEFORE IT PLUMMETS!**And then you log onto social media and you forget you followed this account at one point weeks ago, you added them because oops, you thought they accidentally unfollowed you or you them so you blindly accepted their request. \n\nBut this notable account then also starts screaming “OMG MSM IS ACTUALLY RIGHT IM SELLING NOW HERE IS MY SCREENSHOT OF MY SALE WOO I LOCKED IN MY GAINS YOU SHOULD TOO!”\n\nMost people may not notice their account name is different than what it should be. People are going to see that profile picture and a tweet with lots of likes and replies. It will cause people to panic and sell, after all that hodling they endured because of a moment where they panicked from seeing who they thought was a trusted ape showing that they believed it was done and got out. Plenty of apes aren’t on here and won’t know to look out for this sort of thing, so we need to recognize it when we see it and report these accounts **now**, before they can be used against unsuspecting apes.\n\nBe vigilant. They are planting seeds for the future *now*. And they only need to trick you once, if it’s getting you to sell. Report any and all of these accounts and get them taken down. They’ll lay docile until a crucial moment, and then it will be too late. \n\nEdit/TLDR: We, the more informed apes can stop less informed apes from paperhanding from emotion and shill trickery by reporting any fake social media accounts that we encounter now, for the reasons above, instead of letting it spiral out of control. As far as I can tell, if this gets big it could potentially damage the MOASS. Please correct me if I am wrong and I will edit. \n\nEdit 2, changed around order of a paragraph because I’m smooth brained and ocd\n\n***GIVE THEM NOTHING. AND TAKE FROM THEM…EVERYTHING***",
    "title": "PSA: FUD seeds are being planted right now. Shills are creating duplicate social media accounts mimicking real apes to likely trick people with FUD at a time when emotion may have taken over",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5avjk/psa_fud_seeds_are_being_planted_right_now_shills/"
}