{
    "author": "ajquick",
    "created_utc": 1621355881.0,
    "distinguished": null,
    "edited": 1621373852.0,
    "id": "nffdtq",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nffdtq",
    "num_comments": 207,
    "permalink": "/r/Superstonk/comments/nffdtq/this_glacier_capital_stuff_could_get_this_sub/",
    "score": 1883,
    "selftext": "## Mother of all edits.\n\nThis quickly devolved into name calling which spilled over into other threads. Ape do fight ape then?\n\n\nDespite a lot of people telling me I was wrong, called out, or 'a fucking idiot shill'. No one bothered to correct the information at heart. In the original *Inconclusive* posting that I was referencing, the OP said not to visit Glacier Capital's website **so I didn't**. They said it was sketchy, so I didn't bother looking at it. If I had, I would have seen that the Glacier Capital being discussed was, at least presumably, the correct one and the contact information was available along with their letter to investors about their Gamestop position. I inadvertently assumed it was retrieved from regulatory filings or other government documents.\n\n\nThat being said. The OP of that *Inconclusive* post still looked at the phone number, called it, found out it was someone's personal cell phone, found the person who owned it and encouraged everyone to also call it. That's the type of behavior I am *calling* out in this post. That is harassment. That can get this sub shut down. All it takes is a news article about how apes were harassing a hedge fund, along with recordings of messages left on the phone for this whole thing to go south real quick. Mainstream media is already against everyone here, no one likes a doxxer, real or implied. Mainstream media doesn't need to be the truth, it just needs to be believable in order to hurt us all.\n\n## Original\n\nIt is extremely apparent that this Glacier Capital stuff was setup from the beginning. ~~No hedge fund is going to boast about their short position, advertise the price they are short at.. etc.~~ (Okay unless they are informing their investors). We know the place that published it is FUD, that's why it was banned from this sub.\n\n\nThe posts that followed are no less than a series of conspiracy theories that make the whole sub look bad:\n\n\n * It doesn't exist and here is a bunch of personal information, addresses, cell phone numbers and pages of people that may also be fake.\n * It exists but is in China and a different name? But it was registered recently?\n * It exists and is owned by Citadel?\n * It exists and is owned by Susquehanna? \n * It exists and is owned by Blackstone? (not Blackrock)\n\n\nLiterally. NONE OF THIS FUCKING MATTERS. It's FUD and it's BS. The strategy never changes, buy the stock if you like it and hold if you believe in it.  (Also vote). That's it.\n\n\nBut what is extremely important is the main ~~FUD~~ post that received thousands and thousands of awards and the mods have reported as Inconclusive is ~~full of~~ potentially Reddit rule breaking shit. We're talking ~~addresses, phone numbers and~~ encouragement to call and contact these people? Even instructions on how to get around the \"Do Not Disturb\" block. Then, post after post about people who DID call and investigate, even going to the address to take photos of the mailbox. (Which is on par with one of the greatest posts in all of this sub. APE outside of Citadel, lights on, drone, epic DD.. etc).\n\n\n**EVERYONE IS BEING PLAYED.** This is no different than an urgent call to action like we have seen in the past. Things needing to be done urgently (other than voting) are sus.\n\n\n*I think* the news will come out about these poor people being harassed and attacked (**even if it didn't actually happen**) and Reddit admins will be forced to take action against Superstonk and any other subs that pop up to replace it.\n\n\nGrow some fucking brain wrinkles apes. Stop giving a shit about Glacier Capital, ape only know buy and hold.",
    "title": "This Glacier Capital stuff could get this sub shut down.",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/Superstonk/comments/nffdtq/this_glacier_capital_stuff_could_get_this_sub/"
}