{
    "author": "Clashroyaleclanman",
    "created_utc": 1621342667.0,
    "distinguished": null,
    "edited": 1621366163.0,
    "id": "nfa1t3",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nfa1t3",
    "num_comments": 372,
    "permalink": "/r/Superstonk/comments/nfa1t3/the_dark_history_of_the_federal_reserve_and_its/",
    "score": 2288,
    "selftext": "TL;DR Repost with different title for visibility! The Fed controls our country and us in every way shape and form, nothing bad in our country has happened by accident. Money is the root of all evil. Check the video if your not a reader...[https://youtu.be/dw4xZKM9T4c](https://youtu.be/dw4xZKM9T4c)\n\nWe all know Thursday was the big \"liquidity test\". This is the infamous Rule 4(A) that has the highly anticipated change via SR-NSCC-2021-002. Rule 4(A) mandates that in times of increased trading activity around options expiration periods, no later than 5 days before options expiry, the NSCC collects Supplemental Liquidity Deposits to determine the largest liquidity need that exceeds it's resources and develop a list of the 30 or fewer contributors that how the highest liquidity exposure to the NSCC.\n\nhttps://preview.redd.it/7fr66dlflvz61.png?width=763&format=png&auto=webp&s=8e64a787621c7ae448aefc87a9ac4ff44c4a636c\n\nNow in the event that one or more of these companies show signs of liquidity shortage in their deposits, it could result in a request for an additional deposit. Now it is thought that and expected some broker/dealers have been margin called in the midst of this event because everyone is scrounging for money to present today. However, this morning we found out the Federal Reserve had to get involved, as always....\n\nhttps://preview.redd.it/gm18cjwelvz61.png?width=866&format=png&auto=webp&s=bb774fd8ca49df8b7476da4aa7de4b4b7c711979\n\nRemember when [u/Atobitt](https://www.reddit.com/u/Atobitt/) blew the lid off of the repo market and all of it's fuckery, revolving around Citadel mostly, but of course the Fed is involved in all of this! As you'll see soon, the Fed is basically involved in everything, or should I say controlling...\n\n[https://www.reddit.com/r/GME/comments/mgucv2/the\\_everything\\_short/](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[https://www.youtube.com/watch?v=1ZW4s2YPg\\_8&t=1s](https://www.youtube.com/watch?v=1ZW4s2YPg_8&t=1s)\n\nEither way, go check out their website and you'll see that Thursday, of all days, the Fed pumps about $50 Billion more than its typical average into the repo market between 10 more participating counterparties than the average. Average is about $160 billion in Treasuries amongst about 29 Participating Counterparties. I'll admit, it's not a commissioned one-of-a-kind Jerome Powell finger painting made from his own poop that says \"Hey were giving these people money to pretend like they aren't a liquidity risk to the NSCC\" but it's damn close!\n\nThis action was the finishing touch of my investigation on the Fed, their history, and their present. So go grab some popcorn, some sugary soda, some tendies if you have them and turn your phone on airplane mode. (Don't forget your tinfoil hat!)\n\nThere are billions of intellectual quotes out there and if you know me you know I love to start with a good quote, or three:\n\n\"There is something behind the throne greater than the King himself\" - Sir William Pitt\n\n\"The World is governed by very different personages from what is imagined by those who are not behind the scenes\" - Benjamin Dislaeli\n\n\"The real truth of the matter is that a financial element in the large centers has owned the government since the days of Andrew Jackson\" - Franklin D Roosevelt\n\nI think you all prolly get the point by now, but if not let's elaborate. In 1775, the American Revolutionary War started. The American Colonies fought to remove themselves from the monarchy of England. There are several reasons that the war began, but one of the most significant was when King George III outlawed the interest free, independent currency that the American colonies were producing and using for themselves, which forced the colonies to borrow money from the Central Bank of England at interest. This immediately put American Colonies in debt.\n\n&#x200B;\n\n[Sound Familiar?](https://preview.redd.it/6f3iritalvz61.png?width=259&format=png&auto=webp&s=9e9ed50bda5e714ffdcac56d710ce463440f1d6d)\n\nFlash forward to 1783, America has won it's Independence from England! However, it's battle with the Central Bank (CB) concept and the corruption associated with it had just begun. Just in case I am leaving so of you behind, a CB is an institution that manages the [currency](https://en.wikipedia.org/wiki/Currency) and [monetary policy](https://en.wikipedia.org/wiki/Monetary_policy) of a [state](https://en.wikipedia.org/wiki/State_(polity)) or formal monetary union. Based on historical precedent, a CB has two major forms of power: **Interest Rates** and **Inflation** (Money Supply).\n\nHowever, a CB does not simply supply a government's economy with money, **it loans it to them at interest!!!** By increasing and decreases the supply of money the CB regulates the value of the currency they are lending. So, let's make this clear, the Fed **loans** the US money, tells them the amount they must pay back and when, and also at the same time determines that money's worth......how was this ever possibly imagined to be a good idea?!\n\nBut wait there's more... A system like this can only produce one thing in the future, **DEBT!** This isn't that hard to figure out either. Every single dollar produced by a CB is loaned **AT INTEREST** to a nation\\*\\*,\\*\\* which means every single dollar produced equals **one dollar plus the percentage of that dollar's debt** that is brought on by the interest it holds. Since, the CB has a monopoly over that nation's currency and they loan each dollar out with an immediate debt attached to it, where the hell does the money to pay off the debt come from? The answer: The CENTRAL BANK! This means that the CB must perpetually increase the money supply to temporary cover the outstanding debt they've created, which is also loaned out at interest creating even more debt! At never ending viscous cycle of DEBT, DEBT and you guessed it MORE DEBT.\n\nThe end result of this system, slavery, because it is impossible to ever get out of the self generated debt. Yes, I know this is a touchy subject but true none the less. The government, our government, is a slave to our CB, the Federal Reserve and thus we are too.\n\n&#x200B;\n\nhttps://preview.redd.it/koa4f989lvz61.png?width=281&format=png&auto=webp&s=5cef36e00e97e159a5d2245a667eaa209aa868a3\n\nOur Founding Fathers knew this! They fought a war to get away from it!\n\n&#x200B;\n\nhttps://preview.redd.it/ig5rdek8lvz61.png?width=301&format=png&auto=webp&s=591db6e333fac788cfe63565beeb9b3bc0e8121a\n\nBy the early 20th Century, America had already implemented and removed a few CB systems that were swindled into action by ruthless banking interests. Following that time period, the dominate families in the Business and Banking world were those of John D Rockefeller, JP Morgan, Paul Warburg, and Baron Rothschild to name a few. All of which are very notable to this day. In the early 1900s, these powerful families came together to push forth legislation for another CB. However, the government and public were very wary of such institutions so they needed to create a need for such a system to affect public opinion to increase their chances of success. JP Morgan, the most influential and respected finance related individual of his time, exploited his position by publishing rumors that the prominent bank in New York was bankrupt, which caused mass hysteria and effected other banks as well.\n\nFear, Uncertainty and Doubt is NOT a new tactic!\n\nThe public in masses began rushing to their banks to withdraw their money in fear of losing everything, which forced the banks to call in their loans. This forced a mass sell off of property that resulted in domino effect of bankruptcies and repossessions. A few years later, all the pieces were put together by Fredrik Allen of Life Magazine wrote, \"The Morgan interests took advantage of the unsettled conditions during the autumn of 1907 to precipitate the panic, guiding it shrewdly as it progressed so that it would kill off rival banks and consolidate the preeminence of the banks within the Morgan orbit\"\n\n[https://books.google.com/books?id=IE4EAAAAMBAJ&pg=PA126&lpg=PA126&dq=the+morgan+interests+took+advantage+to+precipitate+the+panic&source=bl&ots=AzbhWb0GD3&sig=ACfU3U2fD0AbTw62nvQEnmUEdgASsESPSw&hl=en&sa=X&ved=2ahUKEwibzKn6mcfwAhXBGc0KHYrkDiMQ6AEwAnoECAcQAw#v=onepage&q=the%20morgan%20interests%20took%20advantage%20to%20precipitate%20the%20panic&f=false](https://books.google.com/books?id=IE4EAAAAMBAJ&pg=PA126&lpg=PA126&dq=the+morgan+interests+took+advantage+to+precipitate+the+panic&source=bl&ots=AzbhWb0GD3&sig=ACfU3U2fD0AbTw62nvQEnmUEdgASsESPSw&hl=en&sa=X&ved=2ahUKEwibzKn6mcfwAhXBGc0KHYrkDiMQ6AEwAnoECAcQAw#v=onepage&q=the%20morgan%20interests%20took%20advantage%20to%20precipitate%20the%20panic&f=false)\n\nThis led to a Congressional investigation led by Senator Nelson Aldrich would had intimate ties to the banking interests and later married into the Rockefeller family. Through this hearing a CB was recommended to avoid such an event from happening again. Shortly after in 1910, a secret meeting was held at a Morgan estate on Jekyll Island where the Federal Reserve Act was written by bankers. Once written, they gave this legislation to Nelson Aldrich to push through Congress.\n\n&#x200B;\n\nhttps://preview.redd.it/03sj82f7lvz61.png?width=281&format=png&auto=webp&s=14c5a908d67c27939e7eae410a960c204ca1bc7a\n\nIn 1913, Woodrow Wilson was elected at the President of the United States, who had previously agreed to sign the Federal Reserve Act in exchange for campaign funding from banking interests. Two days before Christmas of that year, when most of Congress was at home with their families, the Federal Reserve Act was voted it and Wilson made it law.\n\n&#x200B;\n\nhttps://preview.redd.it/ckoj1iu6lvz61.png?width=191&format=png&auto=webp&s=33a2ce339573e8d5e1739a20f39c8dd2f416da0a\n\nIn 1919, Woodrow Wilson wrote this statement:\n\n\"I am a most unhappy man. I have unwittingly ruined my country. A great industrial nation is now controlled by its system of credit. We are no longer a government by free opinion, no longer a government by conviction and the vote of the majority, but a government by the opinion and duress of a small group of dominant men.\"\n\nHe wasn't the only one to speak up though, Congressman Louis McFadden also chimed in after the passage of the bill.\n\n&#x200B;\n\nhttps://preview.redd.it/0qag2y56lvz61.png?width=198&format=png&auto=webp&s=978577fe0310d8fb4f05b3e66548e75d4f038823\n\nThe public was told that the Fed would serve as an economic stabilizer and that inflation and economic crises were a thing of the past. I don't have to tell you have big of a lie that was. The truth is that now International Bankers had a streamlined machine to expand their personal ambitions. From 1914-1919 the Fed had already DOUBLED the money supply in the US which resulted from extensive loans to small banks for the public. In 1920, the Fed called in a large portion of the outstanding money supply, which caused the smaller banks to call in huge numbers of loans just like 1907. Mass bankruptcy and economic collapse followed. Around 5,400 competitive banks to the Fed collapsed during this which boosted their monopoly even more.\n\nCongressman Charles Lindbergh, privy to the corruption, offered this quote during the crash, \"Under the Federal Reserve Act, panics are scientifically created. The present panic is the first scientifically created one, worked out as we figure a mathematical equation.\" What a clown!\n\nLittle did we know, 1920 was just the prologue. From 1921-1929 the Fed increase the money supply by another 62%. That's 62% of the already doubled money supply of 1914. During the Roaring 20s, a new type of loan was introduced, a Margin Loan. A margin loan allows you to borrow against the value of securities you already own. It's an interest-bearing loan that can be used to gain access to funds for a variety of reasons that cover both investment and non-investment needs. These loans allowed an investor to put down only 10% of a stocks price to gain full control of the share, while the other 90% was on the broker. So you could own $1,000 in stock with only $100 investment. People were making good money on investments, but there was a catch. The MARGIN CALL. At any given time, your loan could be called in and was required to be paid within 24 hours. In August and September of 1929, Rockefeller as well as many other wealthy insiders sneakily exited the market. On October 24th, 1929, the New York Financier's who furnished the margin loans started to call them all in at once. This created a mass sell out because everyone has to cover their margin loans, which triggered massive bank loans and led to the collapse of over 16,000 more banks which enabled aspiring international bankers to not only buy rival banks at discount but also buy large corporations for pennies on the dollar. The greatest robbery in American history. Sadly, as we know in hindsight, it didn't stop there.\n\n&#x200B;\n\nhttps://preview.redd.it/do7wdma5lvz61.png?width=280&format=png&auto=webp&s=bba7e0a100e153661a09f69f5a5f4afb97c4c4fc\n\nRather than expanding the money supply to help the economy recover from the economic collapse the Fed actually contracted it, which fueled the Great Depression.\n\n&#x200B;\n\nhttps://preview.redd.it/5zrq7jo4lvz61.png?width=346&format=png&auto=webp&s=320355601df7a9bda07c7918e3d5ae77bfee48a7\n\nA long time opponent of the banking interests that created the Federal Reserve, Congressman Louis McFadden began bringing impeachment proceedings against the federal reserve board saying this of the crash and depression:\n\n&#x200B;\n\nhttps://preview.redd.it/a801m4t3lvz61.png?width=327&format=png&auto=webp&s=f14e6bbe002aed7330f18403af8d5b6b146fedc5\n\nBut before he could push for the impeachment, he was poisoned at a political banquet in Washington and later died after surviving to previous assassination attempts. Now that this was put to rest, they had another agenda. They were being impeded buy something. The Gold Standard! But in order to remove the gold standard they would need to acquire all the gold that remained in the system. In 1933, under the guise of helping the citizens of the US to get out of the Great Depression, the President issued an executive order to for citizens to deliver all gold coin, bullion and certificates to the Fed. If you didn't abide, you received a 10 year prison sentence. This essentially took every single bit of the wealth the American people had left.\n\n&#x200B;\n\nhttps://preview.redd.it/0a75cp03lvz61.png?width=297&format=png&auto=webp&s=c43283d6619532d408d032b73daba2b7b3a27180\n\nhttps://preview.redd.it/fxgokcw0lvz61.png?width=225&format=png&auto=webp&s=a17f4ecdfafd179af3e763a208142912464432d6\n\n[ In 1933 the highlighted phrase was removed from the money in circulation and the Gold Standard was abolished. ](https://preview.redd.it/2ty37a8ykvz61.png?width=818&format=png&auto=webp&s=a948e9f36a6741019b7d5071d68c9ad4c54d4202)\n\nNow our dollars are backed and limited by nothing and therefore in full control of the Federal Reserve.\n\n&#x200B;\n\nhttps://preview.redd.it/6772lkuwkvz61.png?width=327&format=png&auto=webp&s=e2f1228e73b3ee716b0c7d6f0491defa8cf80499\n\nSo now we are literally back in the grasps of a fraudulent CB of which we fought England to be independent of. A CB that is about as Federal as FedEx. They are a private corporation that makes its own policies and is under virtually no regulation of the US government. As you may not know though, in 1913, another billed passed alongside the Federal Reserve Act, which was just as unconstitutional and fraudulent... Federal Income Tax. This is unconstitutional because it is a direct unportioned tax. A taxes have to be a portion to be legal based on the Constitution. Secondly, the number of States needed to ratify the amendment to allow the income tax was never met and this has even been cited in modern court cases. On average, you work 3-4 months out of the year just to fulfill this illegal tax obligation. Guess where that money goes? To pay the interest on the currency the Fed supplies the government with. Because a CB system only creates one thing.....DEBT!\n\nWhat's even more infuriating? Not one penny of this tax goes to a single governmental program, NOT A PENNY!!!! **IT ALL GOES STRAIGHT BACK INTO THE POCKETS OF THE INTERNATIONAL BANKERS THAT OWN THE FEDERAL RESERVE!!!!** The entire population of the US pays roughly 25% of their entire career worth of earnings to the owners of the Fed! What's even crazier? There is literally no law or statue in existence that requires you to pay this tax!!!!!!!! Two former IRS Agents openly expressed this in interviews, Joe Turner and Sherry Jackson, both claim they haven't filed a tax return since the day they found out it was all a lie.\n\nAs if it wasn't already bad enough, these are just a few of the tools the Fed has for profit and control.\n\nWhat else could they have you might think? **WAR**\n\nSince 1913, there have been a number of wars, with the three most pronounced being WWI, WWII and Vietnam. Less than a year after its implementation, World War I commenced, centered around England and Germany. The American public wanted nothing to do with the war and Woodrow Wilson declared neutrality. However, behind closed doors, the US administration was looking for any excuse they could to enter it. Wilson's top advisor and mentor Colonel Edward House, a man with intimate connections to the international bankers who wanted in the war. Secretary of State William Jennings Bryan cited the proof for such motivations.\n\n&#x200B;\n\nhttps://preview.redd.it/s7jkku6vkvz61.png?width=262&format=png&auto=webp&s=a05e071866371c9b819d50ae58b8ae4849047bc1\n\nThe most lucrative event that could possibly happen for these international bankers is war, because it forces the country to borrow even more money from the Fed. There is a documented conversation between Colonel House and British Foreign Secretary Sir Edward Grey regarding how to get America into the war. In their conversation, Sir Edward as Howard \"What will Americans do if Germans sink an ocean liner with American passengers on board?' Howard's response \"I believe that a flame of indignation would sweep the US and that by itself would be sufficient to carry us into war.\n\n[https://www.history.com/news/how-the-sinking-of-lusitania-changed-wwi](https://www.history.com/news/how-the-sinking-of-lusitania-changed-wwi)\n\n&#x200B;\n\n[RMS Lusitania](https://preview.redd.it/yv7k4zjtkvz61.png?width=306&format=png&auto=webp&s=b92d5f0bac615dcb1f6e270de44b72b603849a3e)\n\nSadly, on May 7th, 1915, the RMS Lusitania was intentionally sent into German controlled water where German military vessels were known to be. As expected, German U-boats torpedoed the sink which exploded stored ammo, causing the ship to sink in under 20 minutes and killed around 1,200 innocent US passengers. Proof of this being deliberate comes from the New York Times itself, where the German Embassy actually bought advertisements that warned people if the boarding the Lusitania, they did so at their own risk because such a ship would be liable for destruction.\n\nhttps://preview.redd.it/54dpcvu20wz61.png?width=1200&format=png&auto=webp&s=04142644837f60a824918b67eb1bf36efd688ffb\n\nAs a result, America entered the war. The war cost an estimated 323,000 American lives. I'm telling you all this so you understand what we are up against right now. I even kind of feel uneasy spreading this information, but everyone needs to know. A great enlightenment is needed now more than ever because history is just repeating itself!\n\nJD Rockefeller personally made over $200 million from WWI, over $2 Trillion in today's equivalent! In total, the war cost America about $30 Billion all of which was borrowed from the Federal Reserve Bank.\n\nWorld War II and Vietnam were no different, but I'll spare you all the anger of the corruption for a later date.\n\nI say all this to prove just how far the Fed will go to make more money, but this may come as some twisted form of relief to GME and AMC holders. Why? Because the Fed wants Citadel and the Stock Market to crash, they want more stimulus checks, but its not all rainbows and cupcakes. We will strike gold because the fed is going to try to milk this for all the bailout money the government can request for these corrupt market participants, but this will be the first time the US citizens also won. What will happen as a result of this is unknown, but I can bet we won't have to wait long to find out. Stay safe out there everyone, seriously, apes together strong. Diamond handing a stock may very well lead to a long overdue American Revolution, We the People will prevail.\n\n&#x200B;\n\nPart 2 is coming soon that will bring us from WWII to now. I will warn you though its very disturbing and scary to read.",
    "title": "The DARK history of the Federal Reserve and its implications for the SQUEEZE! Citadel, Melvin and and Robinhood are just puppets! Part 1",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nfa1t3/the_dark_history_of_the_federal_reserve_and_its/"
}