{
    "author": "leavemeanon2",
    "created_utc": 1626309201.0,
    "distinguished": null,
    "edited": false,
    "id": "okhjpj",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_okhjpj",
    "num_comments": 393,
    "permalink": "/r/Superstonk/comments/okhjpj/responding_to_some_of_the_questions_surrounding/",
    "score": 1661,
    "selftext": "I realize that this may immediately raise red flags and that’s warranted. \n\nI also realize that, lacking concrete proof, I’m unlikely to totally convince you. That’s ok, I don’t blame you - tbh discernment is important and I doubt I’d believe me if I were you. \n\nI’ve contacted a couple of the mods and (hopefully) convinced them enough to at least let me post. u/rensole\n\nI previously posted here under the name u/leavemeanon. I authored the “Where are the Shares?” series and ultimately nuked my Reddit account along with several other social media accounts. [It was ultimately reposted](https://www.reddit.com/r/Superstonk/comments/nt8t9n/rip_uleavemeanon_where_are_the_shares_part_3/?utm_source=share&utm_medium=ios_app&utm_name=iossmf), which I was glad for. Seeing [this post](https://www.reddit.com/r/Superstonk/comments/ok2e0b/a_castle_of_glass_game_on_anon/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) referencing me from earlier today, I felt I should clear some things up. \n\nu/3for100Specials noted in their post that some of the intrigue was generated by the mystery of my previous account, but nothing I have to say here will weaken that post whatsoever. It’s fascinating stuff, and I need to look into it further because I know very little on that front. \n\nWhich brings me to my first point - I’m really not very mysterious. I’m not RC or DFV or MB. I was being honest when I said I knew virtually nothing about markets 6 months ago. I’m a crayon eating, FUD blasting, diamond hodling, ape. A true autist as our.. cousins might say lol\n\nWhich, of course, begs the question of why I nuked my account after all the time spent on the posts. \n\nIn all honesty, it was an impulsive decision made out of fear. I’m not proud of that, but I can also say that the week of posting part 3 was, without a shadow of a doubt, the weirdest week of my entire life. \n\nI was going to go into detail but I’ll just leave it at that for now. \n\nTo the extent that the (inadvertent) intrigue around me caused more apes to dig deeper, it was a happy accident. \n\nI’m also not Bob Ross.\n\nAnd if my week of weirdness taught me anything, it’s that coincidences.. do just happen sometimes. Questioning coincidences is great, but they do, unfortunately, exist. \n\nFor instance - u/leavemeanon was created to post personal opinions in a strategy game I was once well known in. I saw the other day that DFV was well known in some card game once. See? Coincidence^simulation \n\nAs for the text involved with the NFT: “GAME ON ANON” - I’m 99.99% sure it’s coincidental^proofofsimulation\n\nI know this is probably not the juicy post you came here for, but I felt it was important to be truthful. It doesn’t take insider knowledge or financial genius to change the world. It takes trust and transparency.\n\nHopefully I net a little Karma here so I can discuss further with you guys.\n\nHODL",
    "title": "Responding to some of the questions surrounding my old account, u/leavemeanon",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/Superstonk/comments/okhjpj/responding_to_some_of_the_questions_surrounding/"
}