{
    "author": "khashi1",
    "created_utc": 1617113521.0,
    "distinguished": null,
    "edited": 1617202833.0,
    "id": "mggyke",
    "text_only": true,
    "flair_text": "Fluff",
    "name": "t3_mggyke",
    "num_comments": 331,
    "permalink": "/r/GME/comments/mggyke/i_think_we_as_rgme_need_to_take_a_step_back_and/",
    "score": 10574,
    "selftext": "[Stop the Ape on Ape violence, fucking now!](https://preview.redd.it/xxjd77sxa6q61.png?width=2100&format=png&auto=webp&s=8a5a2ac6d6f776da158ec52d8e449aa22fcbe574)\n\n(Edit:  Thank you all for noticing my \"amazing cropped Ape PNG\" file.  I would love to pretend it was on purpose but I kind of just suck in general.  :)  On the bright side, I do HODL onto my GME shares really well!   At least I'm good for something)\n\n(Edit 2:  Thank you Apes worldwide.  You guys don't get enough love.  So thank you guys too) Dont forget u/DerGurkenraspler\n\nu/boneywankenobi also deserves a boost. He's a fucking wrinkly brained ape for sure\n\n\nYes, HUGE THANK YOU! Add u/atobitt to that list!\n\n(Edit 3:  Some people think it was wrong for me to single out just a few people.  So thank you to the entire r/GME community.  We are a strange, dynamic, growing ecosystem of strangers who just like a stock.  Didn't realize how angry some people would become for wanting to acknowledge some people who put in a lot of work. )\n\n&#x200B;\n\n&#x200B;\n\nI think this needs to be said.  We should be supporting each other.  These guys aren't shills and just because Wall Street Bets sold out, doesn't mean the mods and important people in GME have also done the same.\n\nSo let's knock off the Ape on Ape shit and get back to doing what we do best.  Buying and hodling.  Dreaming on what we good things we can do for the world with our tendies.\n\nI want to pay off my mom's house and repay all my relatives who spent time investing in me.  From all the 25 buck birthday cards even though I never see them.  To the kind wedding gifts to get my family on it's feet when we were just starting out.   Pay off all my debt.  Buy out an entire GameStop and donate it's contents to John Hopkins Children's Hospital where my daughter had surgery and I stayed for over a week.\n\nFind worth while charities for people and my fellow Veterans who are struggling.\n\nApe Strong\n\noooooOOOOOooohhHHhhhhh Oooohhhooohoooooohhhh aaaaaAAAAHHHAHAHHAHAHAAAAHHH  AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH",
    "title": "I think we as r/GME need to take a step back and thank people on here. Rensole, WardenElite, Pixel, Corno4825, and all the Mods. Stop calling them Shills!! They are just regular people who are putting a lot of time/effort in this and might have different opinions differing from yours.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/mggyke/i_think_we_as_rgme_need_to_take_a_step_back_and/"
}