{
    "author": "AlaskaPeteMeat",
    "created_utc": 1626178213.0,
    "distinguished": null,
    "edited": false,
    "id": "oje98k",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oje98k",
    "num_comments": 416,
    "permalink": "/r/Superstonk/comments/oje98k/daily_reminder_gme_is_a_worldwide_phenomenon/",
    "score": 3193,
    "selftext": "This is a WORLDWIDE phenomenon.\n\nThere are the Ameri-apes, the Europoor, the Nords, the South American contingent, the Ant Army, and on and on- we have seen posts and comments from every state in the USA, and every corner on the Globe;\n\nWe apes are often and much separated by geography, nationality, lifestyle, income, and much, much more.\n\nOur distance and differences are wholly irrelevant.\n\nAs individuals, with our own thoughts and independent actions, we have all independently decided we like the stock.\n\nA situation and circumstance not even remotely-comparable to institutions nor hedge funds nor any other manner of structured investment scenario.\n\nAs individuals, geography allowing, many of us *individuals* have chosen to ‘vote with our dollars*, to do commerce with a known, established, commercial entity that is a leader in it’s market, has a rapidly growing back-end infrastructure, a growing top-notch leadership team, seemingly ever-expanding product-line and inventory, and becoming *renowned* for it’s customer-service, customer-support, and customer-communication.\n\nWe gather in a virtual digital place to commune about something we are all passionate about, no different than model-train enthusiasts, lovers of art, people who enjoy wine.\n\nAt the core of all of this, there is just simple math. ‘Supply vs. Demand’, the embodiment and actual practice of the Capitalist ethos.\n\nThe situation is *really* that simple.\n\nAs individuals, we are limited and bound by the rules, laws, and protocols of the small investor.\n\nWe cannot trade in dark pools, nor use the Fed’s repo process to borrow billions of dollars at record rates.\n\nThere are obvious problems in the market, mostly based purely in failures of enforcement of regulation.\n\nThe entire apparatus is a House of Cards; Peter has been robbed to pay off Paul, to borrow from Steve, to loan liquidity to Tom, to grant margin to Jerry, so Jerry can package up some 2021 Credit Default Swaps, so Jimmy can short a company, so Peter can manipulate crypto...\n\nAnd on and on and on...\n\nIt’s a giant circlejerk of financial instruments that the entire prosperity of the World Economy rests upon.\n\nRules have been abused. The system has been tainted.\n\n”The Centre Does Not Hold”\n\nNone of that matters. The math and science of the situation lead to only one possible action: BUY and HODL.\n\nTo paraphrase some lines from Firefly:\n\n“We buy. We hold. That makes us righteous, and we are so very pretty.”\n\n💎🤲🏽",
    "title": "Daily Reminder: GME is a WORLDWIDE phenomenon.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oje98k/daily_reminder_gme_is_a_worldwide_phenomenon/"
}