{
    "author": "pinkcatsonacid",
    "created_utc": 1626209762.0,
    "distinguished": null,
    "edited": false,
    "id": "ojos41",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ojos41",
    "num_comments": 2788,
    "permalink": "/r/Superstonk/comments/ojos41/im_stepping_back_from_the_daily_posting_of_the/",
    "score": 16401,
    "selftext": " Hello friends. 💖\n\n&#x200B;\n\nIt is with a heavy heart that I tell you that I have recently faced serious irl threats to my safety and well being, and as a result I am taking a break from the daily posting of the Jungle Beat until further notice.\n\n&#x200B;\n\nOut of respect for my team's privacy, I will lay off any details.\n\n&#x200B;\n\nOut of respect for the apes I serve, I will tell you this;\n\n&#x200B;\n\nModerating a forum this intense requires utmost trust with each and every team mate.\n\n&#x200B;\n\nAnd when external concerns about possible infiltration are brought to the \"leadership\" they should be handled respectfully and reasonably for all parties.\n\n&#x200B;\n\nUnfortunately I was recently met with some highly alarming threats to my irl safety and wellbeing as a result of taking such actions; threats which appear motivated by an apparent conflict of interest. I have subsequently been enduring some serious FUD attacks in the days following, including a dox attempt. As a result, I have lost trust, although I assure you the **vast** majority of the mods on this team are **beyond** trustworthy.\n\n&#x200B;\n\nI don't know what is happening, but I want you beautiful apes to remember;\n\n&#x200B;\n\nI have always loved and enjoyed spending my time with you for the last 6 months. You're fucking amazing. Truly.\n\n&#x200B;\n\nDon't let anyone tell you 7 figures or more is impossible.\n\n&#x200B;\n\nI'm holding til I see phone numbers. The DD backs it up and I believe in the DD. Do what you want tho. I just like the stock. My favorite holding period is forever.\n\n&#x200B;\n\nRyan Cohen and DFV are the only idols you should have in all this, if any.\n\n&#x200B;\n\nI have only ever tried to serve this community honestly and respectfully.\n\n&#x200B;\n\nI realize this community does trust me as [the diamond whistle blower.](https://www.reddit.com/r/Superstonk/comments/ms6yvq/blowing_my_diamond_whistle_as_a_highly_visible/?utm_source=share&utm_medium=web2x&context=3) And I take the responsibility and trust quite seriously.\n\n&#x200B;\n\nI love you all and I have enjoyed serving you, first as your Princess Memelord, then as your shill-hunting mod, and ultimately, I hope, as your friend over drinks at the bar on the moon soon.\n\n&#x200B;\n\nI'm posting this, fully realizing the consequences that are likely to follow. Fearlessness is the only way to win here in the hedgie's fucked up game. And I stand true in what I am saying to you today.\n\n&#x200B;\n\nUltimately, we are all volunteers here, and the point is to help and support the community- not to be harassed non-stop and ultimately threatened. Whatever happens, I will continue to work to serve this community in some capacity.\n\n&#x200B;\n\nDo your own DD and verify everything you read, because you never know what or who you can trust anymore. Many people want the platform that is Superstonk to sell something or push a narrative.\n\n&#x200B;\n\nFollow your gut, and keep your intentions pure. If your compass is true, you'll land among the stars. 💖\n\n&#x200B;\n\nStay safe out there apes. ✌💎🙌 HODL",
    "title": "I'm stepping back from the daily posting of The Jungle Beat for my safety and well-being",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojos41/im_stepping_back_from_the_daily_posting_of_the/"
}