{
    "author": "conniverist",
    "created_utc": 1620663281.0,
    "distinguished": null,
    "edited": false,
    "id": "n98zl2",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n98zl2",
    "num_comments": 43,
    "permalink": "/r/Superstonk/comments/n98zl2/for_me_personally_the_worst_type_of_fud_is/",
    "score": 774,
    "selftext": "Nothing is worse than having your tits jacked for something that comes out later to be not true! These type of experience create doubt in fellow apes. \n\n&#x200B;\n\n**Please before posting something make sure its 100% correct! Perhaps post it as a question first and get wrinkly opinions? This is extremely important.**\n\n&#x200B;\n\nWith all the amazing DD and evidence thats been uncovered in this sub we have something that can never be taken away. But, I suspect one way to attack ape's resolve is to spread seemingly well intended misinfo (whether nefarious or not) that is later disproven resulting in bruised egos and unnecessary overthinking. This deflates ape's when they realize they believed something that wasn't true and could possibly make them feel conspiratorial. This is the only way they can get you to fold! By sowing doubt. We've all seen the facts/evidence and, hedges r fuk. The only way they win is if you fold your winning hand. Aint gonna happen!!! \n\n&#x200B;\n\n**If you're a dumb ape like me I recommend just sticking to the mantra \"BUY, HODL, VOTE\"** and avoid the conspiratorial rabbit holes. This is what I do when I find myself overthinking... \"Over thinking over analyzing separates the body from the mind\" Lateralus. Do as you will....\n\n&#x200B;\n\nRandom recommendaiton.....If you're experiencing anxiety and tension I recommend alternate nostril breathing. It takes 2 minutes and works incredibly well from my experience. Do this as many times as needed throughout the day and also great to do before bed. The exercise starts are 1 minute mark of this video.   [https://www.youtube.com/watch?v=mqS9wRMW1S4](https://www.youtube.com/watch?v=mqS9wRMW1S4)\n\n&#x200B;\n\nBreathe deeply, relax, enjoy the ride to Andromeda.\n\n&#x200B;\n\nNFA... I am simply thinking out loud as an individual to all other individual's reading this.",
    "title": "For me personally the worst type of FUD is overhyped info that people are posting without confirming. This recent incident concerning supposed dark pool restrictions that Dave Lauer cleared up for us (Thank you Dave!) is a great example. It is potentially harmful and here's why....",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/n98zl2/for_me_personally_the_worst_type_of_fud_is/"
}