{
    "author": "anongmeholder",
    "created_utc": 1616954982.0,
    "distinguished": null,
    "edited": false,
    "id": "mf6brv",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_mf6brv",
    "num_comments": 538,
    "permalink": "/r/GME/comments/mf6brv/the_finishing_blow_the_end_of_the_shorts/",
    "score": 8265,
    "selftext": "# The Introduction:\n\nListen up my fellow ape brothers and sisters, I have lurked this beautiful community since the 45s, commenting and trying to help our fellow apes with what I can. STRAP THE FUCK IN BECAUSE I AM ABOUT TO TELL YOU WHY SITTING ON THIS ROCKET AND WAITING IS THE BEST DECISION APES COULD HAVE MADE FOR THEIR LIFE.\n\n**I WOULD LIKE TO START BY SAYING THAT I AM IN NO MEANS A FINANCIAL ADVISOR, SO EVERYTHING I WRITE HERE IS JUST MY OWN OPINION I WANT TO SHARE WITH EVERYONE AND NO PERSON OR APE SHOULD TAKE ANY OF THIS NONSENSE AS INVESTMENT ADVICE.**\n\n# The GAME that we have gotten ourselves into:\n\nNow in order to figure out why this ticking time bomb of glory is so precious, beautiful, and unprecedented, we must first dive into what this little game is we are playing.\n\nThe game we have entered into my fellow apes, is one that is not only played with our beloved GME, but with countless other stocks in the market. Almost always, this game is played by the shorts and the shorts alone, banding together in hordes and driving companies into the dirt all the while reaping INSANE profits on their 'plays'. The shorts are usually successful in these plays, due to their gargantuan presence and influence throughout the market. They are able to psychologically beat those that oppose them through controlling the market by methods such as, short attacks, ETF shorting, naked shorting, and payment for order flow, as well as controlling the narrative by paying the media, journalists, growth hackers, and social media experts. They know the market is ultimately a giant PSYCHOLOGICAL game, they know that fear, uncertainty and doubt will kick in and cause further selling pressure from the way they attack the price at vulnerable times. Ultimately they want to cover their position once it is profitable for them, meaning the price is lower than the original value they bet against. There are countless amounts of companies with different short interests, this value can range from 0 percent to 20 percent to higher. **From an industry standard basis, 20 percent is considered a high short interest. For example, in Jul 13 2020, Tesla experienced a soar to approximately 1554.65 USD from approximately 200 USD... this happened with a short interest of around 25 percent.**\n\n**NOW THIS SPECIFIC GAME WE ARE IN THE MIDDLE OF IS VERY DIFFERENT TO OTHERS LIKE IT.**\n\nTHE MOST IMPORTANT PART OF THE DIFFERENCE:\n\nThe shorts have shorted more than 100% of the shares available AND THEY HAVE TRIED TO SHORT IT TO ZERO BRINGING THE PRICE TO AS LOW AS 3 DOLLARS A SHARE IN 2020... IN OTHER WORDS THEY HAVE CREATED A GAME WHERE...\n\nI WOULD LIKE TO QUOTE THE WONDERFUL MARK CUBAN HERE:\n\n**\"Their goal is to NEVER cover their short, because that would get the company going out of business or getting delisted.\"**\n\n**In other words,**\n\n**THE SHORTS WE ARE AGAINST CAN ONLY WIN IF GME = 0**\n\nYes, I see the red pill is starting to kick in Neo.\n\nThis scenario CANNOT happen, the fundamentals of GME guarantee that with a 99% certainty. This also means that the shorts have already lost the game. Now imagine a chess match with a lone king on the board against an entire army of bishops, pawns, rooks, and knights... The lone king can still move and \"kick the can down the road\" all he wants, but the end is pretty much guaranteed.\n\n# The ENDGAME:\n\nWe are now in the endgame, and have been here for a while. The endgame started after Jan 28th when the restrictions came in, alongside short attacks which tanked the price gradually to around 40 dollars a share. At this point we know, based on the GME SEC filing that was recently released, that more than 100 percent of the float was and still is shorted. Wonderful, GGWP.\n\nOk but now, why does the price keep going up and down?\n\nSo here is where things start to get interesting, and this is where I start to knight you with the Sword of the Thousand Truths just before I finally give it to you to wield on your warpath to the holy lands.\n\n**What you are currently seeing on the tickers everyday on market open, is not the real price of GME. The real price of GME is buried under so much shorting pressure (short attacks, ETF shorting, naked shorting) that lifting it would blow up the price to historical unprecedented galactic levels causing shock waves across the universe as we know it.**\n\nThis phenomenon can be further added to if we look at the following amazing DD:\n\n[https://www.reddit.com/r/GME/comments/m4c0p4/citadel\\_has\\_no\\_clothes/](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/)\n\nThrough this DD We can come to the conclusion that we are playing against an absolute degenerate of a cheater in this game. So even though he has lost the game despite disgustingly cheating the system, he will continue to perform illegal practices and tactics to further tame and manipulate the stock, being very careful for it not to break tipping points where it could explode beyond control... aka buying himself time... aka kicking the can down the road... aka denying the inevitable... aka remember yourself when you were beyond angry in a video game because you were losing so badly you just wanted to fuck shit up before you were out.\n\n**THIS ALSO MEANS THAT THE PRICE IS ARTIFICIAL, AND THAT THE SHORTS WILL TRY TO GRADUALLY SHOW THE HOLDERS OF GME MORE AND MORE HIGHER PRICES IN THEIR OWN RANGE THAT THEY CAN AFFORD WITHOUT BEING ABSOLUTELY MARGIN CALLED TO DEATH.**\n\n**THINK ABOUT THIS AS A NEGOTIATION BETWEEN US AND THE SHORTS...**\n\n**The shorts keep coming to us offering different prices for our priceless diamonds,**\n\n**Shorts in Jan 28: Aight guys we are offering you maximum of 460 dollars for a share of your GME... Oh look the price is going more down, more people are accepting our offer, haha you better sell yours too!**\n\n**Shorts in Feb: Hahaha, I told you idiots to take the offer on 460 dollars, now look where we are, we dont negotiate with longs. Last chance to take whats on the table with 150 dollars a share. This company is valued at 15 dollars a share, 150 is a steal!**\n\n**Shorts in later Feb: I told you, this is a dying company. 45 dollars a share better sell now hahahah. You should have listened!!!**\n\n**Shorts in March after radio silence: Okay guys... well this is awkward... so maybe it didnt work out the first time, how about I come back to the table like in Jan, but because you didnt agree to my price I am only willing to go as high as 360 dollars a share! You better take it now or else I am not coming back I SWEAR!**\n\n**You get the picture...**\n\n# So they control the price?\n\nWell that is not entirely correct. They can heavily manipulate the price, but they in no way totally control it. They have to manipulate the market as realistically and quietly as they can.\n\nHere is an interesting excerpt from the Tesla short squeeze that applies here:\n\n\"And then something happened which at first glance looks illogical. Usually, one would say that the higher the share price, the higher the short share goes. **Indeed, the development of the business must cover the share price development.** **The more the share price rises, the better the business must go or the outlook must be. When the price decouples from the fundamental basis, the short-seller attacks. So much for the presumed logic. However, a problem for short-sellers arises when the price goes up and up and up, and they have to buy stocks to cover their obligations, which creates an enormous demand on the market.\"**\n\nYes, now apply all that to GME.\n\nGME has placed itself in a position where it cannot ''decouple'' from its share price due to its incredible fundamentals. In my opinion is the best investment I could make by such a long shot that there are really no investments that exist like it.\n\nYou see, GME is what i like to call a double edged sword, where you have an investment that has points of power on multiple fronts. This makes it a strong investment regardless of petty temporary movements.\n\n**GME has three incredible fronts as an investment:**\n\n1. **Incredible, company fundamentals. GME is in the process of transforming into a digital powerhouse for video games, and it could not be in a better leadership position with GOD ENTREPRENEUR Ryan Cohen spearheading its future. The industry and focus of the company is in a very flexible position where it has immense opportunities to expand into and conquer varying markets. GME is literally a future GIANT in the making with its leadership and brand value.**\n2. **GME is shorted more than 100 percent of its float confirmed! This means that attached to a company that can fundamentally be more than 1500 USD a share by, for example 2025, there is downward pressure on the stock that exceeds its available shares. THIS IS AN UNPRECEDENTED SCENARIO BECAUSE THE RISE OF THE PHOENIX HAPPENED AFTER THE SHORTS HAD GATHERED IN TO FEAST. THIS SCENARIO CANNOT CEASE TO EXIST DUE TO THE NATURAL NEW SHIFT AND DIRECTION OF GME AND THE INABILITY OF THE SHORTS TO CLOSE THEIR POSITIONS UNLESS THEY WANT TO LITERALLY DIE AS COMPANIES.**\n3. **A new wave of unparalleled customer loyalty and fandom that is growing in its numbers everyday. Now who better to lead these already loyal customers whilst bringing in waves of new and satisfied customers all the while leading the company to its promise land of glory... The master of customer excellence, Ryan Cohen.**\n\nSo why is it good to understand this?\n\nBecause this shows me that UNDENIABLE UPWARD ORGANIC PRESSURE on the this over boiled pot is coming with the many catalysts that will come from GAMESTOP's side in this battle, one of the most outstanding ones revolving around the shareholder voting meeting that will take place around June.\n\n# The FINISHING BLOW. THE END OF THE SHORTS.\n\nThe end is near for the shorts. This game is over, they just haven't threw in the towel yet. The price is artificial and we know for a fact we are dealing with a criminal who cheats the system. Cheating the system can only however buy you time, and that is what is happening right now. They are just delaying the inevitable.\n\n**What is the finishing blow? It is definitely a catalyst that will come from GME's side, be it a new CFO, CEO, announcement of game plan moving forward, dividend, or lenders recalling their shares to vote in the meeting taking place in June. The possibilities are endless, THE ONLY THING YOU SHOULD CARE ABOUT IS NOT WHEN IT BLOWS, BUT THAT YOU ARE ON IT WHEN IT BLOWS. It can be literally anything that comes from Gamestop's side fundamentally as a company.**\n\nMy guess? It revolves around the shareholder meeting in June.\n\n**So what is the takeaway from this? You have made the best investment of your life, no matter what, no matter how long it takes, remember the facts as I outlined above. STOP BEING SO EMOTIONALLY ATTACHED TO THE CURRENT TICKER. THIS IS EXACTLY WHAT THEY WANT. They can show you whatever price they want, IF IT DOESNT LOOK LIKE THE MOASS THEN IT IS NOT THE MOASS.**\n\n**The only weapon you need throughout all this is one thing, wield it with you at all times, for the journey ahead is unpredictable. The only thing you need to constantly reassure yourself in this, is that you placed your investment in the right place from all the fundamental angles (what the shorts hate), and now that the equation is perfectly set up for the MOASS you need one thing and one thing only: PATIENCE.**\n\nMY GOLDEN STOCK EQUATION: (AMAZING FUNDAMENTALS) + **(PATIENCE)** = PROFIT\n\nMY GME EQUATION: (AMAZING FUNDAMENTALS) + **(PATIENCE)** \\+ (RIDICULOUS SHORTING) = MOASS.\n\nMake **PATIENCE** your manual, your guide, your light, your ethos, and everything you need whenever you fear the primitive ape in you start to get worried due to THEIR THEATRICS.\n\nSit and enjoy the ride, interact with this beautiful community, and enjoy exploring more about this saga we are all apart of through the fascinating DD that is posted daily on the sub.\n\n**TLDR**: **The end is in sight apes, GME is a company with incredible fundamentals due to its transformation (what shorts hate), so the catalyst will come, and it will SURE AS SHIT come from Gamestop's side (new CEO, CFO, shareholder vote etc) . It will be beautiful to watch as we soar past the galaxies in this rocket. Organic upward pressure from a transformed company is the worst enemy of shorts that want to never cover so just be PATIENT. MOASS IS COMING.**\n\nAND MY GOLDEN RULE WHEN YOU FOUND YOUR RIGHT STOCKS IN THE FUTURE AFTER MOASS: HOLD TILL PROFIT OR BUST (and buy the dips).\n\nAlso huge PSA to all: Watch the show: Billions (from Showtime). It is absolutely incredible from a film standpoint, but more than that you will gain creative insight about what goes on behind the scenes with these HFs in a lot of detail. Absolutely great complex drama, really recommend it!\n\n**I would like to reiterate that I am in no means a financial advisor, nor have any certifications or qualifications to be one. SO DONT TAKE ANYTHING I SAID AS INVESTMENT ADVICE. I AM PROBABLY TOTALLY WRONG ABOUT EVERYTHING I SAID!!! I am just sharing my theories, opinions, and ideas with a like minded community. I am ape dont listen to me!**",
    "title": "THE FINISHING BLOW: THE END OF THE SHORTS",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mf6brv/the_finishing_blow_the_end_of_the_shorts/"
}