{
    "author": "The_Peregrine_",
    "created_utc": 1616535102.0,
    "distinguished": null,
    "edited": 1616539373.0,
    "id": "mbpdkn",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_mbpdkn",
    "num_comments": 342,
    "permalink": "/r/GME/comments/mbpdkn/the_most_predictable_ass_short_attack_is/",
    "score": 9663,
    "selftext": "Don’t believe the FUD, Buy n Hold\n\n\nEDIT: since this is gaining traction let me add from one of my comments, that play by the HF was literally betting that people don’t know what the fuck anything means in an earnings call, and that they would see their shorts drive the price down and jump ship. Squeeze or no squeeze that earnings call basically ensured that we hit 1000 without it in the near future. All the stuff they have lined up, GME has a bright future. With squeeze though my fucking floor just went up from 2M to 3M. I charge per fuckery. \n\n\nYOU HEAR THAT HEDGEFUCKS, I CHARGE PER FUCKERY\n\nWe had the fundamental mechanics on our side, with the shorts needing to cover etc,\nand this earnings call proves we also have the corporate fundamentals. So everyone talking shit about GME saying it’s a 5 dollar company (looking at MSM), can suck it, that was a solid earnings call and better than 80% of other companies during COVID, let alone all the stuff to expect in 2021 Q1 \n\n\nAs always BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD’N’BUY’N’HOLD\n\nThey are fucking afraid, they are playing dirty, they are trying to survive. But they don’t understand that the shorts they have been playing with have been poisoning their veins and there’s only so long they can fight it. We will win. Just hold.",
    "title": "The most predictable ass short attack is happening post earnings, trying to make good news seem like bad news. Don’t fall for it, we know we’re not going anywhere, and if you’re paper handing now, it’s good to see you leave because you surely would paper hand at the beginning of the rocket",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbpdkn/the_most_predictable_ass_short_attack_is/"
}