{
    "author": "dejf2",
    "created_utc": 1617714038.0,
    "distinguished": null,
    "edited": false,
    "id": "mlb3nm",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "Serious DD 👨‍🔬🔬",
    "name": "t3_mlb3nm",
    "num_comments": 81,
    "permalink": "/r/Superstonk/comments/mlb3nm/the_game_did_not_stop_project_quick_update_plans/",
    "score": 688,
    "selftext": "**Hello dear Apes,** \n\nAs you may or may not know, yesterday I made public my story and plans to go forward with researching and publishing GME full-time. I disclosed my competences and situation, and asked for your help. I have been absolutely overwhelmed by the response, not only monetarily but in terms of the messages I received. In less than 24 hours you have secured the next 2 months for me so I can work on this without worry. That's incredible, and I thank you from the bottom of my hear, but it's your incredibly heartfelt and honest messages that have lit an even bigger fire. We're doing this, guys.\n\nThe money has come at such a blinding pace, that I already engaged my filmmaker / animator colleague to collaborate with me on this and not only produce coherent synopses of the DD since the beginning, but also put it into bitesize ELIA video format. That's where all excess will go, diversifying into more media to reach a larger and less specialist audience. **Please hold off on donating past the planned goal** until we produce the first video and publish it, so you can see what I mean, and we know what the costs of doing things like that are. \n\nAs I said in the first post, the amounts being raised are sustenance and cost of doing work, nobody is earning splurge money here. That won't stop some accusing me of 'begging', like I'm trying to recoup my YOLO on GME. FYI, my position is in the green. I didn't sell my car to average down for nothing. It's just not getting sold. I hope that as we pump this content out you will see that this really is my job, just how good I am at it, and what my intentions are. This is the first and last time I will engage with the small group of people that has been saying this stuff. From now on, I will be proving you wrong with the quality and integrity of my work.\n\nA large number of you contacted me with your skills / competences / connections, and I'm wondering why did I ever use LinkedIn? You are amazing, and each of you is taking your place on a huge board of post-it notes to be called upon if we need your help. End of this week / start of next we will need translators experienced in subtitling, you already know why. If you want to help with any part of this project, please PM with your competences, and I will make a note of all of you. A post-it note, that is.\n\nMany of you asked contacted me asking questions about the mental health topics I described. Please don't be skittish or ashamed about doing that, I don't hang up the phone on anyone who's struggling and looking for direction or advice. **Apes help apes.**\n\nHere is the post from yesterday if you missed it: \n\n[^(https://www.reddit.com/r/Superstonk/comments/mkjaxs/update\\_on\\_me\\_contacting\\_sec\\_about\\_the\\_44m\\_ftds/)](https://www.reddit.com/r/Superstonk/comments/mkjaxs/update_on_me_contacting_sec_about_the_44m_ftds/)\n\n# You will not receive any new content from me today, as in response to your amazing support I am cutting our Easter break short and travelling back home to start working for you guys full-time from tomorrow. This is my plan for the next few days:\n\n**Today, April 6** \\- the below reposted DD which was removed from the old sub yesterday for reasons that escape me\n\n**Tomorrow, April 7 - Part 2 of the PC Bang Theory DD**, which only a few eyes saw as it was instadeleted from the old sub on posting (for reasons that escape me also). It is my own vision as a brand strategist and creative business consultant as to what GameStop could do. Here is a teaser:\n\n[Stay tuned for this piece tomorrow, April 7!](https://preview.redd.it/60ruyp2crjr61.jpg?width=1920&format=pjpg&auto=webp&s=470cefdcf77562d29885c3fd4b48033725843cc0)\n\n**April 8 - Part 3 of the deep-ITM-call-anomalies DD** \\- Spoiler: They disappeared. Something else appeared. Did they change tactic? Do they know we're watching? What is the new activity and what does it mean? - I need my desktop to be able to collate all this data efficiently and present it, so you'll have to be tided over by the PC Bang Theory for now while I travel home! \n\nHere it is!\n\nDisclaimer: Please note that all calculations are based on data prior to the Earnings Call. I have not quite had the time to update them. The general picture remains unchanged!\n\n# THE PC BANG THEORY: The South Korean Reason I'm Bullish on GME. A deliberation on the 'GameStop Experience'.\n\n**TL;DR: GameStop is not only expanding  in the gaming and PC markets, it is also trying to create a new market  in itself, in which it will dominate by default, because no such thing really currently exists in the US.**\n\n# Thesis:\n\nGameStop will achieve comparable success and domination as Chewy, in a niche much bigger than Chewy's. The market cap of GameStop will exceed that of Chewy as a natural consequence. The reason  I predict for this domination is the application of the Chewy principles and talent, and the creation of the 'GameStop experience' - to become 'the ultimate destination for gamers', instead of a game thrift store. **The GameStop Experience will be the same emotional and brand loyalty glue as the Chewy experience.**\n\nYeah, you’ve heard about the ‘digital-first’ shift. That’s all great. But there are additional revenue streams GameStop is trying to acquire, and there is one particular revenue stream that GameStop is trying to CREATE.\n\nThe recent videos and photos of the new GameStop locations make me even more bullish on GameStop.\n\n[New GameStop 'test location'](https://preview.redd.it/ogmkyr7vsjr61.png?width=695&format=png&auto=webp&s=13c5282a9156b7e1066e3c5640fd58bd7298d413)\n\nIn the videos and photos of different locations, we clearly see 10 PC gaming stations, as well as a table for presumably board games. This is exciting. The board game market is worth $4.4bn in the US (Statista).\n\nWhat this seems to indicate, is a strategy being informed by the desire of ‘becoming the ultimate destination for gamers’ which was the title of the open letter Ryan Cohen and RC Ventures sent to the GameStop board on November 16, 2020.\n\n**Maximizing Stockholder Value by Becoming the Ultimate Destination for Gamers:** \n\n[^(https://www.sec.gov/Archives/edgar/data/1326380/000101359420000821/rc13da3-111620.pdf)](https://www.sec.gov/Archives/edgar/data/1326380/000101359420000821/rc13da3-111620.pdf)\n\n## Bear’s Advocate\n\nA bearish case could follow the lines of ‘Who would go to game in a store? Why wouldn’t they just do it at home?’ 'Kids have 5 PCs these days'. This is profoundly boomer logic.\n\nThis case ignores the social aspect of gaming. I have been an avid multiplayer gamer for the past 16 years, and there are games and moments I will remember forever — and all of them happened exclusively when I was playing with my usual crew of homies. Even approaching 30, a bunch of guys going to a LAN cafe to play Counter-Strike right now would be more fun than I’ve had in months.\n\nAlso, for the younger customers — not every kid can afford modern gaming gear. Graphic card availability and scalping are real roadblocks. Some kids can never dream of owning such a machine, but would scrape together a couple bucks for an experience they could cherish for a long time. Yes, it is just that much fun. Trying new games and new gear at low cost helps the disadvantaged customers make better decisions and build amazing brand loyalty.\n\nAdditional point: I understand that internet connection quality in the United States is a real problem in some areas. Correct me if I’m wrong, that’s just what I heard. As a European, I don’t know what that feels like, lol, although I do remember being a kid in EU, LAN cafes were the SHIT. It was either that or dial-up at home. I imagine this can be a minor bullish point for the LAN cafe GameStop vision.\n\n## The Seoul Connection\n\nHowever, a counterpoint: As of 2017, South Korea had the fastest internet connection in the world at 28.6mb/s. South Korea is a tiny country in comparison, which is why the amazing infrastructure provides 1ms gaming across the country. It is easier to be a gamer in South Korea than the US. Just look at how many RTS and MOBA players this region produces. It is an accepted career choice. Do people play at home?\n\nNot necessarily.\n\nPC Bangs are a cultural phenomenon in South Korea. There are over 20,000 PC bangs in South Korea (source: Thought Co.), and they all look something like this:\n\n[Conan checks out a PC Bang](https://youtu.be/TPXWtozVNzM)\n\nThe industry was worth around 2 trillion Korean Won in 2019, which works out at approx $1.8bn. The average rate was 1000 won for an hour of game time, or approx $0.90 / hour.\n\nSouth Korea is a country with ⅙ the population of the USA. Their GDP per capita is half of the USA. The cost of living, and therefore acceptable prices differ in South Korea. Local purchasing power is 64% higher in the US than South Korea, the price of a loaf of bread is 8% higher, utilities are 15% higher, and the average monthly disposable salary is 50%. I think taking an average of these will produce an **extremely** conservative estimation of how much more the PC bang experience could cost in the US. This value is 34.25%.\n\nThe most common rate for an hour in a PC bang is 1000 won, or $0.89. Increasing that by our 34.25% gives us almost $1.20 on the nose.\n\nThe straight purchasing power conversion (64% increase) gives us almost $1.50. I’m not an American, and I don’t know how much you guys, and your kids are prepared to pay. I would be glad to fork over $2.50 per hour. However, I’m an adult professional now, no longer a broke 15 year old kid.\n\nIt could equally be $1.5, $2, $2.5, whatever. It could be $5 — at 3 hours gaming you’re still coming out ahead bang-for-buck than you would spending 20-something dollars to see a 90 minute movie at a certain cinema chain ;).\n\n## The possibly-wonky and possibly-too-hopeful maths section\n\nIn our new GameStop presentation, I think we see 5 PC stations on each side of the room, giving 10 total, and a board game table with 5 seats.\n\n&#x200B;\n\n|Seats|Cost per hour|Hours open per month|per location per month|1 month all locations|12 months|\n|:-|:-|:-|:-|:-|:-|\n|10|$1.20|216|$2,592.00|$14,279,328.00|$171,351,936.00|\n|10|$1.50|216|$3,240.00|$17,849,160.00|$214,189,920.00|\n|10|$2.00|216|$4,320.00|$23,798,880.00|$285,586,560.00|\n|10|$2.50|216|$5,400.00|$29,748,600.00|$356,983,200.00|\n|10|$3.00|216|$6,480.00|$35,698,320.00|$428,379,840.00|\n|10|$3.50|216|$7,560.00|$41,648,040.00|$499,776,480.00 10|\n\n&#x200B;\n\nFully kitting out all their 5509 locations with 10 PCs, 11.9 million hours of gaming could take place at GameStop every month. That's assuming 10 PC average per location. I don't know how big GameStops get, and I don't know how many GameStops will be equipped this way. I don't see why not all of them, though, the $356m yearly revenue 80% profit margin is just too good. 80% profit margin I hear you say?? At full capacity, sure. So, 40% at half capacity, still 20% at quarter capacity.  Which means that this will start paying for itself very quickly.\n\n# Costs:\n\nThe setup cost seems rather negligible at around 21% at full capacity, (6.25/29.75). Kitting out 55,090 stations with a high range PC, accessories, chair and desk space, can probably be achieved for less than $2500 per unit at wholesale prices GameStop is negotiating. This would constitute a cost of $137m, so let’s round that to $150m for a bit of margin, and the interest on a leasing deal that GameStop should surely get on a purchase like that. Paying it down over 2 years, that’s $6.25m / month, against the estimated $29.75m a month all locations could bring. Better yet, in 2 years the gear should be sold off in a big sale campaign, and replaced with up to date gear. A well timed upgrade could return anywhere between 30 and 60% of the original investment. Chairs, monitors, and accessories remain.\n\n# Food and Drink\n\nWe already see a fridge and some snacks in the new GameStop.\n\nLet's say they average $1 of additional revenue from drinks and snacks per 2 hours of gaming, that would net an additional monthly revenue of $5.95 million, with a profit margin of somewhere between 20 and 50%.\n\n5.95m / (29.75m + 5.95m) = 0.166\n\nAt a $2.5 price point and full capacity at all locations, the conservative estimate of food and snack revenue would constitute 16.6% of total ‘PC Bang revenue’.\n\nThis article [http://koreabizwire.com/internet-cafes-see-little-relief-after-reopening-under-eased-social-distancing-rules/169678](http://koreabizwire.com/internet-cafes-see-little-relief-after-reopening-under-eased-social-distancing-rules/169678) Cites that in South Korea, food sales account for 30% of the revenue. However, as the article states, they serve burgers, chicken nuggets and fried rice. **GameStop will only be serving tendies.**\n\nIn Q3 2020, net GameStop sales were $1.004bn. ([https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-third-quarter-results-positive-start-fourth](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-third-quarter-results-positive-start-fourth))\n\nAt the $2.50 pricepoint, GameStop could be taking $107m per quarter from PC bang usage and refreshments at full capacity and all locations. This could be an important revenue stream and give GameStop quarterly sales a 10% boost. That will help rebound GameStop’s earnings which declined 30.2% in Q3 2020 compared to Q3 2019.\n\nSo a little estimate:\n\n($5.95m x 0.40) + ($29.75m — $6.25m) = $25.8m profit per month after food and drinks cost base + leasing and setup costs for gear. Not bad.\n\nBack to facts: As of October 31, 2020, the Company had $269.5 million of short-term debt and $216.0 million of long-term debt on the balance sheet. On November 10, 2020, the Company announced the voluntary early redemption of $125 million in principal amount of its 6.75% senior notes due 2021, on December 11, 2020.\n\n$360.5m of debt remains. The PC bang machine could pay that down in 14 months once it’s at full capacity.\n\nAt $25m profit per month, the $300m a year would increase the earnings-per-share by $4.30, which would alone almost dig out GameStop from the -$4.85 EPS for the twelve months ending OCT31, 2020.\n\nLet's remember the $1.8bn the market is worth in South Korea. $428.4m ($300m was just pure profit) is 23.7% of that. In a country 6 times as large as South Korea! Exciting figure to think about for potential growth!\n\n## A humble brand strategist’s contributions\n\nOf course, that’s not accounting for the brand loyalty, social aspect, and added sales that becoming a hangout spot will become. A fraction of the PC bang revenue, even 2-5% could pay for very competent teams in disciplines such as CounterStrike: Global Offensive, Valorant, Hearthstone, Dota2, Fortnite, and League of Legends.\n\n A mythical path from GameStop LAN cafe to the pro circuit can be created in the mind of many young gamers, and GameStop should organize events involving their team players at their venues. A 1 time splurge of $0.25-1m could pay for a pro-circuit level event in a high-viewership game like CounterStrike, where the top8 teams can easily be attracted with a $150k+ prize pool. GameStop could organize a huge online and in-store tournament to draw out the best amateur and semi-pro teams to contend against the pros on this stage. It would be an unforgettable experience for thousands of kids, and maybe the start of pro careers of a talented few.\n\nAn additional idea I would have to contribute (as a marketing professional) would be to stock the physical locations rich with PC accessories that gamers can try — they can pick whatever mouse, headset, etc. they want at the PC bang, and find the perfect one to buy for home. \n\nThey should also be able to buy the exact PC they are using at the booth at all times. One-config standard would ensure a lower price, better consistency, lower complexity, as well as being a perfectly marketable product: The ‘GameStop Gaming Station’, 'GameStation', or whatever. Updating every year or two, which is more often than the consoles, which GameStop has relied on in the past. This way, GameStop has a product that can contend with big PC builders such as AlienWare, and unlike other builder’s ranges — You can try it!\n\n**MORE ON THE ABOVE TOMORROW in the Creative Vision! (You should be excited)**\n\nThere needs to be no awkwardness with the branding — it’s not a LAN cafe (it’s not 1995), it’s not a PC bang (this is not Seoul), it’s simply… GameStop. Or even ‘The GameStop’. It’s just too perfect. GameStop will mean LAN cafe, like Uber means cars that come from your phone.\n\nGameStop has had a huge marketing campaign for free during the ‘short squeeze’ (which is over, by the way, haven’t you heard? \\*wink\\* \\*wink\\*), so the adults have seen the name flying all over the news. The millennials and younger have been investing in it. The youngest kids that come home from school and fire up Twitch? Maybe not so much. GameStop should use its recent publicity coupled with a multifront effort to BE EVERYWHERE.\n\nWe know the moves on the macro scale from the kind of people that have been headhunted for certain positions. If the Chewy model and principles are applied to GameStop in the way we think they are, this is their connection to the emotions of the customer. Just like Chewy donates food all the time and accommodates every order, even sends flowers after pets pass away because simply — every industry can be conquered with going the extra mile, beyond expectations. The GameStop experience — gaming with your friends, eating Cheetos, tournaments, random shit — will be the emotional glue that will tie this customer base to GameStop. And neither in Chewy’s case, nor in GameStop’s, is that experience cynical or calculated. It’s just the best, most awesome thing to do.\n\nAs an experienced copywriter with experience dealing with 7 and 8 figure companies, I am mainly guided by two principles: companies (B2B) buy benefits. People buy experiences. And ‘The GameStop Experience’ is looking like it’s gonna be awesome.\n\n**Stay tuned for Part 2 tomorrow!**\n\n\\-----------------------------------------------\n\nIf you enjoy my writing, you can support my full-time effort to write about this subject by visiting the link in my profile.",
    "title": "The Game Did Not Stop Project quick update, plans for the next few days; Reposting deleted DD from the old sub (PC Bang Theory: The South Korean Reason I'm Bullish on GME. A deliberation on the 'GameStop Experience'.)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mlb3nm/the_game_did_not_stop_project_quick_update_plans/"
}