{
    "author": "Aidlikeit",
    "created_utc": 1622786544.0,
    "distinguished": null,
    "edited": 1622786811.0,
    "id": "nry08g",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nry08g",
    "num_comments": 292,
    "permalink": "/r/Superstonk/comments/nry08g/media_pushing_the_narrative_that_shortsellers/",
    "score": 7372,
    "selftext": "Just look at the facts. \n\n\n- We know hedge funds are controlling a lot of media and can push narratives whenever and however they want.\n- [The post](https://www.reddit.com/r/wallstreetbets/comments/nrl0ym/short_sellers_lose_almost_5_billion_in_one_day/) gained a lot of traction on Reddit (Posted on r/WSB which is definitely compromised) \n\nFrom first sight, it's a positive one. We have won a bit, hooray, wow $5B etc., of course, it'll get upvoted (and hedgies know that that's why it's sophisticated manipulation when the post itself looks harmless and positive, but in reality, it's to give you a thought) \n\nIt's into forcing you to think $5B is a lot of money for them. (They've made much more shorting the same stocks from January to February....) \n\nThis has been pushed by the media for a week straight. Whenever meme stocks go up, they've been pushing this, again and again, talking about retail winning with their excited presenters and shorts losing a lot of money. \n\nTheir idea is to keep pushing this narrative whenever meme stocks go up, and eventually, when GME squeeze happens, to force you into thinking that it's much more than the previous time, it sure is a lot of money. \n\nNo. Bleed them dry. Hold.\n\nTL:DR **Media sucks, $5B are pennies for hedgies, celebrate when they lose at least $200B a day, don't fall for over excited news presenters**",
    "title": "Media pushing the narrative that short-sellers have lost X$ amount is a sophisticated manipulation to let you think it's a lot of money.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nry08g/media_pushing_the_narrative_that_shortsellers/"
}