{
    "author": "ISayWhenWeSell",
    "created_utc": 1622808908.0,
    "distinguished": null,
    "edited": 1622852997.0,
    "id": "ns3owq",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ns3owq",
    "num_comments": 828,
    "permalink": "/r/Superstonk/comments/ns3owq/unpopular_opinion_you_might_fud_yourself_with_69/",
    "score": 6644,
    "selftext": "Now before I get called a mayonnaise slinging shill hear me out. \n\nThis hasn't stopped me from buying, hodling and voting. This is simply a discussion I want to start to further harden our diamond hands 💎✊. \n\nFor months now apes have been telling themselves to hold and expect nothing, prepare for everything. This includes putting all your faith in specific dates. I believe the veteran apes have already been tried and tested but for the new apes out there. 6/9 is NOT the MOASS date, just because people are hyped about the meeting doesn't mean it's when MOASS will start/happen. \n\nIf you think for a second all your time and effort hinges on this date. You are playing yourself and I wouldn't be surprised if you become a paper hand. Remember to expect NOTHING.\n\nHODL 💎\n\nEdit 1: Thanks for the awards! I actually didn't see a previous post (maybe 20-30 mins) older than this.\n\nEdit 2: I have seen a few comments saying this is fud. Sorry if it appears that way. But patience is key.\n\nEdit 3: thanks for all of the awards and comments guys and gals. I am lovin6the discussions going on below.\n\nEdit 4: a fellow ape brought up a similar topic yesterday on the daily https://www.reddit.com/r/Superstonk/comments/nr819f/gme_daily_discussion_june_03_2021/?utm_medium=android_app&utm_source=share a Yokashi-Monta, it's a different take on what would happen on 6/9 take the time to read it and come up with your own thoughts\n\nEdit 5: Got that dreaded message from reddit, been reported for 'suicidal thoughts'. Looks like I triggered a couple of man children.",
    "title": "Unpopular Opinion: You might FUD yourself with 6/9. 👀",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ns3owq/unpopular_opinion_you_might_fud_yourself_with_69/"
}