{
    "author": "InvinctusSs",
    "created_utc": 1616894920.0,
    "distinguished": null,
    "edited": 1616898931.0,
    "id": "merl62",
    "text_only": true,
    "flair_text": "Shitpost",
    "name": "t3_merl62",
    "num_comments": 175,
    "permalink": "/r/GME/comments/merl62/read_this_shit_its_serious_dd/",
    "score": 2128,
    "selftext": "GUYS, NOTHING THATS HAPPENING RIGHT NOW IS JUST A COINCIDENCE.\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀\n\nAccording to FINRA ownership reports Blackrock reported on 28th of JAN 14.1 million shares of GME (UP FROM 9 MILLION at the end of 2020 [http://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=14%3A0P000002CH&sdkVersion=2.59.0](http://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=14%3A0P000002CH&sdkVersion=2.59.0)). I think Ryan Cohen and Blackrock and friends are starting to increase their stake in GME both for long term and also to increase the price from the squeeze even more because less shares available for sale.\n\n(check the situation with the previous squeeze in 08 with porche stake in vw, it s the same right now......also somebody stated out this one is a long term problem between blackrock and citadel because blackrock is highly invested in the oil industry and shorted tesla and ev and such, and the other one is long on this sector and made big bucks, making blackrock sweat some big $ short term)\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀\n\nThe fact G Sachs and M Stanley sold FUCKING billions of dollars of stocks in one day ([https://www.reddit.com/r/GME/comments/men5ta/something\\_big\\_is\\_going\\_to\\_happen/](https://www.reddit.com/r/GME/comments/men5ta/something_big_is_going_to_happen/)), which i think its the increased margin required by the sec after we've seen GME rise up from 110 to 200 to 180 because apparently this guys are clearing houses for some headgies\n\nAlso check the fuckery about that astronomical buy order from level 2.([https://www.reddit.com/r/GME/comments/mbx43o/could\\_the\\_new\\_tos\\_glitch\\_number\\_signal\\_a\\_price\\_to/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/mbx43o/could_the_new_tos_glitch_number_signal_a_price_to/?utm_source=share&utm_medium=web2x&context=3)). Last time that happened has seen us jump from 45 to 350  really fucking quick. RIght now were more or less exactly there.\n\nAlso everybudy fucking know about the certainty of the annual meeting and the obligatory share callback.\n\nEDIT 3: THE MIGHTY LORD AND SAVIOUR OF APES, on his full name DEEPFUCKINGVALUE the king of the apes, killer of the shorts, daddy of griffin and melvin HAS DELIBERATELY CHOSEN 16 APRIL expiry dates for his CALL options....he fucking knew all this time shits about to go down around this date....he's a god\n\nIM JACKED TO THE FUCKING TIIITS and maybe a little drunk\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀\n\nEDITED: ADDED LINK FOR LEVEL 2 DATA POST\n\nedit 2: added  🚀  🚀\n\nedit 4: the most important is the line up with the “release date” of GameStop squeezable cat banana... ",
    "title": "READ THIS SHIT ITS SERIOUS DD",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/merl62/read_this_shit_its_serious_dd/"
}