{
    "author": "Region-Formal",
    "created_utc": 1627909455.0,
    "distinguished": null,
    "edited": 1627936268.0,
    "id": "owe33g",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_owe33g",
    "num_comments": 93,
    "permalink": "/r/Superstonk/comments/owe33g/sp_smallcap_to_midcap_shift_everything_you_need/",
    "score": 2407,
    "selftext": "**Note 1:** I posted this a few days ago, when the S&P switch was announced, but the timing was not good (slid down the sub, when RC's tweet came out!) Re-posting, because this is critical information that I think most Apes would be both interested in *and* I feel is important to be aware of.\n\n\n **Note 2:** This is not financial advice. I am simply sharing information and data from independent research I made into my favourite stock. I have included numerous links to the sources, so please feel free to verify further. If you are interested in these topics, please carry out your own research and due dilligence.\n\n\n**0. Preface**\n\nMy good hairy Apes! Some of you may remember the DDs I published in the past, on the topic of GME moving between market indexes:\n\n*Russell rebalancing and move to the Russell 1000:*  [https://www.reddit.com/r/Superstonk/comments/nu91kx/russell\\_1000\\_many\\_poorly\\_researched\\_or\\_purely/](https://www.reddit.com/r/Superstonk/comments/nu91kx/russell_1000_many_poorly_researched_or_purely/)\n\n*Potential S&P 500 inclusion in the future:*   [https://www.reddit.com/r/Superstonk/comments/nv3n42/sp\\_500\\_index\\_inclusion\\_followup\\_to\\_my\\_russell/](https://www.reddit.com/r/Superstonk/comments/nv3n42/sp_500_index_inclusion_followup_to_my_russell/)\n\n*A prediction on why the Russell 1000 might not have as positive an impact as was being hyped:*  [https://www.reddit.com/r/Superstonk/comments/o7npci/too\\_many\\_jackedup\\_posts\\_today\\_about\\_the\\_russell/](https://www.reddit.com/r/Superstonk/comments/o7npci/too_many_jackedup_posts_today_about_the_russell/)\n\n*Some explanatory notes on why that, indeed, turned out to be the case:* [https://www.reddit.com/r/Superstonk/comments/o7vthv/price\\_action\\_in\\_the\\_last\\_few\\_minutes\\_and\\_after/](https://www.reddit.com/r/Superstonk/comments/o7vthv/price_action_in_the_last_few_minutes_and_after/)\n\nNow I see the news about GME moving indexes, from the S&P SmallCap 600 to the S&P MidCap 400, has quite rightly jacked your tits! I have received requests from a few of you Apes about my views about this announcement, hence why I am posting this DD. Here is the Press Release from S&P Dow Jones Indices announcing the change and its timing:\n\n[https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20210727-1426761/1426761\\_4xpo6lb4wri64spin2.pdf](https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20210727-1426761/1426761_4xpo6lb4wri64spin2.pdf)\n\n\n**1. What Is This Post About?**\n\nThere have been a few posts already about the impact this may, firstly this post by u/Insahnitee on how other stocks performed immediately after similar announcements:\n\n[https://www.reddit.com/r/Superstonk/comments/ot11fe/study\\_from\\_texas\\_am\\_on\\_how\\_announcements\\_for/](https://www.reddit.com/r/Superstonk/comments/ot11fe/study_from_texas_am_on_how_announcements_for/)\n\nAnd also this informative post by u/tardnugget on what the historical impact on the 600 to 400 switch has had on other stocks:\n\n[https://www.reddit.com/r/Superstonk/comments/ot3yv6/why\\_the\\_inclusion\\_in\\_the\\_sp\\_midcap\\_400\\_has\\_my/](https://www.reddit.com/r/Superstonk/comments/ot3yv6/why_the_inclusion_in_the_sp_midcap_400_has_my/)\n\nAs you can see from these posts, in general these announcements and switches have had a bullish impact on other stocks. I do not want to cover the same ground as these posts, but instead to look at the data on GME shares themselves. So this DD will go over what kind of share volume movements we may see in the ETFs tied to these two S&P indexes.\n\n\n**2.  Market Indexes**\n\nFor those Apes who do not understand what these indexes are and how they impact a stock and its share price, allow me to go over some of the basics. If you are familiar with this terminology and these financial products, feel free to skip ahead!\n\nSo what exactly is a market index? As per [Investopedia](https://www.investopedia.com/terms/m/marketindex.asp) these are:\n\n*A market index is a hypothetical portfolio of investment holdings that represents a segment of the financial market. The calculation of the index value comes from the prices of the underlying holdings. Some indexes have values based on market-cap weighting, revenue-weighting, float-weighting, and fundamental-weighting. Weighting is a method of adjusting the individual impact of items in an index.*\n\nThe key point here is that it is a *hypothetical* porfolio i.e. there are no shares held by an index itself, or the company that produces the indexes. So who makes them? Well the main players in this sub-industry within Financial services are:\n\n* Standard & Poor's\n* MSCI\n* FTSE\n* Dow Jones & Co.\n* FTSE Russell\n* S&P Dow Jones Indices\n\nThese companies - some of which are joint ventures, as seen above - produce a large number of indexes of various kinds. The two most important of these in the United States are the famous [Dow Jones Industrial Average](https://us.spindices.com/indices/equity/dow-jones-industrial-average) and the [S&P 500](https://www.spglobal.com/spdji/en/indices/equity/sp-500/), which are grouping prominent Large Cap firms (30 in the case of the DJIA, and in fact 505 in the case of the S&P 500). In the Mid Cap space, the most important index is the [S&P MidCap 400](http://us.spindices.com/indices/equity/sp-400), and for Small Caps the most important is the [S&P SmallCap 600](http://www.spindices.com/indices/equity/sp-600), which GME is currently a constituent member of.\n\n\n**3.  Index-Tied ETFs**\n\nSo if these indexes are purely hypothetical, and these companies producing the indexes do not hold any shares of the companies, then how can it have an impact on share prices? Well the answer to that is that these indexes are the fundamental basis on which the ETF market is built on. Again, as per the definition provided by [Investopedia](https://www.investopedia.com/terms/e/etf.asp):\n\n*An exchange traded fund (ETF) is a type of security that tracks an index, sector, commodity, or other asset, but which can be purchased or sold on a stock exchange the same as a regular stock. An ETF can be structured to track anything from the price of an individual commodity to a large and diverse collection of securities. ETFs can even be structured to track specific investment strategies.*\n\n*A well-known example is the SPDR S&P 500 ETF (SPY), which tracks the S&P 500 Index. ETFs can contain many types of investments, including stocks, commodities, bonds, or a mixture of investment types. An exchange traded fund is a marketable security, meaning it has an associated price that allows it to be easily bought and sold.*\n\nSome indexes are \"actively managed\", which means that their holdings are decided on by (usually) a human fund manager, and its constituents can be bought and sold at any time of their choosing by this manager. A famous example of these are the ETFs of Ark Investment Management LLC, which has made a lot of news in the last couple of years.\n\nHowever the vast majority are actually \"passively managed\", in that their constituents are not decided on by the asset management firm that manages the ETF. Instead, they track an independent benchmark - these are in almost all cases a market index of the type described in the previous section. And for the Mid Cap and Small Cap ETFs, the most important are - you guessed it! - the S&P MidCap 400 and S&P SmallCap 600.\n\n\n**4.  S&P SmallCap 600-tied ETFs**\n\nThere are a LOT of ETFs that are tied to the S&P SmallCap 600 index, including those listed within the following pages:\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-600/#index-linked-product](https://www.spglobal.com/spdji/en/indices/equity/sp-600/#index-linked-product)\n\n[https://www.spglobal.com/spdji/en/index-family/equity/us-equity/equal-weight/#indices](https://www.spglobal.com/spdji/en/index-family/equity/us-equity/equal-weight/#indices)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-growth/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-growth/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-value/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-value/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-pure-growth/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-pure-growth/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-pure-value/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-smallcap-600-pure-value/#overview)\n\nSome of these are derivative indexes, in that they use the S&P SmallCap 600 index as their base, but specifically include only \"value\" stocks or \"growth\" stocks. Note that although many of us Apes, including of course DFV himself considers GME a \"value\" stock, in fact for indexing purposes it is usually considered as a \"growth\" stock... \n\nNot all of the ETFs that have some tie to the base S&P SmallCap 600 index contain GME, but most of them actually do. I have gone to the trouble of checking the holdings of each one of these ETFs' holdings, to gather the number of GME shares held in each. The asset management companies for each ETF makes this information public, although not all of them do so with great regularity. However with the most recent data available, the S&P SmallCap 600 index tracking ETFs with the most number of GME shares includee:\n\n* IJR - iShares Core S&P Small-Cap ETF (Blackrock)  =  3,643,308 shares\n* IJS - iShares S&P Small-Cap 600 Value ETF (Blackrock)  =  470,383 shares\n* IJT - iShares S&P Small-Cap 600 Growth ETF (Blackrock)  =  329,051 shares\n* SPSM - SPDR(R) Portfolio Small Cap ETF (State Street)  =  215,696 shares\n* SLYV - SPDR(R) S & P 600 Small Cap Value ETF (State Street)  =  210,939 shares\n* VIOO - Vanguard S&P Small-Cap 600 Index Fund ETF Shares (Vanguard)  =  186,078 shares \n* RWJ - Invesco S&P SmallCap 600 Revenue ETF (Invesco)  =  143,699 shares\n\nIn fact, there are 18 such ETFs in total and, with the most recent data available, I have calculated the total number of GME shares held in these to be 5,706,189 in total. That is the number of shares that have to be re-balanced out from these ETFs by the end of the trading day next Wednesday 4th August. Note that the total value of these shares, based on yesterday's closing share price is a little over $1.0bn. For comparison purposes, this is about *four times* the number of GME shares that had to be re-balanced out of the Russell 2000 tracking ETFs last month...\n\n\n**5. S&P MidCap 400-tied ETFs** \n\nOkay, so we now know how many shares have to be removed from the S&P SmallCap 600-tied ETFs. The next step is to figure out how many will have to be added to the S&P MidCap 400-tied ETFs, to reflect the switch to this index. This is tricky for two reasons: (1) we do not know exactly which of the derivative ETFs it will be added to, and (2) we do not know how large a weighting GME will carry in the index. Before trying to tackle these problems, let me first share the ETFs tracking this index:\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-400/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-400/#overview)\n\n[https://www.spglobal.com/spdji/en/index-family/equity/us-equity/equal-weight/#indices](https://www.spglobal.com/spdji/en/index-family/equity/us-equity/equal-weight/#indices)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-growth/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-growth/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/strategy/sp-midcap-400-value/#overview](https://www.spglobal.com/spdji/en/indices/strategy/sp-midcap-400-value/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-pure-growth/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-pure-growth/#overview)\n\n[https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-pure-value/#overview](https://www.spglobal.com/spdji/en/indices/equity/sp-midcap-400-pure-value/#overview)\n\nWhat I have done to get around the problems highlighted above is to use a proxy for GME. Based on the most recent closing price, it is actually the [558th largest company by market capitalisation](https://companiesmarketcap.com/usa/largest-companies-in-the-usa-by-market-cap/?page=6) in the United States. Additionally, it is in the 'Consumer Discretionary' category that the index maker uses. The companies which are currently in the S&P MidCap 400 in this same category AND with a similar market capitalisation are the following three:\n\n* **Williams Sonoma** (ticker: WSM) - kitchen wares and home furnishings retailer, with a market capitalisation about $1bn less than GME\n* **Lithia Motors** (ticker: LAD) - automotive retailer, with a market can about $1.25bn less than GME\n* **Deckers Outdoor Corporation** (ticker: DECK) - footwear and general fashion maker, with a market capitalisation about $1.5bn less than GME\n\nThese companies are all slightly smaller by market capitalisation than GME. In fact, GME is going to enter the index as the largest Consumer Discretionary company, however of comparable size to the above three to make them good proxies. Therefore I repeated the same exercise as I carried out previously, to calculate the value of the shares of each of these companies' stocks in the S&P MidCap 400-tied ETFs. Here is what I found:\n\n**Williams Sonoma** (ticker: WSM)  =  $692m worth of shares held\n\n**Lithia Motors** (ticker: LAD)  =  $471m worth of shares held\n\n**Deckers Outdoor Corporation** (ticker: DECK)  =  $402m worth of shares held\n\nBased on GME being slightly larger than these firms, the weighting in the index for them should also be slightly larger by August 4th. However, I would estitmate that the total value of the GME shares that will be added to the S&P MidCap 400-tied ETFs will be approximately $800m. This is based on the share price being roughly around $170 on Wednesday 4th.\n\n\n**6. What Gives? That's A $200m Drop In Forecast Holdings...**\n\nIndeed, that is what the ETF data seems to point towards. Why might this be the case? I think the main factors are the following:\n\n(A)  Similar to when GME moved from the Russell 2000 to the Russell 1000, this move is also seeing them going from being a \"big fish\" in a pond full of goldfish, to a \"small fish\" in a pond filled with some large tunas. GME is currently weighted second largest in the S&P SmallCap 600, but would have a middling-to-higher position in the S&P MidCap 400.\n\n(B)  The Assets Under Management (AUM) of the S&P SmallCap 600 ETFs and S&P MidCap 400 ETFs are quite similar. In fact, the SmallCap ETFs have slightly larger total AUMs even, so combined with (A) above, it would mean there are fewer GME shares needed to correctly reflect the weighting within the index.\n\nConsequently, these calculations appear to point to the asset managers in charge of these ETFs having  to drop over a million GME shares out of these ETFs before the end of next Wednesday...  \n\n\n**7. This Is Disappointing Then, Right?**\n\nActually, potentially not! Many of you Apes might remember the huge number of hype posts before the Russell Reconstitution. The similar ETF share data calculations I carried out pointed then to a net loss of stock, and I predicted a neutral impact on the share price. That did turn out to be the case, not just in the run-up to the rebalancing going into effect, but also for about 2 weeks after. June 18th was the date that occurred, and the price had barey budged up until early July. Sideways Trading Guy was delighted!\n\nI think there are several reason that happened then, and why I predict a neutral effect again this time (i.e. not a bearish impact). Namely, these reasons are as follows:\n\n* For most stocks, the old adage is that investors *\"buy the rumour and sell the news\".* I actually think GME has been completely the opposite for some time, because those long on it - not just Apes, but institutions as well - actually *\"buy the news\"*. This is seen as a volatile stock to many outside Apedom, but with good and constantly improving fundamentals overall. Hence although some shares may get sold into the open market, I believe there are going to be plenty of buyers of the stock to negate the selling pressure.\n* This post has been about the S&P SmallCap 600 and S&P MidCap 400 ETFs, as I wanted to share the data specifically for these funds. However the move to the MidCap will postiively influence other index makers and other active fund managers to consider adding GME to their own mid-cap funds. This decision by S&P Dow Jones Indices does not compel these fund managers to make such decision, but it will certainly have a strong influence onn them to do so. As a result, I would not be surprised if GME is added to more mid-cap ETFs and mutual funds, or have its weightings increased in them due to this news.\n* Scroll up and look at the asset managers in charge of the largest of these ETFs. They are almost all the \"Big Three\" in the asset/mutual fund management world: Blackrock, Vanguard an State Street. These firms' total holdings of GME stock barely budged during the Russell Reconsitution, depite the data pointing to them having to reduce their holding to correctly reflect the change. Why? Because I think they did not sell the excess shares, but moved them from the index-tied ETFs to actively managed funds instead. \n* I am speculating here, but I actually predict the same thing will happen with this index shift too i.e. the Big Three will not reduce their overall holdings of GME shares, but instead move excess shares to other, none-index tied funds. Remember that any GME shares held in index-tied funds *cannot be sold during the peak of the MOASS*. Hence for the likes of Blackrock, having additional GME shares in actively managed funds could be enormously more beneficial when we squeeze. The more they can potentially move out of passively managed index-tied funds and into actively managed funds, the more they can potentially sell themselves and profit from during the MOASS.\n* Again speculation here, but some of you Apes may remember how the very end of Russell Reconstituton day went on June 18th. You may recall there was a huge block of volume that took place just at the start of after-market hours, which had no impact whatsoever on the price. I strongly suspect this was Blackrock and Vanguard moving excess shares from their Russell 2000-tied ETFs to their actively managed funds. Doing this would have no impact on the price, as they are in effect selling to themselves. I would not be surprised if we see something similar happening again in after-hours on August 4th, as evidence of this theory.\n\nThese Whales having even stronger incentives to kick-off the MOASS themselves, which could become the case if they increase their GME share holdings in their actively managed funds, would certainly be a bullish factor. Unforunately we would not be able to definitively verify (e.g. using 13F filings) for some time after August 4th, if this is what takes place. But this is what I am conjecturing at this point, and jacking my tits as I write this in tingling excitement for Wednesday...\n\n\n**TL;DR:**  GME is going to be shifted from the S&P SmallCap 600 index to the S&P MidCap 400 index on August 4th. There are numerous passively managed ETFs that are tied to these two indexes, and which contains GME shares in their holdings. A thorough analysis of these holding indicate that about $200m worth of GME shares may be necessary to be sold off, in order to correctly reflect the index change. However, the nature of the stock and - more speculatively, but also more compellingly - Blackrock, Vanguard and State Street have strong reasons and mechanisms not to do this. Consequently, I believe the net effect of this shift will be a neutral impact on the share price. (Of course, there are plenty of other factors which may have an effect on share price during this same time period.)",
    "title": "S&P SmallCap to MidCap shift: everything you need to know before Wednesday 4th (including ETF data on how many GME shares need to be moved by then)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/owe33g/sp_smallcap_to_midcap_shift_everything_you_need/"
}