{
    "author": "Slyver12",
    "created_utc": 1627943002.0,
    "distinguished": null,
    "edited": 1627977866.0,
    "id": "owpfc3",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_owpfc3",
    "num_comments": 346,
    "permalink": "/r/Superstonk/comments/owpfc3/will_the_real_gme_bbemg_please_stand_up_part_1/",
    "score": 2905,
    "selftext": "Because this investigative report has broader implications than just GME, a PDF version with a non-GME intro can be [found here](https://github.com/Slyver12/iterative_treemap_megacorp/blob/main/how_to_take_over_the_world_in_3M_steps_part_1_Finkle_is_Einhorn.pdf).\n\n# Part 1: [Finkle Is Einhorn](https://www.youtube.com/watch?v=Y4fI3TruAOw)\n\n&#x200B;\n\n**GME** **BBEMG = GameStop Big Bad End Monster Guy** (or as I like to call it; never pass up the chance to modify a perfectly good acronym to create a palindrome)\n\n**AKA**\n\n&#x200B;\n\nhttps://preview.redd.it/jzvqu36jr0f71.png?width=300&format=png&auto=webp&s=9bfb7d6d060acfd564ab803ef113034f735726ad\n\nWho is at the end of the GME saga? Is it really Citadel? Is it the DTC, SEC, etc.? Why has MOASS not happened yet? What game is the Evil Monster at the end playing and how do we stop it? Who **OWNS** this mess? With what this report exposes, I hope to bring us closer to answering these questions. The evidence uncovered in my investigation suggests some pretty serious problems with the entire structure of what we call “the free market”. It suggests that there is nothing “free” about it all, in fact it may be as controlled (and owned) as The Matrix itself. I highly recommend the !buckleup! tag for this one, and please keep your hands and feet inside the cart at all times.\n\n# 0.1 Preamble\n\nA few months ago Citadel was the BBEG and BlackRock was our Angel, swooping in all dark and sinister, but totally on our side with their Sword of Deep Pocket Whaleness. Everyone kept saying it, but I just wasn’t buying it. Why would the two Big Daddies controlling the long and short side of the market be in opposition? They have been playing nice with each other for decades to great mutual benefit. Why would that change? Aren’t they both in the “too big to fail” category?\n\nI began this journey then. Most of this I wrote a couple months ago or more, and have been sitting on it. Not because I didn’t want to share, but because the investigation had gotten so big I wanted to finish it before I presented my findings so I could keep it all in context. Well, that didn’t happen. I’ve written over a hundred pages of primary source findings and I’m really no where near finished, but I think I am finished enough to begin presenting the evidence.\n\nThis investigation is primarily on ***ownership***; who owns what; what benefits and responsibilities does ownership give, both by the law, and within the scope of what is realistic. Since this is a report on *current ownership*, even though it is topical to GME which we are all invested in, it isn’t really about personal finance, and should not be taken as financial advice.\n\n# 0.2 The Long And The Short Of It\n\nBefore I begin, it is necessary to understand the basics of “going long” or “selling short” on a stock. A [*long position*](https://www.investopedia.com/terms/l/long.asp) is basically placing a bet that a stock’s value will increase. A [*short sale*](https://www.investopedia.com/terms/s/shortselling.asp) is basically placing a bet that the stock’s value will decrease. Of course that is an oversimplification, but it's all you need to know before beginning this report.\n\n# 1.0 Your Favorite Companies!\n\nUnless you shop at Walmart, Costco, or Amazon exclusively (no judgments!), you probably buy your clothes from one store, your groceries from another, and your electronic devices from a third. Maybe you even buy these consumables at multiple different stores in each category. All of these different retailers and brands obviously have nothing in common; oftentimes they are fierce competitors.\n\nAs smart shoppers we find the stores with the best prices, each store hawking their wares with ads and sales, all vying with each other for our hard earned cash. When we aren’t shopping or working we spend a fair bit of our free time watching shows on competing cable stations or the online equivalent (Netflix e.g.), or reading news through a plethora of competing news sites that are trying to get us excited with eye popping headlines, or maybe interacting with our friends, relatives, and the world at large through games, social media platforms, or other interactive media.\n\nBut are these really different companies competing for your time and money in a free market; full of original ideas and products? Or has the entire concept of a competitive market, and the free flow of information and trade become nothing more than a *game of pretend* we are forced to play? Does the market really encourage *any* innovator to introduce their ideas for public judgment? Or does judgment come long before the public even knows about an innovation? (E.g. [naked shorting](https://www.wraltechwire.com/2020/07/21/redhill-biopharma-requests-sec-review-of-suspicious-trading-activity/) biotech [research start-ups](https://www.reddit.com/r/Superstonk/comments/ndrjl8/naked_short_sellers_have_set_our_cancer_research/), or [EVtech companies](https://www.reddit.com/r/Superstonk/comments/of8o42/shitadel_and_friends_are_shorting_innovative_ev/).)\n\nDoes the money from every purchase go into the same corporate pocket, no matter which sign hangs over the door?\n\n# 1.1 Your Favorite Companies?\n\nThere are certain “investment firms”, such as Blackrock, Vanguard, State Street Corporation, JP Morgan, BofA, Fidelity (FMR LLC), Northern Trust Corp, etc., etc. who have purchased large percentages of stock in every company in America that has a name big enough to make a blip on their radar (and many that have yet to do so). When you add up the ownership of all these investment firms into any random production or retail company it totals anywhere from a very large minority (40%+) all the way up to nearly 100%.\n\nExamples: [Intel](https://www.wallstreetzen.com/stocks/us/nasdaq/intc/ownership) 63% and [AMD](https://www.wallstreetzen.com/stocks/us/nasdaq/amd/ownership) 67% (note that these are not the complete list, just the top ten):\n\n&#x200B;\n\nhttps://preview.redd.it/7rukpcrdr0f71.png?width=588&format=png&auto=webp&s=625ff6bc5aaf8bc2a6496cc262cdd9c280cbeb73\n\nHere are a few more that show the approximate **institutional ownership** of some mostly random corporations; sourced from [finance.yahoo.com](https://finance.yahoo.com/) and [www.wallstreetzen.com](http://www.wallstreetzen.com/).\n\n&#x200B;\n\n* [Walmart](https://finance.yahoo.com/quote/WMT/holders?p=WMT) 43%\n* [Target](https://finance.yahoo.com/quote/TGT/holders?p=TGT) 83%\n* [Apple](https://finance.yahoo.com/quote/AAPL/holders?p=AAPL) 59%\n* [Tesla](https://finance.yahoo.com/quote/TSLA/holders?p=TSLA) 45%\n* [Facebook](https://finance.yahoo.com/quote/FB/holders?p=FB) 81%\n* [Google](https://finance.yahoo.com/quote/GOOG/holders?p=GOOG) 70%\n* [Amazon](https://finance.yahoo.com/quote/AMZN/holders?p=AMZN) 65%\n* [Disney](https://finance.yahoo.com/quote/DIS/holders?p=DIS) 67%\n* National Amusements (traded though its subsidiary: [ViacomCBS](https://finance.yahoo.com/quote/VIAC/holders?p=VIAC) 88%)\n* [AT&T](https://finance.yahoo.com/quote/T/holders?p=T) 53%\n* [Comcast](https://finance.yahoo.com/quote/CMCSA/holders?p=CMCSA) 86%\n* [News Corp](https://finance.yahoo.com/quote/NWSA/holders?p=NWSA) 76%\n* [Sinclair Broadcasting Group](https://finance.yahoo.com/quote/SBGI/holders?p=SBGI) 88%\n\nSome of the institutional ownership is tied up in funds, but the majority of this ownership is in long term investment. This not only gives these investment firms collectively a majority share in equity and profits, but also voting rights. For the vast majority of the companies we buy from, these institutions have (if taken together) the majority voting rights to decide who runs the companies and how they handle their assets. Whether or not they use those voting rights to make decisions for these companies is not the focus of this research. I am only pointing out that the ownership trail suggests that *they can if they want to*.\n\nThis report will focus primarily on American or American based international companies, but this institutional ownership is not restricted to just these. While some of the data (that I know how to access) gets a little more muddy, here are a couple examples of foreign based companies that are owned in large part by the exact same investors:\n\n&#x200B;\n\n* [Alibaba](https://finance.yahoo.com/quote/BABA/holders?p=BABA) 38% (China)\n* [Prudential](https://finance.yahoo.com/quote/PRU/holders?p=PRU) 57% (UK)\n* [Teva Pharmaceuticals](https://finance.yahoo.com/quote/TEVA/holders?p=TEVA) 53% (Israel)\n* [FirstRand](https://finance.yahoo.com/quote/FSR.JO/holders?p=FSR.JO) 50% (South Africa)\n\nThe list, foreign and domestic, goes on, and on, and on, and on…\n\nForever.\n\n# 2.0 The Company Your Company Keeps (That Keeps Your Company)\n\nBy looking at the investment data, since each large company is primarily owned by most of the same investment firms, it would be reasonable to assume that the real competition is in the investment firms themselves. That it is they who compete with each other for profits, and argue over who gets which part of the market. They fight with each other over which stores and brands get to rise to the top, and who gets shorted out of existence.\n\nThis assumption would be completely wrong.\n\nAll the investment groups I listed above, and every single one of those not listed that I have been able to find records for (including all privately owned), all own just as much of a share of each other as they do in all the other world's corporations. Here are just a few examples (from [wallstreetzen](https://www.wallstreetzen.com/stocks/us/nyse/blk/ownership)):\n\n&#x200B;\n\nhttps://preview.redd.it/ltk07gmar0f71.png?width=588&format=png&auto=webp&s=2911940816204311cab8aefc66d3315c6d8107d0\n\nHere are a few more: [JP Morgan](https://finance.yahoo.com/quote/JPM/holders), [Charles Schwab](https://www.wallstreetzen.com/stocks/us/nyse/schw/ownership), [Ameriprise Financial Inc](https://www.wallstreetzen.com/stocks/us/nyse/amp/ownership), [Bank of New York Mellon](https://www.wallstreetzen.com/stocks/us/nyse/bk/ownership). I’ll get to Vanguard in section 2.3, but here is ownership in a [sample Vanguard fund](https://www.vanguard.com/pub/Pdf/sai040.pdf) (Investment holdings start on page 34).\n\n&#x200B;\n\nhttps://preview.redd.it/e04a5q59r0f71.png?width=782&format=png&auto=webp&s=5af4eac82728f7b44dc692e1efed776aa9a3d8f4\n\nBy all appearances, at least on the large scale, the connectivity of the investment firm network seems to be very close to all nodes are directly connected to all nodes. A big black spider web of corporations.\n\n# 2.1 Who’s The Real Spiderman?\n\nhttps://preview.redd.it/ungn7yk5r0f71.png?width=828&format=png&auto=webp&s=e572172309906149dc151b25f771f55bca5c17e0\n\nThis shared ownership seems shocking (at least it shocked the shit outta me) but the full implications aren’t obvious without some analysis. I will start with a simple math example (really).\n\n# 2.1.1 Mr. Hankey The Christmas Poo\n\nhttps://preview.redd.it/snrvmqp4r0f71.png?width=300&format=png&auto=webp&s=b0ef1081eb6cba7c95022d327135b823d1464869\n\nLet's say I own an investment company named **Money Inc**.. I’m competing for investor monies with my friend Cartman who owns **Fat Money**. Down the street is a former friend of ours named Kenny. He owns **Money Castle.** Kenny is short, has a speech impediment, and steals some of our customers sometimes.\n\nOn the edge of town there is a really nice big fat juicy new up and comer company named **HankeyPoo** that I want to invest in. I really like the stock so I buy 20% of the company. I tell Cartman about it and he agrees with my assessment. He buys 20% as well. Unfortunately Kenny got (down) wind and buys up another 20%. As much as I don’t like Kenny, he does have a nose for investment opportunities. HankeyPoo now has 60% institutional ownership. Combined our ownership gives us a lot of control over what kind of shit goes on at the company if we choose to use our \"Poo\" leverage, though there is little apparent motivation for us to work together since we are obviously competitors. The rest of the town loves HankeyPoo. They seem to think his shit don’t stink and scoop up 20% of “The Poo” (Retail). Hankey decided to keep 20% of The Poo in house (Insider).\n\nHere are ownership maps of what these four companies look like:\n\n&#x200B;\n\nhttps://preview.redd.it/gp1o4mv3r0f71.png?width=1235&format=png&auto=webp&s=7c483122f2c01ff8259d9f83b7e214a0fa33cdef\n\nThese pictures are created by an ownership Treemap program I wrote. The code and the database can be [found on github](https://github.com/Slyver12/iterative_treemap_megacorp). A Treemap is a graphical display of data that shows a distribution by percent of something in 2D rectangles. In this case it is relative percent ownership of voting stock. Each sub-rectangle is, by area, a percent of the area of the whole square. For example, in the case of HankeyPoo above it shows that Money Inc (red), Fat Money (green), Money Castle (blue), Retail (white) and Insider (gray, Mr. Hankey himself) all own 20% each of the voting stock of HankeyPoo since their area is in each case 20% of the area of the larger containing square. By contrast, in the case of the three investment companies above; Money Inc, Fat Money, and Money Castle, it shows that they are 100% self owned; they are clearly different companies.\n\nPleased with my HankeyPoo investment, and having some extra cash, I look elsewhere for investment opportunities. I’ve always really liked Cartman’s company. He may be a slob, but he’s a savvy slob. I decide to buy up a third of the total shares in his company. Being nice, I let him know. He decides that’s a good idea and buys up 33% of mine as well. Neither of us like Kenny very much so we each decide to snag up as much of his company as we can. We buy out 33% each for a total of 66% ownership. Unbeknownst to us, Kenny, being not as stupid as we thought despite his speech impediment, bought up 33% of each of our companies as well.\n\nAs far as HankeyPoo is concerned, we each still own 20% of that company, even though we only own 33% of our own company. For example; I own 1/5 of 1/3 = 1/15 through my own company, and 1/5 of 1/3 through both Cartman’s and Kenny’s companies. That’s 1/15 + 1/15 + 1/15 = 3/15 = 1/5 = 20%. Together we still own 60% and the voting majority. Here is the new ownership treemap:\n\n&#x200B;\n\nhttps://preview.redd.it/6rfyk1m2r0f71.png?width=1235&format=png&auto=webp&s=a7735b87580c80b44ce7d82e6d2cc807eb56906d\n\nWhile I may still be CEO of my company Money Inc., I have to respect that I have broader interests now. It behooves me to coordinate and work with both Cartman and unfortunately Kenny since its really difficult to tell, by ownership anyways, who owns which company. As far as how invested we are in both each other and HankeyPoo, we might as well be one company with three different “investor” doors and one “retail” door.\n\nIf HankeyPoo does well (and we’ll make sure it does, with \"brown gift bags\" at Christmas time) we will have plenty of money to invest in other companies in the same manner; all coordinating for the best interests of each other and of course the corporations we deem worthy. For any companies we don’t like, maybe just because they won’t sell us controlling interest, or we just think their shit stinks, we’ll have the capital to short them out of existence. Any competition to the corporations we own gets deleted if they choose not to join us. If they play ball, they can join our “free market”. All we would need to ensure a dominant victory in our little version of “capitalism” is a little help from the media to drive appropriate emotional responses from the public; lean them towards a company or away from it with selective advertising. It’s a good thing our companies already own the local news paper!\n\n# 2.1.2 The Hanky Panky Poo Poo BlackRock Shuffle\n\nWith HankeyPoo in mind, lets look at a Treemap of percent ownership of a few different investment companies. Lets start with BlackRock, the largest institutional investor in the world.\n\nWhen you walk up to the door, BlackRock looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/bscgrp40r0f71.png?width=600&format=png&auto=webp&s=d660b758307f7bc1674d310b304836efd52a98b7\n\nIt’s a big, bad ass company, and Larry Fink is the all powerful deity in control of assets worth almost half of America’s GDP. But does Larry own BlackRock? When you look into the actual ownership, the voting rights, equity, etc. it looks like this (from [wallstreetzen](https://www.wallstreetzen.com/stocks/us/nyse/blk/ownership)):\n\n&#x200B;\n\nhttps://preview.redd.it/xn4xc0ezq0f71.png?width=600&format=png&auto=webp&s=1af4747a2baec236de1e57f0d5d194b34cb214a3\n\nIt looks to me like Merrill Lynch owns BlackRock for the most part. BlackRock only owns 6.5% of BlackRock. Hell, even Vanguard owns more.\n\nBut this is an illusion as Merrill Lynch is a wholly owned subsidiary of Bank of America. So BofA is the real owner of this megamachine. Well, not really, because Bank of America doesn’t own Bank of America. When I add the actual ownership of Merrill Lynch (BofA) into the Treemap it looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/2f6mcl0yq0f71.png?width=600&format=png&auto=webp&s=7d351316bf45d66271443f8af1c06247bceeada5\n\nWe see BlackRock actually owns more BlackRock than we thought through ownership of Merrill Lynch. Quite a bit of BR is owned by Berkshire Hathaway. I delved into Berkshire a bit and there are interesting things to say about it, but I won’t discuss it in this report. This apparent ownership is still illusory, since all of the companies other than Merrill Lynch/BofA are also owned by other companies. If I fill out the rest of the Treemap with their ownership it looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/d6nl01vwq0f71.png?width=600&format=png&auto=webp&s=a117de7ede5d72acb884ebaa59f891efaf35dcc8\n\nSo here at last is BlackRocks ownership. Except of course its not because each of these companies are also owned by others. If I fill in all of these companies with their ownership it looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/zv51nkawq0f71.png?width=600&format=png&auto=webp&s=6639f809139077e0406ca8627e1a5e8f846065fc\n\nAs you keep filling in the ownership further and further eventually it gets below the resolution of the screen, or your eye, or the wavelength of light. For a simple example I will show this iterative “actual ownership” replacement for HankeyPoo Inc.\n\n&#x200B;\n\nhttps://preview.redd.it/exkp0bxuq0f71.png?width=830&format=png&auto=webp&s=943475e0ceffae95e8bcfb33b438a3dc7bd5cee3\n\nUsing this same process for BlackRock it looks something like this:\n\n&#x200B;\n\nhttps://preview.redd.it/vjgejmstq0f71.png?width=600&format=png&auto=webp&s=7011977c49875fe04b880e0f45f83a3423b8fcbe\n\nWelcome to BlackRock. The name is certainly fitting. In this Treemap the white represents Retail investors, the gray represents non-institutional insider investment (the actual people we think of as \"owners\") and the black represents the Big Bad megamachine: **Megacorp.** (*Spoiler alert*: it’s not really the Big Bad. We have a ways to go for that reveal.)\n\nIn order to justify this model, I need to justify some of the larger contiguous chunks of black that have no white or gray speckles. These large black areas are due to a few reasons:\n\n&#x200B;\n\n1. Some of it is due to an incomplete database for some smaller contributors to Megacorp.\n2. Some of it is because my computer pukes on me when I try to force my inefficient Treemap algorithm through it at too great an iteration depth.\n3. Some of it is “Other Institutions” that represents either the balance between the top 25 institutional holders and the rest (also all Megacorp), or stock \tthat is tied up in mutual funds (which means the actual institutional ownership of some of the larger institutions may be \thigher).\n4. The rest of it is investment institutions without public stock offerings (Fidelity e.g.).\n\n1, 2, and 3 add only very small sprinkles and are otherwise irrelevant to the overall map; their lack of inclusion is reasonably justified. A more complete database would produce the same results with a few more small sprinkles mixed in.\n\nAs for 4, that requires further justification. Those black contributions could potentially be all gray for example (100% owned by insiders). Trying to find the real ownership of these non-public companies (like Fidelity) is like trying to pull out your own teeth with your fingers; its slippery, a little painful, you look silly trying, and its ultimately probably impossible. Maybe someone knows exactly where to look for this information, but I do not.\n\n# 2.2 FMR LLC aka Fidelity (miniboss)\n\n**TL;DR for section 2.2**: Some of the large black parts of the graph are investment corporations which are not publicly offered and thus do not report who owns their voting stock (that I could find). In this section I investigate Fidelity, one of the largest asset managers in the U.S. and make a case for why the black is justified, not only for Fidelity (the largest contributor by far), but by extension for all private investment institutions. I touch on this private ownership again in section 4 (Citadel). These large black sections should have some gray in them (likely small insider ownership) and sprinkles of white (from the member corporations that make up the real ownership) but are otherwise justified as the black hole that is Megacorp.\n\nOther than making this case, section 2.2 is not fundamental to the larger picture.\n\n\\-----------------------\n\nBecause Fidelity is one of the largest asset managers in the world, I investigated it a bit when putting together my database to try to make a more accurate map. I will go over my findings briefly (my investigation into this could have been more extensive).\n\nMy core research tool for this investigation is a [Statement of Additional Information](https://www.amegybank.com/content/dam/abt/amegybank/docs/pws/Fidelity%20Statement%20of%20Additional%20Information.pdf) (SAI) from the Fidelity parent company FMR LLC.\n\nI looked through this source trying to answer the following questions:\n\n&#x200B;\n\n1. Who are the primary investors in FMR LLC funds?\n2. What rights and influence do institutional investors have over fund management as a portion of \tthe size of their investment in that fund?\n3. How much voting stock of FMR LLC is owned by institutions?\n4. How much voting stock is owned by “the owners”?\n\nThe first questions are important because a great deal of the over [$10 Trillion dollars](https://www.fidelity.com/about-fidelity/our-company/) in managed assets in FMR LLC subsidiaries are in funds. I looked in the [15 U.S. Code Title 15 – Commerce and Trade](https://www.law.cornell.edu/uscode/text/15), but it was not clear and time is not infinite: there are bigger fish to fry (I did find a juicy tidbit I will disclose later though, so all was not in vain). Fortunately some hints at the answers are found within the SAI itself.\n\nPage 22:\n\n>**Fidelity® funds are overseen by different Boards of Trustees**. The funds’ Board oversees Fidelity’s investment-grade bond, money market, asset allocation and certain equity funds, and other Boards oversee Fidelity’s high income and other equity funds. The asset allocation funds may invest in Fidelity® funds that are overseen by such other Boards. **The use of separate Boards, each with its own committee structure, allows the Trustees of each group of Fidelity® funds to focus on the unique issues of the funds they oversee**, including common research, investment, and operational issues. On occasion, the separate Boards establish joint committees to address issues of overlapping consequences for the Fidelity® funds overseen by each Board\n\nSo each fund (or fund group?) is managed separately. Some trustees are listed (starting on page 22). There are both “Interested\\*” and “Independent” Trustees. Most of the Trustees are Independent. So what do the *owners* of the actual company called Fidelity do, pick out bathroom towels?\n\n\\* Interested Trustee is defined on page 22 as:\n\n>Determined to be an “Interested Trustee” by virtue of, among other things, his or her affiliation with the trust or various entities under common control with FMR.\n\nThe main difference I see looking at the descriptions is the Interested are upper management of FMR and the Independent are not employed by FMR. There are only two Interested listed, and eight Independent. It is unclear which fund this board of Trustees manages. If its “all”, that goes against what is said above about each fund being managed by its own board. Regardless, there are many more on the Board that are not otherwise affiliated with FMR than are. The Independents are also largely affiliated with other members of Megacorp.\n\nWho owns the voting stock of FMR LLC? According to page 35:\n\n>FMR LLC, as successor by merger to FMR Corp., is the ultimate parent company of FMR, FMR UK, Fidelity Management & Research (Hong Kong) Limited (FMR H.K.), and Fidelity Management & Research (Japan) Limited (FMR Japan). **The voting common shares of FMR LLC are divided into two series. Series B is held predominantly by members of the Johnson family, including Abigail P. Johnson, directly or through trusts, and is entitled to 49% of the vote on any matter acted upon by the voting common shares. Series A is held predominantly by non-Johnson family member employees of FMR LLC and its affiliates and is entitled to 51% of the vote on any such matter.** The Johnson family group and all other Series B shareholders have entered into a shareholders’ voting agreement under which all Series B shares will be voted in accordance with the majority vote of Series 35 B shares. Under the 1940 Act, **control of a company is presumed where one individual or group of individuals owns more than 25% of the voting securities of that company.** Therefore, through their ownership of voting common shares and the execution of the shareholders’ voting agreement, members of **the Johnson family may be deemed**, under the 1940 Act, to form **a controlling group** with respect to FMR LLC.\n\nSo the Johnson family owns a “predominant” number of Series B stock, which is entitled (in total) to up to 49% of the vote. The majority of voting stock (51%) is the Series A stock, which is held by other entities, notably FMR LLC’s “[affiliates](https://www.investopedia.com/terms/a/affiliate.asp)” (which could be anyone). Note it also says that the Johnson family *may be deemed* to form a controlling group (they “may” have 25% voting stock AND more than anyone else, or they may not). The word “may” is very important. It doesn’t say “shall be deemed”, it says “may be deemed”. In official documents like this, words matter a great deal as I will show with examples in later sections. The word “may,” could be [imperative](https://legal-dictionary.thefreedictionary.com/May), or it could be [permissive](https://www.law.cornell.edu/wex/may); it is ambiguous in this statement without further clarification.\n\nSo is the Johnson family actually a controlling group? This official document does not state that clearly, so it is unknown if they even *control* the company, much less own it. In fact it states they do not own it, owning **at most** 49% of the FMR voting stock (it implies it is less, maybe even a lot less). The statement of ownership of funds within this document makes it clear the Johnsons do not own a majority of any fund either (beginning on page 32).\n\nIf you look at the fund investors list its almost all banks. Banks are 100% Grade AAA pure Megacorp as I will show later.\n\nThis is a small snippet of a fund ownership. Note the “Treasury Portfolio” as it will come into play in later sections.\n\n&#x200B;\n\nhttps://preview.redd.it/6ijf37vn01f71.png?width=814&format=png&auto=webp&s=98d3fc46643de03a3fee16c84963e0baa9ee2205\n\nSo what do the “owners” of FMR LLC do? (page 35):\n\n>At present, the primary business activities of FMR LLC and its subsidiaries are:  \n>  \n>(i) the provision of investment advisory, management, shareholder, investment information and assistance and certain fiduciary services for individual and institutional investors;\n\nGive advice and information.\n\n>(ii) the provision of securities brokerage services;\n\nAct as a broker.\n\n>(iii) the management and development of real estate;\n\nPick out bathroom towels?\n\n>(iv) the investment in and operation of a number of emerging businesses.\n\nInvest in (and operate???) emerging businesses.\n\nThat last may be significant, if rather vague. So I guess the managers do something. It still isn’t perfectly clear how much operational control the managers actually have. It also isn’t clear how easy it is to overrule them if some other entity wishes it; perhaps an entity with possibly even more FMR LLC shares, and/or majority monetary investment “control” of a fund.\n\nSince the vast majority of FMR LLC monetary control seems to lie in the fund trustees, which seem to be membered by different persons depending on the fund, and are not necessarily controlled by the owners of Fidelity, I think it is safe to assume that FMR LLC is, at least in large part, Megacorp as defined; both in the money invested in the company itself (voting shares), and in ultimate control of much of the assets. I believe the Black on my graph is justified. It should probably have some gray (Johnson Insider), though there is no way to determine how much from the information I have seen so far, and certainly will have no Retail white (as a measure of ownership or control).\n\n\\----------------------------------------\n\n**This is not the end of part 1!!!** Stupid 20 image limit killed me.\n\nEdit6: Superstonk mod approved [part 2 here](https://www.reddit.com/r/Superstonk/comments/ows1a2/will_the_real_gme_bbemg_please_stand_up_cont_part/). We are still not sure why it kept getting deleted. I think it was probably a link that was disapproved by a larger Reddit wide automod (though no one has any idea which link it might be). If there are still problems, there are links to two sources for the pdf in the edits below.\n\nEdit5: A mod on DDintoGME approved my [second post here](https://www.reddit.com/r/DDintoGME/comments/owrq55/will_the_real_gme_bbemg_please_stand_up_part_1/). Please let me know if it works. Maybe I can get it to work on Superstonk as well.\n\nEdit: The part 2 post seems to be getting removed for reasons that are unapparent (works perfectly fine for me). I will figure out why and get a working \"part 2\" link up. In the meantime, [part 2 can be found in the PDF](https://github.com/Slyver12/iterative_treemap_megacorp/blob/main/how_to_take_over_the_world_in_3M_steps_part_1_Finkle_is_Einhorn.pdf) (also linked at the top of the post). Only the intro is different between the pdf and these posts. A few people have said the pdf doesn't fully load for them on github. Most have said it works just fine. It can be downloaded from there as well if you can't get it to fully load.\n\nEdit2: Please let me know if this [link to part 2](https://www.reddit.com/r/Superstonk/comments/ows1a2/will_the_real_gme_bbemg_please_stand_up_cont_part/) (of part 1). I think the title was the problem (duplicate title?) Please tell me this fixed it!\n\nEdit3: I've contacted the mods to hopefully figure out why I can't post part 2 (of part 1). If and when they get back to me I will get the link up. In the meantime, please use the pdf hosted on github (linked above).\n\nEdit4: Here is an [alternate link](https://www.docdroid.net/gUhs7kI/how-to-take-over-the-world-in-3m-easy-steps-part-1-finkle-is-einhorn-pdf) to the pdf since some people are having difficulty viewing it on github. I really hope a mod gets back to me on why part 2 won't post. :(",
    "title": "Will The Real GME BBEMG Please Stand Up; Part 1: FINKLE IS EINHORN",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/owpfc3/will_the_real_gme_bbemg_please_stand_up_part_1/"
}