{
    "author": "Bladeace",
    "created_utc": 1623815974.0,
    "distinguished": null,
    "edited": false,
    "id": "o0w63b",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o0w63b",
    "num_comments": 79,
    "permalink": "/r/Superstonk/comments/o0w63b/005_question_did_the_dtcc_just_pseudorecall_all/",
    "score": 570,
    "selftext": "TL;DR: 005 clarifies that all borrowed securities remain in the lenders account. Does this mean all lenders will ask for the shares they are currently loaning out to be placed in their accounts? \n\nu/EvilBeanz59 asked the below question in [my post about 005](https://www.reddit.com/r/Superstonk/comments/o0rkj7/big_deal_rule_005_prevents_pledged_securities/?utm_source=share&utm_medium=web2x&context=3):\n\nhttps://preview.redd.it/pqu1r1dvtj571.png?width=959&format=png&auto=webp&s=7cf12d62428eed028c64cb4d386561bed105f9a0\n\nAfter a few hours of looking around and thinking about the issue - I have no idea. So, I've started this discussion thread in the hope that wiser apes can help!\n\nIf 005 clarifies that borrowed shares are supposed to be in the account of the lender and not the borrower... does that mean the DTCC just issued a recall of every single lent share? As in, 005 = \"all borrowed shares are supposed to be in the lenders account and we don't consider this a new rule, you should already be doing this effective immediately\". I mean, clearly this isn't what it means: a dramatic act like that is just not what we expect from the DTCC.\n\nIf 005 does mean all currently borrowed shares should be in the lenders account, this is fine for most short positions because they simply move the shorted share from their account to the lender. It's just paperwork. But for anyone who already used the borrowed shares for shenanigans, it's a disaster because they don't have a share in their account to move back. To them, it's effectively a share recall. If they've used these shares to create a messy rehypothecation web... well, I have no idea... \n\nFurthermore, the onus would be on the lender and not the borrower to have the share in their account. So, the borrower can't just mislabel or lie to solve the problem, they'd need the lender to be willing to lie. Even worse, aren't the lenders often banks? Blackrock?\n\n&#x200B;\n\nI want to stress that I don't know the answer to this and I am ***not*** trying to claim that the DTCC is about to simultaneously enact a market wide recall of all rehypothecated-shenanigan-shorts without harming normal shorts. Given their past behavior, it seems more likely the DTCC will do nothing of the sort even if it has the power to do so. My question is: what, if anything, does 005 mean for shares that have already been lent out and can't be returned to the account of the lender? I really have no idea, any thoughts?",
    "title": "005 question - did the DTCC just pseudo-recall all shorts? I mean, obviously they didn't because that would be far too helpful! But, 005 does seem to imply they expect all borrowed shares to be in the lenders account effective immediately... I need an adult, help please???",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0w63b/005_question_did_the_dtcc_just_pseudorecall_all/"
}