{
    "author": "pinkcatsonacid",
    "created_utc": 1622578845.0,
    "distinguished": "moderator",
    "edited": 1622583880.0,
    "id": "nq3jw7",
    "text_only": true,
    "flair_id": "f1616402-b693-11eb-a256-0e4ef3af69e3",
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_nq3jw7",
    "num_comments": 852,
    "permalink": "/r/Superstonk/comments/nq3jw7/the_jungle_beat_tuesday_06012021_dfv_returns_all/",
    "score": 7266,
    "selftext": "*This piece will be posted at 4:20 pm NYSE time every trading day!*\n\nhttps://preview.redd.it/edyt4p4xjo271.png?width=1426&format=png&auto=webp&s=4b0e3095dcb23e3a19183f9f81cac69e004d94bd\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎶🎤🎸🥁 🦍Welcome to the Jungle🦍🥁🎸🎤🎶\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# $GME Closing Price: $249.02\n\nOpen Price: $233.51\n\nDaily High: $254.95\n\nDaily Low: $227.07\n\nVolume: 9.35 MM\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# ✏🚌 GME 101 🍎🖍\n\n*If you're new to Superstonk, start here!*\n\n&#x200B;\n\n[WeBull's $GME rating 06-01-2021](https://preview.redd.it/yx44si56dp271.jpg?width=1079&format=pjpg&auto=webp&s=2cf3586300412671d3e92158cc7934cc100c10ca)\n\n&#x200B;\n\n[Superstonk FAQ](https://www.reddit.com/r/Superstonk/wiki/index/faq#wiki_how_do_i.2C_as_a_retail_investor.2C_stand_a_chance_against_the_hedge_funds.3F)\n\n[Superstonk Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\n[The Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[House of Cards I, II & III in PDF format](https://www.reddit.com/r/Superstonk/comments/nm83eb/a_house_of_cards_parts_i_ii_iii_in_pdf/)\n\n*More DD to be added as we develop this section! This will be a daily recurring section that will serve as a go to reference for new apes!*\n\nAlso, as you probably know, [u/Atobitt](https://www.reddit.com/u/Atobitt/) has dropped HOC II&III. Pretty sure it crashed reddit when it dropped!! This piece was peer reviewed by such prominent experts as Wes Christian, Dave Lauer and mods as well. The apes of Superstonk sincerely appreciate the time and effort put into getting this information out there. 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎮 Game Stop 🛑\n\n&#x200B;\n\n**If you haven't yet, you need to read** [**this VIP (Very Important Post)**](https://www.reddit.com/r/Superstonk/comments/nplhx7/game_stop/) **by** u/redchessqueen99\\*\\*. Every ape must read!\\*\\*\n\n&#x200B;\n\nhttps://preview.redd.it/xkrglcsfxo271.png?width=2084&format=png&auto=webp&s=0214e588471e036a282ed27436896ac68b16afaa\n\nSo last night we kicked off **SATORI, our shill detecting AI.**\n\n&#x200B;\n\n# Here to answer ape's questions is our wonderful ape-bassador, u/Bradduck_Flyntmoore with this awesome TL;DR FAQ:\n\n&#x200B;\n\nHowdy apes! [u/Bradduck\\_Flyntmoore](https://www.reddit.com/u/Bradduck_Flyntmoore/) here! As the Ape-bassador, it brings me real joy to see how excited everyape is about this. I can assure you, the mod team is equally excited. This new endeavor has a lot of potential, and I cannot wait to see it in action. That being said, the point of this sticky comment is to answer some of the questions (paraphrased) apes are having about Satori. I will be updating this sticky comment as I find more questions to answer. 🙏\n\n&#x200B;\n\n**Q**: I haven't been approved yet, does that make me a shill?\n\n**A**: *No, ape, it does not. Satori is approving apes in waves, and likely has not gotten to you yet. Just hodl on and all will be well.*\n\n**Q**: What if the new bot overlords get carried away?\n\n**A**: *I also fear potential technological overlords, fellow ape! Because of this, I asked the dev team for a LOT of clarifications on function, method, and execution. Obviously I can't say too much, but please have my assurance that the mod team is able to turn it off any time. Additionally, mods are able to prompt it to do things, or prevent it from doing things, or even undo things it has done. Again, anytime mods feel it is required.*\n\n**Q**: How long will it take Satori to get through the waves of approvals?\n\n**A**: *Sorry, fellow ape, you'll just have to be patient. Mods played this one close to the vest for a reason, and to give away extra info now would be counter-productive.*\n\n**Q**: Does Satori work retroactively or will it just look at the content on Superstonk moving forward?\n\n**A**: *Yes. Both. Satori looks at ALL publicly available posts and comments on the sub.*\n\n**Q**: How does approval work? Do I need to do anything?\n\n**A**: *Just sit back and relax. Approval will come automatically; no action is required.*\n\n**Q**: Why was Satori approved without unanimous approval from the mods?\n\n**A**: *This is a fair and honest question, and I believe apes deserve to know the answer. The final vote tally was 10 for; 0 against; 2 abstain. Unfortunately, sometimes IRL events prevent mods from voting (decisions need to be made in a timely manner, after all), hence why not all mod votes are accounted for.*\n\n**Q**: What if my karma/age requirements are already high enough, do I still need to be approved? What if I do not receive approval, does that mean I get banned?\n\n**A**: *The approval process is to allow apes without the karma/age requirements the ability to participate in the sub. If you already have the required age/karma, AND if you do not get banned, there is nothing to fret over. Just carry on like Satori isn't even there.*\n\n**Q**: What sort of transparency exists between mods for how Satori is used?\n\n**A**: *All mods have access to the equivalent of a mod log for Satori. We can all see what actions it, and each other, take.*\n\n**Q**: Will Satori continue monitoring users after they have been approved?\n\n**A**: *Yes. Yes it will.*\n\n**Q**: If Satori is going to be banning users, should we expect to see a drop in membership?\n\n**A**: *This is entirely plausible, though the number of bans would have to exceed the number of new apes coming in daily. Don't be surprised if there is a dip, but also don't be surprised if there is not.*\n\n**Q**: Can mods release info on the actions taken by Satori, like how many users were approved, how many users were banned, how many posts were deemed FUD-y, etc.?\n\n**A**: *The dev team is meeting next Tuesday to review their first week of results. I won't have any additional info regarding this question until then. Stay tuned.*\n\n**Q**: Is the requirement age AND karma, or is the requirement age OR karma (whichever is greater)?\n\n**A**: *This is an AND scenario. Apes must have the necessary age AND karma requirements to comment/post. Lacking either will result in automod action unless the ape has been approved by Satori already.*\n\n**Q**: How do I know if I am approved?\n\n**A**: *Apes will receive a notification saying as much.*\n\n&#x200B;\n\n[ Satori \\(覚, \\\\\"consciousness\\\\\"\\) in Japanese folklore are mind-reading monkey-like monsters \\(\\\\\"yōkai\\\\\"\\) said to dwell within the mountains of Hida and Mino. ](https://preview.redd.it/arhuulwo7p271.png?width=389&format=png&auto=webp&s=9b2c2d68cb30f1883cdcf61c628ef2c0b53b6579)\n\nBack to u/Pinkcatsonacid 🐈🦄\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# THE RETURN OF THE KING- DFV TWEETS AGAIN\n\n&#x200B;\n\nIt's been 6 weeks.\n\n&#x200B;\n\n**The Kitty Has Been Watching**\n\n[The Kitty has been watching us the whole time](https://preview.redd.it/ypporfm3ap271.jpg?width=1080&format=pjpg&auto=webp&s=693fb1d3b75e16b1bd09d00c64d46811a6662b72)\n\n&#x200B;\n\nIn the video of the comeback tweet, a cat is seen perched, casting an ominous shadow behind him, while *O Fortuna* plays in the background.\n\nu/tropicalsecret translated the lyrics for us:\n\n*O Fortune, like the moon you are changeable, ever waxing, ever waning, hateful life first oppresses and then soothes as fancy takes it; poverty and power it melts them like ice fate – monstrous and empty, you whirling wheel, you are malevolent, well-being is vain and always fades to nothing, shadowed and veiled you plague me too; now through the game I bring my bare back to your villainy fate is against me in health and virtue, driven on and weighted down, always enslaved. so at this hour without delay pluck the vibrating strings; since Fate strikes down the strong man, everyone weep with me!*\n\n&#x200B;\n\n**OUR KING KITTY HAS RETURNED 👑🐈**\n\n&#x200B;\n\n🚀🚀🚀\n\n&#x200B;\n\n**Breaking Through the Floor**\n\n[John Wick prepares to fight back](https://preview.redd.it/2m46chtkap271.jpg?width=1080&format=pjpg&auto=webp&s=1a7c08ac3d495bab67c61e67d037bec910055751)\n\n[Here is the scene for context.](https://www.youtube.com/watch?v=52Ikr4574fM)\n\n&#x200B;\n\nJohn Wick had his ass kicked. His dog killed. He was down and beat. And this is the scene where he decides to fight back. And he breaks through the floor to find his weapon- the pencil.\n\n&#x200B;\n\n🚀🚀🚀\n\n&#x200B;\n\n&#x200B;\n\n[\\\\\"... you're locked in here with me!\\\\\"](https://preview.redd.it/yqqakg4cgp271.jpg?width=1080&format=pjpg&auto=webp&s=7673e7d9b7eb557119de7f2648153e424b32d8f2)\n\n&#x200B;\n\nSelf explanatory, I think.\n\n&#x200B;\n\n[pls stay with us](https://preview.redd.it/ifdy8l5njp271.png?width=512&format=png&auto=webp&s=b050a60e98bf97459c2c319d64b1595a60bd453a)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Community Spotlight- u/BodySurfDan and [u/RiverJumper84](https://www.reddit.com/user/RiverJumper84/)\n\n&#x200B;\n\nu/BodySurfDan [**dropped another bop on us with lyrical flow that will make you dizzier than Death Spiral Financing.**](https://www.reddit.com/r/Superstonk/comments/npts59/get_jacked_good_lord_gamestop_the_gamestop_saga/)\n\n&#x200B;\n\n[me](https://preview.redd.it/zlyfmuy7fp271.jpg?width=1080&format=pjpg&auto=webp&s=a0919e6196c9627bb1e3c07728c55e92bc4f407d)\n\nHow many times did I bump this while driving around this holiday weekend?? More times than my family can quite understand.\n\n&#x200B;\n\n[u/RiverJumper84 **is repurposing old Gamestop commercials.**](https://www.reddit.com/r/Superstonk/comments/nokxvf/im_repurposing_some_of_gamestops_old_commercials/?utm_medium=android_app&utm_source=share) **Get a hit of humor and nostalgia with these masterpieces.**\n\nHe's doing a series so check that out!\n\n&#x200B;\n\n*This is the most creative and amazing community. I'm so proud of the art apes make every day! You make the sub, and the world, a better place! 💪*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Lucy Komisar and Wes Christian AMA🎤\n\n&#x200B;\n\n**Tomorrow we will be welcoming back Lucy Komisar, this time as a special guest host for fellow AMA veteran, Wes Christian!**\n\n&#x200B;\n\n[Wes Christian](https://preview.redd.it/h6y6nt1qkp271.png?width=170&format=png&auto=webp&s=daf79a5cb171c64fe5bebdaf8d8520ef5e7a5245)\n\nThe topics of discussion are going to be Naked Short Selling and Death Spiral Financing on a broad, market-wide scale.\n\n&#x200B;\n\n[There is still time to submit your questions in the official thread!](https://www.reddit.com/r/Superstonk/comments/np7tmd/official_ama_question_thread_for_lucy_komisar_and/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n# [Tune in tomorrow- Wednesday, June 2, at 4:30 pm Eastern on Superstonk Live YouTube!](https://www.youtube.com/c/Superstonk/featured)\n\n&#x200B;\n\n&#x200B;\n\n[Lucy Komisar](https://preview.redd.it/0mdo7wjmkp271.png?width=1542&format=png&auto=webp&s=0a41910a51cf988dfcb12e972f41fb7fc8c278df)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# VOTE! by [u/Bye\\_Triangle](https://www.reddit.com/u/Bye_Triangle/)\n\n&#x200B;\n\nAgain, and again, until the voting is over-- we will be back here reminding everyone of its importance. All of this DD, all of this guidance from experts, all of this attention on this naked short-selling issue... will be for nothing, if we don't vote our shares.\n\nWe must vote our shares to show everyone how prolific this issue is. This isn't just a matter of corporate governance, this is about proving to everyone that our investment is being crushed by greedy naked short sellers dumping, potentially, millions and millions of \"Phantom Shares\" into the market. This isn't anything new, as all our AMA guests have said, this problem has been going on for decades in some form or fashion... But this time, the new variable is us.\n\nBy participating in the vote you are ensuring that every last share that the shorts have fabricated and sold to us is counted. Once their actions see the light of day, in the form of the vote count, this will be the beginning of the end...\n\nThere is no way out for them as long as we all vote our shares. Anyone who tells you otherwise is wrong or doesn't fully grasp the situation.\n\n&#x200B;\n\nhttps://preview.redd.it/kjx3hmccqo271.png?width=1000&format=png&auto=webp&s=c1909cbc65550b7246a59426796b41022f37f517\n\nAnd to those of you who are told by your brokers that you aren't able to vote... make noise, tell them you demand your rights... If you own shares in a company, it is YOUR RIGHT to vote on that companies decisions.\n\n&#x200B;\n\n**There is proof that this works, as we are receiving news that** [**Etoro**](https://www.reddit.com/r/Superstonk/comments/nmtq9s/we_did_it/)**,** [**Tiger**](https://www.reddit.com/r/Superstonk/comments/nmt6lw/not_sure_if_posted_before_but_fyi_singaporean/?utm_medium=android_app&utm_source=share) **and** [**FUTU**](https://www.reddit.com/r/Superstonk/comments/nmvme5/hong_kong_apesss_using_futu_can_finally_vote/) **are now being made able to vote... So don't give up, if you had shares in time for the record date, then it is your right, do not take it lightly that they are trying to strip that from you.**\n\n&#x200B;\n\n[The other half of Sweden is joining the battle! Nordnet have decided to follow Avanza's footsteps and register all GME customers in a broker non-vote! Including all customers in the other Nordic countries!](https://www.reddit.com/r/Superstonk/comments/nn50ye/the_other_half_of_sweden_is_joining_the_battle/)\n\n&#x200B;\n\n[**Also, be sure to read this piece by**](https://www.reddit.com/r/Superstonk/comments/nlpz4h/your_votes_are_important_the_time_to_vote_is_now/) [**u/Nauaf**](https://www.reddit.com/u/Nauaf/) [**on how to vote your shares!**](https://www.reddit.com/r/Superstonk/comments/nlpz4h/your_votes_are_important_the_time_to_vote_is_now/)\n\n&#x200B;\n\n[Meme credit u\\/PikePies](https://preview.redd.it/k0bxwrzvap271.png?width=720&format=png&auto=webp&s=bb47d5d166d66b9ddfa0864f14ddd4baec53d191)\n\n&#x200B;\n\n**Comment ! apevote ! (without spaces) to receive your custom voted flair!**\n\n&#x200B;\n\n&#x200B;\n\n[Credit: u\\/OfficialRedditMan ](https://preview.redd.it/vuod38t9pp271.png?width=960&format=png&auto=webp&s=f08d4a6412863d95600bb3a004f6cd53282f57c3)\n\n&#x200B;\n\nIf you lost your custom flair teaching others how to get the voted flair, thank you for your service! We do flair threads every Friday, and u/Bradduck_Flyntmoore does wild flair threads all the time!\n\n&#x200B;\n\nBack to [u/pinkcatsonacid](https://www.reddit.com/u/pinkcatsonacid/) 🐈🦄\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# A Note from your friendly local Pink Cat 💖🐈\n\n&#x200B;\n\nSo Red's post also addressed the fact that myself and u/Bye_Triangle have been promoted to full Admin Mod positions. This means we have equal mod permissions to u/redchessqueen99 and u/rensole. Red and Ren discussed the matter privately, then approached the mod team for a vote. I know I can speak for both Bye and myself when I say I am humbled and truly honored at the responsibility given to me. Honor is a big deal to me personally, worth much more than money or even $GME.\n\n&#x200B;\n\nI won't speak too personally here, but I want you all to know a little more about one of the apes you have representing you and fighting for the cause. I love reading the motivation posts and knowing every ape's personal reason for HODLing. This is mine. Feel free to skip if you don't like the fluff stuff.\n\n&#x200B;\n\nI would like to share with you all here and now, that as a Native American woman, my story goes deeper than just GME. My personal motivation in the GME saga is not only because I love the stock and think it's going to change the face of retail, especially with RC involved.... and not only to enrich the lives of my family and change the system.... but I also hope to bring water back to my tribe- both literally and proverbially. I have intentions to completely change the lives of my registered tribe and all indigenous tribes after the Tendieman comes. This isn't an attempt at being political or anything, I hope it isn't received that way. I just feel compelled to share this with you as I'm appointed to help steer this ship. This is so much bigger than Gamestop. And you have my word, on my honor, that I will fight for every ape and do every one of you proud in this position.\n\n&#x200B;\n\n**They've criminalized our free market.**\n\n**They've shorted the very foundation of our financial system.**\n\n**They've robbed the Treasury.**\n\n**They've taken our businesses.**\n\n**They've taken our homes.**\n\n**They've taken our families.**\n\n**They've taken our land.**\n\n**They've taken our water.**\n\n**They've built this system on a House of Cards.**\n\n**And now, the people fight back.**\n\n&#x200B;\n\nAs our friend u/StonkU2 always says,\n\n# Profit to the People, Power to the Player. ✊\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎉HYPE WEEK🎉\n\n&#x200B;\n\n**Monday**\\- NYSE Closed for Memorial Day\n\n&#x200B;\n\n**Tuesday**\\- DFV TWEETED- THE KING IS BACK!!!\n\n&#x200B;\n\n**Wednesday**\\- [Lucy Komisar and Wes Christian AMA](https://www.youtube.com/c/Superstonk/featured) at 4:30 PM Eastern!\n\n&#x200B;\n\n**Thursday**\\- [SEC Closed door Sunshine Act Meeting](https://www.sec.gov/news/upcoming-events/closed-meeting-060321) at 3:15 PM Eastern\n\n&#x200B;\n\n**Friday**\\- Take your protein pill and put your helmet on. 🚀🚀🚀\n\n&#x200B;\n\nThere is electricity in the air this week as many apes have pointed out! It is important that this hype train keep on rolling, and that the steady drumbeat, keeps on beating. As long as you know that there is always more to be hyped about on the horizon, disappointment cannot catch-up. So with that in mind, allow yourself to feel the hype, but remember that if it doesn't happen this week...\n\nWe ain't going anywhere, it just means we get another week out in the jungle, screamin' with the apes. ***OOK OOK***\n\nJust remember, we got this far cause we do our research and we trust our findings. Armed with data there should be nothing that can kill the vibe. In the words of Dr. Burry:\n\n***\"I may have been early, but I am not wrong\"*** *(This quote has never rang more true)*\n\nhttps://preview.redd.it/zxfi7po1ko271.png?width=1600&format=png&auto=webp&s=f68c0bdaad9ae771c712bdcf29b0220b7d384909",
    "title": "The Jungle Beat- Tuesday 06-01-2021- DFV RETURNS, ALL STAR AMA, and MORE! 🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nq3jw7/the_jungle_beat_tuesday_06012021_dfv_returns_all/"
}