{
    "author": "Dannyboi93",
    "created_utc": 1616243308.0,
    "distinguished": null,
    "edited": false,
    "id": "m962a8",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m962a8",
    "num_comments": 451,
    "permalink": "/r/GME/comments/m962a8/this_isnt_a_get_rich_once_move_this_is_a_get_rich/",
    "score": 5549,
    "selftext": "This has been my plan all along, but people need to realise one thing, GME is a legitimately good company.\n\nSo when the squeeze is squoze and you have your millions, shot a 100k back into the back end and wait for the stock split, then wait for the stock to rise and get even richerer.\n\nI'd be surprised if the stock dropped back below $500, and I think 1k might be more probable, but I'm speculating here. The following point is still true.\n\n&#x200B;\n\nSo settle down kids, it's story time.\n\n**-------------------------------------------**\n\n1. squeeze is sqouze\n2. you cash out at 1.5m/2m a share\n3. you buy back in at the backend, lets say 500\n4. you put in 100k per pre-squeeze share\n5. you get back 200 shares for every pre-squeeze share\n6. daddy cohen does a 10:1 stock split\n7. you now have 2000 shares per pre-squeeze share\n8. price is now $50, but you have 2000 shares, you still have 100k worth of stock\n9. price goes up $10 to 60\n10. you now have 120k worth of stock\n11. price continues to rise to $100\n12. you now have 200k worth of stock\n13. but you originally had 5 shares\n14. so times that 200k by 5\n15. you now have another million\n16. you've millionaired yourself twice\n17. welcome to the high life\n18. **----- bonus round -----**\n19. BUT WHAT'S THIS?! NANI?!!\n20. You're used to holding now, you have millions already so you think fuck it i'll leave it in, see what happens.\n21. stock rises to 200, you now have 2 million\n22. stock rises to 500, you now have 5 million\n23. stock rises to 1000, you now have 10 million\n24. stock hits a sell wall at 1500, you have 15 million\n25. meh, you're diamond as fuck now, you just stand outside of your mansion waving at passers by all day, you're made of diamond, there's fuck all else to do, you're like a living diamond statue\n26. price drops to 850, ydgaf\n27. price rebounds to 2000 you now have 20 million\n28. **----- EPILOGUE -----**\n29. the year is 2035, gamestop has now monopolised the gaming industry, you can order a game, a pizza, and an ounce of hindu kush, it'll all be delivered within 30 minutes, you're also entered into a raffle for another free pizza, dime bag or chance at winning the new Microny Playbox IV, life is good.\n30. You sit down to get blazed, enjoy your pizza and have an awesome night gaming when an alert flows through the gaia field, you tune in psychonetically to the twitter-verse.\n31. Daddy Cohen stands before you in his holographic glory.\n32. He's doing a 5:1 split...",
    "title": "🚨🚨THIS ISN'T A GET RICH ONCE MOVE, THIS IS A GET RICH TWICE, AND THEN AGAIN, AND AGAIN MOVE🚨🚨This rocket ship is gonna travel far beyond the known reaches of the observable universe. So pay attention to this. 🚀🚀🚀🚀🚀🚀",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/m962a8/this_isnt_a_get_rich_once_move_this_is_a_get_rich/"
}