{
    "author": "Dan_Bren",
    "created_utc": 1617680594.0,
    "distinguished": null,
    "edited": 1617718902.0,
    "id": "ml2q0p",
    "text_only": true,
    "flair_text": "Serious DD 👨‍🔬🔬",
    "name": "t3_ml2q0p",
    "num_comments": 421,
    "permalink": "/r/Superstonk/comments/ml2q0p/hedgies_did_not_buy_deep_inthemoney_calls_today/",
    "score": 7555,
    "selftext": "Good Evening Apes,\n\nHope all of you are getting settled in nicely here in our new sanctuary. I remind you that you all turn this place from house into a home. Let's get right into it.\n\nMany of you may know me from my previous posts depicting the Deep ITM calls being bought out of the PHLX exchange. Interestingly enough, for the first time since this whole thing started, no large trades of Deep ITM calls were made.\n\n&amp;amp;amp;#x200B;\n\n[GME Biggest Trades 4-5-2021](https://preview.redd.it/4u3b8lh34hr61.jpg?width=1223&amp;amp;amp;format=pjpg&amp;amp;amp;auto=webp&amp;amp;amp;s=00781c4e2b5ce033700f469af50a6a9d67d3e015)\n\nA smart ape named u/glide_si suggested that these large trades were often seen back to back with another duplicate trade suggesting these calls were being rapidly bought and sold. We speculated that this was one way the shorts were hiding their FTD's.  With the recent addition of DTCC rule 005 (although interestingly still pending approval-but apparently may be in effect this shit is mad confusing im not a lawyer im a stonker) that from my understanding is preventing this process from happening (creation of synthetic shares) have we finally seen the end of this massive Deep ITM call buying. Hard to know what is to come as a result of this but my gut tells me the end is near.\n\nTL;DR:  HEDGEFUNDS NO LONGER COVERING UP FTD'S WITH DEEP ITM CALLS AS OF TODAY POSSIBLY BECAUSE OF DTCC 005\n\nRed crayons taste the best; change my mind.  💎🙌\n\nIf you wanna read through DTCC rules  [https://www.dtcc.com/legal/sec-rule-filings?pgs=1](https://www.dtcc.com/legal/sec-rule-filings?pgs=1) thanks u/Darkassassin07\n\nAnother theory that I've been pondering: if DTCC Rule 005 isn't in effect yet could the end of these deep in the money call purchases expiring 4/16/2021 have anything to do with the heightened volatility that comes with trading short term options. Perhaps inside 10 days is the no-go zone.\n\nEdit: Seems to be a lot or confusion regarding whether DTCC 005 is in effect and the truth is I don’t really know. What I do know is they didn’t just stop buying these Deep ITM calls for no reason. This is significant\n\nI will put out another post when I get home from work tonight with today’s updates but expect it on the later side.",
    "title": "HEDGIES DID NOT BUY DEEP IN-THE-MONEY CALLS TODAY FOR THE FIRST TIME",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ml2q0p/hedgies_did_not_buy_deep_inthemoney_calls_today/"
}