{
    "author": "phoenixfenix",
    "created_utc": 1617643379.0,
    "distinguished": null,
    "edited": 1617671383.0,
    "id": "mkpwco",
    "text_only": true,
    "flair_text": "Serious DD 👨‍🔬🔬",
    "name": "t3_mkpwco",
    "num_comments": 83,
    "permalink": "/r/Superstonk/comments/mkpwco/incoming_catalysts_over_the_next_few_weeks_that/",
    "score": 1202,
    "selftext": "This is the second time this year I’ve had to abandon a sub because of Mod takeover. Let’s try to move on from what happened this weekend, and focus on what matters. DD. I’m a lurker, but I’m posting this in the hopes of getting us back on track.  \n&nbsp;\n\nThis post is just a reminder of all the immediate incoming catalysts that could (don’t get your hopes up!) trigger the MOASS. As we know, Citadel and their shorting HF buddies have a lot of tricks up their sleeves, so although any one of these catalysts could trigger the MOASS, they might have plans to circumvent these triggers. Keep the pressure on by doing what you do best: buy and hold.  \n&nbsp;\n\nTrigger 1: NSCC-2021-801 (https://www.dtcc.com/legal/sec-rule-filings)\nThis will allow the DTCC/NSCC to margin call Citadel and their HF buddies. Will the DTCC margin call them? Maybe. Maybe not. This was filed on March 5 of last month, and is awaiting SEC approval.  \n&nbsp;\n\nTrigger 2: DTC-2021-005 (https://www.dtcc.com/legal/sec-rule-filings)\nThis will change the way the DTCC/NSCC operates the stock market. Instead of sending the shares to the brokerage that purchases the shares, the DTCC will now hold onto the shares permanently, and instead put a little notation onto who owns each share. In other words, the DTCC will be creating a permanent internal ledger of stock ownership, and will not release stocks from their vault. This will prevent rehypothecation. As far as I can tell, this will trigger the MOASS if approved. This was filed last Thursday, and is awaiting SEC approval.  \n&nbsp;\n\nTrigger 3: Share recall (Credit to u/inverseyourself: https://www.reddit.com/r/GME/comments/mjibu7/gamestop_confirms_annual_shareholder_meeting_is/  Link 2: https://www.reuters.com/companies/GME.N/events )\nThe GME annual shareholder meeting will be held on June 11 this year. Share recalls will begin 60 days before the shareholder meeting, which is Aprill 11th (Sunday). Most likely, this means next Monday share recalls will begin. Will this guarantee the MOASS? Yes, unless Citadel can pull a new trick out of their bag. They’ve been strategizing nonstop since January, and they know this date is coming. If they have a trick, they wont reveal it until they need to. Perhaps they can rehypothecate shares and use those to return to shareholders? I wouldn’t put anything past them. Still, it’s likely that that this could trigger the MOASS.  \n&nbsp;\n\nTrigger 4: Gamma Squeeze via Implied Volatility (IV) crush (Credit to u/WardenElite: https://www.reddit.com/r/GME/comments/misbn2/an_options_analysis_response_to_alex_goldsteins/)\nBy keeping prices flat at 190 for a 2-3 weeks, IV has gotten very low. This makes options very cheap to purchase, which will allow long whales to pump the options market for another gamma squeeze. From what I’ve seen, gamma squeezes typically start on a Wednesday, so keep your eyes out every Wednesday for the next few weeks for a gamma squeeze. Will this happen? We can’t be sure that long whales are ready to crush this stock yet. It’s clear that the GME MOASS will influence the broader market and economy in ways we are just beginning to understand (i.e. the everything short), and long whales may be avoiding the squeeze for a few more weeks while they assess their other positions and reposition as necessary. In fact, the long whales may no longer want this MOASS, as it may destroy their other positions. Unfortunately, they are no longer in control. Retail owns the float, and they know it.  \n&nbsp;\n\nFinal Bullish note: GME is joining in on the MOASS, and will issue up to 3.5 million shares and sell up to 1 Billion dollars for equity. They’re gonna join us in having fun timing the market and selling for peak profit/minimum dilution.   \n&nbsp;\n\nDo any of these catalysts guarantee the MOASS? No, but it will clearly put significant stress on the shorts. They can’t afford anymore slip ups, and we can expect any, and possibly all of these catalysts to trigger next week. Imagine 801, 005, the share recall, and the gamma squeeze occurring all in the same week. Very bullish.  \n&nbsp;\n\nBuy and hold, and don’t hold back. This might be your last opportunity to buy before the MOASS. Don’t get depressed if these catalysts don’t initiate the MOASS. All shorts must cover.\n\nEdit* u/inverseyourself has pointed out that there is no clear reference for the 60 day rule. Simply speaking, I pulled that number from the various reddit threads I have been reading, but upon deeper searching, I could not confirm is there is a 60 day law or not. As such, I am placing this edit here to clarify that share recall may or may not happen next Monday, but we should be on the lookout for a potential share recall in there near future: https://www.reddit.com/r/Superstonk/comments/mkpwco/incoming_catalysts_over_the_next_few_weeks_that/gthy883/  \n\nEdit 2 u/UnknownKill has linked an alternate DD that suggests that 005 is technical in nature and does not actually change how stocks flow within the market, and therefore is not a catalyst: https://www.reddit.com/r/Superstonk/comments/mkju4s/srdtc2021004_and_srocc2021801_for_apes/. Unfortunately, I am not smart enough to know who is correct, so as always, please do your own due diligence. It is possible that 005 is nothing more than a technical rewrite and has no implication on the GME MOASS.  \n\nEdit 3 Credit to u/SeeTheExpanse for finding a citable academic source for the 60 day rule: https://www.reddit.com/r/Superstonk/comments/mkpwco/incoming_catalysts_over_the_next_few_weeks_that/gtiofs2/  \n\nAccording to this article: \"There  are  a  many  rules  and  regulations  that  apply  to  the  proxy  process.    To  give  shareholders  sufficient  time  to  make  an  informed  voting  decision,  registrants  must  follow  a  timeline.    SEC  proxy  Rule  14a-13  requires  that  a  “Broker  Search”  be  distributed  to  banks,  brokers,  and  nominees  and  they  compile  a  list  of  beneficial  owners.    This  broker  search  is  required  to  take  place  20  business  days  prior  to  the  record  date  for  an  annual  meeting  and  ten days for a special meeting. Most states (for example, California and Delaware) require the record date  to  be  set  at  a  maximum  of  60  days  and  a  minimum  of  ten  days  prior  to  the  meeting;  New  York  sets  the  maximum  at  50  days.\"",
    "title": "Incoming catalysts over the next few weeks that could trigger the MOASS (No guarantees, and no guaranteed dates!)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mkpwco/incoming_catalysts_over_the_next_few_weeks_that/"
}