{
    "author": "Questionable_Reason",
    "created_utc": 1614050302.0,
    "distinguished": null,
    "edited": 1614646476.0,
    "id": "lq7thg",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lq7thg",
    "num_comments": 191,
    "permalink": "/r/GME/comments/lq7thg/alright_boys_i_have_something_to_share_about_what/",
    "score": 616,
    "selftext": "Crayons, apes, bananas, tendies, etc. etc. just READ! Or just like those bedtime stories you get at night, ask your mom read it to you.\n\nI have just a bit of information that I would like to provide on top of all the other signs we have seen since Friday as potential good news for the GME upswing.\n\n* I am typically a momentum trader, I use quant, algos, all that lazy jazz to make money over time. The reason I bring this up, is because the momentum stocks I typically follow, lead the market (S&P 500). So, when these stocks boom, the market tends to follow, and when they dive hard, you can guess what the market does a day or two later.\n\n* For those of you who aren't familiar with how this works, Tesla is an excellent example. It has been I highly rated momentum stock for well over a year. When Tesla booms, the market follows, and when it dives, the S&P is usually not far behind. You can compare daily charts over the last year to see what I mean. Of course, this is just a generalization. Telsa just recently fell down through the 50 Moving average, which is a huge deal. On top of that 3 out of 5 of the strongest momentum stocks are down about -9% today. That is a BIG deal.\n\n* We all know that GME can, and will \"break\" the market when it squeezes. The hedgie boys in suits will want to pull their money from their other positions to protect that cash when they light the sea of jet fuel and hedge tears that will send this rocket out of our solar system. So, because that is what they should and will do, this is very likely to have started, especially considering recent events. \n\n* If they pull their money, and the market starts tanking, other people will do the same out of panic. And if you are ripping your money out of the market to protect it while it crashes, and you see GME going to $10,000 a share and beyond, with 100's of % on the daily charts, where would you put your money? BINGO, you are going to buy GME. This is going to cause an \"infinite\" feedback loop along side the other feedback loops that go along with the squeeze due to the scale of events that could unfold. In short, this will only help GME gain momentum and slingshot further, faster, harder, baby OH GOD YES LOOK AT THOSE NUMBERS.\n\n* This is just my shared opinion based on an ape that has been in the market for quite some time. I'm not a financial advisor and this is not financial advise. I have been wrong before and will be wrong in the future. Do some DD and put it all together for your own opinion and decisions to be made. Sorry this isn't some god tier advanced DD shit, but momentum DOES matter and help lead markets. Historically, this is very telling, and I believe especially now so. This could be a \"here and now\" kind of thing, or we could just be shaking the market hard and it could attempt recovery (doubtful). This being said, I will personally be keeping an eye on the S&P for the days to come.\nLOVE YOU GUYS. \n* That's all I've got for you boys. It's been amazing to see the work put out over the last few months (especially the god tier DD that has been back to back as of late) and has been very much appreciated. \n\nEDIT: I would like to add that this is not about fundamentals, this is simple supply and demand. We have the supply, and they HAVE to buy what we have. It isn't complex, take out the noise, and it is easy to see our victory on the horizon.\nAlso, I have had quite a few questions regarding price target. While I have my own ideas regarding math an sentiment, u/Corrode1024 made this following post somewhat recently, that I find to be well put together. In my opinion, his work is worth reading into.\n\nhttps://www.reddit.com/r/GME/comments/lmou8l/gme_dd_price_target_my_personal_price_target_from\n\nOnce again, everything here is speculation and not financial advice. The market is already hard to predict in any given moment, so all we can really do is go off of probabilities and change our views as more information comes in. On top of that, illegal activities by these Hedge Funds that are shoring, make this near impossible to predict the outcomes. Please keep that in mind. While the market is correcting, if GME does NOT gain momentum to give people somewhere to put their cash, it could mean we have to wait a bit longer.\n\nIf I were making the decisions as one of the hedgie suit men... I would NOT want GME to take off during a correction or crash of the general market because more people would dog pile on my corpse. So you can bet your ass they will continue to do anything the can to keep the stock down during this time. I am not setting a date, just a high probability that we could see a swing given the right circumstances with all this going on. The options market ALSO has a HUGE impact on this, as a gamma squeeze could swing us into a short squeeze. The possibilities are limitless, but the tendies are there for the taking, we just have to wait.\n\n**Edit 2: I think they are possibly letting AMC rip upwards as a final attempt to get people to take money out of GME. Beware. Good luck to all of you! GME has way higher short interest(About 430% of float). Don't get distracted, and educate all you talk to.**\n\n**EDIT 3 (FINAL EDIT) : Well, from what I see my opinion still stands. We very much were ready to take off again, until they shorted an estimated 33-50 MILLION shares on Friday. This was unexpected as there were no shares to borrow and they have naked shorted GME more. Though at the same time, this was to be expected given the history of their actions so far. They have kicked the can down the road more. I would like to refer a few posts for you guys to read and educate yourself further on. I will create another post as things develop if necessary. The hidden short interest is now way above 430% of float, that is an outdated number and they have added more fuel to our rocket. I have also changed my opinion in that in the current moment, I believe that the squeeze will take a week or more as covering shares will take extra time than previously though. Days to cover is something that is fairly easy to calculate, though it changes as the data comes in. Keep this in mind when reading this post in the future.**\n\nhttps://www.reddit.com/r/GME/comments/ls830a/found_the_reason_for_the_dip_they_are_shorting/\n\nhttps://www.reddit.com/r/wallstreetbets/comments/lsvl8k/really_long_dd_and_analysis_what_happened/\n\nhttps://www.reddit.com/r/GME/comments/ltua0n/endgame_dd_how_last_weeks_actions_all_come/\n\n**TLDR: HOLD AND SQUEEZE FOR TENDIES! IT IS COMING!**",
    "title": "Alright boys! I have something to share about what I have seen happening in the market today.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lq7thg/alright_boys_i_have_something_to_share_about_what/"
}