{
    "author": "possibly6",
    "created_utc": 1619649288.0,
    "distinguished": null,
    "edited": 1619663783.0,
    "id": "n0qnpv",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n0qnpv",
    "num_comments": 410,
    "permalink": "/r/Superstonk/comments/n0qnpv/predicting_gmes_price_action_with_elliot_waves_429/",
    "score": 5646,
    "selftext": "What's poppin apes, u/possibly6 here with some bias that I indeed can confirm will confirm your bias. confirmed.\n\nAs always, this aint no mothafuckin financial advice, hoe. The views expressed here are solely my approach to investing in this specific equity. I ape an am.\n\nobligatory.\n\nTo preface, for any new apes, I am a daily technical trader. I make a living by identifying patterns and executing trades based solely on what I see on my charts. As someone who day/swing trades every day, I NEVER day trade GME. I have been holding since late November, haven't sold a single share. I hold xxx shares now.\n\n&#x200B;\n\n[bias of confirmation in the process of being confirmed with bias about confirmation idk6](https://preview.redd.it/u5wu6mgknzv61.png?width=236&format=png&auto=webp&s=f888d58c3d483ad07529fe50ae07904dc378d5aa)\n\nApologies again for the lack of daily posts. I feel like my work is often times drowned out by fluff and memes, not really an issue just not super motivating if you catch my drift.\n\nIn my last post I talked about how it seemed that our price action mimicked that of January. if you want to check that post out here you go: [https://www.reddit.com/r/Superstonk/comments/mv2bx9/price\\_action\\_nearly\\_identical\\_to\\_jan\\_squeeze/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/mv2bx9/price_action_nearly_identical_to_jan_squeeze/?utm_source=share&utm_medium=web2x&context=3)\n\nWell FINALLY I wake up and I see my favorite stock going up in value. There has been a lot of great work by apes around the sub in recognizing that GME was selling shares to apes while simultaneously keeping the price at max pain points.\n\nAh yes, the great equalizer.\n\n[ah yes](https://preview.redd.it/y1zlf360ozv61.png?width=940&format=png&auto=webp&s=5b3c6b7659df08733cf8277fe323ff0d0eacd7ff)\n\nSo now that bankruptcy is completely ruled out, why haven't the shorties covered? Cause they dumb lol. These guys don't want to admit defeat by a bunch of crayon eating apes, and I don't blame em.\n\nEnough of the memes, let's talk price action. Here's my view of GME over the past few days:\n\n[1hr View](https://preview.redd.it/685fh3qbozv61.png?width=2858&format=png&auto=webp&s=832182862fdc4bf870bf3998b710c1f7ba73282a)\n\nIf you follow me for regular EW updates, I ended up redrawing the waves we are in. The movement on monday looks to be the start of a wave 3, but it is not quite finished. I have tried to explain EW theory in my previous posts, it hurts my head sooo much trying to describe it, but I will try to put it in ape terms.\n\nIn its simplicity, Elliot Wave Theory is no more than the manifestation of human nature in financial markets. The market moves in waves. 5 impulse waves and 3 corrective waves with waves inside of waves. This picture explains it pretty well.\n\n[EW inna nutshell](https://preview.redd.it/cjawb2hwozv61.png?width=872&format=png&auto=webp&s=3182683dd303f2068986af613a629ba5d4fc9891)\n\nThe way I see it, we are HERE:\n\nhttps://preview.redd.it/btq7s635pzv61.jpg?width=872&format=pjpg&auto=webp&s=01eb69ac6f3f66b1fda64c65025946cf30dd775d\n\nHere's a bigger view of what I see for GME:\n\n&#x200B;\n\n[GME 4 hr](https://preview.redd.it/tdpe9os8pzv61.png?width=2858&format=png&auto=webp&s=d6be2b410295f8541bfa8056222d4bac11aa294a)\n\nIn some of my previous posts, I mentioned my wave 3 of 5 target is somewhere around 220 before a slight correction.\n\nThe downward move at open today was entirely predictable and 165 was the buy area I was watching today to buy more of my favorite stock. allow me to explain why.\n\nRefer back to the EW diagram above, specifically waves 1 and 2. The wave rules apply on all time frames. After a downturn period, when there is a significant move upwards, this often marks wave 1 of 5. Wave 2 of 5 targets **AT LEAST** a 50% correction from wave 1, though often times the 61.8% level.\n\nYou can visualize those levels below:\n\n&#x200B;\n\n[GME 15m](https://preview.redd.it/fnjui85tpzv61.png?width=2852&format=png&auto=webp&s=dd166d954fc2d5f6e04adeef3bbe8e3d06e8f78c)\n\nCompare this to the diagram above, the price action is totally logical.\n\nWave 3 targets a 1.618 extension of wave 1, with GME, that is visualized below which gives us our wave 3 of 5 pt before some retracement action.\n\n&#x200B;\n\n[GME 1hr scaled](https://preview.redd.it/omtb09p3qzv61.png?width=2858&format=png&auto=webp&s=c6d3b3000800790156aa5db87e625535520ca75b)\n\nWill we see this target hit tomorrow? possibly (6) but as always idgaf. What I think will happen is we will see price hit a low of around 172 tomorrow (61.8% retracement from wave 1).\n\nI anticipate this because, as you can see, we trended downwards after the news that GME finished their sale of 3.5m shares. Thus, the upwards trajectory from today after the morning dip was a smaller wave 1 completing. naturally, a 50%-61.8% correction is expected before wave 3. Visualized below:\n\n&#x200B;\n\n[GME 5m zoomed in ](https://preview.redd.it/9eb8kgekqzv61.png?width=2858&format=png&auto=webp&s=2dd8e81c6e3e48f61fb68295b19a1386eedb1e26)\n\nWhatever happens, I'm **FUCKING JACKED**.\n\nBefore I sign off, ignoring EW, we just broke out of the mega wedge, as I'm sure you have seen across the sub. MACD on the daily just crossed as well which is a HUGE bullish signal.\n\n&#x200B;\n\n[GME daily chart](https://preview.redd.it/ra295gvuqzv61.png?width=2852&format=png&auto=webp&s=0b30eb4cc4893438dd44f2feeef3bda7ff8eab60)\n\nLet's zoom in:\n\n[JACKED.](https://preview.redd.it/jtagem9yqzv61.png?width=2854&format=png&auto=webp&s=d472c762a1cb2ca8532e8863373317e59c575692)\n\nEveryone that says \"oh technicals don't apply to GME it's so manipulated\" is ignorant in my eyes. EW is not typical TA, it is human nature, which is why it is so accurate. Every field has formulas to prove the findings, EW is the stock market's \"formula\" per se. There's a reason it's accurate.\n\nIf you read all of this, you're dope. Be excellent to each other.\n\nTLDR: lots of pictures and colorful lines, GME go up. Expecting a low of around 172 tomorrow before a slight reversal around the 217 area. Possible but highly unlikely we fall back to 165 before 217. Don't day trade GME. if you do, fuck you. Sorry not sorry don't be a bitch.\n\nedit: to clarify, not saying 217 happens tomorrow, that is simply the next target to complete wave 3. Possible it happens tomorrow, but its not 10m so does it matter? **nope.**\n\nedit 2: Remember, VOLUME is the biggest driver in price. EW does not necessarily account for volume which is why I don't put timeframes here, though it's fun to speculate isn't it?\n\nObligatory 🚀 🚀 🚀 🚀 🚀\n\nedit 3: FIDELITY MAKING A NEW APP LETS GOOOO [https://www.reddit.com/r/fidelityinvestments/comments/n0fvgz/meet\\_the\\_new\\_fidelity\\_mobile\\_beta\\_trading/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/fidelityinvestments/comments/n0fvgz/meet_the_new_fidelity_mobile_beta_trading/?utm_source=share&utm_medium=web2x&context=3)",
    "title": "Predicting GME's Price Action With Elliot Waves 4/29 🚀",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n0qnpv/predicting_gmes_price_action_with_elliot_waves_429/"
}