{
    "author": "Ibbladn",
    "created_utc": 1616506369.0,
    "distinguished": null,
    "edited": 1616519623.0,
    "id": "mbet5w",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mbet5w",
    "num_comments": 40,
    "permalink": "/r/GME/comments/mbet5w/gme_will_succeed_with_ryan_cohen_he_is_not_only_a/",
    "score": 2611,
    "selftext": "I am not sure how many you are familiar with Chewy as it was a pet company.   Chewy had a policy that if your pet passed away after ordering food or toys, etc they would refund your money.  This practice was started back when Ryan Cohen owned the company and still continues today because it received so much positive feedback even though he sold it.  So think about that customer service. \n\nI had a pup on prescription food which I purchased through Chewy. The pup passed away on the morning of the day I was receiving his next four weeks of prescription food.  I was so upset about my pup I forgot my delivery was coming.  When I received the package I lost my composure again.  I took a few hours to calm down before calling Chewy to see if I could return the food.  They were so compassionate in helping me and told me to keep the food and donate to an animal shelter or rescue and they refunded my money which was a little under $200.  \n\nNow I have another pup and I purchase her food through Chewy because of the way they treat their customers.   \n\nSo if Ryan is bringing in his own customer service executive then I trust him and believe GME will be very successful because he knows how to treat customers.   \n\nWoohoo!!!!! Go Ryan !!!!\n\n🍌🍌🍌🍌🍌🍌🍌🚀\n\nNot financial advice.",
    "title": "GME will succeed with Ryan Cohen he is not only a tech/business leader he shows compassion to his customers.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mbet5w/gme_will_succeed_with_ryan_cohen_he_is_not_only_a/"
}