{
    "author": "dljmonkeyboiz",
    "created_utc": 1616549679.0,
    "distinguished": null,
    "edited": 1616556134.0,
    "id": "mbucab",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mbucab",
    "num_comments": 43,
    "permalink": "/r/GME/comments/mbucab/ryan_cohen_wants_us_to_win/",
    "score": 1239,
    "selftext": "I have been reading more about Ryan Cohen’s customer centric management style. This guy is maniacal when it comes to customer service. The 24/7 support. Personally handling the one customer’s order that took forever to ship. This guy is down in every detail, nook and cranny of this company. Ryan Cohen wants us to win. \n\nThe company’s management knows what’s going on. Their 10k section about shorting was about as crystal clear as you could get on the fact that there is a “short squeeze” event happening. Not if, not when, now... it’s happening NOW! \n\nWhat forces shorts to buy back shares in the open market? A share recall. A share recall is driven by a company management driven event. Hmm, like the election of board members. Shareholders recalling their shares to participate in a vote. Every share gets accounted for and every vote gets tallied. But this process requires all shareholders to get a form that you are in fact the shareholder and allowed to vote. \n\nI’ve posted other DD. BUT.. all the math suggests we have more long shareholders than actual share out in float as well (aka FTDs). Seems the collective HODLing is drying up the float. MMs less likely to take on role as counterparty to provide liquidity aka volatility. Despite HFs attempt to lower the price, the eventual launch pad price keeps getting raised. I know I didn’t sell at $350, I didn’t sell at $40 and I’m not selling at $160. The game of musical shares is going to stop. \n\nRyan Cohen wants shareholders to win. I am a shareholder. \n\nTLDR: I like the stock. 🚀 Ryan Cohen is part of GME leadership. The catalyst needs a GME management driven event. GME management sets off the MOASS. \n\nThis is not financial advice.",
    "title": "RYAN COHEN WANTS US TO WIN!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbucab/ryan_cohen_wants_us_to_win/"
}