{
    "author": "eatmyshortsmelvin",
    "created_utc": 1616520476.0,
    "distinguished": null,
    "edited": 1616552054.0,
    "id": "mbjwfe",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mbjwfe",
    "num_comments": 97,
    "permalink": "/r/GME/comments/mbjwfe/think_like_citadelmedia_is_suddenly_focusing_more/",
    "score": 1858,
    "selftext": "If you were Citadel, what would you do if you knew everyone was watching GME on the BIG DAY?  Put the spotlight on GME the day you drive the company stock into the ground.\n\nIf I were Citadel, I'd put GME in the spotlight RIGHT BEFORE  earnings to maximize media exposure to the masses.  When earnings come out, flood the media outlets with NEGATIVE headlines and hit pieces on TV, Radio,Reddit, Twitter ,etc.\n\nThe negative media narrative will then be followed up by more naked shorts.  Expect a MASSIVE DIP.\n\nAs an investor, focus on the FUTURE.  Ask yourself, where is the company going in the FUTURE.  If you think the company has a bright future and your conviction in the company hasn't change, BUY THE F#CKING DIP.\n\n\\*\\*Sudden change in tune by media to cover GME makes perfect sense.  Your boomer audience has already written off GME.  These boomers have their minds made up that GME is a failing company.  The paper hands are just chasing the FOMO.  Both of these people do not have strong conviction in the future of the company.\n\nPeople want to read and hear what they already believe.  What better way to confirm people's confirmation bias than to throw GME in the spotlight TODAY, smear the company after the earnings report TODAY and have GME share prices tank AH and tomorrow morning?? \\*\\*\\*\n\n&#x200B;\n\nEdit1: Awwww $hit.  I was somewhat correct!  Love you all.  Get ready to nibble at the dip tomorrow :)🍌🍌🍌.\n\n&#x200B;\n\nEdit2: It was announced today that the COO is a former Google and Amazon executive.  Would an experienced executive that has worked at Google/Amazon/McKinsey work for a \"dying\" business?  I don't think so...GME is not a \"dying\" business.  ",
    "title": "Think like Citadel....Media is suddenly focusing more on GameStop today. Expect a negative spin on earnings tonight AND a \"I TOLD YOU SO\" by media after earnings AND a subsequent tanking of GME via NAKED SHORTS. BUY THE DIP. /opinion",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbjwfe/think_like_citadelmedia_is_suddenly_focusing_more/"
}