{
    "author": "AChipOnYourShoulder",
    "created_utc": 1623903827.0,
    "distinguished": null,
    "edited": 1623981011.0,
    "id": "o1ocld",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o1ocld",
    "num_comments": 237,
    "permalink": "/r/Superstonk/comments/o1ocld/ryan_cohens_play_of_the_century_the_history_the/",
    "score": 2311,
    "selftext": "\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* ALL CREDIT FOR THIS POST GOES TO u/Topster420 \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Anything that has been \\[REDACTED\\] was done so to get around the AutoMod, and you can find all information in the original r/DDIntoGME post in the link below \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nLink to u/Topster420 ‘s original post: [https://www.reddit.com/r/DDintoGME/comments/o0u87i/ryan\\_cohens\\_play\\_of\\_the\\_century\\_the\\_history\\_the/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/DDintoGME/comments/o0u87i/ryan_cohens_play_of_the_century_the_history_the/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\n&#x200B;\n\n[Topster circa right now](https://preview.redd.it/r9nxoh7rix571.png?width=796&format=png&auto=webp&s=7b0a6fff52ac02a397f5d93ae8f3511d287bc2af)\n\n&#x200B;\n\nGood evening you filthy degenerates. It’s currently 3am, and if you’re anything like me, you’re uncomfortable with just how much money you have on the line in what (*potentially*) can only be characterized as **The Play of the Century**.\n\nAs such, you’re currently scrolling reddit for some of that sweet sweet confirmation bias to feed your convictions that the moass, is in fact *inevitable*. Well, luckily for both of us, I’ve stumbled on to a rabbithole of truly titty jacking DD, which I am gladly about to present to you. Yes, it is a long read, but I guarantee it is worth it.\n\nBefore getting into this, I should mention a few things. *First off*, I am what you would consider a LURKER. This is my first DD, so go easy on me, will ya? In consideration of this, if anyone with enough Karma on r/GME, or r/Superstonk wishes to crosspost, feel free to contact me. Secondly, I have to thank an ape-in-law for doing the heavy lifting in regard to the research behind the DD you are about to read. Without further ado, BUCKLE UP!\n\n**1. The History**\n\n*Bear* with me, we are gonna have to go through a brief history lesson before we go into this any further. Unsurprisingly, abusive naked shorting has a long and arduous history. It is critical to realize GME is far from the first company targeted by it. To really get a **great** understanding of this history & the consequent DD, I HIGHLY recommend reading [this](https://www.euromoney.com/article/b1320xkhl0443w/naked-shorting-the-curious-incident-of-the-shares-that-didnt-exist) article written in 2005, by Helen Avery. I will be citing it indirectly.\n\nThis history brings us to the curious story of Global Links, a Nevada Based Real-Estate holding company. Global Links is one of many company’s back in the early 2000’s targeted by aggressive naked shorting. As Moyer, L mentions in [this](https://www.forbes.com/2006/08/25/naked-shorts-global-links-cx_lm_0825naked.html?sh=704b42888400) Forbes article written in 2006, SEC data revealed trade settlement failures in early February 2005 were **27** times greater than the total number of shares in existence.\n\nFunnily enough, the CEO of *Zann Corp* (Yet another company victim to naked shorting), Robert Simpson realized what was going on at Global Links. Upon coming to this realization, Simpson did exactly what apes thought to do. Through a single broker he bought every single share the company Global Links had ever issued, totalling 1,285,050 shares. IN FACT, he oddly managed to buy an **additional** 126,986 shares above this figure. Yet the very next day, over 37 million shares of Global Links had been traded. The day after that? Over 22 million. You’d think **THAT** if anything was enough evidence to bring about regulatory change...\n\nSadly, Global Links is simply one of many stories. The law-suit which followed, claiming to be a victim of naked-shorting, was only one of 20 pending at the time. That was in 2005… And these were the company’s that REALIZED. Conservative estimates by [Burrell](https://www.euromoney.com/article/b1320xkhl0443w/naked-shorting-the-curious-incident-of-the-shares-that-didnt-exist), estimated the amount of company’s at the time of writing (2005) with excess shares trading above float figures, to be over a 1,000.\n\n**2. The Set Up** \n\nTo really gain a deeper understanding of this section, I am gonna recommend reading [this](https://www.sec.gov/comments/s7-08-08/s70808-145.htm) SEC transcript. Sorry not sorry. (It features Trimbath & Wes!)\n\nSo… Hedgies gonna hedge... isn’t this what apes set out to fight against? What is your point? My point is that apes are far from the first to realize what’s going on behind the scenes. Yes people have known… FOR LONG.. but the problem is they haven’t been able to do a damn thing about it.\n\nThe system has failed to correct itself because naked shorting is incredibly hard to prove, and even harder to prosecute. It gets written off as theorization, an excuse for bad performance, hidden in derivatives, it has all been heard by now. So what? Nothing can be done? Abusive Naked shorting is simply impossible to counter? **FUD?!???!??** Hold your horses….\n\nEnter former Overstock.com CEO, Patrick Bryne. Bryne is infamous for his hatred of naked shorters. I am going to let a snippet of the transcript describe why:\n\n*“Byrne became convinced his shares were being manipulated, a conclusion also reached by Tom Ronk, the President of Buyins.net. Ronk sells data on short sales to companies and investors.”* \n\n*“RONK: Overstock is a - is the poster boy of naked short selling. What's interesting is that, from January 1st, 2005, Overstock.com has been on the naked short list for 91 percent of the trading days. In that exact same period of time, over 86 million shares have been shorted in Overstock.”*\n\nFrom January 2005 to January 2007, Overstock share prices dropped nearly 70 percent. Bryne vows to not stop till the people responsible are held accountable. Granted, Bryne goes a little crazy, but hey, I probably would too if my company were victim to this shit.\n\n*“BYRNE (?): There's people going to go to prison. There's nothing they can do to make me stop”*\n\n**Fast forward 14 years**\n\nWhat does this whacky millionaire CEO vowing vengeance do before heading out the door at Overstock for good? Announce a [Digital Dividend](https://www.marketwatch.com/story/overstock-founder-tried-to-squeeze-short-sellers-then-sold-out-when-the-sec-cracked-down-2019-09-19).\n\nThis beautiful bastard who turns out to have a keen interest in blockchain technology and the world of \\[REDACTED\\] realized a digital dividend is a unique tool in combating naked shorts. Yes a regular dividend will transfer the cost of the dividend to the short-seller, but money is hardly an issue for a hedge fund. A digital dividend on the other hand will necessitate a short seller to simply return the shares in their ownership, as one can not simply purchase a unique \\[REDACTED\\] token.\n\nAnticipating a wave of FUD, from the SEC and hedgies alike, Bryne dumps his stock and moves to Asia.\n\n**3. The Final Play**\n\nAfter almost a year of heated legal proceedings (hedgies gonna hedge), the dividend is in fact, [allowed](https://www.coindesk.com/after-lawsuits-and-delays-overstock-hands-shareholders-digital-dividend)**.** On the **27th of April** 2020, Overstock hands its shareholders a Digital Dividend.\n\nWhat follows? A Bona fide short squeeze. I’m talking [500%](https://www.fool.com/investing/2020/05/06/why-overstock-continued-its-500-climb-with-another.aspx) pure unfiltered tendies. Overstock reaches its peak price on the 21st of August 2020.\n\n&#x200B;\n\n[Overstock? Psh, more like Overshort am I right?](https://preview.redd.it/o6tb6tz3jx571.png?width=1840&format=png&auto=webp&s=165062b5761f70e89a936a34734ce855d77d12a1)\n\n&#x200B;\n\nJust 10 days later on August 31st 2020, fan favourite Ryan Cohen purchased a 9% stake in the heavily shorted GameStop.\n\n&#x200B;\n\n[And GameStop was never the same again...](https://preview.redd.it/zr4m5i19jx571.png?width=2400&format=png&auto=webp&s=0da7d558d0c8e7ef1bf61e41bc8a1a4b56be83d4)\n\n&#x200B;\n\nHe follows this purchase up by taking over management and becoming Chairman of the company. Recently, GME announced its own [NFT](https://nft.gamestop.com), an \\[REDACTED\\] based token. Coincidence? Possibly. With this simple trick, Ryan Cohen may just happen to pull off The Play of The Century.\n\nRC may have realized that a way to defeat the infamous naked short-seller, the very same short sellers that have terrorized the market for decades with no counter in sight, mind-you probably highly cocky and confident thanks to this, has finally been cracked.\n\nThink about it, what better way to release your GME token than providing it as a shareholder dividend? **A Digital Dividend.**\n\n**P.S \\_ Easter Egg?** I know we don’t do dates…  and this may be a leap, but lets dig into the GME NFT through etherscan for fun, shall we?\n\nHere’s GME’s NFT address as found on their official website\\*\\*:\\*\\* 0x13374200c29C757FDCc72F15Da98fb94f286d71e   ->Search Address on Etherscan -> Read Contract -> Launch Date\n\n&#x200B;\n\n[GME Launch date confirmed 1\\/6\\/26261600?](https://preview.redd.it/5ue7dydfjx571.png?width=380&format=png&auto=webp&s=fe3954f257560cc67e0f9fa110abe2fe40154f3c)\n\nNext let's enter the timestamp into [https://www.unixtimestamp.com](https://www.unixtimestamp.com/)\n\n&#x200B;\n\n[Made at exactly 4:20 a.m. in Texas \\(where GameStop HQ is\\)](https://preview.redd.it/dclsyedjjx571.png?width=1470&format=png&auto=webp&s=7f43f3ef9bd40de51bb9885bc06491e9a78b2709)\n\nWell well well… July 14th.  Just 2 days before a 400,000 option monstrosity expires.\n\n**Edit 1;** Coincidentally, July 14th is **Bastille Day**, a national holiday in France commemorating the French **Revolution** against the wealthy monarch elites.\n\n**Edit 2;** Always remember - this is pure speculation & investigative journalism, **not financial advice !!!** An opinion piece should be treated as such.\n\n**Edit 3;** Note that the launch of an NFT and the issuance of a dividend do not have to coincide or be correlated in any manner. Any specific dates are pure speculation. Furthermore, the NFT business direction GME seemingly has shown an interest in, can equally be interpreted as such - A strategic business decision, not correlating to a short squeeze.\n\n**Edit 4 by** u/AChipOnYourShoulder ; Restored the pictures with new smooth brained captions\n\n**TL;DR**\\- Ryan Cohen may just  Pull off the Play of the Century. Let’s be patient and watch shall we?\n\n**References:**\n\nAvery, H. (2005) *Naked Shorting: The Curious Incident of the Share that didn’t exist.* Available from: [https://www.euromoney.com/article/b1320xkhl0443w/naked-shorting-the-curious-incident-of-the-shares-that-didnt-exist](https://www.euromoney.com/article/b1320xkhl0443w/naked-shorting-the-curious-incident-of-the-shares-that-didnt-exist)\n\nMoyer, L. (2006) *Naked Horror.* Available from: [https://www.forbes.com/2006/08/25/naked-shorts-global-links-cx\\_lm\\_0825naked.html?sh=704b42888400](https://www.forbes.com/2006/08/25/naked-shorts-global-links-cx_lm_0825naked.html?sh=704b42888400)\n\nPenn, W (2008) *SEC transcript.* Available from: [https://www.sec.gov/comments/s7-08-08/s70808-145.htm](https://www.sec.gov/comments/s7-08-08/s70808-145.htm)\n\nPoletti, T. (2019) *Opinion: Overstock founder tried to squeeze short sellers, then sold out when the SEC cracked down.* Available from: [https://www.marketwatch.com/story/overstock-founder-tried-to-squeeze-short-sellers-then-sold-out-when-the-sec-cracked-down-2019-09-19](https://www.marketwatch.com/story/overstock-founder-tried-to-squeeze-short-sellers-then-sold-out-when-the-sec-cracked-down-2019-09-19)\n\nPalmer, D. (2020) *Overstock Hands Shareholders Digital Dividend.* Available from: [https://www.coindesk.com/after-lawsuits-and-delays-overstock-hands-shareholders-digital-dividend](https://www.coindesk.com/after-lawsuits-and-delays-overstock-hands-shareholders-digital-dividend)\n\nQuast, J. (2020) *Why Overstock continued its 500% Climb with Another 15% Gain on Wednesday.* Available from:  [https://www.fool.com/investing/2020/05/06/why-overstock-continued-its-500-climb-with-another.aspx](https://www.fool.com/investing/2020/05/06/why-overstock-continued-its-500-climb-with-another.aspx)",
    "title": "Ryan Cohen’s Play of the Century - The History, The Set Up, & The Final Play",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1ocld/ryan_cohens_play_of_the_century_the_history_the/"
}