{
    "author": "bobsmith808",
    "created_utc": 1618854766.0,
    "distinguished": null,
    "edited": 1618938337.0,
    "id": "mu6a4n",
    "text_only": true,
    "flair_text": "💭 Opinion 💭",
    "name": "t3_mu6a4n",
    "num_comments": 36,
    "permalink": "/r/GME/comments/mu6a4n/psa_remember_hfs_are_watching_us_dont_give_them/",
    "score": 555,
    "selftext": "If this weekend proves anything (other than HFs r Fuk), it shows just how closely HFs are watching us.\n\nThey took active measures to change their behavior and data available to the public very soon after their actions were made public in this sub.\n\nIF you must post positions, I would maybe try to at least obfuscate the data they are able to mine in some way.... Maybe change your total invested number to  show $69420 and hide your cost basis.  These are both amazing data points for them to work with and they can extrapolate a battle plan to continue into super advanced fuckery with enough information.  Also applied to when you decide to sell a few shares during the MOASS, just think even if Melvin was finally margin called there could be others that haven't been and can sti use your information against you.\n\nIf 🦍 think he want to share his 🍌 positions with other 🦍, just try to do it in a way that doesn't benefit HFs continuing this fuckery.\n\nAlso, try not to be a douche even though these asshats really deserve it.  Take the high road and help prevent any opportunity for them to initiate a smear campaign on retail because they will if given the opportunity.  \n\nYou have already won the war, you are just now waiting for them to admit defeat and kick off the aftermath.  Depending on how this all ends up going down , there might be a LOT of angry people out there so keep riding that high 🐴 all the way to the 🌚\n\nEdit: Looks like u/rensole added this to his morning DD (thanks for watching ren! Much ❤️ 🦍).  Not sure if it's apes downvoting or more shillbots, but w/e... IDGAF about karma or upvotes or awards.  Just remember to be excellent to each other.",
    "title": "PSA:. Remember HFs are watching us. Don't give them any data to work with and don't be a douche. Claim that victory with grace and munch some Tendies after.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mu6a4n/psa_remember_hfs_are_watching_us_dont_give_them/"
}