{
    "author": "olde_english_chivo",
    "created_utc": 1626839118.0,
    "distinguished": null,
    "edited": 1626855124.0,
    "id": "ooi321",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_ooi321",
    "num_comments": 298,
    "permalink": "/r/GMEJungle/comments/ooi321/its_starting/",
    "score": 2021,
    "selftext": "Edit: \n\nDisclaimer - this is completely anecdotal. Please take this with a fistful of salt. To be clear, I’m sharing this because I found it curious that there are people in the real world, people outside the four walls of these subs, non-apes, that are perceiving things in the market, possibly the same things apes are seeing, manipulation and idiosyncratic behavior, and are reacting to it. Also, I made use of some hyperbole as it is unlikely the MOASS will start because a single accountant and a handful of her clients. Still, if one group is experiencing this sentiment, perhaps it is widespread.\n\nOriginal post:\n\nTL;DR: an accountant’s clients are spooked about the market and are asking her what to do with their money.\n\nHello, olde_english_chivo here. \n\nI wanted to share something that I came across today which has got me more excited than all the DD I’ve read over the last 7 months. To use the simian parlance: my tits are fucking jacked.\n\nAn acquaintance of mine works at a financial institution. A customer of this acquaintance called in asking about their CD rates and financial advisors. This customer is an accountant and in her words: “the markets are in trouble and nobody is talking about it.”\n\nApparently, this accountant’s clients have been contacting her recently and asking her what to do with their money. This got her worried about her own money and she contacted her financial advisor who told her to simply ride out the storm, in other words, ride the market down a cliff and be a bag holder. Unhappy with this response, she started shopping around for a safe place to put her money. She’s seeing something happening out in the real world which the mainstream media is not talking about. Now, unfortunately, my acquaintance cannot give financial advice and did not pry, but something has got these people spooked. \n\nIt’s starting.\n\nFor months we’ve been reading about what have essentially only been ideas in the collective minds of apes. We’ve hypothesized about a market crash catapulting GME. I firmly believe we’re on the right side of financial history, I’ve never doubted the DD, but for some reason, this feels different. It’s people out in the world that have no connection to these subs, or to each other, all simultaneously getting a bad feeling about the market. Something has got these people spooked. Something is happening out in the real world outside of these subs that’s got these people worried about their money.\n\nI’m equally excited and scared about what’s to come. To be clear, I’m not fearful of having placed a bad bet, I’m nervous about the journey we’re about to embark on and all the fucking money we’re about to make. \n\nIt’s starting apes. Buckle the fuck up.",
    "title": "It’s starting…",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ooi321/its_starting/"
}