{
    "author": "coif",
    "created_utc": 1626805186.0,
    "distinguished": null,
    "edited": false,
    "id": "oo7smn",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_oo7smn",
    "num_comments": 520,
    "permalink": "/r/GMEJungle/comments/oo7smn/just_finished_the_big_short_i_need_to_rant/",
    "score": 3613,
    "selftext": "This entire time people have listed _The Big Short_ as a must watch. I blew it off since its release. This morning, I needed some noise in the background while I work and thought - why not?\n\nI stopped everything. I watched, slightly confused, trying to keep up with the minimal understanding I have of the concepts covered. By the middle I was disgusted. By the end, I cried. Not exactly because of the movie itself. I cried at the realisation that not only is this entire market fraudulent, but my reality itself. \n\nI’ve spent my entire life doubting myself. _Maybe I am dumb? Maybe I really don’t understand anything, and it’s best left to more intelligent people. Maybe I’m not worth this job. Maybe I am only worth minimum wage._ And it's because of greed. Everything is a lie built to make the rich richer. So much of this goddamned world has been influenced by greed, and it is upsetting to the point of tears. \n\nAnd it’s because that’s what we’ve been taught. We’re dumb and don’t understand. We’re not worth anything, so we should accept our paltry allowance for the gift that it is. \n\nWitnessing my family struggle. Witnessing everyone struggle. And knowing now that they **knew**. And they let it happen. And worse, that they felt not a single ounce of empathy is truly truly sickening. For me, this isn’t even about making decent gains any more. At this point, I don’t care if my positions go to zero. I want to make ‘them’ suffer. I want them to feel even a FRACTION of the pain that billions of people have endured to finance their games. This whole system is fucked, and honestly, I just want to watch it burn.\n\nWe may be a million apes with typewriters, but we’re NOT dumb. In community and communication we have power. And we’re beginning to learn that fact.\n\nSorry for the rant, but I needed to get it out and I didn't know who else to turn to.",
    "title": "Just finished The Big Short. I need to rant.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oo7smn/just_finished_the_big_short_i_need_to_rant/"
}