{
    "author": "HappyBus8759",
    "created_utc": 1627215701.0,
    "distinguished": null,
    "edited": 1627238133.0,
    "id": "oral0c",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oral0c",
    "num_comments": 195,
    "permalink": "/r/Superstonk/comments/oral0c/the_psychology_of_1_how_to_hold_like_a_boss/",
    "score": 2706,
    "selftext": "Many of us have been here for months now, patiently waiting for the most significant economic event the world will ever see. Buy and Hold is the mantra of the ape and most of us have been able to significantly increase our positions since we first bought in.\n\nAll of these additional shares that apes have been able to acquire for so cheap, will mean that a large amount of apes will have life changing sums of money in the very early stages of the MOASS. There will be an overwhelming temptation to sell some of your shares to lock in profits. \nWe all know this is bad for the squeeze and selling on the way up, even to cover your initial investment,  will inhibit the apex peak. \n\nIf you truly want to see a peak in the 10s of millions and ensure that the bad actors’ suffering is maximised, you need to condition yourself to assume that you only hold 1 SHARE. \nIt will also help to keep your mind at ease and retain control of your emotions in the early stages. \n\nMany apes have openly stated that regardless of how many shares they own, they plan to sell only 1 share AFTER the apex peak of the squeeze  and hold the rest for eternity. And we all know that single share won’t be sold until it is worth 10s of millions of dollars. \n\nNone of this is financial advice, but it’s the strategy myself and many others will be using to ensure the apex peak will be maximised. \n\n💎🙌🏻🚀🚀🚀🚀",
    "title": "The Psychology of 1. How to hold like a boss during the MOASS 🚀🚀🚀🚀",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oral0c/the_psychology_of_1_how_to_hold_like_a_boss/"
}