{
    "author": "happy_dick_punch",
    "created_utc": 1626761233.0,
    "distinguished": null,
    "edited": 1626761932.0,
    "id": "onw8hg",
    "text_only": true,
    "flair_text": "🦍 How To 🦍",
    "name": "t3_onw8hg",
    "num_comments": 52,
    "permalink": "/r/GME/comments/onw8hg/gme_prepper/",
    "score": 507,
    "selftext": "If you read this entire thing. Thank you.\n\nI write to you as an older millennial who came from nothing. No help. Had a rough go. Finished school. Worked hard. Still couldn’t climb out of lower class. Had -$200 in my bank account and in 5 years transformed my mind and my business to closing serious six figure deals regularly.\n\nThat being said, this post isn’t about me. This post is about YOU. How can YOU prepare yourself NOW before anything happens and you wake up one day with more money than you know what do to with. \n\nYou need to be prepared and the preparation starts NOW. \n\nReal wealth is quiet and stealth and listens more than it speaks. Drill this into your fucking head right now. Do not chase this lifestyle and be very skeptical of who you follow if they have a huge media and social platform. Buffet and Dalio are the real deals. Find and listen to people with their thinking and TEMPERMENT. I know plenty of very wealthy people who hold a subdued and quiet temperament. You wouldn’t know their net worth by passing them on the street. It’s time to play the long game apes. Prepare yourself now. \n\nTOPICS\n\n1. The foundation (mission, vision, purpose)\n2. The plan\n3. Who you will help\n4. How to sell during MOASS\n5. Read up\n6. Get your ape soul right\n7. Get your body tuned\n8. Future finances\n9. Prepare for change\n10. Trust\n11. Risk\n12. Investing \n13. Assets vs Liabilities\n14. Get your house in order\n\n\n———-\n\nThe Foundation \n\nPurpose\nDefine your purpose. What is the reason, post-squeeze, you will get out of bed? What makes YOU want to make the world a better place?\n\nFor me, I want build new systems and innovation. \n\nVision\nThe vision is your long term goal of whatever you do. Do you want to start a business? What does that look like in 10 years? Do you want to impact your community? What does successful impact in your family, community or world look like? Write these down.\n\nMission\nThe mission are the things you commit to on a daily basis to fulfill your purpose and achieve your vision. Write these down and connect them back to your bugger vision.\n\nIf you can sit and think with your smooth brain and write down your purpose, vision and mission - you’re already many steps ahead. This will be your guiding light for your life. It may not happen the way you want but this will propel you forward into the future. You will be moving towards your path of meaning in life.\n\n————-\n\nPlan\n\nGet your head right\nGet your brain wrinkled\nMake a plan\nStick to the plan\n\nWrite things down. Make notes on your phone or a journal. Keep this around for ideas, business, money, strategy, things you learn when you watch YouTube or read new DD here. Document and make notes. I like to write these down in physical form because it’s always around if shit goes south, electricity goes down or it keeps it separate from being digitally accessible or found on my machine. Journal. Make notes. \n\n———-\n\nWho you will help\n\nWe talk a lot about who we are going to help, what we want to change and how this money will impact others. I want to encourage you to stop and think about this and to write some things down. Below are three lists I think you could work on for when the time comes.\n\nThree list types:\n1. Will help no matter what\n2. Might help\n3. Will never help\n\nMake a list of immediate people you plan to help. No matter how much you make post-squeeze - these are the people who will get taken care of one way or another. \n\nMake a second list - people whom you might help. You’re not sure unless they put in some work and provide you a business plan. \n\nLast list - a list of people you know who you will NOT help. No matter what. Think about this and stick to the plan. They will blow smoke yo your ass, call you, text you, invite you out, do “favors”. These people whom you already identified you will not help. They likely know it as well. \n\nCommit to this list and DO NOT stray.\n\n\n——-\n\nHow to sell during MOASS\n\nMake a plan of how you personally plan to sell. Write this plan down. \n\nStick to the plan when the squeeze happens. Your mind will be euphoric and you may not be able to make the best decisions when you’re seeing the biggest numbers ever in your account. Think about this. Write it down and stick to your plan. \n\nBelow is what I will be doing and following so I can visually see how many shares I can sell off at certain points and mark them off as I go. \n\nMake a grid. In the grid, list on the far left column \n1/32, \n1/16, \n1/8, \n1/4, \n1,2, \n1/3. \n\nAcross each row, list the amount of shares you own and how many shares equal each row - for example if you have 50 shares. Write 25 and 25 in two boxes next to 1/2. Or 12.5 in 4 boxes next to 1/4. This way you have a visual map of your shares and amounts. When the squeeze hits your heart is going to be pounding harder than a gorilla in heat. \n\nUse taxmytendies.com to review and plan for possible outcomes with this calculator. Highly useful tool.\n\n——-\n\nRead up - get some wrinkles\n\nSome of my favorite practical books to help you level up now and carry with you are below. These books impacted my life. Good news is: they are all on audio book as well. So if you’re an ape who can’t read - no problemo.\n\nRecommended books:\n- Millionaire Next Door\n- Intelligent Investor\n- 7 habits of highly effective people\n- 360 leadership \n- How to win friends and influence people \n- Rich dad poor dad\n- The tipping point \n- The case for gold\n- The artist way\n- Freakanomics\n- Emotional Intelligence 2.0\n- Innovation and Entrepreneurship \n- Directional Thinking\n- Subtle art of not giving a fuck\n- 12 Rules for Life\n- Ray Dalito All Weather Portfolio \n\n————-\nGet your ape soul right\n\nMind, body, soul. But if you’re soul is not settled, or moving in the right direction, you’re going to make selfish, greedy, malevolent or ignorant decisions. Not just for yourself but could impact those whom you are also trying to help. You 100% need to get your soul right. Whatever dark shadows live down deep - time to shine some light and have a hard look at those things. Get sober. Get rid of drugs and booze for the time being. Forgive yourself. Forgive others who’ve wrong you. Seek inner peace and freedom. If you want to be the inverse of the HedgeFucks who destroyed the system - you need to be the inverse of them. This requires the inner parts of you to be set right.\n\nMeditation\nPrayer\nEmpathy \nJournal \nGo quiet on social media\nStay away from drama \nTie up loose ends\nApologize if you’ve wronged anyone\nPrepare your loved ones \nForgive yourself\nForgive others\nConsider reading some ancient philosophy, theology, proverbs, ancient texts. Seek this out and do not skip over this. You need to look deeply at yourself\n\n“Clean your room before you try and change the world”. Clean up the soul before you try and help others.\n\n\n——-\n\nGet your body tuned\n\nPrepare your body now. Start small. The pandemic took the piss out of us, but we gotta be firing on all ape cylinders. You owe it to your future self. Take of yourself each day. \n\nSleep\nStress\nDiet\nExercise \n\n————-\n\nPlan for future finances\n\nNot financial advice. But if you don’t know about finances - I suggest you start reading up about the topics listed below. Plenty of info out there. Be very SKEPTICAL about signing up for courses or seminars or classes. Information is available if you’re willing to learn. The more you know, the better you are equipped to smell the bullshit and to make the right decisions. Knowledge really is POWER.\n\nAccountant\nBanking\nBank accounts (multiple)\nBusiness licenses LLCs\nTrademarks \nLegalZoom\nLawyers\nEstate and Trust planning\nRetirement \nInsurance\nLife insurance \nLarge auto insurance program\nWill / living will\n\nOnce you have these things in order. Print them out along with backups of your birth certificate, bank statements, social security, and important family documents. Make copies. Vacuum seal them. Put them in a safe. Then transfer all those copies to USB drives as digital backups. Keep these in a safe place. \n\n————-\n\nPrepare for making changes\n\nDelete or minimize information you share on social media. \nI’d start pruning your accounts now. \nRemove photos or posts that may be used against you. Lawsuits are real and shitty people exist.\nCreate privacy settings on accountants or delete them all together. \nSwitch email addresses or create a separate. \nProtonMail FTW\nUpdate and change passwords\nGet a VPN\nTurn off location settings on your phone\nDelete apps you don’t use or rely on\nChange call and text settings to only accept numbers in your contacts\n\n———-\n\nTalk with those you trust\nKeep your circle tight\nTalk with close people you trust\nBe careful of financial advisors\nBe careful of bankers\nBe careful of real estate agents\n\nKeep in mind, people who work in finance, banking or real estate - if they were as smart as they try to make you believe, they wouldn’t be doing the jobs they’re doing. They’d be incredibly wealthy sipping drinks from a yacht while someone else takes your call or meeting. Take their advice with a grain of salt and do nothing make any decisions without doing your own research. Always make decisions by doing your own research. However you stumbled here and have invested in GME either by way of some tip, reading DD or hearing about it - you made a decision from research. Apply this to every part of your life.\n\n————\n\nImportant question to ask:\nWhat is the risk?\nIf someone can’t answer this, they are either lying or too stupid to go into business with.\n\nA lot of people are going to pitch you ideas. I get pitched new ideas all the time. Hell, I got one this morning via text from a business partner. Point is: if someone can’t be honest about the risks or they haven’t done enough research to find the risk, do not do business with them. Let them sort out themselves or the problem before going into business with them.\n\n————-\n\nTime. Budget. Risk. \n\nThese are the most important things you must consider when starting something new. Of all of these, time is most important to me. When you say “yes” to one thing, you say “no” to everything else. Protect your time like your life depends on it.\n\n\n————\n\nInvest in things that will build you capital, income and profit over time\n\nSmall businesses\nPrivate placement investments\nEquities\nReal estate\nProperty\nRaw land \nArt\nCrypto \nPhysical metals (gold / silver)\n- I am very serious about gold and silver as a hedge against our eroding dollar. Sure crypto has value, but it is not physical nor has stood the test of time throughout human history. I highly HIGHLY suggest looking at gold and silver if you come into a lot of money. Experts say 10% of your portfolio is a good approach.\nCash - might as well put some hard cash aside as an emergency fund. 6 months of your living expenses and bills is the way. \n\nDon’t blow all your money on big boy toys. Go get a few, pay off your debts and have a little fun. But if you’re coming into life changing money, you want to play for a situation where that money continues to grow. So you basically are being paid on interest of investments every year to basically stay alive. The goal is to generate more money you can spend each year. This is how you build wealth. What you do with that wealth is up to you: for me, I’m going to radically innovate on some things at global scale. Money is the fuel to get me there. And investing myself means I am not beholden to any other investor, debtor or bank. That’s the goal.\n\n——\n\nAssets vs Liabilities \n\nIf you absolutely have to purchase a liability, stay patient and do your research. Buy the best one you can afford or find so you only buy it once. \n\nIf you run a business or startup a business - consider making lots of purchases that become business assets and write offs for your business. Assets vs liabilities is important to understand. When you make purchasing decisions from this framework it puts things into perspective about what you “want” vs what you “need”. When you’re “needs” outweigh your “wants” you have changed you’re thinking and are on a path of independence.\n\n———\n\nGet your house in order\n\n- Prep for 6 months in case shit hits the fan. In case of a real economic downturn or civil unrest, the last thing you want to be doing is driving around buying a ton of things with a possible target on your back from people you’ve done business with. That real estate agent? The land scalper? The food delivery person? People whom you don’t know will suddenly remember that you’re probably a good target. Get yourself setup with food, water, bug out fear for you and your family, medications, cash and home protection. Now this might be extreme, but I leave this as a point to wrap up. The goal is to start thinking about your life as blocks and systems. Build the blocks and stack the systems. You can do this. Educate yourself. Follow the right people. Listen to wisdom and learn from those who have really done it. Tune out the noise and the snake oil salesman. Protect your money and your future - you’re the start of building a new generational wealth for your family. You are the catalyst of change. You are the next Carnegie or Rockefeller. This is a new day and a new path.\n- I wish you all the best. I read the posts here of this can change so many lives. I want that for you. And more so I want you to be able to hold on to it after you get it. \n- Stay safe. Stay smart. Stay diligent. You got this.\n\nSigning off,\n\nTo the moon\n\nNOT FINANCIAL ADVICE YA GOOF",
    "title": "GME Prepper",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/onw8hg/gme_prepper/"
}