{
    "author": "redditcommentary",
    "created_utc": 1622643681.0,
    "distinguished": null,
    "edited": false,
    "id": "nqmwn0",
    "text_only": true,
    "flair_text": "𝗥𝗲𝗾𝘂𝗲𝘀𝘁",
    "name": "t3_nqmwn0",
    "num_comments": 17,
    "permalink": "/r/DDintoGME/comments/nqmwn0/apologies_if_not_appropriate_in_ddgme_urgent/",
    "score": 579,
    "selftext": "[u/StupidMonsters](https://www.reddit.com/user/StupidMonsters/):\n\nhttps://preview.redd.it/e2ij9t0f8s271.jpg?width=750&format=pjpg&auto=webp&s=894e42f580c47134c04a674fb0d74c6c88b57fb0\n\nRakuten Securities won’t let us apes vote because according to them they use Interactive Brokers as their US custodian and the shares are under Rakuten and not under our names!\n\nTHIS IS JUST AN EXCUSE!\n\nTiger Brokers who use Interactive Brokers as their US custodian under Tiger Brokers name let apes vote because of high demand for voting! IF THEY WORK THE SAME AS RAKUTEN THEN RAKUTEN HAS NO EXCUSE! THEY ARE LAZY AND INCOMPETENT!\n\nLet’s get 楽天証券無能 (Rakuten Securities incompetent) trending on Twitter!!!\n\nAnyone who is Japanese or international, knows Japanese or even just google translate is enough!!! We need to push them to let us VOTE!\n\nPlease, this is a cry for help. Most Japanese GME holders don’t know about the DD so there has not been a big movement yet. I’m trying my best to inform people around me but there’s not much I can do alone.\n\nI have so much love and respect for all you Apes!\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\n\n&#x200B;\n\nCHAT TRANSLATION:\n\nMe: There will be a general meeting of shareholders at GameStop next month, do I have voting rights? Shares are owned before April 15th. I’m using iSpeed on my phone.\n\nR:Thank you for your inquiry regarding the exercise of voting rights in US stocks.\n\nForeign stocks, including US stocks, are stored under the name of a securities company at a local custody institution. It is not stored in the name of the customer.\n\nTherefore, you can receive the rights of shareholders such as dividends and splits, Voting rights cannot be exercised. Thank you for your understanding.\n\nMe: I think Rakuten Securities can vote on my behalf, is that possible?\n\nR: Unfortunately, we don't do that. We apologize for not meeting your wishes.\n\nMe: What institution is the custodian of my shares?\n\nR: We will prepare the information. Excuse me a moment. Sorry to keep you waiting.\n\nIn the United States, there is a securities depository organization called DTC (Depository Trust Corporation), which is stored under the name of a securities company.\n\nThe shares purchased by our customers are stored under the name of Rakuten Securities in the Interactive Brokers (local agency) name account.\n\nMe: Thank you very much. I would like to ask some questions in English, is it possible? Or is there an English support center?\n\nR: We are sorry, but we do not provide guidance or support in English.",
    "title": "Apologies if Not Appropriate in DD.GME - Urgent Request from Japanese Apes Calling for TWEETSTORM SUPPORT | Hashtag #楽天証券無能 (Rakuten Securities incompetent)",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nqmwn0/apologies_if_not_appropriate_in_ddgme_urgent/"
}