{
    "author": "gmorgan99",
    "created_utc": 1616518528.0,
    "distinguished": null,
    "edited": 1616539337.0,
    "id": "mbj64u",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mbj64u",
    "num_comments": 580,
    "permalink": "/r/GME/comments/mbj64u/53_mil_volume_1pm_this_is_great_and_here_is_why/",
    "score": 9924,
    "selftext": "\nEST 12:55pm 3/23 (or 23/3, for u oversea apes)\n\nEdits through-out\n\nvolume is once again piss low. Even lower than expected in my opinion. This is great, but why?😎\n\nTo me, It shows that the hedge fund are running out of buying power, and apes are HODL strong. ✅\n\nRight before major pops in gme, we saw volume decrease IMMENSELY. don’t forget, we saw volume go over 100 mil end of January. We are seeing a major decrease in volume, but the stock is trading sideways 🚨\n\nToday is the earnings call, and from yesterday, I expected them to do every last thing they can to make GameStop look like a failed company via the stock market. So I pre-ordered the snazzy banana cat and picked up a few switch games 💎Personally, I just like the stock 🚀\n\nEdit: once again, if u see this, bots failed 🤣\n\nEdit 2: 1:34 EST 6.17 MIL volume\n\nEdit 3: just one of the reasons I love this sub, just wasted 10 minutes of my life reading a comment thread below about dishwashers 😎\n\nEdit 4: also just posted a $Gme hook and verse in honor of all you apes. check it out if you like music :)\n\nhttps://www.reddit.com/r/GME/comments/mbl0wz/jungle_gme_apes_written_by_me_please_take_the/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf\n\nEdit 5: 2:52 EST 7.50 MIL volume\n\nEdit 6: 3:08 EST 8.28 MIL volume\n\nEdit 7: 10.4 AT THE 🔔\n\nEdit 8: 13.87 MIL AT 5:53 EST\n\nI’ll just leave this here, 🚀🚀🚀🚀\nhttps://www.reddit.com/r/wallstreetbets/comments/mbpclz/gme_yolo_update_mar_23_2021/?utm_medium=android_app&amp;utm_source=share\n\nQuick edit 9: patience is a virtue 💎\n\nEdit 10: seems as if my prediction was possibly correct, “do every last thing they can to make GameStop look like a failed company via the stock market”. I listed in on the earnings call, and I was pleased with what I heard. Who knows maybe hedgies r completely dumping their shares cuz they know they fuk. Just speculation and opinion tho 🤝",
    "title": "5.3 MIL + VOLUME @ 1pm!! THIS IS GREAT AND HERE IS WHY🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbj64u/53_mil_volume_1pm_this_is_great_and_here_is_why/"
}