{
    "author": "ReBjorn65",
    "created_utc": 1616511681.0,
    "distinguished": null,
    "edited": 1616521799.0,
    "id": "mbgn48",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mbgn48",
    "num_comments": 101,
    "permalink": "/r/GME/comments/mbgn48/nssc002_and_nssc801_update/",
    "score": 2134,
    "selftext": "I did not see a new post yet on this. \n\nThe rules for NSCC-002 and NSCC-801 that were filed by the SEC on 3/18 just got updated on the Federal Register this morning. \nThey are set for publication tomorrow 3/24. \n\nThis will allow the DTCC to activate them. (From what I understand)\n\nhttps://www.sec.gov/rules/sro/nscc-an.htm\n\nhttps://www.sec.gov/rules/sro/nscc.htm\n\nhttps://www.federalregister.gov/agencies/securities-and-exchange-commission\n\nhttps://www.dtcc.com/legal/sec-rule-filings\n\n\nEdit: The rules being published on the Federal Register is an important next step. This does not guarantee immediate implementation by the DTCC. It will be updated on their site when put in to effect. \nhttps://www.dtcc.com/legal/sec-rule-filings\n\nThis is not my area of expertise. Please read the proposed rule changes yourself. \nImplementation timeframe of the rule changes is addressed in the later half of the document. Relevant snippets are below. \n\n\"NSCC would implement the proposed changes no later than 10 Business Days\nafter the later of the no objection to the advance notice and approval of the related\nproposed rule change37 by the Commission. NSCC would announce the effective date of\nthe proposed changes by Important Notice posted to its website.\"\n\n\"Date of Effectiveness of the Advance Notice, and Timing for Commission Action\nThe proposed change may be implemented if the Commission does not object to\nthe proposed change within 60 days of the later of (i) the date that the proposed change\nwas filed with the Commission or (ii) the date that any additional information requested\nby the Commission is received. The clearing agency shall not implement the proposed\nchange if the Commission has any objection to the proposed change.\"\n\nFiling of the rule change appears to have started a clock. \nIf approved with no objection by the SEC, this may be shortened to the 10 business day window. \n\nDoes publication on the Federal Register correlate to approval by the SEC?\n\n---\n\nNew Rules were just added to the DTCC awaiting SEC approval (to take effect immediately)\nThese are regarding the \"Recovery and Wind-Down Plan\" \n\nNSC-2021-004\nFICC-2021-002\nDTC-2021-004\n\n\"The recovery tools available to NSCC are intended to address the risks of (a) uncovered losses or liquidity\nshortfalls resulting from the default of one or more of its Members, and (b) losses arising from\nnon-default events, such as damage to NSCC’s physical assets, a cyber-attack, or custody and\ninvestment losses, and the strategy for implementation of such tools.\"\n\nHopefully someone can analyze or break down this rule change further. \n(It appears these may be for improving clarity)\n\n---\n\nTL;DR Check here daily if you want to know if the new rules have been approved.  \nhttps://www.dtcc.com/legal/sec-rule-filings",
    "title": "NSSC-002 and NSSC-801 Update",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mbgn48/nssc002_and_nssc801_update/"
}