{
    "author": "pepsodont",
    "created_utc": 1621450507.0,
    "distinguished": null,
    "edited": 1621485195.0,
    "id": "ngdwjj",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_ngdwjj",
    "num_comments": 1889,
    "permalink": "/r/Superstonk/comments/ngdwjj/theory_the_slgg_merger_is_happening_its_a_moass/",
    "score": 12004,
    "selftext": "I think it might be apparent from my posts now that I'm not wrinkle-brained in financials, chart reading and other ~~boring~~ important stuff but I like finding patterns. I've been working as a psychologist and a marketer for a long time, so believe me when I tell you there's a lot to be uncovered by understanding behavior patterns or just patterns of things that look unrelated, but really aren't.\n\nSome people call it far-reaching, tinfoil, confirmation bias, whatever - but check my post history and you'll see I've been more right than wrong.\n\nAs one of the veteran apes wrote in a comment in here once: \"One weird thing happening is a coincidence, two is enemy action\".\n\nSo with that in mind, let's check out why I think this is a pattern (not a coincidence) which is pointing into Gamestop merging with SLGG after all. Yes, even after we forgot about it because we thought it was a nothingburger.\n\nOnce again - this is a \"tinfoil\" theorycrafting. Don't go into comments telling me that, I KNOW. Get in here to get your tits jacked and drink up on confirmation bias. Alright, retards?\n\n**1. Gamestop changing its logo**\n\nToday, apes started reporting Gamestop changing its logo from \"Gamestop\" to just \"GS\" on WeBull. We also saw a changed logo on their astronaut tweet.\n\nhttps://preview.redd.it/rt1hpjcyo5071.png?width=591&format=png&auto=webp&s=b62b363068dbe4a36e486f62cfa77e83dffec0b1\n\nThere's no reason to do it unless you're planning on changing that logo - if they wanted it shorter, they could've gone for \"GME\" which is standard and everybody knows it.\n\n**Conclusion:** It looks like Gamestop is signaling a logo change. When do you usually change a company's logo? When the company goes through a transformation, **maybe a merger.**\n\n**2. The astronaut is drinking Carlsberg beer which underwent a notable merger recently**\n\nWe thought that the Carlsberg beer was a nod to our AMA with Carl Hagberg, but was it really?\n\nJust google \"Carlsberg\" and \"merge\" - [one of the biggest merges in the last year](https://www.bighospitality.co.uk/Article/2020/10/30/Carlsberg-and-Marston-s-merger-completes) with Marston's taking a smaller position of 40% despite their much more superior valuation with difference in 380 million of british pounds.\n\n&#x200B;\n\n**3. A merger would put GME shares on the moon, it's a fucking launch button**\n\nIf you don't know, I'll tell you something juicy. If, theoretically, Gamestop were to merge with another entity (RC Ventures, SLGG) and decided on changing their name even slightly, they would get a new stock market ticker.\n\nThat would initiate a mother of all share recalls since ALL the issued shares would have to be taken in for ~~questioning about Kenny's mayo habits~~ a reissuance - which means all the lent shares would be requested back and **the naked ones would have to be bought at market price**. **That would initiate the MOASS.**\n\n**4. Gamestop has a brand new official esports Twitter page**\n\nIf you create an esports Twitter page, you probably want to start dabbling in esports, right? But damn, it's fucking hard for a transforming company to just start an esports division on their own from scratch, where would they even begin? They didn't even hire key managers for this, so how are they gonna navigate through these salty waters?\n\nWell, the industry standard for companies who want to enter a new market and have cash is to simply BUY A COMPANY THAT SPECIALIZES IN THAT MARKET.\n\nBoy, would it be fortunate if such a company was aro....oh fuck me Ryan, where exactly were you a few weeks ago?\n\n**5. RC was near SLGG HQ and he tweeted about it**\n\n[Why would you pinpoint where you are Ryan?](https://preview.redd.it/o9lwxqvcp5071.png?width=1507&format=png&auto=webp&s=f08bd9a69f46f5094c7a85985d2c316db526603a)\n\n&#x200B;\n\n[Oh that's why!](https://preview.redd.it/puf08k8fp5071.png?width=967&format=png&auto=webp&s=77f5e8eac8974c2b6d58f82e5dfd08a480b4e737)\n\n**6. RC tweeted an ice-cream and a frog pointing at Ann Hand, CEO of SLGG**\n\n[I was there, 3000 years ago...](https://preview.redd.it/yvw3kl3ip5071.png?width=603&format=png&auto=webp&s=bd5b09f8fcc79eca28bbe14cbe22cc5938bd9a36)\n\nYeah, the famous ice-cream and a frog tweet. I don't think any of the theories as of to its significance paid off so let me offer one of the less popular ones.\n\nCheck out where did Ann Hand, the CEO of SLGG work before.\n\n[Coincidences, huh?](https://preview.redd.it/7swu9s1pp5071.png?width=796&format=png&auto=webp&s=3d421bcdf96bf5f2ca0faeb564c0f6ba0ad82088)\n\n&#x200B;\n\n**7. He tweeted \"love\" recently and a heart / love today** (probably completely wrong, check EDIT)\n\nWhy repeat the same sentiment Ryan? What's so important about love? Are you just sending positive vibes our way? You never did this before, why would you start now, without reason?\n\nMy personal opinion on this is that the grandma tweet didn't work the way he wanted to - maybe it was a funny coincidence it worked so well with lyrics saying hold me hold me squeeze me or maybe he didn't realize. After all, he never tried decrypting his tweets in song lyrics so I don't think it was intentional.\n\nDid you guys realize how fast this tweet came? It's almost like \"yeah, but I wanted to tell you something else\".\n\nBy going with that theory - what does \"love\" usually mean? Love, sex, all that stuff - i**sn't it a merger between 2 people usually?** Hmmm? HMMMMMMM?\n\nI know many people will say \"tinfoil\", \"far-reaching\", \"reaching\", \"speculating\", blahblah, miss me with that noise. No shit this is a speculation, there's nothing else to do with it.\n\nBut that's how investigation works. You create a hypothesis, a theory and later you'll see if you were right or not. For me personally, these things are adding up too nicely for them to be \"just coincidences\" or \"glitches\" or shit.\n\nNo, this is a pattern.\n\nCould I be wrong? Most likely. But it's the best we got imo. Have fun jacking them tits to this motherload of confirmation bias! 🚀🚀🚀🚀🚀🚀\n\n*- Jacques Le Titz*\n\n**EDIT:** It came into my attention that the heart ❤️ tweet would be much simpler to explain with “hedgies are on their last life”. I’m a big fan of Occam’s Razor, so I’m going to go with it - the grandma tweet has therefore been decrypted nicely and “love” isn’t the concept he’s going for!\n\nI also like the theory it's a < and 3, which means \"less than 3\" weeks to the meeting. Theorycrafting is fun!\n\n**EDIT 2:** Ugh, because I probably should’ve seen it coming - no people, I’m not encouraging anyone to buy SLGG. The only position I have is GME, because that’s the only play.\n\nBut if you want to I mean, sure, I’m pumping it and then dumping with a fucking tinfoil hat theory, Jesus. I have the dump button right before me and it’s big and red (that’s what she said). SMH\n\n**EDIT 3 because of course:** Guys, please, be careful about buying SLGG. People are already going apeshit (haha) on me that this is a pump and dump post since **Citadel is long on SLGG**.\n\nThat fact alone doesn't mean anything since Shitadel is long on thousands of stocks and they could expect GME to do exactly what I've been saying and maybe they want to block them by voting against or they wanna ride the wave, I don't know. Nobody knows. Just...fuck other stocks except GME okay?\n\nIt's also up by 15% or so AH so yay for the power of Superstonk I guess?\n\n**EDIT 4:** No I don't have a damn clue what's going on with the All Seeing Awards. Maybe DFV's mouse button got stuck and he needs help with the mouse since he's not a cat?\n\n**EDIT 5:** For those who STILL don't believe this is an organic post, here are the screenshots ( [https://i.imgur.com/naiRTJP.png](https://i.imgur.com/naiRTJP.png) and [https://i.imgur.com/f3CEioL.png](https://i.imgur.com/f3CEioL.png) ) of how the idea originated in our private Discord and that should be the end of it or I swear to Wendy's tendies I will turn into a vibrator from so much shaking of my head.",
    "title": "Theory: The SLGG merger IS happening, it's a MOASS launching button and RC has been pointing it out for a long time (TODAY AS WELL ♥)",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/Superstonk/comments/ngdwjj/theory_the_slgg_merger_is_happening_its_a_moass/"
}