{
    "author": "Ponderous_Platypus11",
    "created_utc": 1628528994.0,
    "distinguished": null,
    "edited": 1628531289.0,
    "id": "p15qsj",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_p15qsj",
    "num_comments": 749,
    "permalink": "/r/Superstonk/comments/p15qsj/nft_dividends_are_real_biologics_company_on_the/",
    "score": 9172,
    "selftext": "On July 14th, an OTC traded biologics company announced that they would be issuing a **NFT DIVIDEND** for every 100 shares of their stock held. **THAT'S RIGHT, ANOTHER CO LAUNCHED A NFT DIVIDEND RIGHT UNDER OUR NOSES. PRECEDENT SET**:\n\nLatest details:\nhttps://stockhouse.com/news/press-releases/2021/08/09/ev-biologics-nft-dividend-information\n\n\nOriginal announcement:\nhttps://www.biospace.com/article/releases/ev-biologics-announces-nft-dividend/\n\n\nAs a reminder, this announcement was within a day or two of the expected creation/go-live, whatever it's officially called, of the GameStop NFT on the E ther network. You've all read plenty on the blockchain basics and how it works but this is the first I'm ever hearing of the NFT concept being used exactly as predicted in the stock market. \n\n\nEven though GME's token has been delayed, I'm dumbfounded that I haven't seen a single post about this until today. It's no longer a pipe dream crayon sniffers...this sht is real!  **I'm JACKED...TO THE TITS!** 🤯🔥\n\n\n\n**Credit to u/lightcoffeeman for first finding this**\n\n**Edit**\nu/awesomeusernam3 found another OTC company that announced their NFT Dividend at the end of July. I can't seem to find their investor relations page so just this release for now. These guys are doing 2:1.\n\nhttps://www.globenewswire.com/news-release/2021/07/29/2271385/0/en/Black-Dragon-Resource-Companies-Inc-NFT-s-Dividend-Record-Date-and-Payout-Date-established.html",
    "title": "NFT DIVIDENDs ARE REAL! Biologics company on the OTC Market announced theirs back in July, when GME's was predicted to go live. This is a really exciting precedent set for decentralized finance and of course...the MOASS!",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/p15qsj/nft_dividends_are_real_biologics_company_on_the/"
}