{
    "author": "vasDcrakGaming",
    "created_utc": 1622900862.0,
    "distinguished": null,
    "edited": 1622910600.0,
    "id": "nsw3xk",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nsw3xk",
    "num_comments": 219,
    "permalink": "/r/Superstonk/comments/nsw3xk/possible_explanation_for_lee_saying_naked_shorts/",
    "score": 999,
    "selftext": "1. Just total accident. They know about it and just accidentally spoke it on national tv. \n\n2. 4D move by Lee to leverage her position, they cant fire her because she can expose them (manipulation) so she extort money from cnbc, she tryna get that sec whistleblower money.\n\n3. She owns GME because she is informed about naked short selling and just wants the rocket to launch soon because working for cnbc sucks\n\n4. Could be a possible smoke by HF to “accidentally” say naked shorts on cnbc…what are we missing this weekend? What did they not want us to find out? All these news about banks/brokers restricting shorting of gme and or distancing themselves from gme? Is there anything that is coming out this weekend they wont find out?\n\n5. They “accidentally” did it so that we get hyped and say thats the catalyst then they just hammer the price down on Monday and kill morale.\n\n6. “Accidentally” said it to have people fomo into the “naked shorted” stocks, if I were a new ape I would be buying the cheaper stock, not the 200$ one. They have been setting this up for weeks advertising amc or bb while talking down gme. \n\n\nEdit 1: Some people saying its just 1…but Im thinking WHY THEY WOULD SHOW HER FACE? the camera was on the dude getting interviewed and they change to show her reaction. Sus bruh\n\n\nNot financial advice. Add in the comments what you think this really is and what good DD have been buried by the hundreds of Melissa Lee memes",
    "title": "Possible explanation for Lee saying naked shorts on CNBC",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsw3xk/possible_explanation_for_lee_saying_naked_shorts/"
}