{
    "author": "ChemicalFist",
    "created_utc": 1622905747.0,
    "distinguished": null,
    "edited": 1622968171.0,
    "id": "nsxsdu",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nsxsdu",
    "num_comments": 261,
    "permalink": "/r/Superstonk/comments/nsxsdu/psa_countertheory_shitadel_controls_the/",
    "score": 946,
    "selftext": "Hello fam, we need to have a talk.\n\nThis is getting a lot of apes excited right now:\n\n[Expect to see this hashtag a lot over the weekend and in the coming week.](https://preview.redd.it/rpvhdnonfg371.jpg?width=1171&format=pjpg&auto=webp&s=2b0590765452bacafba3dd4a06d233cc3358654b)\n\nTits are jacked, apes are excited and for a good reason - **the cat is out of the bag**. But before you go all Jacques Tit, let me tell you a story that may or may not be proven true come next week.\n\nImagine, if you will, that a meeting much like this one happened at Shitadel during the past week or so.\n\n**Citadel-Lead 1**: \"Sir, the apes are not selling. We've tried everything, but our estimates indicate that they will keep holding. We believe that the best we can do is to avoid further retail investors from getting into GME long positions, and *possibly* shake loose a portion of retailers that are not part of the core Reddit demographic.\"\n\n&#x200B;\n\n[Coming - This Summer! \\(yes, that was the entire punchline\\)](https://preview.redd.it/199bvhijhg371.jpg?width=1200&format=pjpg&auto=webp&s=9ef4ccfbad86aaa658bb0cd30c6398f3585c9a78)\n\n**Citadel Lead 2** : \"We also have to deal with the GameStop annual meeting somehow: they have no reason ***not*** to disclose the vote count, so we have to assume that *naked shorts* will become a heated topic in the public eye over the next few months.\"\n\n**Ken**: \"We will do... what we always do: we take the bull by the horns and *fight* until the fight is over.\"\n\n[A gamer never underestimates his opponent.](https://preview.redd.it/90464sqkgg371.jpg?width=1200&format=pjpg&auto=webp&s=704454a5179c38046c62c26a8b80dc46e29f2ea0)\n\n**Ken:** \"\\[Lead 1\\] - What's our position in AMC?\"\n\n**Citadel Lead 1**: \"At the moment Sir, we have a long position of \\[number\\] million shares.\"\n\n**Ken:** \"Good. Get CNBC on the phone. Yes, call Jim right away, let's see if he's still in. He should be.\"\n\n\\---\n\nLet's say this conversation took place and certain things were put into motion. After a while, on one lovely Friday, this happens.\n\n[Melissa, show us your worst \\\\\"Oh no...\\\\\" -face. Yeah, just like that when the Studio 2 mike was still open and Belinda went... That's it - perfect! We'll use that. Look okay? Good.](https://preview.redd.it/xiel5f91ig371.jpg?width=1200&format=pjpg&auto=webp&s=8cea93fbe9bcdc44e8f4d1fce698e911163d6b7b)\n\nNow, an operation like the CNBC that is run by Big Money *can* and absolutely *will* make mistakes from time to time, but I doubt that this was the case here with Melissa. We've seen segments snipped from Congressional Hearings, for example, so we know live is not *live* per se - there's a delay. This give them a window to operate within if someone blunders or says a key word on the air that raises a flag.\n\nHere's my theory: **this whole thing was planned**.\n\nThe interviewee was saying something about shares that should not be on the market, and Melissa then drops her Phrase-Face bomb. Immediately after, the broadcast also *cuts* directly Melissa's image right after she's said it, making the situation *worse* for CNBC and the shorters.\n\nIn fact, Melissa looks so surprised here that I wouldn't put it past CNBC to have pre-recorded her saying \"Naked shorts, yeah...\", then running that audio bit over the interviewee's speech segment and *then* cut the image feed into Melissa's face that now, understandably, portrays 100% genuine disbelief. She's a pro, though, so she just picks up what's been given and runs with it.\n\nI like Melissa, by the way - show some tact in your memes, fam. I think it's only right - she's a fox, but she may also have been made a cat(alyst).\n\n**Ok, but why would CNBC / Shitadel do this** ***intentionally?***\n\n&#x200B;\n\n[But why, Holmes?](https://preview.redd.it/s2ls30vhjg371.jpg?width=1200&format=pjpg&auto=webp&s=98b2ea2d02b8b4baef80e0527e244e02052af6db)\n\nGood question. I'm going to say: The Movie Stock. Yes, AMC. Sorry, folks - I said it.\n\nI'm not knocking our movie stock friends, but I genuinely believe that AMC is a Shitadel pressure-splitter, and one of their last ploys to shake paper hands off GME. It will also allow them to make back some money to short GME with in the coming weeks.\n\nWe've seen a million AMC mentions in the media lately, and at the same time, a slowly building media 'disinterest' and the dropping of ticker coverage when it comes to our beloved GME.\n\nSo: GME is done and dusted as far as the general public is concerned, but AMC is still ripe for squeezing (and it will)... and *oh shit*, CNBC just confirmed something HUGE by accident! Naked shorts! AMC's short interest must be through the roof! BUY BUY BUY!\n\nIf this is the narrative Shitadel *wants* out there, what is going to happen? Probably something like this:\n\n&#x200B;\n\n[No dates. I prefer plums anyway.](https://preview.redd.it/ndzaxsizjg371.jpg?width=1200&format=pjpg&auto=webp&s=c619f8411c163ca268aa6628beb168d4be596d2a)\n\nMelissa drops the \"mistake\" on Friday. Both the paid and organic Twitter army gets the relevant hashtag trending, and on Saturday it will already be all over the place, spreading the AMC gospel. Come Sunday, most of the world that is any way into any form of social media will have seen the hashtag. Citadel has now released the narrative out there in a controlled fashion, and are now ahead of the *naked short story.*\n\nTime to play.\n\nIf events play out like I believe they will, next Monday AMC will jump in pre-market, and spike beginning from early hours. This will probably be due to real retail FOMO interest and short-side purchases. AMC will legitimately begin its run. MSM will hype the 'squeeze', maybe even steal the MOASS monicker, and by Tuesday the numbers start getting *real* \\- real retail boomer FOMO begins, and everyone who is not a diamond-handed ape will hop onboard the AMC rocket. Yes, some people will sell GME to board AMC but that doesn't concern apes - we own the float.\n\nI suspect that this is the last Hail Mary to get all those people off of the GME rocket who do not truly belong on it. The shorters will take a beating, but much *less* of a beating than if those people chose to stay on the GME launchpad, shackled to our rocket and destined to paper-hand at a low-ass number like $1,000,000. It will be much cheaper for Citadel and Co. to let those people switch to the AMC rocket, no matter how high it goes, since that is something they can control. Citadel will make money from the AMC squeeze on the way *up* due to their long positions\\*,\\* and then short it on the way down, making even more money.\n\nAll paper hands have now been burned, the last tree has been shaken, and the final cash cow has been milked.\n\nMedia attention has been well and truly redirected from a failing brick and mortar video game store...\n\nOn Wednesday, the GME Annual meeting will reveal that there are a lot more votes than shares, but *naked shorts* is an old story now and AMC already squeezed massively - who cares about GME? That's old news, and they had their slight sprint in January, right? It was nothing compared to the AMC megasqueeze! The media will downplay GME and Shitadel now has the funds to keep kicking the can down the road, all in an attempt to minimize the GME impact and curb off late-stage retail FOMO.\n\nThis goes on...\n\n...and on...\n\n... and *on...*\n\nUntil one day. Marge calls, Kowalski gets to hear \"**Yes, Kaboom!**\" and the world will not know what hit them.\n\nExcept for the apes. On the moon, planning the next phase of taking back and restoring the planet for the *people*. The real players.\n\n&#x200B;\n\n[When the retail begins THEIR race...](https://preview.redd.it/1qrmywanlg371.jpg?width=1200&format=pjpg&auto=webp&s=e1683763ff31bbe7145cfd72b721cf77b2b54262)\n\n&#x200B;\n\n[...HOLD your position. Apes know REVERSE will hit the true, noclip tendie lane.](https://preview.redd.it/logc8jbqlg371.jpg?width=1200&format=pjpg&auto=webp&s=3d8ae68f7d4af0b3c01f3747361916236c396f89)\n\n**TL;DR**: Buy, hold and vote. I believe Ken is using CNBC's **Melissa ((Lee)** Harvey Oswald) as a patsy. AMC will squeeze as a Citadel pump and dump: both to make money for Shitadel and to control the Naked Shorts -narrative, drawing attention away from the GameStop Annual meeting and the (most likely humongous), actual SI%. If you want to be Jacques Tit about the Melissa 'blunder', please be civil and know that you may very well be propagating Citadel's own narrative.\n\nObligatory: not financial advice and I could very well be wrong too.\n\n&#x200B;\n\n**06/05 Edit 1**: u/distressedwithcoffee posted a [good counter to my thinking that Mel Lee's reaction was planted.](https://www.reddit.com/r/Superstonk/comments/nt1c6k/dont_believe_melissa_lees_shock_is_real_i_am_an/?utm_source=share&utm_medium=web2x&context=3) Note: as u/JKMC4 pointed out, this counter does not invalidate the full theory - Shitadel had some time to plan their play and how to capitalize on the slip-up before the hashtag started trending on Twitter.\n\n&#x200B;\n\n**06/06 Edit 2**: I've gotten a lot of questions in the comments about how I think this would work for Shitadel since a lot of apes would take their AMC gains and drop them into GME. I see two options here:\n\n**A)** (the more likely one) is that AMC will never squeeze - the short positions may have already been covered and the price will just be run up by Shitadel and Co. to a moderate amount, during which the MSM will be hyping it as THE squeeze. A glorified pump and dump - no more - making money for Shitadel to keep fighting GME.\n\nA number of you also directed me to [this post by u/myplayprofile](https://www.reddit.com/r/Superstonk/comments/nqzo1o/i_got_what_you_quant_6221_trading_analysis_and_a/?utm_source=share&utm_medium=web2x&context=3) (great read, thanks!), which would also tie in quite nicely, I think. Shitadel would have 'wiggle room' in AMC to raise the price up to around $100, which would be the 'max' setting in the cooling system of the nuclear reactor that is GME. Any controlled AMC run-up would literally act as a pressure valve and a way to raise funds to keep fighting GME.\n\n**B**) Letting AMC squeeze for realzies is a very, very risky play (and honestly, I doubt that the potential is really there anymore), but I believe it's also a *possibility* as well. The idea here is, that once AMC squeezes - undeniably so - then some paper-handed retailers *will* sell their GME to hop on the AMC rocket.\n\nFor this scenario to make sense, what Shitadel would then have to do once AMC is high enough and most of the paper-handed rocket-swappers committed to AMC, *would be to begin to cover* GME. No ifs, ands or buts. Cover for real - massive influx of insanely huge buy orders that propel the GME rocket way out of reach of the AMC one. This way, GME would launch so fiercely all the way to a number of trading halts that very few AMC-retail FOMOers would have the chance, means or the understanding to switch back to GME again. A good wombo-combo.\n\nThis would genuinely be Shitadel's last resort, Salt-the-Earth-Hail-Mary move, but it would make sense, if performed quickly enough: once GameStop's annual meeting takes place, the cat will be out of the bag anyway - everyone will know that the GME votes far surpass the float and that the real SI% rate has to be off the charts. This means *massive retail FOMO* is going to jump into GME, which is hard to fight in and of itself, but more importantly: there will be no *fear, uncertainty* and *doubt* about how high the GME rocket can ride.\n\nIf Shitadel and co. let GME begin to squeeze *after* the meeting, a lot more non-ape retail investors and boomer-FOMO will see the GME situation for what it really is and just grip it tighter, whereas if the squeeze happens before the meeting and before the hard facts will come out, the FUD will be real and more people will inevitably sell at rookie numbers.\n\nIf I had any AMC, I'd simply keep them for now, sell them before the pressure valve limit of $100 (maybe at the $85 mark) and buy GME with those profits. Not financial advice, of course - you do you; I'm just a monkey, I have no way of knowing for sure if any of this will play out like I think it *might*.",
    "title": "PSA / Counter-Theory: Shitadel controls the #NakedShorts narrative.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsxsdu/psa_countertheory_shitadel_controls_the/"
}