{
    "author": "Pitiful_Yellow_7274",
    "created_utc": 1617040439.0,
    "distinguished": null,
    "edited": 1617051811.0,
    "id": "mfv9we",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mfv9we",
    "num_comments": 1105,
    "permalink": "/r/GME/comments/mfv9we/just_posted_on_sec_оver_500000_awarded_to/",
    "score": 37511,
    "selftext": "Link to the Press Release on SEC's website:\n\n[https://www.sec.gov/news/press-release/2021-54](https://www.sec.gov/news/press-release/2021-54)\n\nFrom the release:\n\n**FOR IMMEDIATE RELEASE2021-54**\n\n*Washington D.C., March 29, 2021 —*\n\nThe Securities and Exchange Commission awarded more than $500,000 to a whistleblower who raised concerns internally before submitting a tip to the Commission. The whistleblower's information and assistance allowed the Commission and another agency to quickly file actions, shutting down an ongoing fraudulent scheme.\n\nThe whistleblower's information prompted an internal investigation by the company, which then reported to an outside agency, which in turn provided the information to the SEC. Separately, the whistleblower also reported to the SEC within 120 days of reporting the violations internally to the company. Under the \"safe harbor\" provision of the SEC's whistleblower rules, the SEC treats the whistleblower's information as though it had been submitted to the SEC at the same time it was internally reported as long as the whistleblower also reports the information to the SEC within 120 days of the internal report.\n\n&#x200B;\n\nEDIT: Credit to [u/SurpriseNinja](https://www.reddit.com/u/SurpriseNinja/) for suggesting this edit (and u/getoutside78 for pointing at it):\n\n*\"The SEC has now awarded approximately $760 million to 145 individuals since issuing its first award in 2012\"*\n\nIf I read this correctly we had $560 million in whistleblower payouts between 2012 and 2020. We have \"*nearly $200 million in the first half of FY21\"*",
    "title": "Just posted on SEC -- оver $500,000 awarded to Whistleblower",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/mfv9we/just_posted_on_sec_оver_500000_awarded_to/"
}