{
    "author": "pinkcatsonacid",
    "created_utc": 1622838032.0,
    "distinguished": "moderator",
    "edited": 1622856746.0,
    "id": "nsei2t",
    "text_only": true,
    "flair_id": "f1616402-b693-11eb-a256-0e4ef3af69e3",
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_nsei2t",
    "num_comments": 700,
    "permalink": "/r/Superstonk/comments/nsei2t/the_jungle_beat_friday_06042021_mission_critical/",
    "score": 5503,
    "selftext": "*This piece will be posted at 4:20 pm NYSE time every trading day!*\n\n*🖍Check out the new upvote/downvote crayons! 🖍*\n\nhttps://preview.redd.it/0xyofe1cb9371.png?width=1426&format=png&auto=webp&s=5d2c0087ad5e841f0dc8d78cc6d4cdac7a3cb894\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎤🎸🥁 🦍Welcome to the Jungle🦍🥁🎸🎤\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# $GME Closing Price: $248.36\n\n&#x200B;\n\nOpen Price: $256.02\n\nDaily High: $265.00\n\nDaily Low: $245.77\n\nVolume: 3.56 MM\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🖍🍎🚌GME 101🚌🍎🖍\n\n&#x200B;\n\n*If you're new to Superstonk, start here!*\n\n&#x200B;\n\n[Superstonk FAQ](https://www.reddit.com/r/Superstonk/wiki/index/faq#wiki_how_do_i.2C_as_a_retail_investor.2C_stand_a_chance_against_the_hedge_funds.3F)\n\n[Superstonk Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\n[The Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[House of Cards I, II & III in PDF format](https://www.reddit.com/r/Superstonk/comments/nm83eb/a_house_of_cards_parts_i_ii_iii_in_pdf/)\n\n*More DD to be added as we develop this section! This will be a daily recurring section that will serve as a go to reference for new apes!*\n\nAlso, as you probably know, [u/Atobitt](https://www.reddit.com/u/Atobitt/) has dropped HOC II&III. Pretty sure it crashed reddit when it dropped!! This piece was peer reviewed by such prominent experts as Wes Christian, Dave Lauer and mods as well. The apes of Superstonk sincerely appreciate the time and effort put into getting this information out there. 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# VOTE! by u/Bye_Triangle\n\n&#x200B;\n\n[Awesome artwork by u\\/Verdiii](https://preview.redd.it/686geoa4aa371.png?width=960&format=png&auto=webp&s=6f4feaddae7c50d73866b9a6d3827e85b2965e4f)\n\nAlright Apes,\n\n&#x200B;\n\nThe end is nigh, if you were given the opportunity to vote, and haven't yet... There is no excuse! If you want to see this Naked Short Selling scam brought to its knees then you **have** to make sure you submit your vote by the deadline.\n\n&#x200B;\n\n***This cannot be put off any longer.*** The Shareholders meeting is **NEXT WEEK**. Though this may be getting repetitive, it needs to be heard.\n\n&#x200B;\n\n# VOTE YOUR SHARES\n\n&#x200B;\n\nIf you've already voted, then spread the word to others-- everyone needs to be reminded of the importance of this.\n\n&#x200B;\n\n**Do it for the companies that have been uncerimoniously killed by this practice**\n\n&#x200B;\n\n**Do it for the people who lost their jobs because of these short sellers**\n\n&#x200B;\n\n**Do it for the Apes who are being disinfranchized by their brokers**\n\n&#x200B;\n\n**Do it for GameStop, who need the physical proof of the Naked Shorts**\n\n&#x200B;\n\n**Do it for whatever reason inspires you most...**\n\n&#x200B;\n\nhttps://preview.redd.it/kad2d8dxfa371.jpg?width=511&format=pjpg&auto=webp&s=5a9088eb2d6036cb83a0ca2faeae30062b17f746\n\nAlso comment !apevote! to get your special voted flair!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Ape Security Protocols \n\nby u/redchessqueen99\n\n \n\nIt has come to my attention that several members have been the targets of hacking attempts. If you notice edited or deleted posts on your account, or cannot login, this is likely a sign that you have been the victim of a dastardly shillfiltrator.\n\nThis is possible due to someone logging into your account if it has a weak password, having clicked mysterious links, or other creative methods utilized by bad actors. Therefore, I am writing some quick security tips for moving forward.\n\n&#x200B;\n\n[010101ook1010011ookook](https://preview.redd.it/fs2adorboc371.png?width=640&format=png&auto=webp&s=eb01be5d235d8f0ab3a782e3e588684a64d6f826)\n\nHere are some tips for keeping your account secure:\n\n1. Use an email or Google/Apple account that **does not match your username.** Your username is public, so remember that anyone can enter it just like you, or add [\"@gmail.com](mailto:%22@gmail.com)/@appe.com\" and either try to guess your password, or use a program to make attempts.\n2. [**Enable TFA / 2FA (Two Factor Authentication)**](https://www.reddit.com/r/announcements/comments/7spq3s/protect_your_account_with_twofactor_authentication/) with your reddit/Google/Apple account; this will require you to link your account to an email, phone number, or authenticator app, and any logins will require typing in a text/email/authenticator code to login. If someone tries to use this, you will receive the notification and become aware of the attempt immediately.\n3. **Be very careful with messages** received via reddit messages, chats, and especially links sent to you. These can be very dangerous as they can take you to fake sites or track your IP address. We also know that, because bad actors cannot post or comment, they switch to chats/messages, which we cannot track or moderate. You should consider any private message to be potentially suspect moving forward.\n4. Use a [**VPN service**](https://www.pcmag.com/picks/the-best-vpn-services)  \n (ProtonVPN / NordVPN / others, please do your research on best option); VPN's basically turn your internet connection from YOU---REDDIT into YOU---VPN---REDDIT, so any attempts to track you are filtered through a middleman server. The best VPNs are available for a modest monthly or annual cost; you can also use the browser Tor for a crowd-shared VPN of sorts.\n5. Finally, make sure your password is complicated enough so that hacker programs cannot easily crack them. For example, do not use \"password123\" or even \"ilikethestock\" but rather \"MoNkE2021StOnKsGoUp4p3$t063th3r$tr0n6\" - make them work for it. Every second we waste is a second we gain.\n6. If all else fails, and you find yourself a victim of hacking, you will need to resolve through reddit. You can [recover a username](https://www.reddit.com/username) or [get more information about security](https://reddithelp.com/hc/en-us/sections/360008917491-Account-Security), but also you can [contact reddit admins for assistance](https://www.reddit.com/contact/).\n\n**Why would they target us?**\n\nDoes this really need an answer? We are exposing their dirty laundry for the world to see. Therefore, it is cost-effective for them to spend money on professionals to try and destabilize the sub. Additionally, many trolls and bad actors exist on reddit who would love to see us break apart and fall. Our Approved Users list can also be discovered and they may be targeting our Satori-sanctioned apes in an attempt to undermine its use.\n\nTherefore, we all need to be extra careful, especially with the MOASS impending. I would not forgive myself if I was lazy in regards to keeping you all informed and protected. As mods, we truly understand the importance of your safety and protection, and this is why we are working diligently to keep your educated on the dangers and to implement new technology in an effort to counter their attacks.\n\nPlease leave comments if I missed anything and I will try to make sure I see it and update this post.\n\nLet's make sure the rocket isn't sabotaged. *Moon soon*\n\n&#x200B;\n\nBack to u/pinkcatsonacid\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nhttps://preview.redd.it/6b9p6oz3ra371.jpg?width=512&format=pjpg&auto=webp&s=f03078463ea5bdfa8089ddaf53389e6efb905f77\n\n&#x200B;\n\n**As you may have heard, Benzinga wrote an article about our AMA this week with Lucy Komisar and Wes Christian!!**\n\n&#x200B;\n\nAnd as you may have heard, yours truly has been invited onto a Mainstream Stock show.\n\n&#x200B;\n\n**Yes** it was super dope they wrote an article about Superstonk Live!\n\n**Yes** it was super mcnasty dope to see my name in MSM print!\n\n**Yes** it was ultimate supreme dope to know that we are gaining exposure!!\n\n**No**, I will not be doing any mainstream interviews at this time, *unless they are directly and exclusively discussing the issue of Naked Short Selling.*\n\n&#x200B;\n\nWhich I have a feeling, this won't be.\n\n&#x200B;\n\nSo while I am truly, seriously honored that I was so well received that an offer for an on air interview was warranted, I will await direct confirmation that this is discussing Naked Short Selling on Benzinga before engaging.\n\n&#x200B;\n\nIf it is, then buckle up, buckos.\n\nBut if not, buzz off, Benzinga. ✌\n\n&#x200B;\n\nhttps://preview.redd.it/muifsf1exa371.jpg?width=1080&format=pjpg&auto=webp&s=890da5bbb8febce32994fa96da60132bf8b08bc2\n\n&#x200B;\n\n[**My Diamond Whistle Blower OP, for those who haven't seen.**](https://www.reddit.com/r/Superstonk/comments/ms6yvq/blowing_my_diamond_whistle_as_a_highly_visible/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\nWhatever happens, I'll keep you updated!\n\n&#x200B;\n\n*A note on MSM: My comment from a post yesterday:*\n\n*I know it's exciting and cool to see our name in lights (my husband is probably going to print the benzinga article from today and put it on the fridge lol) but this post is an important message to remember as MOASS approaches and MSM coverage becomes inevitable and more widespread. THIS COMMUNITY has proven to be the ONE reliable source for verified, researched information in all this. NOT the main stream articles that our brokers want us to read.*\n\n*MSM is* ***not*** *suddenly our friend just because they recognized that we are doing their jobs better than them here on Superstonk. I do, however, think it's good to point out and celebrate when the media gets it right, within reason. And I'm happy when I see them covering the groundbreaking work we are doing here, like the interview Lucy performed on our behalf with Wes. It's a fine line to toe, but this group is the smartest bunch around and I know we can tell the difference. 💪*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# IT'S TIME TO RISE UP- Mission Critical 🚀🚨🚀\n\n*Expanding on the words of Wes Christian- by Pink*\n\n&#x200B;\n\nhttps://preview.redd.it/0mtp7l17za371.png?width=750&format=png&auto=webp&s=0f90cb38dd7cfc5fb1b261e41134ac83740c09a1\n\n[Here's the link to the original Wes Christian AMA that inspired the fuck out of me](https://www.youtube.com/watch?v=2rJujnpKiqM&t=350s)\n\n&#x200B;\n\n[And here's the link to the most recent Wes Christian AMA with Lucy Komisar](https://youtu.be/q8-JO3g5bm4)\n\n&#x200B;\n\n💎🙌\n\n&#x200B;\n\n# \"The people we are talking to now (apes) have got the best game in town. The best way to take on a bully, is be a bigger bully\"- Wes Christian on Superstonk\n\n&#x200B;\n\n***\"So, first I want to thank all the followers in this group. Which I understand is close to 300,000, so realize that each one of you are important to the cause, exposing this, getting this information out is critical. It's going to take all of us to make a change.\"- WC***\n\nDid you hear that, Superstonk? How about you in the back, lurkers? ( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)\n\nYOU'RE NOT ONLY IMPORTANT, YOU ARE HELPING PRODUCE AND DISTRIBUTE CRITICAL INFORMATION TO THE PUBLIC!\n\n***\"It takes a gargantuan effort, it takes people as strong as apes.\"- WC***\n\nApes are strong. Evolving. Adaptive. Resilient. And cunning. But they are stronger together.\n\n&#x200B;\n\nhttps://preview.redd.it/9zyslp5eza371.png?width=800&format=png&auto=webp&s=2ef72ad00c139d756c872a988cfd0ed6342fb7b4\n\n***\"It takes a warrior. It takes somebody that's principled that never gives up.\"- WC***\n\nOn days when FUD is high and hope is low, every single ape has to realize that it will take the diligence and resilience of a warrior to win this battle. Leroy Jenkins is within us all.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/3pl3u9cgza371.png?width=732&format=png&auto=webp&s=46fdf92cfc79252cc0ef4b9bb43bba24d9de4df8\n\n***\"It's up to each of us to make a decision. Do we want to be on the side of right or wrong?\"- WC***\n\nI think we all know which side the apes are on. And history will remember. For generations they have been robbing our families, stealing our ideas and our land and resources, negotiating our time and talents for pennies on the dollar, kept us in class and race wars to distract from the fact that... they've been stealing the world's wealth for a lot longer than Gamestop has been a company. And the game stops here.\n\n&#x200B;\n\nhttps://preview.redd.it/9xnpz6viza371.png?width=620&format=png&auto=webp&s=1dd7ad6339789bcdd4fd14cac4333217ea5b90cc\n\n***\"How do we want to spend the talents that God gave us?\"-WC***\n\nAre we going to let the FUD stop us from using our talents to grow, nurture, and thrive within this golden think tank that is **quickly becoming bigger, mightier, and more precious than the City of Athens?** Or are we going to put our wrinkles to work and create to share, to spread knowledge among our kingdom of apes, new and OG alike, and fortify these great walls we have built from the ashes of WSB and GME. To protect the culture and the inevitable philanthropy and hope that will come from these walls post-MOASS... we are a force to be reckoned with. What we are building together within the walls of this city will stand tall and proud, long after the squeeze has squoze.💖💪\n\n&#x200B;\n\n***\"Ultimately it's going to take massive amounts of people to want to be involved in this to expose it. We're gonna have to come together as a similar*** ***~~wolf~~*** ***ape pack to share education to educate ourselves and fight it. And to ultimately win the battle at least as was done in part with Gamestop.\"-WC***\n\n&#x200B;\n\nhttps://preview.redd.it/0qi53c7mza371.png?width=760&format=png&auto=webp&s=513faa15812bdb156f9810846a590fa3daac446b\n\n# \"It's gonna take a massive effort by the investing public to RISE UP...\"-WC\n\n&#x200B;\n\n[RISE UP!!!!](https://preview.redd.it/9m3c4bjoza371.png?width=1258&format=png&auto=webp&s=5cebec230927c10813fa24137a0c55556677578c)\n\n# \"This effort that this group of ladies and gentlemen are involved in is CRITICAL it's MISSION CRITICAL...\"-WC\n\n# \n\nhttps://preview.redd.it/8dmfx60rza371.png?width=300&format=png&auto=webp&s=882800906243abe07a859cb4f87e300bdc3ebd80\n\n***\"Fakeness, or lies, deserve no place in this process.\"-WC***\n\nGo with your gut. If someone tells you there's a price ceiling, and especially if it's in the (low) thousands, they are *fucking* *liars*. You know who tells you that the price ceiling is anything below an absurrrrd amount of money?\n\n**People that are paid to tell you that. And to sell on the way up. Especially as anything but a limit order. It's confirmed FUD. Ignore, report, correct in the comments. Call out those shill motherFUDers. Remember, if it looks like a duck and quacks like a duck! 💎🙌🚀🚀🚀**\n\n&#x200B;\n\n***\"Dilution is a very important point- Dilution is an actionable form of damage model.\"-WC***\n\n&#x200B;\n\nhttps://preview.redd.it/5fuexxpuza371.png?width=638&format=png&auto=webp&s=808badb985163e9e0cb42c8c03f91feea31dabe5\n\nI.E. big lawyer speak for, if you own shares, and your ownership has been diluted (like can be proven by overvoting) because of naked short selling, then **THOSE DAMAGES GIVE SUFFICIENT REASON TO TAKE LEGAL ACTION!**\n\n&#x200B;\n\n# 🚨OMG WE CAN SUE THEM!!🚨\n\n&#x200B;\n\n**\"In the next 3-6 months you're going to see some major things happen on the legal side. We've been increasing our bench exponentially, we've put a big pot of money together, and we're gonna go after this in unprecedented way.\" -WC**\n\n&#x200B;\n\n***\"What can change this? Doing what SuperStonk is doing, because it's going to take massive amounts of people to be involved to expose the bullies out there.\"-WC***\n\nSo what can you, dear ape, do to best help the cause here? VOTE YOUR SHARES! Upvote good content! Follow your nose and report FUD. **BTFD. HODL.** DIAMOND HANDS ARE STILL EVERYTHING- NO MATTER HOW LONG (or short 😝)!!!! Basically, just keep being fucking awesome. 🤙\n\nVoting your shares, or finding out what you can do in the case that you can't vote, is the most important thing you can do right now.\n\n**No matter what happens, dear apes, HODLing got us here. And HODLing will take us to the moon and beyond. Remember that by VOTING AND HODLing, we are the catalyst. The catalyst has literally been inside us the whole time. 🚀🚀🚀**\n\n&#x200B;\n\n**Stay strong and ever vigilant, my dudes. ✌**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Community Spotlight- u/BodySurfDan\n\n&#x200B;\n\nThe GME lyricist just keeps giving us songs to share. 🎶🐈🎶\n\n&#x200B;\n\nThis latest one makes Wes Christian look even more OG, which I didn't know was possible.\n\n&#x200B;\n\n[Here's the latest one from him](https://www.reddit.com/r/Superstonk/comments/nryidd/hold_the_gamestop_saga_soundtrack/), and be sure to check out his other songs he's posted here in Superstonk too. We love seeing the organic art created by the apes, for the apes!! You make the jungle beautiful!! 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# DFV Tweets\n\n&#x200B;\n\nhttps://preview.redd.it/rti669fv0b371.jpg?width=1077&format=pjpg&auto=webp&s=260983ec2d40c00ffdff11d3364e4573baf49c53\n\nhttps://preview.redd.it/2od54staxa371.jpg?width=1080&format=pjpg&auto=webp&s=12cea3627b312de263ebf336e498083df1c6eaaf\n\nhttps://preview.redd.it/gy30av7bxa371.jpg?width=1080&format=pjpg&auto=webp&s=aedf7452c6e3ed9b28487fbdaa3b510ddc104f64\n\nhttps://preview.redd.it/qymsktrbxa371.jpg?width=1077&format=pjpg&auto=webp&s=6e99ec31ddc63b312e9b9f065835234fa1ca6718\n\nhttps://preview.redd.it/z2at189cxa371.jpg?width=956&format=pjpg&auto=webp&s=bcbc7c1ad18549e5fee7cb4857531e4ae33594d0\n\nO^(h)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWe ain't going anywhere, it just means we get another week out in the jungle, screamin' with the apes. ***OOK OOK***\n\nJust remember, we got this far cause we do our research and we trust our findings. Armed with data there should be nothing that can kill the vibe. In the words of Dr. Burry:\n\n***\"I may have been early, but I am not wrong\"*** *(This quote has never rang more true)*\n\n**Reddit down, wot do?**\n\n&#x200B;\n\nMods have carefully considered what to do during a reddit blackout and advise the following - IF REDDIT GOES DOWN AT A PIVOTAL MOMENT go to:\n\n[SuperstonkLive YouTube - Emergency Broadcast System](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA)\n\n[https://twitter.com/ByeTriangle](https://twitter.com/ByeTriangle)\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n&#x200B;\n\nhttps://preview.redd.it/4jqvt3of2b371.png?width=1600&format=png&auto=webp&s=947c075f671e3f350f38c73d6901ad8c334dff0b",
    "title": "The Jungle Beat- FRIDAY 06-04-2021- MISSION CRITICAL 🚀🚀🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsei2t/the_jungle_beat_friday_06042021_mission_critical/"
}