{
    "author": "Auren1988",
    "created_utc": 1619186512.0,
    "distinguished": null,
    "edited": 1619203722.0,
    "id": "mwvy00",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_mwvy00",
    "num_comments": 998,
    "permalink": "/r/Superstonk/comments/mwvy00/1_burry_drops_one_last_warning_and_takes_a_step/",
    "score": 13887,
    "selftext": "In through the nose, out through the mouth. Deep breaths now, you got this. You didn’t spend all those hours on the shitter reading DD to turn into a pack of jibbering conspiracy theorists at this point in the game. You owe it to yourself to get alllll your shit in a bag and fucking compose yourself. You think Ryan Cohen is looking at this sub with pride in his eyes right now? Fuck no he isn’t, and you know the worst part....He’s not even Angry, He’s just Dissapointed!\n\nWash the conspiracy theories out of your ears. Take a step back. Compose yourself. \nFollow the example of Greater Apes. \nYou’ll be alright 👊🏼\n\nEdit: For everyone saying Rensole and Warden shouldn’t be mentioned in the same capacity as DFV and Burry. Seriously go fuck yourselves, I guarantee those two have spoon fed you more valuable info over the past few months and put more wrinkles on those smooth brains than DFV or Burry have directly. Easiest way to spot a shill?Look for users trying to force a wedge into a community by hyping some people up and putting others down. Hopefully the mods see that in some of the comments below 👍🏼\n\nEdit 2: This post made a lot of people happy. Good apes, good shills or bad shills, I’ll never know. But I do know one thing, 💎 🙌 🚀 🌝.\n\nEdit 3: You guys do know this was just a thought I wrote down while sitting on the shitter at work? Calm down, also hello fellow Reddit Reader Poopers. Enjoy your #2",
    "title": "1. Burry drops one last warning and takes a step back. 2. DFV posts his final position and takes a step back. 3. Warden stops streaming and takes a step back. 4. Rensole posts a final Morning News and takes a step back. BE LIKE THE ALPHA APES AND TAKE A STEP BACK!",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mwvy00/1_burry_drops_one_last_warning_and_takes_a_step/"
}