{
    "author": "sigep_coach",
    "created_utc": 1619200108.0,
    "distinguished": null,
    "edited": 1619200477.0,
    "id": "mx0wtk",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_mx0wtk",
    "num_comments": 1095,
    "permalink": "/r/Superstonk/comments/mx0wtk/shill_sniffing_dog_is_textbook_gaslighting/",
    "score": 8601,
    "selftext": "When Shill Sniffing Dog first came on the scene, he(she?) seemed like a great ally in the GME MOASS saga.  He would bark at shills and call out the bullshit.  He quickly endeared himself to the masses of apes by feeding our confirmation bias in a way that was amusing.\n\n\n\nRecently, though, he has taken a turn toward pushing QAnon-level conspiracies.  He tweets cryptic messages and makes references to reddit user Rat10@Bl3550n5 (codifying the name in case it leads to auto-ban) who had also been creating a conspiracy stir.  On top of that, Shill Sniffing Dog has started using the hashtag #GOODERTOGETHER.  This sounds a lot like #WWG1WGA (Where we go one, we go all), the calling card of the QAnon conspiracy group.  He makes mention of the \"cabal\" several times, which is another QAnon red flag.\n\n\n\nI believe that Shill Sniffing Dog is an attempt to infiltrate the apes in order to gaslight everyone.  Most GME holders are sane, intelligent people who are invested in GME as a calculated move.  When an endearing character who seems to be a central player starts to spew nutty conspiracy theories, it makes intelligent people question their own sanity. It makes people start to wonder if they actually got caught up in one big conspiracy theory.  It makes people start to question everything. Where does the good DD end and the conspiracy bullshit begin?\n\n\n\nDon't get wrapped up in the conspiracy bullshit.\n\n\n\nThis is all you need to know:\n\n**GameStop is heavily shorted.**\n\n**All shorts must cover.**\n\n\n\nEverything else is just noise.\n\nEdit: grammar",
    "title": "Shill Sniffing Dog is textbook gaslighting",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/mx0wtk/shill_sniffing_dog_is_textbook_gaslighting/"
}