{
    "author": "AgnostosTheosLogos",
    "created_utc": 1613563096.0,
    "distinguished": null,
    "edited": 1617258471.0,
    "id": "llswj6",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_llswj6",
    "num_comments": 110,
    "permalink": "/r/GME/comments/llswj6/compilation_of_obvious_violations_by_hedge_funds/",
    "score": 856,
    "selftext": "This is a list of the most obvious regulatory and legal violations involved in the GME event for informational purposes.\n\nShort outline of violations at the top. Some in depth citations and break downs at mid. TL;DR at the bottom.\n\n¯¯¯¯¯¯¯¯¯¯¯¯\n\nViolation Summaries\n\n¯¯¯¯¯¯¯¯¯¯¯¯\n\n* **Rule 10b-5** under the Exchange Act: *Selling stock short and failing to deliver shares at the time of settlement with the purpose of driving down the* security’s *price*. This manipulative activity, in general, would violate various securities laws, including Rule 10b-5 under the Exchange Act.\n\nThe high volume of failure to deliver(FTD) reports generated on $GME prior to, and during the spike event, and then generated on $XRT as a proxy after the initiation of short sale restrictions, are direct evidence of stock price manipulation, exactly as is described above.\n\nThe number of failures to deliver decreased in average daily volume as public attention and retail trading activity rose. This indicates that retail traders were not the primary origin of the high volume of FTDs, and implies their strategic use by short sellers to depress stock prices during the meteoric rise.\n\nThe high and prolonged volume of FTDs resulting from these shorting practices describes the persistent FTD-producing shorts as repetitive, extensive, and orchestrated intentionally to reduce the stock price, exactly as described in Rule 10b-5.\n\nA thesis on regulating ETF shorting due to abusive practices: [https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf](https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf) \\- discovery credit: u/CoastalHotDog835\n\n&#x200B;\n\n* **Rule 10b5-1** under the Exchange Act:  *specifies that a purchase or sale constitutes trading “on the basis of” material non‐public information where the person making the purchase or sale was aware of material non‐public information at the time the purchase or sale was made.* Rule 10b5‐1, adopted in August 2000, codifies the position of the SEC that “possession,” not “use,” of material non‐public information is sufficient to establish liability in insider trading cases.\n\nThe move of short positions to ETFs containing GME shares in large volumes created the \"material nonpublic information\" that high volume of shorted positions on GME were still open, and actively being traded, in direct violation of short sale restrictions on the stock.\n\nThis is insider trading.\n\nEven worse: This is insider trading on an illegal market manipulation scheme.\n\nAll parties involved in the move of short positions to ETFs could reasonably assume the continuation of previous business practices to drive the value of $GME down.\n\nThe public did not have any reasonable way to predict the intentional circumvention of regulations enacted to protect the investors from abusive shorting practices, nor could the public reasonably expect the continuation of high volumes of shorted positions resulting in FTDs to continue to depress the price on a short sale restricted stock.\n\nThis leveraged insider information as the catalyst for highly abusive market manipulation practices that drove the stock price down with zero transparency, for over two weeks. The resulting media campaigns reported only publicly available information which created the perception that short positions on GME had been closed, which stands as evidence of this material non-public information, which the short sellers manipulating GME by proxy were acting on.\n\n&#x200B;\n\n* **Rule 105 of Regulation M:**  Rule 105 proscribes purchasing securities in a firm commitment underwritten offering of public equity if one has made a short sale of such security during a restricted period (regardless of whether the firm has an economic long position), which is generally defined as five business days prior to the pricing of the offering. A short sale is defined as “any sale of a security which the seller does not own or any sale which is consummated by the delivery of a security borrowed by, or for the account of, the seller.\n\nPretty self explanatory. The SEC was busting a lot of people for covering shorts in bundled public offerings in 2013. As I understand it, the date of contract would be the price date, and any short position in any of the bundled offerings within 5 days prior to that date is a violation of Rule 105.\n\n&#x200B;\n\n* **Rule 10b-21:** specifies that it is unlawful for any person to submit an order to sell a security if that person deceives a broker-dealer, participant of a registered clearing agency, or purchaser regarding his/her intention, or ability, to deliver the security by settlement date and that person fails to deliver the security by settlement date. Among other things, Rule 10b-21 targets short sellers who deceive broker-dealers about their source of borrowable shares for purposes of complying with the \"locate\" requirement of Rule 203(b)(1) of Regulation SHO. Rule 10b-21 also applies to sellers who misrepresent to their broker-dealers that they own the shares being sold.\n\nThe 2 million FTDs on XRT on 1/29 are direct evidence of this violation. When the short sellers moved to the ETF, they did so with the intent to continue the practice of producing FTDs, which is evidenced by the increased volume of FTDs after the move.\n\n&#x200B;\n\n* **Rule 203(b)(1) of Regulation SHO**:  Rule 203(b) creates a uniform Commission rule requiring a broker-dealer, prior to effecting a short sale in any equity security, to \"locate\" securities available for borrowing. For covered securities, Rule 203 supplants current overlapping SRO rules. Specifically, the rule prohibits a broker-dealer from accepting a short sale order in any equity security from another person, or effecting a short sale order for the broker-dealer's own account unless the broker-dealer has (1) borrowed the security, or entered into an arrangement to borrow the security, or (2) has reasonable grounds to believe that the security can be borrowed so that it can be delivered on the date delivery is due.\n\nShorting GME while it was on the threshold list, the hard to borrow list, and then continuing to produce FTDs indicates a total failure to comply with this regulation. For the entire duration of the event.\n\n&#x200B;\n\n* **Regulation SHO rule 203 (iv)** If a participant of a registered clearing agency has a fail to deliver position at a registered clearing agency in a threshold security for thirteen consecutive settlement days, the participant and any broker or dealer for which it clears transactions, including any market maker that would otherwise be entitled to rely on the exception provided in paragraph (b)(2)(iii) of this section, may not accept a short sale order in the threshold security from another person, or effect a short sale in the threshold security for its own account, without borrowing the security or entering into a bona-fide arrangement to borrow the security, until the participant closes out the fail to deliver position by purchasing securities of like kind and quantity;\n\nThe closing of GME short positions through ETF redemptions was not legal, because they were not like kind securities. They were totally different and unalike securities that then had to be manipulated to become alike. Not the same thing. Illegal. That means every single short sale from the date of these illegally closed positions was ALSO illegal. There's like.. a hundred different ways at least in which this was so very highly illegal. \"Highly regulated market\" my ass.\n\n**Violations of Securities Laws during the GME event.**\n\nDue to the activity of lending customer shares DURING short sale restrictions, all Brokerage Apps/Firms/Dealers that lent customer shares during the short restrictions were in violation of\n\n* **Security Exchange Act of 1934 SEC. 8**. **It shall be unlawful for any registered broker or dealer**, member of a national securities exchange, or broker or dealer who transacts a business in securities through the medium of any member of a national securities exchange, **directly or indirectly—**  (b) **To lend or arrange for the lending of any securities carried for the account of any customer** without the written consent of such customer or **in contravention of such rules and regulations as the Commission shall prescribe for the protection of investors.**\n\n&#x200B;\n\n&#x200B;\n\n¯¯¯¯¯¯¯¯¯¯¯¯¯\n\nDetail\n\n¯¯¯¯¯¯¯¯¯¯¯¯¯\n\n&#x200B;\n\n# Rule 10b-5 of the Exchange Act:\n\n**§ 240.10b-5 Employment of manipulative and deceptive devices.**\n\nIt shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce, or of the mails or of any facility of any national securities exchange,\n\n**(a) To employ any device, scheme, or artifice to defraud,**\n\n**(b) To make any untrue statement of a** **material** **fact or to omit to state a** **material** **fact necessary in order to make the statements made, in the light of the circumstances under which they were made, not misleading, or**\n\n**(c) To engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person, in connection with the purchase or sale of any** **security**\\*\\*.\\*\\*\n\n&#x200B;\n\n***Breakdown:*** The action of hiding short positions during a short squeeze, with new positions in ETFs acquired through means in direct and demonstrable violation of multiple regulations, and acting in direct conflict with short sale restrictions, is stand alone proof of abusive market manipulation tactics being employed. This proves intentional violation of section a.\n\nThe hedgies and market makers moving in unison to cover shorted positions through ETFs during short sale restrictions on GME, in the middle of a squeeze, without prior reporting of the intention to do so was an illegal move on it's own, but it also served to hide their short positions from the public. The act of hiding information highly pertinent to the current state of the market created material nonpublic information. This proves violation of section b.\n\nThe public did not know where the shorts went, the repositioning would not be disclosed to the public for weeks, and the alliance of shorters continued to operate trades intended to defraud the GME stock on the basis of material nonpublic information. They knew where their positions were, and where the whole alliance put their positions, and knew that they would all continue to operate in the same manner as they had been doing on the main ticker. All of these subsequent trades on ETFs that effected GME prices were illegal market manipulation through deceptive devices, AND operating on material nonpublic information. This proves intentional violation of section c.\n\n===\n\n# Rule 10b5-1 of the Exchange Act:\n\n**§ 240.10b5-1 Trading “on the basis of”** **material** **nonpublic information in insider trading cases.**\n\nThis provision **defines when a purchase or sale constitutes trading “on the basis of”** **material** **nonpublic information in insider trading case**s brought under Section 10(b) of the Act and Rule 10b-5 thereunder. The law of insider trading is otherwise defined by judicial opinions construing Rule 10b-5, and Rule 10b5-1 does not modify the scope of insider trading law in any other respect.\n\n**(a)** ***General.*** The “**manipulative and deceptive devices” prohibited by** **Section** **10(b)** of the Act (15 U.S.C. 78j) and § 240.10b-5 thereunder **include**, among other things, **the purchase or sale of a** **security** **of any** **issuer**\\*\\*, on the basis of\\*\\* **material** **nonpublic information about that** **security** **or** **issuer**, **in breach of a duty of trust or confidence** that is owed directly, indirectly, or derivatively, to the issuer of that security or the shareholders of that issuer, or **to any other person who is the source of the** **material** **nonpublic information.**\n\n&#x200B;\n\n***Breakdown:*** This is how insider trading is defined by the Exchange Act.\n\nPeople who have created a market influencing matter to which there is a substantial likelihood that a reasonable investor would attach importance in determining whether to buy or sell the securities registered are NOT allowed to buy or sell the stock. The decision to circumvent short sale restrictions through ETF manipulation of GME made them the source of the material nonpublic information.\n\nThe movement of short positions in high volume to ETFs during a short sale restriction on the stock, with demonstrable intent to continue shorting (and producing FTDs) as evidenced in the record of transactions for $XRT during the short sale restriction, was illegal on several counts, and therefore an unreasonable to expect event that created material nonpublic information of two kinds.\n\nThe first NPMI produced by this move was the location of these hidden shorted positions still opened by proxy on GME, yet no longer available to the public in the data provided on the stock. It was not legal for these positions to move to a proxy within this timeframe. The FTD data, only produced twice a month, was the only way to confirm for the public that the GME shorters had circumvented restrictions using illegal creative market practices. We had to see the trail of extremely high FTDs they leave as debris in the wake of their fraudulent practices to confirm where they had moved.\n\nMedia reports that the shorters had closed their positions on GME stand as evidence of this fraudulent insider trading.\n\nThe second NPMI was the anticipated behavior of shorting and producing FTDs to continue depressing the price of GME.\n\nThe shorters moved together illegally and could reasonably expect their abusive practices manipulating GME to continue, since they had found a proxy that did not restrict their short selling of GME, despite restrictions being in place.\n\nNot only are they guilty of insider trading, they are guilty of utilizing insider information to manipulate stock prices without the public being able to confirm the suspected abuse for two weeks. This is grotesque.\n\n===\n\n# Regulation M section 105:\n\n**17 CFR § 242.105 - Short selling in connection with a public offering.**\n\n**(a)** ***Unlawful activity.*** In connection with an offering of equity securities for cash pursuant to a registration statement or a notification on Form 1-A (§ 239.90 of this chapter) or Form 1-E (§ 239.200 of this chapter) filed under the Securities Act of 1933 (“offered securities”), it shall be unlawful for any person to sell short (as defined in § 242.200(a)) the security that is the subject of the offering and purchase the offered securities from an underwriter or broker or dealer participating in the offering if such short sale was effected during the period (“Rule 105 restricted period”) that is the shorter of the period:\n\n**(1)** Beginning five business days before the pricing of the offered securities and ending with such pricing; or\n\n**(2)** Beginning with the initial filing of such registration statement or notification on Form 1-A or Form 1-E and ending with the pricing.\n\n&#x200B;\n\n***Breakdown:*** When the high volume of short positions from GME experienced short sale restrictions, they renewed their short positions through the acquisition of short positions in bundled public offerings containing their previously shorted underlying stock within a restricted period of less than 5 days from the price offering. The act of acquiring positions in a bundled public offering containing a security shorted within 5 days prior to the offer price is illegal.\n\nThe time frame of moved positions was THE SAME DAY they triggered short sale restrictions, on 1/27/2020, through abusive practices. This is evidenced in the large reduction of FTDs generated on the GME ticker after 1/29 and the drastic increase in FTDs reported on XRT for the same day.\n\n&#x200B;\n\n\\-------\n\n\\-------\n\n\\-------\n\n# TL;DR-\n\nHigh volume FTDs resulting from short sales and excessive short percentages prior to January indicate long term illegal shorting practices of $GME shares with intent to drop the stock price.\n\nFrequent and repetitive trade activity nearly identical in volume and time with progressively reduced prices for the exchanges and without correlating short volume increases indicate collusion between high volume short position holders to reciprocally exchange their borrowed stock at lower prices routinely. These trade records supply large quantities of evidence of illegal short down laddering.\n\nWhen GME activity triggered short sale restrictions, high volumes of open short positions on GME illegally repositioned to ETFs that contained GME, with the most obvious example being XRT. This created nonpublic material information for GME in the form of the relocated short positions and trading practice expectations that only insiders were privy to.\n\nMedia reports reflect this lack of public visibility with their reports of closed short positions on GME. Behavior that is now apparent in retrospect as continued abusive short sale practices are now visible as the responsible factor behind driving down GME share value since the day of trade restrictions on 1/27. Prior to the FTD reports this reduction in $GME value was being misconstrued as loss of public interest and the sale of shares due to publicly invisible, fraudulent, insider trade based market manipulation.\n\nThis means all short selling trade activity inside the ETFs by GME shorters were acting on NPMI, while evading short sale restrictions. It also means that they had opened ETF positions with intended failure to deliver as evidenced by the high volume of FTDs reported directly after the move, and that these ETF positions were within a restricted period involving a security they had shorted less than 5 days prior to the ETF price offerings.\n\nThe lending of customer shares of GME by brokerage apps and firms during short sale restrictions is action directly in conflict with the regulations applied to short selling in order to protect investors. This activity was also demonstrably illegal, regardless of waivers or consents previously signed or agreed to in terms of service agreements. Under no circumstance whatsoever should they have been lending or preparing to lend customer held GME during GME short sale restriction.\n\nEvery single thing mentioned here is illegal. Everything. I'm sure it's not even the half of it, but it's a fair start. The short sellers are fucking crooks to the core.\n\n===\n\n# MEANWHILE...\n\nu/DeepFuckingValue is about to go up in front of congress, and I can predict for you right now that someone will try to accuse him of market manipulation. I looked at an absolutely terribly formed Class Action Suit against DFV on the same premise.\n\nI am happy to report that due to publicly posted evidence of long term purchases long prior to the viral social media explosion of GME, DFV is exempt from market manipulation accusations because he has published evidence that meets the requirements issued in 10b-5(1) (c) (A) (1)-- He has receipts posted online that go back long before the stock went viral. Just for proof, here's the citation.\n\nRule 10b-5(1) of the Exchanges Act:\n\n**(c)** ***Affirmative defenses.*** (1)(i) Subject to paragraph (c)(1)(ii) of this section, a person's purchase or sale is not “on the basis of” material nonpublic information if the person making the purchase or sale demonstrates that:\n\n**(A)** Before becoming aware of the information, the person had:\n\n***(1)*** Entered into a binding contract to purchase or sell the security,\n\n**(ii)** Paragraph (c)(1)(i) of this section is applicable only when the contract, instruction, or plan to purchase or sell securities was given or entered into in good faith and not as part of a plan or scheme to evade the prohibitions of this section.\n\n&#x200B;\n\nThe NonPublic Material Information in these cases will always be some variation of \"meme stonk\" or \"viral media campaign.\" The fact is, no one can control or predict what goes viral on social media platforms. They just do. You can hope, you can dream, in DFV's case you can legend, but you can't control it. Even on the false premise that you could, DFV is exempt from the manipulation accusations because his positions predate the viral explosion that resulted in actual trading of the stock.\n\nThat's all they've got on him, and they don't even have that.\n\n&#x200B;\n\nGodspeed, DFV, knight of the meme stonk, Harambe of all diamond handed apes. God speed.\n\n===\n\n&#x200B;\n\nThis compilation of laws and regulations with implied evidence of violation and non-compliance is by no means comprehensive. None of the summaries, descriptions, citations, or events alluded to in this post should be construed as legal, political, or financial advice. This is just a few hours of research compiled for informational purposes only.\n\n&#x200B;\n\nThe TL;DR is way too TL;DR-\n\nThey fucked up. DFV did no wrong. Here's some receipts. It's really bad, I just dun want them to take his tendies.",
    "title": "Compilation of obvious violations by Hedge Funds and Market Makers during GME event.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/llswj6/compilation_of_obvious_violations_by_hedge_funds/"
}