{
    "author": "Thelonepotatoes",
    "created_utc": 1616916187.0,
    "distinguished": null,
    "edited": 1617656543.0,
    "id": "mewopn",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mewopn",
    "num_comments": 208,
    "permalink": "/r/GME/comments/mewopn/anne_dias_griffin_the_silent_tiger_cub_of_the/",
    "score": 1067,
    "selftext": "Edit: if anyone is reading this join S U P E R S T O N K\n\n**I WOULD LIKE TO EXPAND THAT ANNE AND ALL OF THE TIGER FAMILY ARE IN THIS and by Relation Elon**\n\nCombined fire power of 115B AUM.\n\nBUT WAIT theres more\n\n**Elon has some relation to this indirectly to Sam Wyly aka the seeder of Maverick Capital. Elons brother Kimbal married Sam Wylys Daughter**\n\nhttps://dallas.culturemap.com/news/restaurants-bars/04-09-18-cedar-social-wedding-reception-kimbal-musk-christiana-wyly/\n\nHear me out I went down a rabbit hole I shouldn’t have because its 3AM with nothing better to do.\n\nHere comes the Tiger Warriors; \n\nhttps://iinvest.ps/iinvest/index.php/2019/12/16/billionaire-julian-robertsons-tiger-network-spans-hundreds-of-funds-business-insider/\n\nThese are the noted cubs (https://imgur.com/a/uyVgRVm)\n\nFun visual web (\nhttps://www.google.com/amp/s/www.businessofbusiness.com/amp/articles/tiger-den/)\n\nOur boi Shkreli may not be one of the super cubs, but he is also one of the seedlings and guess who the fuck else is, thats right ANNE. Mother. FUCKING. Dias. (https://imgur.com/a/Ge4oSsc)\n\nThats right Kens EX Fucking WIFE. \n\n———\n\nWe have seen recent post of Bill Hwang. Not all cubs are equal or good but most seem to abide by good rules of finance and win!\n\nBad Cub (https://finance.yahoo.com/news/exclusive-tiger-cub-archegos-liquidation-015109185.html)\n\nGood Cub (https://www.institutionalinvestor.com/article/b1qx3m96ts35s3/How-Chase-Coleman-Became-a-Hedge-Fund-Legend)\n\nBill one of the bad Tiger Cubs got margin called by Goldman Sachs. \n\nNow we know another Tiger Cub sits inside GME. \n\nLee Ainslie aka founder of Maverick Capital with 4.5m shares. WHO fun fact ELONs brother Kimbal is the step son to Sam Wyly who seeded Maverick Capital and his step bro Evan helps run.\n\nhttps://www.institutionalinvestor.com/article/b150qg3n17jbys/hedge-fund-managers-top-tabloid-headlines\n\nhttps://imgur.com/a/CGAL7TD\n\nSam Wyly himself just settled with the IRS and maybe coming back with the help of maverick or on his own. This is getting spicy.\n\nhttps://www.forbes.com/sites/laurendebter/2019/11/19/ex-billionaire-sam-wyly-settles-irs-tax-bill-exits-bankruptcy/\n\nNow we know Maverick Cap is one of the longs inside GME. Now you might be asking how the fuck does Anne Dias ~~Griffin~~ fit into all of this? \n\n———\n\nWell again she too is a tiger cub and currently runs Aragon Global Management in a home office. Its currently in a closed to outside money position after she divorced Ken and possibly has been silently brooding revenge. \n\nIn 2019 she hinted at the possibility of opening it up. \n\nhttps://dealbreaker.com/2019/05/anne-dias-hedge-fund\n\nGuess who would like to sponsor Ms. Dias thats right HELLO Goldman Sachs her former bosses.\n\nGranted this is from 2019 (https://imgur.com/a/cnLIWWm)\n\nNow its been 2 years with not much movement.\n\nThe last public filings from Aragon Global Management some 13Fs from 2010.\n\n———\n\nNow why would she be a player? Well who knows Ken best besides his ex wife at a psychological level. Tin foil here but what if Bill got shafted because he was ruining the tiger name, also to be replaced by Anne could exact some sweet revenge on Ken and make some money for Goldman on the side by either knowledge or mental warfare.\n\nReason also for possible personal motive (_Yes i know daily mail is Shiiiite but Ken really is an ass hole ive been to boca_)\n\n(https://www.dailymail.co.uk/news/article-2920187/Hedge-fund-billionaire-divorce-gets-nasty-husband-bans-wife-marital-homes-refuses-commit-financial-support-insists-good-girl-money.html)\n\nThe Tiger Management reach goes pretty fucking far and this seems like a return play from the cubs that weren’t happy in 2018 from the shorting and shenanigans.\n\nGuess who might have been the root of that? Thats right the shorts like citadel and friends. WHICH WOULD give reason for tiger management to maybe shadow play with maverick and friends. \n\nhttps://www.cnbc.com/2018/05/16/hedge-fund-tiger-sends-letter-to-gamestop-urging-retailer-to-adopt-a-turnaround-plan.html\n\n———\n\nThey in theory could hide behind the less than 5% ownership and not report if they rejoined the fun. Both Tiger Management, Aragon, Viking etc. \n\nThey could easily coordinate a 14% attack if they really wanted to play. \n\nThe article below mentions this (https://imgur.com/a/q0UlUzE) they trade in groups below 13f. So this theory is become a little more valid\n\nhttps://www.institutionalinvestor.com/article/b1kbrryv2kyw84/Hedge-Fund-Cubs-Share-Information-And-Alpha\n\n———\n\nThis is getting 13f chess plays right now. Someone take my tin foil hate away im having too much fun. \n\nSomeone tell me this movie isnt going to be amazing if true.\n\nAdditional mentions is that she worked for Soros for a little bit and guess what he crashed the Bank of England. So maybe she can crash Kens parade. Not only that she worked for Goldman as well.\n\nhttps://imgur.com/a/Tex6QLF\n\n———\n\n**Tl;dr**\n\n**All the tigers may also be on our side in addition to the King Kong longs, institution and ryan. Anne aka Kens wife has experience in many things including fucking with Kens brain. What else can she help the tigers fuck with? Kens party. This is some expanse/GoT king maker type deal.**\n\n**Additionally Elon is in but not in. Elons brothers step father father seeded Maverick Capital and his step bro Evan Wyly is currently onboard**\n\nOther than that **HODL AND BUY** not financial advice\n\n———\n\nEdit:\n\nHOLY FUCK THIS WEB IS YUGEEEE\n\nhttps://www.businessofbusiness.com/articles/tiger-den/\n\nTIME TO DIG INTO THE DEN\n\n———\n\nEdit2:\n\nWhy Anne would like payback\n\nhttps://www.dailymail.co.uk/news/article-2920187/Hedge-fund-billionaire-divorce-gets-nasty-husband-bans-wife-marital-homes-refuses-commit-financial-support-insists-good-girl-money.html\n\n———\n\nEdit3:\n\nI JUST REALIZED I MISSED A BIGGER PICTURE Tiger Management was invested in 2018 and left because management was ass but one of their little cubs returned.\n\nThey in theory could hide behind the less than 5% ownership and not report. Both Tiger Management and Aragon, Viking and so on. \n\n———\n\nEdit4: Fixed all the amp stuff since im awake now\n\n———\n\nEdit5: Anne also worked for other cubs such as viking, goldman sachs, GEORGE MOTHER FUCKING SOROS and that man took down THE BANK OF ENGLAND. \n\n———\n\nEdit6: Fix formatting please discuss this tinfoil theory so i can come closer to monday.\n\n———\n\nEdit7: Tigers 🐅 move in groups\n\nhttps://www.institutionalinvestor.com/article/b1kbrryv2kyw84/Hedge-Fund-Cubs-Share-Information-And-Alpha\n\n———\n\nEdit8: THANKS FOR ALL THE AWARDS GO BUY GME and HODL also DFV if you’re here please HODL me\n\n———\n\nEdit9: THE PLOT THICKENS\n\nSam Wyly SEEDED MAVERICK CAPITAL and has been freed from the IRS and his Daughter recently Married Elons Brother Kimbal.\n\nhttps://dallas.culturemap.com/news/restaurants-bars/04-09-18-cedar-social-wedding-reception-kimbal-musk-christiana-wyly/\n\nhttps://www.institutionalinvestor.com/article/b150qg3n17jbys/hedge-fund-managers-top-tabloid-headlines\n\nhttps://imgur.com/a/CGAL7TD\n\nhttps://www.forbes.com/sites/laurendebter/2019/11/19/ex-billionaire-sam-wyly-settles-irs-tax-bill-exits-bankruptcy/",
    "title": "Anne Dias Griffin the Silent Tiger Cub of the Tiger Management coming for revenge (Tin Foil Hat of Fun)",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mewopn/anne_dias_griffin_the_silent_tiger_cub_of_the/"
}