{
    "author": "AnkridStone",
    "created_utc": 1616960414.0,
    "distinguished": null,
    "edited": 1617323735.0,
    "id": "mf87d7",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mf87d7",
    "num_comments": 87,
    "permalink": "/r/GME/comments/mf87d7/are_the_long_whales_about_to_feed_on_the_shorts/",
    "score": 773,
    "selftext": "**This is not financial advice. These are the ramblings of a man who has spent too much time on Reddit reading too much tinfoil hat, batshit crazy stuff and not enough time sleeping.**\n\n*Consider this infotainment at it's least informative. Do not pin any hopes on this being true any more than you would a documentary about Bigfoot or aliens.*\n\n**EDIT 4 - It is pretty well established now that Archegos was behind the block trades and so the first post of this post had been debunked. I still think that the work that Purple Amy did was great - she didn't just mindlessly swallow the media reports from anonymous sources and looked at actual filings to see who actually had positions that could support the block trades. The problem with this approach was that Archegos had exposure to the shares through \"swaps\", which could never have been identified no matter how much digging was done through filings.**\n\nFriday saw some very interesting action that I suspect may tie back to GME. \n\nTo be clear, this is pure speculation, and I am standing on the shoulders of a giant, u/xpurplexamyx, and some others.\n\nSo, maybe you've seen the news that Archegos Capital Management, a family office, got margin called on Friday causing a number of tickers including Viacom and The Discovery Channel to suffer huge losses.\n\nThe only problem I have with that news is that it was reported by CNBC, and every other news outlet is just repeating the same rumour. \n\nThe shares were sold via a block trade, which is a large offering of shares off-exchange so as not to affect the stock price so badly. But these offerings are visible and so can affect market confidence if there's a big sell off.\n\nThe thing about a block trade is that you see who manages it and how many shares are being offered but not who is selling the shares.\n\nNow, fortunately for us we have Purple x Amy x, who did the digging and created this post:\n\nhttps://www.reddit.com/r/GME/comments/mewwrp/i_think_it_was_blackrockvanguard_that_liquidated/?utm_medium=android_app&utm_source=share\n\nFirst, (s)he noticed that the block trades weren't just Viacom and Discovery, but several other tickers. (S)he also noted that between them, Blackrock and Vanguard hold enough shares of each ticker to fulfil the block. In some cases only Vanguard had enough, and in one only Blackrock, but in other instances big entities *could* have been behind them.\n\nThe combined value as calculated in the post is around $10 billion. \n\nThat's a lot for a family office with little known about it. \n\nThe thing is, with so many on one day with a single combined common owner, how likely is it that it's others? It's possible, but I'd suggest further down the probability scale.\n\nNow, as Purple Amy points out, Blackrock and Vanguard are both significant owners of GME stock.\n\nFor the full story I highly recommend you read the post. It gives some history between Blackrock, Citadel and Ryan Cohen. \n\nIn short, Purple Amy thinks Blackrock and Vanguard could be loading cash into a war chest ready for battle. \n\nWhat is touched on, but almost glossed over, is that Citadel was also a significant owner of the same stocks sold. I say glossed over because I think if it is these guys who were selling to fund a GME war chest then dropping the price of securities that Citadel hold long would do extra damage.\n\nI learned a short while ago that it isn't necessary to have cash on margin for a short position, but rather other securities held long can be used. This allows short sellers to keep shorting without needing to find extra cash to support their positions. Kinda makes sense how they've managed to keep shorting since January without raising more funds or liquidating assets. \n\nIf the value of Citadel's securities drop then they will need to find additional margin for their short positions, also known as a margin call. \n\nWhat's one of the things that can trigger a squeeze? That's right, a margin call... \n\nSomething else happened Friday too, and Purple Amy wrote a post about that too:\n\nhttps://www.reddit.com/r/GME/comments/mcfj1u/aapl_tracked_gmes_plummet_this_afternoon_and/?utm_medium=android_app&utm_source=share\n\nYep, AAPL took a dive too, though not as extreme. \n\nNow these weren't block trades, so what gives? Why am I drawing a comparison? \n\nWell, think of someone who is widely reported to own only two stocks. I'll give you a clue, if AAPL is one the other one is GME. He was also reported to be investing in Wells Fargo, but I can't find anything to say that is still the case.\n\nWhen this rocket goes up, who will have been the person most credited for setting it off and, very unjustly, the one who stood to gain the least from a squeeze?\n\nWhy, none other than Ryan Cohen himself.\n\nHe became a member of the board in January, the event widely believed to have been the catalyst for the lift off back then, but as a member of the board he would have been prevented from selling any shares because of his insider knowledge. So he would have been bag holding 9,001,000 shares after the shorts were forced to cover. \n\nHow come anyone with a few hundred thousand shares gets to become a billionaire and yet he can't realise the full potential of his investment and actions? Doesn't seem fair to me. \n\nAs many have noticed, the 10-k that came out on Tuesday contained some additional information that didn't necessarily need to be there.\n\nNow, let me temper expectations and say that one of the people I revere most on this sub has pointed out that the text used was largely a copy and paste from other 10-k filings and that there have been increasing  numbers of reports citing the dangers of over-extended short positions, so my theory may not hold here.\n\nBut if a company insider holds no material nonpublic information then they are allowed to file with a broker an instruction to sell stock at on a predetermined day or on any day when it reaches a predetermined price.\n\nDoes anyone remember how the CEO of Pfizer sold over $5 million in shares when the news broke that they had a successful vaccine? Prefectly legit.\n\nSo maybe the GameStop board decided to make as much material information public as possible so that they can sell their stock during the squeeze. Most of them are leaving in June anyways so why not sell at the peak? \n\nNow Ryan Cohen wouldn't want to give up too much stock, especially as I believe he has a plan for the company and wants to see it work. He's restricted to only buying 19.9% of the stock because of the agreement he came to with the board in January.\n\nThat agreement contains no restrictions on him selling any stock. \n\nSo he is allowed to buy more, its just that it won't cost him $74 million like it did last time. The stock is way more expensive and may mean he needs to liquidate some assets. But he only owns two, GME and AAPL...\n\nDo you see where I'm going with this?\n\nThe only thing I can't figure out is why the date of the earnings was moved up from Friday to Tuesday. Where's the urgency?\n\nMaybe this comment can shed some light:\n\nhttps://www.reddit.com/r/GME/comments/mewwrp/i_think_it_was_blackrockvanguard_that_liquidated/gslu3sc?utm_medium=android_app&utm_source=share&context=3\n\nApparently there's a change to leverage requirements coming on 1st April. I have no idea if that is relevant. Probsbly not as it appears to only apply to banks. \n\nMoving on... \n\nEveryone talks about a catalyst for the short squeeze, but a squeeze only happens in one circumstance - when there's a mad rush for the exit and it gets jammed. Whether it's because people are leaving freely or being thrown out is immaterial. \n\nWe've known for ages that the shorts are over extended, but they've been disciplined and held ranks not to move too quickly towards the exit. Did Citadel help Melvin with a few billion dollars to not get margin called back in January? Maybe. \n\nPeople have looked at the FTD squeeze DD written by u/gafgarian and I've often seen his estimate of the float being misquoted. He doesn't say that the available float is 29 million. What he says is the size of the float *available to short* was 29 million, and is now closer to 19 million since RC bought in. \n\nNow imagine if RC, Blackrock and Vanguard between them bought up even more of that available shortable float. Shares become hard to borrow, the price gets harder to keep down, margin requirements go up and suddenly the squeeze is on! \n\nThis is complete tinfoil hat shit, but I think there's a fair bit of correlation. The biggest thing for me is that the board knows that the squeeze can be squoze and I can't imagine one of them wants to watch from the sidelines as their shares go to the heavens and crash back down to earth. \n\n**TLDR - Are the big whales and RC liquidating their positions ready to crush the short sellers?**\n\n**EDIT 1** - thanks to u/VaisUIBestUI who has read this post and pointed out that he was part of a group on Twitch who noticed this in pretty much real time on Friday. \n\nPlease see their video, a link is contained in this comment. \n\nhttps://www.reddit.com/r/GME/comments/mf87d7/are_the_long_whales_about_to_feed_on_the_shorts/gsmg314?utm_medium=android_app&utm_source=share&context=3\n\nNow this looks much more like investigative journalism to me, where people notice weird shit and look for a logical explanation through fact finding, than the CNBC report!\n\n\n**EDIT 2** - thanks to u/redwingpanda who pointed out this post by u/Trickre1678 about the possible effect of the change in leverage requirements coming this week:\n\nhttps://www.reddit.com/r/GME/comments/mf5w2e/i_will_try_to_explain_why_hedge_funds_are_getting/?utm_medium=android_app&utm_source=share\n\n\nChanging tack, and bringing a healthy dose of reality to these proceedings, I received some insightful information from someone whose opinion I trust far more than my own. I would love to add it here but haven't been given permission, but I hope it gets added publicly so I can link to it. \n\nWhat I will say is more than just the CNBC source appears to have now materialised. The WSJ and FT have taken up the story and are pointing at Archegos, including reports that Archegos was obscuring their positions through swap agreements:\n\nhttps://www.wsj.com/articles/ex-tiger-asia-founder-triggers-30-billion-in-large-stocks-sales-11616973350?st=y0ef5bfw9ujuuxr&reflink=article_copyURL_share\n\nFrom the DM I received it appears that my post is probably way off the mark, and like I say, I trust that individual's opinion on these matters more than my own.\n\nPlease remember that I've framed this as infotainment, with more of an emphasis on the tainment element, in the realms of being as likely as the existence of Bigfoot or aliens.\n\nIt's nice to dream though...\n\n**EDIT 3 - Why did I write this post if I doubt the theory to be true – am I intentionally spreading misinformation or trying to get people’s hopes up?**\n\nNo, absolutely not.\n\nAnyone who has read my previous posts and comments will know that I am bullish on GME but very bearish on bullshit. So this outlandish theory seems at odds with my usual thinking.\n\nBut it is the term “usual thinking” that I am trying to push beyond. I don’t think I could be more clear that this post is way out there, but the information that underpins it *could be* perfectly valid.\n\nTake my thoughts on RC for example. The dude only filed back in August that he had become a major shareholder in the company, and only joined the board back in January. Since then his hands, and his 9,001,000 shares have been tied because of insider trading rules.\n\nLook carefully at the agreement that was signed back in January:\n\nhttps://www.sec.gov/Archives/edgar/data/0001822844/000119380521000031/e620202_ex99-1.htm\n\nThere are restrictions on how many shares RC can buy without the agreement of the board, but there are no restrictions on how many he can sell. The dude has piled $74million into buying his 9,001,000 shares so that he can exert his influence and improve the company. But why should he sit back and watch while others get to sell their positions for millions while he can't sell one?\n\nTake DFV for example. At only $740 per share his measley 100,000 shares (and I'm not even counting his options contracts) will be worth as much as Papa Cohen paid for a 13% stake of the company. Now, DFV saw the deep value of the company and fully deserves his tendies, but without RC one could reasonably argue that GameStop would not be in the position it is now regardless of how shorted the stock is.\n\nEven without buying more shares, at just $1,000 per share RC could offload a million shares to add a cool $1billion to his piggy bank and still keep a stake of over 11% of the company.\n\nSo what has changed? As of the filing of the 10-K, which includes pretty current information and a clear outline of the risk of volatility from a short squeeze, RC and the board can now claim that they know no material nonpublic information that would prevent them registering a limit sell order with a broker without falling foul of insider trading regulations.\n\nWhat do I mean?\n\nRemember the CEO of Pfizer, Albert Bourla, who sold $5.6million of shares the day the news broke of the early positive results of their vaccine trials? Bourla had filed a 10b5-1 trading plan in the August setting a limit sell on his shares. Once his price was triggered the sales were sold, without being in any way affected by any insider knowledge that Bourla would have undoubtedly gained in the meantime.\n\nSince the GameStop earnings report I believe that RC and the other board members *could have* been free to file their own 10b5-1 to sell wherever they reasonably believe the share price could go based on the publicly available information.\n\nAnyone familiar with the works of Edward De Bono will have heard of his “Six Thinking Hats” principle. This is a process where each of the participants in a group intentionally adopts a specific thinking style to work through a problem, switching hats at various points as they go through. It can also be used on an individual basis.\n\nThe red hat is the “gut instinct” hat, and my gut instinct is that RC wouldn’t want to sit out the squeeze. I then put on my white hat to look at the facts and information to see if he could legally participate and found that he could in certain circumstances, and have worn my blue hat while writing this post which looks at the bigger picture.\n\nAnother principle that De Bono identified is “Po”, which is a provocative operation. It is designed to challenge the conventional wisdom with an outlandish idea to see where it leads as a way of taking thinking forward.\n\nWith some of the discoveries made while looking at the GME saga it appears that the shorts have been using Po quite a bit – just look at the way ETFs appear to have been manipulated and the tactics being employed to hide FTDs.\n\nI would be stoked for any of the big brains to wade in and rip this theory apart. As I state above, one already has by way of a DM and I would love to add those thoughts publicly because it adds to the conversation and helps with understanding.\n\nWhat I would ask is that even though your gut may scream that I am wrong (I accept that I probably am), please spend a moment in that “red hat” phase to identify what exactly your instinct is telling you. Don’t over think, the red hat should only be worn for the briefest of time - just wear it long enough to identify what your gut is saying.\n\nThen try leaning into the idea and exploring it to see if there where it takes you before. Try leaning into my thoughts as well, even if you disagree with it, and let me know where your mind goes.\n\nI truly believe that there is no harm in challenging the existing narrative while you are operating in a safe thinking space as long as you remember to come back to facts and the bigger picture before making your mind up.",
    "title": "Are the Long Whales about to Feed on the Shorts, and do They Have a Secret MVP we've all Overlooked?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mf87d7/are_the_long_whales_about_to_feed_on_the_shorts/"
}