{
    "author": "Trickre1678",
    "created_utc": 1616953754.0,
    "distinguished": null,
    "edited": 1616983113.0,
    "id": "mf5w2e",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion",
    "name": "t3_mf5w2e",
    "num_comments": 66,
    "permalink": "/r/GME/comments/mf5w2e/i_will_try_to_explain_why_hedge_funds_are_getting/",
    "score": 1397,
    "selftext": "I’ll try to explain why I think investment firms and hedge funds are getting margin called and what this means after March 31st.\n\nI was asked to post this here as it got removed in another group. So here it is ✌️\n\n**DISCLAIMER: These are my opinions*** Take it however you want. My post struck some nerves in another group and they pressured the mods to delete it without my knowledge. My post was also deleted here, to be honest I’m not why it was or if I did it. So I am reposting this. So here we go. \n\nAlright, I’m going to try to explain what I think is going to happen after SLR (supplementary leverage ratio) comes into effect. It’s already beginning. So, big banks and hedge funds have been having the biggest bash of their lives because the fed got rid of the SLR for banks and treasuries. Simply put, this allowed banks to have much more liquidity and free flowing money. \n\nWhen this ends on the 31st, the big banks will be required to have north of 6%+ in asset protection for any losses incurred. All this means is that they are going to have to start being frugal with their money again. All this easy money flowing through all these huge firms this past year will basically be recalled by the big banks. Hence, the margin call and the sell of Viacom, etc. Goldman Sachs was also forced to sell off investors positions as well. They had to liquidate their positions because the banks are going to need to start collecting that free flowing money back to meet the SLR once again. \n\n**From what I read, this actually isn’t as bad as it sounds. A lot of articles pointed that it could just be a slow move from no SLR being enforced, to working its way back to SLR that existed before coronavirus hit (6+%) BUT, regardless- many, many firms and institutions that have been riding in this easy money will need to pay the piper. **\n\nWhat does this mean? Possibly large sell offs in blue chip stocks, huge losses for firms that shorted stocks where they will have to cover the shares back and then pay the piper. But I think the biggest thing is that interest rates, such as the borrow fee rates for shorting stocks could skyrocket upwards of 100% or more which will cause short squeezes across heavily shorted stocks. \n\nShorting is a risk with infinite downside and lenders will not be so keen to let these institutions and firms shorting stock with little risk to them. All I’m saying is there will be more risk for the clearing houses that they won’t want to afford risking, and they will cover this asses by raising the borrow fee rate. Hope that helps clarify things. \n\nSo if a borrow fee goes up to 50-100% + for any  stocks that are heavily shorted it will instantly cause them to cover their positions in turn causing gamma and short squeezes across the boards for many, many stocks. This could create a cascading ripple effect of firms covering shorts while pulling out of long positions to help. Why do I believe this? Because I believe stocks have been heavily shorted on the verge of abuse and investment firms that have taken too many cookies out of the jar are going to be backed into a corner. Let’s not forget the themes of wall st. Greed and money. \n\nLet’s also not forget new DTCC rules that went into effect already were clearing houses can literally margin call anyone and liquidate their positions if necessary. If anything that is good because it keeps them in check and the abuse down, but as for now I feel like it’s been the wolf west of shorting and market manipulation out there during this time with all this easy money floating around.\n\nTL,DR— Expect possible high market volatility starting April 1st.  So to sum up, selling off of institutional investments driving market prices down in some stocks. Potential covering of positions in shorted stocks causing potential gamma-short squeezes. This is due to banks having to infuse more capital for asset protection after the exemption ends March 31st. They wont be so lenient with their lending to investment firms and those with a huge margin will start have to paying the piper (banks) by pulling out of long positions and covering shorts. My opinion- All these shorts deserve to burn in hell and I hope they get their just deserves! Guess what \n\nPARTYS OVER FOR THE BIG BOYS, the banks are going to get their money back. \n\nREDDIT LINK TO SOME REALLY GREAT DD ON THIS: https://www.reddit.com/r/stocks/comments/lvax5x/trillions_to_be_added_to_slr_calculation_on/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nSome articles to ponder: \n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/exclusive-tiger-cub-archegos-liquidation-015109185\n\nhttps://www.institutionalinvestor.com/article/b1r550gj7lbfmt/The-Two-Tiger-Cubs-at-the-Center-of-Friday-s-35-Billion-Meltdown\n\nhttps://www.risk.net/risk-quantum/7734076/jp-morgan-calls-for-slr-relief-to-be-made-permanent\n\nhttps://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/jpmorgan-argues-for-extension-as-breather-on-capital-rule-nears-expiration-62304785\n\nhttps://www.forexlive.com/news/!/us-stocks-set-to-slide-with-10-year-yields-back-over-160-20210312\n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/news/3674412-bank-stocks-fall-after-federal-reserve-board-lets-slr-temporary-rule-expire\n\nhttps://www.commondreams.org/views/2019/11/07/run-dollar-due-panic-or-greed\n\nYou may say it’s all priced in, but I firmly believe it isn’t.\n\nFAQS I got in other groups answers-\n\n1. I know long positions will be covered, but I also believe that longs have already been pulling out of their positions to cover their short positions and will get backed into a corner.\n\n2. You say banks are already leveraged with SLR north of 6%- most banks meet their SLR but ONLY with the exemption in place, pull that exemption away and it falls 1-2 percentage points, so some (not all) are not even close to ready as discussed in the articles above.\n\n3. How does it affect the market directly? Well, chase bank has already said it will have to seriously figure out what to do in the articles above. As I said, not every bank is below SLR but quite a few are. By trying to infuse money back into the cushion, they may liquidate investors position that don’t have enough assets to cover their accounts. \n\n4. Why would hedge funds, investment firms not be prepared for this? Oh, give me a fucking break 😂 to say this with pure sarcasm- yeah right, the banks and investment firms would never over leverage their positions in the name of greed and profit taking, right? Wrong. This is wall st. the name of the game is rig the system For yourself to your advantage. \n\n5. What if the banks are already prepared? Maybe some are, but for sure some are not. They wouldn’t be pressing the fed to extend the exemption if they were “ready” and had been preparing. Just that alone tells you what you need to know about how ready they are. I think they are hoping for breaks and recalculating SLR to a lower percentage. Either way, banks and lenders  are going to have to start calling their money back...\n\nThis may not be as crazy as it seems, right? Absolutely. Banks could slowly be allowed to ease into it, but if the fed doubles down and is strict about them meeting SLR it’s going to be a brace for impact thing in the market. \n\n\nDisclaimer: let’s not forget about how much power these institutions wield. Although I think we will see tons of bumpy rides ahead, nobody truly knows what’s going to happen. This is just my opinion, but it’s really dependent on how quickly banks can get SLR requirements back up. Take it with a grain of salt.\n\n*I am not above nor below anyone here and I was just trying to explain my take on it after researching this for weeks. I have absolutely no respect for people that degrade and insult others because they think they have a higher sense of superiority. If you don’t like mine or other commenters opinions, keep scrolling. It’s that simple.*",
    "title": "I will try to explain why hedge funds are getting margin called and why this may be just the beginning.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mf5w2e/i_will_try_to_explain_why_hedge_funds_are_getting/"
}