{
    "author": "Leenixus",
    "created_utc": 1626568733.0,
    "distinguished": null,
    "edited": false,
    "id": "omg8fm",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_omg8fm",
    "num_comments": 33,
    "permalink": "/r/Superstonk/comments/omg8fm/unverified_xrt_married_puts_visualized/",
    "score": 908,
    "selftext": "I decided to check XRT and IWM for married puts before the reconstitution and rebalance.\n\nI found a bunch of what look like Married puts and decided to visualize them for apes so you can all see what married puts look like.\n\n&#x200B;\n\n**---Warning---**\n\nI cant verify that these are really married puts as defined by the more option savvy wrinkle brains here. This is why i'm posting this as possible DD.\n\nIt would go a long way to know 100% whether these are the married puts we're looking for or not. I'm extremely confused about whether the **Call** needs to be ITM or whether the **Put** needs to be ITM for this strategy.\n\nIn the examples below, i'm showing what look like married puts where in some the **Put** is ITM and in some, the **Call** is ITM. The point is, these are weird, but they look like what i think are Married Puts.\n\nAlso, i'm not sure whether married puts need to be done ON GME or whether you can also kick the can by using married puts on an ETF containing GME. Please let me know as i can't find this information.\n\n**---Warning---**\n\n&#x200B;\n\n\\-----------\n\n# The Married Puts Strategy\n\n[Explanation of what a Married Put is](https://www.theoptionsguide.com/married-put.aspx)\n\nMarried Puts are not illegal. They're a perfectly fine trading strategy. They do offer baddies a loophole for resetting the timer on an FTD.\n\nIf you know the basics of Option Trading, then Married Puts are simple to understand. If not, you're fucked and you need to understand options to get this.\n\n&#x200B;\n\n# What's a Married Put?\n\nA Married Put is when you buy a Call and a Put at the exact same strike and expiration date in the exact same moment in time. The PUT's strike must be IN THE MONEY e.g above the current stock price.\n\nHow do people create/open married puts?\n\n* People do this by making a Multi-Leg order which is an order that contains 2 trades to be executed at the same time.\n* They set the multi leg order to contain a \"Please buy me a Call at $100 strike and a Put at $100 strike both expiring on the same date\".\n* Don't forget, the\n* Once the order is submitted, both trades inside that single order are executed simultaneously thus creating a \"Married Put\".\n\nIt's a perfectly normal and legal way (although not popular) of hedging / buying insurance against near term volatility.\n\n&#x200B;\n\n# How do the baddies use them to kick the can?\n\nWell, as i said, you get a call and a put at the exact same strike, both expiring on the same date.\n\nTo reset your FTD's and thus kick the can down road, you would need to:\n\n* Buy yourself some married puts. (Same strike/expiring Call AND Put)\n* Exercise the (I think ITM) call to get your 100 synthetic shares per call option contract.\n* Use those 100 shares to close your current FTDs.\n* By closing your current FTD's using your 100 synthetic shares you got from your call exercise, you're creating a new batch of 100 shares that will become FTD's eventually.\n\nSo basically you've closed the old FTD's and opened an equal amount of new ones. The new ones have their FTD timer reset, so the hedgie needs to do this all over again in some amount of time in order to kick the can again. Repeat ad' infinitum.\n\n&#x200B;\n\n# Married Puts for XRT Summary\n\nHere's everything summarized:\n\n* 24 May, 1500 contracts, 150 000 shares worth, option premium cost $1.4 Million\n* 27 May, 2500 contracts, 250 000 shares worth, option premium cost $580k\n* 7 June, 3300 contracts, 330 000 shares worth, option premium cost $690k\n* 29 June 1000 contracts, 100 000 shares worth, option premium cost $730k\n* 13 July 5000 contracts, 500 000 shares worth, option premium cost $4.9 Million\n\nTotal Cost: $6.9 Million (Nice)\n\nTotal Contracts: 13300\n\nTotal Shares: 1,300,000\n\nTotal GME Shares: XRT was/is 3.4% weighted (Please check online to verify), so it's a meager 44 200 GME shares. Womp Womp Womp.\n\n&#x200B;\n\n**XRT - 24 May Married Puts**\n\nhttps://preview.redd.it/lnw31r4s8vb71.png?width=2727&format=png&auto=webp&s=db25f5762ce3caa214c6b06f499901756c40ebfb\n\n&#x200B;\n\n**XRT - 27 May Married Puts**\n\n[OTM CALL, ITM PUT](https://preview.redd.it/je8y812v9vb71.png?width=2763&format=png&auto=webp&s=94722c3bd84af0fb2d1ef162d778626d277b7681)\n\n&#x200B;\n\n&#x200B;\n\n**XRT - 7 June Married Puts**\n\n[1\\) ATM CALL & PUT, 2\\) OTM CALL, ITM PUT](https://preview.redd.it/1y40se4t8vb71.png?width=2753&format=png&auto=webp&s=6d9e5e9394d70ae0fbda1fa83bada283a7f29296)\n\n&#x200B;\n\n**XRT - 29 June Married Puts**\n\n[ATM CALL & PUT](https://preview.redd.it/i1xe09w9avb71.png?width=2769&format=png&auto=webp&s=69c6a82a1366845ff3b462a8b26bad10d92f2d3d)\n\n&#x200B;\n\n**XRT - 13 July (Yes This Week) Married Puts**\n\n[OTM CALL, ITM PUT](https://preview.redd.it/k00p19kw8vb71.png?width=2773&format=png&auto=webp&s=d9075063dbd3a61eccd7f33a8307cbbf1a1829ab)\n\n&#x200B;\n\nI don't know if you can even use the Married Put option strategy on an ETF containing the underlying security to clear your past FTDs whilst simultaneously creating new ones e.g. resetting the clock and kicking the can.\n\nThis is a matter for someone who understand this shit better than me.\n\n&#x200B;\n\n# Married Puts for IWM (Russel 2000)\n\nAlso IWM (Russel 2000) has a metric FUCKLOAD of married puts EVERY DAY. That one will take me a Looooooong time to map out and make a post about so...\n\n**IF ETFs can be used to kick the can, please let me know and i'll map out  all IWM Married Puts.**\n\n**Again, there's A LOT in IWM. A metric boatload.**\n\n&#x200B;\n\n# Married Puts in Other Indexes\n\nAll the other shitty indexes like IWC, IWB, IWF, IJR e.g the Russel 1000 and other microcap indexes don't have married puts for the May 5 - July 15 period. Also GME only had married puts back in late May as i remember because i made a post about it, but that was all since then.\n\n&#x200B;\n\nu/buttfarm69 Can i still do this?",
    "title": "Unverified - XRT Married Puts - Visualized",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/omg8fm/unverified_xrt_married_puts_visualized/"
}