{
    "author": "Schwaggaccino",
    "created_utc": 1616183068.0,
    "distinguished": null,
    "edited": 1616183592.0,
    "id": "m8pbkv",
    "text_only": true,
    "flair_id": "9fbcfdc2-6e37-11eb-85cc-0e08408b7fc7",
    "flair_text": "💎🙌",
    "name": "t3_m8pbkv",
    "num_comments": 451,
    "permalink": "/r/GME/comments/m8pbkv/reminder_hey_all_you_hedgie_shills_or_citadel/",
    "score": 8231,
    "selftext": "[No I'm not making it up. 10-30% of the bounty collected by the SEC can be yours.](https://www.sec.gov/whistleblower) The amount of money that we are dealing with here is in the BILLIONS. TENS BILLIONS OF DOLLARS. Maybe even HUNDREDS of billions of dollars. What's 10-30% of 100 billion dollars? Do the math. You would be set for life. You'd never have to work again. Your family would be well protected. Millions of people around the world would LOVE AND WORSHIP you. This sub would line up and let you fuck their wives while they watched it and cheered you on. You would come out richer and more successful than any of us. INSTANT CELEBRITY STATUS. Top 100 richest of all time. \n\n[Here's a quick link to a guy who got awarded $114 million dollars last year.](https://www.sec.gov/news/press-release/2020-266) What do you think he's doing right now? Is he fucking his supermodel wife? Is he racing his 1 of 10 Lambos? Is he chilling on his yacht waking up at 2 in the afternoon? Or is he out exploring the world on his private jet? Who knows? You could be that guy.  \n\nBUT this offer has an expiration date if you don't act now. All you have to do is get some proof and get it into the hands of the SEC before they discover it themselves. If you wait too long, you won't get the rewards. And let's be honest, you'd probably have to find a new job and/or face potential lawsuits from the way things are looking right now. Remember there are no loyalties on Wall St. SEC might be corrupt BUT we are dealing with a lot of money here. They'd love to get some of that money more than they would to protect their friends. There is no loyalty on Wall St when it comes to money.\n\n#Do the right thing. Cash out before any one of us you fucking legend.\n\nEDIT: Don't believe me? Read the comments below. How much would you guys love the Citadel whistleblower?",
    "title": "REMINDER: Hey all you hedgie shills or Citadel employees! You can collect from 10-30% of whistleblower bounties per SEC's dot gov website.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m8pbkv/reminder_hey_all_you_hedgie_shills_or_citadel/"
}