{
    "author": "taliskergunn",
    "created_utc": 1625869995.0,
    "distinguished": null,
    "edited": false,
    "id": "oh6byg",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oh6byg",
    "num_comments": 80,
    "permalink": "/r/Superstonk/comments/oh6byg/kenny_if_your_volume_stays_this_small_your_wife/",
    "score": 1147,
    "selftext": "HELLO EVERYONE!\n\nMy word Kenny boy, that volume won't satisfy anyone - well, apart from the 517,000 apes on superstonk who thoroughly enjoyed watching the physical representation of running out of ammo you put on for us today.\n\n1.5 Million volume, the lowest for a year, the 9th of July enters a special club: one of only 7 days that gamestop has ever had under 2 million volume.\n\nThis has gotten me more hyped than I though possible if I'm quite honest, I'm starting to think [my DD](https://www.reddit.com/r/Superstonk/comments/of8tvx/how_much_volume_are_you_hiding_in_your_shorts_a/) was not just the ramblings of a crazy person who had spent 30 hours reading through months worth of minute by minute data, and may actually be on to something. **The volume is dropping, the manipulation is dropping, and the price is rising (by $0.35 but hey, it fucking counts).** \n\n***So what the fuck was up with today,***\n\nWell welcome back everyone, this post is a continutation of [my first post here](https://www.reddit.com/r/Superstonk/comments/obzyst/insecure_about_the_size_of_your_volume_dont_worry/), where we take a look at GME's weird minute by minute data and compare it to other stocks, and other days of trading.\n\nYesterday's update can be found [here](https://www.reddit.com/r/Superstonk/comments/ogg6np/minute_by_minute_guy_8th_of_july_update_your/),  \nAnd today for the first time, I will be including a comparison of this entire week to last week, data on last week can be found [here](https://www.reddit.com/r/Superstonk/comments/ockost/27_update_your_volume_is_still_small_and_still/).\n\n**I will give today's figures first, and then my analysis on what happened - then I will compare this week to last week, and analyse that too.**\n\nI'll do a quick explanation on what I am doing for new people, for those who already know **skip to after the explanation picture**\n\n&#x200B;\n\n[Fairly simple](https://preview.redd.it/xoq9aoci19a71.png?width=683&format=png&auto=webp&s=26e60f34864a2317519050fd863b7aa4c0942064)\n\n**Okay, so what happened today?**\n\n***TODAY'S FIGURES PART:***\n\n**9th of July**  \nVolume - 1,501,739\n\n**Total Majorly Significant Ticks - 10**  \nTotal Minorly Significant Ticks - 7\n\n**Total Significant Ticks - 17**\n\n**Majorly Significant Tick total volume - 249797 = 16.6% of the total volume for the day.**  \n10 Majorly Significant ticks represent - **2.56% of the day's minutes for 16.6% of the volume.**\n\n**Total Significant Tick volume - 345,740 = 23.0% of the total volume for the day.**\n\n**Therefore, the 17 largest ticks of the day, representing 4.36% of the minutes of the day, were responsible for 23.0% of the volume**\n\nHere is how this compares to the rest of the week in **pretty table form:**\n\n&#x200B;\n\n|Day|9/7|8/7|7/7|6/7|\n|:-|:-|:-|:-|:-|\n|Volume|**1,501,739**|2,753,262 |4,194,228 |2,604,813 |\n|Major Significant Ticks (>1%) |**10**|14|19|11|\n|Minor Significant Ticks (0.8%-1%) |**7**|9|6|6|\n|Significant Ticks Outwith 10 mins Open/Close |**7**|11|23|10|\n|Total Volume of Maj. Sig. Ticks |**249,797**|622,946|1,355,146 |467,306 |\n|Total Volume of Maj. Sig. Ticks as % of daily total |**16.6% of daily volume, 2.56% of minutes** |22.6% of daily volume, 3.6% of minutes |32.3% of daily volume, 4.87% of minutes |17.9% of daily volume, 2.82% of minutes |\n|Total Volume of ALL Sig. Ticks |**345,740**|842,088|1,618,732 |602,790 |\n|Total Volume of ALL Sig. Ticks as % of daily total |**23.0% of daily volume, 4.36% of minutes** |30.6% of daily volume, 5.9% of minutes |38.6% of daily volume, 6.66% of minutes |23.1% of daily volume, 4.36% of minutes |\n\n***TODAY'S ANALYSIS PART:***\n\n**So today was** ***small***\n\nIn every way. Lowest volume for a year, low significant ticks, today was similar to 6/7 and 29/6, but with about **a million less volume.**\n\n***So what can we take from this? - Analysis of 9th of July***\n\nWell, to put it simply: *where the fuck is the fuckery*? Wednesday had some *spice* to it at least, dumping a million or so trades into the market to crash the price $20, it was pathetic but at least it provided some entertainment. **However I think that day hurt them,** ***badly.*** \n\n**Each day since wednesday** (yes it's only been 2 days, shut up) **the total volume from significant volume has been** ***half of the day before.*** And as a result, we've been climbing again - as I laid out in [my DD](https://www.reddit.com/r/Superstonk/comments/of8tvx/how_much_volume_are_you_hiding_in_your_shorts_a/), low *Significant Volume* seems to correspond to good shit for us. It is my belief that **the fewer significant minutes, and the lower the significant volume, the less fuckery is going on -** \n\n***And the last 3 times we have dropped to 0-2 significant minutes per day preceeded the January, February, and March sneezes.***\n\nIt is my theory that, when the significant minutes and volume drops to near 0, this is indicitave of Marge being on the phone. Each of the times this has happened, the significant minutes has stopped for around 2 days, and the price has exploded upwards. They have then returned to hammer the price back down - but each time has been **far less effective than the last.**\n\nThe January sneeze was hammered back to earth with an insane 12 Million volume in 70 minutes of trading. Today we had 1.5 Million volume for the entire day.\n\nIn January, they could afford to play with 12 Million volume in a couple of hours, **now that amount of volume is not trading in a full week.** Wednesday's \"attack\" used 1,130,749 volume in total to bring the price down just $17.83, that is almost 80% of **today's entire volume. That is 10% OF THIS WEEK'S VOLUME for one attack. And the price has already recovered.**\n\n**I do not think a margin call has occurred, as we still have 17 minutes and 23% of the daily volume coming from these large spikes, but it certainly feels like they are running out of steam.** \n\nThis certainly does match up with the figures I observed around a week before each of the sneezes, amounts of significant minutes and their total volumes were declining quickly, and eventually reached 0. I am waiting for that day to happen again, but I could see it being soon.\n\nOh yeah, today's opening candle actually contained more than 5% of the entire day's volume, so that's kinda cool - also I first began looking into this because I noticed many absolutely tiny candles throughout the day, with under 1000 volume and was wondering where the rest of the volume was coming from, so with today's volume being so monumentally low, I decided to check how many candles were **under 1000 volume.**\n\n**Today we had 39 candles under 1000 volume, with the lowest being 236 at 14:59**\n\n&#x200B;\n\n[I was noticing a distinct lack of pretty pictures, my bad](https://preview.redd.it/q6cvxgybb9a71.jpg?width=1920&format=pjpg&auto=webp&s=a714858b85a5a723a6ba02c7f250c793847f3280)\n\nAlright now we've got a pretty picture to remind us why we're all holding and what we're gonna get from this, let's compare **this week to last week.**\n\n***WEEK COMPARISON PART:***\n\n***Another pretty table for you all, you deserve it***\n\n&#x200B;\n\n|Week|Week beginning 6/7 (ONLY 4 TRADING DAYS)|Week beginning 28/6|\n|:-|:-|:-|\n|Total Weekly Volume|11,054,042|15,098,685|\n|Average Daily Volume|2,763,510.5|3,019,737|\n|Average Majorly Significant Ticks per day (>1%)|13.5|12.8 |\n|Average Minorly Significant Ticks per day (0.8%-1%) |7|7.4 |\n|Average Significant Ticks Outwith 10 mins Open/Close per day|12.75|14|\n|Total Volume of Maj. Sig. Ticks |2,695,195|3,161,154|\n|Total Volume of Maj. Sig. Ticks as % of **Weekly** total |24.4% of the week's volume from 3.46% of the week's minutes|20.9% of the week's volume, from 3.28% of the week's minutes|\n| Total Volume of ALL Sig. Ticks |3,409,350|4,125,593|\n|Total Volume of ALL Sig. Ticks as % of **Weekly** total |30.8% of the week's volume from 5.26% of the week's minutes|27.3% of the week's volume, from 5.18% of the week's minutes|\n\n***This table as super sexy 4 day/1 week averages:***\n\n**4 day average volume of Majorly Significant ticks as % of total daily volume**  \n% of ticks (out of 390 minutes in trading day) - **3.46%**  \n% of daily volume - **24.4%**\n\n**4 day average volume of all Significant ticks as % of total daily volume**  \n% of ticks (out of 390 minutes in trading day) - **5.26%**  \n% of daily volume - **30.8%**\n\n**4 day average Majorly significant ticks - 13.5**\n\n**4 day average Minorly significant ticks - 7**\n\n**4 day average significant ticks outwith 10 min of open/close - 12.75**\n\n***The above are the averages for the whole week beginning 6/7/2021.***\n\nThis data is unfortunately skewed a good amount by 7/7, which by itself contained 38% of the week's volume, and recorded far higher significant minutes and volume than any other day over the last 2 weeks - \n\n**However what we can take from this is proof of the theory.** The one blatant outlier, with almost 40% of it's volume coming from significant ticks (the next highest of the last 2 weeks - 28/6 - contained only 30% of the day's volume, with toal volume comparable to 7/7) also **had the highest high-low spread of any day in the last 2 weeks ($19.94).** At some point over the weekend, I will work out if there is a distinct mathematical relationship between the percentage of volume contained in the signficant minutes, and the high-low spread over the last two weeks - but for now we can at least see that **the more significant ticks, and the more volume contained in them, the more the price moves - however it almost always moves downwards.** \n\n&#x200B;\n\n[This week has taken years off me](https://preview.redd.it/3nzo4ovzi9a71.jpg?width=225&format=pjpg&auto=webp&s=a321fa585af3355e1763b88365e719e73262e0d0)\n\n***Closing thoughts***\n\nThis week has felt **long.** I do still intend to keep updating each day next week, but I may end up missing some days as I remembered I am meant to have a life outside of GME - that's kind of the point of all this after all eh?\n\nHowever, my final thought of the week is \"*That was a lot of fuckery to not even close out under $190\".* Remember everyone, no matter how tired you're feeling, how rough you're feeling looking at your bank balance, how frayed your emotions are - **I bet you Kenny is feeling it worse.** \n\nYour lights aren't on all night (well maybe they are but that's just your shitty sleep schedule, not you fighting to stay out of jail for one extra day).\n\nIt costs us nothing to hold.\n\n***You have an army of apes here to help you through this.***\n\nAnd most of all - **hedgies r fuk**\n\nThanks for reading,  \nSee you next week\n\nSlàinte",
    "title": "Kenny, if your volume stays this small, your wife is going to leave you - Minute by Minute guy 9/7 update, and inaugural week by week comparison",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oh6byg/kenny_if_your_volume_stays_this_small_your_wife/"
}