{
    "author": "Ginger_Libra",
    "created_utc": 1625861602.0,
    "distinguished": null,
    "edited": 1625867764.0,
    "id": "oh3ocf",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oh3ocf",
    "num_comments": 666,
    "permalink": "/r/Superstonk/comments/oh3ocf/why_are_we_being_left_in_the_dark_why_all_the/",
    "score": 7919,
    "selftext": "January bag holder here. We used to talk about this more in the other subs and I felt like it was common knowledge. I’m not smart enough to have research this myself but I looked it up again because there seems to be a lot of shit talking and confusion. \n\nRyan Cohen and RC Ventures entered into a Standstill Agreement on January 10, 2021 that has a long list of provisions that essentially prohibits him from speaking out directly. \n\nSpecifically, he is not allowed to influence voting or board votes and another long list of activities until about March 1, 2022. \n\n\n[https://www.sec.gov/Archives/edgar/data/1326380/000119380521000031/e620202_ex99-1.htm](https://www.sec.gov/Archives/edgar/data/1326380/000119380521000031/e620202_ex99-1.htm)\n\nSo for everyone wondering why things are quiet, this is why. \n\nHere’s the deal. \n\nThis week sucked. Next week is uncertain. The DTC/other colluders rules we’ve been waiting for don’t appear to have made a difference in hedge fund fuckery. We took a beating. \n\nI bought my first share at $350. I held to $38. \n\nI want tendies. But I’m not fucking leaving over this. Never. I’m out when the share price looks big for Kenny and his pals, not when it looks big to me. That’s the only way I’m selling. \n\nAnd you know what? I trust Ryan Cohen. I know he has a plan. I know he will do right by us. \n\nHe isn’t talking to us because he can’t. But he is communicating. And it’s going to be fine. Better than fine. It’s going to be fucking glorious. Life altering. \n\nIt’s coming. Changing corrupt financial systems and taking down evil villains ain’t easy. That’s why super hero’s have movies about them. Shits hard. \n\nIt’s Friday. Go fuck off. Have a tasty beverage. Get some sun on your face this weekend. Get laid if there is someone who will enthusiastically consent to fucking you. Or just willingly consent. \n\nTomorrow is a new week. NFT week. Could be nothing. Could be everything. Everything is coming. \n\nIn the meantime, dream your dreams about what you’re going to do with your tendies. \n\nI’m fixing this fucking planet I love so much. Apes are going to find a solution for climate change. I’m going to be a part of that movement. I’m making my plans. \n\nYou do you. There’s lots of broken shit in this fucked up system. \n\nCome back Monday ready to hype. \n\nTL;DR: Papa Cohen can’t say anything publicly until around March 1, 2022. \n\nWen moon? Soon moon.\n\n\nEdit to add: because I am spelling everything out….remember, Kenny and his buddies aren’t going down easily or we’d all be rich by now. \n\nEverything needs to be above board so that GameStop and RC don’t get sued. I’m sure they will get sued but the goal is to not have anything substantive behind it. \n\nHe also has to watch what he says to the SEC doesn’t get him for market manipulation. He has to watch his mouth to protect us and protect our tendies. \n\nElon has gotten in trouble for this. And RC is smarter than Elon so he is walking a finer line.\n\n\nSecond edit: some of you seem to think the Standstill Agreement ends after he became 🪑👨. It does not and if it’s amended or changed it would be filed with the SEC. \n\nThe Standstill Agreement protects GameStop from a hostile takeover. Hostile takeovers of corporate boards are a whole other post. This is a not so hostile takeover. \n\nOther chairman and CEOs can speak out because they didn’t buy shares to join a company. They don’t have Standstill agreements.",
    "title": "Why are we being left in the dark? Why all the cryptic tweets? Why doesn’t Ryan Cohen just tell us what’s up? ……Enter the Standstill Agreement that doesn’t allow Ryan Cohen to speak openly about GameStop until 2022",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/oh3ocf/why_are_we_being_left_in_the_dark_why_all_the/"
}