{
    "author": "NorthernPrick",
    "created_utc": 1621428711.0,
    "distinguished": null,
    "edited": 1621450289.0,
    "id": "ng4z7p",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_ng4z7p",
    "num_comments": 354,
    "permalink": "/r/Superstonk/comments/ng4z7p/synopsis_for_05192021_what_we_need_to_know_before/",
    "score": 7966,
    "selftext": "Good morning San Andreas,\n\nI am NorthernPrick,\n\nHow's it doin?\n\n\\*insert stolen intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/e85sgkhz92071.png?width=680&format=png&auto=webp&s=c678b42ec8454df53116a294128c6f7dfc1a75ea\n\n# Who are you? Where's Rensole and the crew?\n\nWell, as I'm sure you've probably seen Rensole, Pinkcatsonacid, And Bye\\_Triangle are taking a much needed day of rest. No one else has made a daily roundup yet, but as this is a staple of the community I thought I'd blast out a couple of lines to keep it consistent.\n\nIt also seems that the man/woman behind our other favourite post; Sir **Diamantenhände** has been under the weather lately. So let's hope they can also recover and get back to business in good time!\n\n&#x200B;\n\nhttps://preview.redd.it/77rtkdukc2071.png?width=1104&format=png&auto=webp&s=a8e81c35bf11761e997df13691203f4a9ff47994\n\n# The RobinHood IPO Revenge Play - OR - \"The Bad Mistake\"\n\nI've seen the suggestion of shorting or buying puts on RH's new IPO being seriously mentioned quite a few times recently. What was a joke in February, seems to be turning into a shill tactic in May.\n\nI'm not going to tell you what to do with your money, but personally I'm not getting off the rocket to mess with anything RH related. While I agree it will probably fall off a cliff quite quickly, I expect it to also be used as a bear trap for a short time to snare vengeful apes.\n\nI certainly don't want to be margin called if an RH options contract skyrockets in the wrong direction. All that will happen is my GME will get force liquidated to pay for it and leave me with nothing at all and no moon tickets.\n\nIf you really want to short something, short the hedgies by buying more GME\n\nRemember: We are Bulls with Diamond Nose Rings!\n\n&#x200B;\n\nhttps://preview.redd.it/6pdfwnjrh2071.png?width=1078&format=png&auto=webp&s=237063c218b459a6fc93b8bf124b748300fe928f\n\n# The OCC's temporary size increase to the clearing fund pool\n\n[https://www.reddit.com/r/Superstonk/comments/nftyg4/occ\\_has\\_issued\\_a\\_statement\\_to\\_all\\_clearing/](https://www.reddit.com/r/Superstonk/comments/nftyg4/occ_has_issued_a_statement_to_all_clearing/)\n\n588 million dollars! Holy smokes!\n\nActually not quite. On paper this looks like a tasty bit of loss, but that number is actually split between hundreds of firms. It equates to at most a couple million per member and is nothing but a drop in the bucket to these ultra rich firms.\n\nEither way it's interesting to see this being announced, but I wouldn't get too excited about it.\n\n&#x200B;\n\n[meme credit: \\/u\\/JustDesaix](https://preview.redd.it/h5w5o8oij2071.png?width=956&format=png&auto=webp&s=42e8ecaf852900fe15d9ec89708b2ca1e5f43b50)\n\n# Glacier Capital and the mailbox\n\n[https://www.reddit.com/r/Superstonk/comments/nf3sfp/glacier\\_capitals\\_mailbox/](https://www.reddit.com/r/Superstonk/comments/nf3sfp/glacier_capitals_mailbox/)\n\nThis. Now this is cool. And an absolute testament to the sheer amount of apes actively hodling GME\n\nThe fact that an ape was able to not only travel to the Glacier Capital business address in Luxembourg and find their low budget mailbox, but also to find other apes already there doing the same thing. That's insane.\n\nI would expect that from a US location, absolutely not from a tiny European country where hodl numbers are generally reported as quite low. This is truly huge WORLDWIDE. Tits = Jacked.\n\n&#x200B;\n\n[picture credit: \\/u\\/DanceIllustrious2788](https://preview.redd.it/3mz58vszk2071.jpg?width=400&format=pjpg&auto=webp&s=c6921b2fc18b3c110d8ccdbc1bbe6d771df7dc83)\n\n# The ICC, OCC, DTC - The new filings from these new names\n\nSo what exactly are the ICC and OCC? I only knew about the DTC - I hear you ask.\n\nWell, in simple terms the DTC handles the stonk side of the market. The OCC is basically the same but for the options side of the market.\n\nThe ICC is for default swaps and the big ol' banks are the members.\n\n**SR-ICC-2021-007:** Basically this is a means of them cherrypicking what can be used as collateral or capital to avoid the dreaded phone call. So if they say \"Look at these here shitcoins and bonds! Plenty money here\", the ICC can say no that's not good enough we need cold hard cash and assets and liquidate them.\n\n**SR-ICC-2021-008:** The margin requirements calculation model. Basically if they predict a stock will have a period of high volatility, they take that into consideration when calculating margin requirements. So if they think the stock will go up, then guess what? You already have the higher risk in advance.\n\n\\^ As far as I can tell these two rules are huge. We might not see immediate activity as a result, but it's another strand off the tightrope.\n\nIf you want to read more about these, check out the post by Criand. Though I'm sure you can't miss it anyway: [https://www.reddit.com/r/Superstonk/comments/nfl69o/new\\_icc\\_rules\\_summary\\_they\\_are\\_preparing\\_for/](https://www.reddit.com/r/Superstonk/comments/nfl69o/new_icc_rules_summary_they_are_preparing_for/)\n\n&#x200B;\n\nhttps://preview.redd.it/4h507j37t2071.png?width=1224&format=png&auto=webp&s=598003352927216f2a2d46c0b598f382ff1147e1\n\n# The \"fake squeeze\" narrative\n\nOk. I think this goes without saying, but if the hedgies let GME run up to 1k then they will get the dreaded phone call. Atleast the smallest hedgie will, and it will cause the domino effect and wipe out the other firms in the process. I really doubt that the fake squeeze is possible and it seems to me like an attempt at convincing apes to try an daytrade.\n\nThe best way is to hold through the \"fake squeeze\" if it happens, and allow it to carry on into the real MOASS. Keep an eye on the Level 2 data for the bid/ask information and use that to help you find indicators.\n\nIf you don't have ready access to **Level 2** data or your broker doesn't offer it, try out one of the market livestreams on YouTube.\n\nPersonally I like **Stocks Big Plays** daily livestream as there is no music or commentary, simply just a quiet stock board with the data and people chatting. Sorta like in the NYSE but it's actually a WeBull screen recording.\n\nCheck out their today's stream here: [https://www.youtube.com/watch?v=TYqOXYYIhYM](https://www.youtube.com/watch?v=TYqOXYYIhYM)\n\n:EDIT: To clarify, you shouldn't take L2 data as the be all and end all. For example WeBull's data is only data from the NASDAQ rather than all exchanges. It's a case really of retail's data being subpar, but it's better than nothing at all unless you pay for a full fledged one like Fidelity has. Use your best judgement. [https://www.reddit.com/r/Superstonk/comments/nfh3wx/psa\\_we\\_need\\_to\\_stop\\_posting\\_misleading\\_order\\_book/](https://www.reddit.com/r/Superstonk/comments/nfh3wx/psa_we_need_to_stop_posting_misleading_order_book/)\n\n&#x200B;\n\nhttps://preview.redd.it/29koiw2so2071.png?width=882&format=png&auto=webp&s=87449e665b7a7c0217f52c8875818a904c94d852\n\n# EXCELLENT! guitar solo\n\nBe friendly, help others!\n\nWe're all apes here, even the shills. Treat each other with respect and decency.\n\nIf someone isn't playing nice, simply show them some kindness. They may simply be having a bad day, and stooping to their level only ends with more apes having a bad day.\n\n**Ape don't fight ape.**\n\nFinally, we can go up, down, sideways, and backwards. Whatever happens, don't panic. Good things come to those who wait. Waiting can be boring, but spend the time learning about the market and doing your own DD. I guarantee there is always more that you can learn.\n\n&#x200B;\n\n:EDIT: Kindly pointed out by /u/C_C_C21 , Honourable mention for the AMA with Wes Christian yesterday. It's a super interesting viewing and a lot of the big DD has been reinforced by this man. If you missed it, check out the replay at [https://www.reddit.com/r/Superstonk/comments/nfs6s2/rsuperstonk\\_live\\_wes\\_christian\\_may\\_18\\_2021\\_watch/](https://www.reddit.com/r/Superstonk/comments/nfs6s2/rsuperstonk_live_wes_christian_may_18_2021_watch/)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/evd246evp2071.png?width=1278&format=png&auto=webp&s=4066c59f27b5c6e06a90d5e27d923828d6711ea7\n\n# Peace out mates! Have a great day chadding the market.\n\nSide note after re-reading this news post, I see that it's a little shorter than usual. Apologies there, I read a ton of posts overnight but the wine has made me forget the other juicy ones.\n\n(Obligatory not financial advice. Opinions and discussion is the personal musings of /u/NorthernPrick and not to be taken as fact. Educational Boredom Only.)",
    "title": "Synopsis for 05-19-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ng4z7p/synopsis_for_05192021_what_we_need_to_know_before/"
}