{
    "author": "PeterSunYoungKi",
    "created_utc": 1628376763.0,
    "distinguished": null,
    "edited": 1628386732.0,
    "id": "p0382y",
    "text_only": true,
    "flair_text": "💎🙌🚀",
    "name": "t3_p0382y",
    "num_comments": 634,
    "permalink": "/r/GMEJungle/comments/p0382y/the_next_time_it_runs_up_to_350_apes_are_going_to/",
    "score": 4227,
    "selftext": "Pretty much exactly what the title says. I know Apes are thinking \"well they will just shorts it back to $150 once it reaches $350, and it will be the endgame all over again\". \n\nPutting on my tin foul cap but I believe they are deliberately creating this repetitive cycle of running it to 350 and crashing it back to 150 to make Apes say \"well fuck it if it's going to keep doing this, I might as well day trade\".\n\nDFV never sold, he could have had legendary realized gains but the fucking legend never day traded GME and QUADRUPLED down, fucking legend.\n\nMe personally, I will not let shorts tempt me to get off the rocket to make puny gains just to get left behind once the rocket takes off.\n\nNot financial advise, just sharing my thoughts and my personal strategy.\n\nEdit:\n\nWow lots of people calling me a shill, saying FUD, telling me to fuck off so here's an update to those saying that \"Noone thinks like that you are a shill implanting FUD\".\n\nIf I'm being honest, I've been poor my whole life so when I see a trend showing I could have made thousands of dollars by day trading it looks tempting because the poor side of me is telling me \"oh look at all the money you could have made\".\n\nBut I'm saying despite feeling like that, I've come to realize how stupid it would be to miss the rocket launch into retirement by pinching profits.\n\nI have had Apes reach out to me and tell me they felt the same way and that the post helped them also realize how dumb it would be.\n\nJust being honest about how I feel and trying to help other Apes realize the same.\n\nIs that fair? Or should I still fuck off?",
    "title": "The next time it runs up to $350, Apes are going to think \"well they will just short it back to $150 again\" and want to day trade it. This is EXACTLY what the shorts want you to think. Me personally I will do the exact OPPOSITE of what the hedgies want because I remember DFV never sold.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p0382y/the_next_time_it_runs_up_to_350_apes_are_going_to/"
}