{
    "author": "BadassTrader",
    "created_utc": 1623578710.0,
    "distinguished": null,
    "edited": false,
    "id": "nyt6l8",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nyt6l8",
    "num_comments": 54,
    "permalink": "/r/Superstonk/comments/nyt6l8/wrinkle_brains_needed_citadel_loading_up_on_high/",
    "score": 523,
    "selftext": "Was just spending some quality Sunday reading time browsing through Fintel reports... as you do... and I came across some shit that may mean nothing, but may be worth putting some collective brain power into. \n\nLet's start with $HYG\n\nWhen Kenny sent in his 13F-HR in Feb, he has $0 worth of shares of this ETF. Date: 16 Feb 2021\n\nHis latest filing shows that he as added to this ETF to his portfolio, but only $43 million worth of shares. \n\nMore interestingly though, as we know Kenny loves to short shit, is that he also owns $650 million calls and $2.5 billion worth of puts. \n\nThis is no small amount even for Kenny. \n\nSo... let's take a look at Citadel overall. \n\nHis latest filling shows that he currently has $407 billion AUM. \n\nHe has 13,104 positions\nHas been closing a lot of positions since his last filing with 1048 closed. (Someone need some capital?)\n\nBut...\n\nHe's only opened 5 new positions. \n\nSo after the Jan 😨 for him, he no doubt has been trying to take a step back, reposition himself in order \"To continue to fight, to stay alive for 1 more day at a time\"\n\nSo what has he decided are the most critical positions for him to be in that he previously did not have?\n\nSo the 5 new positions that Kenny has been buying up, are mainly bonds...\n\nTeradyne Inc Bond (US:880770AG7)\nInsulet Corp Bond (US:45784PAH4)\nTeladoc Health Inc Bond (US:87918AAC9)\nCONV. NOTE (US:98954MAG6)\n\nAnd 1 stock:\n\nSea Ltd (KY:81141RAD2)\n\nAnd we know from the $HYG example, that he is also adding to existing Bond positions. \n\nWhat does this mean?\n\nNo fucking clue - I like drawing triangles on charts with crayons and didn't pay attention in school so don't understand fundamentals of business, not amind how a hedge fund positions themselves across multiple businesses/securities\n\n- But let's look at what else is going on here from the FREE version of Fintel. (I refuse to pay for the premium version, as if I had any money, I'd be buying GME with it)\n\nOk... \n\nSo Citadels main positions and the positions it is mostly known for are:\n\nSPDR S&P 500 ETF Trust (US:SPY)\nTesla Motors, Inc. (US:TSLA) (Wink wink Michael Burry)\nAmazon.com, Inc. (US:AMZN)\n\nOk no surprises here really, except the Burry short position on Tesla (Genius), I wonder if he has a short on Amazon?\n\nAll mainstream positions\n\nBut...\n\nLet's look at the main industries that Kenny has positioned himself in?\n\nFishing hunting and trapping (4lolz: He needs this to learn how to avoid being hunted by Apes)\n\nLegal Services (4lolz: He def gonna need this when the hunt is over)\n\nMiscellaneous Repair Services (4lolz: Needs this to try keep himself alive longer)\n\nOk so, lols aside. This is a little more unusual. What is the significance of these seemingly random industries for Kenny to be involved in? \n\nFair enough legal, that's kinda mainstream, but hunting and trapping?\n\nWhat does this all mean?\n\nHaven't a clue...\n\nThis is all I can determine from the FREE version of Fintel. \n\nDoes anyone that has the paid version, and a few wrinkles have more information 🤔?\n\nWhat does the move to bonds mean 🤔?\n\nWhy is his closing position ration 250/1 🤔?\n\nThis sadly is as far as my smooth brain can go... I leave this in the hands of those who are better Apes than Me.\n\nIs this a journey worth continuing down?\n\nIMO, I think understanding how a trapped rat reacts to the environment it finds itself in, is worth understanding if you wish to trap that rat. \n\nTLDR: Kenny's a trapped rat",
    "title": "Wrinkle Brains Needed - Citadel Loading up on High Yield Corporate Bond ETF",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyt6l8/wrinkle_brains_needed_citadel_loading_up_on_high/"
}