{
    "author": "pinkcatsonacid",
    "created_utc": 1628384426.0,
    "distinguished": "moderator",
    "edited": 1628452132.0,
    "id": "p056p1",
    "text_only": true,
    "flair_text": "👍 Court of Public Opinion 👎",
    "name": "t3_p056p1",
    "num_comments": 197,
    "permalink": "/r/GMEJungle/comments/p056p1/jungle_update/",
    "score": 756,
    "selftext": "# What's up Jungle buddies 🦍🌴\n\n&#x200B;\n\n[You reading this rn ](https://preview.redd.it/9ykvphu98zf71.jpg?width=332&format=pjpg&auto=webp&s=25217bde479c823fdb2ff00a63433ad8854c7a66)\n\n# TL;DR\n\n* Get approved! Be sure to send a modmail with the word \"approve\" in the subject. There's a shortcut to sending one in the sub menu, or you can click the mail icon where moderators are listed.\n* Reddit admin level spam-filter is removing posts every day, and not just in our sub.\n* Beware of bots, AI, and general fuckery.\n* Beware of scams and phishy links.\n* Looking into Computershare\n* New (minimal) automod req's\n* New award\n* What happens in the Jungle, stays in the Jungle (please!)\n\nhttps://preview.redd.it/n9qd52ve21g71.jpg?width=626&format=pjpg&auto=webp&s=68da0745e9a2e917f30e87bb6feb4d420f2aa4ed\n\n&#x200B;\n\n# Reminder about our restricted status and how to get approval\n\n*At this time, this subreddit is set to restricted status, and only approved users can post. The public can still comment.*\n\nWe've been set to restricted status for almost 2 weeks now (right? what even is time..) and in the process have approved thousands of members. I don't have an exact number but we've moved through at least 7-8k modmail I would guess. It has gone pretty smoothly after getting off to a little overwhelming start. And at this time I would consider us caught up.\n\nNow, I missed several requests and they were instantly archived by mistake- that has happened several times. *The only reason anyone has been denied approval by me or Dan is because the account was created after July 10, or they are an obvious troll/shill/meltdown poster*\\*\\*.\\*\\* If you requested approval and haven't heard back by now, please resubmit if your account fits the few req's above! We really appreciate your patience!\n\nIn one of the previous updates we requested that not everyone request approval if you aren't a regular poster, to help us get a jump start on requests. Y'all are awesome and let us get ahead of that, and **now we are suggesting everyone request approval at this time through modmail with the subject \"approve\", or just send the request when you (try to) post and are prompted to do so.**\n\n&#x200B;\n\n# Further Restrictions Possible*- The Bots are Coming\n\n*\\*Not without a vote of the community, of course*\n\nAs MOASS approaches and the FUD grows more intense, I'm sure in the future we will be voting on further restrictions as we have more approved users. This subreddit can basically serve as a fallout shelter for MOASS, and until then is a lounge for open, thoughtful discussion amongst members and visitors alike. As most of you are aware, this subreddit was never intended to replace any other or emulate any other sub. We just deserve a chill, safe space to vibe 'til the Tendie Man comes.\n\nOn that note, I would like to make a comment regarding the number of online members, and the rapid rise in membership on this sub and others.\n\nAbout two months ago [this post](https://www.reddit.com/r/Superstonk/comments/nwcult/once_again_this_sub_just_went_from_150k_online/) pointed out something that I also noticed around the same time (and brought up for discussion privately and publicly). There was a huge fluctuation in the number of members online in several communities including the one I moderated at the time. More than once, the number of members online dropped by 80-100k in a matter of a few moments (from insane record highs). The post I linked above outlines and confirms what I believed to be true then- that bot accounts had joined by the tens of thousands and were experiencing a tech issue or smth ^(and I was not the only one on the team who thought that. This happened at the exact same time as the implementation of the mind reading monkey, but I won't go into that. I have many reasons to continue to distrust the bots and) ^(AI) ^(being used to scrape and silence our community.)\n\n[BOTS!](https://preview.redd.it/kxy7vmzxbzf71.png?width=349&format=png&auto=webp&s=4739a9b40bae55389987947e38cc434022afd237)\n\nI remember seeing an estimate in a theory type-DD (couldn't find it in a search, link it up if you remember which one!) that said there are likely only roughly 100k actual apes behind accounts- the rest are likely, basically synthetic accounts in one form or another (lol). I don't remember the logic exactly, but it was based on the migration from r/GME and while I'm sure the number has grown since then, I think this is closer to the right ballpark than the numbers you might think based on membership counts around town ༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n\nAnd I honestly think it's odd we have almost 85k members but probably <10k requests for approval so far, but I will chalk that up to some members not being online as often (it's only been 2 weeks after all- Gary Gensler did less in 3 weeks 🤷‍♀️) and not enough users aware that the sub is restricted, etc. We will see how many approvals of real accounts we get done in the next few weeks.\n\n**Basically- There has been a considerable uptick in the number of members in our GME subs, and (seemingly) inorganic number of members online at times, which I believe to be attributed to a massive amount of bot accounts in our presence on our GME subs, ofc including here. I want to make sure every real member gets approved now so we can block those bots (and shills) out when the time comes! The MOAFUD will be upon us at some point, let's get the jungle ready!**\n\nhttps://preview.redd.it/dglzb86ug0g71.jpg?width=958&format=pjpg&auto=webp&s=3b1fa84a52e14f94d4de2e673943940a494b1179\n\n# Wer Post Go? 🧐\n\nKind of fucked up that I've already used this title in a previous post because this continues to be an issue. Many users reporting that their posts are removed and when Dan and I investigate, it is not done by either of us or automod (which is still deactivated btw) and could only have been done by higher ups- likely to be the reddit spam filter. And I'm beginning to theorize that it may be happening to those who post to multiple GME subreddits (there is a growing list after all). Just know that even if we approve it, that doesn't override the admin-level action. We can't reverse that, but you are still welcome to tag us to investigate! Edit: the reddit spam removal doesn't appear to be targeted. It's happened in many non-stock subs around reddit.\n\n&#x200B;\n\nOne example was that there were several posts yesterday that were considered \"spam\" by both the spam bot and myself- about contacting reps re: the proposed changes in regulation to crypto that were being voted on today (Saturday). I tweeted about it to help raise awareness and actually got a response from foobar ~~@ Gamestop~~ (edit: Foobar is not a confirmed employee of GME- I got in over my head with that tweet and it's deleted now.. just an update) regarding this. It was not, in fact, FUD.\n\nhttps://preview.redd.it/6gdoqp2pz0g71.jpg?width=1080&format=pjpg&auto=webp&s=81bf3743939514f8e8d6af24b521ccc2388cb1dd\n\nI just wanted to clarify that while many of those posts were spam filtered and it was a hot topic of convo yesterday, Dan and I were definitely not suppressing conversation about this. Quite the opposite, and trying to raise awareness! The removal(s) were just keeping the sub clean :)\n\nAgain, we encourage you to reach out via tagging to see why your post was removed (if it isn't apparent). Happy to answer questions!\n\n&#x200B;\n\n# ComputerShare- Direct Register Shares and Your Infinity Pool ♾⛲\n\nThere have been [several posts](https://www.reddit.com/r/GMEJungle/comments/ozbr2t/god_tier_gamestop_direct_stock_purchase_plan_drs/) that have [called attention to the direct registering of your GME shares through Computershare](https://www.reddit.com/r/Superstonk/comments/oix5zk/step_by_step_method_for_direct_registering_shares/?utm_source=share&utm_medium=web2x&context=3). This registers your stock directly in your name with the company rather than registering under your broker's street name. I have been curious about this for a while, since Dr. T tweeted about it in early May.\n\nhttps://preview.redd.it/75qarct7tzf71.jpg?width=1080&format=pjpg&auto=webp&s=2eac04102a40fb72d4f58cd89873847f8bdc8936\n\nAs she said, the minimum purchase for $GME is $25 dollars (the company uses all your available cash when prompted and buys fractional shares as well) and after reading some of the posts linked above like u/MommaP123's fantastic rundown, I decided to go ahead and test for myself, document the process, and do a bit more research in the benefits of DRS (direct registered shares). [Here's the link to the SEC page explaining DRS.](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html)\n\nBecause I began the deposit process Friday night, I won't be able to purchase my (partial) share until Monday and will begin registration then. After I do that, I will be transferring a number of my shares there to dedicate to holding forever, just like Warren Buffet suggests ;). ♾⛲\n\nI'll be doing a post dedicated to Computershare for forever shares as soon as I get some of this set up, and we will get to the bottom of this infinity pool!! *I like to think of it as infinitely wide rather than deep because I have* [thalassaphobia](https://www.reddit.com/r/thalassophobia/) *and that shit trips me out and this is a happy space.* 😅\n\n[♾](https://preview.redd.it/7mnbqorztzf71.png?width=327&format=png&auto=webp&s=52fe2f5151bc7bb3ffc5f469726fc298ea5ca654)\n\n&#x200B;\n\n# 🚨Scam Alert- Diamond Hands Book IT'S A TRAP🚨\n\nGrifters gonna grift.\n\nMany members have been reporting this diamond hands book scam for weeks (I reported the user, but it's obvi a bot and there are many more I'm sure.):\n\n[random screenshot from one of the many posts about it](https://preview.redd.it/8d1x8q6svzf71.png?width=1440&format=png&auto=webp&s=3e3f46d7f1c9687e4aad52a3846f29182642c6c9)\n\n🚨**DON'T DO IT. 🚨**\n\n**🚨THIS IS SOME KIND OF WEIRD DIRTY SCAM THAT WILL DOXX MANY APES AND IDK WHAT ELSE. REPORT TO REDDIT AND BLOCK THE BOT.🚨**\n\n**SERIOUSLY I MEAN IT THIS IS BULLSHIT FUCKERY OF THE HIGHEST ORDER, SPREAD THE WORD AND KEEP YOUR GUARD UP.⚔**\n\nYour info may not be worth much now (everyone's is worth smth) but imagine when you're swimming in tendies, how valuable would a list of apes' real info and their associated reddit u/'s be?\n\nBeware of this. Also beware of clicking third party links like google docs and LINKEDIN. If you're already logged into LinkedIn on your device, a premium user will be able to see your identity when you visit their profile. So beware of any DD you do into user accounts from recent popular screenshots!\n\nBasically, just start being aware of your online security, if you aren't already. Figure out 2FA. Change your passwords often. Update your recovery info on important accounts. Use a VPN. Don't click weird links. Don't answer the door for strangers. The narwhal bacons at midnight. Yadayadayada...\n\nJust be safe out there 💖\n\n&#x200B;\n\n# Moving Forward- Community Input Please!\n\nAs we get settled in the next few weeks, I'm wondering what the next steps will be as MOASS approaches (sooner or later it's gonna be wild!). We seem to have established a culture of being the free spirited \"lounge\" area for open discussion and I'm happy to see that welcome vibe here. Feels quite cozy 🤗\n\nI have been considering what to place as the second stickied post at the top of the sub every day (you're only allowed to sticky 2 posts and the daily discussion is always one of them) but I'm wondering what you would like to see in the other daily stickied post? I have been doing the MOADD Mother of All DD list and I think that's great, but it feels temporary and honestly, redundant. (There are so many DD compilations now, some are so fucking dope like u/zedinstead and the wikAPEdia!!) I would like the community's input here on what you want the daily focus to be. Do you want a different themed conversation thread every trading day? Do you want a daily update in the morning again? Do you want to keep the DD stickied? Let your opinion be known 👇- this is your sub!!\n\nI've seen feedback talking about wanting to see more AMAs and I've discussed that with a few people, but if that happens it will likely be in an alternate format than what you're used to seeing- probably most like the regular old reddit-thread AMAs. I'm open to helping facilitate that, again, if the community wants.\n\n**All that really matters is Buy and HODL.** The rest is just us hanging out and discussing this crazy rocket ride.\n\n[Never too ODL to HODL 💎🙌](https://preview.redd.it/lw2lzy4sl0g71.jpg?width=540&format=pjpg&auto=webp&s=2c196431d60e339bbf6eeb1aab18f23c327f1d64)\n\n&#x200B;\n\n# Automod Req's\n\nAs we get settled in, it's time to get some basic automod requirements back in order. Up until now there has been nothing in the automod code, to determine that the spam removals I mentioned earlier weren't happening internally from jank ass code (totally possible because idk wtf I'm doing) and now we have determined that it's from higher up. Now, I am going to be programming some basic requirements again. **Remember that being an approved user bypasses these requirements, and this only applies to the comment section.**\n\nAge req- 30 days\n\nKarma Req- 30 comment karma\n\nPart of the reason for implementing this again- I also responded to a modmail from zjz over at WSB. He offered/requested we use/ an automod code that prevents the issues like what was experienced from Superstonk (users coming to visit their sub and spam SS). I told him I would oblige and will make sure we keep the cross posts (and ofc brigading) to WSB to a minimum, and I am comfortable with our open line of communication.\n\nOn another note, I appreciate the fact that this community is pretty well-versed in what constitutes brigading and not to do it, but basically... stay out of other subs comments talking about the jungle. (You know which ones.)\n\n[...... outside of GMEJungle ](https://preview.redd.it/7dxlh5ikq0g71.jpg?width=712&format=pjpg&auto=webp&s=41efe9e985423c890049ddf53550404dbe234eb3)\n\nThis subreddit is a safe space for weary apes as MOASS approaches. We aren't trying to broadcast our existence and draw in more trolls and shills and bots, we have enough to deal with already! So let's keep the vibe welcoming to those who seek us for community, and not seek them out :)\n\n[I am Jack's jacked teets](https://preview.redd.it/m8goxwqhr0g71.jpg?width=340&format=pjpg&auto=webp&s=b67af4809649efcbd2108cf6506106f0de468249)\n\n&#x200B;\n\n# New Mod-Only Award\n\nWhenever you hand out a community award like the Smooth Brain or the Hang in there Kitty Award, it deposits some coins into the community pot, and mods can access that and use it to hand out custom awards if one is created. Therefore, we now have the mod-only Diamond Hand Award which provides 1 month of reddit premium to the recipient. I used to hand out mod-only awards to posts that I featured in the daily updates. We will find similar good use for it here in the Jungle!\n\n[The Diamond Hand Award- grants 1 free month of premium to the recipient](https://preview.redd.it/7p33r75st0g71.png?width=1069&format=png&auto=webp&s=b1135b9847a299ba5f51d6e3f093396c73d455c4)\n\n&#x200B;\n\n# You guys are awesome\n\nThis community is seriously so unique and resilient and beautiful and creative and just makes me all warm and fuzzy inside. Dan and I appreciate the tags and reports that help keep the sub clean (and ofc all the bitchin content!) We're trying to keep censorship to a bare minimum and rely heavily on your input when acting on a post or user, so thank you for staying vigilant!! You make the effort of creating, cleaning, and protecting this space all the more worthwhile! 🍻\n\n&#x200B;\n\nhttps://preview.redd.it/20eetcwgy0g71.png?width=512&format=png&auto=webp&s=70f1f48b859398bb35760a28d1e0f707b184ecc6",
    "title": "Jungle Update 🦍🌴🍌",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p056p1/jungle_update/"
}