{
    "author": "I_DO_ANIMAL_THINGS",
    "created_utc": 1624642394.0,
    "distinguished": null,
    "edited": 1624714552.0,
    "id": "o7sg0e",
    "text_only": true,
    "flair_id": "4c901ca2-b1b1-11eb-83d0-0ed719c76173",
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_o7sg0e",
    "num_comments": 679,
    "permalink": "/r/Superstonk/comments/o7sg0e/i_think_finra_has_filed_for_a_nationwide_ability/",
    "score": 3966,
    "selftext": "Good afternoon Apes,\n\nI don't know anything so don't listen to me.\n\nEdit up top: I wouldn't worry too much about any of this. It's interesting and you should really read these rules if you're into this stuff. The financial legal world is the wild west. \n\nFollow the 4 hour rule and don't go crazy until smarter Apes have reviewed.\n\n# I believe FINRA has filed a request to restrict investors from trading specific securities if FINRA thinks the investor is too retarded. FINRA gets to decided if the investor is retarded and they want this nationwide.\n\nSpecifically, the updates they're requesting provide a much broader reach and lower standard than previous rule.\n\nEDIT: [PDF SOURCE](https://public-inspection.federalregister.gov/2021-13653.pdf)\n\nI was [working this post about the 6/28/21 filings at the Federal Register](https://www.reddit.com/r/Superstonk/comments/o7qhz0/activity_on_the_federal_register_sunshine_act_and/?utm_source=share&utm_medium=web2x&context=3) when I found something all sorts of weird:\n\nOn 6/22/21 FINRA filed with the SEC a request and updates to modify an existing rule designed to protect the elderly. They also reference the rule is for **\"Specified Adults\"**\n\n[**Self-Regulatory Organizations; Proposed Rule Changes: Financial Industry Regulatory Authority, Inc.**](https://www.federalregister.gov/public-inspection/2021-13653/self-regulatory-organizations-proposed-rule-changes-financial-industry-regulatory-authority-inc)by the [Securities and Exchange Commission](https://www.federalregister.gov/agencies/securities-and-exchange-commission) scheduled for publication on 06/28/2021.\n\n&#x200B;\n\n# They want to extend the current hold time from 10 days to 30 days and they want to be able to do this if they think there is reasonable belief of financial exploitation.\n\n&#x200B;\n\nhttps://preview.redd.it/9dv50s8hki771.png?width=632&format=png&auto=webp&s=83447d0a98b658e3b98648fa0e176d8b1a331e61\n\n***Their definition of \"Specified Adult\"  See Rule 2165(a)(1). Supplementary Material .03 to Rule 2165 provides that a member firm’s reasonable belief that a natural person age 18 and older has a mental or physical impairment that renders the individual unable to protect his or her own interests may be based on the facts and circumstances observed in the member firm’s business relationship with the person.*** \n\nhttps://preview.redd.it/j99w8fcjki771.png?width=550&format=png&auto=webp&s=142efef47edb19bca948af9aa7e8bf640ca5c915\n\n  ***FINRA is proposing to amend Rule 2165 to create the first uniform national standard for placing holds on securities transactions related to suspected financial exploitation. Under the safe harbor approach, a member firm would be permitted, but not required, to place a temporary hold on a transaction when there is a reasonable belief that the customer is being financially exploited.***  \n\nhttps://preview.redd.it/ne76nkx5li771.png?width=648&format=png&auto=webp&s=775399cfc52a8c4f49e4d2acaf3d57dffd3cd458\n\n***Is this just for Seniors?***  \n\n***Moreover, Retrospective Review Stakeholders and commenters to the Notice 20-34 Proposal generally agree that member firms need tools to address suspected financial exploitation.***\n\nhttps://preview.redd.it/xllm57vali771.png?width=624&format=png&auto=webp&s=19dd37112218bada89983da1e93287fc2a2668da\n\n***Proposed Amendments to Rule 2165:  The retrospective review indicated that Rule 2165 has been an effective tool in the fight against financial exploitation,25 but supported amendments to permit member firms to: (1) Extend a temporary hold on a disbursement of funds or securities or a transaction in securities for an additional 30-business days if the member firm has reported the matter to a state regulator or agency or a court of competent jurisdiction; and (2) place a   temporary hold on a securities transaction where there is a reasonable belief of financial exploitation.***  \n\nhttps://preview.redd.it/08d7673ili771.png?width=534&format=png&auto=webp&s=a07821d84c648c1486c86e3f6c039c13d436068f\n\n***They also want to extend this rule to the trading of securities, not just funds.***\n\nhttps://preview.redd.it/69emsnasli771.png?width=638&format=png&auto=webp&s=5f647357cd8ab63b971ccc720c799caac1baa2b2\n\n***EDIT: I had to re upload all of this after my the automod changed my flair and half my post vanished.***   \nNo one here is FUDDABLE, so this ain't fud. This is just another interesting thing discovered on the learning journey. I really do not think this rule will or could be used to intervene and restrict trading but I did find it interesting how they went from the previous rule to all these changes and stipulations as well as piggy backing expanding their reach.",
    "title": "I think FINRA has filed for a nationwide ability to restrict trade.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7sg0e/i_think_finra_has_filed_for_a_nationwide_ability/"
}