{
    "author": "Brindle_Bum",
    "created_utc": 1617986049.0,
    "distinguished": null,
    "edited": 1618011966.0,
    "id": "mnl4jw",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰",
    "name": "t3_mnl4jw",
    "num_comments": 292,
    "permalink": "/r/Superstonk/comments/mnl4jw/us_government_selling_370_billion_in_treasury/",
    "score": 2017,
    "selftext": "April 9, 2021 2:26 pm by Colby Smith in New York\n\nUS government bonds were hit by fresh selling on Friday, with analysts warning of further volatility ahead as the Treasury department seeks to offload more than $370bn of new securities over the next three weeks.\n\nLong-dated Treasury yields rose back towards recent highs, with the 10-year Treasury note trading 0.05 percentage points higher on Friday at 1.667 per cent.\n\nThe abrupt move ruptured a brief calm that had settled over the $21tn market for US government debt in recent weeks, after the worst quarterly performance for long-dated Treasuries in more than four decades. Earlier this week, the benchmark 10-year yield hovered closer to 1.6 per cent.\n\nThe pending surge in issuance has only heaped on additional anxiety.\n\n“It is too much supply too quickly at these current yield levels,” said Tom di Galoma, a managing director at investment bank Seaport Global Holdings. He added that potential choppiness could “easily” push the 10-year yield back to about 1.75 per cent next week.\n\nThe first test comes on Monday, with the sale of $58bn in three-year notes and another $38bn of 10-year securities. The deluge continues on Tuesday, when the Treasury holds a $24bn auction of 30-year debt. \n\nThe following week, a new wave will add to that $120bn in supply, with a $24bn sale of 20-year debt, according to analyst estimates. The week after that, strategists forecast the Treasury will sell another $183bn of securities, with $60bn coming in two-year notes, another $61bn in five-year debt and $62bn at the seven-year mark.\n\nThat brings total supply for the month to an all-time record of $373bn, according to estimates by Gennadiy Goldberg, a rates strategist at TD Securities, once the remaining auctions for inflation-protected government securities and other notes are factored in. \n\n“Given the enormous amount of supply continuing to hit the market every month, every Treasury auction should be viewed as a risk event,” Goldberg said.\n\nThe market could stumble right from the start of the week, warned di Galoma at Seaport Global, given the size of the forthcoming sales and the improving economic backdrop that has already damped demand for Treasuries. Strategists also noted that these were the first auctions since the Federal Reserve rolled back the capital concessions it extended to banks last April, which were seen as aiding market functioning.\n\nInvestors haunted by February’s grim seven-year auction — which stirred concerns about the health of the Treasury market — are paying keen attention to the upcoming sale of debt at that maturity in particular, after what Ian Lyngen and Ben Jeffery at BMO Capital Markets characterised as a “less dismal but still very weak” offering in March.\n\nLacklustre demand from foreign investors could tip the balance once again towards choppier trading, but some Wall Street executives are holding out hope that the higher levels of Treasury yields today compared with just a few months ago will pique their interest.\n\n“The auctions may not be smooth but they are going to be digestible,” said Phil Camporeale, a portfolio manager at JPMorgan Asset Management, citing the relative attractiveness of Treasuries compared with their global counterparts. Benchmark government bonds in Germany or Japan, for example, are trading around minus 0.29 per cent and 0.1 per cent, respectively. \n\nThat differential is likely to compel foreign investors to stay active in the market, according to Avisha Thakkar, a rates strategist at Goldman Sachs. She estimates this buyer base will emerge in 2021 as the largest aside from the Fed, which is snapping up $80bn Treasuries each month and signalled on Thursday a willingness to make technical adjustments to its purchases to keep them “roughly proportional” to outstanding supply.\n\n“There need not be a problem if the Fed and Treasury work together to address potential imbalances,” said Steven Major, global head of fixed income research at HSBC.\n\nEdit: from the Financial Times today\nhttps://www.ft.com/content/f296fe3c-63f3-4d5c-a71f-1a677f450ff6",
    "title": "U.S. government selling $370 billion in treasury bonds",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mnl4jw/us_government_selling_370_billion_in_treasury/"
}