{
    "author": "Ago0330",
    "created_utc": 1619653283.0,
    "distinguished": null,
    "edited": false,
    "id": "n0rx8x",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "🔬 DD 📊",
    "name": "t3_n0rx8x",
    "num_comments": 81,
    "permalink": "/r/GME/comments/n0rx8x/did_cohen_just_neutralize_the_short_ladder_attack/",
    "score": 656,
    "selftext": "I never understood the strategy behind Cohen issuing shares and working aggressively with the MMs to drive the price on GME down last week. I was wondering, why would our daddy put us through so much pain? What is the strategic purpose behind it? How does this help us reach the moon?\n\nAfter seeing today’s price action, it dawned on me. Cohen was acting as a whale to make hedge funds algorithms self-destruct. I have a background in machine learning so let me walk you through the magic our daddy just pulled off.\n\n\nHow Machine Learning Algorithms Work\n\nMachine Learning models are much easier to understand than people realize. You take a spreadsheet of numbers, shove those numbers into a model and the computer figures out the best way to do it. Very easy, the computer does all the lifting.\n\nInput Data + Model = Prediction\n\nExample\n\nLet’s say GME shoots the moon and it’s finally time to pick up your wife from her boyfriends in your new lambo. The GPS says she’s 17 minutes away so you let her know 17 minutes. \n\nThe time estimate is determined by a machine learning algo with multiple factors. Some of which could be distance, average speed, time of day, traffic congestion and weather. \n\nThe bad news, the algo didn’t take into account your love for burning rubber in your new lambo so you you get there early and unfortunately get to your wife fucking her boyfriend one last time. \n\nWhere machine learning algos ACTUALLY go wrong\n\nMachine Learning algos go wrong for two major reasons. They could be trained on bad/manipulated data or the model is over trained on small subset of the data.\n\nAn example of bad data would be trying to determine a boy or a girl but the algo is trained with pictures of drag queens.\n\nAn example of over training would be an MMA fighter that only works on kick boxing. Fucking badass as it’s the most damage, but probably won’t actually work. \n\nHow Papa Cohen Turned their Short Ladders into Suicide Bombers\n\nAlgorithms that control the stock market weigh recent data as more important than old data. In other words, if we have a strong trend for a month, the algorithms would trade as if they expect that trend to continue.\n\nPapa Cohen was providing large whale selling support to the hedge funds. This allowed the hedge fund machine learning algos to engrain patterns of large whale support, making them trade more aggressive than they should. We saw that in today’s price action as there was a large scale sell off, then we quickly regained the trend. It appears that removing the whale support, these algos are short term suicide bombers until we squeeze and by now, know we all know GME is indestructible. \n\nTD:DR\n\nPapa Cohen is a 5D Chess master and turned their short ladder attacks into suicide bombing runs. HODL.",
    "title": "Did Cohen just Neutralize the Short Ladder Attack?",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/GME/comments/n0rx8x/did_cohen_just_neutralize_the_short_ladder_attack/"
}