{
    "author": "Gloomy-Huckleberry-6",
    "created_utc": 1617143226.0,
    "distinguished": null,
    "edited": 1617153270.0,
    "id": "mgroml",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_mgroml",
    "num_comments": 58,
    "permalink": "/r/GME/comments/mgroml/20210330_possible_pressure/",
    "score": 501,
    "selftext": "# EDIT 1:\n\nSomeone in the comments below noted that this should be CALLS not PUTS. I may have gotten myself confused in my research, so I want to preface this with: I'm looking into this more. Take EVERYTHING below with a grain of salt. I'll re-post again tomorrow with corrected numbers after I've had time to research and adjust.\n\n# EDIT 2:\n\nSo, After that comment, I went back and re-evaluated via CALLS instead of PUTS. And I believe they were right. I got myself confused. And I'm glad they did say something. I REALLY want this to be good DD, not just me venting. Thank you for bringing this to my attention.\n\nThe article below has been heavily edited to reference PUTS, not CALLS. I have ***highlighted*** all of the places that I've made edits to be clear about what is new information.\n\n# EDIT 3:\n\nSomeone had some UBER-CLASSY and amazing DD. It is only MILDLY related to this, but if you are interested in my DD here, go check out this article as well. I think it nails it!!\n\n[https://www.reddit.com/r/GME/comments/mgj0j1/the\\_naked\\_shorting\\_scam\\_revealed\\_lending\\_of/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\n# New and Improved, ... PRESSURE!\n\n[https://preview.redd.it/5fmpk5jhg8q61.png?width=908&format=png&auto=webp&s=5bd0b174e0827a4ae95e83a12e86295bc25aae67](https://preview.redd.it/5fmpk5jhg8q61.png?width=908&format=png&auto=webp&s=5bd0b174e0827a4ae95e83a12e86295bc25aae67)\n\n# TLDR:\n\nBig pressure. 🚀 have fuel. 💣go boom. 🚀fly to 🌓, and beyond. 🐵 hold 🍌 with 💎🖐. Be patient.\n\n&#x200B;\n\n# For everyone else...\n\nOkay, I'm picking up the Pressure posts, trying to determine how things may have gotten off track, if at all. I'm not an advisor. I'm not a parakeet. I'm just someone trying to help find the truth in a manure pile of lies and obfuscated data. This is the truth as I've been able to determine it.\n\nFirst of all, I have to say that the SI% presented by FINRA in ***NO WAY*** matches the summarization of the ***daily*** FINRA data. They even say on their own website that doing so is fool hearty as it will NOT add up, based on many different ways of trading, canceling and managing trades, especially when we talk about looking at Market Makers -- of which Citadel is one.\n\nAll that being said, I think looking at the FINRA data is one of our BEST sources of information, as flawed as that might be, mainly because everything else is hidden to us. We just need to take these calculations with a grain of salt, two aspirin, and a hefty dose of \"what ELSE makes sense with this data to help us correlate it\"?\n\nOnce we see this data in the right light, I think it will make much more sense and have significant merit to the overall discussion.\n\nThat being said... let's look at the most recent FINRA pressure, based on this calculation.\n\n    Symbol           : GME\n    Starting Date    : 2021-03-15\n    Float            : ***45,345,692***\n    Starting Short   : ***10,187,324***\n    Starting Short % : ***22.4659%*** of float.\n\nFirst off, let's talk about the reported numbers.The float is 45M. No dispute there. The current short (as of 03-15-21) is 10M. Again, no dispute (I'll explain why I'm NOT disputing that in just a moment.) But the reported Short Interest % of Float is 22.47%.\n\nYet, sites like Yahoo Finance list the SI% as **44.6%**, which they get from a different resource, Morningstar. I'm not sure how Morningstar calculates things, but it is OBVIOUSLY different, and they know something we don't. Something's up... but we'll start with the FINRA-stated 22.46% anyway, just to give the benefit of the doubt and be as conservative as possible.\n\nYou can find the link to this code at: [https://github.com/StockPressure/StockPressure/](https://github.com/StockPressure/StockPressure/) Take a look at the thesis and let me know if you can determine if this DD has somehow gone off the rails.\n\n***Keep an eye on the second column, Pressure #. That's the key factor here.***\n\n|Date|Pressure #|\\+/-|Uncovered Volume (     %)|Volume|Short Volume|Potential Short %|\n|:-|:-|:-|:-|:-|:-|:-|\n|2021-03-16|39.6|\\+|2,388,666 (  5.27%)|15,041,864|8,715,265|27.7340 %|\n|2021-03-17|42.3|\\+|841,123 (  1.85%)|6,915,251|3,878,187|29.5890 %|\n|2021-03-18|45.8|\\+|1,134,565 (  2.50%)|4,858,927|2,996,746|32.0910 %|\n|2021-03-19|52.4|\\+|2,074,337 (  4.57%)|10,769,625|6,421,981|36.6650 %|\n|2021-03-22|55.1|\\+|873,870 (  1.93%)|3,843,634|2,358,752|38.5920 %|\n|2021-03-23|58.7|\\+|1,122,241 (  2.47%)|4,548,007|2,835,124|41.0670 %|\n|2021-03-24|65.0|\\+|2,015,282 (  4.44%)|9,828,116|5,921,699|45.5110 %|\n|2021-03-25|76.1|\\+|3,510,976 (  7.74%)|21,672,008|12,591,492|53.2540 %|\n|2021-03-26|86.8|\\+|3,411,904 (  7.52%)|16,664,120|10,038,012|60.7780 %|\n|2021-03-29|90.6|\\+|1,185,702 (  2.61%)|4,668,884|2,927,293|63.3930 %|\n|2021-03-30|93.8|\\+|1,023,346 (  2.26%)|8,249,652|4,636,499|65.6500 %|\n\nAgain, this is not GUARANTEED Short Interest Percent. This is a wild-ass stab in the dark about what it COULD be based on FINRA data. And note that pressure went up AGAIN today.\n\nWhile this -- itself -- isn't definitive, it's a very good metric that things MAY be moving the way I expected. I'm jacked about it, anyway.\n\n# So, Short Interest % could be around 65.65%?\n\nNot exactly. This is where I get into why I \"accept\" the 2021-03-15 number of shorted shares being a \"mere\" 10,187,324. As per so many other posts recently, hghlighting what some have already explained (but it must have gotten very buried under cat and ape memes, because this was news to me this week) -- Shorters can hide their short positions and not have to claim them as short as long as they are tied up in ***call*** Options, making them \"neutral\" positions.\n\nMany people have had this theory, so I wanted to see if that theory holds any water.\n\nAs proof of this, I went looking for OTM options. The options would need to be in MASSIVE quantities. Hiding one or two options all over the board would do no good. There are just too many to hide and manipulate. And if you hid them in the wrong number, then someone ***bought*** your contract, you'd be OBLIGATED to buy those shares at specific numbers, thus causing the MOASS. You know, that very thing you're trying to avoid. You would want to, then, put this as FAR OUT as you could. ***At the time they were purchasing, the cutoff strike price would have been between 800 and 1000.***\n\n# Did you find those options?\n\nYes! Right in plain sight, at ***c800 and above. I believe that the vast majority of the puts were purchased in late January (the 25th -> Feb 3rd), while the prices were spiking and shorts were \"covering and closing\" their positions. I need someone with a BB terminal to verify this for me for later pressure updates.***\n\nI don't think they were closing anything. I think they were shifting the shares out of their portfolio into \"neutral positions\" with ***CALLs***. And I think they shifted them in multiple waves, each time trying to look like a \"squeeze\" had slowly happened and they simply bought shares to cover. But the number of purchased shares didn't seem to line up with the potential value that should have happened. Instead, I think they ended up ... here:\n\n&#x200B;\n\n[UPDATED CHART FOR PUTS INSTEAD OF CALLS](https://preview.redd.it/oygcelsee9q61.png?width=511&format=png&auto=webp&s=924cb906847122b5c45748626c96d690565a5d95)\n\n***Each option hides 100 shares. I know that SOME of these are owned by very ambitious day traders who want to strike something on GME when it moons (\\* insert scowling face here \\*). Unfortunately, I don't know which are which, and I can't foresee day traders buying ALL THAT many and forking out that kind of serious cash on such wild speculation. It's possible, but highly unlikely. Let's go with the assumption that 90% of these are hedges hiding, and the 10% are day traders, just to give us some conservative numbers to work with.***\n\n***What is NOT shown here are the 38,000 c800 options that expired as worthless last FRIDAY. I don't believe those have been re-introduced into the system, yet, and may NOW be regular-old short positions. I will add those in here:***\n\n***(50,755 \\* .9) + 38,000 = 83700 options. Times 100 because each option holds 100 shares: 8,370,000.***\n\n***That is equivalent to 18.5% of the float!***\n\n***Add 18.5% to the 65.65% of the daily calculated value above, and I think the true number is CLOSE TO (not exactly) a range of 84% to 106% (using Morningstar's SI% value instead). Am I right? Probably not. I'm sure there are many different variables this does NOT take into account, some on either side of the equation. But I think it DOES show that the stock is prime to explode like a powder keg waiting on a catalyst.***\n\nDon't use this as a guarantee, but in conjunction to other people's best guesses and estimations.\n\nThat's just my opinion. What do I know. I'm just some dude with a spreadsheet and way too much time on his hands. Do with this what you will.\n\n&#x200B;\n\n&#x200B;\n\n# EDIT 4:\n\nI'm going to copy back IN the PUT information that I ripped out above. After reading the concept of \"Married Puts\", where you have a put and a call together to create ANOTHER form of \"neutral position\", I think this is also very, very telling. I'm just not sure WHAT it's saying.... yet.\n\n&#x200B;\n\nhttps://preview.redd.it/j5fzmwk6i9q61.png?width=488&format=png&auto=webp&s=69832eeecffddc7af30fed024f4aa8e51031f59a\n\nNote that there are 325,000 PUT options at 50-cents. I know that the hedges expected this to crash and burn, so to me this makes a little sense, but as someone pointed out -- this does not create a neutral position. But when we looked up the volumes on specific days for these call contracts, the VAST majority of these were created during the spike UP from Jan 25th through Feb 3. WHO in their right mind would dump THAT MUCH money into 50-cent PUTS while the stock is rising to meteoric heights with no end in sight? There's GOT to be something here -- again, I just can't put my finger on it. I'm posting this information in hopes that someone with more wrinkles will see it and make the connection I'm missing.\n\nNOTE that 325,390 contracts is 32-million shares. Or over 75% of available float! 75% of float that was put into a contract at ridiculous prices while the stock was skyrocketing. Something stinks!!",
    "title": "2021-03-30 -- Possible Pressure",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mgroml/20210330_possible_pressure/"
}