{
    "author": "atobitt",
    "created_utc": 1617151848.0,
    "distinguished": null,
    "edited": 1617581662.0,
    "id": "mgucv2",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mgucv2",
    "num_comments": 5971,
    "permalink": "/r/GME/comments/mgucv2/the_everything_short/",
    "score": 36308,
    "selftext": "4/4/2021 EDIT: Just got done watching [this review](https://www.youtube.com/watch?v=6pnK7W4b0Ro) (2:09:37) from George Gammon and Meet Kevin. As pointed out by George, the link I posted below talking about the submitted repo amount was ONLY showing the NY Fed's total for that day. According to his own research, he suspects that $4 TRILLION is pumped through this market, EACH DAY.\n\n4/1/2021 EDIT: GREAT NEWS APES! u/dontfightthevol has been reviewing my post and helping me address weaknesses! I take this as REALLY good news as we move another step closer to exposing the TRUTH. Furthermore, I am making updates that take speculative connections out of this post.\n\nThe first one being the WSJ article covering BlackRock, where the fed has tapped them to purchase bonds for the government. These bonds consist of mortgage backed securities and corporate bonds- NOT TREASURIES. While this does not destroy the concept within the post, it DOES remove a link between the speculative relationship of BlackRock and Citadel. Citadel is still shorting bonds, other hedge funds are shorting bonds, BlackRock just isn't buying treasuries from the government. There are plenty of other financial institutions lending out their treasury bonds.\n\nWe are still discussing the post and I will make updates as they are available.\n\nSTAY TUNED!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***TL;DR- Citadel and friends have shorted the treasury bond market to oblivion using the repo market. Citadel owns a company called Palafox Trading and uses them to EXCLUSIVELY short & trade treasury securities. Palafox manages one fund for Citadel - the Citadel Global Fixed Income Master Fund LTD. Total assets over $123 BILLION and 80% are owned by offshore investors in the Cayman Islands. Their reverse repo agreements are ENTIRELY rehypothecated and they CANNOT pay off their own repo agreements until someone pays them, first. The ENTIRE global financial economy is modeled after a fractional reserve system that is beginning to experience THE MOTHER OF ALL MARGIN CALLS.***\n\n***THIS is why the DTC and FICC are requiring an increase in SLR deposits. The madness has officially come full circle.***\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nMy fellow apes,\n\nAfter writing [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/?utm_source=share&utm_medium=web2x&context=3), I couldn't shake one MAJOR issue: *why do they have a balance sheet full of financial derivatives instead of physical shares? Even Melvin keeps their derivative exposure to roughly 20%...(*[*whalewisdom.com*](https://whalewisdom.com/)*, Melvin Capital 13F - 2020)*\n\nThe concept of a hedging instrument is to protect against price fluctuations. Hopefully you get it right and make a good prediction, but to have a portfolio with literally 80% derivatives.... absolute INSANITY.. it's is the complete OPPOSITE of what should happen.. so WHAT is going on?\n\nLet's break this into 4 parts:\n\n1. ***Repurchase & Reverse Repurchase agreements***\n2. ***Treasury Bonds***\n3. ***Palafox Trading***\n4. ***Short-seller Endgame***\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nOk, 4 easy steps... as simple as possible.\n\n***Step 1: Repurchase & Reverse Repurchase agreements.***\n\n*WTF are they?*\n\nA Repurchase Agreement is much like a loan. If you have a big juicy banana worth $1,000,000 and need some quick cash, a repo agreement might be right for you. Just take that banana to a pawn shop and pawn it for a few days, borrow some cash, and buy your banana back later (plus a few tendies in interest). This creates a liability for you because you have to buy it back, unless you want to default and lose your big, beautiful banana. Regardless, you either buy it back or lose it. A reverse repo is how the *pawn shop* would account for this transaction.\n\n*Why do they matter?*\n\nRepos and reverse repos are the *LIFEBLOOD* of global financial liquidity. They allow for SUPER FAST conversions from securities to cash. The repo agreement I just described is happening daily with hedge funds and commercial banks. *EDIT: Inserting the quote from George Gammon: according to his calculations, the estimated total amount of repos are $4 TRILLION, DAILY.* The NY Fed, alone, submitted [$40.354 BILLION](https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000) for repo agreements on (3/29). This amount represents the ONE DAY REPO due on 3/30. So yeah, SUPER short term loans- usually a few days. It's probably not a surprise that back in 2008 the go-to choice of collateral for repo agreements was mortgage backed securities..\n\n[Lehman Brothers](https://www.cpajournal.com/2016/08/01/lehman-brothers-mf-globals-misuse-repurchase-agreements-reformed-accounting-standards/) went bankrupt because they fraudulently classified repo agreements as sales. You can do your own research on this, but I'll give you the quick n' dirty:\n\nLehman would go to a bank and ask for cash. The bank would ask for collateral in return and Lehman would offer mortgage backed securities (MBS). *It's great having so many mortgages on your balance sheet, but WTF good does it do if you have to wait 30 YEARS for the cash*.... So Lehman gave their collateral to the bank and recorded these loans as *sales* instead of payables, with no intention of buying them back. This *EXTREMELY* overstated their revenue. When the market started realizing how sh\\*tty these \"AAA\" securities actually were (thanks to Michael BRRRRRRRRy & friends), they were no longer accepted as collateral for repo loans. We all know what happened next.\n\nThe interest rate in 2008 on repos started climbing as the cost of borrowing money went through the roof. This happens because **the collateral is no longer attractive compared to cash.** My favorite bedtime story is how the Fed stepped in and bought all of the mean, toxic assets to save the US economy.. They literally paid Fannie & Freddie over [$190 billion in bailouts..](https://projects.propublica.org/bailout/initiatives/1-housing-and-economic-recovery-act-of-2008)\n\nhttps://preview.redd.it/ry0gqkm7g9q61.png?width=1596&format=png&auto=webp&s=48892cf57a2765e0bdd62575a8ccc8c9e3f65a1a\n\nA few years later, [MF Global](https://fas.org/sgp/crs/misc/R42091.pdf) would suffer the same fate when their European repo exposure triggered a massive margin call. Their foreign exposure to repo agreements was nearly **4.5x** their total equity.. Both Lehman and MF Global found themselves in a major liquidity conundrum and were forced into bankruptcy. Not to mention the other losses that were incurred by other financial institutions... check this list for [bailout totals](https://projects.propublica.org/bailout/programs).\n\nBut.... did you know this happened AGAIN in 2019?\n\nhttps://preview.redd.it/9htr7vn8g9q61.jpg?width=912&format=pjpg&auto=webp&s=25995c33d0056f6108471baa373d1a371b5d0cd5\n\nInstead of the gradual increase in rates, the damn thing spiked to **10% OVERNIGHT**. This little blip almost ruined the whole show. It's a HUGE red flag because it shows how the system MUST remain in tight control: one slip and it's game over.\n\nThe reason for the spike was once again due to a lack of liquidity. The [federal reserve](https://www.federalreserve.gov/econres/notes/feds-notes/what-happened-in-money-markets-in-september-2019-20200227.htm#:~:text=In%20the%20repo%20market%2C%20there,supply%20mismatch%20in%20the%20market) stated there were two main catalysts (click the link): both of which removed the necessary funds that would have fueled the repo market the following day. Basically, their checking account was empty and their utility bill bounced.\n\nIt became apparent that ANOTHER infusion of cash was necessary to prevent the whole damn system from collapsing. *The reason being: institutions did NOT have enough excess liquidity on hand*. Financial institutions needed a fast replacement for the MBS, and J-POW had just the right thing.. $FED go BRRRRRRRRRRRRRRRRR\n\n[\\\\\"but don't say it's QE..\\\\\"](https://preview.redd.it/7mmmhqf9g9q61.png?width=1200&format=png&auto=webp&s=790466a2979a194facb57919d762cacca815a384)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***Step 2: Treasury Bonds***\n\nEver heard of the bond market? Well it's the redheaded step-brother of the STONK market.\n\nThe US government sells you a treasury bond for $1,000 and promises to pay you interest depending on how long you hold it. Might be 1%, might be 3%; might be 3 months, might be 10 years. Regardless, the point is that purchasing the US Treasury bond, in conjunction with mortgage backed securities, allowed the fed to keep pumping unlimited liquid tendies into the repo market. Surely, liquidity won't be an issue anymore, right?\n\nNow... take the repo scenario from the Lehman Brothers story, but instead of using ONLY mortgage backed securities, add in the US Treasury bond: primarily the 10-year. Note that MBS are still prevalent at 19.1% of all repo transactions, but the US Treasury bond now represents a whopping 67%.\n\nhttps://preview.redd.it/t5jkjj5bg9q61.png?width=808&format=png&auto=webp&s=8add42402770ffcb76f2cfcb56e4f28196a42e96\n\nFor now, just know that the US Treasury has replaced the MBS as the dominant source of liquidity in the repo market.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***Step 3: Palafox Trading***\n\nEver heard of Palafox Trading? Me either. It's pretty much meant to be that way.\n\nPalafox Trading is a market maker for repurchase agreements. Initially, they appear to be an innocent trading company, but their financial statements revealed a little secret:\n\nhttps://preview.redd.it/8w7uhymcg9q61.png?width=723&format=png&auto=webp&s=d2350bca6b44c8d470904525dc7dfca914cc7f7a\n\nAre you KIDDING ME?... I should have known...\n\nOF COURSE Citadel has their own private repo market..\n\nWho else is in this cesspool?!\n\nhttps://preview.redd.it/ah5775qdg9q61.png?width=360&format=png&auto=webp&s=ad4ab23bdee3739d06f4443e97da4c6172199590\n\n[I made this using the financial statement listed above, showing all beneficiaries of the GFIL](https://preview.redd.it/hhkco0ueg9q61.png?width=900&format=png&auto=webp&s=7bdb80678d270dd17990312d5024542e61a6db4a)\n\nEverything rolls into the [Citadel Global Fixed Income Master Fund](https://aum13f.com/firm/citadel-advisors-llc?view_all=fund)... This controls **$123,218,147,399** (THAT'S BILLION) in assets under management... I know offshore accounts are technically legal for hedge funds.... but when you look at the itemized holdings of these funds on Citadel's most recent [form ADV](https://reports.adviserinfo.sec.gov/reports/ADV/148826/PDF/148826.pdf), it gives me chills..\n\n[Form ADV](https://reports.adviserinfo.sec.gov/reports/ADV/148826/PDF/148826.pdf) page 105-106....\n\nhttps://preview.redd.it/ho4j0oghg9q61.png?width=664&format=png&auto=webp&s=147c10a38cfc2857b4b2691fe70f088a88e83091\n\nOk... ok.... let me get this straight....\n\n1. The repo market provides IMMEDIATE liquidity to hedge funds and other financial institutions\n2. After the MBS collapse in 2008, the US Treasury replaced it as the liquid asset of choice\n3. Citadel owns 100% of Palafox Trading which is a market maker for repo agreements\n4. This market maker provides liquidity to the Global Fixed Income Master Fund LTD (GFIL) through Citadel Advisors\n5. 80% of its $123,218,147,399 in assets under management belong to entities in the Cayman Islands\n\nOk.....I tore the [bermuda, paradise, and panama papers](https://offshoreleaks.icij.org/search?utf8=%E2%9C%93&q=citadel&e=&commit=Search) apart and found that all of these funds boil down to just a few managers, but can't pin anything on them for money laundering... However, if there EVER were a case for it, I'd be extremely suspicious of this one...\n\nThe level of shade on all this is INCREDIBLE... There should be NO ROOM for a investment pool as big as Citadel to hide this sh\\*t.... absolutely ridiculous..\n\nThe fact that there is so much foreign influence over our bond & repo market, which controls the liquidity of our country, is VERY concerning..\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***Step 4: Short-seller Endgame***\n\nAlright, I know this is a lot to take in..\n\nI've been writing this post for a week, so reading it all at one time is probably going to make your head explode.. But now we can finally start putting all of this together.\n\nOk, remember how I explained that the repo rate started to rise in '08 because **the collateral was no longer attractive compared to cash? That means there wasn't enough liquidity in the system.** Well this time the OPPOSITE effect is happening. Ever since March 2020, the short-term lending rate (repo rate) has nearly dropped to ***0.0%....***\n\n[https:\\/\\/www.newyorkfed.org\\/markets\\/treasury-repo-reference-rates](https://preview.redd.it/ui9welgkg9q61.png?width=330&format=png&auto=webp&s=fbd5b9501f7bbc386fa62e152ca2b090173692a2)\n\nSo the fed is printing free money, the repo market is lending free money, and there's basically NO difference between the collateral that's being lent and the cash that's being received.. With all this free money going around, it's no wonder why the price of the 10 year treasury has been declining.\n\nIn fact, hedge funds are SO confident that the 10 year treasury will continue to decline, that they've **SHORTED THE 10-YEAR BOND MARKET.** I'm not talking about speculative shorting, I mean shorting it to oblivion like they've shorted stocks.\n\nDon't believe me?\n\nHedge funds like Citadel Advisors must first locate the treasury bond in order to swap them for cash in the repo market. It's extremely difficult to do this with the fed because they're tied up in government BS, so they locate a lender in the market. These consist of other commercial banks and hedge funds.\n\n**NOTE: I MADE A COMMENT ABOUT BLACKROCK SUPPLYING TREASURY BONDS AND THIS IS NOT TRUE. UPON FURTHER REVIEW ( CREDIT** u/dontfightthevol **) THESE BONDS CONSIST OF MBS AND CORPORATE BONDS. WHILE THE US TREASURY DEPARTMENT IS INVOLVED, THEY ARE NOT SUPPLYING TREASURY BONDS.**\n\nSo financial institutions keep treasuries on reserve for hedgies like Citadel to short. Citadel comes along and asks for the bond, they throw it into Palafox Trading and collect their cash. So what happens when they need to pay for their repo agreement? Surely to GOD there are enough bonds floating around, right? **Not unless hedge funds like Citadel have shorted more bonds than there are available.**\n\nHere's the evidence.\n\nThere have been 3 instances over the past year where the repo rate dipped below the \"failure\" rate of -3.0%. On March 4th 2021, the repo rate hit [\\-4.25%](https://www.reuters.com/article/usa-bonds-repo/explainer-u-s-treasury-sell-off-spills-over-to-repo-market-idUSL2N2L32FR) which means that investors were willing to PAY someone **4.25%** interest to lend THEIR OWN MONEY in exchange for a 10 year treasury bond.\n\nThis is a major signal of a squeeze in the treasury market. It's MAJOR desperation to find bonds. With the federal reserve purchasing them monthly from the open market, it leaves room for a shortage when the repo call hits. If commercial banks and hedge funds haven't purchased more treasuries since first lending them out, short sellers simply cannot cover unless they go into the market and PAY the bond holder for their bond. It's literally the same story as all of the heavily shorted stocks.\n\nStill not convinced?\n\nAt the end of 2020, Palafox Trading listed **$31,257,102,000 (BILLION)** in GROSS repo agreements. **$30,576,918,000** (BILLION) were directly related to repurchasing treasury bonds....\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/m3lg8nzog9q61.png?width=726&format=png&auto=webp&s=747e1f671323227be9c0220aec18f8ec245d3cf1)\n\nBut what about their Reverse Repurchase agreements? Don't they have assets to BUY treasury bonds?SURE.. Take a look..\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/wt8fbrlrg9q61.png?width=371&format=png&auto=webp&s=72f939a98e0dc34a08b8a58e89ef68045a8e78a7)\n\nSeE tHeRe? I tOlD yOu ThEy HaD iT cOvErEd..\n\nYeaaaah... now read the fine print.\n\n[I know the totals are slightly different than the balance above, but they're both from 2020. It's just how they are presented. Check for yourself. \\(https:\\/\\/sec.report\\/CIK\\/0001284170\\)](https://preview.redd.it/5enfigytg9q61.png?width=354&format=png&auto=webp&s=ab613f3bf46064c674bce68766a90e2b2613a2ec)\n\nSo no, they don't have it covered. Why? Because our POS financial system allows for rehypothecation, that's why. It's a big fancy word for using amounts owed to you as collateral for another transaction. In the event that the party defaults, **SO DO YOU**.\n\nThis means that the securities which Palafox is waiting to receive, have ALREADY been pledged to pay off the bonds they currently OWE to someone else.\n\nDoes this sound familiar? Promising to repay something with something you don't already have? Basically you need to wait on Ted, to repay Steve, to repay Jan, to repay Mark, to repay you, so you can repay Fred, so Fred can.... Yeah, REAAAAL secure..\n\nOH, and by the way, the problem is getting WORSE.\n\nHere's Palafox's financial statements in **2018:**\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/lrtryfivg9q61.png?width=720&format=png&auto=webp&s=d850854f0fbcf0a5d701374ed5634d6eaf036919)\n\n**And 2019:**\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/zjxda0swg9q61.png?width=721&format=png&auto=webp&s=4c124bfd8b4f4a9162b2a2b65ade4b690b4dfadd)\n\nThe amount in **2020** is STILL +100% greater than 2019, AFTER netting (which is even more bullsh\\*t).\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/xjss7dzxg9q61.png?width=714&format=png&auto=webp&s=9ff71bf6631f9e665378a0f4a623a95e3aecb264)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAll of this made me wonder what the FICC's balance is for treasury deposits... For those of you that don't know, the FICC is a branch of the DTCC that deals with government securities.\n\nJust like the updated DTC rule for supplemental liquidity deposits being calculated throughout the day, the FICC also calculates this amount as it relates to treasury securities multiple times throughout the day.\n\nWould you be surprised that the FICC has $47,000,000,000 (BILLION) just in DEPOSITS for unsettled treasury bonds? **$47,000,000,000!?!?!?**\n\n**CAN YOU IMAGINE HOW ASTRONOMICAL THE ACTUAL MARGIN MUST BE?!**\n\nhttps://preview.redd.it/zrkpzdb1h9q61.png?width=710&format=png&auto=webp&s=64f6b10aca2566bcf9b5d560967af3715104b839\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThere is TOO much evidence, from TOO many separate events, pointing to the imminent default of something big. That's all this is going to take. When Ted can't repay Steve, it means the panic has already started. Just look at how easy it was for the repo rate to spike overnight in 2019..\n\nWe are already starting to see the consequences of the SLR update with Archegos, Nomura, and Credit Suisse. This is just a taste of what's to come.. and now we know the bond market represents an even BIGGER catalyst in triggering this event.. and it's happening already.\n\nWith that being said, things finally started to make sense... Citadel doesn't NEED shares if their investment strategy to go short on EVERYTHING instead of going long. Why bother owning shares? Financial institutions and other asset managers simply lend them to you when you need to pony up a margin call for stocks and bonds..\n\nTheir HFT systems allow them to manipulate the market in their favor so there's NO way they could fail.... unless.... a bunch of degenerates all decided to ignore taking profits...\n\nBut that would NEVER happen, right?\n\n...wrong...\n\nwe just like the stonks\n\nDIAMOND.F\\*CKING.HANDS\n\n***This is not financial advice***",
    "title": "The EVERYTHING Short",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/"
}