{
    "author": "Ren3666",
    "created_utc": 1628520002.0,
    "distinguished": null,
    "edited": 1628526056.0,
    "id": "p12rlf",
    "text_only": true,
    "flair_text": "Unreviewed 𝘋𝘋",
    "name": "t3_p12rlf",
    "num_comments": 46,
    "permalink": "/r/DDintoGME/comments/p12rlf/financial_authorities_janet_yellen_and_gme/",
    "score": 514,
    "selftext": "First of all I wanna apologize, I have a real flaw and that is writing about stuff without considering the  other side. Expecting others to understand how I understand it, and not leading up to the conclusion through each step. That´s why I took some time to process all the data and referenced each source, so that everyone can follow along. And now without further delay, let the Ape begin.\n\nCitadel has lobbied the Treasury Department, House and Senate since 2008, according to     disclosures filed with Congress, but first some roadwork.\n\n[Disclosures filed with Congress – Client Citadel (Source)](https://lda.senate.gov/filings/public/filing/search/?registrant=&registrant_country=&registrant_ppb_country=&client=citadel+llc&client_state=&client_country=&client_ppb_country=&lobbyist=&lobbyist_covered_position=&lobbyist_conviction_disclosure=&lobbyist_conviction_date_range_from=&lobbyist_conviction_date_range_to=&report_period=&report_year=&report_dt_posted_from=&report_dt_posted_to=&report_amount_reported_min=&report_amount_reported_max=&report_issue_area_description=&report_government_entity=41&affiliated_organization=&affiliated_organization_country=&foreign_entity=&foreign_entity_country=&foreign_entity_ppb_country=&foreign_entity_ownership_percentage_min=&foreign_entity_ownership_percentage_max=&search=search)\n\nWhat is even lobbying?\n\n“In politics, lobbying, persuasion, or interest representation is the act of lawfully attempting to influence the actions, policies, or decisions of government officials, most often legislators or members  of regulatory  agencies. Lobbying, which usually involves direct, face-to-face  contact, is done by many types of people, associations and  organized groups, including individuals in the private sector, corporations, fellow legislators or government officials, or advocacy groups (interest groups).\n\n**Professional  lobbyists are people whose business is trying to influence legislation,  regulation, or other government decisions, actions, or policies on behalf of a group or individual who hires them.**\n\n**The ethics and morals involved with legally bribing or lobbying are  complicated. Lobbying can, at times, be spoken of with contempt, when  the implication is that people with inordinate socioeconomic power are corrupting the law in order to serve their own interests. When people who have a duty to act on behalf of others, such as elected officials with a duty to serve their constituents' interests or more broadly the  public good, can benefit by shaping the law to serve the interests of some private parties, a conflict of interest exists.**\n\n**The failure of government officials to serve the public interest as a consequence of lobbying by special interests who provide benefits to the  official is an example of agent misdirection. That is why lobbying is  seen as one of the causes of a democratic deficit.”**\n\nOr so Wikipedia says.\n\n[https://en.wikipedia.org/wiki/Lobbying](https://en.wikipedia.org/wiki/Lobbying)\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nJonathan Talisman - If you spoilered yourself with the Disclosures Files already  this guy should have come up as early as 21.07.2008 and continue to show up consecutively till 20.01.2021 on the payroll list of Citadel and is the Assistant Treasury Secretary for Tax Policy\n\n[https://lda.senate.gov/filings/public/filing/e743c4f3-d159-4386-ac72-f6e4d8983c42/print/](https://lda.senate.gov/filings/public/filing/e743c4f3-d159-4386-ac72-f6e4d8983c42/print/)\n\n[https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/](https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/)\n\nBut who is Jonathan Talisman even? Citadel wouldn´t even bother with a no-name, paying him for 13 consecutive years, so we should clearly find him on Wikipedia if we search, right?\n\nNope.\n\nBut if we dig deeper we can find some of his résumé on Georgetown law´s website:\n\n“Jonathan  Talisman is a founding partner of Capitol Tax Partners. Previously, he served as the Assistant Secretary for Tax Policy for the U.S. Treasury Department during the Clinton Administration.In that capacity, he had **supervisory  responsibility at Treasury for policy decisions relating to all Federal tax matters, and directly advised the President, the Secretary   of the Treasury and other senior Administration officials on matters of   tax   policy and tax legislative strategy.**\n\nMr. Talisman previously had served at Treasury as the Deputy Assistant  Secretary for Tax Policy and the Tax Legislative Counsel. Before joining  the Treasury Department, Mr. Talisman served as the Chief Minority Tax Counsel of the Senate Finance Committee and as Legislation Counsel  to  the Joint Committee on Taxation.**In his various roles, Mr. Talisman was significantly involved in all major tax legislation**, including the Omnibus Budget Reconciliation Act of 1993, the Small  Business Job Protection Act of 1996, and the Taxpayer Relief Act of 1997. Prior to his tenure in government, Mr. Talisman worked in the  Washington office of Akin, Gump, Strauss, Hauer & Feld from 1984 to 1992, where he specialized in transactional tax planning.\n\n**He currently serves on the Board of Advisors to the Tax Policy Center and was recently chair of the Formation of Tax Policy Committee, AmericanBar Association Tax Section.”**\n\n[https://www.law.georgetown.edu/faculty/jonathan-talisman/](https://www.law.georgetown.edu/faculty/jonathan-talisman/)\n\nhttps://preview.redd.it/k2izaocrecg71.jpg?width=1652&format=pjpg&auto=webp&s=3c3956e7b1b0f789cb1b09087023a94d8a265434\n\n[https://www.opensecrets.org/federal-lobbying/lobbyists/summary?cycle=2021&id=Y0000020432L](https://www.opensecrets.org/federal-lobbying/lobbyists/summary?cycle=2021&id=Y0000020432L)\n\nSounds pretty weak, I mean he does not even have a Wikipedia article compared to DeepFuckingValue (Keith Gill)\n\n[https://en.wikipedia.org/wiki/Keith\\_Gill\\_(investor)](https://en.wikipedia.org/wiki/Keith_Gill_(investor))\n\nNah that can´t be, right?\n\n[https://en.wikipedia.org/w/index.php?search=Jonathan+Talisman&title=Special%3ASearch&go=Go&ns0=1](https://en.wikipedia.org/w/index.php?search=Jonathan+Talisman&title=Special%3ASearch&go=Go&ns0=1)\n\nMaybe if I short his name, being all buddy, like Georgetown does it works.\n\n[https://en.wikipedia.org/w/index.php?search=Jon+Talisman&title=Special:Search&profile=advanced&fulltext=1&advancedSearch-current=%7B%7D&ns0=1](https://en.wikipedia.org/w/index.php?search=Jon+Talisman&title=Special:Search&profile=advanced&fulltext=1&advancedSearch-current=%7B%7D&ns0=1)\n\nNope.\n\nAnyways we will backtrack on this. Off to another one whose bank account is just as frequented by Citadel.\n\nJoseph Mikrut - Same as Jonathan this person also appears first in  21.07.2008´s report, with a short break in 21.04.2014, until he appears in 21.07.2014´s again, where he is reported to cover 3 Official  Positions:\n\n\\*Treasury Dept: Asst. Secretary Tax Policy\\*Tax Legislative Counsel - US Treasury, (acting)\\*Tax   Legislative Counsel, JCT: Associate Deputy Chief of Staff\n\ntill the 20.01.2016 report, after which he vanishes completely from the payroll of Citadel.This is quite lengthy, but I hope you are still with me, even I am drooling.\n\nJoseph Mikrut or as Goergetown calls him, Joe Mikrut.“**Has extensive experience in tax legislative and regulatory policy.** He joined Capitol Tax Partners, the largest **independent lobbying**  (ye right independent…) and consulting firm specializing in tax  policy in Washington, D.C., as a partner in September 2001, soon after the firm’s formation.From 1998 to 2001, Mr. Mikrut served as the Tax Legislative Counsel for the U.S. Treasury Department.\n\n**He had direct responsibility at Treasury for policy decisions relating to all domestic Federal tax matters**,  including the President’s budget proposals, other legislation, regulatory guidance, and Treasury reports.Mr. Mikrut oversaw the  completion of over 300 guidance projects during his tenure.At the  request of the incoming Bush Administration, Mr. Mikrut served as the  Acting Assistant Secretary for Tax Policy during the transition  period.Before serving as Treasury’s Tax Legislative Counsel, Mr. Mikrut  served for ten years on the staff of the Joint Committee on Taxation,  first as Legislation Counsel and later as the Associate Deputy Chief of  Staff.\n\n**In that capacity, Mr. Mikrut developed and analyzed legislative proposals, helped in drafting  bill language, and wrote tax legislative history.He was extensively involved in all major tax legislation from 1988 through 1998.**\n\nPreviously,  Mr. Mikrut was a Tax  Manager for Arthur  Andersen & Co. in Chicago where he focused on  corporate and  utility tax matters. He also served  as an adjunct professor at DePaul University.Mr. Mikrut has testified  before  Congress and the IRS on  numerous occasions and has spoken  frequently  to business and legal  groups.He is the past chairman of the  Formation  of Tax Policy Committee, American Bar Association Tax Section and a member of the Steering   Committee, Federal Bar  Association Tax Section.  Mr. Mikrut holds a J.D. from DePaul  University College of Law, and a  B.S. in Accountancy from the  University of Illinois. He is a certified public accountant.“\n\n[https://www.law.georgetown.edu/faculty/joseph-mikrut/](https://www.law.georgetown.edu/faculty/joseph-mikrut/)\n\nI hope you just believe me at this point, that even Joe has no Wikipedia article.\n\n**But after 20.10.2014** most of the lobbied **were dropped by Citadel**, aside from you guessed it Jonathan Talisman & Joseph Mikrut, who was later **likely** switched by William Davis, but that remains to be seen.\n\n=> Legislative and regulatory services relating to tax treatment of investment partnerships and financial products, including issues  regarding the Administration's Fiscal Year Revenue Proposals, tax reform (including Ways and Means Chairman's Discussion Draft on Comprehensive Tax Reform), and guidance relating to dividend equivalent payments.\n\n[https://lda.senate.gov/filings/public/filing/371ec54f-ac17-41d5-8db4-9be5b043afba/print/](https://lda.senate.gov/filings/public/filing/371ec54f-ac17-41d5-8db4-9be5b043afba/print/)\n\nAnd lastly William Davis, Legislative Director and Tax Policy Counsel, Rep. Tom Reed, taking over for Joseph Mikrut in 22.10.2018, remaining the sole lobbied next to Jonathan Talisman consecutively on every report  thereafter until the 20.01.2021.\n\n[https://lda.senate.gov/filings/public/filing/a0f34537-eaec-43ad-9bfc-91fb9af89021/print/](https://lda.senate.gov/filings/public/filing/a0f34537-eaec-43ad-9bfc-91fb9af89021/print/)\n\n(22.10.2018)\n\n[https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/](https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/)\n\n(20.01.2021)\n\n**You can skip this, but I guess you get the gist of it:**\n\nWilliam Davis leverages his **diverse experience in tax policy, government, and journalism** to provide a unique perspective to clients, with a specific expertise in tax policy issues affecting the financial services and  energy sectors. Through his experiences, William has developed an **extensive network of tax professionals working in both the government and private sector.**\n\nBefore  joining Capitol Tax Partners, William served as the Legislative  Director and Tax Policy Counsel for Rep. Tom Reed (R-NY) of the House  Ways and Means Committee. During his time on the Hill, he advised the  Congressman on all tax legislation, including the development, drafting, and negotiation of the *Tax Cuts and Jobs Act of 2017* and the *Omnibus Bipartisan Budget Act of 2018*.\n\nAs part of those efforts, William worked extensively on tax legislative  proposals relating to financial products and energy tax credits. He  also served as a lead policy staffer for the House Manufacturing Caucus  and Problem Solvers Caucus.\n\nBefore  working for Congress, William was as a legal reporter for Tax Analysts,  where he wrote for the award-winning Tax Notes and Tax Notes Today  publications. As a legal reporter, he wrote over 200 daily and long-term  analysis stories on technical tax issues mostly relating to the financial services industry, tax controversy, and IRS administration.\n\nWilliam earned his LLM in taxation from Georgetown University Law Center and his JD from Suffolk University Law School.\n\n[https://www.capitoltax.com/will-davis](https://www.capitoltax.com/will-davis)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nSo now we know that all work(ed) at Capitol Tax Partners, what about it? I don´t see a connection to Janet Yellen.\n\nLobbied actions:\n\n\\- Legislative and **regulatory services relating to tax treatment of investment partnerships** and financial products, **including** issues relating to **Tax Cuts & Jobs Act**. (20.01.2021)\n\n[https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/](https://lda.senate.gov/filings/public/filing/e95bb6d8-98de-4f98-b3bb-30f5a453ea05/print/)\n\nhttps://preview.redd.it/ub53h98dfcg71.jpg?width=1708&format=pjpg&auto=webp&s=408a6f38f32477ffdf61a0d33fb18219bec4dd02\n\nhttps://preview.redd.it/c4bgyukefcg71.jpg?width=1005&format=pjpg&auto=webp&s=d3a89d56b17e37fb6a06335fb0bdd8f7754fc902\n\nRefer to another DD of mine for more info why this may signal a mass sell-off of securities (a market  crash) and notice that the 15th January is important\n\n[https://www.reddit.com/r/GME/comments/lshpuj/25th\\_feb\\_breaking\\_news\\_sec\\_reduces\\_fee\\_for/](https://www.reddit.com/r/GME/comments/lshpuj/25th_feb_breaking_news_sec_reduces_fee_for/)\n\n**Hmmm, weird how Citadel requested help from Jonathan Talisman just before GME spiked - anyways.**\n\n\\- Legislative and regulatory services relating to tax treatment of  investment partnerships and financial products, including issues  relating to **Tax Cuts & Jobs Act**. (20.10.2020)\n\n[https://lda.senate.gov/filings/public/filing/ef0880d3-fba1-45e8-a321-af69ffcadb79/print/](https://lda.senate.gov/filings/public/filing/ef0880d3-fba1-45e8-a321-af69ffcadb79/print/)\n\nhttps://preview.redd.it/d8hsjbxifcg71.jpg?width=1710&format=pjpg&auto=webp&s=612d1fb77da2e10f02e7e1c6b3f037328a25c3f6\n\n\\- Legislative and regulatory services relating to tax treatment of investment partnerships and financial  products, including issues relating to Tax Cuts & Jobs Act. (20.07.20)\n\n[https://lda.senate.gov/filings/public/filing/556a69c9-fdbc-43a0-9d6d-61cc43b21d9e/print/](https://lda.senate.gov/filings/public/filing/556a69c9-fdbc-43a0-9d6d-61cc43b21d9e/print/)\n\n\\- Legislative and regulatory services relating to tax treatment of  investment partnerships and financial products, including issues regarding the Administration's Fiscal Year Revenue Proposals, tax reform  (including Ways and Means Chairman's Discussion Draft on  Comprehensive Tax Reform), and guidance relating to dividend equivalent payments. (20.10.2014)\n\n[https://lda.senate.gov/filings/public/filing/371ec54f-ac17-41d5-8db4-9be5b043afba/print/](https://lda.senate.gov/filings/public/filing/371ec54f-ac17-41d5-8db4-9be5b043afba/print/)\n\n\\- Legislative and regulatory services relating to tax treatment of  investment partnerships and capital gains, including H.R. 598, The American Recovery And Reinvestment Tax Act of 2009;\" H.R. 1 The  \"American Recovery and Reinvestment Act of 2009;\" S. 350, \"American Recovery and Reinvestment Act of 2009;\" and H.R. 1935. (20.04.2009)\n\n[https://lda.senate.gov/filings/public/filing/488fdd3c-bf5b-4846-a892-623c654d6ee6/print/](https://lda.senate.gov/filings/public/filing/488fdd3c-bf5b-4846-a892-623c654d6ee6/print/)\n\n\\- Legislative and regulatory services relating to tax treatment of partnerships and capital gains, including H.R. 6049, Energy and Tax Extenders Act of 2008; S.3098, Alternative Minimum Tax and Extenders Tax  Relief Act of 2008 and H.R. 6275, Alternative Minimum Tax Relief Act of 2008; S.3125, the Energy Independence and Tax Relief Act of 2008;  H.R. 1424, the Emergency Economic Stabilization Act of 2008; H.R. 7060, the Renewable Energy and Job Creation Act of 2008. (20.10.2008)\n\n[https://lda.senate.gov/filings/public/filing/bf135551-764f-4d3b-bc15-aed14089883f/print/](https://lda.senate.gov/filings/public/filing/bf135551-764f-4d3b-bc15-aed14089883f/print/)\n\nWell…I hope you are not dead yet and the few pictures got you excited, so please hodl.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nLet´s continue with Janet Yellen and her position as **Secretary  of the Treasury, since many do not know that the SEC is also involved  with her, including several other financial authorities:**\n\nIn 1988 Executive Order 12631 established the President's Working Group on Financial Markets.\n\nThe **Working Group** is chaired by the **Secretary of the Treasury** and includes the **Chairman of the SEC**, the **Chairman of the Federal Reserve**  and the Chairman of the Commodity Futures Trading Commission. The goal of the Working Group is to enhance the integrity, efficiency, orderliness, and competitiveness of the financial markets while maintaining investor confidence.\n\n[https://en.wikipedia.org/wiki/U.S.\\_Securities\\_and\\_Exchange\\_Commission](https://en.wikipedia.org/wiki/U.S._Securities_and_Exchange_Commission)\n\nJanet  Yellen was 19th Vice Chair of the Federal Reserve from October 4,  2010 – February 3, 2014.\n\nThe 15th Chair of the Federal Reserve from February  3, 2014 – February 3, 2018\n\nAnd now United States Secretary of the Treasury Incumbent Assumed office January 26, 2021\n\nSource: [https://en.wikipedia.org/wiki/Janet\\_Yellen](https://en.wikipedia.org/wiki/Janet_Yellen)\n\nIn other words she just switched the sides at the same the table.\n\nhttps://preview.redd.it/4p32w0fzfcg71.jpg?width=674&format=pjpg&auto=webp&s=78bc087c25268841f43673b93e9c5da9e05b40b1\n\nhttps://preview.redd.it/kbplpxb0gcg71.jpg?width=666&format=pjpg&auto=webp&s=ee3fafacf4acf979e9c23f7be9aa43026c4f7f54\n\n\\*\\*Section 6 - Janet Yellen received around 810,000$ in speaking fees from Citadel\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nSo now what, Yellen received an Ethics Waiver\n\n[https://dailycaller.com/2021/02/03/janet-yellen-ethics-waiver-gamestop/](https://dailycaller.com/2021/02/03/janet-yellen-ethics-waiver-gamestop/)\n\nBut what is an Ethics Waiver?\n\nThe Office of Government Ethics (OGE) prohibits members of the executive branch from working with previous colleagues or **clients** who **might benefit** **from their nearness to White House authority**. It's a recognition of the unique power wielded by those who work in close proximity to the presidency and its outsized influence on government regulation.\n\nHowever, **the White House can choose to issue an ethics waiver**, which unburdens administration officials from these constraints, **which she in this case personally requested.**\n\nAnd if that sounds like a potential **minefield of conflicts of interest**, the reason is simple: It is.\n\n[https://www.bustle.com/p/what-is-ethics-waiver-steve-bannon-kellyanne-conway-have-one-61565](https://www.bustle.com/p/what-is-ethics-waiver-steve-bannon-kellyanne-conway-have-one-61565)\n\nNow then to the juicy part.“Ethics Waiver” sounds negative, especially when paired with politicians, but “receiving” somewhat sounds positive, so who benefits from this?\n\nAs it implies, this is actually a trade-off. Something in-between, because Yellen now is **restricted from engaging** **with Citadel in a “Covered Relationship (a customer relationship)”** **for 1 year** after her last speech, which was the **27.10.2020, but also allowed to engage with said entities after it without repercussion.**\n\n[List of Speaking Fees including Dates](https://www.swfinstitute.org/news/83524/janet-yellens-speaking-fees-and-income)\n\nHmmm Secretary of Treasury, Fed, Citadel,… **Jonathan Talisman!!**\n\nWhat I am trying to say is that Citadel essentially did with the SEC, the  Secretary of Treasury and the Fed what it did with GME and that the link between Janet Yellen and Citadel has not been cut yet.**Citadel basically backdoored**  their way through their ETF Jonathan Talisman aka XRT, hiding their  connections since 2008 to get legislations passed in favor of him, who is the very advisor of several financial authorities from the SEC up  to the President.\n\n**Please be aware that this is still speculation**. Just because the dates are somewhat adding up are no evidence yet. It just leaves concerns and may explain the biased narrative, enactment or   better... absence of scrutiny regarding Robinhood, Melvin Capital  and Citadel through the SEC and Janet Yellen.\n\nEven though financial authorities were already known to disregard any input dating back as far as 2008 regarding naked short sales with over 5.000 dismissed cases.\n\nhttps://preview.redd.it/0bzpv2eigcg71.jpg?width=751&format=pjpg&auto=webp&s=4eaa86bdffba35ae735122d9b4a8607f0638745b\n\n[Link to the official pleading from 2008](https://www.sec.gov/files/450.pdf)\n\nThis is just the cherry on the ice.\n\n**Last word:** [So how does that affect GME? Good question from u/Stuffguy10](https://www.reddit.com/r/GME/comments/lutpdt/financial_authorities_and_gme_01032021/gp9lgde?utm_source=share&utm_medium=web2x&context=3)\n\nGood and bad. Good because as you can see above, not only did Citadel use  Mr. Talisman's service several times, but he used them two times for the  very same reason\n\nLegislative and  regulatory services relating to tax treatment of investment partnerships and financial products, including issues relating to **Tax Cuts & Jobs Act**. (20.01.2021)\n\nLegislative  and regulatory services relating to tax treatment of investment  partnerships and financial products, including issues relating to **Tax Cuts & Jobs Act**. (20.10.2020)\n\nTo cut taxes and jobs, **likely hinting at severe losses and intentions to cover** them.\n\nThe  bad thing is that the announcement of the SEC press release was  probably drafted with Mr. Talisman and may be aiding Citadel.\n\nNow the best part from my understanding, **this Draft reducing the fee from 22,10$ to 5,10$** is close to a **letter of resignation**, because the very same people who are lobbied by Citadel including Mr. Talisman had no other way to aid them.\n\nAnd  if aiding means making it easier to mass sell-off securities, well then   a market crash becomes likelier, but so does Citadel paying their bill  for the very reason he got into this position. **Because of shorting GME.**\n\nSide-Note: In case some had a Déjà vu, my previous post ended up being filtered by Reddit, hence I reposted it.\n\n[https://www.reddit.com/r/GME/comments/lutpdt/financial\\_authorities\\_and\\_gme\\_01032021/](https://www.reddit.com/r/GME/comments/lutpdt/financial_authorities_and_gme_01032021/)\n\nhttps://preview.redd.it/lwrk51ehgcg71.jpg?width=928&format=pjpg&auto=webp&s=b21e0c8b0e45a1cfa218ec7c8ef3170aa2285f7c",
    "title": "Financial Authorities, Janet Yellen and GME (09.08.2021)",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/p12rlf/financial_authorities_janet_yellen_and_gme/"
}