{
    "author": "jsmar18",
    "created_utc": 1617372870.0,
    "distinguished": null,
    "edited": 1617441399.0,
    "id": "mil875",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mil875",
    "num_comments": 1454,
    "permalink": "/r/GME/comments/mil875/michael_burry_handed_us_the_missing_piece_on_a/",
    "score": 15154,
    "selftext": "Alright, this took a long time to write, and was all thanks to Michael Burry (MB) linking [this](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm) in his profile, then mysteriously removing it less than a day later. This post will have a lot of parallels to [the EVERYTHING short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/). \n\nHOWEVER, it's closer to a debunking post and goes into much more depth as it’s necessary to understand the full picture when we start to analyse the link MB provided.\n\nAlrighty then, hold on for a big read. You’ll feel educated af after reading this as u/atobitt did an amazing job turning his DD into monke speak. Let's get a better understanding of the concepts first.\n\n**(Note, I do not agree with the hypotheses drawn in** ***\"the EVERYTHING short\"*** **if that's not clear already).**\n\n# WTF is a Repo and Reverse Repo?\n\n&#x200B;\n\n[Visualisation of how repos work](https://preview.redd.it/d0reff3wnrq61.png?width=573&format=png&auto=webp&s=519bb6f2e833f064f79fddf7a004a7a9834393ff)\n\nThis visualisation is saying that repos and reverse are the same transactions, but titled differently based on which side of the transaction you’re on.\n\nIf you’re originally selling the security (and agreeing to repurchase it in the future) this is a repurchase agreement (*“Repo”*). On the flip side, for the party originally buying the security (and agreeing to sell in the future) it is a reverse purchase agreement (*“Reverso Repo”*).\n\nThe key thing here that we need to understand, is how the Federal Reserve  uses repo and reverse repo agreements. **This is important, please pay attention here.**\n\n**How the Federal Reserve Uses Repos/Rev Repos**\n\nIn the US, repo and reverse repo agreements are the most commonly used instruments of open market operations for the [Federal Reserve](https://www.newyorkfed.org/markets/rrp_faq.html).\n\nAs u/atobitt puts it, the Fed goes BRRRR. To put this into reverse ape talk, they are boosting the overall money supply by buying back Treasury bonds or other government debt instruments. This infuses the banks with cash and increases its cash reserves in the short term. The Fed then will then resell the securities back to the bank.\n\nIn summary, when the Fed wants to tighten the money supply - they can simply remove money from the cash flow using repos (selling bonds back to the banks). They want to go BRRRRR and [increase supply](https://www.newyorkfed.org/markets/rrp_faq.html)? Use a reverse repo later to buy back the bonds returning money into the system.\n\nGreat, we have a foundational understanding of how **liquidity** works through use of repos and reverse repos.\n\nThe next thing we need to understand is:\n\n1. The financial panic that hit before the GFC in September 2008\n2. Why this is different to the spikes we have been seeing in repo rates since 2019\n3. How this relates back to Michael Burry updating his twitter profile linking [this](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm) and then removing it a day later from his profile\n\n&#x200B;\n\nhttps://preview.redd.it/hshofz81orq61.png?width=298&format=png&auto=webp&s=9e43be1e1156033103a0a2601806b44440d84b91\n\n# The Crisis that Lead to a Crisis\n\nMany people may be surprised to learn, but there was a financial panic that occurred just before the GFC in 2008 and that was the bailout of [Bear Stearns](https://www.aei.org/articles/the-bear-stearns-bailout-didnt-avert-the-financial-crisis-it-was-the-crisis/) in March 2008. The story started a little early than this in 2007/2008.\n\nThis financial panic of this period stemmed from our beloved repo market.In some [analysis done by NBER ](https://www.nber.org/papers/w15223)\\- they argue that securities created from loans that originated in the now famous “subprime mortgage market” played a major role in inciting this panic.\n\nBUT\n\nThat it’s ultimately the loss of liquidity at the firms that were the biggest players that led to the financial crisis.\n\nTo surmise their words without going into the details listed [here](https://www.nber.org/digest/dec09/repo-market-and-start-financial-crisis):\n\n* Housing market started to weaken early 2007\n* Repo market which was made up of securitized bonds (often made up of mortgages)\n* Repo market buyers then started having a mini freak out worrying about the quality of the securitized assets in the bonds\n* Repo market buyers also started to have a mini freakout about haircuts increasing (difference between the deposit and the value of an asset in a repo, the deposit is generally lower)\n\nBanks would then raised capital by issuing new securities, didn’t work thanks to real estate continuing to slump.\n\nGot made worse by forced selling of underlying collateral, which then turned into a cycle of declining asset values increasing these “haircuts” further.\n\n**This leads us to the most important point.**\n\nDue to this cycle above, lenders were saying FUCK NO to providing short term financing and repo haircuts jumped further, which is in equal part the equivalent of saying massive withdrawals from the banking system.\n\n\\*cough\\* [fractional reserve banking](https://www.investopedia.com/terms/f/fractionalreservebanking.asp) \\*cough\\*\n\n**So what does this all imply?**\n\n**This sequence of events fucked with the securitised banking cycle, which to everyone's dismay needs to run without interruption.**\n\n**Monke Speak: If you get a kink somewhere along a hose, water (liquidity) dries up.**\n\nI’ll stop here, but TL;DR for the rest of the story is that the kink becomes a knot and contagion spreads further (to other securities), eventually resulting in Bear Stearns being rescued and later the collapse of Lehman Brothers and some big bailouts = GFC of 2008. Note, in this [post ](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)u/atobitt describes Lehman Brothers relationship with repo agreements, this whole “chapter” is discussing the crisis which caused the crisis.\n\nThe main point to takeaway out of all of this, is how reliant the system was/is on liquidity back in pre GFC times. Has this changed? Let’s find out.\n\n# Fuck your Efficient Market Hypothesis\n\nThanks again to u/atobitt for the screenshots. The below is a more in-depth explanation of what u/atobitt went into, which will provide important context for later.\n\n&#x200B;\n\n[Thanks u\\/atobitt for these.](https://preview.redd.it/tq7zu2c8orq61.png?width=1122&format=png&auto=webp&s=dd9d17788ecd02f9221470de9b1cee4104fbb16b)\n\nThere was a great case study done on this, and I value it thanks to the invaluable quotes from [market participants](https://www.ardea.com.au/repo-dislocations-a-case-study-in-market-inefficiency/#:~:text=The%20freezing%2Dup%20of%20repo,Financial%20Crisis%20(GFC).%E2%80%9D&text=The%20repo%20market%20is%20an,of%20the%20global%20financial%20system). For a more dry read, head on over to this [federal reserve link](https://www.federalreserve.gov/econres/notes/feds-notes/what-happened-in-money-markets-in-september-2019-20200227.htm#:~:text=In%20the%20repo%20market%2C%20there,supply%20mismatch%20in%20the%20market) however.\n\n**What went wrong?**\n\nPretty obvious here, repo rates spiking to \\~6.5% then again to 10% a year later. As you likely know, this is absurdly high. We can expect some volatility at key quarter or year end reporting periods - but holy wow - not this level of volatility.\n\n**Why did repo rates spike?**\n\nThe main reason is thanks to the Federal Reserve doing themselves a dirty. They introduced a bunch of regulations after the GFC so make sure stuff like this would not happen again. In late 2017, they started scaling down its quantitative easing (QE).\n\nRemember how we \\*coughed\\* about [fractional reserve banking](https://www.investopedia.com/terms/f/fractionalreservebanking.asp)? This is where it rears it’s ugly little head again, but in a different manner.\n\nUs apes get paychecks, we dump our paychecks into our bank accounts to facilitate things like rent, mortgage repayments, food etc… This is the same case for the banks, except their deposits are chilling with the Fed in a special bank account known as *“bank reserves”*. These bank reserves have requirements on how much money is required at a minimum to be sitting in there. This is the minimum reserve requirement and anything they hold ontop of this is their excess reserves.\n\nThere’s a bunch of economic implications these reserves have, but the thing we want to focus on is the QE program implemented after the 2008 GFC in relation to **increasing the amount of excess reserve in banking systems.**\n\nThe side effect of this type of program means a banks excess reserves are not really excess anymore as they need to be increased to meet regulatory constraints. **This is the main reason why we saw a spike in the repo rate in the above chart.**\n\n&#x200B;\n\n[Never actually seen this movie](https://preview.redd.it/2w73gsnborq61.png?width=766&format=png&auto=webp&s=1347dfa5b09c1376cdeb146964b25df1ce9353ed)\n\nHop on in kids, let’s head back to pre-GFC times.\n\nAnother way of looking at the repo rate is from a demand perspective, naturally you’d expect a rate to **increase as supply remains the same but the demand increases**.\n\nBack in the pre GFC times, when this **demand** for funding increases in the repo market, banks with excess reserves can quickly increase their lending capacity to take advantage of the higher rates. They used their excess reserves to increase the **supply** which means they can essentially get a grip on the rate to smooth it out.\n\n# Data Time | Back to the Recent Past\n\nNow, moving forward in time to the recent past, we’re post GFC and there are new rules for the banks. They need to start holding a minimum amount of high quality liquid assets (HQLA) on their balance sheets. Bonds classify as HQLA, but the “excess reserves” are more efficient.\n\nIn the image below, we have two charts. The top showing total reserves (excess reserves are a component of this) and the bottom showing our overnight repo rate we’re all familiar with.\n\n1. The Fed starts scaling back QE in late 2017 (they stopped buying bonds from the banks)\n2. This meant the Fed stops crediting the banks excess reserves (the slow reduction in total reserves in the top chart)\n3. Reduction in supply (reserves dropping from 2.) means repo rate starts to increase\n4. Demand for repo funding increased in September, but due to frictions like HQLA it prevented banks from “smoothing out” the rate\n5. BOOM overnight repo rate spikes to 10% in late 2019.\n\n&#x200B;\n\nhttps://preview.redd.it/0ew01hlhorq61.png?width=551&format=png&auto=webp&s=8f07792b1eafb4b9fd95a666bfba88791b4f3723\n\nEveryone and their mothers at the Fed would have shit themselves that day. The funny thing is that JPMorgen CEO [said](https://www.bloomberg.com/news/articles/2019-10-15/jpmorgan-felt-barred-from-calming-repo-market-by-regulations) that they could have prevented this from happening, but were stopped thanks to regulations such as the HQLA.\n\nSo what does the Fed decide to do next? Fed goes BRRR.\n\nThe effective [federal funds rate](https://www.investopedia.com/terms/f/federalfundsrate.asp) below is the rate at which commercial banks can borrow and lend their excess reserves to each other overnight.\n\n[BRRRRRR](https://preview.redd.it/o69kymakorq61.png?width=793&format=png&auto=webp&s=a8f1f1e54d135e4bc8bc84cb936879fcf6f4123e)\n\nTo delve into a little deeper why higher reserves mean a more stable rate, what we’re really saying is that banks can turn a profit from pricing inefficiencies in the market. If they did not have the HQLA restriction as on example, they may have been able to shift assets around on their balance sheet when they see the repo rate start to creep higher to make a nice dime off it.\n\nThis is very much how the world worked pre GFC, and you can see the Fed have essentially created a kink in the hose themselves which caused this volatility thanks to liquidity issues once more.\n\nSo, that’s essentially a long winded explanation of u/atobitt’s post that goes into a bit more detail and has a focus on the liquidity aspect. I’ll also end this section with the following.\n\n*“Liquidity, like the plumbing in your house, gets little attention until something goes wrong …”*\n\n**Edit** u/UserID_3425 linked me fed announcment:\n\n[Federal reserves in response to COVID](https://www.federalreserve.gov/monetarypolicy/reservereq.htm) dropped reserve requirements to 0%.\n\nIt was after they changed this rule they decided to drop fed rates (thanks COVID...) which caused the above reserves to further skyrocket as they injected $500B into the repo market. (Their last lever essentially)\n\n# Collateral Chains\n\nAlright, back to Michael Burry. He put a link in his profile for about a day, maybe less then removed it again.\n\n&#x200B;\n\n[He trying to tell us something... but what?](https://preview.redd.it/5z91e19norq61.png?width=298&format=png&auto=webp&s=92790b3d797c6e9b96c0289361948f0cde24ee0d)\n\nWhy did he link this and what’s in it? Why is the timing so convenient? Alot of what’s discussed in the linked federal reserve notes is scarily similar to what u/atobitt was touching on. It’s all about the circulation of collateral, so let’s dig into it.\n\n**“Collateral”.** We got an intro to this above in regards to repos - it refers to an asset that a lender accepts on security for a loan. Collateral can be really handy, it can be used quickly to raise funds (repos as an example) or to things like satisfying margin requirements.\n\nBUT they can also be re-used e.g. A HF gives securities as collateral to their broker and then the broker can use this collateral sources securities in order to sell them (shorting 😉)\n\n**“Collateral Chains”.** Collateral re-use sounds shady af i hear you say?\n\nWell, yes - all this free circulation of collateral comes at the cost of increased interconnectedness and contributes to the fragility in financial markets by increasing the confusion about WHO THE FUCK HOLDS THE COLLATERAL and WHO THE FUCK RETURNS THE IT.\n\nThis is our collateral chain. That’s referred to in the paper and it propagates uncertainty and amplifies fragility in times of market stress.\n\n~~The screenshots showing Palafox increasing their repo and reverse repo start to make a lot of sense now.~~\n\nThey still make sense, but everyone in the industry is likely behaving similar to this.\n\n**Repo agreements highlighted in 2018:**\n\n&#x200B;\n\nhttps://preview.redd.it/o2id7xjrorq61.png?width=785&format=png&auto=webp&s=9b99c7703f25f3fd6b01cc9945023d323e4b68ce\n\n**Repo agreements highlighted in 2019:**\n\n&#x200B;\n\nhttps://preview.redd.it/oola56ysorq61.png?width=782&format=png&auto=webp&s=c68c26e22843021d7bccc2de178d41e1bdee5fd0\n\n**Repo agreements highlighted in 2020:**\n\n&#x200B;\n\nhttps://preview.redd.it/cb8oz47uorq61.png?width=784&format=png&auto=webp&s=7e827a04aee27d8fc1b141efe38ed87d4db90d3c\n\n# Financial Institutions are Dynamic\n\nNow, this is a bit of new speculation that you’ve not heard of in u/atobitt’s post and i believe is what Michael Brrrrry has been attempting to communicate to us (hit me up if i’m wrong MB! I hate spreading misinformation.)\n\n1. Why did we see an increase every year in repo and reverse repo agreements?\n2. Why did 2020 see a greater than 100% increase?\n\nI’m speculating that this is to do with QE being lifted and then the major reversal of the Fed in 2020 to drop rates due to what we saw in 2019. After all, when they see a new opportunity they gotta jump on it, can’t be relying on outdated practices.\n\n**Why did we see an increase every year in repo and reverse repo agreements?**\n\nLet’s go back to 2008, the federal rate is increasing and financial institutions are taking on more risk - we also see the overnight repo rates increasing in line as a correlation, which makes sense. However, what caused the bubble to pop back then and QE and other measures to take place is different to our recent past. They at least still had liquidity in the repo market (up until the kink in the hose formed).\n\n~~From 2016 onwards QE starts lifting and federal rates start increasing, therefore it’s harder for our HF bois to make money, and start looking at other ways to instead…..~~\n\n~~If there were more of the screenshots above going back to 2016, I’d bet my pug on it that their balance sheet would show it increasing year on year since QE was being lifted.~~\n\nu/oaf_king owns my pug now. Below is a chart of their balance sheets going back until 2006.\n\n&#x200B;\n\n[https:\\/\\/sec.report\\/CIK\\/0001284170](https://preview.redd.it/1wrnobvxiuq61.png?width=598&format=png&auto=webp&s=9100cb9fb1d84ce7076b818697fcd441d66c9a66)\n\nNote, the blue and red line are extremely close to each other, which is why you don't see the repo series in the chart easily.\n\nWhat this chart is showing us is that Pallofax has sporadically utilised the repo market before when fed rates were low (2008-2017). When the Fed started to lift QE in 2017 we see some brakes being applied to their use of the repo market (and showing growth for the most part YoY since 2015) soon before it EXPLODES in 2020 when fed rates drop to close to 0% again.\n\n**Based on fed rates dropping, it's not surprising and it's likely an industry trend, not just isolated to Pallofax.**\n\nSpeculate away apes.\n\nWhy?\n\nBecause they are greedy and have been re-using collateral to create collateral chains as they can make some decent cash off the \"leverage\" they receive in return.\n\n&#x200B;\n\n[Fed Rates](https://preview.redd.it/1v8c59nzorq61.png?width=1165&format=png&auto=webp&s=39d13e39064ff0bb8633b83cffa01328e2f82bd8)\n\n**Why did 2020 see a greater than 100% increase?**\n\nConvo overheard at Palafox (not really):\n\nShithead A: Hey, you see the Fed dropped rates?\n\nShithead B: Oh, sick - you know how we’ve been using re-using collateral to make dosh?\n\nShithead A: Fuk, We can do this at an even cheaper rate now.\n\nShithead B: Win win, \\*snorts cocaine\\*\n\n&#x200B;\n\n[Fed Rates](https://preview.redd.it/rtmi75m2prq61.png?width=1163&format=png&auto=webp&s=9b16c51abcca48ced50e03d6edb4aed9f8c5bbfa)\n\n# Translate What this means into Monke Please\n\nWe don’t actually know whether they’re shorting these or not, but given Palafox’s connection to Shitadel (they own Palafox), it’s a possibility.\n\n**Edit: The above is speculation, their goal is to remain neutral, the conclusions drawn in the EVERYTHING short are flawed to a point in my eyes due to this. Refer to the post below for more details. Thanks** u/crazysearch\n\n[https://www.reddit.com/r/GME/comments/mif5o1/debunking\\_the\\_the\\_everything\\_short/](https://www.reddit.com/r/GME/comments/mif5o1/debunking_the_the_everything_short/)\n\nWhat we do know is, and in the words of u/SirCrimsonKing they are “extending paper beyond gold”\n\nI’ll use his words as he put it very well in terms of what shitfuckery they’ve got themselves into with an accounting lense.\n\nOne piece of collateral is the basis for multiple transactions (collateral chain), Palafox is carrying $16.46 Billion in assets, rather than being “real” assets with a minor portion invested in hedging instruments, their assets are almost entirely derivatives.\n\nSo they are basically saying a substantial portion of their positions are rehypothecated.\n\nIn other words.. we call \"assets\" things people owe us, but we don't have. We call \"liabilities\" things we owe other people - we don't HAVE what we owe them, but we \"expect\" it from people on our asset/receivable side.\n\nSo they’ve built a house without any foundations. Fuck. I’ve seen [this movie before](https://www.imdb.com/title/tt1596363/).\n\nAs we said above what they’re doing:\n\n*“Propagates uncertainty and amplifies fragility in times of market stress.”*\n\n# How Big is the Problem?\n\nI believe this is the second thing Mr MB was trying to bring to our attention, which is an exposure of this problem **THROUGHOUT the industry**, not just Shitadel.\n\n&#x200B;\n\n[Fig 2a. https:\\/\\/www.federalreserve.gov\\/econres\\/notes\\/feds-notes\\/ins-and-outs-of-collateral-re-use-20181221.htm](https://preview.redd.it/hy1dovq8prq61.png?width=1142&format=png&auto=webp&s=a36b4f908cb30c98052f07dfaf99d0552ed57a3f)\n\nAbove we have a graph that shows the incoming and outgoing collateral, focus on the NON dotted lines. Of the outgoing collateral, around 65-70% of the collateral is being reused or as we say “rehypothecated”. It’s also representing close to $2 trillion.\n\nSay that in your head one more time. **$2 Trillion.**\n\nThis [paper](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm) he gave us is a gold mine, my only wish is that it went back further in time. Anywho, Let’s dig into the rehypothecated portion of this outgoing collateral.\n\n&#x200B;\n\n[Fig 2b, 2c. https:\\/\\/www.federalreserve.gov\\/econres\\/notes\\/feds-notes\\/ins-and-outs-of-collateral-re-use-20181221.htm](https://preview.redd.it/zvpxdbqcprq61.png?width=1149&format=png&auto=webp&s=d1744077eba56d1606c903cff947165f4782c5f6)\n\nFocus on the right side, as we’re mainly interested in rehypothecated products.\n\n* That’s alot of fucking rehypothecated shorts \\~$400B\n* Repo agreements are the largest at $1T, what’s interesting about this?\n\n&#x200B;\n\n[Fig 3a, link above](https://preview.redd.it/xb9i5yjhprq61.png?width=1153&format=png&auto=webp&s=ddcd5b7360b7eec0c209e153f9789b0b1cd52b11)\n\nFucking feel the onion mate, this is a subset of the first graph, focused on Treasury securities only. I nearly spat out my tea when I saw this.\n\nThat motherfucking green line, High Quality Liquid Assets (HQLA). The green line essentially represents the securities coming in backed by - you guessed it - treasury securities which are unencumbered.\n\nThe tiny amount of HGLA treasury securities held pretty much suggest that the majority of US treasury securities held are in other parts of consolidated firms \\*Cough\\* Shitadel \\*Cough\\*\n\n&#x200B;\n\n[Fig 3b, 3c](https://preview.redd.it/jfpqys2lprq61.png?width=1159&format=png&auto=webp&s=66024cc24f4ef56dae44d82dc62d352ce14ffbd2)\n\nOne last layer of onion to peel, I swear.  There’s two observations which are interesting and one brings flashbacks.\n\n* Most of the US Treasury circulation done is heavily dependent on the repo market\n\nAlong with a specific line mentioned in the text of the paper. “...seniority of repos in bankruptcy”.\n\nI’m no law ape, so I request u/Leaglese chime in and help interpret this further, so until he does take this with a grain of salt.\n\nThis [paper](https://www0.gsb.columbia.edu/mygsb/faculty/research/pubfiles/5576/BoltonOehmkeDerivatives.pdf) from Columbia Law School discusses whether derivatives should be privileged in bankruptcy. Why is this interesting?\n\nGuess who’s using a fuck tonne of [deep ITM Puts](https://www.reddit.com/r/GME/comments/mibedc/the_moass_wont_happen_until_options_are_not/) to hide FTDs in GME and also has a balance sheet that has a fuck tonne of derivatives? Yep…. Shitadel…. (Options are a category of derivative product btw)\n\nI won’t speculate how this may work with Shitadel and their many branches, and will await a legal ape to help flesh this out for what it’s worth.\n\n* Unencumbered collateral swaps is double rehypothecated swaps for Treasury securities and is growing\n\nThis is saying that our bois are using collateral swaps to upgrade their collateral. Through these contracts, whoever is engaging in collateral swaps, is exchanging securities with **lower credit quality,** thereby “upgrading” their collateral.\n\nWell, I’ve seen [this movie before](https://www.imdb.com/title/tt1596363/), once a-fucking-gain.\n\n# Who Likes Leverage? You Might Like This...\n\n&#x200B;\n\n[fig 6d](https://preview.redd.it/j2m80f7qprq61.png?width=981&format=png&auto=webp&s=0c9320844dbc1d3213c0e72bab7e0a319c80c816)\n\nAnother fucking chart jsmar?? Yes. Last one, I promise.\n\nBefore we can understand wtf is going on here, let’s understand the **Collateral Multiplier**, which is something the researchers designed for this analysis specifically.\n\nThe Collateral Multiplier is pretty much a “money multiplier”, In the “money multiplier”, a percentage of funds a bank receives through deposits (**liabilities**) are held as reserves (**assets**). The remaining funds are lent out in the form of loans (assets), which become new deposits in another bank, which then repeats the process. Yeah, sounds fishy already hey?\n\nLet’s refer back to the graph, what’s saying is that Primary Dealers (Essentially market makers of treasury securities…. Yep… I know…) “create” seven times as many assets backed by treasury securities than they own. The blue lines show the lower bound and upper bound of their samples.\n\nSo yeah, this is prevalent, indicated by the confidence interval, at the extreme end indicating firms “create” 10 times as many assets backed by treasury securities with a lower bound of \\~5.\n\n# A Funny Parallel\n\nNow, this is where we can draw parallels with MBS, MBS were notoriously easy to sell as they were viewed as being safe as.\n\nWhat we’re seeing in the graph above and is telling us is that Treasury securities are easy to monetize, hence why they are getting abused to the tune of 7 times per one US Treasury security.\n\n# Conclusion\n\nI believe this is what Michael Burry was actually trying to tell us (this is all speculation still).\n\nAs a result of the liquidity and reserve changes in reaction to the GFC in 2008, financial institutions have decided to abuse US Treasury Securities (UST) through the means of the repo market.\n\nThey are:\n\n* Creating fragility in the financial system through collateral chains as they’re creating an interconnectedness between different firms\n\n&#x200B;\n\n* Abusing US Treasury Securities to the tune of 7 times per one security. A lot of assets “backed” by Treasury Securities **could** be fucked. Speculative of course.\n\n&#x200B;\n\n* The problem is huge $800B Rehypothecated UST Repos as of Sep-2018\n\n&#x200B;\n\n* Collateral swaps are on the rise…. Making shittier quality assets look better than they are…\n\n&#x200B;\n\n* The system ~~nearly imploded~~  had a scare in late 2019 when measures implemented to protect the market post-GFC essentially worked against the market\n\n&#x200B;\n\n* Shitadel doubled down on USTs when the fed lowered rates in response to the COVID for the large part - **but so did the entire industry**.\n\n# Closing Remarks\n\nI have had lots of great conversations with a range of smart apes, and the same consensus has been drawn multiple times. How the Repo market is currently being used, is **normal.** We do have an indication of the industry leveraging themselves up on UTS through repos, but we don't really have the context of if this is a historic high.\n\nWe also do not know if there is any fraud involved, the quality of assets being backed by UTS and so on. It's unlikely that we will see a 'market collapse' unless evidence rears its head and catches both retail investors by surprise AS WELL as the Federal Reserve through either:\n\n1. Severe Overlergarging\n2. Fraud\n3. How interconnected the system really is\n\n**Where to next…?**\n\nWho the fuck knows, ~~it’s walking on a knives edge and the MOASS of GME may just be the catalyst towards blowing up the market yet again~~.\n\n**Conjecture Edit:** Removing the last piece as it's way too speculative.\n\nOne last *ominous* word. Liquidity.\n\nNot financial advice, just an ape reading documents. Please contribute valuable opinions or corrections through PM as I'll 100% answer through that channel.\n\n&#x200B;\n\n&#x200B;\n\n**Consequences TLDR - thanks** u/Anarchist73 (Note, everything is still speculation);\n\n*\"This post finally made me understand what was trying to be said by the everything short post and Micheal burry. Essentially these rehypothecated treasuries are being used as AAA collateral the same way Synthetic CDOs were being used as \"high quality\" investments or collateral. Except there are no real bonds if you look under the hood. It's all derivatives, the collateral doesn't actually exist, and the entire systems leverage ratios are far in excess of what anyone believes it to be.\"*\n\nImportant Note From Me: **I do not personally agree** with the conclusions drawn in the EVERYTHING short. The post does not imply the entire systems leverage ratios are in far excess either (we have no upper bound context), so take that with a grain of salt. Neither does it imply fraud is going on like back in 2008. **We simply do not know.**\n\n&#x200B;\n\n**Edit:** Added a good TLDR of the consequences from u/Anarchist73\n\n**Edit:** Tagged the wrong u/Leaglese\n\n**Edit:** Updated some wording and u/oaf_king decided he wanted my Pug so he went through Pallofax's historical EOY reports.\n\n&#x200B;\n\n[Thanks u\\/oaf\\_king](https://preview.redd.it/2yvq0984iuq61.png?width=598&format=png&auto=webp&s=fa16b562283ab989547c50fc22cf4c4f9944da6d)\n\nNote, the blue and red line are extremely close to each other, which is why you don't see the repos.\n\nWhat this chart is showing us is that Pallofax has sporadically utilised the repo market before when fed rates were low (2008-2017). When the Fed started to lift QE in 2017 we see some brakes being applied to their use of the repo market (and showing growth for the most part YoY since 2015) soon before it EXPLODES in 2020 when fed rates drop to close to 0% again.\n\nSpeculate away apes.\n\n**This is a trend reflected across the industry as a whole. Not just limited to Pallofax.**\n\n**Conjecture Edit:** As you apes know I like some good conjecture as it helps us all here is a link to a comment by u/LatinVocalsFinalBoss. While it does sound combative, don't give the ape flack for it.\n\n[https://www.reddit.com/r/GME/comments/mil875/michael\\_burry\\_handed\\_us\\_the\\_missing\\_piece\\_on\\_a/gt5n1mk?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/mil875/michael_burry_handed_us_the_missing_piece_on_a/gt5n1mk?utm_source=share&utm_medium=web2x&context=3)\n\n**Resource Edit:** If there is one thing you do after reading this, watch the following video.\n\n[https://www.youtube.com/watch?v=PHe0bXAIuk0](https://www.youtube.com/watch?v=PHe0bXAIuk0)",
    "title": "Michael Burry Handed us the Missing Piece on a Silver Plate... | How Financial Institutions are Using US Treasury Securities Nearly Caused the Market to Collapse and What Does it Mean for Us?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mil875/michael_burry_handed_us_the_missing_piece_on_a/"
}