{
    "author": "JustBeingPunny",
    "created_utc": 1617395714.0,
    "distinguished": null,
    "edited": 1617559861.0,
    "id": "mit0eu",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mit0eu",
    "num_comments": 431,
    "permalink": "/r/GME/comments/mit0eu/the_everything_shortcontinued_citadel_spacs_and/",
    "score": 4502,
    "selftext": "I think if I update this any more, I'd like to leave this at the top.\n\n**This does not mean you will not get your tendies. I am merely pointing out the sheer corruption in the game we're playing in. At the very minimum, just see that they're all desperately hiding their money. It sounds like somebody is going to come knocking very soon...**\n\n&#x200B;\n\n**Let's do the right thing and start with the first post.** [**The EVERYTHING Short**](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/?utm_medium=android_app&utm_source=share) u/atobitt\n\nThe first DD was amazing. Credit where credit is due. This is a long post and aims try and continue on from where you finished.\n\n&#x200B;\n\nSo everyone. Let’s get a few things cleared up before I continue. As much as I would love to keep the sub ‘lingo’ going (HODL, APE etc) I feel it would be in the best interests of the DD to remain as concise and to the point as possible. *I apologise for the lack of rocket emojis in advance.*\n\n&#x200B;\n\nWe all read ‘The Everything Short’ post (If you haven't, I highly suggest you read it, linked above). It was an amazing insight into the depths of shadiness HFs are participating in.\n\nI aim to continue delving in and attempting to unravel the manipulation. I am hoping someone can continue where I finish.\n\n&#x200B;\n\n*My disclaimer – I am not an expert. (I am not a cat.) This post is going to be formatted to be easily edited. This isn’t an ego trip as to ‘look what I found!’, I'm merely carrying the above post on. If* u/atobitt *see's worth and wishes to merge the posts, then obviously this will go there*\n\n*Remember*,  *it’s a post for us all to work on together, and bit by bit, finish with a complete picture we can agree on.*\n\n*Why just go at it alone when there are over 200,000 others who can help?*\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nedit - I know Melvin is a company and not a 'he'...\n\n**05/03/2021**\n\n**Oh boy are you in for a treat today! You never guess who may have been wrong? ME! And guess who may have been right - YOU DAMN APES! God this keeps getting better. Again well done all!**\n\n&#x200B;\n\nSo down the rabbit hole I continue.\n\nRecap - We believed there was two potential ways SPACs could be used\n\n&#x200B;\n\n1. Using the shares of SPACs as collateral, as the money inside the shares are effectively in government bonds\n2. Used as an ESC vehicle to hide money when the DTCC comes-a-knocking\n\n&#x200B;\n\nWell I'm not going to completely rule out my DD. Because I have more to back it up. Though, I found more information a bit clearer to back up all of your ideas.\n\n&#x200B;\n\n# Lets take a look at MELVIN.\n\n&#x200B;\n\nMelvin was a much easier HF to investigate. They don't have masses of companies to hide shady business, only a few. Which means my ritalin can work twice as good scouring through all the filings. Of course, Melvin are getting into SPACs.\n\n&#x200B;\n\nhttps://preview.redd.it/uwqy3oe3h5r61.png?width=1634&format=png&auto=webp&s=05e38bfc80322a354d4b1b951b2ce5d107ec15a0\n\n&#x200B;\n\nLet's look at the most recent one on 03/19/2021.\n\n&#x200B;\n\nhttps://preview.redd.it/gywhsqz7h5r61.png?width=353&format=png&auto=webp&s=1b324097da71d1e4538339690177ac1eb0ea73a5\n\n&#x200B;\n\nAaaaaand let's have a look at their filings!\n\n&#x200B;\n\n&#x200B;\n\n[Don't blame me. I love crayons ok. ](https://preview.redd.it/6iqs1l8ih5r61.png?width=1644&format=png&auto=webp&s=1c1d23ddd45003955a806d1eeb745d388473f4a2)\n\n&#x200B;\n\nThe filings are quite literally stated ***'Employee Benefit Plan Security Offering'***\n\nLet us keep soaring through this vortex of a rabbit hole.\n\n&#x200B;\n\nThe SPAC has a *Long Term Incentive Plan.* Let's dive in:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/jgjzv368i5r61.png?width=844&format=png&auto=webp&s=f332abbb0e162670572a0e453c67fcf0f02c15b7\n\n&#x200B;\n\nAnd Melvin has just joined. I wonder what '*awards'* he might be able to get.\n\nSo far -\n\n&#x200B;\n\n1. Melvin has invested in a SPAC\n2. This SPAC has an incentive scheme to keep the best available people for positions of responsibility\n3. Really, Melvin gets a nice fat cheque.\n\n&#x200B;\n\n&#x200B;\n\n# THE NEXT BIG QUESTION.\n\n***IF MELVIN LIQUIDATES AND FAILS, CAN HE JUST PASS ALL THESE FAT CHEQUES OFF TO HIS FAMILY OR WIFE'S BOYFRIEND? Or are there like, rules against that?***\n\n&#x200B;\n\n**So you guessed it. Of course they're allowed!**\n\n&#x200B;\n\nhttps://preview.redd.it/hn3dkgd8j5r61.png?width=850&format=png&auto=webp&s=80cd0817d33d46b191e1822385bb7f8ba2848acb\n\nOh yeah, so if the committee agrees that Melvin can pass his nice big fat bonus across as a gift, then he sure as hell can. **TO ANY FAMILY MEMBER.**\n\n&#x200B;\n\n&#x200B;\n\n# WELL HOW MUCH IS THERE AVAILABLE FOR AWARDS N STUFF?\n\nLmao. Just remember, this is one SPAC. ONE. This is their available amount for the Employee bonus scheme thingy.\n\n&#x200B;\n\n&#x200B;\n\n[https:\\/\\/sec.report\\/Document\\/0001193125-21-067573\\/](https://preview.redd.it/desekjlzj5r61.png?width=1645&format=png&auto=webp&s=c9bacaed75dc3c38fd7a1427cbd6f016306974d8)\n\n&#x200B;\n\n**Uh yep. That's $690,176,077**. They've set aside 1,512,085 shares to sell within the employee award scheme.\n\nHow did they get this figure?\n\n*Offering price estimated solely for the purpose of determining the registration fee pursuant to Rule 457(h) under the Securities Act based on the* ***average of the high and low sale prices per share of the Company’s Common Stock as quoted on the New York Stock Exchange on February 25, 2021.***\n\n&#x200B;\n\n&#x200B;\n\nSo.\n\n* SPAC wants Melvin because of his big brain.\n* SPAC gives awards to Melvin to keep him.\n* Awards are in the ball park of over $600,000,000. Seems fishy.\n\n[Link to this filing](https://sec.report/Document/814547/000119312521067573/d147323dex101.htm)\n\n&#x200B;\n\n&#x200B;\n\n# MY TURN!\n\nMy one is very short. u/TheAutistcMilyonar's post gave me the lightbulb moment.\n\nRemember when I said that the SPAC shares could be used as collateral?\n\n&#x200B;\n\n**Well lets look at one of the most recent DTCC Rules.**\n\n&#x200B;\n\n***DTC-2021-002 - Making sure hedge funds have adequate collateral for the credit limits given by the DTCC***\n\n&#x200B;\n\nSo yeah, shares in a SPAC that are backed by Government bonds? Seems like that fits the bill of collateral to me.\n\nSeems like they could be prepping up for the new DTCC rule.\n\n&#x200B;\n\n&#x200B;\n\n**As always. Thank-you and continue to contribute!**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**EDIT - Thankyou for all the comments, DD, insights and much more with this. I take very little credit in this and want to reiterate how much of a collective effort this is. I am referring only to this post btw SEC.**\n\n**I'd like to also clarify, SPACs sole purpose aren't for shady tactics. They are a genuine tool used for private companies to go public. A crayon's only purpose isn't for drawing?**\n\n**Each of you had thought's on the purpose of the SPACs, what they might do, might not do and the big question of - WHY?**\n\n&#x200B;\n\nFor anyone new joining this post, please refresh yourselves below the edit.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**04/03/2021**\n\nSo to summarise-\n\n\\- Kenny G invests in a whole host of SPACs\n\n\\- The money in these SPACs can’t do a whole lot, they’re only allowed to be withdrawn to invest in /acquire a company\n\n\\- THOUGH, while in the bank these are invested into US government securities\n\n&#x200B;\n\n# 1. My personal opinion (it's all about the bonds)\n\n&#x200B;\n\nThe EVERYTHING short post clearly showed that Citadel have shorted the bond market to OBLIVION. Like utter destruction. It's likely they need to cough up a lot of money, as the financials show they are screwed.\n\nSo my question was '**What purpose and benefit would a SPAC have regarding bonds?**'\n\nWell I think I figured a potential reason. Though, due to the insufficient filings, I find it rather difficult to prove.\n\nRemember our good friend 'collateral'. The stuff that screwed over the economy in 2008? Yeah that. I believe that the SPACs could be just that.\n\n&#x200B;\n\n**Simply put, I think the shares of the SPAC are being used as collateral. Let me explain:**\n\n&#x200B;\n\n* Kenny G now has a boat load of shares of SPAC A, which actually represent cash sitting in a bank. This cash is invested in government bonds.\n\n*For us? It’s like putting $1000 into a savings account and receiving $1000 bananas back. In the mean time, the cash in the bank is being invested into Government bonds.*\n\n&#x200B;\n\n**Well here’s where the rehypothecation might come into play.**\n\n&#x200B;\n\n* Kenny owes Keith $1000 dollars in government bonds.\n\n&#x200B;\n\n* Kenny doesn’t have the bonds. Kenny can’t find the bonds. So what does Kenny do?\n\n&#x200B;\n\n* Kenny tells Keith, I have 1000 bananas here. ***These bananas are pretty much worth $1000 in bonds, look! They’re sitting at the bank invested in them!***\n\n&#x200B;\n\n* This now makes it look like a worthy collateral. How could it go wrong?\n\n&#x200B;\n\n* If the SPAC expires within 24 months, they’re guaranteed their money back AND it’s pretty much in government bonds so you know its’ secure.\n\n&#x200B;\n\nI believe the shares are potentially being used as collateral.\n\nAnd you know what the most messed up thing about it is?\n\n&#x200B;\n\n**Whoever borrows the stock, sells it. Literally shorting it to cover THEIR own ass. I believe Citadel are using the shares of the SPAC as collateral because they are effectively backed by government bonds!**\n\nWhy get bonds when you have a stock that's basically in them? It's no different!\n\n&#x200B;\n\nSo shall we try and prove the theory? When a stock is shorted, it goes down right? Lets look at some of the SPACs Citadel invested in.\n\n&#x200B;\n\nhttps://preview.redd.it/idtt0wtdszq61.png?width=785&format=png&auto=webp&s=627e139180bb3671298198edabe46975808c4982\n\n&#x200B;\n\nhttps://preview.redd.it/ary3bfekszq61.png?width=796&format=png&auto=webp&s=d1af55459f8343df87869e0bff5a07fc1db84480\n\n&#x200B;\n\nhttps://preview.redd.it/qq8ezbdpszq61.png?width=761&format=png&auto=webp&s=801aa8bdb072b49e2aa88144cfd016782dbf78c5\n\n&#x200B;\n\nhttps://preview.redd.it/ak1lk44uszq61.png?width=777&format=png&auto=webp&s=413a793388a3c2c3e51d48f009ca2c3b03bc5b71\n\n&#x200B;\n\n**IF THIS IS NORMAL TRADING FOR A SPAC, THEN I WILL EDIT ACCORDINGLY. Though the date March 26th seems to be a big date for a lot of individual SPACs, especially all owned by Citadel...**\n\n&#x200B;\n\n&#x200B;\n\n# 2. SPACs are being used as an outlet for cash.\n\nSome great DD by a lot of people stating this is an outlet for Kenny G to hide is assets. They're all in the Cayman Islands, so it's not exactly a stretch.\n\nu/segr1801\n\n*They do this to offset funds and pay themselves a final big bonus before the ship sinks. This means the DTCC has to cover more itself!*\n\n*The money sits in the SPAC. Now a fake company is founded only to be aquired by the SPAC. Now the company declares bankruptcy, the face value of citadels holding declines to zero and the employee (Kenny) has earned his final bonus.*\n\n&#x200B;\n\nu/StrifeLover\n\n*Citadel knows it’s going bust and it’s going to create ‘Escape Plans’ to redistribute its wealth across several of its highest ranking members who are going to create new companies or acquire companies and these SPAC funds are the possible means for them to do it in an attempt the save as much wealth as possible from being paid out to retail and still saddling the DTCC with as much of the debt as possible as a final ‘fuck you’*\n\n*Edit: Found that DD mentioning Citadel Escape Plans. They actually call it “ESC Funds”. The bastards have a sense of humor.* [*https://www.federalregister.gov/documents/2020/12/28/2020-28492/citadel-enterprise-americas-llc-formerly-citadel-llc-and-ceif-llc-notice-of-application*](https://www.federalregister.gov/documents/2020/12/28/2020-28492/citadel-enterprise-americas-llc-formerly-citadel-llc-and-ceif-llc-notice-of-application)\n\n*Edit 2:* u/the_captain_slog *gives a good response and helps me understand the real reason for an ESC Fund. I’ll quote her response below.*\n\n*“That isn't what that is. It's a commonly used employee compensation vehicle, as I pointed out in that post. You can literally Google ESC funds and find examples from other companies.”*\n\n&#x200B;\n\nAnd this wonderful comment. It's too long to post so here's the link! u/ChemicalFist\n\n[Link](https://www.reddit.com/r/GME/comments/mit0eu/the_everything_shortcontinued_citadel_spacs_and/gt6zjy5?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n**AS ALWAYS KEEP THE DD ROLLING IN! It's amazing! I could be wrong above but the whole idea is to pick it apart, provide the correct reasoning and then edit it!**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**04/02/2021**\n\n­­­­­­­­­­­\n\n# Background\n\n&#x200B;\n\nA few weeks ago I made a bad post about E-Toro being owned by Citadel. (Yeah, I know). Though after reading ‘The Everything Short’ post and seeing the Cayman Islands, alarm bells started to ring very loud.\n\n&#x200B;\n\nThe ticker I got confused with, was a SPAC named ***“Fintech Evolution Acquisition Group”***, located in none other than the Cayman Islands.\n\nThis was about two weeks ago. I figured I got the ticker wrong and there wasn’t much to see there.\n\nWell fast forward to now and let’s have a look at how many more SPACs Citadel Advisors LLC have decided to invest, in just the past month alone.\n\n&#x200B;\n\n&#x200B;\n\n[That's just the first page. ](https://preview.redd.it/ome3siu0itq61.png?width=1644&format=png&auto=webp&s=365f3219c548aee60cd231124759b651aa90f83a)\n\n&#x200B;\n\n**They're not all SPACs... but 18 of them are. That's just the month of March.**\n\n&#x200B;\n\nYou may scroll through a few pages and say ‘*Well yeah, there’s lots of these filings!’*\n\nOpen them up. Have a look. Previously, most seem to be genuine companies and do not follow the same format of:\n\nXXXXX Acquisition Corp (insert roman numeral here). This for me has been the tell tale sign of a SPAC.\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# \n\n# SPACS\n\n**Well what is a SPAC?**\n\n&#x200B;\n\n*As defined by the US Securities and Exchange Commission, a SPAC is a company with no operations that offers securities for cash. It places substantially all the offering proceeds into a trust or escrow account for future use in the acquisition of one or more private operating companies.*\n\n*Following its initial public offering (IPO), the SPAC will seek to identify acquisition candidates and attempt to complete one or more business combination transactions, after which the company will continue the operations of the acquired company or companies as a public company.*\n\n&#x200B;\n\n&#x200B;\n\n**Let’s summarise**\n\n· SPACs are basically the equivalent of a savings account for a major investor to acquire a company. (heavily simplified)\n\n&#x200B;\n\n· The SPAC has an IPO and raises capital and puts it into a trust.\n\n&#x200B;\n\n· These raised funds in this trust have strict rules. The SPAC must invest into an acquisition within 24 months or funds are returned to investors.\n\n&#x200B;\n\n&#x200B;\n\n**And what are the benefits of SPACs?**\n\nSome of the reasons a private company might choose to go public via a SPAC versus an IPO include:\n\n· Circumventing the IPO process (IPOs are lengthy)\n\n· Flexibility (if the private company is extremely leveraged and it may be difficult for an IPO)\n\n· Private company shareholder benefits (avoid the rules for selling insider shares like in a normal IPO)\n\n· SPACs offer the benefit to the private owners of more limited financial reporting requirements. (This is a good one)\n\n&#x200B;\n\n**Here’s a pretty picture to help**\n\nhttps://preview.redd.it/b7jf07m4jtq61.png?width=602&format=png&auto=webp&s=ee9bba738a9f396dc830f6aefb8f0c3410e7ba92\n\n&#x200B;\n\n&#x200B;\n\n[Further info on SPACs](https://www.fidelity.com/learning-center/trading-investing/SPACs)\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# What do SPACs have to do with anything and what does it matter if they’re getting their hands into so many?\n\n&#x200B;\n\nWell I’m glad you asked. The SEC has some wonderful advice that ‘*you should carefully read the SPAC's IPO prospectus as well as its periodic and current reports filed with the SEC pursuant to its ongoing reporting obligations.\"*\n\nWell. That would be if Citadel were going to ACTUALLY acquire a company. I have a belief that these aren’t being used at all for their intended purpose.\n\n&#x200B;\n\n*The management team of a SPAC (which includes sponsors, directors, officers, and affiliates) decides which companies to potentially acquire. A minimum of 85% of the SPAC IPO proceeds must be held in an escrow account (typically, more than that percentage is held in escrow) for potential acquisitions.* ***These funds are usually invested in government bonds while the SPAC sponsor seeks acquisition targets.***\n\n&#x200B;\n\n**Oh I see. So we’ve returned full circle back to the government bonds. So this means that all of this wonderful cash that’s been raised is now sitting in a trust at a bank, being invested into government bonds.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Digging into the filings of Citadel’s SPACs\n\n# \n\nLets start with the newest one. Submitted to the SEC on 04/01/2021\n\n&#x200B;\n\nhttps://preview.redd.it/2h7en06mjtq61.png?width=359&format=png&auto=webp&s=ae7055e90f3b6a4a3c83ed69f21bde22fe0c21d0\n\n&#x200B;\n\n**Lets follow the SEC’s advice and look into the prospectus. And who is the trustee bank that’s holding all this cash?**\n\n&#x200B;\n\nhttps://preview.redd.it/jegfu38ojtq61.png?width=1069&format=png&auto=webp&s=a5039f193d944ce6c04d4bf5027ba5c78a4126c8\n\n&#x200B;\n\n**Holy moly that’s a lot to take in. Let’s break it down.**\n\n&#x200B;\n\n1a) The trustee bank is J.P Morgan Chase.\n\n1b) They deal with the cash\n\n1c) They’re going to invest that cash (while it sits in escrow) into ‘Government backed securities’...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# \n\n# RECAP SO FAR\n\n\\-So far\n\n· Citadel have recently bought into masses of SPACs\n\n· The SPACs hold money in a trust until they are able to invest it in an acquisition\n\n· The trust invests this money in US Government securities/bonds\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Let’s have a look and see how much this SPAC is holding in the trust!\n\n&#x200B;\n\nhttps://preview.redd.it/vsitkg5qptq61.png?width=1327&format=png&auto=webp&s=f1451efd2e45d6158749d6633a84ffc169666994\n\n**$300,000,000 dollars.** [Report](https://sec.report/Document/0001213900-21-017977/)\n\n&#x200B;\n\n**Okay let’s move to SPAC number 2 -** ***Research Alliance Corp. II***\n\n&#x200B;\n\nhttps://preview.redd.it/yvp39ultptq61.png?width=1319&format=png&auto=webp&s=de1385dcc8c98f33a442aa155459f6335914f9e7\n\n&#x200B;\n\n**SPAC 3?**\n\n&#x200B;\n\nhttps://preview.redd.it/4d750pmwptq61.png?width=1324&format=png&auto=webp&s=6177c276b46613e1c9913bd3776a7e176c9fde27\n\n&#x200B;\n\n&#x200B;\n\n**SPAC 4!!!!**\n\n&#x200B;\n\nhttps://preview.redd.it/2svlxuuzptq61.png?width=1236&format=png&auto=webp&s=f4e2776c20d9c46d1a42cedcc39ecddcab790f01\n\n&#x200B;\n\nAnd yeah, the list goes on and on and on. You want to know where this is?\n\n[Citadel SEC filings](https://sec.report/CIK/0001423053/1#documents)\n\n&#x200B;\n\n* Open up one of the filings.\n* Search the SPAC\n* Open the 8K filing\n* See the 'Cash held in trust'\n\nSide note - Government bonds are the only exclusion to the Investment company act. The SPAC openly says -\n\n*If we are deemed to be an investment company under the Investment Company Act, we may be required to institute burdensome compliance requirements and our activities may be restricted, which may make it difficult for us to complete our initial business combination.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**Just to reiterate, Citadel do not have 100s of millions tied up in these SPACs (not that I can see anyway.) They invest in the SPAC at the percentage stated on the acquisition form. Though Kenny G is on every single one.**\n\nI just can't believe they are doing all this for no reason.\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nThis is where my knowledge ends and I plead for your help to continue this post. I believe SPACs are a key part of the puzzle when it comes to the bond market and ‘The Everything Short’. If anyone knows more, feel free to let me know and I’ll edit and credit!\n\nWe know they have shorted the bond market to oblivion but the question remains, ***Why invest in a heap of SPACs?***\n\n&#x200B;\n\n**Are they using them to force banks (J.P Morgan) to buy bonds under contract for these SPACs? When they know JP Morgan have located them, do they then borrow them to short?**\n\n**Do they borrow them to cover?**\n\n&#x200B;\n\nFurthermore, if there are some significant holes here, help me patch them up.\n\n&#x200B;\n\nAnd for the critics – Don’t just throw out lazy, 1 line comments. Most of us aren’t experts. We are everyday people that love a stock. The idea is to work together to find the truth in a system we know little about. Please be constructive in your critique if you have one!\n\n&#x200B;\n\nThanks!\n\n&#x200B;\n\nSome links -\n\n[What is a SPAC?](https://moneyfortherestofus.com/318-what-is-a-spac/)\n\n[Citadel Advisors LLC SEC page](https://sec.report/CIK/0001423053/1#documents)\n\n[More SPAC info](https://www.marketplace.org/2021/02/18/whats-a-spac-a-simple-guide-to-the-investment-trend/)",
    "title": "The EVERYTHING Short....CONTINUED. Citadel, SPACs and Bonds",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mit0eu/the_everything_shortcontinued_citadel_spacs_and/"
}