{
    "author": "Ren3666",
    "created_utc": 1617387430.0,
    "distinguished": null,
    "edited": 1617442551.0,
    "id": "miq4gj",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_miq4gj",
    "num_comments": 217,
    "permalink": "/r/GME/comments/miq4gj/the_inflation_bomb/",
    "score": 2709,
    "selftext": "Disclaimer: I wonder if anyone considers this a nuclear bomb, even though it is coming from me, I was baffled the whole time. I don´t even want you to believe me, rather I would prefer it if you prove me wrong, but here we are, so take this with an infusion of natrium chloride. It may feel cold in the beginning, but the chill will have spread throughout your body, when you reach the end.\n\n&#x200B;\n\nWith that said, something recently was discontinued and I don´t mean the emergency lending facilities.\n\nI am talking about the M1 Money Supply an indicator, which was introduced 06.01.1975, but was discontinued 01.02.2020.\n\nIn the future it is intended to publish data at a monthly frequency, which contains only monthly average data needed to construct the monetary aggregates, but it´s one year now.\n\nAnd even previous datasets were adjusted several times. So much for time equals quality.\n\nhttps://preview.redd.it/782hhqff7sq61.png?width=1462&format=png&auto=webp&s=582ce9c2fc9e79064d20b0890a85b6a7c9db1d87\n\nSource: [https://www.federalreserve.gov/econres.htm](https://www.federalreserve.gov/econres.htm)\n\n&#x200B;\n\nAs the name implies this indicator tracks money, the money supply that is available in an economy - Hard cash and money that can be withdrawn from your bank account at any time, also called demand deposit.\n\nUsually an important indicator, since an excess in any commodity may cause a depreciation of said one, unless tightly regulated. Yet it was discontinued.\n\nI mean surely we have some programs that cause needless tax money to go up in flames, like the Natural Resource Conservation Service, which was set up 1935 to help  farmers minimize soil erosion and costs taxpayers $800 million per year,  yet the U.S. General Accounting Office (GAO) has found zero difference  in soil erosion between areas that participate in the program and those that don't.\n\nBut I am straying too far, surely they have their reasons to continue and discontiue certain stuff, because the above mentioned is clearly beneficial and the one even further might be straightout harmful.\n\nInformation should be buried, because as we know, the more easier something is to access the less valuable it becomes.\n\nAnyways, while everyone was believing that the money supply (M1) was affecting the price of needless stuff, like securities, exchange rates and hint at hyperinflation, it kind of remained flat - until 2007.\n\nhttps://preview.redd.it/r3qzulp4esq61.png?width=1462&format=png&auto=webp&s=bc0082d7f4fee9ae22ad16373b82adc3975bf53a\n\nAfter which it saw an accelerated increase until February 2020 to $4,027 Billion, just to be outdone the very next 2 months with an increase of 304,15%\n\nhttps://preview.redd.it/3rbq7eqifsq61.png?width=1460&format=png&auto=webp&s=12c09d8df5059ee89c85c92fe8c66d4d7102e384\n\n&#x200B;\n\nhttps://preview.redd.it/81rrbl9pgsq61.png?width=700&format=png&auto=webp&s=f1e4136a4b625a0a4cbcb5a4918b07e97932ffe5\n\nYou might say. Just another glitch, like GME, but I think we know better.\n\nI think you already expected this, but if M1 exists, there must be M2 too, right?\n\nJust for comparison reasons, other countries aren´t doing better. Not only does stock go up but also money.\n\n[By Wikideas1 - Own work https:\\/\\/fred.stlouisfed.org\\/graph\\/?g=1ajW#0, CC BY-SA 4.0, https:\\/\\/commons.wikimedia.org\\/w\\/index.php?curid=81774885](https://preview.redd.it/lsswfagfhsq61.png?width=3273&format=png&auto=webp&s=7dc829a66df74216ce3df75cdc5331f659e427e5)\n\nThere is also M0 & M3 btw, but this will just sand your brain at this point.\n\n**To quench the thirst of some though, M3 was also discontinued, which funny enough was first replaced by MZM, which has been also discontinued. Transparency MAX.**\n\nOnly M1 & M2 are important.\n\n&#x200B;\n\nNow the thing is, more money than exists is counted as liability.\n\nHow is that possible you may ask?\n\nBecause you pay % on your loan. Percentage on Money that does not exist, which is only nice, if you can print your own money, but ask me in the comments if you want this clarified. This will end up way too long again @.@ - but I can´t stop won´t stop...you know the drill.\n\nAnyways, let´s say you go to a bank and get a loan of $1,000, then the bank actually created $2,000.\n\nThat is because $1,000 is now in your possession in cash, while the banks lists your $1,000 as I.O.U.\n\nSounds familiar? Congratulations you now helped shorting the economy. Indirectly I should say. Because you diluted the money supply by getting a loan.\n\nThis is usually accredited to the Fed through Quantitative Easing (QE), but it´s not their printer, which goes Brrrrrrrrrr. **It is the banks´.**\n\n**Why is that important?**\n\nWell, because familiar names like **Goldman Sachs, J.P. Morgan and Credit Suisse are banks. Even Citadel tried to be one once upon a time.**\n\nAnd if you read my previous DD:\n\n[https://www.reddit.com/r/GME/comments/mh9she/explanation\\_low\\_borrowing\\_fee\\_put\\_into/](https://www.reddit.com/r/GME/comments/mh9she/explanation_low_borrowing_fee_put_into/)\n\nYou may already know that some banks, who also operate as Broker are **also** self-clearing as Clearing House, which means that their parent company, not only dictates borrowing fees & can manually feed their system with their own data, but also influences the money supply of the economy.\n\nBasically the Market Makers (MM) of the real world, which provides liquidity, far from bad boii Kenny´s clutches. At least in theory, but the market is a b\\*\\*ch, so everything is so intertwined, that one affects the other.\n\nOr not, if you look at M1.\n\nSo M1 velocity is apparently low on paper, at least until it was listed till the 01.10.2020, which should suggest that the demand for dollar is at a historic high.\n\nhttps://preview.redd.it/d21jt6ebrsq61.png?width=1456&format=png&auto=webp&s=a6ae9ed7b62c7e7c80c946ffd5f0670b13798445\n\nNow the reverse thought experiment. If the velocity was high, opposite would be true right?\n\nWelcome to inflation.\n\nhttps://preview.redd.it/woybmxzzssq61.png?width=1460&format=png&auto=webp&s=aded0e713a727bc9d4ce0c02bda34dd3418a00fa\n\nBut hey, don´t call it QE. Federal Reserve Board Chairman Ben Bernanke doesn´t like this term. It shouldn´t exist.\n\n[https://www.marketwatch.com/story/bernanke-dont-call-it-quantitative-easing-2010-11-18](https://www.marketwatch.com/story/bernanke-dont-call-it-quantitative-easing-2010-11-18)\n\nEdit 1:\n\n[Thanks to u\\/VolkspanzerIsME for this information this was an unexpected outcome - Everything always goes full circle apparently](https://preview.redd.it/cab981dycuq61.png?width=923&format=png&auto=webp&s=6f46f9457c92e22264a17a51809459d8050fec85)\n\nEdit 2:\n\n[Thanks to u\\/NoseBurner seems like there is some more digging to do](https://preview.redd.it/qoxss7yjgwq61.png?width=933&format=png&auto=webp&s=c6350b90e10b88b010ef1f2df007ab29b0b35bb9)\n\nhttps://preview.redd.it/ycbl08causq61.png?width=1217&format=png&auto=webp&s=71afe5e0d653d2fd8c53572d994b86a614c0adac\n\nI hope I could entertain you till now, because that means you are still with me. I am currently dying though.\n\nSo let´s wrap it up.\n\n&#x200B;\n\n**Why does this matter? What does this have to do with GME?**\n\nThe importance of this is that QE, Unemployment Benefits (greetings from Corona), **stimulus checks, credits and the Government are all linked together.**\n\n**The very banks and hedge funds and mutual funds and private people that shorted GME beyond 140% are belly up with leverage money on leveraged interest on leveraged credit and leveraged fees that does not exist.**\n\nSo whoever foots this bill\n\nhttps://preview.redd.it/hisa5qugxsq61.png?width=1442&format=png&auto=webp&s=dccb7e80d33a0f4561cb34c26b005d241b59b48a\n\nEdit 3:\n\n[td;lr](https://preview.redd.it/3h0pjw4alwq61.png?width=885&format=png&auto=webp&s=7cf76e20ab363cbc715801a21d35f91f4429e7ed)",
    "title": "The Inflation Bomb",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/miq4gj/the_inflation_bomb/"
}