{
    "author": "gherkinit",
    "created_utc": 1623005348.0,
    "distinguished": null,
    "edited": 1623008737.0,
    "id": "ntsm5a",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ntsm5a",
    "num_comments": 213,
    "permalink": "/r/Superstonk/comments/ntsm5a/jerkin_it_with_gherkinit_forward_looking_ta_for/",
    "score": 3531,
    "selftext": "Hello Superapes!\n\nIt's almost Monday and that means another round of Technical Analysis with me Gherkinit.\n\nThe first thing I wanted to touch on was the announcement of Jefferies and BOA to no longer lend shares [I covered this in my other DD today](https://www.reddit.com/r/Superstonk/comments/ntpkuy/never_a_borrower_be_a_synopsis_of_gmes_1_borrow/)\n\nAs always later tonight I will post a consolidated [Video DD of this on my YouTube](https://www.youtube.com/c/PickleFinancial) for those of you that don't have the time to read through this, or have reading comprehension issues it will be posted by 9pm EDT.\n\n\\**a note on this in the conclusion*\n\nSo let look at our usual suspects\n\n# Technical Analysis for this Week\n\n**The Ascending Channel**\n\nIt appears this trend, known as a [broadening formation](https://www.investopedia.com/terms/b/broadeningformation.asp), is holding quite strong since it began on May 11^(th). Tuesday we cleanly bounced off the upper-resistance of the previous weeks Bull Flag sending us on the run from $220-294. Forming yet another bull flag for this weeks price action. Upon completion of that run, we had a very direct line of consolidation within resistance to close @ $248.36 on Friday. This continues to imply that buyers are willing to buy higher, shorting is not profitable, and potential sellers are not taking profits (GME undervalued, hedgies are fuk, and apes hodl)\n\n[Current Trend and Timeline on the 4h timescale](https://preview.redd.it/f1qitbslio371.png?width=1564&format=png&auto=webp&s=4e1565c49472ccef39ce8631dd0e5c54ca8f7bd3)\n\nAnother thing I noticed this week which I am still determining is that the bull flags are increasing in scale if we break down each one by price action we can see that they are getting bigger.\n\n[Rate of Increase of the 18 days of trading that occurred in this formation](https://preview.redd.it/l13xwivwno371.png?width=1564&format=png&auto=webp&s=c5cf72038591423aaa643bf4666d8c92fa406b5e)\n\n**If** this growth rate of 6.4% is exponential, GME should be at:\n\n$338.94 at the end of next week.\n\n$859.60 by close of market on July 2^(nd), 2021\n\n$4,053.48 by close of market on July 30^(th), 2021\n\nJust for fun --->\n\n$7,375,244.54 on January 28^(th), 2022\n\nI'm sure some catalyst will rocket this long before then. However, If the proverbial can keeps getting kicked, this is something to think about.\n\n# Indicators\n\n**MACD**\n\nMACD is looking like it's in a continued upside move looks like the current growth trend is going to continue.\n\n[MACD on the 1D timescale](https://preview.redd.it/m9tv140guo371.png?width=1089&format=png&auto=webp&s=92818401da349909490d5e72c8ce8e85abf47dc3)\n\n**BBKC/TTM**\n\nGME has begun it's breakout of the squeeze indicator I expect volume and volatility to increase as this pattern expands over the coming week/s.\n\n[BBKC\\/TTM squeeze on the 1D Timescale](https://preview.redd.it/abl4exokvo371.png?width=1917&format=png&auto=webp&s=89173c69c0e676aef4bae3a32cc3e9238262826b)\n\n# Conclusion\n\nI have no reason to believe that the current trend won't continue. So this week I again expect a large run-up in the early part of the week followed by consolidation into the latter half. Monday we may see a continuation of Friday's downtrend to that resistance at 242.50 before we begin the weekly uptrend. I am still keeping my eye on CV\\_VWAP but have seen no indication of major arbitrage since Pentecost on May 21^(st).\n\nIf you want to see more information on this subject matter feel free to join me in the :\n\nDaily Live charting (always under pinned posts on my profile [u/gherkinit](https://www.reddit.com/u/gherkinit/)) from 8:45am - 4pm EDT on trading days\n\nOn my [YouTube Live Stream](https://www.youtube.com/c/PickleFinancial) from 9am - 4pm EDT on trading days\\*\n\nOr over on my communities [Discord](https://discord.gg/BGmjnrvHnw)\n\nor for memes and other fun stuff on [r/dillionaires](https://www.reddit.com/r/dillionaires/)\n\nAs always thank you for the support\n\n🦍❤️\n\n\\- Gherkinit\n\n# Addendum\n\nThis section keeps getting longer but given the possible misgivings people may have of what I do, I feel it is necessary that it is included.\n\n*\\*My YouTube channel is \"monetized\" if that is something you are uncomfortable with, I understand, while I wouldn't say I profit greatly from the views, I do suggest you use ad-block when viewing it if you feel so compelled.* *My intention is simply benefit this community. For those that find value in and feel compelled to reward my work, I thank you. For those that do not I encourage you to enjoy the content. As always this information is intended to be free to everyone.*\n\n*\\* Although my profession is day trading, I in no way endorse day-trading of GME not only does it present significant risk, it can delay the squeeze.*\n\n\\**This is not Financial advice. The ideas and opinions expressed here are for educational and entertainment purposes only.*\n\n\\* *No position is worth your life and debt can always be repaid. Please if you need help reach out this community is here for you. Also the NSPL Phone: 800-273-8255 Hours: Available 24 hours. Languages: English, Spanish.* [*Learn more*](https://suicidepreventionlifeline.org/)",
    "title": "Jerkin' it with Gherkinit Forward Looking TA for 6/7/21-6/11/21",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ntsm5a/jerkin_it_with_gherkinit_forward_looking_ta_for/"
}