{
    "author": "gherkinit",
    "created_utc": 1622997002.0,
    "distinguished": null,
    "edited": 1623026384.0,
    "id": "ntpkuy",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ntpkuy",
    "num_comments": 414,
    "permalink": "/r/Superstonk/comments/ntpkuy/never_a_borrower_be_a_synopsis_of_gmes_1_borrow/",
    "score": 6246,
    "selftext": "Hello Superstonk!\n\nI just wanted to do another compilation this weekend. Re-iterating some old DD I have written as it starts to become applicable to the current situation.\n\nJefferies and BOA coming out this week and declaring no more short positions would be allowed to be taken, added some weight to a thesis I had come up with a few weeks ago. I was getting frequently asked on reddit and YouTube. Why is GME's borrow rate so low. Well I came up with a logical answer and now as I feel that theory is becoming more likely I wanted to re-iterate it hopefully to a broader audience as I feel that this is something we should all understand.\n\nSo here it is...\n\n# Why so short? or Lender's Fuk Hedges?\n\nThis part is speculative but I think it makes sense and the conclusions add up. In my experience, that's usually a good place to start. (no more so than when I originally wrote this)\n\n**Why keep making or buying these synthetic shares?**\n\nIf they are in fact losing the ability to net a positive change for the short side why keep compounding the problem?...\n\n**Incentive.**\n\nI was looking through the Dave Lauer AMA and he kept mentioning rebates, not related, but it triggered this thought. I don't typically go short stocks except through options and I don't use margin. So this is only something I vaguely remembered from school and had to embarrassingly look up.\n\nBasically any time you short a stock you borrow the share from a lender and you pay a stock loan fee\n\n***value of securities borrowed X number of days borrowed X agreed rate/number of days in the year = Stock Loan Fee***\n\nIn addition you must post collateral of:\n\n***value of securities borrowed X the agreed margin = stock loan collateral***\n\nThis collateral can be non-cash (eg other liquid equities or government bonds) or you can post cash collateral.\n\n**Now here is what intrigued me.**\n\nSometimes in certain arrangements with larger investors a lender will offer a [rebate](https://www.investopedia.com/terms/s/stock-loan-rebate.asp) for using cash collateral. These rebates are a payment on interest or earnings for the cash held to cover collateral from the lender to the borrower. This rebate typically can offset all or some of the lender's fees to the borrower depending on the Securities Lending Agreement between the two parties.\n\n**So how does all this tie into GME?**\n\nThe first thing that got me looking into this was a question I get five times a day on my stream, at least.\n\n**\"Why is the borrow rate on GME so low?\"**\n\nGME has a ludicrously low borrow rate for a stock that has as much short interest (as shown above) as it does, currently 0.94%. Other stocks with I suspect are significantly less short (eg AMC: 26.64%,KOSS: 90.80%) have much higher borrow fees than GME.\n\nThis led me to the thought\n\n**\"What if it was in the lenders best interest to keep the rate as low as possible to incentivize SHFs (short hedge funds) to continue shorting the stock ?\"**\n\nIt could be if the lenders can make it lucrative for the SHFs to short why would they stop so I started building a scenario in my head what if the deal looks something like this.\n\n[ Incentivized borrowing agreement ](https://preview.redd.it/5xm15c5r6o371.png?width=1300&format=png&auto=webp&s=eb18908ca4ca150abc6725bea4786ee5b3179e75)\n\nSo the lender lays out a deal where simply by posting the cash collateral the SHF is able to short the stock at no fee while earning the interest or profits off the cash held in collateral. This incentivizes the SHF to continue shorting the stock as the are making profits while accumulating larger and larger short positions. While the Lender accrues more and more collateral.\n\nThe more cash held the higher the interest payment and the more short they can be on GME. In this scenario they are essentially being paid to short the stock.\n\n**Sounds like the deal of a lifetime. So, what's in it for the lender?**\n\nWell if I were a lender for a SHF I would have intimate knowledge of what their positions looked like. I would also know that when they extended their positions instead of closing the loans they were at risk of defaulting. If they default I keep their collateral.\n\n**Why would I only want some of their collateral when I found a way to have it all.**\n\nWell for this to work the hedge funds would have to be trapped in a cycle of shorting, a lost position with no way out.\n\n# Conclusion\n\nSo I am gonna attempt to tie all this together.\n\nMy theory is, they never covered not only because they couldn't, but also because the lenders have been incentivizing them to continue shorting through profitable rebate agreements that allow them to short the stock infinitely.\n\nWhat the lenders, I believe, realized is that the were trapped in the positions they had no option but to continue shorting the stock hoping the interest would die down and retail would back out.\n\nThe Lenders took advantage of their \"trapped\" positions by structuring deals that would help them continually short the stock at the cost of cash collateral. The lenders win either way either off the profit of the borrowed shares or accruing collateral on loans that were guaranteed to default.\n\n**The lenders are lending synthetic shares because they know that in the event of a default it won't matter, because the shares will be diluted along with the rest of the assets.** (Sound familiar? It should the lenders are doing to the SHFs, what the SHFs are doing to GameStop)\n\nThe only missing piece of this,\n\n**Do lenders pay taxes on seized collateral from a defaulted loan?**\n\nI'm currently unsure it looks like they do, but I am not experienced with tax law I have no idea the value of unrecovered synthetic shares that could be claimed as a loss.\n\nNormally I don't post my video's directly on here but this topic came up on my livestream on Friday and I covered some Q&A on it. I do not have time to transcribe it as this is the first of two DD's I will be writing today.\n\n# Video Q&A\n\nAdditionally for anybody with reading comprehension issues I hope this helps in understanding this complex topic.\n\n*\\*This video is \"monetized\" if that is something you are uncomfortable with, I understand, while I wouldn't say I profit greatly from the views, I do suggest you use ad-block when viewing it if you feel so compelled.*\n\n[Video Q&A](https://youtu.be/EIs5Ay6OEYk)\n\nAs always thank you all, my weekly technical analysis DD will coming out later tonight I will link it here when it is up\n\n❤️🦍\n\n\\- Gherkinit\n\nEdit 1: [Weekly TA DD up for 6/7](https://www.reddit.com/r/Superstonk/comments/ntsm5a/jerkin_it_with_gherkinit_forward_looking_ta_for/)\n\nEdit 2: I believe the order of liability to cover FTDs goes like this\n\n[FTD clearing chain in the event of liquidation](https://preview.redd.it/gsg8f950pq371.png?width=2054&format=png&auto=webp&s=c989d7296d8bef057d5669bd86f4dc9eacbc5448)",
    "title": "Never a Borrower Be: A synopsis of GME's 1% Borrow Rate",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ntpkuy/never_a_borrower_be_a_synopsis_of_gmes_1_borrow/"
}