{
    "author": "eternalconstruct1",
    "created_utc": 1618491723.0,
    "distinguished": null,
    "edited": false,
    "id": "mre6n9",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_mre6n9",
    "num_comments": 469,
    "permalink": "/r/Superstonk/comments/mre6n9/when_the_squeeze_happens_510_min_rule/",
    "score": 4524,
    "selftext": "Disclaimer: We do not know when the squeeze will happen. Anyone that says otherwise is lying. You can estimate, speculate - but that’s all you’re doing: estimating & speculating. \n\nWith that out of the way.. when the squeeze **DOES** happen, it is important that you follow the following steps (had I followed these in the past, I’d have had a much pleasant relationship with the stock market 💦). \n\n1. You check your phone, page, trading app and see that GME is going up rapidly. +500, +600 and even though it takes a few dips every now and then, it’s the squeeze, you know it in your bones.\n\n2. Normally, you’d jump on Reddit to celebrate with your fellow shareholders and see what they have to say about all this. Ring up a friend or a family member who know that you’re the proud owner of GME stock. You’d laugh, lash out in excitement and possible shout \"I AM JACKED TO THE TITS\" while everyone around you assumes you’re retarded. **BUT**\n\n3. Instead what you’re going to do is set your phone / laptop aside and stand up. Walk around your house, garden, university, wherever the fuck you are. Take 5-10 minutes for yourself. Away from the stock, away from your fellow apes. Let the realization sink in: the squeeze is happening. Diamond Hände. Tendies. Holy moly. Das ist der Weg. \n\n4. It’s important that you avoid thinking negative thoughts. Don’t think about how hedgies may have a trick up their sleeve that they’ll use to fuck everyone. Because they don’t. If they had, they’d have already used it. It’s inevitable that they lose. They already have. We shouldn’t underestimate our opponent, but we shouldn’t neglect the facts. Take these 5-10 minutes to think positive thoughts. Think about you, your loved ones and your fellow apes. Go over your strategy one more time, make any adjustments you want. \n\n5. After 10 min pass? Hop on Reddit and celebrate with your fellow investors. People will have calmed down by then. Do not let anyone’s opinion influence yours. Do not let the FUD get to you. As I said earlier. During the squeeze? WE SET THE PRICE. We have the leverage. \n\n**Why is this important?**\n\nBecause when the squeeze happens and you see that overwhelmingly huge green percentage on your account, you’re vulnerable. Tempted. Impulsive. Even though you know it’ll keep mooning, you MAY do something you regret later. Regardless of your exit strategy (don’t know what that is), regardless of what your personal opinion about all this is, not much will change in the first 5-10 minutes of the squeeze. The price will only keep going up.\n\nIt’s important for your mental health and proper decision making to take these 5-10 minutes off and clear your mind. To show composure and true strength of character. Do not let the money control you. Do not let the circumstances control you.\n\nThis historic event has taught us many things, one of them being the following:\n\n***When we stand together, we are strong. And no matter how rigged the system may be, we are in charge of our own lives. We can seize control and fight back, even if the odds are stacked against us.***\n\nYou doing something as simple as taking a 5 min break when the squeeze happens is proof that you’ve matured & have total control over your emotions and actions.\n\nStay safe, apes. \n\nI love you all. \n\n**THE SQUEEZE WILL TAKE DAYS. THERE WILL BE TRADING HALTS. DIPS. FUD. SHILLS. BY SHOWING RESTRAIN AND COMPOSURE AT THE PEAK OF YOUR EXCITEMENT (you’ve been waiting for this moment for months), YOU’LL BE ABLE TO OVERCOME THIS OBSTACLES WITH EASE.**",
    "title": "WHEN THE SQUEEZE HAPPENS - 5-10 min rule",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mre6n9/when_the_squeeze_happens_510_min_rule/"
}