{
    "author": "nayboyer2",
    "created_utc": 1625530931.0,
    "distinguished": null,
    "edited": 1625536147.0,
    "id": "oejtty",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oejtty",
    "num_comments": 164,
    "permalink": "/r/Superstonk/comments/oejtty/the_otc_conspiracy_gme_idiosyncrasies_and_the/",
    "score": 3859,
    "selftext": "# \"Let's take another dive into that Dark Pool data\n\n# And learn why our stonk has such a Negative Beta\n\n# High Frequency Trading, when they got stuck\n\n# TLDR:  Hedgies R Fuk\"\n\n&#x200B;\n\nI'm a long-winded SOB, so I'm going to break this into 2 parts.\n\nI'll start with Part 1 and cover November through March.\n\nI know Part 1 is a big stinky Data Dump, but I'll try to include some additional take-home points in Part 2 once they release the final May data.\n\n**Part 2** will include April through May plus some \"Bananas for Thought\".\n\nThere's a Visual TLDR at the end, so you could probably start there if you're not a data donkey like me.\n\n&#x200B;\n\nI've been looking at the OTC data for a couple of months:\n\n[Missing Bananas 1](https://www.reddit.com/r/Superstonk/comments/mvfs0c/over_30_of_gme_bananas_are_missing_from_bloomberg/) (4/21)\n\n[Missing Bananas 2](https://www.reddit.com/r/Superstonk/comments/mx4j9p/dark_pool_dd_summary_and_a_quick_update_on_all/) (4/23)\n\n[The OTC Conspiracy](https://www.reddit.com/r/Superstonk/comments/myf505/probably_the_last_dd_youll_ever_need_to_read_the/) (4/25)\n\n[The OTC Conspiracy Part 2](https://www.reddit.com/r/Superstonk/comments/n5q76p/the_otc_conspiracy_part_2_shining_some_light_into/) (5/5)\n\n[OTC Conspiracy Graph](https://www.reddit.com/r/Superstonk/comments/o5amd8/the_otc_conspiracy_this_graph_and_data_shows_gme/) (6/21)\n\nThere's no doubt in my mind that the OTC has been used for fuckery and manipulation in an effort to control the price.  For this post, I decided to evaluate the OTC from a slightly more macro perspective.  In the [OTC Conspiracy Part 2](https://www.reddit.com/r/Superstonk/comments/n5q76p/the_otc_conspiracy_part_2_shining_some_light_into/), I compared GME OTC to 33 other stocks.  The sample wasn't perfect, but it was clear GME has been traded more in the OTC than any other stock.\n\nFor this post, I wanted to look at how GME has been handled in OTC compared to the OTC as a whole.\n\n# Why should we care about the OTC?\n\nThe NYSE President, Stacey Cunningham, confirmed in an interview last month that the prices of \"meme stocks\" may be distorted because the majority of trades in those names are executed away from public exchanges where share price formation occurs.\n\nFrom the Reuters article about that interview, [Meme Stock Prices May Not Properly Reflect Demand](https://www.reuters.com/business/meme-stock-prices-may-not-properly-reflect-demand-nyse-president-2021-06-16/), Stacey Cunningham says:\n\n\"In some of the meme stocks that we've seen, or stocks that have a high level of retail participation, the vast majority of order flow can trade off of exchanges, which is problematic.\"\n\n\"That price formation is not really reflective of what supply and demand is.\"\n\n\"Individual traders contribute as much as 70% of the volume (in these stocks)\"\n\nAs the article states, the majority of retail orders bypass exchanges because of Payment for Order Flow arrangements, in which retail brokerages sell their customers' marketable orders to wholesale brokers.  The wholesalers match the orders internally, trying to profit off of the bid-ask spread, while offering retail traders the 'best market price or better'.\n\nBut the practice raises conflict of interest questions, including whether off-exchange trading - which is about 50% of the market when institutional block trades are included - distorts the price discovery mechanism for stocks, Gary Gensler said.\n\nGGee... I wonder...\n\n&#x200B;\n\n# Preface to the Data\n\nLet's jump right in.  Please note that I removed **De Minimis Firms** from my monthly data analysis because these firms are too small or too cowardly to identify themselves as GME OTC participants (was dat u Melvin?).  Each participant is identified individually in FINRA Total OTC data so it was very difficult to compare.\n\nBecause I had to remove **De Minimis Firms** from the analysis, the actual monthly GME OTC totals are slightly less than the original FINRA data that I presented in my previous posts.  However, doing this allowed me to look at each participant's monthly activity across the entire OTC and compare it to their monthly activity for GME.\n\nI have zero finance background, so I'm going to try to limit speculation as much as possible and leave that to the wrinkly-brained apes in the comments and in future posts.\n\nAll the data is directly from the [FINRA OTC website](https://otctransparency.finra.org/otctransparency/OtcIssueData).([https://otctransparency.finra.org/otctransparency/OtcIssueData](https://otctransparency.finra.org/otctransparency/OtcIssueData))\n\nFINRA somehow thinks it's fair and reasonable to release this \"top secret data\" at least 4 weeks delayed, so Part 2 will only include data through May, after it gets released tomorrow.\n\n&#x200B;\n\n# December and November OTC\n\n**A normal November and a December dial-up**\n\n[In November and December, GME OTC trades accounted for 0.11&#37; and 0.17&#37; of participants total OTC trading activity](https://preview.redd.it/gvkmrk5smh971.png?width=1580&format=png&auto=webp&s=ce9c3b62c8794e8a2cb2ef5301b070cba1fcb46d)\n\n**November:**\n\n* 8 participants\n* GME was **0.10%** of Total OTC shares traded for these participants\n* GME was **0.11%** of Total OTC trades for these participants\n* 201 million OTC trades; GME \\~ 224,000\n* OTC \\~ 313 shares/trade; GME **290** shares/trade\n* GME price \\~ $12-16\n\n**December:**\n\n* 7 participants\n* GME 0.13% of Total Shares\n* GME **0.17%** of Total Trades\n* 241 million OTC trades; GME \\~ 406,000 (**81.3%** monthly increase from November)\n* OTC \\~ 313 shares/trade; GME **247** shares/trade\n* GME Price \\~ $16-$20\n\n&#x200B;\n\nIn November, GME was 0.10% of total OTC shares traded and 0.11% of total OTC trades.  To me, it makes sense to have a similar allocation of % shares traded and % trades.  It also makes sense that the shares/trade for GME would be similar to the entire OTC marketplace (290 vs 313).  That's why I feel like November provides a good basis for comparison even though GME was heavily manipulated well before November and December 2020.\n\nIn December, we already see these numbers begin to skew.  GME was 0.13% of shares, and 0.17% of trades and the average shares/trade for GME dropped from 290 in November to **247** in December.  The average shares/trade for these participants across the entire OTC marketplace (including GME) remained at 313.\n\n&#x200B;\n\n# January OTC\n\n**The January Jump-Off**\n\n[In January, GME OTC trades accounted for 1.85&#37; of all OTC trades for these participants.  GME shares accounted for 0.51&#37; of all OTC shares traded](https://preview.redd.it/b9v5q2oqk9971.png?width=1770&format=png&auto=webp&s=15926b50d64846a4da254cc245025db4fd9e279c)\n\n**January:**\n\n* 14 participants (from 7 in December)\n* GME was 0.51% of Total OTC shares traded\n   * The monthly % increase in GME OTC shares traded OTC was over **518%** from December and over **700%** from November\n* GME was **1.85% of Total OTC Trades** for these participants\n   * Up from 0.17% in December and 0.11% in November\n* OTC \\~ 311 million trades; GME 5.76 million trades\n   * **1319%** monthly % increase in GME OTC trades from December\n   * **2473%** monthly % increase in GME OTC trades from November\n* OTC \\~ 328 shares/trade; GME **90** shares/trade\n* GME closing price \\~ $17 - $347 (but only 4 trading days closed above $100)\n\nWe know that the volume in January was literally bananas (over 1.26 billion).  And **over 49%** of that volume (over **624 million**) went to the OTC and ATS dark pools.\n\nThe GME average shares/trade decreased from 247 to **90**, while the average shares/trade for these participants across the entire OTC marketplace (including GME) **increased** from 313 to **328**.\n\nGME was **0.51%** of total OTC shares traded for these participants.\n\nMeanwhile, the idiosyncrasy of % shares and % trades was further amplified, with GME accounting for **1.85% of total OTC trades**.  So almost 1 out of every 50 OTC trades across the entire OTC marketplace for these participants was GME.\n\nMeanwhile, more than 1 out of every 50 OTC trades (**2.23%**) that **Citadel** made in January was GME (and they trade a LOT of securities).  They traded more shares OTC in January than any other month to date.  Their shares/trade for GME dropped from 360 to **98,** while their shares/trade for the entire OTC (including GME) **increased** from 353 to **390.**  They increased their GME monthly shares from 47 million in December to over 252 million (an increase of **432%**).  They made almost 2.56 million GME OTC trades, an increase of over **1840%** from December and an increase of over **3270%** from November.\n\nThey weren't acting alone.  I bolded all of the participants whose GME trades accounted for >1% of their overall OTC trades (**11 of 14 participants**).\n\n* **Virtu** increased their GME trades by over 1150%\n* **G1 Execution** increased their GME OTC trades by over **1419%**\n* **Jane Street** increased their GME OTC trades by over **1842%**\n* and **UBS Securities** increased their GME OTC trades by over **1423%**\n* **Two Sigma** (436%) and **Wolverine** (441%) also increased their trading in January\n\nTheir only chance at remaining solvent was to turn off the buy button, kick the can with married puts, and initiate Fuckery in February.\n\n# February OTC\n\n**The February Fuckery was Afoot**\n\n[Robinhood enters the fray in February, making 772,000 trades with 774,600 shares](https://preview.redd.it/szdozinfk9971.png?width=1773&format=png&auto=webp&s=408609baf93e5a3a253daf1b49bc21a6e28649c4)\n\n**February**\n\n* 14 participants (from 14 in January)\n* GME accounted for **0.31%** of Total OTC shares traded (from 0.51% in January)\n   * The monthly GME OTC shares **decreased 42.3%** from January\n   * However, the monthly GME OTC shares traded was still up over **199%** from December and over **361%** from November\n* GME accounted for **2.24% of Total OTC Trades** for these participants\n   * Up from 1.85% in January, 0.17% in December, and 0.11% in November\n* OTC \\~ 345 million trades; GME 7.73 million trades\n   * **34.2%** monthly % increase in GME OTC trades from January\n   * **1804%** monthly % increase in GME OTC trades from December\n   * **3353%** monthly % increase in GME OTC trades from November\n* OTC \\~ 283.3 shares/trade; GME **38.8** shares/trade\n* GME closing price \\~ $40-$225 (but only 3 trading days closed above $100)\n\nSo, while there was a **42% decrease** in GME shares traded OTC, there was a **34.2% increase in trades**... What else changed?\n\n**Robinhood** entered the OTC for the first time in February.  They actually eased into it nice and slow.\n\n* Week of 2/1 - 0 trades\n* Week of 2/8 - 1,675 trades\n* Week of 2/15 - 14,900 trades\n\nWarming up with a little foreplay before the real GME molestation began.\n\nDuring the week of 2/22 they made over 755,400 trades with over 757,900 of our shares.  You don't need a math degree to see that averages out to almost exactly 1.00 shares/trade.\n\nThis was likely in an effort to try to mitigate the increase in price from having to cover some of January's mountain of FTDs that weren't tucked away in options.  I remember watching these fuckers desperately try to suppress the price on 2/25 and 2/26.\n\n* We opened on 2/24 at $44 and closed at $91 on 83 million in volume.\n* We opened on 2/25 at $169, yet somehow closed at $108 on over 150 million in volume.\n* On 2/26, we opened at $117 and closed at $101 on over 92 million in volume.\n\n**I thought this deserved a closer look.**\n\n[February Fuckery was afoot during the week of 2\\/22.  Robinhood made almost 24&#37; of the GME OTC trades that week, more than even Citadel and trailing only Virtu](https://preview.redd.it/ci4tbrc4a9971.png?width=1715&format=png&auto=webp&s=0b2049cab89ede5ab148f33a867774c890431c51)\n\n**Robinhood** accounted for almost **24% of GME's weekly OTC trades**, trailing only Virtu.  They made more GME OTC trades than **Citadel**.  GME accounted for almost 17.5% of their total OTC shares and almost **18.7%** of their total OTC trades.\n\nGME was over **5.56%** of the total OTC trades for these participants during the week of 2/22, but only **0.70%** of the volume.  GME was over **3%** of total OTC trades in 13 out of the 15 participants (in bold).\n\n**There were over 3.157 million GME trades on the OTC during this one week**!\n\nTo put that into perspective, the number of GME OTC trades in December was **406,000** and the number of GME OTC trades in November was less than **224,000**.  In fact, there was **225% more** GME trades made in the OTC in that one week than September, October, November, and December **COMBINED** (1.4 million trades).\n\nThe average shares/trade across the entire OTC (including GME) for these participants was over **305**.  The average shares/trade for GME was **38.5**.\n\nI'm sure there are more connections we can make from this one week of data, but for brevity sake, I'm going to zoom back out to the monthly data.\n\n&#x200B;\n\nIn February, **Citadel** was able to **decrease** the number of GME shares traded OTC by over 54% from January.  However, Citadel actually **increased** the number of GME trades made OTC by **3.73%** from January (an increase of **1912%** from December and **3396%** from November).  Their average GME shares/trade decreased from 98.6 in January to **43.6** in February.  Their average shares/trade across the entire OTC (including GME) dropped from 390 to **330**.  GME was still over 2% of their total OTC trades, but only 0.27% of their total OTC shares.  It certainly seems like Ken was playing high frequency patty cake with his good pal Vlad, now that RH had conveniently joined the OTC frenzy.\n\nCitadel and Robinhood weren't the only participants to participate in this HFT frenzy.  **Virtu** decreased their GME OTC shares traded by 15%, but **increased** the number of GME OTC trades by 12.25%.  Their average shares/trade GME dropped from over 77 in January to 58 in February.  GME accounted for 0.36% of their total OTC shares, but 1.94% of their total OTC trades.\n\n**Wolverine** went from 98 GME shares/trade in January to **3.85** shares/trade in February.  They did so by **decreasing** the shares traded by 91%, while **increasing** the number of trades by 127.6%.  GME was 0.03% of their total OTC shares traded, but **2.23%** of their total OTC trades.  No wonder why they sold their GME.\n\n**G1 Execution** dropped their GME shares/trade from 142 in January to **28.8** in February.  They decreased their monthly GME shares traded by 64% and **increased** their monthly trades by almost **78%** from January **(up 2602% from December and 4033% from November)**.  GME was over 3.8% of their total OTC trades, but only 0.45% of their OTC volume.  Their shares/trade decreased from 142 in January to 28.8 in February (vs 244.7 for the entire OTC including GME).\n\n**Two Sigma** increased their GME OTC trades by almost 83% from January (up 881% from December and 1541% from November), but increased their shares by only 17.8%.  Their shares/trade for GME dropped to an all-time low of 17.75.\n\nI could keep going with February Fuckery, but let's move on to The March Manipulation.\n\n&#x200B;\n\n# March OTC\n\n**The March Manipulation**\n\n[Robinhood upped the ante with 1.656 million trades using 1.658 million shares.  The total percent of OTC trades that was GME increased for the 5th straight month to 2.32&#37;.](https://preview.redd.it/ponb5hgvj9971.png?width=1621&format=png&auto=webp&s=8799c8667e212f9fc0a61ca930fa8c82228fc9ce)\n\n**March:**\n\n* 12 participants (from 14 in February)\n* GME accounted for **0.30%** of Total OTC shares traded (from 0.31% in February)\n   * The monthly GME OTC shares decreased **17.07%** from February\n   * However, the monthly GME OTC shares traded was still up almost **148%** from December and almost **283%** from November\n* GME accounted for **2.32% of Total OTC Trades** for these participants increasing for the 5th straight month\n   * Up from 2.24% in February, 1.85% in January, 0.17% in December, and 0.11% in November\n* OTC \\~ 329 million trades; GME 7.65 million trades\n   * **1.06%** monthly % **decrease** in GME OTC trades from February\n   * **32.8%** monthly % increase in GME OTC trades from January\n   * **1784%** monthly % increase in GME OTC trades from December\n   * **3317%** monthly % increase in GME OTC trades from November\n* OTC \\~ 255.3 shares/trade; GME **32.5** shares/trade\n* GME closing price \\~ $120-$265 (9 out of 20 trading days closed above $200)\n\nThe GME shares/trade dropped to an all-time low of **32.5**.  **Robinhood** increased their GME OTC shares traded and number of GME OTC trades by **114%** each.  March was the month of the great Robinhood exodus, and it's likely that they began scrambling for shares.  GME was over 7% of their total OTC shares and over 7.3% of their total OTC trades.\n\nThe idiosyncrasies between % of total shares (0.30%) and % of total trades (**2.32%**) continued to widen.  This is shown in the decreasing shares/trade and in the monthly % change (-17% shares vs -1% trades).\n\n**Citadel's** shares/trade for the entire OTC was almost 317.8, while their shares/trade for GME was 42.6.\n\n**Jane Street** continued to increase their GME OTC trading activity by another 60% in March (a **3705%** increase from December and **6614%** increase from November).\n\n**Virtu** continued to decrease their shares traded, while increasing their GME trades.  They were the most active GME OTC participant in March, making almost 2 million trades, while dropping their shares/trade from 58 to 48.  Meanwhile, their shares/trade across the entire OTC (including GME) was 279.\n\n**The week of March 8th was kind of wacky:**\n\n[Robinhood leads the entire GME OTC in Trades](https://preview.redd.it/z2yxmkqj8a971.png?width=1638&format=png&auto=webp&s=82e40b3b4208b6c5f88ddada08f96cd27d021d1f)\n\n**Robinhood** was **1.00%** of the weekly OTC shares, but used those 765,000 shares to make over 763,000 trades, which was **25.78%** of the weekly total.  They made more OTC trades than any other participant.  GME was almost **20%** of their total OTC shares and almost **21%** of their total OTC trades.  \n\nThink about how many GME shares Robinhood had on default Margin in January...  The mass exodus foiled their plan.\n\nThere were **2.96 million** GME OTC trades in one week.  That's **211%** **more** trades in one week than September, October, November, and December **COMBINED** (1.4 million trades).\n\nShares/trade for the entire OTC (including GME) was **319.46**, while shares/trade for GME was **25.85**.\n\nGME accounted for **0.50%** of the total OTC shares, but **6.15%** of the **total OTC trades**.  GME accounted for more than 3% of their total OTC trades for 13 out of 15 OTC participants.  For G1 Execution, GME accounted 0.86% of their total OTC shares, but 9.20% of their total OTC trades.\n\nGME was only 0.57% of **Virtu's** OTC shares, but almost **5%** of their total OTC trades.\n\nGME was only 0.36% of **Citadel's** OTC shares, but **4.16%** of their total OTC trades.\n\n&#x200B;\n\n# For the Visual Apes\n\n# Let's end Part 1 with little TLDR:\n\nMonthly GME OTC trades September - March\n\n[Huge increase in GME OTC trades](https://preview.redd.it/72uezos4dh971.png?width=699&format=png&auto=webp&s=8e742a99fde0798cfd6f2d0b435517d2dfddbdf6)\n\nWeekly GME OTC Trades (late September - March)\n\n[These weeks seem to stand out...](https://preview.redd.it/g6b7rhlbhh971.png?width=1004&format=png&auto=webp&s=cd6de72fae89ad38c842e13a69ff3cb574f65621)\n\nGME monthly Shares/Trade OTC from September - March\n\n[Shrinking shares\\/trade](https://preview.redd.it/kuohghnugh971.png?width=745&format=png&auto=webp&s=0047c2b43cf6d878f2ab42a52367c81526125272)\n\nGME Shares/Trade OTC vs. Entire OTC Marketplace (including GME) - November - March\n\n[Shrinking shares\\/trade - Spoiler alert, it's only getting worse...](https://preview.redd.it/moaplsfrgh971.png?width=983&format=png&auto=webp&s=329a69fd0e09fc69f38a60578cf8ce3880660a04)\n\nLastly, using an estimated GME Float of 26.7 million (January - March before share offerings), and comparing it to a few other stocks (see [OTC Conspiracy Part 2](https://www.reddit.com/r/Superstonk/comments/n5q76p/the_otc_conspiracy_part_2_shining_some_light_into/) for more info and examples):\n\n[Over 4000&#37; GME Float traded OTC in Q1](https://preview.redd.it/ifaffppgjh971.png?width=1198&format=png&auto=webp&s=2dafcba6ae97dffa86c4ad806dac09bcafcdcf6a)\n\nPart 2 coming soon!\n\nBuy, HODL, and Buckle Up!  Power to the Players",
    "title": "The OTC Conspiracy - GME, idiosyncrasies, and the infinite Banana Trees (Part 1)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oejtty/the_otc_conspiracy_gme_idiosyncrasies_and_the/"
}