{
    "author": "RatioAtBlessons",
    "created_utc": 1617065575.0,
    "distinguished": null,
    "edited": false,
    "id": "mg437h",
    "text_only": true,
    "flair_id": "17e85f56-584b-11eb-a9a8-0e508049721d",
    "flair_text": "Fluff",
    "name": "t3_mg437h",
    "num_comments": 1387,
    "permalink": "/r/GME/comments/mg437h/61727054_says_ken_is_next/",
    "score": 3040,
    "selftext": "I know that you know what that number relates to Ken. I know that you have a plaque in your NY office with that on it. Actually..It’s known that London, Chicago, New York all have 61727-054 cleverly placed and/or referred to. \n\n61727-054 *bold move*\n\nFor the longest time you’ve done everything possible to exceed where they failed. For years now you’ve shared your goals and your ambitions when it comes to Citadel. To be the biggest you’ve gotta slay the legend. You’ve never shied away from letting those around you know what your aim is..what really fuels you everyday, every account, every trade. To be the king of Wall St. Bigger and scarier than the Wolf. A legend. A myth. \n\n...A genius. Just like xXx did it but better. They got tired and worn out. You’ve always considered that their weakness. They were only able to keep it going for so long, you’ve always felt as though you could get away with it forever. \n\nI must admit..you’ve been clever. You’ve taken what you learned and have adapted quite well. That was until you allowed two mistakes to be made.\n\nI didn’t catch it before in 2019 when I started to peek behind the curtains and peel back the layers. But I have now and day by day so do others. Just like you...plain sight. \n\nThe more I think about it and the more research that I do into the books, I can’t believe that NO ONE outside a handful of others have recognized the patterns. But that’s okay..because 🦍’s are getting ever so closeclose. So many 🦍’s are on the path, they just haven’t stumbled upon the right trees and bushes. Yet. \n\n{Insert Rozay} *I remember being blind to it\nTil the day I put my mind to it*\n\nFunny how alumni networks have become so clutch over the past year(Fuck Covid, amirite?)..Without them how would some dumb ape be able to gain access to the Citadel Securities Department of Computer Science at a certain uni..😳🤭🤫\n\njUsT me babooning but word on Sixth St. is that your frienemies on Congress Ave. are running out of leverage when it comes to that quiet little office in Austin. \n\nJust a matter of tick tocks ‘til the real show begins Ken. What’s your move then?",
    "title": "61727054 Says Ken is Next",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/mg437h/61727054_says_ken_is_next/"
}