{
    "author": "greysweatseveryday",
    "created_utc": 1619128925.0,
    "distinguished": null,
    "edited": 1619193510.0,
    "id": "mwg1z9",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mwg1z9",
    "num_comments": 139,
    "permalink": "/r/Superstonk/comments/mwg1z9/lesson_one_how_to_create_12_trillion_of_value_on/",
    "score": 1516,
    "selftext": "*EDIT 1: I added a follow up DD using data and SEC rules to discuss whether this is even possible to pull off:* [*https://www.reddit.com/r/Superstonk/comments/mwyeef/lesson\\_two\\_why\\_hedgies\\_using\\_cxc\\_is\\_unlikely\\_but/*](https://www.reddit.com/r/Superstonk/comments/mwyeef/lesson_two_why_hedgies_using_cxc_is_unlikely_but/)*. I think it would be extremely unlikely for this to actually have happened, but theoretically it is possible.* \n\n&#x200B;\n\n*This post is for entertainment purposes only. As an ape with a diet of crayons and bananas, I like writing screenplays like the following hypothetical.*\n\nThis lesson will be told by way of a story. More details can be found here:\n\nTHE SETUP\n\nThere once was a young, bright boy named Brad or Chase or some shit. He goes to work for a hedge fund. The hedge fund shorts a company to the tits and, to its great surprise, the company doesn’t go under. A battle ensues for months. Billions of dollars lost. New rules require the fund to post collateral to keep their short options open.\n\nThe head of the fund, Ben Biffin, is a known hothead who calls everyone into his office. Ben says “Brad/Chase, you wanna be a swinging dick here, here’s your shot. How do we generate billions of dollars of value so you get that Ferrari 812 Superfast you’ve been eyeing?”\n\nBrad/Chase says “Pfff, you want a billion, I’ll give you a trillion.”\n\nHe begins to describe his plan.\n\nTHE PLAN\n\nWe’ll use crypto. There have been hundreds of pump and dump schemes, but the greatest thing here is that we don’t even need to worry about it dumping. We’ll use an obscure coin traded on a couple unknown exchanges with no volume (say CXC [https://coinmarketcap.com/currencies/capital-x-cell/](https://coinmarketcap.com/currencies/capital-x-cell/)).\n\nWe’ll buy up the coins, there’s no liquidity so we will determine the price. I’m going to need a couple million dollars.\n\nBen says “This better be worth it – make it happen. Call our friends, they need the help too. But your ass is on the line if this fails.”\n\nTHE EXECUTION\n\nSo this coin is bought on the exchange. More than $2 million is traded for the day and the price shoots up from $0.09415 to a high of $3,500.31 and settles around $2,900 per CXC. On paper the market cap of this coin is $1,197,892,409,126.76 or $1.2 TRILLION.\n\nTHE COVER UP\n\nNow Brad/Chase talks to the accounting group. “We have the current market value for a shitcoin of $200 billion (our friends hold another $200 billion worth). Hide it in our commodities and financial instruments assets in our balance sheet so the SEC sees how sexy our collateral is and gives us some of their zipple.” The accounting group gets to work.\n\nThe news publishes a story, “Record gains for hedge fund during quarter”. The regulator is satisfied because the assets underlying the risky shorts appear to more than cover their exposure. Brad/Chad gets his sweet ride. Apes continue to hold the company’s shares waiting for a squeeze or the head ape to transform the company into an e-commerce giant – in any case, the squeeze is kicked down the road, while Ben and Brad/Chase continue their scheming.\n\n***What do you think of this tale?***\n\n***Sounds insane? It is insane. I’ve never been able to get the crayons out of my fur or out from between my teeth. Don’t trust me.***",
    "title": "Lesson One: How to Create $1.2 Trillion of Value on Paper for Around $2 Million",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mwg1z9/lesson_one_how_to_create_12_trillion_of_value_on/"
}