{
    "author": "dlauer",
    "created_utc": 1620396225.0,
    "distinguished": null,
    "edited": false,
    "id": "n6z8rs",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n6z8rs",
    "num_comments": 64,
    "permalink": "/r/Superstonk/comments/n6z8rs/recommended_reading/",
    "score": 1610,
    "selftext": "When I first got a job trading, my boss recommended a couple of books - everyone in the industry has read them. Many of you probably have too, but just in case I thought I'd post this list. I'd love to hear other recommendations in the comments - most of what I read is sci-fi, history, physics and AI.\n\nI'll also link to the Strand, because it's the best book store, and wherever possible we should try to not give money to monopolists like Amazon:\n\n* [Reminiscences of a Stock Operator](https://www.strandbooks.com/product/9780486439266?title=reminiscences_of_a_stock_operator), by Edwin Lefevre\n   * This is the classic. You must read this if you haven't. There's nothing new under the sun. What you're attempting to do with GME is to corner the market, a tactic as old as markets. I've read this book several times and it gets better every time. There's a [new edition](https://www.strandbooks.com/product/9780470481592?title=reminiscences_of_a_stock_operator_with_new_commentary_and_insights_on_the_life_and_times_of_jesse_livermore) available too, which I haven't gotten but have heard great things about.\n* [Against The Gods: The Remarkable Story of Risk](https://www.amazon.com/gp/product/0471295639/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0471295639&linkCode=as2&tag=urvinai-20&linkId=43635b8d6bd06a5e37fbd6f8de072107), Bernstein\n   * This is the history of risk - how we understand it, and how that understanding has evolved. Traders that survive are the ones who understand risk. I've linked to Amazon because I couldn't find it on the Strand.\n* [When Genius Failed: The Rise and Fall of Long-Term Capital Management](https://www.strandbooks.com/product/9780375758256?title=when_genius_failed_the_rise_and_fall_of_longterm_capital_management), Lowenstein\n   * The story of LTCM - the smartest people in the room who couldn't manage risk and nearly took down the US economy when they went bust.\n* [The Misbehavior of Markets](https://www.amazon.com/gp/product/0465043577/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0465043577&linkCode=as2&tag=urvinai-20&linkId=baf61ff7c5fd646b8e1e82d45ffca496), by Benoit Mandelbrot\n   * This is more for the math geeks who want to read about markets and fractals. I've linked to Amazon because it's not available on the Strand's website.\n* A Random Walk Down Wall St, Malkiel\n   * It's been a while since I read it, but I remember it being an excellent overview of markets and trading. It doesn't get deep into market structure, but it's comprehensive otherwise.\n   * [Strand](https://www.strandbooks.com/product/9780393358384?title=a_random_walk_down_wall_street_the_timetested_strategy_for_successful_investing_twelfth_edition) (only a couple copies left) or [Amazon](https://www.amazon.com/gp/product/0393358380/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0393358380&linkCode=as2&tag=urvinai-20&linkId=a4f466dfc73482a77ac3fee3a9ba3062)\n* [Liar's Poker](https://www.strandbooks.com/product/9780140143454?title=liars_poker_rising_through_the_wreckage_on_wall_street) and [Flash Boys](https://www.strandbooks.com/product/9780393351590?title=flash_boys_a_wall_street_revolt), Lewis\n   * I'd be remiss if I didn't call out Michael Lewis (who I had the pleasure of meeting when he was writing Flash Boys). Liar's Poker is an awesome book about the bond trading culture. Flash Boys has some issues - he got a lot right and he got a lot wrong. But he really highlighted the conflict-of-interest that brokers face, and I thought that made the book worthwhile. \n* Honorable mentions:\n   * [The Predictors](https://www.strandbooks.com/product/9780805057577?title=predictors_how_a_band_of_maverick_physicists_used_chaos_theory_to_trade_their_way_to_a_fortune_on_wall_street), Bass - I read this book in the midst of learning about complex systems and chaos theory, it's the perfect complement to that if you're interested in the intersection of trading and chaos theory.\n   * [Dark Pools](https://www.strandbooks.com/product/9780307887184?title=dark_pools_the_rise_of_the_machine_traders_and_the_rigging_of_the_us_stock_market), Patterson - One of the more accessible takes on modern market structure, Scott does a great job of illustrating the influence of HFT, broker-owned dark pools, and electronic trading. He also wrote [this article](https://www.wsj.com/articles/SB10000872396390443890304578006603819735098) about me, so he's cool.\n   * [My Life as a Quant](https://www.strandbooks.com/product/9780470192733?title=my_life_as_a_quant_reflections_on_physics_and_finance), Derman - A fun read about the origins of quantitative trading, the precursor to HFT.\n\nThere are a couple of other much deeper books that get into market structure, execution cost analysis, and other more esoteric topics, but the books above are accessible for everyone and I think are generally great reads.",
    "title": "Recommended Reading",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6z8rs/recommended_reading/"
}