{
    "author": "Leenixus",
    "created_utc": 1620372234.0,
    "distinguished": null,
    "edited": 1620411914.0,
    "id": "n6sv66",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n6sv66",
    "num_comments": 246,
    "permalink": "/r/Superstonk/comments/n6sv66/russel_1000/",
    "score": 4449,
    "selftext": "***Not financial advice.***\n\nThere is 1 big bullish event no one's talking about. I've posted about it 3 times before, let's go for attempt #4.\n\n* **TLDR:** GME might join a super massively big Index. The Russel 1000 series of Indexes.\n* **TLDR 2:** This could be an anti-catalyst, not sure. Unconfirmed, must wait and see what happens if anything happens at all. Perhaps there could be an initial sell off if we move from one Index to another or other unforeseen price drops for reasons i don't know.\n\n**NOTICE:** Probably not happening, there's 1 funny requirement for joining the Russel 1000 that GME does not tick the box for.\n\nCompanies with only a small portion of their shares available in the marketplace are not eligible for the Russell indexes. Companies with less than an absolute 5% of shares available will be removed from eligibility. See Section 7: Adjustments to Members’ Shares Outstanding (Float), for details on calculations of available shares. \n\nLMAO\n\n# What the hell is the Russel 1000 and why should i give a shit?\n\n**TLDR:** Tons of non-GME lovers buy GME daily by buying ETF shares. If we join the Russel 1000, this is bullish as fuck. The price will go vroom vroom.\n\n\\-----\n\nRight now, the biggest index containing GME is the Russel 2000. Yes the 2000, not the 1000.\n\nSimply by joining this index, because it's a bigger index than the Russel 2000, ETFs that hold GME will have to increase their holdings of GME accordingly and this means buying more GME shares.\n\n**Well, put simply, the price would start going vroom vroom!**\n\n&#x200B;\n\n&#x200B;\n\n# How big is this Russel 1000 thing?\n\n**TLDR:** Pictures speak volumes, so i'll just leave this here. Ticker IWC.\n\nhttps://preview.redd.it/qjekdww2lox61.png?width=712&format=png&auto=webp&s=6d4acc6a939a19be33b9b28b5eeb776c03272cfd\n\nI don't know if we'll be leaving one Index to join the other or if we will be in both.\n\n&#x200B;\n\n&#x200B;\n\n# When do they check if GME is eligible to join?\n\n**TLDR:** Not guaranteed we're 100% joining yet, but we'll know soon. The process starts TODAY (May 7)\n\n\\-----\n\n**Russel Ranking Day**\n\nTODAY (May 7) the FTSE Russel people are going to start the process of **ranking** a bunch of stocks out there to figure out which ones should join the Russel 1000 (or get removed from it cause they turned to shit).\n\nThis is called the **Russel Ranking Day.**\n\nSource and details here: [https://www.ftserussell.com/resources/russell-reconstitution](https://www.ftserussell.com/resources/russell-reconstitution)\n\nhttps://preview.redd.it/oeon01ejcnx61.png?width=962&format=png&auto=webp&s=ff325712a067b75b222f7d8a1dc49940ee203efc\n\n&#x200B;\n\n# What's going to happen when if we do join\n\n**TLDR:** Massively bullish. The ETFs who follow the Russel Indexes will have to buy more GME shares so they can offer them to their buyers. BUY = PRICE UP = Happy Ape\n\n\\-----\n\nThe change in the contents of ANY Index is called **\"Reconstitution\"**. This is because the Index reconstitutes itself, it changes it's contents e.g stocks that it contains, hence the word \"**Reconstitution**\".\n\n&#x200B;\n\nIn the last Reconstitution in 2020, **this happened!**\n\n[Nice](https://preview.redd.it/grjmwk69cnx61.png?width=933&format=png&auto=webp&s=7b87902ee51d7693b08dd673ce80f5217846a473)\n\n* This doesn't mean you'll see VOLUME = 69.9 Billion (nice) for GME on the day of the **Reconstitution**.\n* ~~You are likely to see a big number close or above~~ **~~100 Million~~** ~~(guestimate) as they buy the shares they need for their ETF.~~\n\nYou know what that means you dirty monkeys.\n\n[https:\\/\\/en.wikipedia.org\\/wiki\\/Jacques\\_Tits](https://preview.redd.it/v0kyut45enx61.jpg?width=1280&format=pjpg&auto=webp&s=d8f74fa19854a0978beda790603267e1296dc7c3)\n\n&#x200B;\n\n&#x200B;\n\n# Aight, so when are we joining this Russel 1000 thing?\n\n**TLDR:** June 25 (Really it's June 28)\n\n\\-----\n\nThe reconstitution finishes on June the 25'th (Friday)\n\n[https://www.ftserussell.com/resources/russell-reconstitution](https://www.ftserussell.com/resources/russell-reconstitution)\n\n&#x200B;\n\nhttps://preview.redd.it/w0w8266wenx61.png?width=947&format=png&auto=webp&s=9a5c9b41140715097e723e3bef788927bf312d23\n\n&#x200B;\n\nThe actual finished and reconstituted Index will be available to trade on the 28'th of June (Monday). We will find out whether we're actually truly joining the Russel 1000 series of Indexes sometime from TODAY until the 25'th of June.\n\n**So sometime in the next 49 day from today May 7, we'll know whether we're joining.**\n\n&#x200B;\n\n&#x200B;\n\n# How do they decide whether we're good to join?\n\n**TLDR:** If stock price is high enough = Join\n\n\\-----\n\nIf you're a wrinkly brained bastard with free time, the methodology on how they pick stocks during the Ranking is available here\n\n[https://research.ftserussell.com/products/downloads/Russell-US-indexes.pdf](https://research.ftserussell.com/products/downloads/Russell-US-indexes.pdf?_ga=2.22793595.1387236641.1620369231-174493700.1617795049)\n\n&#x200B;\n\nFrom what I've read, we're good to join. Have a read as well and **\"AKSHUALLY\"** me if you think i'm wrong.\n\n[Kidding tho, do correct me if i'm wrong in something and i'll amend the post.](https://preview.redd.it/l1n21bkfgnx61.png?width=680&format=png&auto=webp&s=92f7f9a0278d9f3cbded903f684bb1a244f81962)\n\n&#x200B;\n\n# Try not to ignore important shit like this\n\nThis sub (Some users) is pretty reactionary and disses future looking (speculative) information. I'm here to shit on those users.\n\nThis is important future looking information you need to take in consideration. For you who are totally smoothbrained, don't be disappointed if nothing happens. GME will still moon.\n\n*\"Simple as\" - Baz*\n\n&#x200B;\n\nThe Russel 1000 isn't 1 Index. It's a series of Indexes like Kathy Woods ARK ETFs (but isn't an ETF). Just like she has ARKW, AWKW and so on... the Russel series of ETFs have Russel 1000 Growth, Russel 1000 Value and so on. I don't know which one we might be joining.\n\n&#x200B;\n\nMore Russel Info\n\n[https://research.ftserussell.com/products/downloads/Russell-US-indexes.pdf](https://research.ftserussell.com/products/downloads/Russell-US-indexes.pdf)\n\n&#x200B;\n\n**Random info**\n\n* We're not joining the S&P500 anytime soon. They need \"the sum of the previous four quarters of earnings must be positive as well as the most recent quarter.\"  [https://www.investopedia.com/articles/investing/090414/sp-500-index-you-need-know.asp](https://www.investopedia.com/articles/investing/090414/sp-500-index-you-need-know.asp)\n\n&#x200B;\n\n[\\\\\"Original Content\\\\\"](https://preview.redd.it/otlnmbdjfnx61.png?width=554&format=png&auto=webp&s=a6516c3fcdd2a01b3465ad9371bf83ed9d4aa866)\n\n**Edit: Corrected ETF/Index wording.**\n\n**TLDR:** MAYBE WE JOIN BIG INDEX AND GME PRICE GO VROOM VROOM OR MAYBE NOT",
    "title": "Russel 1000",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6sv66/russel_1000/"
}