{
    "author": "Wild_Investigator622",
    "created_utc": 1625048569.0,
    "distinguished": null,
    "edited": 1625063445.0,
    "id": "oauenv",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oauenv",
    "num_comments": 1098,
    "permalink": "/r/Superstonk/comments/oauenv/found_out_why_the_lights_are_on_at_jp_morgan_in/",
    "score": 11406,
    "selftext": "EuroApe here looking at Euro stuff. So it looks like JP Morgan have been using their weekends to borrow money, filing several charges as recently as Saturday ((Edit: Friday* not Saturday as has been pointed out to me, I am shit at dates as it turns out)! And from who you ask....\n\nBNY Mellon - the same crazy cats that I previously discovered had Citadel Europe by the balls and all of their assets as collateral.\n\nHere is a link to where their registered charges are listed: [JP Morgan Securities PlC - Registered Charges](https://find-and-update.company-information.service.gov.uk/company/02711006/charges)\n\nHere is a capture of their activity this year basically every month since Feb (didnt do all of them because there is a lot check the other link for all): http://imgur.com/gallery/jvYbM88\n\nAs you can see very busy! However, when you go on the first link provided you may look back and say well hey JP have always been doing this. But... and it is a juicy But...\n\nThe collateral for these borrowings have gone from bonds to senior preferred notes since late March. A senior note is a type of bond that takes precedence over other debts in the event that the company declares bankruptcy and is forced into liquidation. \n\nExample from one of the charges: http://imgur.com/gallery/M7AH48y\n\nNow if you're still not convinced, I had a look through the 68 page charge documents and realised that pre Feb they were a couple of pages short. So I dived in to find out what had changed. Lo and behold the couple of amendments to the master agreement in regards to BRRD:\n\nhttp://imgur.com/gallery/pxuDy1p\n\nWhat is BRRD you ask? It's the Bank Recovery and Resolution Directive. And what are Bank Resolutions?\n\nA bank resolution occurs when authorities determine that a failing bank cannot go through normal insolvency proceedings without harming public interest and causing financial instability. Meanwhile, any part of the bank that cannot be made viable again goes through normal insolvency proceedings.\n\nThe entire directive can be found here provided by the EBA (European Banking Authority):\n\nhttps://www.eba.europa.eu/regulation-and-policy/single-rulebook/interactive-single-rulebook/2602\n\nJust before I go, sorry everything is linking to imgur but I dont know how to include pictures within text body. \n\nTLDR: JP Morgan borrowing money and look like they may explode.\n\nEdit: 📢 Just discovered JP Morgan Services LLP, which is significantly controlled by JP Morgan Securities PLC are in liquidation. Commencement of winding up on 26 March 2021....... Link: https://find-and-update.company-information.service.gov.uk/company/OC303065/insolvency Edit 0.1: this is a voluntary insolvency so they are solvent and could pay all their Liabilities, question is just why they decided to liquidate and why now since it was formed in 2002.\n\nEdit 2: apologies everyone I'm at work so haven't been able to follow and respond to all the comments. Also, getting some comments about taking this with a pinch of salt and being cautious and I have to say I agree! It looks sus to me and this post reflects my view on it but if any wrinkly apes want to dive in and debunk this or prove that none of these things mean anything then please do, we are all here to learn! As for the actual content the charges are fact, the collateral requirements are fact, the amendment to the agreements to include BRRD are fact, everything else is me trying to connect the dots!",
    "title": "📢 FOUND OUT WHY THE LIGHTS ARE ON AT JP MORGAN IN THE WEEKENDS! AND SIGNS THEY MAY GET EVAPORATED! 📢",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/oauenv/found_out_why_the_lights_are_on_at_jp_morgan_in/"
}