{
    "author": "pizza-adventure",
    "created_utc": 1625058468.0,
    "distinguished": null,
    "edited": 1625088147.0,
    "id": "oawz36",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oawz36",
    "num_comments": 946,
    "permalink": "/r/Superstonk/comments/oawz36/shit_is_about_to_pop_off_delicious_confirmation/",
    "score": 14941,
    "selftext": "Edit: Lots of apes are asking for the inputs that I use to generate the version of the indicator depicted below. I’ll drop another post that gives you all the specifics 😘\n\nIt may not be the MOASS but the ***Game of Stonks*** is about to blow the fuck UP!!!\n\nHow do I know this... Well, let me introduce you apes to a little indicator that has done me well in the past... **CRSI**\n\n**For the smooth ones:** CRSI is a technical analysis indicator created by Larry Connors that is  actually a composite of three separate components. The Relative Strength  Index (RSI), developed by J. Welles Wilder, plays an integral role in  Connors RSI. In fact, Wilder's RSI is used in two of the indicator's  three components. The three components; The RSI, UpDown Length, and  Rate-of-Change, combine to form a momentum oscillator. Connors RSI  outputs a value between 0 and 100, which is then used to identify  short-term overbought and oversold conditions.\n\n***Connors RSI outputs a value between 0 and 100, which is then used to identify short-term overbought and oversold conditions.***\n\nSource: [https://www.tradingview.com/support/solutions/43000502017-connors-rsi-crsi/](https://www.tradingview.com/support/solutions/43000502017-connors-rsi-crsi/)\n\nIf you leverage the RSI indicator in your TA then you're basically familiar with the CRSI but there is a catch... The CRSI is a leading indicator which makes it useful in recognizing moves before they happen, which can be beneficial at times...\n\nAnyway... I use this indicator on the 1D chart and have been for sometime now. I wanted to show you apes something. Something that has my tits jacked beyond the typical state of jacked tits. You ready?\n\n[Red = Suppression \\/ Green = Run](https://preview.redd.it/lkjvrx5rzg871.png?width=349&format=png&auto=webp&s=f0e25126d36c040edc003ad70ba6b5e200f4f830)\n\n&#x200B;\n\nWhy is this important? Well, when I look at this I see manipulation. We all know what was happening around this time and the CRSI was showing how hard the hedgies were keeping the stonk down before the March run up... Literally 18 straight days of price suppression and then — **KABOOM**!\n\nFast forward to today... I started to notice something... The CRSI was floored again, just like it was in February but I needed more data to confirm, so I waited... And guess what you beautiful motherfuckers — **WE'RE HERE AGAIN!!**\n\n&#x200B;\n\n[June suppression @ 14 days and counting 🚀 ](https://preview.redd.it/sib3w3rqyg871.png?width=432&format=png&auto=webp&s=b12b7cd30fa52c2d3da2dba67ff3d7cb834ff444)\n\n☠️ KENNY'S FLAT LINING AGAIN ☠️\n\nHistorically, we've seen explosive price action after such a period of the stonk being oversold... I don't know how much longer they have until the next run up, **BUT IT AIN'T MUCH LONGER!**\n\n&#x200B;\n\n# TLDR; The stonk is oversold at levels we haven't seen since the March run up, which suggests that there's going to be a significant price movement toward the upside sooner than later.\n\n# TITS JACKED • NO DATES • BUY • HOLD • BUCKLE UP 🚀💎✊\n\nClearly, not financial advice...",
    "title": "SHIT IS ABOUT TO POP OFF 🚀 ( Delicious confirmation bias )",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oawz36/shit_is_about_to_pop_off_delicious_confirmation/"
}