{
    "author": "DropDeadDevon",
    "created_utc": 1625094759.0,
    "distinguished": null,
    "edited": 1625099757.0,
    "id": "ob8zgz",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ob8zgz",
    "num_comments": 137,
    "permalink": "/r/Superstonk/comments/ob8zgz/the_real_use_case_behind_the_gamestop_nft_and_why/",
    "score": 1664,
    "selftext": " Hello everyone, there's been a lot of talk lately about what GameStop could possibly announce in relation to the [NFT teaser](https://nft.gamestop.com/). Most of the discussion I've seen has been about GameStop issuing a c r y p t o dividend ala Overstock, as discussed in this [DD](https://www.reddit.com/r/GME/comments/n0vtbu/how_gamestop_could_issue_crypto_dividends_and/). While I believe this is definitely possible, I also believe there is something much bigger they could do with it. This post was prompted by this comment from u/JustTheBigMan \n\n&#x200B;\n\n[Microtransactions](https://preview.redd.it/yeknixpoeh871.png?width=685&format=png&auto=webp&s=42bd539014174cb4412f8ef25ea037d1fbad4327)\n\n  The  big money in gaming is here, in **microtransactions**. As a fellow gamer, I do hate it. But as a GameStop shareholder, I absolutely think they  should take advantage of it. People would shell out thousands for an exclusive skin/weapon used by their favorite streamer/Esports competitor. Even more if it was sold in an auction setting. \n\nTo give you some examples of how much money microtransactions can bring in;\n\nGTA V is the best example in my mind of how powerful microtransactions are.  It’s releasing on its third console generation because of the revenue generated from microtransactions. There was originally supposed to be single player DLC for GTA V [but it was cancelled](https://www.sportskeeda.com/gta/gta-5-throwback-rockstar-games-cancelled-plans-single-player-dlc) to focus on the online. Instead the developers decided to release free content updates to push microtransactions, and it's worked out pretty well for them. The game managed to make **over $500 million in microtransactions** in 2019 alone, and total mTX revenues were up 40% YoY in Take-Two's FY20 period. [source](https://www.tweaktown.com/news/72714/gta-had-record-microtransaction-earnings-in-april-2020/index.html)\n\nGenshin Impact is another great example. It is a free to play game and generated over $1 Billion from its mobile app alone ([source](https://www.forbes.com/sites/paultassi/2021/03/24/genshin-impact-1-billion-in-mobile-revenue-and-the-six-highest-earning-characters/).)  Every dollar was from microtransactions. Loot boxes for new characters  in this case. When this game first rose in popularity, there were countless sponsored streamers opening packs online, and convincing their viewers to do the same. It only takes a couple whales to make up for all the people who stick to playing for free. [This streamer](https://www.ggrecon.com/articles/twitch-streamer-spends-5k-genshin-impact/) spent over $5,000 trying to unlock a single character.\n\nThis video from 5 years ago shows off some of the most expensive virtual items ever sold, and these are not NFT’s. [https://youtu.be/VUNRl3kAATk](https://youtu.be/VUNRl3kAATk). If you'd rather read then here is a similar [article](https://www.looper.com/339732/the-most-expensive-in-game-purchase-in-gaming-history/). If you’re not a gamer, I highly recommend checking out the above just to get an idea of what lengths certain gamers are willing to go, and to find out why someone spent $6 million on a virtual planet in Entropia Universe.\n\nHow is GameStop going to make money besides game sales? How about by taking a cut of every Fornite skin sold through their marketplace. Or every weapon skin pack in the new Call of Duty. How about by creating an entirely new market for gaming collectors items. A signature adds extreme value to [art](https://seasideart.com/blogs/blog/artist-signatures-how-do-they-impact-the-value-of-art), [books](https://blog.bookstellyouwhy.com/bid/230218/How-a-Signature-Increases-a-Book-s-Value), and [sports memorabilia](https://www.psacard.com/smrpriceguide/sports-autograph-values/2/). Just imagine what it could do for gaming. \n\n&#x200B;\n\n# TLDR; The GameStop NFT might not just be a tool to smoke out the shorties, but also their next major revenue stream.\n\n&#x200B;\n\n^(This is not financial advise, obviously.)",
    "title": "The real use case behind the GameStop NFT, and why you're not thinking big enough",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ob8zgz/the_real_use_case_behind_the_gamestop_nft_and_why/"
}