{
    "author": "puppetjustice",
    "created_utc": 1627841940.0,
    "distinguished": null,
    "edited": false,
    "id": "ovxard",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ovxard",
    "num_comments": 493,
    "permalink": "/r/Superstonk/comments/ovxard/post_moass_there_will_be_a_weird_situation_i_bet/",
    "score": 4503,
    "selftext": "Just imagine your trading account reading longer than an international phone. You spend the obligatory 15 hours running around in circles screaming with joy its helping people time. \n\nFirst stop, buying out game stop for the local kids hospital charity. \n\nFuck everything on gamestop is sold out. Even the local stores have already been cleaned out by Apes.\n\nYou hear a rumor from one of the staff there is a store a couple of towns over that might have some stock left. Faster than Kenny G can short a stock you speed over to the store and get there just in time to clean out the last few shelves.\n\nGod dammit, you are going to help some kids.\n\nDonations all wrapped and presentable, you rock up to the local hospital only to find its already been visited. Gamestop toys and consoles as far as the eye can see. New wings of the hospital already donated. Funds for treatments and research grants over flowing with donations.\n\nBack in town the same is already happening. Schools and shelters rebuilt and funded. Homeless helped into accommodation and work. Everywhere you arrive other apes are already fixing things.\n\nThe oceans are being cleaned. Local wildlife preserved and sanctuaries given new life. Nature preserves are no longer under threat and the balance around the world shifts for the better.\n\nThe race is on to find a project to fix before it is all done.\n\nWhat a wonderfully weird problem to have. No longer a race to the bottom to salvage the last scraps, but a climb to the top to take back the lives of those around us and lift each other up. \n\nThis will be in stark contrast to the weasels in congress who pulled the \"fuck this shit I'm out.\" Who will also be neck deep in trading on insider knowledge. \n\nI will bet my highest sold share that GME MOASS starts within the next 2 weeks. Thats why they ducked out so they aren't holding the political bag.\n\nIf MOASS doesn't launch by August 15th I will donate my highest sold share to Great Ormond Street hospital for children. \n\nJokes on them, if it doesn't launch I get paid on the 15th and buy even more.\n\nSee you in the tendie verse apes.",
    "title": "Post MOASS there will be a weird situation. I bet my highest sold GME share to experience it.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovxard/post_moass_there_will_be_a_weird_situation_i_bet/"
}