{
    "author": "Snowbagels",
    "created_utc": 1626416085.0,
    "distinguished": null,
    "edited": 1626477699.0,
    "id": "olb0bw",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_olb0bw",
    "num_comments": 223,
    "permalink": "/r/Superstonk/comments/olb0bw/when_the_market_tanks_moass_will_happen_these/",
    "score": 3983,
    "selftext": "TLDR: Market tanks and we collect our tendies. MOASS will happen at some point no matter what the catalyst. Patience is everything. The court case referenced below began in 2018 and settled in 2019. \n\nThis is not click-bait or hype. I made another post and it’s getting downvoted by shills and this should be seen because it appears to reaffirm everything. The statement below is quoted from a series of court documents from a 2018 case against LJM Funds related to an ETF and/or mutual fund that includes Citadel, International Brokers, JP Morgan, Virtu, BofA and others. The fund name: the Two Roads Shared Trust and it’s still active today.\n\nFund info and (conspirators) players involved: https://sec.report/Document/0001752724-21-146243/\n\nNote the tickers and the recent DDs that have been posted recently concerning ETFS.\n\n“Analysts were quick to recognize that the Fund’s losses were unusual and not an indictment of all volatility strategies but merely the result of extreme risk-taking with wholly inadequate risk mitigation or controls. For example, following the Fund’s collapse, Morningstar reported that the Fund had made bets exposing it to “extraordinary risks,” including selling “***naked put options” on S&amp;P 500 futures that caused the Fund to be “‘leveraged and [with] above-average margin [borrowing] levels.’” Thus, as the market moved downward, the Fund was subject to margin and risk calls that forced it to liquidate capital and open positions.*** Morningstar added, “‘[t]his fund should never have been marketed to fund shareholders as a tool for capital preservation.’”\n\nAnd when the market tanks? Well…\n\n“Investors, analysts and the media were stunned that such a modest downturn of just 4% in a single day and roughly 2% over two days in the Dow and S&amp;P 500 could nearly wipe out the entire value of the Preservation Fund. The events were described by the media and analysts as “jaw-droppingly awful,” a “collapse,” a “debacle,” the “biggest one-week drop for a mutual fund recorded in 20 years,” and perhaps “‘the biggest two-day drop for a mutual fund ever.”\n\n“This case arises from one of the most rapid mutual fund collapses in history wherein the Preservation Fund lost 80% of its value in just two days. LJM Partners, Ltd. (“LJM Partners”), an affiliate of LJM and the Fund, was an investment advisor that managed hedge funds. LJM Partners marketed some of its funds as aggressive strategy funds, such as the “Moderately Aggressive Strategy” and the “Aggressive Strategy.” But this case involves the collapse of its affiliated, and purportedly conservative, Preservation Fund, created in 2012. As its name suggests, the Preservation Fund was marketed to investors seeking lower risk and moderate growth through a \nmore conservative strategy that would preserve capital and avoid the massive risks of aggressive hedge funds seeking greater returns.”\n\nhttps://ljmfundssecuritiessettlement.com/Content/Documents/Complaint.pdf\n\nPlease, for the love of Harambe…. Get these docs to the attention of the wrinkle brains. It literally details the entire ETF/mutual fund scam and how it’s pretty much centered around an options scam. \n\nTreasure trove of docs for wrinkles to review: https://www.ljmfundssecuritiessettlement.com/Home/Documents\n\nEdit: added details\n\nEdit 2: another fund was also sued the following year (but for the same timeframe) for the same outcome of their investment so I’m including the coverage of this as well https://citywireusa.com/professional-buyer/news/investors-sue-etf-shop-over-losses-from-volmageddon/a1196427\n\nEdit 3: day was referred to as “Volmageddon”. https://www.etftrends.com/etf-strategist-channel/volmageddon-tale-two-volatilities/\n\nThanks for the awards, but please save them for someone worthy.\n\nI’m done adding/editing because I huff crayons. Letting wrinkles take over.",
    "title": "When the market tanks, MOASS will happen. These docs reaffirm everything. NEED WRINKLES, PLEASE.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/olb0bw/when_the_market_tanks_moass_will_happen_these/"
}