{
    "author": "K_5sixchars",
    "created_utc": 1625500080.0,
    "distinguished": null,
    "edited": false,
    "id": "oea35i",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_oea35i",
    "num_comments": 90,
    "permalink": "/r/Superstonk/comments/oea35i/shorts_arent_covering_and_instead_are_trying_to/",
    "score": 1948,
    "selftext": "Lets not make any mistakes, gme is going to moon because shorts need to cover and we are naming our prices. It has never been because the market is going to collapse. The negative beta is great, but gme has never been about hedging against a market collapse. All those hedge funds who thought they could make some free cash by collapsing a company to 0 dollars is what caused this saga to occur. The market is starting to collapse because big boys are moving so much money around trying to distract from the narrative of them not covering their naked shorts and constantly resetting their ftds, and its causing volatility in the entire market. I honestly think citadel is trying to just cause chaos, which will in turn cause doubt in the market. They'll take advantage of this chaos and drive a narrative that social media makes the stock market too volatile, and discussion of stocks and the stock market should be banned for the safety of investors' portfolios. Never let anyone forget that we are here because shorts tried to take advantage of a loophole to get away with tax free money, because you don't have to return/cover your shorts if the company is bankrupt. And if the market is chaotic and volatile, it has nothing to do with retail holding a stock they like, or the platforms they use to talk about the stock that they like, and everything to do with corporations and agencies in charge of  regulating those corporations working together to fuck over retail investors.",
    "title": "Shorts aren't covering, and instead are trying to find a way to blame retail for the volatility that is being seen in the market.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oea35i/shorts_arent_covering_and_instead_are_trying_to/"
}