{
    "author": "ayyyybro",
    "created_utc": 1619709502.0,
    "distinguished": null,
    "edited": 1619711415.0,
    "id": "n16n48",
    "text_only": true,
    "flair_text": "𝘜𝘯𝘷𝘦𝘳𝘪𝘧𝘪𝘦𝘥 𝘋𝘋",
    "name": "t3_n16n48",
    "num_comments": 174,
    "permalink": "/r/DDintoGME/comments/n16n48/the_bear_thesis/",
    "score": 892,
    "selftext": "Sup Apes,\n\nAt this point you likely know all the DD, and you’re set with your diamond hands.\n\nThat being said, it’s important to take a break from the confirmation bias every once and a while and familiarize yourself with the opposite point of view.\n\nWhen you go back and watch [DFV’s original videos on GME](https://youtu.be/JWdWCtLMoU0), you’ll notice that not only has he done research on why GME would gain value one day, but also that he spent a significant amount of time studying the bear thesis as well.\n\nA clear understanding of the bear thesis surrounding GME is important to your ability to think critically. It allows you to weigh your options objectively, and [stick to your guns no matter what amount of FUD is thrown your way.](https://www.reddit.com/r/wallstreetbets/comments/eoaua4/gamestop_2019_holiday_sales_down_275_yoy/fecbdv2?utm_source=share&utm_medium=web2x&context=3)\n\nDiamond hands are made from confidence in the work that you’ve put in.\n\nThis is not financial advice.\n\nLet’s get into the main points of the bear thesis:\n\n1. The Shorts have covered\n2. GME is currently overvalued at $155\n3. GME is a Pump and Dump\n4. The MOASS won’t happen due to selling on the way up\n\n&#x200B;\n\n**The Shorts Have Covered**\n\nBased on currently reported numbers, GME Short Interest is currently anywhere from \\~15%-19% of the total float\n\n* [Finviz](https://finviz.com/quote.ashx?t=GME)\n* [Bloomberg Terminal](https://www.reddit.com/r/DDintoGME/comments/mxasnb/gme_terminal_drop_4232021/)\n\nThis is obviously way down from over 100% short, and a key reason why bears believe that the short squeeze [already happened in January](https://www.bloomberg.com/news/articles/2021-02-01/gamestop-short-interest-plummets-in-a-sign-traders-are-covering).\n\n* [Melvin and Citron Close out of Short Positions](https://www.bloomberg.com/news/articles/2021-01-27/melvin-capital-closes-out-its-gamestop-position-cnbc-reports#:~:text=Melvin%20Capital%20closed%20its%20position,%25%E2%80%9D%20in%20a%20YouTube%20video.)\n\nGME continued to bleed down to $40 in February after these reports and all signs pointed to shorts being covered.\n\nThat is, until Apes figured out that:\n\n* [GME is being shorted through ETFs](https://www.reddit.com/r/GME/comments/ljwo3v/serious_researchers_needed_now_i_think_i_know/)\n* [GME Short Interest is being manipulated through FTD resets](https://www.reddit.com/r/GME/comments/mhv22h/the_si_is_fake_i_found_44000000_million_shorts/)\n* [GME trades are being routed through the dark pool](https://www.reddit.com/r/Superstonk/comments/mpebkz/sells_through_the_major_exchanges_buys_through/)\n   * [Comparison between GME and MSFT](https://www.reddit.com/r/Superstonk/comments/mq5598/a_lot_of_requests_to_post_a_comparison_of_level_2/)\n\nSo this point really comes down to one thing. Do you believe the shorts have covered? Or do you believe they’ve found a way to conceal the true short data?\n\n&#x200B;\n\n**GME is Currently Overvalued**\n\n[The God Tier DD](https://iamnotafinancialadvisor.com/GME/) has been updated recently to include GME’s “fundamental value”\n\nPage 23, FAQ I - What is the “fundamental value” of Gamestop\n\n* “There are many posts circulating which claim the current price of Gamestop is the “fundamental value”. While this price is “technically” the market value, it is far from the fundamental, or intrinsic, value of the stock. This can also sometimes be seen as the Projected Free Cash Flow (PFCF or FCF) and is calculated based on the latest company financials. While it isn’t unusual for a stock’s Price to Intrinsic Value PFCF to be greater than the FCF, the current PFCF for Gamestop is roughly $38. This means that, at the current price, GME’s Price to Intrinsic Value PFCF is approximately 4.5.”\n\nAdditional bearish valuations:\n\n* [Joseph Feldman - $33](https://tdameritradenetwork.com/video/rB4A-Hc0Gd2BdzteIVoA1g)\n* [Michael Prachter - $29](https://www.yahoo.com/now/gamestop-great-company-massively-overvalued-220556101.html)\n\nWhether you agree with this or not, doesn’t really matter, this is what the bearish thesis believes is the true value. This seems to be the agreed sentiment around /r/gme_meltdown as well.\n\nThe problem I see with most bearish sentiments is that they are still holding onto the notion that Gamestop is a “failing brick and mortar” and that the [rise of digital sales is a bad sign for the company long term](https://markets.businessinsider.com/news/stocks/gamestop-stock-price-prediction-reddit-trading-rival-competition-edward-woo-2021-4-1030297169).\n\nIf you believe Gamestop is still just a brick and mortar company that only has physical copies of games to offer, then I have nothing to argue. We’re comparing apples to bananas.\n\nFor starters I think you should check out the updates that have been made to the website, and phone app. Take a look at the expanded product catalog. Take a look at the new shipping times. There is a visible change in the e-commerce customer experience that is happening with this company.\n\n&#x200B;\n\nAs for me, I like the stock, and if it goes back down to $40, [I’ve got a couple ideas around my strategy](https://imgur.com/a/ZYteh65).\n\n&#x200B;\n\n**GME is a Pump and Dump**\n\n* [CNBC](https://www.cnbc.com/2021/01/28/gamestop-now-called-a-pump-and-dump-scheme-what-you-need-to-know.html)\n* [Motley Fool](https://www.fool.com/investing/2021/02/06/was-the-gamestop-phenomenon-just-one-big-pump-and/)\n* [NBC](https://www.nbcnews.com/think/opinion/gamestop-trades-meme-investing-make-stocks-ponzi-scheme-hurts-little-ncna1257680)\n* /r/gme_meltdown\\*\n\nThis goes hand in hand with “January was the squeeze”. [Former SEC Chairman Jay Clayton told CNBC](https://www.cnbc.com/2021/02/19/jay-clayton-reddit-fueled-gamestop-frenzy-not-a-pump-and-dump-scheme.html) he did not believe that January was a pump and dump (whatever that’s worth).\n\nWe’ve seen GME reach over $350 on two separate occasions (January 28th, and March 10th). And we’ve seen the price “[dumped](https://www.reddit.com/r/GME/comments/mqyp5w/now_is_the_time_to_stay_ready_a_running_list_of/)” shortly after.\n\nAs far as DFV goes, he’s held long term, and he’s bought in again multiple times since.\n\nI can’t think of a logical reason to pump something up in January and then leave 50,000 shares untouched, then [add 50,000 more after the hearing](https://www.reddit.com/r/wallstreetbets/comments/lnqgz8/gme_yolo_update_feb_19_2021/), and then [add 100,000 more in April](https://www.reddit.com/r/wallstreetbets/comments/msblc3/gme_yolo_update_apr_16_2021_final_update/).\n\nSigns point to long term investment and he likes the stock.\n\nI’m open to hearing other points of view.\n\n\\*I understand /r/gme_meltdown is not a credible news source, I mention it because I’ve seen pump and dump mentioned there on a regular basis and it’s a good indicator of how critics of GME feel.\n\n&#x200B;\n\n**The MOASS will not happen due to selling on the way up**\n\nGoing to quote the God Tier DD again:\n\nPage 24, FAQ II - Okay, but what if all us apes just keep holding, they can’t take our shares if we don’t sell them, and they need them!\n\n* “… But, for the sake of argument, let’s do a quick thought experiment together. Let’s assume that they DO need your shares and that you are sitting on 100 shares that you bought for $250 each (you came in late January and then doubled down when it spiked again in early March). You need to net $25k to break even. **Now, and this is important because it REQUIRES that you be honest with yourself. It’s okay, no one is looking… when do you share you first share.** You have 100 to spare. Do you sell any? Because, you know, if you sold 25 at $1000, you would make your entire initial investment back and the remaining 75 can be all profit! This would make sense to me, right, then the rest can just be reserved for your moonshot but at least you are not missing your original $25k any longer. Did you know that if you sold another 25 at 5k, you can walk away with $125k? In some places that is a house! Not bad for a few months of yelling “Diamond Hands” from the rooftops. Plus you still have 50, half, left for your moonshot. Now you are sitting on $125k profit, with 50 more shares in hand and no debt. No brainer right? Now look left, look right. Do you see the other apes scribbling notes and math as they plan out the same? Now let’s assume that the various Reddit retail investor holding estimates are accurate and Reddit is currently sitting on the full float, just them. That is roughly 50 million shares! Sorry, WAS 50 million…Guess who now has 25 million shares to work with on a reported short interest of 10 million… I realize these numbers are not exact to the various posts and holdings, but the point stands. **People will do what is best for them, as they should**.”\n\nPersonally, I believe this is the strongest point in the bear thesis. Because there is no data to back the Apes up here. No DD to account for if Apes will sell or hold. This is an unprecedented event.\n\nIn thinking of that, I came to an interesting realization.\n\nWhen it comes to GME, a stock that has ignored technical analysis, a stock that has been manipulated into the ground, a stock that a bunch of crayon munching Apes bought simply because they like it, **the shorts are banking on you to follow the fundamentals to exit your position.**\n\nWhat I believe is the problem with the final point of the bear thesis is that it’s based on retailers selling out on each other so that they can get their own.\n\nThat’s how it is on Wall Street. That’s how it is with traditional investors. They are hoping that’s how it is with Apes.\n\nI would be lying if the thought to “cover my initial investment on the way up” hasn’t crossed my mind once in this ordeal. That’s how I have been taught to think.\n\nMy next thought was funnier though. Because I wondered what question is keeping ol Kenny boy up at night?\n\n**“What if they hold?”**\n\nGood question Ken.\n\n\\---\n\nIt is not my intent to tell you what to do. But I will tell you a little bit about me.\n\nI bought at the peak in January with hopes of doubling my money and making a quick buck. I held through February, and bought the dips when I could. I've read the DD, and made a few posts of my own.\n\nFor better or worse, I will not sell on the way up.\n\nIf you’ve seen my other posts you’ll know what I believe the best exit strategy is. [Here it is again](https://www.reddit.com/r/GME/comments/mmo9kw/from_fake_shares_to_millionaires_common/):\n\nhttps://preview.redd.it/wahtg4f3w4w61.png?width=730&format=png&auto=webp&s=444c6baacdfd1806b6d625a30a873da91632bae6\n\nCall me the Idealistic Ape, because I believe there’s more to this than a quick buck.\n\nI believe if I take care of the Ape in front of me, the Ape behind me will have my back, and that guarantees every Ape gets their bananas.\n\n&#x200B;\n\nI do not believe this will be remembered as MOASS that *could have* happened.\n\nI believe history will remember that when most would have sold...\n\nDiamond Handed Apes held.",
    "title": "The Bear Thesis",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n16n48/the_bear_thesis/"
}