{
    "author": "Ostrich123uknome",
    "created_utc": 1623796660.0,
    "distinguished": null,
    "edited": 1623835431.0,
    "id": "o0qhh5",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o0qhh5",
    "num_comments": 156,
    "permalink": "/r/Superstonk/comments/o0qhh5/if_your_email_appears_in_the_sec_005_filing_and/",
    "score": 1394,
    "selftext": "FINAL EDIT:  read [this comment thread](https://www.reddit.com/r/Superstonk/comments/o0qhh5/if_your_email_appears_in_the_sec_005_filing_and/h1y02s4/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3). It concludes the debate.\n\nThank you u/Orzechy1 for being constructive in the debate\n\n\nORIGINAL POST:\n\n\nThere is a 115 page document of the filing kicking about, where at the end several emails are listed and some appear to state they reside in European countries.\n\nGDPR applies to the US (as they are handling data of someone in Europe) and if you are an Euroape, you should report the GDPR breach to the EDPS (European Data Protection Supervisor)\n\n\n\nLink to EDPS: https://edps.europa.eu/data-protection/our-role-supervisor/complaints_en\n\nEDIT: Not sure if the SEC or DTCC are in breach, either way there is a breach and you should report it!\n\nEDIT2: [specific information for US companies and GDPR ](https://gdpr.eu/compliance-checklist-us-companies/)\n\nEDIT3: [DTCC GDPR Terms from their (the DTCC) website](https://www.dtcc.com/-/media/Files/Downloads/terms/DTCC-GDPR-Amendment.pdf)\n\nEDIT4: for people saying an email is not personal data, and saying I don’t know about GDPR, you are wrong.\n\nhttps://ec.europa.eu/info/law/law-topic/data-protection/reform/what-personal-data_en#examples-of-personal-data\n\nEDIT: key distinction for emails is that if it is (for example) name.surname@company.com then it is personal data and falls under GDPR. Alternatively if It’s info@company.com (I guess like when you have that support emails or no reply emails) then it’s not.\n\nQuestion: could argue that even if you don’t use your name.surname that your email handle could still be personal data if it’s similar or equal to other handles you use elsewhere? I ask and think it is, because the EC (European commission) purposely was broad in their view of what personal data.",
    "title": "IF your email appears in the SEC 005 filing and you are an Euroape, contact the EDPS as the SEC has breached GDPR rules.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0qhh5/if_your_email_appears_in_the_sec_005_filing_and/"
}