{
    "author": "Carb0n12",
    "created_utc": 1623793480.0,
    "distinguished": null,
    "edited": 1623797227.0,
    "id": "o0pem0",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o0pem0",
    "num_comments": 797,
    "permalink": "/r/Superstonk/comments/o0pem0/no_005_isnt_a_dud_get_that_fud_out_of_here_let_me/",
    "score": 12535,
    "selftext": "I am going to keep this brief, because I am seeing this narrative being blown up already through this subreddit and on various discords concerning the comment made on page 15, section 5 within DTC-2021-005.\n\nAllow me to elaborate:\n\n&#x200B;\n\n1. No, 005 is not a dud, its legitimately what many investors have been asking for. Understanding the context of the statement made in 005, specifically page 15, section 5 will help in fighting the FUD and understanding how IMPORTANT 005 is.\n2. TO put it bluntly, the DTCC is covering their asses with the statement made on page 15, section 5. Its as simple as that. The statement made in the documentation (page 15, section 5) was purely for public facing knowledge, specifically for us apes, and any other inquiring eyes (lawyers, media etc). Why the hell would the DTCC admit on paper, on a public facing document that they knew of the illegal activities involving FTDs? Of course they are going to lie and lie more to CYA. That's what they do.\n3. 005 essentially \"forces\" the DTCC's hand via a public facing document to acknowledge and plug up the holes that allow the issue of  rehypothecated counterfeit shares  being used to reset FTD's as well as add clarification for DTC members/pledgee's responsibilities, expectations, etc. 005 is made to acknowledge this issue without \"acknowledging\" that they knew and supported the rehypothecation of counterfeit shares used for various criminal acts. Once again, CYA. Please see u/weekenddev's interpretation on how this all ties together.\n4. 005 is a ruling that, once again, according to the DTCC, via their little \"comment\" on page 15, section 5, \"reinforces\" their \"stance\" on how they \"tackle\" the issue as they legally are bound to do so.  They try to subvert investor's expectation by stating that they already have been following the rulings within 005, and that 005 is simply a  \"reformatting\" and clarification ruling. This is complete and utter bullshit. This document (whilst still important in the grand scheme of FTD's and how they are handled) and the DTCC's comment reeks of plausible deniability.\n5. Note that 005 is unlike any of the rulings they have made in the past. I personally have combed through years of DTCC rulings the past several months and this is the first of its kind. Indeed they can lie through playing coy on paper, but we all know that 005 is here because of the current situation with GME and the state of the stock market at large. They cannot keep up this façade for much longer.\n6. This ruling also is a narrative move. Once again, I CANNOT STRESS THIS ENOUGH, this ruling is extremely important to the DTC/CC's  \"CYA, hide the bodies\" motive. The OCC, ICC, NSCC (801/002 this week or next Monday fyi) have made their moves, and now the DTCC is finished with theirs as we know it.\n\nTL;DR - 005 isn't just about the raw content/subject matter (greatly reducing the power of resetting FTD's, counterfeit share rehypothecation, pledgee accounts, access, responsibilities, etc). ITS ABOUT CYA through thinly veiled CONTEXT, risk transference, risk mitigation/control and playing coy with some statements injected in the new revision. And, oh boy with these new edits/remarks, the timing of its release and the soft doxxing they performed, well lets just say the DTCC is backed into a corner and individual investors' loud voices and energy has actually made a difference.\n\nEdit: I do want to note that I am currently going through the differences between the original 005 document and the current one. So far, a lot of fluff has been removed. I will update this page and potentially, if warranted, will make a separate post of all the important changes and removals the DTCC has performed.\n\nEdit 2: Grammar and clarification. Look at that, it didn't take 2+ months.\n\nEdit 3: Excellent interpretation (I share the same sentiment) of 005 made by u/weeknddev \\- [https://www.reddit.com/r/Superstonk/comments/ncnz1l/where\\_in\\_the\\_world\\_is\\_srdtc2021005\\_we\\_were\\_told/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/Superstonk/comments/ncnz1l/where_in_the_world_is_srdtc2021005_we_were_told/?utm_medium=android_app&utm_source=share)\n\nNote that rules aren't actually rules unless they are enforced. As I stated above, the context of 005, the additional comments are what matters. The timing of 005 being released, 801/002 being potentially approved on Friday/Monday (this ruling, btw is extremely important), the narrative being set by MSM, the alarms of inflation, RRP being god tier high; the bigger picture is forming right before our eyes.\n\nBuckle UP!  💎👊🦧🚀🌙",
    "title": "No, 005 isn't a dud, get that FUD out of here. Let me explain",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0pem0/no_005_isnt_a_dud_get_that_fud_out_of_here_let_me/"
}