{
    "author": "party-bot",
    "created_utc": 1624788267.0,
    "distinguished": null,
    "edited": false,
    "id": "o8u8u8",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o8u8u8",
    "num_comments": 96,
    "permalink": "/r/Superstonk/comments/o8u8u8/sales_enthusiastic_shareholders_with_negative/",
    "score": 2814,
    "selftext": "*This theory throws MOASS discussions aside, I definitely believe it's in the cards but I want to talk about this long term phenomenon.\n\nI believe there is a large group of motivated consumers because of the sentiment around Gamestop that is comparable to that of Apple and Tesla.  I further believe that because of this sentiment sales numbers are going to continually surprise Wallstreet and hold buy pressure from the surprise delta on every quarterly announcement until the estimated sales numbers and earning per share are drastically altered to reflect the current consumer mindset. Even after being updated, the numbers will then become attractive to the passive income, long term hold, lower risk investment strategies. The current numbers show Gamestop is estimated to have negative annual earnings per share (that means for every share that exists the company's sales is losing that much if the losses are divided evenly per share) until 2023. These estimates will continue to be Roshambo'd by the actual numbers every quarter because they do not account for the following.\n\n 1. It is currently \"cool\" to have gamestop merch or shop at gamestop. Receipts are receiving up votes, merch is sold out, t-shirts are not only sold-out but being demanded. The crowd is so loyal to gamestop their isn't even a consideration of making their own custom shirts because they want gamestop specific merch. This mentality is not reflected in the current estimates.\n\n 2. Beyond that is the fact that there is a huge increase in demand for store brand merch. T-shirts with other brands are typically marked up 8% when sold by retail. When they are your own brand you can mark these bad boys up to 50% and achieve the current market price point (heavy breathing). Further, items like the very popular banana cat plushie are an exclusive gamestop/funko collaborative which would garner increased profit margins for gamestop because without gamestop, Funko would not be able to sell the product as effectively (think of this like negotiation leverage). Again, if any of these estimates had textile merch demand as a factor they must have had DFV's 8-ball because I don't think anyone saw this demand coming.\n\n 3. Even more so, Gamestop is expanding into other markets, as the consumer demands it, and immediately making sales that were not factored into these estimates. For instance, the board game market. We have watched them enter this sphere in the last three weeks, as demanded by the customer base. Guaranteed sales in a market that typically has 100% mark ups (very heavy breathing). That's right, retail typically makes as much money for a board game as it everyone else who designed, created, manufactured and shipped it to the store. That part is wild but regardless of the industry, the companies stock that you hold is now on the receiving end of those profits. Also, recently consumers went face down into the candy aisle at gamestop (awesome). These represent consumable purchases which are great for a company because you can continue to make that purchase in the future (nobody buys a toilet seat every month but it's more likely you would buy a bag of candy again and again and again).\n\n 4. There is international demand. We have all seen the charts showing that gamestop is being held very heavily is Scandinavia, Australia, Germany, UK etc. In most cases we wouldn't assume that a stock holder represents a customer but in the case of gamestop its not only possible but likely.\n\n 5. Finally, notice how in 4 points I never once actually talked about their bread and butter? That is actual console and video game sales? Yes that is still very much present. Gamestop's competition are big box stores. There is no store specifically focused on getting out of stock game systems in stock. For Gamestop, this is what they do. For other companies it's just another item in the long list of sold-out items. I trust the rush of brass that just came in understands that for people to purchase their product they need consoles. These newcomers are hyper aware and are there to work, I trust they will be doing everything in their power to receive more stock. 10 months ago I believe they could have been shrugging at the out of stock sign and saying it is what it is but with this new vote of confidence from the consumer I believe they understand that is no longer an option.\n\nGamestop has become a desired brand. People would buy their groceries there if they could. Their name now has value that it did not have 10 months ago. This is not calculated into the EPS which is going to continue to drive positive surprise deltas at every quarterly earnings announcement. This is comparable to the Telsa and Apple fanbase and has not been factored into current Wallstreet estimates.\n\n*not financial advice. Just an ape who likes the stock. Also, thanks to the knights of new for some fine tuning, much appreciated!",
    "title": "Sales & Enthusiastic shareholders with negative earning per share. Estimated vs Actual and why I believe the value is in the Delta (because of you!)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8u8u8/sales_enthusiastic_shareholders_with_negative/"
}