{
    "author": "JustBeingPunny",
    "created_utc": 1624824913.0,
    "distinguished": null,
    "edited": 1624871129.0,
    "id": "o94pad",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o94pad",
    "num_comments": 1597,
    "permalink": "/r/Superstonk/comments/o94pad/why_didnt_we_read_the_prospectus_the_reset_button/",
    "score": 16174,
    "selftext": "**EDIT - Okay hotshots, let's update some stuff. I've had a lot of comments shouting 'this needs a DEBUNKED flair'. This is due to the text looking like your standard boilerplate language.** u/rockinandchalkin **points out that it was drafted a million years ago and noone including the lawyers actually read this. We all know how that goes...(*****cough... The Big Short*****)**\n\n**Just because it's could be a 'copy and paste' doesn't mean that it isn't true, can't effectively be enforced or used to fuck shorts. I for one am still jacked to the tits and you should be to.**\n\n**And for those that think it's so far fetched that GameStop would go off exchange?...**\n\n&#x200B;\n\n**There is huge amounts of speculation that the NFT is going to be used for a used game exchange. What's to say their stock/security couldn't be on there to trade also?....**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nLegalese is another language. I will be taking the words of GameStop and breaking them down so you can understand.\n\n*Beware, I too am an idiot. I can barely read myself. If anyone can see any flaws in my explanations, help an ape out and let me know!*\n\n**Also, MAJOR SHOUTOUT to the DD chat. You guys are the ultimate apes to me.**\n\n&#x200B;\n\n# u/loggic, ultimate props to you for actually reading the prospectus first!\n\n# [Crypto hints being dropped in GME's Prospectus? : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/o933f5/crypto_hints_being_dropped_in_gmes_prospectus/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n# CONFIRMATION BIAS TIME -\n\n&#x200B;\n\n>We may issue the securities offered by means of this prospectus in whole or in part in book-entry form, meaning that beneficial owners of the securities will not receive certificates representing their ownership interests in the securities, except in the event the book-entry system for the securities is discontinued. If securities are issued in book entry form, they will be evidenced by one or more global securities that will be deposited with, or on behalf of, a depositary identified in the applicable prospectus supplement relating to the securities. The Depository Trust Company is expected to serve as depository. Unless and until it is exchanged in whole or in part for the individual securities represented thereby, a global security may not be transferred except as a whole by the depository for the global security to a nominee of such depository or by a nominee of such depository to such depository or another nominee of such depository or by the depository or any nominee of such depository to a successor depository or a nominee of such successor. Global securities may be issued in either registered or bearer form and in either temporary or permanent form. The specific terms of the depositary arrangement with respect to a class or series of securities that differ from the terms described here will be described in the applicable prospectus supplement\n\n**Ape Talk - The DTCC is the depository for the shares, so why are we talking about a successor depository??(more on this below)**\n\n&#x200B;\n\n>*Upon the issuance of a global security, the depository for the global security or its nominee will credit on its book-entry registration and transfer system the respective principal amounts of the individual securities represented by such global security to the accounts of persons that have accounts with such depository, who are called “participants.” Such accounts shall be designated by the underwriters, dealers or agents with respect to the securities or by us if the securities are offered and sold directly by us. Ownership of beneficial interests in a global security will be limited to the depository’s participants or persons that may hold interests through such participants. Ownership of beneficial interests in the global security will be shown on, and the transfer of that ownership will be effected only through, records maintained by the applicable depository or its nominee (with respect to beneficial interests of participants) and records of the participants (with respect to beneficial interests of persons who hold through participants). The laws of some states require that certain purchasers of securities take physical delivery of such securities in definitive form. Such limits and laws may impair the ability to own, pledge or transfer beneficial interest in a global security.*\n\n&#x200B;\n\n**Ape talk - Just some basic talk around what the DTCC is and how shares work. However, the final line is very cute - in some states, certain laws may impair the ability to own, pledge or transfer beneficial interest in a global security.**\n\n&#x200B;\n\n>So long as the depository for a global security or its nominee is the registered owner of such global security, such depository or nominee, as the case may be, will be considered the sole owner or holder of the securities represented by such global security for all purposes under the applicable instrument defining the rights of a holder of the securities. Except as provided below or in the applicable prospectus supplement, owners of beneficial interest in a global security will not be entitled to have any of the individual securities of the series represented by such global security registered in their names, will not receive or be entitled to receive physical delivery of any such securities in definitive form and will not be considered the owners or holders thereof under the applicable instrument defining the rights of the holders of the securities.\n\n&#x200B;\n\n**Ape talk - Short sellers ARE NOT considered owners or holders of the shares and their rights.**\n\n&#x200B;\n\n&#x200B;\n\n>Payments of amounts payable with respect to individual securities represented by a global security registered in the name of a depository or its nominee will be made to the depository or its nominee, as the case may be, as the registered owner of the global security representing such securities. None of us, our officers and directors or any trustee, paying agent or security registrar for an individual series of securities will have any responsibility or liability for any aspect of the records relating to or payments made on account of beneficial ownership interests in the global security for such securities or for maintaining, supervising or reviewing any records relating to such beneficial ownership interests.\n\n&#x200B;\n\n**Ape talk - Gamestop ain't liable for absolutely anything that happens with the MOASS. The DTCC allowed this to happen so it's their mess to figure out.**\n\n&#x200B;\n\n>We expect that the depository for a series of securities offered by means of this prospectus or its nominee, upon receipt of any payment of principal, premium, interest, dividend or other amount in respect of a permanent global security representing any of such securities, will immediately credit its participants’ accounts with  payments in amounts proportionate to their respective beneficial interests in the principal amount of such global security for such securities as shown on the records of such depository or its nominee. We also expect that payments by participants to owners of beneficial interests in such global security held through such participants will be governed by standing instructions and customary practices, as is the case with securities held for the account of customers in bearer form or registered in “street name.” Such payments will be the responsibility of such participants.\n\n&#x200B;\n\n**Ape talk - When GameStop give out a dividend or premium, the DTCC will give em' out accordingly to each and every person who owns shares. Also, if you have shares held in a 'street name' they will give you the dividend as such. THE RESPONSIBILITY IS ON THEM.**\n\n&#x200B;\n\n# WHERE MY TITS GET JACKED\n\n&#x200B;\n\n>**If a depository for a series of securities is at any time unwilling, unable or ineligible to continue as depository and a successor depository is not appointed by us within 90 days, we will issue individual securities of such series in exchange for the global security representing such series of securities. In addition, we may, at any time and in our sole discretion, subject to any limitations described in the applicable prospectus supplement relating to such securities, determine not to have any securities of such series represented by one or more global securities and, in such event, will issue individual securities of such series in exchange for the global security or securities representing such series of securities.**\n\n&#x200B;\n\n**APE TALK - If the DTCC decides to mess around during a MOASS (for example), GameStop will change depositories to somewhere else.**\n\n**It goes a little like this -**\n\n**DTCC - We aren't paying up dividends**\n\n**Gamestop - Fine. We're going to make NEW shares and swap them for your ones. We need enough to give everyone who currently has a share, theirs's  back. All 1.3 billion of them..buy up...**\n\n&#x200B;\n\n**My wrinkled brain sees this as a 4d chess move. Want to make hedgies buy back without a reverse merger? Tell the DTCC to eat a big pile of poop for fucking around and just move depositories.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**TL;DR - GameStop has everyone by the balls. I think RC knows the DTCC will be ruined when he gives them dividends of only 70 million shares. They also found a way to simulate a reverse merger IF the DTCC go kaboom. That's by packing up the shares and then moving depositories, causing an entire exchange of all shares that would be reissued.**\n\n&#x200B;\n\n**APE TL;DR - Shorts r fuk. If DTCC stop MOASS, they fuk. GameStop could use big red nuke button to force shorts to cover.**\n\n&#x200B;\n\n**Edit - Further TL;DR by** u/magistricide **-  We CAN release a crypto dividend to investors based on the number of stocks they own, and it's up to the DTCC to sort that shit out....**",
    "title": "Why didn't we read the prospectus? - The reset button.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/o94pad/why_didnt_we_read_the_prospectus_the_reset_button/"
}