{
    "author": "2ezyo",
    "created_utc": 1627513103.0,
    "distinguished": null,
    "edited": false,
    "id": "otl6xr",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_otl6xr",
    "num_comments": 34,
    "permalink": "/r/Superstonk/comments/otl6xr/gme_is_going_to_moon_with_or_without_a_catalyst/",
    "score": 887,
    "selftext": "#**Can someone remind me or explain to me just HOW gamestop isn't absolutely DESTINED to moon?**:\n\n---\n-\n\n*\"Gamestop doesn't have the talent to succeed\"*\n\n#**A list of top-gun, ex-Amazon, ex-Chewy, ex-Zulily new hires**.  \n\n-**Alan Attal** is a successful e-commerce executive and entrepreneur with more than two decades of experience building and managing businesses. From 2017 through 2018, Mr. Attal served as the Chief Marketing Officer of Chewy Inc. and oversaw an annual acquisition budget of more than $300 million, which was allocated to broadcast, direct mail and digital advertising and engagement initiatives. From 2011 through early 2017, he served as the company’s Chief Operating Officer and oversaw its expansion from three people to more than 10,000 employees and $3 billion in revenues.\n\n- **Jim Grube** is a successful business and finance executive with more than two decades of corporate experience. He was most recently the Chief Financial Officer of Vacasa, North America's leading vacation rental management company. He previously served as the Chief Financial Officer of Chewy, Inc. from 2015 through 2018. He was formerly the Senior Vice President of Finance at Hilton from 2009 through 2015 and a Director of Finance at Amazon from 2007 through 2009. He began his career working at other leading companies across the technology and transportation sectors. \n\n\n- **Kelli Durkin**, Senior Vice President of Customer Care – Ms. Durkin, who previously served as Chewy’s Vice President of Customer Service, has a start date of March 1, 2021. She helped establish the world-class customer service operation that positioned Chewy to achieve a Net Promoter Score of 86 in 2018. In her new role, Ms. Durkin will oversee all customer service and engagement initiatives at GameStop.\n\n- **Josh Krueger**, Vice President of Fulfillment – Mr. Krueger, who previously held senior fulfillment roles at Amazon, Walmart, and QVC, has a start date of March 1, 2021. In his new role, Mr. Krueger will oversee the management of e-commerce fulfillment centers.\n\n- **Neda Pacifico**, Senior Vice President of E-Commerce – Ms. Pacifico, who previously served as Chewy’s Vice President of E-Commerce, has a start date of March 29, 2021. She spent nearly four-and-a-half years at Amazon in a variety of customer insights and marketing roles prior to joining Chewy. In her new role, Ms. Pacifico will lead initiatives in areas that include analytics, UI/UX and product design. \n\n\n- **Ken Suzuki**, Vice President of Supply Chain Systems – Mr. Suzuki, who previously served as Zulily’s Vice President of Supply Chain Technology, has a start date of March 29, 2021. He has more than two decades of experience in the e-commerce, informational technology and software engineering areas. In his new role, Mr. Suzuki will be responsible for all systems and software related to GameStop’s supply chain, including order management systems (OMS) and warehouse management systems (WMS)\n\n- **Andrea Wolfe**, Vice President of Brand Development – Ms. Wolfe, who previously served as Chewy’s Vice President of Marketing, started March 29, 2021. She has held executive and director-level marketing roles at companies such as Outdoorsy, Spreetrail and Whole Foods. In her new role, Ms. Wolfe will help drive branding, content, social media strategy and other digital initiatives.\n\n\n- **Tom Petersen**, Vice President of Merchandising – Mr. Petersen, who previously served as Chewy’s Vice President of Merchandising, started March 29, 2021. He has also held senior marketing and merchandising roles at specialty retailers such as Artenza and Corro. In his new role, Mr. Petersen will help drive vendor relations, product management and related merchandising initiatives.\n\n\n- **Mr. Matt Furlong** (BOARD, Previously CEO)  - Mr. Furlong is a veteran e-commerce leader with significant experience implementing growth strategies across global geographies and product categories. Most recently, he was a Country Leader and oversaw Amazon’s Australia business during a period of substantial growth. He was previously a Technical Advisor to the head of Amazon’s North America Consumer business. Throughout his nearly nine years at Amazon, he also ran a variety of product categories and oversaw strong market share expansion. Mr. Furlong began his career at Procter & Gamble, where he was an executive focused on brand, marketing and sales strategies.\n\n- **Mr. Mike Recupero** (CFO) - Mr. Recupero is a seasoned technology industry finance executive, who spent more than 17 years at Amazon supporting growth across global geographies and product categories. He most recently served as Chief Financial Officer of the North American Consumer business after serving as Chief Financial Officer of Prime Video. He previously served as the Chief Financial Officer of the European Consumer business. He began his career at Amazon, holding Analyst, Manager and Director roles of increasing responsibility.   \n\n- **Marr Francis** - Mr. Francis to the newly created role of chief technology officer, effective Feb. 15. Francis was most recently an engineering leader at Amazon.com Inc.'s AMZN, +0.11% Amazon Web Services cloud business\n\n- **Mr. Elliott Wilke** - (Chief Growth Officer) - Mr. Wilke, former Amazon Excecutive, has been appointed to the role of chief growth officer effective April 5. Wilke has held a range of roles at Amazon in branding, consumer goods and e-commerce, in segments including Amazon Fresh, Prime Pantry and Worldwide Private Brands. He also spent more than a decade at consumer goods giant Procter & Gamble PG. \n\n- **Ryan Cohen** (CHAIR) is the manager of RC Ventures and a sizable stockholder of GameStop Corp. Mr. Cohen previously founded and served as the Chief Executive Officer of Chewy Inc. (NYSE: CHWY), where he oversaw the company’s growth and ascension to market leadership in the pet industry. Mr. Cohen led the company through its successful sale to PetSmart Inc. for more than $3.3 billion prior to stepping down in 2018. The company is now listed on the New York Stock Exchange with an equity market capitalization of approximately $40 billion. Mr. Cohen has extensive experience in retail, technology and e-commerce.\n\n---\n\n*\"What is Gamestop going to do? They have no working capital. The company is basically broke.\"*\n\n#**Gamestop raises 1.677 Billion dollars via ATM offerings**: \n\nGameStop disclosed on April 5, 2021 that it had filed a prospectus supplement with the U.S. Securities and Exchange Commission to offer and sell up to a maximum of 3,500,000 shares of its common stock from time to time through the ATM Offering. The Company ultimately sold 3,500,000 shares of common stock and generated aggregate gross proceeds before commissions and offering expenses of approximately $551,000,000. Net proceeds will be used to continue accelerating GameStop’s transformation as well as for general corporate purposes and further strengthening the Company’s balance sheet.\n\nGameStop disclosed on June 9, 2021 that it filed a prospectus supplement with the U.S. Securities and Exchange Commission to offer and sell up to a maximum of 5,000,000 shares of its common stock from time to time through the ATM Offering. The Company ultimately sold 5,000,000 shares of common stock and generated aggregate gross proceeds before commissions and offering expenses of approximately $1,126,000,000.\n\n#**Total working capital = 1.677 BILLION DOLLARS**\n\n---\n\n*\"How will gamestop possibly do same-day deliveries? Their stores are too small\"*\n\n#**Gamestop acquires 2 fulfillment centers totaling 1.2 million square feet in warehouse space** \n\nCompany’s Fulfillment Network Will Span Both Coasts of Continental U.S.\nGRAPEVINE, Texas, July 06, 2021 (GLOBE NEWSWIRE) -- GameStop Corp. (NYSE: GME) (“GameStop” or the “Company”) today announced the continued expansion of its North American fulfillment network and entry into a lease of a 530,000 square foot facility in Reno, Nevada, which is expected to be operational in 2022. The Company’s new presence in Reno, Nevada will position it to grow product offerings and expedite shipping across the west coast. This expansion follows GameStop’s entry into a lease of a 700,000 square foot facility in York, Pennsylvania.\n\n---\n\n-\n\n*\"Gamestop wants to be the next Amazon? Good luck beating Prime delivery times\"*\n\n#**Gamestop offers SAME DAY DELIVERY, often beating Amazon prime delivery times**\n\n- With GameStop’s new Same Day Delivery, you can get your order delivered in just a few hours from your local GameStop store. We’ve partnered with multiple delivery couriers who utilize Contactless Delivery to quickly pickup and deliver your order, safely. \n\n--- \n\n# **GameStop is building an NFT platform as part of an ambitious plan to transform itself into the Amazon of gaming**\n\nGameStop launched a website this week that says it's hiring a team to build a platform for nonfungible tokens, or NFTs. The website includes a message inviting engineers, designers, gamers, marketers, and community leaders to join the video-game retailer's team.It also posted a link to an ethereum address, suggesting it would base its platform on the blockchain technology. NFTs, a type of digital asset, exploded in popularity during the pandemic as enthusiasts and investors scrambled to spend enormous sums of money on items that exist only online.\n\nGaming is a natural fit for NFTs, given that gamers are already accustomed to buying in-game virtual assets like skins, currency and more to up the ante. The most popular NFTs have been known to sell for tens of millions of dollars. A GameStop NFT could generate some excitement both in the blockchain industry and among traditional gamers, which has the potential to spill over into the stock to give it a much-needed jolt.\n\n--- \n\n\n\n*\"Shorts covered/closed back in January. The stock is clearly spiraling back down to $50 / share\"* \n\n#**If shorts covered/closed, then why do they continue to short the stock DAILY?**\n\nAfter months of almost zero movement, who the fuck decides to wake up and sell the stock after fortuitous, bullish news?\n\nThe answer is ABSOLUTELY NO ONE\n\nAsk yourselves this: If the shorts covered/closed in January, then why the fuck are they still shorting the stock?\n\n--- \n\n\n#**Block out the FUD while we wait for the next big piece of news**\n\nAnyone that tells you that Gamestop isn't going anywhere or is a worthless \"meme\" stock literally has no idea what they are talking about. \n\nWhat will the next piece of news be? Who will be the next new hire? What will be the next catalyst? Even without a catalyst, based on the hires and business direction/model, this stock is soaring higher than anything we've seen before. You and your grandma better buckle the fuck up.",
    "title": "GME is going to moon, with or without a catalyst.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/otl6xr/gme_is_going_to_moon_with_or_without_a_catalyst/"
}