{
    "author": "BellaCaseyMR",
    "created_utc": 1627517167.0,
    "distinguished": null,
    "edited": false,
    "id": "otmcaz",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_otmcaz",
    "num_comments": 257,
    "permalink": "/r/Superstonk/comments/otmcaz/i_think_it_is_time_to_stop_being_zen_and_start/",
    "score": 755,
    "selftext": " Multiple posts on here today complaining, or worrying, that more people seemed Angry today. Worried they are not \"REAL APES\" and worried that they are \"SCARED\" and might sell.\n\nI think people are just tired of all the '**Be ZEN**\" posts and all of this **blatant, ON DISPLAY, market manipulation.** We need to be PISSED. To me all these \"Just be Zen\" posts are really saying just ACCEPT this criminal behavior and dont get mad at it. I think the more ZEN we are the longer they are going to get away with it. People need to be PISSED (not scared) and they need to express it and write and call thier representatives and news media (not because they are great people and want to help but because they need to know we know whats happening and we are PISSED about it)\n\nI have been in this since January. Have held from buying in at $380 down to almost $40 and up and down and never sold I am not about to sell now. I have increased my position massively (including converting two retirement accounts to all GME) and averaged down to $182. So yes a \"REAL APE\". And no the price going down does not SCARE me it just PISSES ME OFF. And no those of us who choose to be PISSED instead of ZEN about the corruption are not selling. Look at the OBV. But it is time to get MAD, PISSED and VOCAL. Squeaky wheel gets the grease. If we all listen to the \"ZEN\" FUD they will get away with it much much longer",
    "title": "I think it is time to STOP being ZEN and start being PISSED and VOCAL about this market manipulation",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/Superstonk/comments/otmcaz/i_think_it_is_time_to_stop_being_zen_and_start/"
}