{
    "author": "ThatGuyOnTheReddits",
    "created_utc": 1627494090.0,
    "distinguished": null,
    "edited": 1627501340.0,
    "id": "otex5g",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_otex5g",
    "num_comments": 490,
    "permalink": "/r/Superstonk/comments/otex5g/opinion_gamestop_is_building_their_own/",
    "score": 5321,
    "selftext": "If you are glued to the charts and stressing over todays dip... relax your tits. Experienced apes warned you yesterday to expect this. Old news.\n\nJust keep in mind:\n\n1) GameStops Board has a fiduciary duty to their shareholders. They have a legal obligation to make sure any decision they make benefits their shareholders...\n\n2) The CEO got hired-on and given stock allotment at a price in the $200's. He isn't going to watch his salary depreciate by 40% for nothing.\n\nSo... don't fret too much if they are being silent right now. They think that it is legally their best course of action. Otherwise GameStop would be facing the mother of all lawsuits after this is over...\n\nSo. What is GameStop actually doing?\n\nIn my opinion... they are building their own blockchain stock exchange.\n\nThey aren't just worried about NFT dividends. They aren't worried about shorts covering on the open market.\n\nThey have set the stage to take their ball and go home.\n\nThey posted in their release during the 5mil share sale that they could take their shares to another depository if they feel it was needed.\n\nhttps://sec.report/Document/0001193125-21-186796/#supprom192873_21\n\n*\"If a depository for a series of securities is at any time unwilling, unable or ineligible to continue as depository and a successor depository is not appointed by us within 90 days, we will issue individual securities of such series in exchange for the global security representing such series of securities. In addition, we may, at any time and in our sole discretion, subject to any limitations described in the applicable prospectus supplement relating to such securities, determine not to have any securities of such series represented by one or more global securities and, in such event, will issue individual securities of such series in exchange for the global security or securities representing such series of securities.\"*\n\n\nIMO: **They are talking about *their* depository.**\n\n\n\n\nWe have had employees talking about changing the entire financial system:\n\n\n\nApes, we aren't just investing in a retail store. We're possibly investing in the next, and first, US-based blockchain stock exchange...\n\n\nWhat if the SEC meetings in May weren't to discuss GME's stock, but to discuss the regulations on opening a new exchange?\n\n\nWhat if the 5mil stock offering wasn't to fund new expansion, but instead, to fund that new stock exchange?\n\n\nWhat if all the recent DTCC rules haven't been implemented simply to limit short liability... what if it's to limit the exposure to a share extraction?\n\n\nWhat if RC went to the SEC and said \"Stop this shit from happening, or I'm taking every share of my company off the exchange\"... and THAT's why all these rules have been fast-tracked onto the books?...\n\n\nWhat if we are the first investors in the only US-based blockchain-supported stock exchange?\n\n\nWhat if GameStop really does change finance forever...\n\n**Edit:**\n\nu/clawesome just posted this awesome detective work:\n\nhttps://old.reddit.com/r/Superstonk/comments/otdhum/the_ethereum_address_ive_been_following_with_the/\n\nIt shows an ETH address that he has been following, that has had deposits made in the same amounts as the shares that GME has recently issued. \n\nThis is actually not unheard of, either. A company owns the Nasdaq Exchange (Nasdaq Inc) that has itself listed on the Nasdaq (Ticker: NDAQ).\n\n**Edit edit**: \n\nFellow Ape pointed out tZero. I agree it makes infinitely more sense to join an existing blockchain platform than to create one. I can not edit the title or I'd include this...\n\nEither way... I don't think GME is going to be listed on it's current exchange much longer...\n\n**Edit edit edit**: \n\nGameStop just listed an absolute shit ton of corporate job positions on their website... Including multiple Data Scientists etc...",
    "title": "Opinion: GameStop Is Building Their Own Blockchain-based Stock Exchange...",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/otex5g/opinion_gamestop_is_building_their_own/"
}