{
    "author": "clawesome",
    "created_utc": 1627489897.0,
    "distinguished": null,
    "edited": 1627522864.0,
    "id": "otdhum",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_otdhum",
    "num_comments": 562,
    "permalink": "/r/Superstonk/comments/otdhum/the_ethereum_address_ive_been_following_with_the/",
    "score": 8981,
    "selftext": "Ethereum address:  https://etherscan.io/address/0x664638c364299bbd343d07d7ad0c89df7a339198#tokentxns   \n\nI've been watching this address for a few weeks now and it just had it's first transaction in over 12 days immediately following Ryan Cohen's latest tweet.  This is speculative but I really don't believe that to be a coincidence and I believe it could be related to a dividend or moving their shares to another depository.  [Each share has a value of $0.001](https://news.gamestop.com/static-files/4ef3fc60-b489-42e3-9436-1c6f55c772fa) in the current depository and this address has had $47794.77773(enough to represent 47.7mil shares) pass through it, roughly $25k more would be enough to represent every outstanding share.  I've posted this address a few times in comments but feel it needs more eyes, especially with it's latest transaction being so close to Ryan Cohen's latest tweet.  \n\n|date|amount|\n:--|:--|\n|7/28/21|5,084.306187|\n|7/15/21|3,374.754044|\n|7/15/21|19|\n|6/27/21|7,173.55795|\n|6/23/21|10,594.888128|\n|4/26/21|21,548.271421|\n|total|47794.77773|\n\nedit:  Something I just noticed, look at the last two transfers $3,374 and $5,084.  GameStop's last two ATM offerings were [3,500,000 shares](https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program) and [5,000,000 shares](https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program-0) which would be pretty close to those two transactions when valued at $0.001 a share.  Those two transactions add up to $8,459, only ~~$51~~ $41(thank you u/Ben_Dersgrate) off from being able to represent both offerings at a $0.001 valuation.  \n\nedit 2: Put on extra tinfoil for this as it's most likely me going too deep into the foil.  If you start a Fibonacci like sequence from the $3.3k transaction working backwards, the transactions add up pretty close to the transaction value before them.  Because of this, I am theorizing this might work the other way and possibly be able to deduce what the next two values will be.  Doing so and then summing all of the numbers adds up to $73,152, which comes way pretty damn close to the 74.38mil($74,380 @ $0.001/share) that FINRA and Yahoo report as being the shares outstanding.  I might be too deep into the tinfoil to see the forest at this point and it's wild speculation, but I guess we'll see when the next transaction comes in, whenever that is.\n\n>!\n|date|amount||\n:--|:--|:--|\n|hypothetical|16,918.120462|(8,459.060231 + 5,084.306187)|\n|hypothetical|8,459.060231|(5,084.306187 + 3,374.754044)|\n|7/28/21|5,084.306187||\n|7/15/21|3,374.754044||\n|7/15/21|19||\n|6/27/21|7,173.55795||\n|6/23/21|10,594.888128|(7,173.55795 + 3,374.754044 = **10,548.311994**)|\n|4/26/21|21,548.271421|(10,594.888128 + **10,548.311994** = 21,143.200122)|\n|new total|73,152.958423||!>",
    "title": "The Ethereum address I've been following with the hypothesis that it would be used for either a dividend or to transfer their shares to another depository had it's first transaction in almost two weeks just minutes after Ryan Cohen's latest tweet",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/otdhum/the_ethereum_address_ive_been_following_with_the/"
}