{
    "author": "The_Retro-Samurai",
    "created_utc": 1620812713.0,
    "distinguished": null,
    "edited": false,
    "id": "naktm8",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_naktm8",
    "num_comments": 285,
    "permalink": "/r/Superstonk/comments/naktm8/thankyou_for_flying_gme_please_grab_your_final/",
    "score": 6170,
    "selftext": "There are movements happening all over the Market 24 hours... more volume and Volatility than there ever has been. \n\n I Love **Bollinger Bands**... google it if you want to know more, Im not your Mom!\n\nThere is a massive incoming upward push on **GME** *(yeah yeah you all know ... already)*\n\nThis is confirmation... that last prickling doubt telling you maybe it wont work?.. what happens if?\n\nWell it will...and  it is... and if your reading this your probably knee deep in shit and paddling like a toddler in a ball pool like the rest of us anyway.\n\nThe Only Shorts that got covered,  Were Ken's shorts ..when the first squeeze happened.  \n\nThose stains are never washing out!\n\nUsing the Bollinger Daily chart mapping, you see the RED High average, YELLOW is median and green is low average.\n\nMost stock follows close to yellow tips up to red and bubbles *(lines are separated and loose like a balloon)* and then falls, when it hits green it either falls to Oblivion or bounces upwards like fat kid riding a space hopper on a trampoline.\n\n&#x200B;\n\nhttps://preview.redd.it/mga2n69drny61.jpg?width=1033&format=pjpg&auto=webp&s=8a5c475f55a5cb2f14d16aa21fdb4f6d582cd0b3\n\n**GME** Long game you see the corridor on the left post January breaking out of this choke point riding the red and dropping, typical squeeze pattern.. \n\nThe bands tighten in March and again rides the red and falls another squeeze. Then the new corridor forms just like post January getting tighter as days go on. What happens here is it rides the yellow and tips the red over and over until something changes.\n\n&#x200B;\n\nhttps://preview.redd.it/wb92zhxfrny61.jpg?width=1079&format=pjpg&auto=webp&s=f9494a209b7b0269f027fc390d8c1e8708a8f3df\n\nAnd it has! its now hitting the green band, This means two things, the stock is dead or the stock is about to take a huge upshot, and this stock is not DEAD! ...\n\n you can look back and Chart this yourself on any stock and **GME AMC** etc to see the Highs and Falls.\n\n&#x200B;\n\nhttps://preview.redd.it/eurj054lrny61.jpg?width=1066&format=pjpg&auto=webp&s=9552a5f6cf5b176f69b2cca860767cf1320df4e0\n\nHere is **ADA** recent Jump hitting the green after a long battle of RED and Yellow and SHAZAAM its heading up.\n\n&#x200B;\n\nhttps://preview.redd.it/imnok4inrny61.jpg?width=1080&format=pjpg&auto=webp&s=ba6487a73201fb99bdb2c71506a1f8630001ede3\n\n**NRGU** Recent, Stalemate locked into red and yellow foreplay until some one tickles the green and WOOSH. it happened just previous to this too but my cropping skills are as \n\n&#x200B;\n\nhttps://preview.redd.it/vwc87a2qrny61.jpg?width=1080&format=pjpg&auto=webp&s=8ad219ec2a7be8ddfc6a6beee05d7ec262e0cb0e\n\nAMC are heading the same way as GME, but it seems they are slightly out of sync almost like an echo... maybe a possibility to **MOAS GME** and then **MOAS AMC** after.. maybe would need better timing data, But this is it.\n\n I don't think this will happen again on this scale, not in our lifetimes especially not mine I'm old, my Eldest son is writing this post as I rant and rave from my **Comfy** chair sipping Whiskey. \n\nHelmets on, Keep Your eye on the sky and See you on the **Darkside!**\n\n\\*\\*EDIT\\*\\*\n\n Reposted and Reformatted due to the fact I'm old and still think the Internet has a dial tone\n\nCharts above are mapped on Etoro because **BullTRade** and **HL** Charts are hard to show you...too much dead info Criss Crossing and scribbles around it  looks like the inside of a serial killers Cell.\n\n**Helmets on, Keep Your eye on the sky and See you on the Darkside!**",
    "title": "Thankyou for Flying GME , Please Grab your final tickets.... and Remember to put your Helmets on. ===Now Boarding===",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/naktm8/thankyou_for_flying_gme_please_grab_your_final/"
}