{
    "author": "TotalFNEclipse",
    "created_utc": 1628432513.0,
    "distinguished": null,
    "edited": false,
    "id": "p0fiiq",
    "text_only": true,
    "flair_text": "Art & Writing 🎨",
    "name": "t3_p0fiiq",
    "num_comments": 188,
    "permalink": "/r/Superstonk/comments/p0fiiq/mama_ape_passed_peacefully/",
    "score": 3477,
    "selftext": "Just want to preface this by saying THANK YOU to all of the kind Apes who reached out and messaged me last month (July 6-7+) when I found my Mama barely conscious from a stroke and we sent her to Intensive Care for 12 days, before she passed peacefully. \n\nI struggled mightily with what to do, being an only child (unmarried), and not a lot of family to help. Reading the (nearly 3k) comments on here gave me hope, inspiration, and a lot of insight from those who had unfortunately gone through similar situations. \n\nSome advised I start a GoFundMe and post it here. I did manage to set that up on my personal FB page. Friends and Family really came through and answered! (I decided against posting the link here, as I didn’t want to pose a distraction or place our movement in any possible financial contempt, shill attacks, etc).\n\nEvery Christmas, Mom used part of her paycheck (single mother, worked hard physical labor in a warehouse manufacturing plant, rode the bus to work, never had a drivers license) - and would buy gifts for orphaned children and participate in the fundraisers at our local shopping mall. \n\nAs a result of this happening, I’m now going to place one of my precious shares into the Forever-Ever pool, in honor of Mama Ape, who taught me to always love and HELP those in need. It was her big, warm heart that really shined through to me. \n\nMama Ape’s giving heart will be continuously providing a spark to our message of being kind, loving, & helpful to those less fortunate than us. \n\nRIP Mama 💙\n\n\nPS- special thanks to “Chetter” (full username withheld), who personally text messaged me updates each day with medical field background in neurology, and helped keep me level-headed.",
    "title": "Mama Ape passed peacefully.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/p0fiiq/mama_ape_passed_peacefully/"
}