{
    "author": "ClearlyPopcornSucks",
    "created_utc": 1626602495.0,
    "distinguished": null,
    "edited": 1626605838.0,
    "id": "omnpzw",
    "text_only": true,
    "flair_text": "𝗗𝗮𝘁𝗮",
    "name": "t3_omnpzw",
    "num_comments": 152,
    "permalink": "/r/DDintoGME/comments/omnpzw/july_916_and_may_512_they_are_the_same_picture_oh/",
    "score": 1836,
    "selftext": "# TL;DR\n\n* **My hypothesis is that the last 6 trading days (July 9th - July 16th) were almost** ***THE SAME*** **as May 5th - May 12th, which was the setup that was the very beginning of the last bullish movement**\n* The price is being very, very, very heavily manipulated, like wtf....\n* Buy & hodl, so hot right now\n\n# Intro\n\nI am pretty sure that my post will be buried under high-school drama shit and other forum sliding stuff but I'm going to give it a shot anyway.\n\nSo I've been playing around with some numbers in Google Spreadsheets trying to investigate the 60D cycle theory based on how similar the drops and consecutive days were after **March 15th** and **June 10th** (these days were nearly identical and the following days showed pretty much the same dynamics indicating that we're in the same pattern). My initial hypothesis was pretty much the same as the guy that claimed to [broke the shorting algo](https://www.reddit.com/r/DDintoGME/comments/ogjoh3/i_think_i_figured_out_the_shorting_algorithm/) although with all due respect I think it was a massive overstatement and I'd rather stay humble in terms of evaluating my research.\n\nThe 60-day cycle hypothesis was holding water for some time but recently it started to fall apart more and more. I was about to drop this topic and move on...\n\n[The 60D pattern hypothesis started off very nicely but started to fall apart recently. \\(Blue candles: trading days after June 10th, Gray candles: trading days after March 15th.\\)](https://preview.redd.it/60rdd45e1yb71.png?width=1079&format=png&auto=webp&s=ed6e45767addc766f3ae9868d89d7a8042d9a0ab)\n\n...but then I noticed something else and I was like \"**b\\*\\*ch, no way...\"**\n\n&#x200B;\n\nhttps://preview.redd.it/4umik92l1yb71.png?width=1363&format=png&auto=webp&s=807d2bd04c23a1bc76c3a15363fefbf55aea4111\n\n# My methodology\n\nYeah so I am not really smart, my statistical skills were never high and on top of that they are now very rusty as I grew old so I am sticking to simple things. For the 60D cycle hypothesis I've been comparing and tracking changes in 8 basic values for each day\n\n* Open price\n* High price\n* Low price\n* Close price\n* Volume\n* Amplitude (difference between high price and low price )\n* Daily % change\n* Intraday change (difference between close price and open price)\n\nFor each of these values I've been checking [Pearson correlation coefficient](https://en.wikipedia.org/wiki/Pearson_correlation_coefficient) which is like the most basic and primitive statistical tool ever. It's like a stone and I am like a primate that throws it here and there (but well, my hypothesis is pretty simple so I used simple tools.)\n\nOn top of that I've been making simple charts presenting how these values were changing over the days to better see the dynamics.\n\n# Similarities between May 5-12 and July 9-16\n\nThe mentioned values for 6 trading days of May 5-12 and July 9-16 looks like this:\n\nhttps://preview.redd.it/nyc0dunt1yb71.png?width=884&format=png&auto=webp&s=b7cff55ccef12b62cd19a7c2edf1c90cc01f79c1\n\nhttps://preview.redd.it/c66wyw9w1yb71.png?width=887&format=png&auto=webp&s=e10b5bb0be0dfe0ff103f1a3c8df6af7a5cc999b\n\nAnd the Pearson coefficient for each of the measured values for these periods looked like this:\n\n|Value|Pearson coefficient|\n|:-|:-|\n|Open price|**0.95**|\n|High price|**0.85**|\n|Low price|**0.96**|\n|Close price|**0.91**|\n|Volume|**0.85**|\n|Amplitude|**0.87**|\n|% Change|0.69|\n|Intraday change|**0.85**|\n\nFor the apes that don't know how to interpret values of Pearson, [here is some article about that](https://support.minitab.com/en-us/minitab-express/1/help-and-how-to/modeling-statistics/regression/how-to/correlation/interpret-the-results/) but in general, Pearson can range from -1 to 1.\n\n* \\-1 means there is perfect negative correlation (A rises exactly as B falls)\n* 0 means there is absolutely no correlation whatsoever between A and B\n* 1 means there is perfect positive correlation (A rises and falls exactly as B)\n\n**So what we have here for May 5-12 and July 9-16 is a very strong correlation of 0.85+ for literally every key value except daily percent change!**\n\nBut screw the numbers amirite? [They are for suits](https://youtu.be/PQBubLv49fk?t=56). Let's take some colorful crayons and draw some lines (Red: July 9-16, Blue: May 5-12)\n\n&#x200B;\n\nhttps://preview.redd.it/jkqvm3py1yb71.png?width=1199&format=png&auto=webp&s=2cc02aa548e64fcea39d6aeb27151d912031f357\n\nhttps://preview.redd.it/mtdfxhwz1yb71.png?width=1202&format=png&auto=webp&s=22d7d418e70a218ce003ba154ca0b55f4ec3d6f8\n\nSo the changes in price is strikingly similar, it's just 20-30$ higher for July's pattern compared to May. **But look at the volume and amplitude!** They are nearly identical even in terms of absolute values. I don't know about you, I know that we've seen weird things since January but as for me personally, it blew my mind 🤯\n\n# OK, now what?\n\nWell you know what happened after May 5-12? Our sweet, sweet stocky-stock started its wild run to the land of 300$\n\n&#x200B;\n\nhttps://preview.redd.it/8xfts6lo1yb71.png?width=1256&format=png&auto=webp&s=ccec94ccaf27f904a7948a3e41a4162519b7bc31\n\nNow let me be perfectly clear, I am not claiming that the rocket takes off on Monday. A lot of other indicators are telling so (MACD, RSI especially out of those that I somewhat understand) but we also still don't know the exact limits of the SHF fuckery.\n\nRegardless of that, holy moly! I am excited for the upcoming week even more that I have been for the couple of previous ones. BRING IT ON! 🚀 🌝  💎 🙌\n\nDisclaimer #1: **This is not a financial advice, I am like seriously stupid and there is a huge chance that my research is worthless**\n\nDisclaimer #2: My username has nothing to do with the movie stock, I don't care about it (except when I compare it's movement to GME) and these are just three random words I used for creating this account 2 years ago\n\nDisclaimer #3: English is not my first language so sorry for mistakes.\n\nEdit 1: one typo and table formatting",
    "title": "July 9-16 and May 5-12 - \"they are the same picture\". Oh god this makes me so excited for the upcoming week...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/omnpzw/july_916_and_may_512_they_are_the_same_picture_oh/"
}