{
    "author": "alexandrosdimo",
    "created_utc": 1622915417.0,
    "distinguished": null,
    "edited": 1622916726.0,
    "id": "nt19lb",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_nt19lb",
    "num_comments": 99,
    "permalink": "/r/Superstonk/comments/nt19lb/get_ready_for_the_ultimate_fud_and/",
    "score": 893,
    "selftext": "That’s right...if you haven’t already started noticing there are some celebrities picking up the narrative of #nakedshorts on Twitter. Except, they’re clouding the real stonk that should be discussed.\n\nThey’re pushing that piece of shot popcorn stock, when the big elephant in the room is still not being covered.\n\nExpect that HFs have switched on the code orange of FUD. The last ditch effort...the attempt to kill switch. They’re going to come out swinging, and they are going to leverage mass media adoption to pump and dump the movie stock. \n\nCelebrities that get involved should be ashamed of themselves. But what do they know...they merely going to collect pay checks to collectively push one message. That message is that the MOASS is in the movie stock, when in reality the ONLY PLAY here is GME.\n\nBut what do I know...I smear peanut butter all over my body. I like the stock and I’m doubling down on GME because CNBC told me to!\n\nEdit* Prove me wrong. The Iron SHEIK is FUD and he’s the first of the official celebrities to endorse the wrong stock.\n\nEdit* [this post is FUD](https://www.reddit.com/r/Superstonk/comments/nsw1fk/even_the_iron_sheik_is_pissed_off/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nEdit 3* take a look at #nakedshorts on Twitter. Absolutely disgusting how they’re manipulating the masses.",
    "title": "Get ready for the ultimate FUD and shills...celebrity endorsed tweets, posts, and commentary",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nt19lb/get_ready_for_the_ultimate_fud_and/"
}