{
    "author": "_rerun984",
    "created_utc": 1626532121.0,
    "distinguished": null,
    "edited": 1626613246.0,
    "id": "om5aq3",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_om5aq3",
    "num_comments": 129,
    "permalink": "/r/Superstonk/comments/om5aq3/ftd_dates_potential_t35s_to_watch_for/",
    "score": 2229,
    "selftext": "In an attempt to distract the mob from the drama, i'd like to add this as a reminder of what we're seeing here.\n\nOn  June 18th we saw a spike on FTD's of 462k+ with another spike on 6/29  for 346k+If we follow the t35 cycle - we should see spikes on July 26th,  and again on August 5th.Both dates take 4th of july observance into  calculation.\n\nThe other thing I've  been tracking is volume. I've actually been updating this spread sheet  since April 12th, and volume appears cyclical - I believe we've bottomed  out on volume and should an uptick in the coming weeks - with price  this low. Ideally, we're witnessing a new floor being formed.\n\nSometimes you have to take a step back to keep advancing forward.\n\nNothing  has changed about this trade, Nothing is normal about the daily price  movements.If this stock wasn't a threat we'd be trading at well below  $100.We see the walls go up everyday, we witness the price suppression  in real time, we see the dark pool data and the failures to deliver.\n\nEveryone is telling us that we're wrong, who gives a fuck.\n\nI like the stock, i'll continue to Buy more and hold.\n\nNot financial advice.\n\n&#x200B;\n\n&#x200B;\n\nEDIT: Guys, I definitely factored the dates wrong and went with business days not calendar days.   \nthis post [https://www.reddit.com/r/Superstonk/comments/omdx8y/ftd\\_close\\_due\\_date\\_is\\_t35\\_calendar\\_days\\_not/](https://www.reddit.com/r/Superstonk/comments/omdx8y/ftd_close_due_date_is_t35_calendar_days_not/) has corrected the dates, I will work on compiling more data today and getting a more accurate version of this up \n\n&#x200B;\n\nsorry for the mistakes!   \n\n\nu/pepsodont  \n\n\n&#x200B;\n\nhttps://preview.redd.it/fm7pzk5k9sb71.png?width=1030&format=png&auto=webp&s=c67427fba81650166b795db8e9990a7802a7d240",
    "title": "FTD Dates - Potential T+35's to watch for",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/om5aq3/ftd_dates_potential_t35s_to_watch_for/"
}