{
    "author": "Insolopia",
    "created_utc": 1623588537.0,
    "distinguished": null,
    "edited": 1623664158.0,
    "id": "nyvlws",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nyvlws",
    "num_comments": 236,
    "permalink": "/r/Superstonk/comments/nyvlws/as_a_new_returning_ape_i_always_saw_read_the_dd/",
    "score": 9754,
    "selftext": "This subreddit is amazing, but as a newcomer i found it very daunting to \"do my own DD\" and the following order is both what i found most interesting, and what helped me understand it all. Hopefully it helps some new apes, which can then branch off and delve deeper into it all knowing the basics.\n\n\n\n\n&nbsp;\n\n\n**Explains all the basics and the terms:**\n\n\n[u/HCMF_MaceFace LINK](https://old.reddit.com/r/Superstonk/comments/nletnn/gme_the_mother_of_all_short_squeezes_moass_thesis/)\n\n&nbsp;\n\n\n**House of Cards. What is the DTC and much more:**\n\n\n[u/atobitt PDF LINK](https://pdfhost.io/v/lRQ4HqpG0_House_of_Cards_Atobitt.pdf)\n\n&nbsp;\n\n\n[House of Cards part 1 LINK with a bit more information.](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/) \n\n[Part 2 LINK](https://old.reddit.com/r/Superstonk/comments/nlwaxv/house_of_cards_part_2/)\n\n[Part 3 LINK](https://old.reddit.com/r/Superstonk/comments/nlwqyv/house_of_cards_part_3/)\n\n&nbsp;\n\n\nThe above also goes into depth about naked shorting which is very important. \n\n&nbsp;\n\n\n**More information on naked shorting:** \n\n[u/sharkbaitlol LINK](https://old.reddit.com/r/Superstonk/comments/nt0ojl/everything_superstonk_knows_about_naked_shorting/)\n\n&nbsp;\n\n\n**The Everything Short - what is happening and why and how it ties in with everything else (ETFs etc):**\n\n\n[u/atobitt LINK](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n&nbsp;\n\n\n**Similar to the above, but how it ties in with price movements of GME around shorting & FTDs on a cycle:** \n\n\n[u/Criand LINK] (https://old.reddit.com/r/Superstonk/comments/ny2ov4/a_revisit_to_net_capital_what_is_truly_driving/)\n\n&nbsp;\n\n\nIt also helps to understand why you shouldn’t panic when suddenly the price tanks, for example you can speculate the price will pump around T+21, then it will cool off and dip. Don’t sell, looking to buy in cheaper because 9/10 times you will lose. Just buy more or take a DCA approach. You have enough to buy 10 shares? Then buy 1 or 2 a day so you don’t miss out and end up fomoing in on a peak, but you also land a potential dip. [u/MSCToker Why **Averaging up** in GME is a wise move LINK](https://www.reddit.com/r/GME/comments/nv3zwc/concentration%5C_vs%5C_diversification%5C_and%5C_averaging%5C_up/) \n\n&nbsp;\n\n**Technical Analysis side of things from our friendly apes:**\n\n&nbsp;\n\nHere is Elliott Wave guy (not most recent version, search for the rest) [u/possibly6 LINK](https://old.reddit.com/r/Superstonk/comments/nwyj77/elliot_waves_and_gme_why_im_jacked_to_infinity/)\n\n&nbsp;\n\n\n\n[u/squidja with Elliott Waves explained LINK](https://www.reddit.com/r/Superstonk/comments/nz8k6w/fibonacci_retracement_a_supplemental_elliot_wave/?ref=share&ref_source=link)\n\n&nbsp;\n\nHere is Exponential Floor guy. [u/JTH1 LINK](https://old.reddit.com/r/Superstonk/comments/nwwy5x/0610_update_broke_the_logfloor_by_1_5_in_linear)\n\nHere is ajquicks take on it. [u/ajquick](https://old.reddit.com/r/Superstonk/comments/nynxtq/recalculating_the_exponential_floor_equation/)\n\n&nbsp;\n\n\nSo all the above links cover a lot, but why are people so jacked right now, didn't GME allegedly already do 2 offerings, diluting the share pool and delaying the squeeze / potentially stop it from reaching a higher high?\nRemember they are not in debt and 1-1.5bil cash in the coffers is a great thing to have!\n\n&nbsp;\n\n\nOn this sub, people don't like to talk about dates. But I used the dates link here [u/Ginger_Libra LINK](https://old.reddit.com/r/Superstonk/comments/nxu1ck/lets_talk_datesthe_last_few_weeks_of_june_are/) to understand what is potentially happening in the future, and why it could be important by doing DD around the subject. (reading wrinkled apes DD on this sub.)\n\n&nbsp;\n\n\nIn \"House of Cards\" it touched on the fact we don't actually own our shares, but with a block chain you would. Also it highlighted the issues around conflict of interest around the fact that DTC board members are members / top guns of big hedge funds etc etc. Why is this a problem? Well technically they self regulate themselves. People are really hoping for this DTC rule to finally be re-implemented  [u/SpinCharm LINK](https://old.reddit.com/r/Superstonk/comments/ntg2ya/dtc2021005_is_supposed_to_be_the_regulatory/)\n\n&nbsp;\n\n\n\n**So why are people hyped around July 14th?**\n\n&nbsp;\n\nPotential for a blockchain dividend. Also describes what an NFT is.\n[u/integ3r_p0sitron LINK](https://old.reddit.com/r/Superstonk/comments/nmd7cr/the_guaranteed_short_squeeze_trigger_the/)\n\n&nbsp;\n\n**What’s an exit strategy?**\n\n\n&nbsp;\n\n[u/gherkinit exit strategy DD](https://old.reddit.com/r/Superstonk/comments/nogxnr/infinity_war_the_final_exit_dd_compilation/)\n\n\n&nbsp;\n\n\n**So once you have gained some wrinkles, take a look at these more in depth DDs**\n\n&nbsp;\n\n\n[u/Blanderson_Snooper GME Master Guide campaign / compilation] (https://www.reddit.com/r/Superstonk/comments/njwv6n/the_gme_masters_guide_a_dd_campaign_for_apes/)\n\n&nbsp;\n\n\n\n[3 Part - Where are the shares??](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/)\n\n&nbsp;\n\n\n**As suggested by other users, then visit these users profile and go through their DD’s**\n\n&nbsp;\n\n[u/Buttfarm69 LINK](https://www.reddit.com/user/ButtFarm69)\n\n&nbsp;\n\n\n[u/HomeDepotHank69](https://www.reddit.com/user/HomeDepotHank69)\n\n&nbsp;\n\n\n**Lastly, if you truly are a new ape, you need to know who DeepFuckingValue is, commonly referred to as DFV, the meme overlord and the original wrinkled brain who saw what could happen to GME**\n\n&nbsp;\n\n\n\n[u/DeepFuckingValue LINK](https://www.reddit.com/user/DeepFuckingValue)\n\n&nbsp;\n\n\n\n**NEED TO INSERT HERE WHY BUYING AND HOLDING IS THE BEST STRATEGY. SIMPLIFIED, SHORT YET ON POINT. PLEASE LEAVE A COMMENT WITH A LINK OR DD <3**\n\n&nbsp;\n\n\n**Adding in suggestions** \n\n&nbsp;\n\n\n[u/Pop-Tart_Rabies_MonkA lot of advice recently around passive income through ETFs etc - this says no](https://www.reddit.com/r/Superstonk/comments/ny9rxv/beware_of_passive_investing_index_funds_and_etfs/?utm_medium=android_app&utm_source=share)\n\n\n&nbsp;\n\nThere are 100’s of other DDs on this sub, once you have read everything above just use the search function for the sub and use terms you would like to delve deeper into. For example “options” “Junk bonds” “Reverse Repo” to name a few. \n\n&nbsp;\n\n\n\n\nI do not take credit for any of the DD's above, I'm just posting the above to help other apes who have no wrinkles and give them some guidance on where to start. \n\n&nbsp;\n\n\n\nLove what you apes have done here, keep it up! \n\n&nbsp;\n\n\n\n“But what if you / they are wrong? What if the price crashes even more” \n\n&nbsp;\n\n\n\n**TL;DR I buy more, and hodl. My own opinion is this is one of the best long plays currently on the market. Once you have completed your own DD, make your own decision, it will then give you the confidence to hold the dips, and ride the rips.**\n\n&nbsp;\n\n\n\nGameStop is already established with its brick and mortar setup, and recently it effortlessly released same day delivery because of it’s established “network” of stores. The biggest problem a new brand has is advertising and getting its name out there. Everyone knows who GameStop is now because of this whole saga. They are debt free, already have, or soon will have, over 1 billion in cash in the coffers, and they have a chairman and a team of some of the best minds in the business. If anyone can do the impossible and turn this business around by tapping into the billion dollar gaming industry, manage to pull off reselling of digital games, become a wholesaler for the PC market, reignite the golden age of LAN party-esque nostalgia AND become the top company in the industry, it’s these guys!\n\n&nbsp;\n\n\n\nEven if there is no squeeze and they pull fuckery of the likes we have never seen before, what they are doing with the company is my safety net.\n\n\n&nbsp;\n\n\nAnd lastly, there is a lot of talk and DD around an impending crash / financial crisis looming. It is all speculation at the moment, but take the time to look into it. Better to be prepared for the worst scenario, than caught out like mr Kenny G. \n\n&nbsp;\n\n\n\nWow this is really blowing up!! Thank you, and glad it will help some. Gone back through and given credit to those that provided the DD.\n\nI have removed some *items* to change the narrative.",
    "title": "As a new, returning Ape i always saw \"Read the DD\". So i did. For all new apes, i'd recommend all these DD's in order to understand the basics of what is going on, and why people are so jacked right now!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyvlws/as_a_new_returning_ape_i_always_saw_read_the_dd/"
}