{
    "author": "jaybaumyo",
    "created_utc": 1623567035.0,
    "distinguished": null,
    "edited": 1623570208.0,
    "id": "nyqnqh",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nyqnqh",
    "num_comments": 170,
    "permalink": "/r/Superstonk/comments/nyqnqh/so_the_reverse_repos_are_definitely_related_to_gme/",
    "score": 2159,
    "selftext": "Credit to u/criand for pointing this out in a comment.\n\n&#x200B;\n\nedit:  here is the damn eggheads that have come to the opposite conclusion (just playing I love the quant guys their work is fucking incredible): [https://www.reddit.com/r/DDintoGME/comments/nype4f/is\\_gmes\\_price\\_related\\_to\\_the\\_reverse\\_repo\\_rate\\_in/](https://www.reddit.com/r/DDintoGME/comments/nype4f/is_gmes_price_related_to_the_reverse_repo_rate_in/) \n\nHonestly, I would trust their math over my eyeballs, but go head and read anyway so you can make your own conclusions.  Criand and several others have commented with some really good insight.\n\nI just wanted to bring this to the community so some more wrinkly brains could make some assumptions about what may be happening.  If you look at the reverse repo rates, they line up pretty well with GME movements.  Let's take a looksie here...\n\nHere is some GME green lines to refresh everyone's memory:\n\n&#x200B;\n\n[January price action](https://preview.redd.it/9vszopnl8z471.png?width=427&format=png&auto=webp&s=3bc5900aa156a301ae0a29b3cbd1bbcf46f8491c)\n\n&#x200B;\n\n[February cute little spike there](https://preview.redd.it/ksdxq8fz8z471.png?width=705&format=png&auto=webp&s=724d90063ae75c13d27301cc13081ca274e69503)\n\nAnd here is the corresponding Reverse Repo graph:\n\n&#x200B;\n\n[Reverse Repo for Jan and Feb](https://preview.redd.it/qyeyuplr8z471.png?width=1167&format=png&auto=webp&s=c0286977bcb7086884c091f88eb4edcac830b3e8)\n\nWell look at that!  It appears there is a build up in repo starting on the 28th, which spikes up on the 29th, same day as the second GME peak and following drop (likely some type of short attack with synthetics or something).  Then again on the 24th and 25th of Feb, we see a large increase in price in GME and a much larger increases in repos on the 26th and 27th.  Hmm...\n\n&#x200B;\n\n[Here's that really gorgeous peak in March 10th.  Got me some shares on the way up to that one.  Absolute beauts.  They look fantastic in my collection of positions.](https://preview.redd.it/4rkmdbcm9z471.png?width=565&format=png&auto=webp&s=8a7741d46ece6dc6dcca89c986b80f487fd2db9c)\n\n&#x200B;\n\n&#x200B;\n\n[Here's the rest of the graph there, it important for the next picture...](https://preview.redd.it/a6gbf37taz471.png?width=453&format=png&auto=webp&s=bc55b1cad5cc82a08f66291cdb80aedcbaf84b13)\n\n&#x200B;\n\n&#x200B;\n\n[Here's the repos for a similar period](https://preview.redd.it/6a0scca5bz471.png?width=1154&format=png&auto=webp&s=98b19d10b2c0ca570db29e969db827f9836ae747)\n\nSo here we have another nice little 11 billion spike around march 10.  But what I really love about this graph, is that GME didn't really tank again.  It stayed fairly strong.  And what do you know?  The repo rates are no longer flatlining ever.  They just start going up and up.\n\n&#x200B;\n\n&#x200B;\n\n[And here we are from mid May till now.  Note the Y-axis values.](https://preview.redd.it/063xhomobz471.png?width=1145&format=png&auto=webp&s=c7d1500b555d9788d5a7173d7a53893f730131ae)\n\nSo the rise in repo rates seems correlated (maybe not causally, but that's why I'm posting) to GME.  The first spikes in GME price is where we start seeing small(ish) 11 billion spikes in repos.  But then GME doesn't go down.  Apes are hodling the fuck out of the stock.  At this same time, repo rates start climbing.  There's no more flat lines near 0 like we see during the period in February when GME was stagnant in the 40s and 50s.\n\nWhat does this all mean?  I'm not sure.  I know that for the banks, cash on hand is a liability.  They don't own it and they pay interest on it.  So they prob can't use that to balance their books.  So they get the bonds instead, then use that as collateral to balance their books so they don't look like they hundreds of billions in the shit, then give it back for their cash?\n\nSomeone please fill me in on what exactly is happening here.",
    "title": "So the Reverse Repo's are definitely related to GME",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nyqnqh/so_the_reverse_repos_are_definitely_related_to_gme/"
}