{
    "author": "Environmental-Camp28",
    "created_utc": 1618052605.0,
    "distinguished": null,
    "edited": 1618087308.0,
    "id": "mo2nfu",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mo2nfu",
    "num_comments": 462,
    "permalink": "/r/GME/comments/mo2nfu/there_is_no_way_in_hell_they_covered_their_shorts/",
    "score": 5554,
    "selftext": "I am editing my post to mention this fellow, his comment makes a lot of sense. We could both be right so I thought I should mention it:\n\nhttps://www.reddit.com/r/Superstonk/comments/mo038k/04102021_the_fud_news_on_melvin_stop_believing/?utm_medium=android_app&utm_source=share\n\nThis is a FUD campaign. I guarantee next week we'll see articles about a squeeze, \"Melvin's covered for realsiez guys,\" and other FUD tactics to make people think the squeeze has happened.\n\nUntil we see official documents stating a 49% loss, take it with a grain of salt. It's serious confirmation bias!\"\n\n\n\n---------_______\n\nThey can cheat and piss on the market system have the SEC in their pockets, do shady shit to the stocks, no way they can do anything in their balance sheet and P&L.\n\nNow:\nIf they had covered their shorts in January which was suposedly responsible of the 49% loss, only a complete maniac would risk shorting it yet again, the board would not risk another investment that made them lose HALF their revenues, nor would their CLIENTS. This is just nonsense. However, the shorting attacks have carried on, borrowing shares, naking shorting,  corrupted medias, shills etc.  \n\nTLDR: If they covered the shorts, they wouldn't short GME again. Auditors would highly recommend to forget about GME.\n\n\nIf they didnt cover their shorts, those losses come from the borrowing fees, the liquidity issues (forced closing other positions to be able to short and short again) if you stand on losing even more than 49% , you will do anything to avoid bankruptcy even if it means bleeding more. At this point, the auditor can be neutral as opposed to very discouraging.\n\nTLDR: The only reason you would short is if you still think there is a way out and you don't want to go bankrupt.\n\n\nFellas, I gotta say this is some fucked up shit. The 1M floor is not a meme. Shorting and shorting and shorting  again just make this floor higher and higher. Enjoy a wonderful week-end .\n\n\n\nTo the moon 🚀🚀🚀🚀",
    "title": "There is no way in HELL they covered their shorts. 🚀🚀🚀Explanation from an ex-auditor point of view",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mo2nfu/there_is_no_way_in_hell_they_covered_their_shorts/"
}