{
    "author": "BroganBrainstorm",
    "created_utc": 1623206001.0,
    "distinguished": null,
    "edited": 1623209357.0,
    "id": "nvl5me",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nvl5me",
    "num_comments": 66,
    "permalink": "/r/Superstonk/comments/nvl5me/dfvs_ultimate_endgame_dd_pt_iii_one_pounce_man/",
    "score": 653,
    "selftext": "Cheers, everybody! Originally Part II was a followup to this [DD on DFV's gains taxes here](https://www.reddit.com/r/Superstonk/comments/mycggd/dfvs_ultimate_bullish_endgame_sign_that_you_didnt/). But Part II got split into Part II and III. [So Part II is over here](https://www.reddit.com/r/Superstonk/comments/nvkv4l/dfvs_ultimate_endgame_dd_pt_ii_the_pounce_investor/). None of this is intended to be financial advice or FUD. I am relatively new to making such extensive DD so I would appreciate any constructive criticism. We're all going to the moon, and nothing anyone says seems likely to stop this rocket. Enjoy the ride!\n\n&#x200B;\n\nhttps://preview.redd.it/7psc51idi5471.jpg?width=1080&format=pjpg&auto=webp&s=e5891c73d2d0cb5772c95154b5d3b3e7f3c98401\n\n**Section 3 – Wait, did DFV actually HAVE an exit strategy?**\n\nFrom the Gains Taxes DD, I believe that DFV has gone from a principled value investor to a value investor with a deep fucking belief in the stonk AND the squeeze. He’s placed himself in a position where he might ~~NEED~~ consider to sell within 2021 to make enough squeeze money to ~~pay his taxes~~ to both pay for his taxes and have realized gains. So how’s he going to do it? Well, the next logical question is what was he doing with selling call options before he believed in the squeeze? **Remember, he and we live in different times now and he did not sell ANY of his actual shares.**\n\nIn June, the now dominant popular strategy is selling on the way down after the peak but before we hit the floor. Selling pressure limits the squeeze’s potential and every sale before the peak reduces how high it can go. On a long time frame, this is a new ape strategy, and DFV in a January context was acting the way things used to work.\n\nIn January, he was willing to take profits off the table from his 4-16 call options. Up until the end of his last stream, he was still acting like a value investor. A short squeeze operates outside of the parameters of value investing, meaning the price during a squeeze is far above a current valuation. From that perspective, he played things exactly according to the value investor playbook: once it became obvious to everyone with eyes that some kind of a squeeze was happening, he sold some options contracts but no actual shares. I believe he sold some of his April contracts during the squeeze to take profit, expecting to sell more on the moon with an open mind to re-entering once GME stabilized at a post-squeeze price level.\n\nYes, you heard that right. Everyone wants to laugh and focus on his “what’s an exit strategy?” comment from December 22, 2020, when he didn’t believe any squeeze potential was important or likely. But when the squeeze became real and truly began liftoff, I believe this value investor quickly found one.\n\nSo what is an exit strategy? ~~A miserable pile of secrets, that’s what.~~ We can only guess what’s he’s up to for the second squeeze, but we do know what he did during the first squeeze.\n\nThrough my previous gains taxes DD, we’ve already done the digging and found the numbers we need from his daily posts. We have his position, when he sold and how much. All we need is some math and chart comparisons to find out what he was looking at when he sold.\n\nHe sold 3 times in January, and apparently none since. Before his first sell order, he had 50,000 shares owned, and two call options with 1000 contracts each. Each contract is 100 and by that point they were definitely in the money (ITM). So he basically could have had a total of 250,000 shares, if he ever decided to exercise all his options (some of which he did in April). But at the time he might not have had enough cash to exercise the options. This appears to be the case with his 1-15 option for 1000 contracts which he sold in his entirety on 1-14, since he had to exercise them or sell it. This one he didn’t have much of a choice. What I find interesting is that he sold portions of his April 16 call options on 1-25 and 1-27.\n\n1-14: 1000 contracts sold for $1,471,759.18.\n\n1-25: 200 contracts sold for $2,240,158.99\n\n1-27: 300 contracts sold for $8,999,659.88.\n\nTotal cash EOM Jan (from his update): $13,840,298.\n\nEstimated taxes owed for 2021 (from taxes DD): ~~$5,213,572.~~ $3,590,354 \n\nEstimated cash after taxes: ~~$8,626,726.~~ $10,249,944\n\nRemember, his quadrupling down was not part of the original plan when he sold, but an idea he got after the events of the January squeeze and his double-down. In January, he basically took ~~$8.6~~ $10.2 million in profits (after taxes, which he’ll pay in 2022) off the table and left the majority of his position holding with those glorious diamond hands.\n\nSo, let’s find the price level at which he sold on these dates. We’ll start with 1-25 and 1-27 since those are simpler (I’ll explain 1-14 in a bit).\n\n1-25: $2,240,158.99/ (200 x 100) = $112.01 per share\n\n1-27: $8,999,659.88 / (300 x 100) = $299.99 per share\n\nNow for 1-14, I think my calculations are being thrown off by the options because what we get is:\n\n1-14: $1,471,759.18 / (1000x100) = $14.72 per share?\n\nThat would be impossible, because the price never dropped below $33 that day. Again, this is options throwing things off. I’ll admit it, **I’m too smoothbrained to do hard math on options like that.** If it’s really important, someone smarter than me can get precise numbers. But loose math and human psychology will give us enough to guess. You will see on his updates on 1-13 his cost average for the Jan 15 call option for 1000 was $11.40. This is probably the figure that rose to $14.72. That’s a 29% increase between these two, so roughly speaking a 29% increase in price level should be comparable. 29% and the previous day’s price of $31.40, gives us a price around $40.00-$40.50 per share. Since his other sell points almost end in .00, we’ll use $40.00 for now.\n\nSo we got sell points at $40 on 1-14, $112 on 1-25, and $300 on 1-27. The most likely explanation for numbers this clean are that he used either limit sell orders or stop limit sell orders. Let’s look at the charts on those days.\n\n&#x200B;\n\n[1-14](https://preview.redd.it/ueet1yvli5471.png?width=1235&format=png&auto=webp&s=5df90b3e72701b03caed603f92e45bbd8a8aa20a)\n\n[1-14 zoomed out](https://preview.redd.it/7az5n0wli5471.png?width=1227&format=png&auto=webp&s=20054e08d8e9e7ff54a751c7c94b61fe81720e6b)\n\n[1-14 approx when DFV sold call options](https://preview.redd.it/1yi2i2wli5471.png?width=922&format=png&auto=webp&s=d81e3e8ee6482582e58b5b50d961acd05d07dfb0)\n\n[1-25](https://preview.redd.it/khiyw7wli5471.png?width=1243&format=png&auto=webp&s=580f4ff5750b1c7291dc6faed6c11c731708d046)\n\n[1-25 zoomed out](https://preview.redd.it/rfpkl5wli5471.png?width=1235&format=png&auto=webp&s=189df304f4765b285697f3e41d554750823ea5e2)\n\n[1-25 approx when DFV sold call options](https://preview.redd.it/3yg46zvli5471.png?width=1030&format=png&auto=webp&s=a8d697d50dc1b19aff9c10727afe24ae5c5fedc0)\n\n[1-27](https://preview.redd.it/ylx61yvli5471.png?width=1235&format=png&auto=webp&s=bc736a7293983b3728922f6bcadee43337351b6d)\n\n[1-27 zoomed out](https://preview.redd.it/ifnl51wli5471.png?width=1236&format=png&auto=webp&s=0211d5edc9a3093be7f966eed716168a244d42aa)\n\n[1-27 approx when DFV sold call options](https://preview.redd.it/61o6dewli5471.png?width=805&format=png&auto=webp&s=432e93319d0c75bb6ee28732fcbb6c7e01c254ca)\n\n[The overall January squeeze \\(arrow when DFV made $9 million from call options\\)](https://preview.redd.it/hl01f0qxi5471.png?width=1239&format=png&auto=webp&s=c88630e52c5645b50447df343abc963399b5c03c)\n\nThere are several points where he could’ve sold on 1-14 and 1-27 and only one real area on 1-25. For 1-14, I’m guessing he sold during the drop from the daily high of $43.03. After taxes, that was enough to make him a millionaire. Selling the 1-14 call option was forced, but the April contracts he sold were him selling on the way up during the squeeze. Exactly where GME would go after that was unclear since he had not been deeply researching the squeeze angle. For 1-25, he sold during the drop from the day’s high of $159.18. That ensured he was a multi-millionaire.\n\nBy the time he got to 1-27, the squeeze was fully on and he knew he was sitting on a gold mine that was having crazy new highs. Between 1-26 closing below $150 and opening on 1-27, GME \\*skyrocketed\\* during the afterhours and premarket to $385. This guy was cackling like a madman with sunglasses, a cigar, and dunking tendies into a wine glass at $65. When he woke up and saw the squeeze was ON not only did he feel that glorious sensation that he was very VERY right about GameStop, but wrong about the short squeeze not mattering. He was sitting on Scrooge McDuck money in his account, the short squeeze angle suddenly fucking mattered. Remember, he told Congress and repeatedly told his viewers that he considered the possibility of GME squeezing to be possible, but a low probability. I’m sure the odds of that had been increasing by the day, but when it happened he must’ve been shocked.\n\nHe had plenty of shares left, selling only options. To me, that seems to strongly indicate he was expecting it would go higher, as one would logically expect in a pre-Robinhood-stops-the-squeeze world. The price went up, Robinhood halted trading, it dropped, did what it did and here we are. No matter how you look at it, the psychology remains the same: DFV’s suddenly had to get a squeeze strategy in January, and what he quickly came up with was to sell a little bit of call options on the way up.\n\n**But we don’t live in that world anymore, and neither does he. Unlike DFV in January, we apes have been aware of a short squeeze for months and preparing for it.** A common strategy that individual apes are discussing is selling after the peak. And unlike DFV in January, DFV in June is fully aware of the high probability that the squeeze is inevitable and that selling early limits its potential.\n\n&#x200B;\n\nhttps://preview.redd.it/kmbpv2vfi5471.png?width=1540&format=png&auto=webp&s=836cbafe7048927e340f8692085d02aeca10e797\n\n**Section 4 – The Silent Stonk God**\n\nMonths before the squeeze DFV was lucky to get 1 viewer. Now the entire world knew who he was and what he was doing. The world saw his diamond hands as GME crashed back down to Earth, but still higher than any level before 2021. From this point on, the tweets and YOLO updates are his only communication. His meme tweet style is nothing new, he’s always done that but what’s changed is he’s only doing that. Lots of twitter replies to 2-1 cat on motorcycle are debating the meaning. But in hindsight, it’s clear that he’s still riding GME.\n\nOn 2-18 Congress wanted to talk to him. His tweets have indicated the seriousness of the big players and government that he now has to answer to. And he got his war paint on. He strode in like Rambo. The whole world watched him say all the right things, claim the price point is still attractive to him and his aggressive style. He likes the stock. Then he leaves with a tweet: “What happened? I blacked out.” And on that he doubled-down like a true legend.\n\nGME’s return begins on 2-22. It very slowly started to creep up, then shot up then down and DFV puts out his most cryptic tweet on 2-26, commenting that he’s figured out the tell on the short positions. I think this is the day he knows hedgies are fucked and the true squeeze will be massive. The rest of his tweets from then on are pretty self-explanatory, just commenting on the price action.\n\nOn 3-16 he posts a rare YouTube parody video where he admits that he is a cat. “I’m more shocked that people haven’t figured it out yet.” He cheers everyone on St Patrick’s Day, and posts about earnings season, the season of perpetual hope. He then on April Fools he tweets about letting go of his position. He ends the day with a video where he asks the magic 8-ball if he closed out. The 8-ball replies “concentrate and ask again.” Obviously he didn’t. Rick roll.\n\nOn 4-15 he has a massive explosion of tweets. This is his way of laying everything on the table before he posts his final update on 4-16 and leaves. His twitter poll overwhelming suggests he execute all his options, and he replies “As you wish.” DFV exercised his options AND bought more shares, quadrupling down at $155. I’ll discuss this further below. He said his goodbyes. The apes have witnessed him, watched and learned from him and each other and their own research. At the end of all things, the apes are the friends that he’s made. But he is what he’s always been: a cat. And he ends with a clip bookending his first stream with is parting words to us: “Cheers everybody.”\n\n**DFV has the touch, he’s got the power. His position is worth life-changing money and the world is watching him. Mr. Gill will always be on a quest to learn and expand his circle of competence. And he’s been watching us with an all-seeing eye. He sees the things we see. Reads the same playbook, the same DD. As the apes research, study and learn the details of the MOASS situation from our jungle domain, a cat silently sits among us and learns alongside us. He is still a cat, but he is now a cat that has studied the ape ways. With his original pouncing strategies supplemented by his new ape learning, he has effectively become a stonk demigod. Less than a god, but more than a cat, ape, or man.**\n\nKeith Gill has truly become a highly influential investor, like Burry and Buffett before him. When he does something, the world notices. His pounce-value investing style *works*. You watch his streams and just look at his excel sheets of what positions he was in, go down the list and the majority of his top positions have gone up 200-300% or more since august. It works more often than not. If you bought GME at $50, then watched it go to $150, or movie stock at $10 then see it go to $30, think about that feeling of when you tripled your money. His portfolio was filled with stocks that also tripled, just over 10 months rather than 3 weeks. While I’m not going to go squeeze hunting, value investing when done right can do amazing things.\n\nDFV notices asymmetric opportunity. A small part of the market no one notices. He’s gone to all this effort to learn the art of pounce-value investing, to develop these tremendous skills and tools. I don’t think he wants to take his tendies, go home, and never really care about the stock market again. He wants to keep using these skills he JUST got great at. He’ll want to keep playing, keep seeking out those perfect moments for a value investor. “Deep fucking value” doesn’t refer to GameStop, but his investment style. Extensive, heavy, deep research into stocks he considers for a value investment, then pouncing on them at the most opportune moment. And that’s what makes him so dangerous.\n\nHe only needed one pounce. The legendary pounce that was promised. His first huge bet was on the stock that changed the world. If he finds another company that’s undervalued and being ignored, his interest will cause other people to pile in and pump the stock to the sky. This potential dogpile effect defeats the entire point of his style and strategy, the thrill of seeing how things naturally play out. His fame has ruined his game. Unless he keeps it all inside, not telling anyone what he’s found. And THAT is why he is silent, I believe.\n\n**TL;DR**\n\nDFV was once a value investor who got in for a temporary play. GME was one of 150 companies he was in, though it was the largest in his portfolio. Then he became absolutely absorbed in GME’s potential to reinvent itself. Time and time again he noted the squeeze but disregarded its importance. He disregarded it completely until the very last moment. Then the squeeze became real. Then he became the most influential man in the investing world. And he knew he had to be responsible with his power. He didn’t know enough about short squeezes, so he learned alongside us apes in silence. All the Wall Street corruption stuff, this ape movement, all of that? THAT WAS US. WE DID THAT ON OUR OWN WITHOUT HIM. But he has been here with us, all the way. And by 4-16, I believe he’d learned more than enough. I believe the state of his account points to his quadruple down being not a value play, but a squeeze play. Throughout his whole thesis from months ago until the squeeze, he has been living in the perfect asymmetric moment. He found the one perfect moment, the perfect pounce that will change the entire world. He is the One Pounce Man. And we’re going to the fucking moon. **DIAMOND FUCKING HANDS.**\n\n&#x200B;\n\nhttps://preview.redd.it/rx8v9irhi5471.png?width=743&format=png&auto=webp&s=f52f58f78899504e458186356383544c1088ea4e\n\nEpilogue:\n\nBUT THEN ON 6-1 HE RETURNED. WHAT? WHY? WHAT’S CHANGED? WHAT’S DIFFERENT? Pricewise, what changed is GME broke and held $200 for a few days and kept rising. We can only theorize if his lawyer gave him the thumbs up go ahead or something. But he’s back and his tweets have a more serious tone. He’s coming back with a vengeance like John Wick and he’s got a Watchmen mood because the end is nigh.\n\nThe missing part of the puzzle that I haven’t found yet is what happened to his 150 other positions, which ones were and weren’t closed out of and when. I’m not seeing a point where he outright says he’s ONLY in GME. It’s the only thing he talks about, it’s the only position of his that matters, but I still think he has other positions somehow. YOLO only means significantly huge portion of portfolio, it doesn’t mean investing in solely one stock. He also has his private portfolio, so what his deal is with that is unknown. FOR ALL WE KNOW, HE MIGHT EVEN FUCKING HAVE MORE GME SHARES IN THE PRIVATE PORTFOLIO THAT WE NEVER EVEN THOUGHT OF. However, his other non-GME positions are not essential to understanding what’s going on in his head.\n\nI figured these streams would continue with him checking other stocks and only focusing on GME at the beginning but he became absolutely enraptured by everything about this stock. I’ve realized this entire DD is just ankle deep in the ocean of analysis this man provided. Hours and hours of his thoughts. I can’t imagine what other nuggets of info are in these 3-4 hour streams. I’ve really just picked spots largely at random and I’ve already found this much. Just him looking at a firm that’s invested in GME and comparing that data to what it looks like today could reveal a mine of info in and of itself. The things he’s looking at are utterly different than any stonk stream I’ve seen since. Trying to analyze it all is making my smoothbrain melt. Feel free to keep going if you want. I am admittedly new to Reddit and making DD’s so if you have constructive criticism I welcome it.\n\nAll right, I’m finally done. I’ve been researching this so much lately I haven’t really been paying attention to what’s going on currently. How’d we do? $300! And a high of $344.66!! We’re consolidating?!?! FUCK YEAH!! LLLLLLLEEEEEEETTTTTT’SSSSSSS GOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!\n\nEDIT: A critical error in math in part I has been corrected, and thus all applicable points in Part II and III have been updated with incorrect info ~~struck out~~. Thank you so much for the peer review, so that we may get things as straight as possible! I love this community. \n\n[ This hand of mine glows with an awesome power! Its burning grip tells me to defeat you! Take this! My buys, my calls, and all of my shares! DIAMOND FINGER!!! Look! The hedgies are burning red! ](https://preview.redd.it/24au0nbyj5471.jpg?width=500&format=pjpg&auto=webp&s=f20ad9c5d085ba70f9bb18f2e234967b32139ae4)",
    "title": "DFV’s Ultimate Endgame DD Pt III: One Pounce Man (Too Strong!)",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nvl5me/dfvs_ultimate_endgame_dd_pt_iii_one_pounce_man/"
}