{
    "author": "BroganBrainstorm",
    "created_utc": 1623205035.0,
    "distinguished": null,
    "edited": 1626315442.0,
    "id": "nvkv4l",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nvkv4l",
    "num_comments": 54,
    "permalink": "/r/Superstonk/comments/nvkv4l/dfvs_ultimate_endgame_dd_pt_ii_the_pounce_investor/",
    "score": 771,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/ljm2lp6lf5471.png?width=928&format=png&auto=webp&s=b0de9d91992774939e15a4c28ddd403497081ba2\n\n**Intro**\n\nCheers, everybody! New apes old apes alike, DFV is back and it is a very happy day for him! I was making a long-ass 17-page DD on him anyway! Purrrfect. Tell me, how well do you really know DeepFuckingValue? The man bet huge on GME long before longs, and his big early bet has given him glorious tendies, a congressional hearing, a thoroughly amused Twitter following, and immortalized him as a legend for his successful and smart, investment.\n\nWe believe in him, the former broker and analyst Keith Gill. The Roaring Kitty doesn’t definite our investments, when and what to buy and/or sell. We all choose a path, and we’ve chosen of our own will to walk the same road. No one knows for sure what will happen, but we like this man and he likes where this road is going. The man has chosen to be silent, speaking only in memes since he became a legend, and there are a lot of interpretations of his intentions. I’ll tell you right now, **a lot of them are wrong.** And I wanted to get as close as I could to the truth.\n\n**If the silent but memely legacy of this brilliant man and his beyond-diamond hands is to continue to be a part of us, if we continue to admire and hail him as the legend he truly is, we need to be reminded of what kind of investor he really is and how he operates. We need to reconcile and recontextualize the man, the myth, the legend. Because you are likely wrong about him. Because as always with DFV, the truth is more bullish than you can imagine.**\n\n**Prerequisite/Related DD:**\n\nThis is a follow-up DD to my previous one, [DFV's Ultimate Bullish Endgame Sign That You Didn't Notice: Gains Taxes DD](https://www.reddit.com/r/Superstonk/comments/mycggd/dfvs_ultimate_bullish_endgame_sign_that_you_didnt/). I originally began part II focusing on his January selling strategies since they involve the same numbers, but the more I dug into DFV’s videos, the more I found. I found so much that I felt I had to spin off some of it into a separate DD about how DFV, RC, and apes are able to apply Buffett’s 7 principles of investing.\n\n**DFV Ultimate Bullish Endgame Part I TL;DR** \\- DFV could’ve taken his millions and lived a comfortable life, but he became convinced a squeeze was inevitable and soon, quadrupling down like a mad daredevil. He believes in not just the stock, but the squeeze more than anyone else out there. It’s extremely likely he will sell something during the squeeze to at least avoid ~~being down $2 million in gains taxes~~ having no realized gains when he originally intended to have around $8 million. DFV is not putting everything in the infinity pool and just diamond handing it all through the squeeze. He might have purposefully entered a situation where he financially ~~MUST~~ might consider a point to sell some GME before 2022 ~~to pay his taxes~~  to have some realized gains after his taxes are paid, so he might as well do it during the squeeze. I also remind you he has a wife, a kid, a last we heard, no job and he’s only taken $23k out of his gains as of 4-16. But in making part II, I’ve realized that I am still unclear as to what happened to the other positions in his public Roaring Kitty portfolio, and we’ve never known what his private portfolio is. I previously based my theories around him having liquidated all other positions, but I haven’t found anything yet that supports that.\n\nYou could also say there’s a part 0, sort of. u/respecthepump did a great [DD on DFV’s YOLO updates](https://www.reddit.com/r/Superstonk/comments/mz878a/a_deep_dive_into_dfvs_yolo_update_posts_dd_part_1/)from 2019 until end of January 2021. I hadn’t read it before I did PT I, but I suggest reading his DD then PT I then this if you want a deeper dive into those. They both focus on what was going through his head during his daily updates. u/respecthepump covered the updates until end of January and I focused on his updates and life circumstances from beginning of Jan. until his quadruple down.\n\nThis DD went too long, so I had to split it into Part II and Part III. There’s too much ground to cover in one post. Section 1 is examining his YouTube videos for his investing style, strategy, and why he entered and believed strongly in GME. Section 2 what he felt after Ryan Cohen entered the picture, and what he was thinking prior to the Jan baby gamma squeeze. In Part III, section 3 will cover how that informs his selling points in January. Finally, Section 4 covers how everything informs DFV’s endgame psychology and his silence. Also, I'm relatively new to making my own DD so feel free to leave any constructive criticism. None of this intended to be advice or FUD, so don't jump to any conclusions until you've read Part III as well. I swear, I'm going somewhere with this.\n\nhttps://preview.redd.it/rmtiiqynf5471.jpg?width=1192&format=pjpg&auto=webp&s=df49eff778c9cc78b4314276b3e5d99a104e5883\n\n**Section 1 – Roaring Kitty Pounces on GME**\n\nYou must understand that we have been discussing two DFV’s: A very talkative pre-squeeze YouTuber named Roaring Kitty and a post-squeeze silent stonk demigod named DeepFuckingValue. This level of money and success is guaranteed to have some kind of change in a person. We must reconcile the two sides to the same coin. None of this DD is advice, nothing he’s said or posted is advice, and we especially should not base our investments on this DD or what kind of man other people perceive Keith Gill to be.\n\nHave you actually seen more than the shortest of his YouTube videos? Have you watched his 4-hour streams and other long videos beyond the first few minutes? I doubt a lot of you have. Because at first, I didn’t either. Ain’t nobody got time for that. All we notice is “smart man make big money on GME with diamond hands.” Only the elder apes from the original Wallstreetbets crowd remember what he was truly like. They should be writing this, not me. But they haven’t, so I went back and watched most of them. I particularly focused on anything that would give me insight why he gets into a stock, why he got into GME, and what his overall strategy is.\n\nSo get ready to return to a completely different world than we know: value investing before Gamestop’s mini-squeeze. As you read this, the things DFV said, you have to remember these are the thoughts of a man who’s used to being invested in over 100 companies at a time, most of them with very small positions. You also have to remember that we don’t live in the same kind of world anymore, and neither does he. His videos talked about everything in a pre-squeeze context. Grain of salt.\n\nThe Investment style videos parts 1 and 2 (dated 7-13-2020) say a lot about what makes him tick. He says what makes him rare for a value investor is that he also uses technical analysis (TA). His typical holding period is 3-24 months for a bull thesis to pay off. He never planned on holding forever; he eventually takes profits off the table. He has a YouTube RK portfolio separate from his private, personal portfolio. In 2020 he drastically expanded the RK portfolio to include 100-150 stocks to diversify during the pandemic.\n\nHe does invest within his circle of competence, but he also wants to learn and expand that circle. Just because he’s taken a position doesn’t mean he’s done full analysis like he did with GME. Sometimes it just looks good to him based on the TA. If you look at his mind-boggling spreadsheets, he has minor positions in over 140 companies with GME being the most. He does analysis on the fly with these sheets. And by his own admission, sometimes he doesn’t even remember what the company does or why he was in it. Sometimes it’s just to diversify and go into a sector he’s not in that much. On 8-24-20, he didn’t even remember to check GME until 23 minutes into the stream because he was checking industries and sectors.\n\nAnd DFV SHORTS stocks sometimes. Bet you didn’t know that. It’s one part of his investing style. Aside from the potential for infinite loss, there’s nothing inherently wrong with shorting unless it becomes abusive, naked, and dangerous like GME’s situation has. You must admit, we’ve gotten extremely used to only seeing the worst of short selling that we easily forget other situations it can be used for.\n\n*“I occasionally short stocks. It’s becoming a bigger part of my process. I’m trying to incorporate it more and more. But I still focus mostly on the long side. You’ll see me short, sometimes just because I’m bored.”* (7-13-20)\n\nRemember, he was in 150 different positions at one time. Tons of companies in different situations than GME. And this doesn’t mean he was hoping another company would go bankrupt or that he was excessively shorting in a predatory way. Guys, he’s DeepFuckingValue, a responsible adult unlike GME’s unworthy, manipulative opponents.\n\nDFV screens and tracks possibilities then pounces like a cat when he sees opportunity. His crazy spreadsheets analyze decades of data and trends to find the perfect moment to pounce on a stock for a mid-to-long-term return, then once it rips he considers pulling out. The pounce moment is a point where the downside risk is minor and current sentiment is different than a current reality that looks like things will turn around. He pounces on asymmetric opportunity.\n\nThere are 5 things he looks at before he buys (and keep in mind this was BEFORE Ryan Cohen entered the picture):\n\n1. Discount. - In relation to either fundamentals or chart. Charts are assessment of sentiment.\n2. Leverage. – He doesn’t want to deal with bankruptcy. He assesses credit risk and who owns the debt.\n3. Insider buying. Heavily weighted. Any insider buying is better than none. Are insiders buying the dip?\n4. Ownership. He likes it when activist owners buy stock.\n5. Confidence. All these items feed into confidence.\n\nI can’t emphasize enough how important insider buying is to DFV. He is always looking for who’s buying the stock, how smart they are, their track record, and whether they’re buying the dip. Through InsiderTracking, OpenInsider, Fintel, and other resources he always wants to be aware of what smart money is doing and avoiding what dumb money is doing. He noticed smart money, Scion (Burry), had made a big bet on GME. Not just because he followed GME but because he followed smart money. “GME epitomizes value investing.” (Stream, 7-27-20).\n\nDFV’s favorite news site is S.A., but he’s aware that not everyone on there is giving good info. He says their GME bull analysts are more in line with reality than bears. “See what they have to say, even if you don’t agree with them.” (*5 reasons GME is a roach*, 8-4-2020). His broker of choice is E\\*TRADE, who went on to [restrict buying of GME in January](https://www.theverge.com/2021/1/28/22254863/etrade-gamestop-amc-stock-reddit-wallstreetbets-robinhood) similar to other brokers. He checks Yahoo Finance and StockCharts for the daily price action, not his actual account. I theorize this is so the numbers he sees in his actual E\\*Trade account don’t influence him (I use Webull as a tool in the same way).\n\nGME became his largest position at 15.70% of his portfolio (8-24-20), twice as large as the next. YOLO is defined as all or a significant portion of an investing portfolio, so he hadn’t liquidated everything else at that time. His GME bet is based on 3 things.\n\n1. Highly unlikely its equity is worth less than $250 million\n2. GME legacy business is worth $500-mil -$1.5bil\n3. Non-zero chance GME reinvents itself\n\nGME had positive fundamentals, a massively bullish chart, 100+% of float shorted, and was just waiting for a breakout. “Upwards movement could be explosive.” (*Big Short Squeeze*, 8-20-20). He believed the primary catalyst would be the new console cycle providing enough cash for GME to reinvent itself and generate good headlines (a situation which is even better in 2021 with continued new console shortages)(Stream, 8-3-20). The phrase DFV kept using is “All that’s needed is a shift in sentiment.” (*5 reasons GME is a roach*, 8-4-2020).\n\nHis streams on 7-27-20 and 8-3-20 provide the most initial discussion of his thoughts on the shorts. I especially recommend watching 8-3-20 (1 viewer at the time) as that was supposed to be a stream covering very many stocks. Then he realizes that he’s been accidentally talking about GameStop for 2 fucking hours because the research he was doing on the fly was that fascinating to him.\n\nAs he stated repeatedly, the excessive shorting was never one of DFV’s primary reasons to get into GME, but it was always on his radar more so as a measuring stick for bearish sentiment and asymmetric opportunity. DFV did not believe GME would have as strong a short squeeze as January ended up being, as he said to Congress and as he said in his streams (which is kinda right, since Jan was largely a gamma squeeze).\n\nMultiple times he used to say the short squeeze possibility doesn’t matter and is not a major part of his thesis, but that he was trying to learn and educate himself. If he thought it had a chance of happening, it appears he was thinking it would be what other people like Roensch Capital might describe as a short squeeze effect, not a full on Volkswagen explosion. Just the stock getting a little bit of help upward from shorts covering. He thinks it’s less likely to be huge because there’s no sane perception of reality that GME is going bankrupt. Remember, to him asymmetric opportunity is where market’s overall perception is wrong and he’s acting upon the reality that most of the market isn’t seeing yet. Since he shorts stocks himself, he feels significant shorting is for companies that are overleveraged and about to go bankrupt. He’s baffled and keeps repeating “GME is not that leveraged” because he can’t imagine the broad overall market has sentiment that it’ll go bankrupt, *because that’s an objectively stupid prediction.*\n\n“If you say GME is going bankrupt, you need to show your work. I don’t see it at all.” “I’m confused as to why it’s trading the way it is. It’s one of the biggest missed perceptions.” “I’m not betting on a short squeeze. But it seems like something where it could take place. If you want a real short squeeze … you want a company…on the verge of bankruptcy then suddenly it’s not.” “I don’t understand how anyone can be short GameStop at $4. That is really really risky! And yet you see a huge short position. I’m like ‘Oh my Lor-’ I see this and I think ‘WHAT ARE YOU THINKING shorting GameStop at this price point?!’” (Stream, 7-27-20)\n\nhttps://preview.redd.it/ps6glctpf5471.jpg?width=1142&format=pjpg&auto=webp&s=9c85c95446434d9608fbcdbf723fbd99b8bd4251\n\n**Section 2 – Ryan Cohen Begins A Change in Sentiment**\n\nWhen Ryan Cohen entered the picture DFV wondered if one investor can spark a change in sentiment on GME. DFV had 3 viewers. He had no idea. No idea that the change he was looking for wouldn’t just be Ryan Cohen. It would also be him and his diamond hands. I’m not ashamed to say I fucking cried tears of joy when I heard him say this.\n\nDFV continued to get sucked into GameStop despite his best efforts to make the stream about multiple stocks and not just one. “This isn’t a GameStop stream this is an investing stream” (Stream, 8-21-20). A lot of the early streams are just him talking to himself or about 3 people as he goes through his daily process of checking seemingly *everything in existence*.  This man was just looking for good value investment opportunities. The more he got to know GME, the more he liked it. You can see over the course of his videos how his confidence got strengthened. He wasn’t a believer in GME’s 5-10+ year long-term potential. He was just in for a temporary play, 2 years tops. **But something changed. You can see the entire gradual process of how this value investor fell in love with a stock. GameStop swept him off his feet.**\n\nThe 8-28-20 stream is an absolute must-watch, as it’s the day Ryan Cohen entered the picture on GME. DFV noticed an investor got a huge 9% stake in GME, shrinking the float further. RC eventually had 9,001,000 shares as of 12-17-20. He had never heard of RC. Watch it to see Roaring Kitty in real time discover what kind of investor RC is. Before your very eyes, you are watching him get jacked to the tits with how awesome RC is for the company.\n\nDFV eventually begins to theorize Cohen has a bit of value investing in him. Cohen is saying everything in a CNBC interview video DFV said a not few minutes before about creating a customer experience. Exactly what he wanted to hear. He has a big smile and is laughing at how perfect this is. “I couldn’t be any more bullish.”\n\nA few other people on Twitter were also calling for a short squeeze. “Forget the short squeeze.” DFV thinks if this becomes the go-to destination for gaming we’re looking at a 10-bagger. DFV went for 1hr 30 minutes on GME on a stream that’s supposed to be for many things, but it was worth it. He was trying to guard his expectations as there’s so much potential but so little information about the reality of what’s going on.\n\nDFV referred to GME a few times in 2020 as a potential “Big Short Squeeze.” At the time I believe it’s more so a reference to the Big Short movie and Burry’s involvement than a true conviction that GME’s squeeze will be earth-shattering. In other words, kinda clickbait. Which is fine. After posting his investment style videos and the early stages of his YouTube video, he posts his end of July 2020 YOLO update, where he intensely increases his bet on GME by over 20 times what he had before. By the end of August 2020 update, he’s all aboard the Cohen train and his posts are starting to get more likes. His bet starts paying off with his total account rising by $500k. The YOLO posts become more frequent.\n\nAs GameStop’s run continues to truck on, the prominence of the short positions continues to rise, and while he gradually starts to think a short squeeze is becoming more likely, he still considers it a low probability and an even lower priority. “If it were going to happen this is it.” He says the short squeeze requires volume and FOMO. He keeps saying the short squeeze is not his base case (9-21-20). I think his YouTube thumbnails keep talking about the squeeze just for clickbait reasons, but he frequently discussed it alongside the value investing angle. DFV doesn’t know who is shorting GME, just that there’s a lot of short positions that haven’t covered (12-23-20).\n\n“Infinity squeeze can’t be a base case for sure. Those are so rare.” “I don’t know about an infinity squeeze. An infinity squeeze has to be unlikely by nature of what it is.” He then emphasized “I just don’t know enough about that stuff to have opinions.” In the end, he’s confident in the fundamental case even if the squeeze potential doesn’t pan out. Remember, at the time he had NO IDEA just what was going to happen with the squeeze situation. (Stream, 12-23-20, around the 2:35:00 mark)\n\nAfter RC joined GME, DFV’s confidence is constantly high in GME and only increasing. His streams are getting more viewers and his YOLO posts are becoming more frequent. His entire stream is becoming absolutely dominated by GME discussions and less so on his other portfolio positions. He does still look up what his viewers suggest. As of 9-28-20, GME is 29% of his RK portfolio. By Christmas his GME position is worth $3.6 million and he celebrates it with his family over the holidays.\n\nHe also states a few times that he’s a night owl. All these streams seem to begin after market close (possibly even after the after hours close?). I love the idea of his wife and daughter were just chilling, having a normal life while he was looking at these ultra complex spreadsheets and making streams that he didn’t know would change the world. You gotta watch the beginning of his 8-24-20 stream. He had big smile as he showed a picture of a cat his daughter and wife drew together, proudly showing it to the camera and then he moves onto his spreadsheet with every sector of the market and detailed 20-year histories of 140 companies he’s investing in. “My wife knows the thesis like the back of her hand as well” (12-23-2020).\n\nHe returns from his vacation on 1-11-2021, when GME is still trading sideways around the $20 mark. DFV is still hyped from the good news: “GameStop announces additional board refreshment to accelerate transformation.” He’s drinking and hiccupping and laughing his butt off reading the chat. Chat is getting a ton busier, lots of new people coming in and typing cheers and every time he sees someone new he exclaims CHEERS and he’s saying it all the time. He is having a BLAST, party mode.\n\n“Ryan Cohen’s a gangster. He’s an OG. He seems to understand how ridiculous this setup is. He has the vision. He has the imagination.” He remarks that RC now has enough control to fulfill his vision for GME. “Ryan Cohen has single-handedly interfered with the short thesis.” He stated that the shorts didn’t take RC as seriously as he should’ve been. He again emphasizes how much the short thesis doesn’t remotely make sense in the face of such obvious bullishness.\n\n“If I were on the other side of this that’s bad news. That’s almost a worst case scenario.” He said he doesn’t understand the structure of hedge funds and the intricacies of the market. But it clearly doesn’t look good for the other side. “Badass chart. Very bullish.”\n\nDFV is noticing a lot of news media is clueless, making no mention of Ryan Cohen and the bull case for GME. He says it will take time for the bear thesis to completely break based on what the actuality of GME’s transformation actually becomes. And he truly believes RC is the best man to make it happen. Sentiment is beginning to shift, the opportunity is there. DFV is waiting on the rest of smart money to catch on. By 1-19-2021, he was singing Tendieman as other people’s tweets were declaring GME’s bear thesis as dead and that “Sentiment has officially turned.”\n\n“The short squeeze stuff is a sideshow. If that happens it’s great. But it’s difficult and risky to bet on this stuff. This takes time for it to unfold. It could be a gradual unwind of short interest. But what if it isn’t? \\*laughs\\* Your guess is as good as mine because I’m out of my element.” DFV jokes about GME going to $420.69 then insists he’s joking. Again, he is drunk and laughing. “But it’s not impossible.” “If you’re betting on the short squeeze, BE CAREFUL. That is a dangerous risky play.” “I don’t even know if it’s possible.” “BUT…aren’t you like….what the hell’s going on here?” (Stream, 1-11-2021)\n\nHis final stream on Friday, 1-22-2021 is the stream of legends, especially the first few minutes. Just the magical moment for an investor who got a LOT richer a LOT quicker than he expected. Remember when $65 for GME was ridiculously high? You bet DFV remembers. The epic 7-hour stream began around 6:00 EST and he stopped around 1am EST. He tweeted, planning on “stepping away from streaming for a bit” but I think he knew this could be the last one. He wanted it to last as long as possible. These were his original fans he was talking to in chat. I think he knew to some extent his life was about to change forever and he didn’t want the party to stop.\n\nGME’s previous all time high was $63. That day GME opened at $42.59, blew past it to $76.76 and closed at $65.01. Also note that DFV never set a concrete price level on where GME should be valued at. He just went “Well I think it’s worth a LOT more than $5 or $10”. He did once refer to GME’s potential turn-around to be a 10-bagger. The reality of that is that the reinvention play hasn’t fully resolved and hasn’t materialized into exactly what that will look like, therefore he couldn’t really make a good price target.\n\nHe still believed GME’s price action is a result of people revaluing the company based on the transformation. He is attempting to educate people who are considering getting in how to be emotionally neutral and being okay with it no matter where it could go. He is cautioning people on betting on short term price action. He also adds you can be bullish and sell/trim a little or you can also be bullish in the Buffett way and just go for years and years without selling or trimming. No matter how happy he is, he was making clear that anyone new who wanted to get in should only do so with cautious optimism.\n\n“Indeed. There will never be another situation like this. You are spot on. This GameStop situation, we will never encounter a setup like this again. Not even probably. There won’t be another one like this in the future.” We did end up encountering another GME setup, just a different kind of setup. This time, with apes. (1-22, 1:26:00 mark)\n\nHe keeps going until some of his fans in the chat are starting to pass out, says he can keep going but that other people need to get sleep and go to work. He gave everyone a final cheers and closed the stream out.\n\n&#x200B;\n\nhttps://preview.redd.it/upwsltysf5471.png?width=900&format=png&auto=webp&s=45f9ee2a8eab84f53f0206ff7236f1644e05f574\n\n**2B – Magic 8-Ball Predictions**\n\nBonus section! He used a magic 8-ball frequently to see if certain things would come true. I found a few of them with some interesting results.\n\n12-23-20: To close out his final stream of 2020 before Christmas, DFV asks the Magic 8 ball if GME will break $30 before the year is over. He shows the camera the ball’s blurry reply “Concentrate and Ask Again” to which the live stream purposefully misreads as “Conservative and Ask Again” and he cracks up laughing. He tries it again. “Outlook good.” That day’s high was 22.35. GME didn’t get higher than that until 2021.\n\n1-11-21 (3:52:00 mark): “Will we break $22.35? Make it to a new 52-week high by the end of this week?” “As I see it, yes.” This becomes true two days later on his next stream. The week’s high became $43.06.\n\n1-13-21 (4:39:00 mark): Another 8-ball question. “Will GME break $50 per share by end of this week?” “As I see it yes.” GME did not break $50 until 9 days later on Friday the 22nd, when it went from an open at $42.69 to a high of $76.76.\n\n1-22-21 (3:49:00 mark): His final consultation with the 8-ball, and by far the most epic. “Will GameStop break $100 per share by the time they release q4 2020 earnings?” The first reply was “Cannot predict now.” He asked again. This time the reply was “As I see it yes.” Q4 earnings wouldn’t be released for another two months. GME broke $100 only 3 days later on 1-25-21, gamma squeezed, fell down, and then on 2-25 it broke $100 again. It hit $348.50 on 3-10, and fell back down. When GME’s Q4 earnings were released on 3-23 the high of the day was $201.75.\n\nEDIT: A critical error in math in part I has been corrected, and thus all applicable points in Part II and III have been updated with incorrect info ~~struck out~~. Thank you so much for the peer review, so that we may get things as straight as possible! I love this community.\n\n**WELL WELL WELL. IT LOOKS LIKE I'M OUT OF SPACE. FUCK IT.** [PART 3 FOUND HERE](https://www.reddit.com/r/Superstonk/comments/nvl5me/dfvs_ultimate_endgame_dd_pt_iii_one_pounce_man/)",
    "title": "DFV’s Ultimate Endgame DD Pt II: The Pounce Investor",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nvkv4l/dfvs_ultimate_endgame_dd_pt_ii_the_pounce_investor/"
}