{
    "author": "possibly6",
    "created_utc": 1623193421.0,
    "distinguished": null,
    "edited": 1623276237.0,
    "id": "nvh6xr",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nvh6xr",
    "num_comments": 116,
    "permalink": "/r/Superstonk/comments/nvh6xr/i_predicted_todays_peak_by_45_my_thoughts_for_the/",
    "score": 820,
    "selftext": "Sup apes, long time know sea\n\nnot financial advice yada yada\n\n&#x200B;\n\nEveryone has been beyond jacked recently and the community has never been better. I used to post my technical analysis of GME on a daily basis, but have remained out of the spotlight for a bit, simply because price is irrelevant.\n\nI live by a simple rule... if GME isn't 8+ figures, I buy. 8 figures > 3\n\nThat being said, I was able to time the peak of todays move using a predicting that i drew all the way back in April (dont believe me? check this out:)\n\n[Target drawn 4\\/13](https://preview.redd.it/fl7gsxixb4471.png?width=2792&format=png&auto=webp&s=2bbbaec0f5144d52ea6248e62d4c6827ea51dc9a)\n\nBefore you comment \"TA can't predict this and that!\" it predicted not only the rejection point of today's move, but also the first downside target. There is one more target that I expect to be met in the upcoming days, if not tomorrow, and I'm writing this to spread awareness of my best dip buy prices!\n\nIf you're new to the sub or EW theory, in a nutshell it looks like this:\n\n&#x200B;\n\n[EW inna nutshell](https://preview.redd.it/ob6wmx7ec4471.png?width=1280&format=png&auto=webp&s=2ea98d038fbaa53d88e833b736fc0b6c51625a2b)\n\nOkay, so we have a general idea of EW. Now you're asking, where are we in the cycle?\n\nToday, we \\*\\*APPEAR\\*\\* to have completed our cycle wave 3 (cycle = white lines in my chart). Cycle moves inside of super cycle, and super cycle moves inside of grand super cycle. confusing, i know, but bear with me.\n\nIf you would like to learn more about EW theory, check out some of my previous posts where I do a pretty good job explaining the wave ratios and character traits. The diagram gives a good idea though.\n\nElliot waves is human nature in essence, which is why it is my favorite, and to be honest, only form of TA I ever really trust. Sure, I'll use some indicators or chart patterns here and there, but it's always supplementary to EW, meaning I already have targets in mind before looking at, say a \"bull flag.\"\n\nCheck out GME over the past few days:\n\n[15m view](https://preview.redd.it/4vahq1j6d4471.png?width=2808&format=png&auto=webp&s=6e4410271403665eace0a1a3fccf1fc51469a986)\n\nafter a 5 wave impulse, we can expect an ABC correction, which targets ideally 50% of the 12345 impulse. BUT, we just completed our cycle wave 3, meaning our cycle 4 is expected to finish to the downside. Sure enough, as my 344.21 target was hit (to be fair, originally it was 303, but seeing the relative buying strength of GME, I adjusted as the first target broke. low and behold, the 2:1 extension target came out to 344.21, 45  cents off of todays high, from a target that was drawn in April.)\n\n&#x200B;\n\nwave 4 targets a 23.6 - 38.2 correction of the entirety of the 123 move. confusing, but accurate. below you can visualize our waves inside the cycle wave, marked by white (primary), the blue annotations are minor waves, or the waves within the primary waves.\n\n&#x200B;\n\nDon't sleep on EW!!!\n\n[4hr](https://preview.redd.it/2nqbcr8rd4471.png?width=2830&format=png&auto=webp&s=c3442147903c2bd8c1eb82376a0d58a81b505c86)\n\nnotice how at the top, the III, ((5))  and (5) all line up (EW has weird annotations, this is how i differentiate the cycle. color also helps). This is the beauty of EW.\n\n&#x200B;\n\nThat being said, we only completed our \"A\" and \"B\" phase of the correction today. Given that we can expect a 50% correction of the 5 wave primary move, AND a 23.6%- 38.2% of cycle wave 3, that gives us an \"A\" target of 294, which sure enough was sort of close, tho likely an attempt to from SHF to push price below technical trader's SL. jokes on them, i bought more there. I can't help but panic and buy when I see red.\n\nMy \"B\" correction target came out to between 303 and 306 ish, visualized below. Sure enough, we couldn't break above that 306 level...\n\n[5m](https://preview.redd.it/n28szmq2f4471.png?width=2778&format=png&auto=webp&s=e4a64497c34c3bbcbed3d3656d884892843041bd)\n\nSo... 2 possibilities going into tomorrow. I know you're gonna hate me for this, but using EW theory, I expect us to hit a low of 264, possibly 257, if it gets really ugly with a short attack, we can see 238, or a hail mary down to around 220.\n\nDo note, there is a gap up around 220. If you read my DD months ago when I timed the 350 to sub 200 drop, I looked at historical price action and drafted that hypothesis. This time it's different, but still always good to be aware of what you're buying, and how it trades.\n\n&#x200B;\n\n[GAP](https://preview.redd.it/vprltbcnf4471.png?width=2832&format=png&auto=webp&s=378522b0efb631791c30a871a75457bc92f93318)\n\nOther possibility is we have already completed our cycle 4, which can be argued by today's retracement past the 23.6 area of our cycle 3:\n\n&#x200B;\n\n&#x200B;\n\n[possible completion of cycle 4](https://preview.redd.it/xf3src1ag4471.png?width=2398&format=png&auto=webp&s=ab5ce902ed642eafd8ab6ae7305c22334a9d928d)\n\nat the end of the day, I always have a pretty good idea of whats gonna happen in terms of price action, but I was BORED! I mean shit, I held from 16 to 12 to 513 back to 40... a 50 point move is cake for this ape.\n\nThat being said, Im jacked to the max. For what its worth, the flash crash was also  predictable by watching options order flow. I saw this in my scanner today:\n\n[look at the OTM PUTS](https://preview.redd.it/2x1pjdjlg4471.png?width=1986&format=png&auto=webp&s=be3c4440f44a6fb0a1a39af647215e99f48222b0)\n\nThis tells me an institution (cause cmon now, what idiot rEtAiLeR is buying 239k in July 60p lol) bought these puts, exercised and sold at a loss in order to bring down the price. Also explains the super low volume on the drop.\n\nStay vigilant my friends, and if we see a dip tomorrow, BUY THAT SHIT!!!!\n\n:)\n\nThanks for reading <3 RC if you're reading this, you give me faith in humanity. Thank you for all you've done and are doing for your shareholders.\n\n&#x200B;\n\nIf you Daytrade GME, ur moms a hoe and u dont deserve los tendies... dont even think about it \n\nBuy hodl vote as always, would love more green tomorrow\n\nEdit: hate me or love me, I was right lol\n\nLow after hours of 264",
    "title": "I Predicted Today's Peak by $.45, My Thoughts for The Rest of the Week Using Elliot Wave Theory 🚀",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/Superstonk/comments/nvh6xr/i_predicted_todays_peak_by_45_my_thoughts_for_the/"
}