{
    "author": "myplayprofile",
    "created_utc": 1623192295.0,
    "distinguished": null,
    "edited": 1623201941.0,
    "id": "nvgslf",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nvgslf",
    "num_comments": 79,
    "permalink": "/r/Superstonk/comments/nvgslf/supplying_the_demand_and_quanting_even_more_6821/",
    "score": 865,
    "selftext": "It's time to get back to basics, ECON 101. All prices are subject to supply and demand, and at the most basic level, this is taught in economics as a supply and demand curve where the optimal price for something is where the most buyers (demand) and most sellers (supply) are available. These same concepts apply to GME, and using the historical data of price and volume, I've made a model showing this supply and demand and there's some pretty intriguing information that's hidden in the data.\n\n&#x200B;\n\nBefore getting to the tea, lets review what a standard supply-demand curve looks like from ECON 101 -\n\n&#x200B;\n\n[\\\\\"Equilibrium\\\\\" price P at quantity Q supplied](https://preview.redd.it/93urqzxt44471.png?width=690&format=png&auto=webp&s=5406abad42d1a2a89eb0503cf8644ffad3f74e98)\n\nWhat does this mean? In the simplest terms, the quantity of a product supplied by sellers increases up and to the right as prices rise. The quantity of a good buyers are willing to buy (demand) increases as prices decline, shown by the line moving down and to the right. The equilibrium price is the natural price the good will ultimately end up selling at based on the intersection of the supply and demand lines where seller are willing to supply q to meet the demand buyers have at q.\n\n&#x200B;\n\nThis concept can be applied real time to stocks, but the supply and demand curve never will look as clean as shown above because things get complicated in the real world. However, with the historical pricing data that shows price and volume of trades at a given price, you can start making your own supply and demand curves at home! Seems useful, and spoiler alert, it is.\n\n&#x200B;\n\nFor the purpose of the post to present the data as clean and concise as possible, here are some adjustments I've made to my models -\n\n1. The models start using price data from 1/22/21 until today, and utilize closing prices and volume from yahoo finance - [LINK](https://finance.yahoo.com/quote/GME/history?p=GME). 1/22 was the highest volume trading day in GME's history, and is used as a reference.\n2. The volume information has been \"normalized\" by dividing the daily trade volume by the highest volume day seen on 1/22. This returns a value of 1 for volume on 1/22, and a percentage of 1 for all other days. This will make sense once you start viewing the charts.\n3. I have assumed \"demand\" volume is simply based on the volume of the trading days.\n4. I have assumed \"supply\" is 1 - normalized trade volume. The most supply ever made available to the market was on 1/22 as each trade in theory needs a buyer and seller. Think of this value as the remaining \"supply\" left at the end of the trading day.\n5. I have flipped the quantity and price axis in my analysis to not only help present the data, but also drive home the point price is what drives the volume in a short squeeze scenario, rather than price being driven by volume.\n\n&#x200B;\n\nNow, lets takes a look at what GME's modeled demand curve looks like -\n\n[Modeled GME stock demand; Vertical Axis value 1 = 1\\/22 trade volume 197 million share](https://preview.redd.it/df6awqmf94471.png?width=583&format=png&auto=webp&s=11a41e99f4bb2d213eaf3d5bac390b09a26608e8)\n\nWell, the model shows demand typically moves down and to the right, until we reach that tricky $300/share level that results in really interesting things happening, like the internet going down today, 3/10 50% loss in share price in 10 minutes, or straight up buying restrictions on GME like in Jan. This model is showing that instead of going demand for GME shares going to 0 after 300 like typically would be expected with rising prices - **THE DEMAND FOR GME SHARES BEGINS TO RISE EXPONENTIALLY AFTER $300!!!**\n\n&#x200B;\n\nNow, demand is just one part of the supply/demand balance, we still need the supply piece, so what does that look like?\n\n[GME Modeled Stock \\\\\"Supply\\\\\". Amount supplied = \\(1 - \\\\\"normalized demand\\\\\"\\)](https://preview.redd.it/vvj5dp72b4471.png?width=611&format=png&auto=webp&s=c1802ac52fb1a9095d1f87fbc27793637ee6e27f)\n\nSo from the start of the chart, again, an the supply of GME stock shows an \"upward\" and to the right movement, signifying more supply will show up as prices rise. However, again, something really interesting is happening after $300/share price for GME. It seems the supply of GME shares actually begins to dry up, and liquidity drops off a cliff after the $300 mark. Now, with both of these models, they are in no way perfect, and subject to some pretty big deviations from the model line, but I think this is mostly a result from some of the noise added to the model during the initial Jan squeeze and the second squeeze in Feb with the legend u/DeepFuckingValue doubled down. Happy birthday Sir! I didn't adjust or remove any of this data because I wanted to present the raw pricing and let you use your own discretion and critical thinking if this can be relied on.\n\n&#x200B;\n\nTo pull this all together, I present the ultimate model of the GME Supply-Demand curves -\n\n&#x200B;\n\n[Triangles - Price; Black - Supply Curve; Red -Demand Curve](https://preview.redd.it/ndth21pic4471.png?width=692&format=png&auto=webp&s=cdcdf95c068484c3b0e3276c3c6f966d1ac9e538)\n\n&#x200B;\n\nI have highlighted today's close in the larger yellow triangle. It appears now there is some math behind the idea the $300 mark is the event horizon of the financial black hole GME short position created, as after that point Demand for GME begins to skyrocket and supply of GME shares becomes non existent. This is not financial advise. Diamonds are not formed without extreme pressure. **The ALGOs NEED the supply curve to turn into the type of curve they have been programmed for where rising prices result in more supply.** 💎🖐 ruins any and all algorithmic/rules based trading that use classical economics to drive the trading. You know what to do, and if not, DFV has a message for you - [https://twitter.com/TheRoaringKitty/status/1402339649662730240](https://twitter.com/TheRoaringKitty/status/1402339649662730240).\n\n&#x200B;\n\nFinal note, I made an OPINION post speculating on how we may be on the verge of not just a GME infinity squeeze, but also an infinity squeeze of the GME digital currency that may or may not be announced tomorrow. The post didn't get much visibility originally, so sharing here for all those interested - [https://www.reddit.com/r/Superstonk/comments/nv6dwy/rc\\_can\\_give\\_dfv\\_two\\_infinity\\_squeezes\\_for\\_his/](https://www.reddit.com/r/Superstonk/comments/nv6dwy/rc_can_give_dfv_two_infinity_squeezes_for_his/)\n\n&#x200B;\n\n**EDIT 1: Forgot TL/DR -**\n\n**TL/DR (for🦍 that can't read) :**\n\n💎🖐🦍➡💩a🔔🎆➡🔥🚀🚀🚀🌙➡🍗🍗🍗\n\n&#x200B;\n\n**EDIT 2:**\n\nIn my opinion, there have been three phases to GME this year\n\n1. Initial Jan squeeze followed by dump to Feb lows\n2. DFV double down, 2nd squeeze back to 350 for 3/10 50% dump in 15 min back to 170, eventual fall to 120.\n3. April consolidation, late May squeeze starts and now we are at 300, the highest level since 1/29\n\nSo, based on these events and the different phases, when it comes to modeling such volatile moves, you either need to use several different correlations and piecemeal things together, use one simpler correlation and loose accuracy, or you can increase the order of the correlation. I concede, in many instances, this can be considered \"overfitting\", but I do not believe this is the case for this data set. In the lower price ranges, the lower ordered parts of the fit help describe the data, in the mid range, the middle orders take charge, and in the higher range the higher orders matter. We were are today, there are only 2 other instances where GME was above this, so this is an imperfect attempt to model what seems to be an outlier event, which will soon be a price floor if prices continue higher. The most important thing you can use this higher order correlation for is derivative analysis to get a better idea of where the tangent lies and the magnitude of the acceleration of prices as GME goes above $300. Whatever conclusion you draw from this, if you draw one at all, is the direction where things are going, and further judgement and analysis should be used after that. This model in fact breaks down after the 365 price level, as there will still be shares available at that point, and new data can be taken in and analyzed when/if that price is reached. I relate to many 🦍 with math/engineering backgrounds as I too have a background in engineering, but please realize the black/white needed for engineering isn't necessary or even prudent in finance, everything is gray. Market's are controlled by algos and machine programming on the surface, but are still deeply human and filled with uncertainty. Look into the failure of LTCM in the 90's / read \"When Genius Failed\" - The smartest and richest HF in the world created an algo that beat markets for years, until it didn't, the fund became insolvent, and the fed needed to bail them out.",
    "title": "Supplying the Demand and Quanting Even More - 6/8/21 Analysis",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nvgslf/supplying_the_demand_and_quanting_even_more_6821/"
}