{
    "author": "rensole",
    "created_utc": 1616145641.0,
    "distinguished": null,
    "edited": 1616155117.0,
    "id": "m8ddpj",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m8ddpj",
    "num_comments": 1430,
    "permalink": "/r/GME/comments/m8ddpj/synopsis_for_03192021_what_we_need_to_know_before/",
    "score": 14842,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\n&#x200B;\n\nhttps://i.redd.it/vi5s74f56yn61.gif\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/77pi17c66yn61.png?width=680&format=png&auto=webp&s=76c74e9d044d107489ba9783fa76fe97680e86af\n\nNone of this is financial advice, I still believe in crayon eating monsters living beneath my bed.\n\n# Quadruple witching Day\n\nSo today is the 19th on which stock index futures, stock index options, stock options, and single stock futures expire simultaneously. While stock options contracts and index options expire on the third Friday of every month, all four asset classes expire simultaneously on the third Friday of March, June, September, and December.\n\nToday we'll also see the ETF's rebalance and I have no clue how that will turn out, one thing I do know is today will be expensive for them if they even touch the etf's as today is Dividends day.\n\nAlso what you need to keep in mind is that we have been seeing lower and lower volume time and time again, as you've seen in the great DD I've posted in the past 2 days ( [https://iamnotafinancialadvisor.com/Current-DD/](https://iamnotafinancialadvisor.com/Current-DD/) ) this is cyclical\n\nEvery time the volume gets low it pops for a bit, from $40 (24/2) to $120 (01/3) to $240 on (10/3).So going by this marker alone we can expect this to go up in the next days.\n\n\\*\\*Addendum:\\*\\*Remember WE know the dates THEY know the dates, expect them to try and pull all the stops, expect fuckery as always, expect them to try and crash the price, or a fake squeeze saying \"welp this was $400 that was it\" YOU KNOW BETTER!\n\nSeriously let the fuckery begin but rule by logic, not emotion.\n\n&#x200B;\n\nhttps://preview.redd.it/46jb3ihp7yn61.png?width=789&format=png&auto=webp&s=1a2ba12e1b6cde357629a3bc311ec5c587ee64f0\n\n[https://www.warriortrading.com/bull-flag-trading/](https://www.warriortrading.com/bull-flag-trading/)\n\n&#x200B;\n\n# Video proof CNBC edited the hearing\n\nhttps://reddit.com/link/m8ddpj/video/4xk87c8d8yn61/player\n\n**context:** Dennis Kelleher is calling out the SEC for their mismanagement when it comes to big market makers. They don't regulate them correctly, they just give them a fine when they break the law and let them to keep their profits.. After it cuts off he also begins talking about how shady business being done by MMs which are \"too big to fail\" puts the financial system at risk, and in effect, the economy.\n\nOriginally posted by u/socrates6210\n\n&#x200B;\n\nhttps://preview.redd.it/hdhbtaps8yn61.png?width=960&format=png&auto=webp&s=0fbfa6cb36ce996428612a497de48bf079193c83\n\nEtoro Ceo's shirt is awesome, may be coincidence, but given the circumstance who knows.\n\n# When in doubt, ZOOM OUT!\n\n# \n\nhttps://preview.redd.it/nvv5e0w09yn61.png?width=709&format=png&auto=webp&s=01b9fa3cb17c1534b1453cf88780a87be2f6ec80\n\nseriously yesterday and the past few days have been sideways and I've seen people complaining, just remember we've seen that in February as well, just remember the technicals we have a super big cup and handle forming [https://www.investopedia.com/terms/c/cupandhandle.asp](https://www.investopedia.com/terms/c/cupandhandle.asp)\n\nSeriously this has me hyped, like immensely so.\n\n&#x200B;\n\nhttps://preview.redd.it/nf29n3si9yn61.jpg?width=478&format=pjpg&auto=webp&s=c2045552874aee72fdb4ec9f27c59065577e4e00\n\n# Expect SHILLCON1\n\nWe've always seen shills/bots/trolls more active on the days it matters the most, so guys for the love of everything that's holy relax, listen to the people you know ignore all forms of FUD spreading.\n\nThings we can see today are varied, from \"I'm worried for your money plz sell\" to distracting to other stonks, trying to get people to paperhand, mass report the guys that do the most like unfortunately u/wardenelite yesterday and u/heyitspixel this morning.\n\nat this point I'll be waiting for mine, but I'll keep the mods informed and try updating via that.\n\n&#x200B;\n\nJust know if the reason you've bought the stock haven't changed why should you change your position.\n\nbe vigilant today but be on your extreme best behavior, being nice helps!\n\nbecause people are nice we where able to weed out the shills easily, we where able to see who is who very fast, because shills can't be nice and do their job.\n\n# Beware of incoming gains FUD\n\noriginally posted by  [u/CroakyBear1997](https://www.reddit.com/user/CroakyBear1997/)\n\n    Prepare for shill fake gains when MOASS starts.\n    If I was a hedgie worth billions of dollars what would I do?\n    \n    I would create fake portfolios with Photoshop and spam post gain porn when \n    the MOASS starts so that apes will freak out and start panic selling.\n    \n    If the stock hits say 100k, they will spam post all the stock subreddits and \n    Twitter etc. \n    With fake photoshopped portfolios and gain porn to trick the ape community \n    that big winners and investors have realized their gains and the stock won't \n    rise more.\n    \n    How to best avoid that?\n    In my opinion the easiest and best way to fight this tricky strategy \n    which they 100% will try out is to restrict ANY gain porn on this sub. \n    Make it so that all gainporns until X days post MOASS will result \n    in an instant ban so that apes won't get screwed over.\n    \n    If I was Melvin or Citadel I'd already have a few hundred fake pictures of gains\n    within different price ranges so I can adapt to the violent price movements to come.\n    \n    Remember apes: 1.000.000 is not a meme, we are all in this rocketship, \n    it is fueled and pointing at Andromeda. \n    All we have to wait for is an alpha silver back gorilla to \n    press the huge red button on the dashboard.\n    \n    In short: I like the stock, hold!\n    $CUM\n    Edit: this rule is already in action for this sub but as far as I know r/wallstreetbets doesn't have this rule and many of us are still in there so brace yourselves for a shit ton of FUD coming from wsb.\n\n# We have the same rule here, NO GAINS/LOSS POSTS this ill result in an instant ban!\n\nwritten by:  [u/Accurate\\_Ad\\_4055](https://www.reddit.com/user/Accurate_Ad_4055/)\n\n    Let me remind you: \n    \n    Their only way out is GameStop going bankrupt\n    \n    The price does not matter anywhere below $1.000.000. \n    Nobody is selling and so it must remain until this plays out as \n    they have set it up to play out. \n    Only issue for them: their bet did not play out. \n    They bet on GameStop defaulting on their loan on 03/15/2021. \n    \n    They bet on GameSpot being dead by now.\n    \n    Their bet is done and no matter how far they kick this can down the road, the MOASS is inevitable.\n    \n    It does not matter if they short it down to $50 or even $38 again. \n    They will only scare off those that aren't already involved and \n    we have seen that nobody is selling.\n    \n    The tiniest amount of buying pressure will brake the flextape seals they \n    keep throwing on this with ever more shorts.\n    \n    No matter how long this will take. \n    Wait. Hold. Buy the dips and average up as well as down, \n    depending on what is affordable to you. \n    No day trading. \n    No selling shares to switch brokers.\n    \n    Hold.\n\nNo matter what you see, the only way out is for GME to go bankrupt or Citadel.\n\nAnd guess who is losing money, because it aint GME\n\n&#x200B;\n\nhttps://preview.redd.it/ut7rmj6eayn61.png?width=960&format=png&auto=webp&s=774e4d4db9e7ae3e355653a1728f3065b782f2ab\n\nExpect everything today!\n\nWe can see this go up as well as down, dont get scared if you see this go to $100 and dont get scared if you see it go to 400.\n\nWe have diamond handed through the lows time and time again, so if we go up, diamond hand there as well, the price is whatever we set it too.\n\nPeople have ridiculed some of us saying higher numbers (100,000+) are unattainable, yet with researching I've not found anything indicative that there even is a ceiling.\n\nEverything tells me that the losses with a \"short\" can be infinite, hello Kenny, we are the inevitable.\n\nhttps://preview.redd.it/5knfyvdacyn61.png?width=640&format=png&auto=webp&s=f2e7ba40e408437ae21b2049f2c7ce67f3af850a\n\nwe only have two types of emotion in this, Greed and fear.\n\nThey are using bots/trolls/shills to spread FUD, get some of us to fear what will happen.\n\nThey told us it was over when we hit $15 bucks, then $20 then after the first spike back to $40, and now at $200 they're saying it's over again.\n\nFuck m.\n\nBecause I believe in the stock, I am sure that everything I've read so far lines up, both bullish or bearish. All this info has led me to believe I'm michael burry ish.\n\n&#x200B;\n\nhttps://preview.redd.it/bgrprxr5dyn61.png?width=640&format=png&auto=webp&s=8bed00b067803b92d7c636f35c51bf6ec16166c0\n\n# REMEMBER TO BE NICE TO ONE AND OTHER!!!\n\nSeriously guys be nice, this makes it so easy to remove the shills.\n\nBecause if everyone is nice these guys stand out, act like everyone here is your best friend, like it's the hot chick/dude you're on a date with, act like this is your ape brother and you're both waiting on a rocket to go to tendytown.\n\nyou know why? because we are friends.\n\nNothing matters, only thing that matters is simple\n\nApes dont fight Apes\n\nApes help other Apes\n\nBecause anyone who isn't an ape get's banned faster then a monkey eats a banana.\n\n&#x200B;\n\nhttps://preview.redd.it/thenkyo6dyn61.png?width=400&format=png&auto=webp&s=dc228f4a7078b053546428c836d98852218d8cd2\n\nRemember none of this is financial advice\n\nRemember none of this is financial advice, I'm so retarded I'm not allowed to go to the zoo 'cause they'll put me in the cage with the rest of my ape brothers.\n\nIf anything happens throughout the day I will be adding it here.\n\nbackups:\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/elite\\_warden](https://twitter.com/elite_warden)\n\n[https://twitter.com/HeyItsPixel1](https://twitter.com/HeyItsPixel1)\n\n&#x200B;\n\nEdit 1:\n\nok so I typed faster then normal when writing this up because I was afraid I'd be banned myself.\n\nI guess shorts are very afraid of getting a Squeeze, or as I like to call it today \"the Hedgie-Wedgie\"\n\nPixel and Warden are now banned by reddit for 3 days, I know pixel is now in talks with reddit but he's waiting for a message back (as it's still the middle of the night overthere) we'll have to wait a bit before this get resolved.\n\nThe fact that they are now mass reporting the dudes who do a lot of positive work here on r/gme tells me we are still on the right track.\n\nJust like a videogame, when you encounter enemies you know you're going in the right direction.\n\n&#x200B;\n\nJust remember to not let those Hedgies get in your head.\n\nJust as always Buy and hold, I'm waiting for market open and I'll be jumping on this bastard like a kitty on Catnip\n\n&#x200B;\n\nEdit 2:\n\nu/OakAged did a great writeup of things that need to be known\n\n1. Key accounts being banned - [/u/Warden\\_Elite](https://www.reddit.com/u/Warden_Elite) who does the daily charting which is amazing, was banned, as was [/u/HeyItsPixel](https://www.reddit.com/u/HeyItsPixel) \\- false reports by the shills no doubt. u/WardenElite2 is the confirmed alternative account for Warden\\_Elite (Confirmed via his twitter warden\\_elite). pixel confirmed his new one is u/heyitsnotjosh\n2. Anticipated levels price will drop to today - Some greater ape has been analyzing the charts and based on where the support levels are identified the prices we could expect to drop to today - it looks like 140 might be the lowest, so if you're wanting to buy more that might be a good buy target! Not financial advice. [https://www.reddit.com/r/GME/comments/m84bit/gme\\_319\\_price\\_levels\\_to\\_watch/](https://www.reddit.com/r/GME/comments/m84bit/gme_319_price_levels_to_watch/)\n3. The trading volume in GME has been dropping off the cliff in the past few days - no one seems to be selling, and I guess the hedgies are nervous because of the increasing awareness of their nonsense! [https://www.reddit.com/r/GME/comments/m7xqfh/35\\_mil\\_to\\_14\\_mil\\_to\\_9\\_mil\\_volume\\_last\\_three\\_days/](https://www.reddit.com/r/GME/comments/m7xqfh/35_mil_to_14_mil_to_9_mil_volume_last_three_days/)\n4. GME Hiring - Now, there's been quite a few news articles about how the squeeze is done, and \"here's why GME is dropping\" and the general implication is that the results next week are not going to be great or show much. Well. Why on earth would a company that's not got great results coming up be hiring 6000+ new staff?[https://www.reddit.com/r/GME/comments/m7rerr/gamestop\\_posted\\_100s\\_of\\_job\\_posts\\_yesterday/](https://www.reddit.com/r/GME/comments/m7rerr/gamestop_posted_100s_of_job_posts_yesterday/)\n5. Goldstein takeaways - Alexis Goldstein pulled together some key takeaways from the Congress hearing this week - she's the one that was (one of) the awesome witnesses not afraid to speak the truth. [https://www.reddit.com/r/GME/comments/m7syk7/takeaways\\_from\\_the\\_2nd\\_gamestop\\_house\\_hearing/](https://www.reddit.com/r/GME/comments/m7syk7/takeaways_from_the_2nd_gamestop_house_hearing/)\n6. Ownership Math - This ape has done some analysis and figured out Retail likely owns more than 100% of available shares in GME - HODL [https://www.reddit.com/r/GME/comments/m7x2gq/dd\\_i\\_did\\_the\\_math\\_there\\_is\\_literally\\_no\\_doubt/](https://www.reddit.com/r/GME/comments/m7x2gq/dd_i_did_the_math_there_is_literally_no_doubt/)\n7. Bloomberg terminal EOD yesterday - This awesome ape posted screenshots from the Bloomberg terminal at EOD yesterday - I love this sort of thing, it gives us access to some of the data only the hedgies/finance firms realistically have access to (Costs $24k a year for a bloomberg terminal). [https://www.reddit.com/r/GME/comments/m7usgx/final\\_bloomberg\\_update\\_on\\_031821\\_the\\_endgame\\_is/](https://www.reddit.com/r/GME/comments/m7usgx/final_bloomberg_update_on_031821_the_endgame_is/)\n\nEdit 3:\n\napparently we almost own the float!\n\n[https://www.reddit.com/r/GME/comments/m74f7h/how\\_many\\_shares\\_does\\_retail\\_own\\_digging\\_through/](https://www.reddit.com/r/GME/comments/m74f7h/how_many_shares_does_retail_own_digging_through/)\n\nEdit 4:\n\nBe sure to give this a read, been posted about 2 weeks ago but still holds true\n\n[https://www.reddit.com/r/GME/comments/lzxbzm/be\\_adamant\\_some\\_reminders\\_for\\_managing\\_behavior/](https://www.reddit.com/r/GME/comments/lzxbzm/be_adamant_some_reminders_for_managing_behavior/)",
    "title": "Synopsis for 03-19-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/m8ddpj/synopsis_for_03192021_what_we_need_to_know_before/"
}