{
    "author": "karasuuchiha",
    "created_utc": 1626896054.0,
    "distinguished": null,
    "edited": 1626950603.0,
    "id": "oox7w7",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oox7w7",
    "num_comments": 117,
    "permalink": "/r/GMEJungle/comments/oox7w7/units_and_how_rc_will_checkmate_shfs/",
    "score": 564,
    "selftext": "First clearing up the unfounded speculation on RCs tweet.\n\nI'm noticing a huge push for a stock split based on \"Chop Sticks rythms with Stock Split\" and\" its 7 to 1 because it was posted at 7:41\",  i believe its a shill campign to change the narrative because [GME is unique](https://www.reddit.com/r/GME/comments/okm0lu/gme_the_true_to/?utm_medium=android_app&utm_source=share) because of its small Float/Share Issuance and to try to make it comparable to other shorted stocks). \n\n[More on why Split's/Reverse Splits do not work for fixing naked shorts](https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/) \n\nIf 🦍s notice a push for interpreting the tweet as a stock split simply ask for a link to some evidence that GameStop/RC is trying to make a Stock Split happen, they won't have any because there is none \n\nWithout further ado Here's a DD showing RCs Tweet is pointing to the **Units** 🚀🚀🚀🚀🚀🚀 \n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\n[First what's a Unit](https://www.investopedia.com/terms/u/unitholder.asp#:~:text=A%20unit%20is%20equivalent%20to,purchase%20a%20portfolio%20of%20assets.)\n\n\"A unit is **equivalent** to a share, or piece of interest. Unitholders are afforded specific rights that are outlined in the trust declaration, which governs the trust's actions. The most common type of unit trust is an investment vehicle that pools funds from investors to purchase a portfolio of assets.\"\n\n\n\"A unit is **equivalent** to a share\" thats the important part of a unit, there's no shares or cash being issued but instead an equivalent like an NFT or Crypto.\n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\n[From the beginning of GameStop SEC Filing talking about units for more clarity](https://investor.gamestop.com/node/18346/html#rom50019_13) (scroll up to the top)\n\n\"Each unit will be issued under a unit agreement and will represent an interest in two or more other securities registered under this registration statement, which may or may not be separable from one another.\"\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n[Now to Page 13 which PG-13 is pointing within GameStops SEC Filing](https://investor.gamestop.com/node/18346/html#rom50019_13)\n\n\"The following description contains general terms and provisions of units to which any prospectus supplement may relate. The particular terms of the units offered by any prospectus supplement and the extent, if any, to which such general provisions may not apply to the units so offered **will be described in the prospectus supplement relating to such units**. For more information, please refer to the **provisions of the unit agreement and unit certificate**, forms of **which we will file with the SEC at or prior to the time of the sale of the units.** For information on incorporation by reference, and how to obtain copies of these documents, see the sections of this prospectus entitled “Where You Can Find More Information” and “Incorporation of Certain Information by Reference.”\n\n\"We may issue units from time to time in such amounts and in as many distinct series as we determine. We will issue each series of units under a unit agreement to be entered into between us and a unit agent to be designated in the applicable prospectus supplement. When we refer to a series of units, we mean all units issued as part of the same series under the applicable unit agreement.\n\n**We may issue units consisting of any combination of two or more securities** described in this prospectus. **Each unit will be issued so that the holder of the unit is also the holder of each security included in the unit**. Thus, the **holder of a unit will have the rights and obligations of a holder of each included security**\". These units may be issuable as, and for a specified period of time may be transferable as, a single security only, rather than as the separate constituent securities comprising such units.\"\n\nSo the biggest question is what's the unit? What's RC marrying 🦍s beloved stock to?\n\n\nWell the easiest most straight forward answer is the [Power to the Players NFT Token](https://www.reddit.com/r/DDintoGME/comments/nmsjzn/gme_nft_creator_just_minted_powertotheplayers/?utm_medium=android_app&utm_source=share) which has already been minted and the [non cash dividend filing](https://www.reddit.com/r/GME/comments/nw6l55/noncash_dividend/?utm_medium=android_app&utm_source=share) backs that up.\n\nAlso GameStop is hiring a [new Director of SEC and Financial Reporting](https://www.reddit.com/r/Superstonk/comments/olxepi/gamestop_is_hiring_a_new_director_of_sec_and/) 👀👀\n\n\n🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗🍗\n\n\nNow to Explain/TLDR \n\nHedgies are fucked because they won't have the units(NFTs) for the stocks as only GameStop will issue them as a single security and only for a limited amount of time to add onto existing shareholders. The extra kicker, they won't be able to Naked short GME anymore because they won't have the units(NFTs) for it, as every share must be a complete Unit after GameStop does this, Jesus my tits and 🚀🚀🚀🚀🚀🚀\n\n\n[Better TLDR ](https://www.reddit.com/r/GME/comments/oop0ny/what_rcs_chop_sticks_tweet_is_about/h60agni?utm_medium=android_app&utm_source=share&context=3)\n\n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\nNow back to speculation on RCs tweet \n\n[A strong explanation of the Chop sticks pointing to the body of text on Page 13](https://www.reddit.com/r/Superstonk/comments/oo0wo2/deeper_meaning_of_the_rc_tweet/?utm_medium=android_app&utm_source=share)\n\n[an plausible second explanation of chopsticks in the nose](https://www.reddit.com/r/GME/comments/ontjxa/pg_13_the_only_13_page_sec_filing_lately_is_the/h5uyhfi?utm_medium=android_app&utm_source=share&context=3)\n\n\"Since Ryan is big on TA, I thought he was referring to the nose engulfing candle stick pattern. This is where 2 candles have the same colour and the second candle engulfs the nose if this first one (4hr chart). It appears to be a reversal which is bullish!\"\n\n\nAnd finally More DD from [another 🦍s](https://www.reddit.com/r/Superstonk/comments/onw3ie/pg13/?utm_medium=android_app&utm_source=share) explaining overstock set the legal precedent of crypto dividend against shortys\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nTo awesome not to share:\n [\"I feel like RC is missing this opportunity to call it the Absolute Unit.\"](https://www.reddit.com/r/GMEJungle/comments/oox7w7/units_and_how_rc_will_checkmate_shfs/h61p9ko?utm_medium=android_app&utm_source=share&context=3)\n\nOther TLDRS\n\n[TLDR 1](https://www.reddit.com/r/DDintoGME/comments/oow140/units_and_how_rc_will_checkmate_shfs/h61lnk9?utm_medium=android_app&utm_source=share&context=3)\n\n[TLDR 2](https://www.reddit.com/r/DDintoGME/comments/oow140/units_and_how_rc_will_checkmate_shfs/h61o52p?utm_medium=android_app&utm_source=share&context=3)\n\n[A way a may play out](https://www.reddit.com/r/GME/comments/op11cd/units_and_how_rc_will_checkmate_shfs/h62dils?utm_medium=android_app&utm_source=share&context=3)\n\n[2 ways it might play out](https://www.reddit.com/r/Superstonk/comments/ooxsmd/units_and_how_rc_will_checkmate_shfs/h61sic3?utm_medium=android_app&utm_source=share&context=3)",
    "title": "Units and how RC will Checkmate SHFs",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oox7w7/units_and_how_rc_will_checkmate_shfs/"
}