{
    "author": "StupidMonsters",
    "created_utc": 1622592581.0,
    "distinguished": null,
    "edited": 1622679246.0,
    "id": "nq8idk",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_nq8idk",
    "num_comments": 766,
    "permalink": "/r/Superstonk/comments/nq8idk/japanese_apes_calling_for_support_please_im/",
    "score": 21358,
    "selftext": "Edit6# credit to u/ThaStonk\n\n“https://www.rakuten-sec.co.jp/ITS/company/pdf/co16_kitei_05.pdf\n\nThis is their TS for the foreign stocks\ncheck section 10-10\n\nI had to call them and tell them that I wanted to check my voting rights according to this, and they had to find someone who knew about it and they will call me back, and they did but it went to voicemail.”\n\nThere is nothing that says Rakuten users can’t vote in their PDF. If you’re with Rakuten and bought shares before 4/15 then call them and bring this up when speaking to them. I’ll try again tomorrow and use this knowledge ThaStonk shared with me. You can be mad at Rakuten as a company but don’t be rude over the phone when speaking with the staff. Hope this helps y’all Samurai Apes!!\n\n\nEdit5# I will read Rakuten Securites user terms and agreement in a few hours to see if share lending/margin is mentioned. Japanese friend and I will proof read and update once more. Stay strong (update Rakuten does not lend shares by default, you have to register for that, and for margin account)\n\nEdit4# Take this update with a grain of salt, doesn’t mean your shares are on margin but this does seems fishy to me, IGNORE anyone telling you to transfer/sell. I just want to bring light to this:\n\n[DEBUNKED, choosing any topic on the chat option changes chat HTML to /margin\n\nSorry but I’m wrong on this one, seeing the html change to /margin gave me ptsd and made me jump to conclusions. I’ve come to dislike that word too much for my own health.\n\nI went to chat with their customer service here:\n\nhttps://www.rakuten-sec.co.jp/web/help/chat/\n\nWhen you choose to chat about [米国株式] (US Stocks) the HTML link changes to:\n\nhttps://www.rakuten-sec.co.jp/web/help/chat/margin\n\n———————————————————————————————\nRakuten Securities won’t let us apes vote because according to them they use Interactive Brokers as their US custodian and the shares are under Rakuten and not under our names! \n\nTHIS IS JUST AN EXCUSE! \n\nTiger Brokers who use Interactive Brokers as their US custodian under Tiger Brokers name let apes vote because of high demand for voting! IF THEY WORK THE SAME AS RAKUTEN THEN RAKUTEN HAS NO EXCUSE! THEY ARE LAZY AND INCOMPETENT!\n\nLet’s get 楽天証券無能 (Rakuten Securities incompetent) trending on Twitter!!!\n\nAnyone who is Japanese or international, knows Japanese or even just google translate is enough!!! We need to push them to let us VOTE! \n\nPlease, this is a cry for help. Most Japanese GME holders don’t know about the DD so there has not been a big movement yet. I’m trying my best to inform people around me but there’s not much I can do alone.\n\nI have so much love and respect for all you Apes!\n\nEdit3# comment by u/HalleysComet41\n\nI would recommend adding the hashtag #ゲームストップ事件 or gamestop incident, as that is what it is commonly referred to. (By commonly, I mean common among the very very small percent of the population who is active in investing / investing news / or watches Horiemon)\n\n\nEdit1# RAKUTENS TWITTER HANDLE IS @RakutenSec\n\nhttps://twitter.com/rakutensec\n\nEdit2# what you can write to @RakutenSec:\nupdate by u/WowSuchinternetz :\n\nYour Japanese translation is garbage. Here's a better one.\n\n楽天証券によると顧客の米国株式はカストディアンであるインタラクティブ・ブローカーズが保管しており、顧客名義ではなく楽天証券名義で保有されているため、顧客にはゲームストップの議決権を行使させることは出来ないとしている。\n\nこれは単なる言い訳です！\n\nタイガー・ブローカーズは楽天証券同様にインタラクティブ・ブローカーズをカストディアンとしており、同様にタイガー・ブローカーズ名義で保有されているにも関わらず顧客にゲームストップの議決権を行使させている。タイガー・ブローカーズは楽天証券と同じ様な管理形態になっている。タイガー・ブローカーズは顧客に投票させているのに楽天証券はさせないというのは言い訳が立たない！楽天証券は怠慢で無能だ。\n\n #楽天証券無能 (don’t forget the hashtag!!)\n\nTranslation: \n\nAccording to Rakuten Securities, Interactive Brokers is the custodian of US stocks and your shares is under Rakuten name, not our name, so @RakutenSec will not let shareholders of GameStop vote.\n\n  This is just an excuse!\n\nTiger Brokers, who uses Interactive Brokers as a US custodian under the name of Tiger Brokers, let shareholders of GameStop vote! Tiger brokers works thr same as Rakuten. Rakuten has no excuses when it works for Tiger Brokers! Rakuten is lazy and incompetent.",
    "title": "JAPANESE APES CALLING FOR SUPPORT! PLEASE!! I’m begging you",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/nq8idk/japanese_apes_calling_for_support_please_im/"
}