{
    "author": "rensole",
    "created_utc": 1615975752.0,
    "distinguished": null,
    "edited": 1615996809.0,
    "id": "m6x3w5",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_m6x3w5",
    "num_comments": 2035,
    "permalink": "/r/GME/comments/m6x3w5/synopsis_for_03172021_what_we_need_to_know_before/",
    "score": 11313,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\n*Michael Burry* : \"That's dumb, Lawrence. *There are always markers*. \"\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/49wo4x2pyjn61.png?width=680&format=png&auto=webp&s=1016d8b9ade9bc0711f8adb02bfefb549e94a211\n\nAnd as usual this is not financial advice.\n\n# This is it, by George.. this is literally it\n\nOk I'm not sure who has seen this and who hasn't but... yeah this changes everything.\n\nWe've all had theories of whats going on from naked/sythetic shares being out, how Citadel and the others have been doing what they are doing and it keep going up and down.\n\nI got posted [this](https://iamnotafinancialadvisor.com/discord/DD/GMEv10.pdf) from   u/gafgarian\n\n**Addendum: guys relax thousands of apes want to read so the website may be slow or non responding, relax it didn't get deleted it's just overrun by requests**\n\n[alt link](https://docdro.id/wnDnAlY)\n\n[alt link 2 pdf as pictures](https://www.reddit.com/r/Wallstreetbetsnew/comments/m6yrgp/gamestop_the_last_great_squeeze_part_1_by_rensole/?utm_source=share&utm_medium=web2x&context=3) and [part 2](https://www.reddit.com/r/Wallstreetbetsnew/comments/m6z4qq/gamestop_the_last_great_squeeze_part_2_by/?utm_source=share&utm_medium=web2x&context=3)\n\nand everything clicked for me this all suddenly makes sense.\n\nThis DD go's into how everything works, from the standard short selling model which we normally see, to the \"bankruptcy jackpot\" method used here.\n\nIt's all written in ELIA (Explain it Like I'm an Ape)\n\nit shows that the FTD's are in a cyclical nature, how much float is left in total (about 19.3 Million shares). it go's into the risk model it go's into everything.\n\n&#x200B;\n\nThese guys banked on the **bankruptcy jackpot** this means that they bet on the fact that gamestop would go under, destroying the spring and giving them all the tendies, but because Ryan Cohen stepped in this became impossible, also with the digital transition and the positive public sentiment this one is now off the table.\n\nso check the pdf because this stuff is rainman levels of detailed.\n\nto me this shows me that the FTD's are more cyclical in nature, meaning they use Short A to short normally, then they can't find a good share to cover this so what do they do? right they Short again (creating short B), so they use short B to cover the debt of short A, then they short again (creating short C) and they cover short B.... you guys seeing a pattern here?\n\nAt this point I no longer care how long this takes, it may take days or weeks or maybe a month, I no longer care, at this point ANYTHING can set this powder keg off, good news, bad news, a Tweet catalyst (I'll be tweeting this document in a sec and tagging everyone I can think about who may be able to do anything I'd say retweet this please the more exposure this gets the better), also buying pressure could kick this off because at this point  the amount they have available is shrinking every single day.\n\nfor example:\n\nSo people throwing their stimmy's into this, at the end of the month when people get payed you name it. WSB has millions of users and GME has 200k, at this point if everyone in this where to go out today and buy ... I can't imagine what could happen.\n\nSomeone also posted this a few days ago: [Citadel has no clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/)\n\nThis ties back into the fact that they are bleeding money, along with the shit tier bonds.\n\nI'm no longer bullish bearish or whatever, I feel Michael Burry-ish.\n\nEverything I've felt up until reading this pdf was a gut feeling lead by logic, and lead by small parts of the story, some parts which I couldn't tie together, this PDF changed that for me, I've never felt so secure in something, but now... I feel like Michael Burry, we have seen the markers all along the way but now they're tying together nicely.\n\nSo forgot the 19th, forget any and all dates, at this point it's just paying attention if a catalyst kicks it off, and remember this can be everything.\n\nThis also nicely tied together the DFV tweet of Gargantuan, it's a point of singularity, a black hole, a point of no return.\n\nfun thing is someone else also thought this up\n\n&#x200B;\n\nAlso if anyone can pick holes in the PDF please let me know because I've tried to debunk it with no success, as have others I sent this to.\n\n&#x200B;\n\nhttps://preview.redd.it/654iyvek7kn61.jpg?width=1170&format=pjpg&auto=webp&s=b90152e09928100059e2f9694f38d4ebf1384fc6\n\n&#x200B;\n\nhttps://preview.redd.it/ly32130l7kn61.jpg?width=1170&format=pjpg&auto=webp&s=e41e48a2057b16c884c97ae8726d4b6b971ad42e\n\n&#x200B;\n\nhttps://preview.redd.it/kp1r4m8h5kn61.png?width=1600&format=png&auto=webp&s=9f98e09dc9bb70ef4dadb0f2db6b2cda40209532\n\nso what else is there today? oh nothing much, only I dunno...\n\n# Something hypothetical and thought not possible happened.\n\ncheck this [negative Beta](https://www.reddit.com/r/GME/comments/m6gqt9/this_ape_explains_delta_and_how_a_negative_delta/)\n\nIt's been a long ass time since I had some education but as far as I remember a negative beta is not supposed to be able to exist that big, like I remember -1 being very rare, but everything bigger then that shouldn't be possible, yet here we are.\n\nlike OP said there:\n\n    To clarify because it is coming up in the comments, a negative beta which \n    is less than -1 is not very unusual and it means that the stock is resistant \n    to a market downturn but doesn't actually go as far as doing the opposite of \n    the market, i.e. -1 or less. But -1 is considered not to exist, \n    although academics never like to say never. \n\nAnd the following one very funnily enough this was also posted around the same time, someone was investigating the same thing: credit to  u/Animasoul\n\n[https://www.reddit.com/r/GME/comments/m6i4z2/the\\_mythical\\_unicorn\\_aka\\_extremely\\_abnormal/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/GME/comments/m6i4z2/the_mythical_unicorn_aka_extremely_abnormal/?utm_medium=android_app&utm_source=share)\n\nAlso on the bonds:\n\n[https://www.reddit.com/r/GME/comments/m6ote4/some\\_fun\\_info\\_about\\_citadels\\_bonds\\_and\\_their/?sort=confidence](https://www.reddit.com/r/GME/comments/m6ote4/some_fun_info_about_citadels_bonds_and_their/?sort=confidence)\n\n&#x200B;\n\nhttps://preview.redd.it/i6beezgq6kn61.png?width=640&format=png&auto=webp&s=93d09972e6c0510d2aa136fcbf41373595ada2d7\n\n# ok so.... we just buy and wait?\n\nyes, thats it easy right? see it as a grind for getting the good ending, see it as a Boss fight who said you where just weak and could never hurt him, but he doesn't know you have a +40 comradery buff.\n\n[https://www.reddit.com/r/GME/comments/m6cebh/why\\_10000\\_per\\_share\\_is\\_just\\_a\\_stop\\_along\\_the\\_way/](https://www.reddit.com/r/GME/comments/m6cebh/why_10000_per_share_is_just_a_stop_along_the_way/)\n\nthis brilliant ape uses technical calculations on where the price will go, with a  **Ralph Nelson Elliot wave**.\n\nif everyone holds this motherfucker can go into the million a share, I've always tried to reason \"100,000\" a share is enough but with this... I no longer care man, I removed my bottom I'm going to do the same as OP, I'd rather get 80% of the top then selling pennies on the dollar.\n\nThis theorem does hinge on a very simple point, we hodl, don't get off the rocket before we are on mars.\n\n&#x200B;\n\nhttps://preview.redd.it/o744r7yn9kn61.png?width=2047&format=png&auto=webp&s=d85052198c58d20e57ec2ed82eb53eb09ecc0232\n\n# So... Rensole what about the dates?\n\nfuck the dates, people have been hyper focused on the dates for a while now, and if WE know the dates, THEY know the dates, they'll most likely see everyone hyping on the 19th and will try to kick the can to the 25th or longer.\n\nSo scrap putting values on dates, stop caring that \"oh we need X date\" no we don't.\n\nWe just need to do what we have always done\n\nEat crayons, get us some awesome dip and hodl.\n\nif we do that there are 2 outcomes,\n\n1. we will be the catalyst and we'll get the entire float (seeing the amount of people we have in this this is actually possible because if half of WSB/GME gets 3 shares or more, this deletes the entire 15 million shares float)\n2. we wait for an external catalyst like RC becoming CEO, which can happen next week or within the next 6 months.\n\n&#x200B;\n\nJust be patient, Michael Burry waited 2 YEARS to make one of the best play anyone has ever made.\n\nWe can wait a few weeks or months if need be, nothing worth anything ever came easy.\n\n&#x200B;\n\nhttps://preview.redd.it/hzpqu5dsakn61.png?width=727&format=png&auto=webp&s=ec7cf8cbcf71f750828e9640464699deb14c6b10\n\n# !!!Be nice!!!\n\nSeriously guys be nice, this makes it so easy to remove the shills.\n\nBecause if everyone is nice these guys stand out, act like everyone here is your best friend, like it's the hot chick/dude you're on a date with, act like this is your ape brother and you're both waiting on a rocket to go to tendytown.\n\nyou know why? because we are friends.\n\nIDGAF what religion you have, your political ideology, color of ones eyes.\n\nNothing matters, only thing that matters is simple\n\nApes dont fight Apes\n\nApes help other Apes\n\nBecause anyone who isn't an ape get's banned faster then a monkey eats a banana.\n\n&#x200B;\n\nhttps://preview.redd.it/u7v5hzdnbkn61.jpg?width=400&format=pjpg&auto=webp&s=b9fc9cfb992db598b1a5a5caf0c03a04e5439b1b\n\nRemember none of this is financial advice, I'm such an idiot I'm already picking out my lambo right now and asking if it comes with a crayon holder.\n\nIf anything happens throughout the day I will be adding it here.\n\nbackups: [https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n&#x200B;\n\nedit 1:\n\nPlease retweet this, please share this, I feel like this may be the single most important thing that everyone needs to read.\n\n[https://twitter.com/rensole/status/1372129285750788102?s=20](https://twitter.com/rensole/status/1372129285750788102?s=20)\n\n&#x200B;\n\nEdit 2: in my excitement I forgot to add the hearing\n\nThe hearing will be today:\n\n[https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=406268](https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=406268)\n\n10 AM E.T.\n\n&#x200B;\n\nEdit 3:\n\nNegative Beta is now even higher at -8\n\nThis is fucking insane\n\n[https://www.reddit.com/r/GME/comments/m6mje0/gme\\_beta\\_from\\_bloomberg\\_and\\_ownership\\_update/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/GME/comments/m6mje0/gme_beta_from_bloomberg_and_ownership_update/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\nEdit 4:\n\nTo anyone listening to the hearing, about 1 hour and 40 minutes in Did Mr. Dennis Kelleher just say Short interest is 140%?  \nSeriously can someone double check this",
    "title": "Synopsis for 03-17-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/m6x3w5/synopsis_for_03172021_what_we_need_to_know_before/"
}