{
    "author": "ka99",
    "created_utc": 1616012813.0,
    "distinguished": null,
    "edited": false,
    "id": "m79s43",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m79s43",
    "num_comments": 55,
    "permalink": "/r/GME/comments/m79s43/timestamp_congressional_hearing_31721/",
    "score": 591,
    "selftext": " *Added 'quick & dirty' written sound bites to help people navigate.*\n\n**Introduction**\n\nRep. Maxine Waters\n\n[https://youtu.be/imRzHXRq80I?t=267](https://youtu.be/imRzHXRq80I?t=267)\n\nRep. McHenry\n\n[https://youtu.be/imRzHXRq80I?t=389](https://youtu.be/imRzHXRq80I?t=389)\n\nRep. Brad Sherman (CA-30)\n\n[https://youtu.be/imRzHXRq80I?t=654](https://youtu.be/imRzHXRq80I?t=654)\n\nRep. Bill Huizenga (MI-2)\n\n[https://youtu.be/imRzHXRq80I?t=774](https://youtu.be/imRzHXRq80I?t=774)\n\nRep. Al Green (TX-9)\n\n[https://youtu.be/imRzHXRq80I?t=866](https://youtu.be/imRzHXRq80I?t=866)\n\n**Witness List (Links to Written Testimony & Intro)**\n\n* [**Sal Arnuk**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-ArnukS-20210317.pdf), Partner/Co-Founder, Themis Trading LLC\n\n[https://youtu.be/imRzHXRq80I?t=1003](https://youtu.be/imRzHXRq80I?t=1003)\n\n*Payment order flow presents undeniable conflict of interest*\n\n* [**Michael Blaugrund**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-BlaugrundM-20210317.pdf), Chief Operating Officer, New York Stock Exchange\n\n[https://youtu.be/imRzHXRq80I?t=1327](https://youtu.be/imRzHXRq80I?t=1327)\n\n*“Short selling is an essential practice…”*   \n\n\n* [**Dr. Vicki Bogan**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-BoganV-20210317.pdf), Associate Professor, Cornell University\n\n[https://youtu.be/imRzHXRq80I?t=1586](https://youtu.be/imRzHXRq80I?t=1586)\n\n*Gamification of investing is bad, volume = revenue, protect retail investors through regulation*   \n\n\n* [**Alexis Goldstein**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-GoldsteinA-20210317.pdf), Senior Policy Analyst, Americans for Financial Reform\n\n[https://youtu.be/imRzHXRq80I?t=1912](https://youtu.be/imRzHXRq80I?t=1912)\n\n*Biggest profits on volatile days for brokers, wall street profits soar during pandemic, investigate undue risk, cancel student loan debt, wealth tax, tuition free higher education, fix wealth gap*  \n\n\n* [**Dennis Kelleher**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Bio-KelleherD-20210317.pdf), Co-Founder, President and Chief Executive Officer of Better Markets\n\n[https://youtu.be/imRzHXRq80I?t=2203](https://youtu.be/imRzHXRq80I?t=2203)\n\n*Wealth extraction mechanism...many issues cannot be adequately covered with the format of the hearing,* ***written testimony is long and detailed***\n\n**--**Had strongest statement re Citadels market reach in this clip**:**\n\n[https://youtu.be/imRzHXRq80I?t=9175](https://youtu.be/imRzHXRq80I?t=9175)  \n\n\n* [**Alan Grujic**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-GrujicA-20210317.pdf), CEO, All of Us Financial\n\n[https://youtu.be/imRzHXRq80I?t=2521](https://youtu.be/imRzHXRq80I?t=2521)\n\n*Online broker, “markets are not rigged”, “markets are well structured and expertly regulated”*\n\n* [**Michael Piwowar**](https://democrats-financialservices.house.gov/UploadedFiles/HHRG-117-BA00-Wstate-PiwowarM-20210317.pdf), Executive Director, Milken Institute\n\n[https://youtu.be/imRzHXRq80I?t=2816](https://youtu.be/imRzHXRq80I?t=2816)\n\n*“SEC should open up investment opportunities to all Americans”, increase regulatory reporting*\n\nRep. Maxine Waters (CA-43)\n\n[https://youtu.be/imRzHXRq80I?t=3054](https://youtu.be/imRzHXRq80I?t=3054)\n\n*Payment for order flow started by Bernie Madoff (!??) “Disturbing conflicts…”*\n\nRep. Patrick McHenry (NC-10)\n\n[https://youtu.be/imRzHXRq80I?t=3350](https://youtu.be/imRzHXRq80I?t=3350)\n\n*Allow retail investors access to investment opportunities/accredited investor rules.*\n\nRep. Nydia M. Velazquez (NY-7)\n\n[https://youtu.be/imRzHXRq80I?t=3675](https://youtu.be/imRzHXRq80I?t=3675)\n\n*Primary function of gamification is revenue for the rich; short selling disclosure should be increased for all.*\n\nRep. Ann Wagner (MO-2)\n\n[https://youtu.be/imRzHXRq80I?t=3989](https://youtu.be/imRzHXRq80I?t=3989)\n\n*Revisit accredited investor rules; allow retail investors to invest in private funds; impacts of banning payment for order flow; “...fixed commissions are not economically sound...”;* \n\nRep. Brad Sherman (CA-30)\n\n[https://youtu.be/imRzHXRq80I?t=4309](https://youtu.be/imRzHXRq80I?t=4309)\n\n***“Retail investors never had it so good is hardly an answer…”****; payment for order flow is banned in UK; 47% of all trading is flowing into non disclosure markets; public is deprived of information.*\n\nRep. Frank D. Lucas (OK-3)\n\n[https://youtu.be/imRzHXRq80I?t=4623](https://youtu.be/imRzHXRq80I?t=4623)\n\n*How would SEC approach regulating payment for order flow; retail flow is benign to MM’s, institutional flow different from retail flow, retail flow is easier to make money on that institutional flow.*\n\nRep. David Scott (GA-13)\n\n[https://youtu.be/imRzHXRq80I?t=4952](https://youtu.be/imRzHXRq80I?t=4952)\n\nRep. Bill Posey (FL-8)\n\n[https://youtu.be/imRzHXRq80I?t=5270](https://youtu.be/imRzHXRq80I?t=5270)\n\n*SEC should re evaluate their regulations; “Reddit discussions are quite worrisome...”, unintentional market manipulation, “changes we are seeing are in the right direction”*\n\nRep. Al Green (TX-9)\n\n[https://youtu.be/imRzHXRq80I?t=5572](https://youtu.be/imRzHXRq80I?t=5572)\n\n*Issues with payment for order flow, Citadel has disciplinary history, 13.2billion revenues, the risk of getting caught should not be the cost of doing business; what regulators can change/implement*\n\nRep. Blaine Luetkemeyer (MO-3)\n\n[https://youtu.be/imRzHXRq80I?t=5899](https://youtu.be/imRzHXRq80I?t=5899)\n\n*Events of late-January, did the market correct itself?;  “No systemic issues were presented...”, a fascination w what happened with these stocks; the market resilience of overly shorting a stock; we should look at shorting trade settlement cycle; stock shorted 140% is a problem - should we limit shorting or stock lending?*\n\nRep. Emanuel Cleaver (MO-5)\n\n[https://youtu.be/imRzHXRq80I?t=6213](https://youtu.be/imRzHXRq80I?t=6213)\n\n*The largest wall street players usually end up on top, inherent structural advantages, Citadel in particular is profited quite well because of their large hold on retail order flow,* ***Griffin’s remarks raise questions****; we have to be very careful of any frictions we add into the market’s*\n\nRep. Bill Huizenga (MI-2)\n\n[https://youtu.be/imRzHXRq80I?t=6530](https://youtu.be/imRzHXRq80I?t=6530)\n\n*Accredited investor issues, they can be dumb and unsmart - not ppl that should be investing.* ***Ppl who are not accredited investors can be wise, smart, temperate and should have the ability****; Should be approachable and safe; Does SEC have advertising rules? FTT, payment for order flow, T3 to T1;* \n\nRep. Ed Perlmutter (CO-7)\n\n[https://youtu.be/imRzHXRq80I?t=6848](https://youtu.be/imRzHXRq80I?t=6848)\n\n*Over selling a position, “the system won’t allow it”,* ***but there was 359 million FTD’s in GME****; publicly available info shows there’s an abuse of short selling;* ***the way the system works is a house of cards***\n\nRep. Steve Stivers (OH-15)\n\n[https://youtu.be/imRzHXRq80I?t=7167](https://youtu.be/imRzHXRq80I?t=7167)\n\n*Didn’t retail investors win?; not sure we know who net winners/losers were; T+2 to T+1 would have lowered systemic risk, but operational risk rises, I moved us from T+3 to T+2. but technology has changed;* \n\nRep. Jim A Himes (CT-4)\n\n[https://youtu.be/imRzHXRq80I?t=7493](https://youtu.be/imRzHXRq80I?t=7493)\n\n*What happens when retail traders trade a lot?; They lose, designed to extract money from retail investor, LIttle league against NYY; Tenev’s client profit declaration was bs; Vanguard Index funds are best for retail investors;*\n\nRep. Andy Barr (KY-6)\n\n[https://youtu.be/imRzHXRq80I?t=7824](https://youtu.be/imRzHXRq80I?t=7824)\n\n*Regulating gamification will slow retail investor involvement; ppl aren’t putting all their money into Robinhood/Vanguard; We short change the intelligence of retail investors; commission based trading and churning of accounts will increase and must be monitored if we remove order flow*\n\nRep. Juan Vargas (CA-51)\n\n[https://youtu.be/imRzHXRq80I?t=8153](https://youtu.be/imRzHXRq80I?t=8153)\n\n*Conflict in payment for order flow; Robinhood business model; best execution duty should be enforced, dark unregulated markets, artificial NBBO and only reflects 40% of orders, intentionally misleading and false; customer opt out or benefit from payment for order flow*\n\nRep. Roger Williams (TX-25)\n\n[https://youtu.be/imRzHXRq80I?t=8857](https://youtu.be/imRzHXRq80I?t=8857)\n\n*How should we change market structure?; analyze T+1 and payment for order flow; we need to continue to empower retail investors; NYSE and what its doing to help avg American to make better informed decisions?*\n\nRep. Al Lawsom (FL-5)\n\n[https://youtu.be/imRzHXRq80I?t=9175](https://youtu.be/imRzHXRq80I?t=9175)\n\n***“Citadel controls as much trading volume as Nasdaq...”****; no concerns of systemic risk due to Citadel, if their MM function ceases tomorrow there is much competition from other MM will compete quickly to take over their market share; Citadel tried to become investment bank in 2008 and they have regulatory advantages over a bank, shifted to retail trading instead of becoming a bank, Griffin’s testimony raises concerns and should be investigated; MM’s highly competitive and removal of Citadel will have little impact;* ***there is risk on infrastructure side, risk on system institutional side, 26% of all us equities would stop, 8,900 listed securities would stop, they execute 47% of all retail volume,***  ***to say system would work fine if all that evaporated, you’re going to have a systemic event, to deny that is to deny reality****”*\n\nRep. French Hill (AR-2)\n\n[https://youtu.be/imRzHXRq80I?t=9499](https://youtu.be/imRzHXRq80I?t=9499)\n\n***Citadel MM and Citadel hedge fund model is against the law****; SEC regularly examines those protections and they must function seperately*\n\nRep. Cindy Axne (IA-3)\n\n[https://youtu.be/imRzHXRq80I?t=9793](https://youtu.be/imRzHXRq80I?t=9793)\n\n*App design influencing decisions; Robinhood has behavioral researchers; 92% of RH users trades are outside S&P500, spreads are 5x as wide,  RH understood this and negotiated payment for order flow based on this, receive % of spread is misalignment of interest,* ***“fantastic in a negative way”****,* \n\nRep. Lee M. Zeldin (NY-1) \n\n[https://youtu.be/imRzHXRq80I?t=10110](https://youtu.be/imRzHXRq80I?t=10110)\n\n*Shortening the trade settlement cycle; ties to the CCP; sharing of user data with China;* ***WeBull has ties to CCP****;* ***Chinese based investment group wanted to buy Chicago Stock Exchange***\n\nRep. Sean Casten (IL-6)\n\n[https://youtu.be/imRzHXRq80I?t=10432](https://youtu.be/imRzHXRq80I?t=10432)\n\n***“Spread becomes narrower when RH’s servers go down”****; Tech outage, retail orders would go to exchanges; RH’s CEO said customers received price improvement;* ***“not the truth”****; RH has no mechanism to trade w ppl that are not in their payment for order flow business model;* ***SEC should consider action against claims of best pricing****.*\n\nRep. Barry Loudermilk (GA-11)\n\n[https://youtu.be/imRzHXRq80I?t=10738](https://youtu.be/imRzHXRq80I?t=10738)\n\n*Issues with regulating things further for retail investors; SEC has not indicated any market manipulation; abusive short selling and options trading are highly regulated, SHO.*\n\nRep. Ayanna Pressley (MA-7)\n\n[https://youtu.be/imRzHXRq80I?t=11052](https://youtu.be/imRzHXRq80I?t=11052)\n\n*“Never investing at all is a missed opportunity” -****targeted advertisements by RH****; RH mismanaged risk, not an issue with regulation;* ***retirement accounts always give a cut to WallStreet.***\n\nRep. Alexander Mooney (WV-2)\n\n[https://youtu.be/imRzHXRq80I?t=11361](https://youtu.be/imRzHXRq80I?t=11361)\n\n*SEC would act to protect retail investors, how does SEC do this?; confidence SEC is well equipped to deal with GME issues; SEC already has tools to go after market manipulation, this is a free market, not a rigged market.*\n\nRep. Alma Adams (NC-12)\n\n[https://youtu.be/imRzHXRq80I?t=11654](https://youtu.be/imRzHXRq80I?t=11654)\n\n*Core market structure worked very well, retail investment experience was uneven; Dodd-Frank gives SEC right to forced arbitration*\n\nRep. Warren Davidson (OH-8)\n\n[https://youtu.be/imRzHXRq80I?t=11907](https://youtu.be/imRzHXRq80I?t=11907)\n\n*Blockchain, DTCC status update on Project Ion and Project Whitney; market structure T2 T1 or T0; ppl promising shares to multiple parties; rehypothecation; T1 or T0, SEC cannot do it alone, the bank regulators need to be there because cash is needed; smart contracts.*\n\nRep. Rashida Tlaib (MI-13)\n\n[https://youtu.be/imRzHXRq80I?t=12247](https://youtu.be/imRzHXRq80I?t=12247)\n\n***Well regulated? Absolutely not****.; disclosure almost zero; 8,000 private equity (PE) companies in the US; pension funds at higher risk because we don't require PE to make the same disclosures.*\n\nRep. Ted Budd (NC-13)\n\n[https://youtu.be/imRzHXRq80I?t=12406](https://youtu.be/imRzHXRq80I?t=12406)\n\n*Retail investors are smart and a force to be reckoned with; gamification is not necessarily bad; SEC and best interest; what requirements should SEC review and update?*\n\nRep. Ritchie Torres (NY-15)\n\n[https://youtu.be/imRzHXRq80I?t=12720](https://youtu.be/imRzHXRq80I?t=12720)\n\n*Should payment for order flow be permitted?; prohibit, pass on to customers, or opt out;* ***make sure SEC is adequately funded****, look for regulatory blindspots, amount of shorts, make sure we are enforcing the law; legal limits on abilities of broker; MM arm sharing info with trading arm, there must be a firewall*\n\nRep. David Kustoff (TN-8)\n\n[https://youtu.be/imRzHXRq80I?t=12987](https://youtu.be/imRzHXRq80I?t=12987)\n\n*T+1 would have helped with RH’s margin calls, risk management needs to be adequate; arguments against T+1, operational risk; bank regulators will need to align with T+1 with the SEC*\n\nRep. Jesus “Chuy” Garcia (IL-4)\n\n[https://youtu.be/imRzHXRq80I?t=13316](https://youtu.be/imRzHXRq80I?t=13316)\n\n*Big players have almost no disclosure, Citadels of the world are a big art of shadow banking, lack of oversight, accountability, creates wealth extraction, retail investor gets the worst deal, should have level playing field, discriminated against, transparency, fairness - will increase retail investors; GME incident revealed instability in the financial system; hedge fund shut down during Trump admin.,Yellen should look at hedge fund risk in the system, Citadel should be looked at closely.*\n\nRep. John Rose (TN-6)\n\n[https://youtu.be/imRzHXRq80I?t=13617](https://youtu.be/imRzHXRq80I?t=13617)\n\n*Policy premature, we need information and transparency; FTT would be harmful, knee jerk reaction to events of January; what reforms could create transparency; 605 reports, 606 reports.*\n\nRep. Madeleine Dean (PA-4)\n\n[https://youtu.be/imRzHXRq80I?t=13934](https://youtu.be/imRzHXRq80I?t=13934)\n\n*Mr Tenev struggled to explain his mistakes, what failures or mistakes by RH did you observe?; failed to manage internal risk, not disclosed how they make money; best practices going forward, regulators need to investigate, institutional footprint, gaps in reporting in OTC; eliciting behaviors by their users and encouraging trading to the detriment of the trader.*\n\nRep. William Timmons (SC-4)\n\nhttps://youtu.be/imRzHXRq80I?t=14255\n\n*Roadblocks to T2 to T1; tradeoffs with changing the accredited investor standard.*\n\nRep. Trey Hollingsworth (IN-9)\n\n[https://youtu.be/imRzHXRq80I?t=14598](https://youtu.be/imRzHXRq80I?t=14598)\n\n*Rule 612 (does not apply to dark pools), public investors are restricted to narrowing spread to penny wide, but dark pools spread <penny; most trading happens in the dark, 60-80% happens off exchange; regime of dark pools, no fair access requirement, no stability regulation, we don’t want those regulations to be shifted to dark pools.*\n\nRep. Michael San Nicolas (GU)\n\n[https://youtu.be/imRzHXRq80I?t=14917](https://youtu.be/imRzHXRq80I?t=14917)\n\n*Why we have markets…, “markets exist for us to be able to grow our commerce”, should provide environment for those activities, I was able to find that the short interest was at 150%; how can short selling inhibit raising equity for companies; short positions is now reported twice per month, provides lens into relative activity, need to go upstream, SEC should use Dodd-Frank to increase transparency; upstream disclosure needs to be addressed, and increased disclosure of short activity, expand firms that require disclosure.*\n\nRep Bryan Steil (WI-1)\n\n[https://youtu.be/imRzHXRq80I?t=15239](https://youtu.be/imRzHXRq80I?t=15239)\n\n*T1 feasibility; technology costs have decreased, blockchain, coordination with banks and access to cash; efficient price discovery*\n\nRep. Jake Auchincloss (MA-4)\n\n[https://youtu.be/imRzHXRq80I?t=15553](https://youtu.be/imRzHXRq80I?t=15553)\n\n*Wealth inequality; IPOs have become more rare, fewer Americans able to invest; direct listing, SPACs; SPACs are still private vessels that limit access.*\n\nRep. Anthony Gonzalez (OH-16)\n\n[https://youtu.be/imRzHXRq80I?t=15872](https://youtu.be/imRzHXRq80I?t=15872)\n\n*More access for retail investors, private equity access, closed end funds, what safeguards are there?; RH didn’t have capital, how would have T1 affected that?, stronger capital requirements would have also helped; Tenev said they were in compliance with net capital requirements; SEC requirements aren’t as transparent as they should be;* ***RH account holders, bankruptcy protection****.*\n\nRep. Van Taylor (TX-3)\n\n[https://youtu.be/imRzHXRq80I?t=16198](https://youtu.be/imRzHXRq80I?t=16198)\n\n*Wall Street Journal article, T1 & T2, losing benefit of netting; execution of large trade, broken into chunks, lose ability to net those transactions in T0, every one will need to be looked at.*",
    "title": "TIMESTAMP: Congressional Hearing 3/17/21",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m79s43/timestamp_congressional_hearing_31721/"
}