{
    "author": "realDeegzScotland",
    "created_utc": 1624923328.0,
    "distinguished": null,
    "edited": 1624952824.0,
    "id": "o9w7jg",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o9w7jg",
    "num_comments": 44,
    "permalink": "/r/Superstonk/comments/o9w7jg/discount_of_the_century_gme_is_available_to/",
    "score": 1036,
    "selftext": "I wanted to call this the \"THANKS KEN\" Megathread!!! \n\n\nIt's clear to me that KG drank too much whiskey, and indulged in too much mayo the evening before he dreamed this little beauty up. \n\nThis may in all likelihood become the worst decision ever made in the history of the stock market.\n\nI believe the hype.\n\nI bought X GME.\n\nI saw u/deepfuckingvalue briefing the House Committee.\n\nI've read the DD.\n\nI trust RC&co.\n\nI like the stock.\n\n\n\nI am a happy ape with Diamond Hands.\n\n💎🙌🙌💎\n\nAn ape who is happy to wait for a rocket to the  moon. \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nI have gained wisdom from sh1tposts, and laughed out loud while reading DD about SI%.\n\n\nFinally all that's left for me to do is to thank Ken Griffin for making a play that was so fantastically bad that I will never work another day in my life.\n\nThanks Ken, I'm planning to retire to a banana plantation just south of the equator. I'll spend my free time barbecuing tendies and  sharpening crayons for all the 4&5 year old children of the world, so they can learn maths better than your interns ever did.\n\n\nWe set the floor.\n\nThe 3 commas rule is official.\n\n ( $xx,xxx,xxx,xxx)\n\n\nTDLR; Hegies r fuk!\n\n\nThis is not financial advice. Please seek financial advice from someone is qualified.\n\n1,2,3 everybody\n...... \nThanks Ken!!!",
    "title": "Discount of the century!!! GME is available to purchase on reverse margin, with reverse leverage. For a $213 investment you get $25'000'000 asset. NO RISK (broker is subject to requirements and Market Maker is subject to Margin Call). Offer available for a limited time. \"THE PRICE IS WRONG B1TCH\"",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9w7jg/discount_of_the_century_gme_is_available_to/"
}