{
    "author": "Frotselke",
    "created_utc": 1622706838.0,
    "distinguished": null,
    "edited": 1622787586.0,
    "id": "nr7xsp",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_nr7xsp",
    "num_comments": 321,
    "permalink": "/r/GME/comments/nr7xsp/i_just_realized_why_burry_has_shorted_bet_against/",
    "score": 2484,
    "selftext": "\nEdit: It's said he sold his GME shares.. What if he did not want to be associated with yet another marked crash.. So he sells GME and has 'nothing to do with it anymore' and still profits from the MOASS trough TSLA.\n\nEdit 2: Oh wow so many people share the thought! Thank you for the upvotes! For those messaging me feel free to make/post memes or use this post for making DD (this post is just an 'opinion' bases on another post)\n\n\nSo I saw this post:\n\n[https://www.reddit.com/r/stocks/comments/nr1dkn/beware\\_of\\_what\\_amc\\_shorts\\_are\\_holding/](https://www.reddit.com/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/)\n\nAnd I realized why Dr. Burry bet against TSLA.. It's the most held long stock of the HF. And what happens to it when they need to sell it to pay for GME?\n\nAlso nice to see that on other (more general) subreddits this subject is finally getting attention. Fun to see some reactions of people who have no idea what is going on and see this for the first time while you apes all predicted everything.\n\nUnable to post in Superstonk due to new requirements. (But that's a good thing to prevent shills!)\n\n🚀🚀🚀🚀\n\n(Sorry for grammar, English is not my first language)",
    "title": "I just realized why Burry has shorted (bet against) TSLA... its the most held long stock of Hedgefunds. And guess what HF need to sell to be able to pay for GME... Slowpoke just gained a wrinkle 🚀💎🙌",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/nr7xsp/i_just_realized_why_burry_has_shorted_bet_against/"
}