{
    "author": "THC_Is_Me",
    "created_utc": 1625068920.0,
    "distinguished": null,
    "edited": 1625150250.0,
    "id": "ob0deh",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ob0deh",
    "num_comments": 71,
    "permalink": "/r/Superstonk/comments/ob0deh/firm_of_billionaire_griffin_sells_miami_beach/",
    "score": 809,
    "selftext": "TL:DR Hedgies are Fucked. Buy and Hold. This is not financial advice. If you notice I use the letter I alot, it’s because I JUST LIKE THE STOCK. 😉\n\nhttps://www.bizjournals.com/southflorida/news/2021/06/30/firm-of-billionaire-sells-faena-miami-beach-condo.html\n\nOld news, new information. I google Kenneth Griffin from time to time, just to see if that bastard shows his face in public. Wheres my fucking money, kenneth? It’s been 6 months. [You got time to create synthetic shares, but you dont got my fucking money?](https://youtu.be/ZomwVcGt0LE)\n\nI want to know what he’s doing at all hours of the day, I want to know who he does business with, and how this new information is related to GME. Once he is in prison, I want to know what time he takes a shit, who comes to visit him, how much is his daily intake of mayo. I’m at work, so can’t dive deep into it. Hoping apes can help.\n\n“[**I love you Kenny, we coulda been together, think about it.**](https://youtu.be/gOMhN-hfMtY)\n\nYou ruined it now, I hope you can't sleep and you dream about it.\n\nAnd when you dream I hope you can't sleep and you scream about it.\n\nI hope your conscience eats at you and you can't breathe without me. “ - Eminem\n\n>\tFaena Holdings LLC, formerly known as STHA LLC and linked to Griffin by multiple media reports over the years, sold the 3,889-square-foot Penthouse B in the condominium at 3315 Collins Ave. to **Little Orchid LLC, managed by Christopher Pappas. Bank of America provided a $8.68 million mortgage to the buyer.**\n\nWho is Christopher Pappas? And why is he hard to find? Again, I’m at work so I don’t have time.\n\nOther than selling houses to be able to get more liquidity to avoid a margin call, why would anyone sell at a loss? Illegal dealings?\n\nIs BofA providing the loan to buy Kenny’s home at a loss, to pay Kenny? Isn’t BofA a [bagholder in this](https://reddit.com/r/Superstonk/comments/nsioql/the_complete_bank_of_america_gamestop_dd/)? Would they not be interested in making sure kenny G has enough liquidity?\n\nSEC, please, I beg you, GET THE FUCK UP, stop jacking off AND DO YOUR FUCKING JOBS, CAUSE IT SEEMS LIKE WE’RE DOING IT FOR YOU. I’m not even getting paid for this shit. It’s ridiculous\n\nThe longer this goes on, the more time Kenneth and whoever else is supressing GME, has to create synthetic shares. More synthetic shares, more people will get hurt and lose their jobs, their homes, when the market crashes. REAL PEOPLE WILL GET HURT. THIS IS NOT A FUCKING GAME.\n\nThis is not my fault. YOU ALLOWED NAKED SHORT SELLING, NOT ME. FUCK YOU. How long have you known about naked short selling SEC? Decades? And what have you done about it? Not enough. \n\nGG, didn’t you help [ban the regulation](https://youtu.be/T2IaJwkqgPk?t=5990) of derivatives? Didn’t Obama appoint you? You used to be a Goldman Sachs exec, right?\n\nWasn’t the cause of the 2008 crash due to CDO’s, and CDS’? **A TYPE OF DERIVATIVE?**\n\nMy dad lost his his house because of it. Your hands are far from clean GG. [NINJA loans](https://www.investopedia.com/terms/n/ninja-loan.asp) is what the bankers called it, right?\n\n>\tA NINJA loan is a slang term for a loan extended to a borrower with little or no attempt by the lender to verify the applicant’s ability to repay. It stands for “no income, no job, and no assets.” Whereas most lenders require loan applicants to provide evidence of a stable stream of income or sufficient collateral, a NINJA loan ignores that verification process.\n\nThe same Obama who ran on hope and change, only for [1 banker to go to jail](https://www.nytimes.com/2014/05/04/magazine/only-one-top-banker-jail-financial-crisis.amp.html) for the 2008 financial crisis? Thanks, Obama.\n\nObama, didn't you re-appoint Ben Bernanke as Fed Chair? Doesn't Ben Bernanke [work at Citadel now](https://www.reddit.com/r/Superstonk/comments/nkqofa/financial_crisis_2009_former_fed_chairman_ben/)?\n\n\n>On April 16, 2015, it was announced publicly that Bernanke will work with [Citadel](\nhttps://www.reddit.com/r/Superstonk/comments/nkqofa/financial_crisis_2009_former_fed_chairman_ben/), the $25 billion hedge fund founded by billionaire **Kenneth C. Griffin**, as a senior adviser.[77] In the same month it was revealed that Bernanke would also join Pimco as a senior advisor.[78]\n\nBernanke, DIS YOU? [Writing about the U.S' status as world reserve currency in 2016](https://www.brookings.edu/blog/ben-bernanke/2016/01/07/the-dollars-international-role-an-exorbitant-privilege-2/)? ([Hyperinflation](https://www.reddit.com/r/Superstonk/comments/o4vzau/hyperinflation_is_coming_the_dollar_endgame_part/), anyone?)\n\nSo the Ex-Fed chair Ben Bernanke, starts working at Citadel in 2015, writes about the dollar losing its status as the world reserve currency in 2016 while working at citadel. In u/atobitt [**The Everything Short**](https://reddit.com/r/GME/comments/mgucv2/the_everything_short/) we find out Citadel is shorting treasury bonds. Hmmmmmmm I WONDER WHY.\n\n>\tTL;DR- Citadel and friends have shorted the treasury bond market to oblivion using the repo market. Citadel owns a company called Palafox Trading and uses them to EXCLUSIVELY short & trade treasury securities. Palafox manages one fund for Citadel - the Citadel Global Fixed Income Master Fund LTD. Total assets over $123 BILLION and 80% are owned by offshore investors in the Cayman Islands. Their reverse repo agreements are ENTIRELY rehypothecated and they CANNOT pay off their own repo agreements until someone pays them, first. The ENTIRE global financial economy is modeled after a fractional reserve system that is beginning to experience THE MOTHER OF ALL MARGIN CALLS.\nTHIS is why the DTC and FICC are requiring an increase in SLR deposits. The madness has officially come full circle.\n\nWasn’t Joe Biden VP during that time? Are you blind Joe? I don’t think so. Didn’t you meet with GG, JPOW, and Janet Yellen a [couple weeks ago](https://www.washingtonpost.com/politics/2021/06/21/joe-biden-live-updates/?outputType=amp)? \n\n>Yellen has already been forced to disclose that she has taken [$810,000](https://slate.com/news-and-politics/2021/01/janet-yellen-paid-speeches-citadel-gamestop.html) from **Citadel** in speaking fees. If this is something that seems unusual to you, take a trip on the googles and you will find that there are plenty of people, some of whom have even given Janet jobs in the past, have also given some big money speeches.\n\n>IN FACT - Janet Yellen has earned [$7,200,000](https://www.politico.com/news/2021/01/01/yellen-made-millions-in-wall-street-speeches-453223) in 2019 alone from speaking gigs. Thats half of her [$16,000,000](https://www.google.com/search?q=janet+yellen+net+worth&rlz=1C5CHFA_enUS880US880&oq=janet+yellen+net+worth&aqs=chrome..69i57j0l2j0i22i30j0i390l3.2450j0j4&sourceid=chrome&ie=UTF-8) net worth. You might also notice some familiar names in that donor list. Now why would someone who champions the people, who has already been receiving massive salaries from her federal positions (current salary as secretary of treasury is [$221,400](https://en.wikipedia.org/wiki/United_States_Secretary_of_the_Treasury) a year), need to give speeches to the biggest billionaires in the world for 7 million?\n\n“Discuss climate change”. You think I’m stupid, right Joe? YEAH FUCKING RIGHT BITCH. Why is your administration silent about it? Speak up motherfucker, I can’t hear you.\n\n[Just think apes](https://imgur.com/gallery/rC8F9Qp), imagine the predicament they find themselves in. These corrupt pieces of shit have been taking money from Wall Street to look the other way for DECADES. If I'm mad now when I don't have any power or money, just fucking wait until I do. Wait until the X holders have money.  They are HORRIFIED that they will finally be held accountable.\n\nI found this information on my free time, sometimes while I was high. I never went to college, so I find it HILARIOUS, with all their wealth and their years in University, that they are LOSING, to someone like me. [I know you're a little short on this stock, Bill Gates](https://www.reddit.com/r/Superstonk/comments/o6drqi/bill_gates_gme_interview_in_jan_the_section/). I KNOW you're not the only one. Whats the matter Bill, you afraid of some infinite loss potential? Oh what’s that? You may lose it all? 🤣🤣🤣\n\nBill Gates did not close out his short position, Melvin Capital did not close out their short position, Shitadel did not close out their short position, susquehanna did not close out their short position, point 72 did not close out their short position. Bank of America did not close out their short position.\n\nWe got you by the balls, and I'm loving every second of it.\n\n[Every 1% unemployment goes up, 40,000 people died. Did you know that?](https://youtu.be/0k5aVLi_yhM)\n\nI could be wrong. BUT,IF IM RIGHT, the government is probably telling Reddit to do whatever it can to divert traffic from this post.\n\nIf it’s one thing I’m good at, it’s [putting myself in other peoples shoes](https://youtu.be/wTa14Sui7mw). Perspective is everything.\n\nThat is all. DIAMOND HANDS MOTHERFUCKERS. I WILL HOLD THIS STOCK, TILL DEATH DO US PART.\n\n💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "Firm of billionaire Griffin sells Miami Beach condo at loss for $11M",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/ob0deh/firm_of_billionaire_griffin_sells_miami_beach/"
}