{
    "author": "InvestmentOracle",
    "created_utc": 1625043633.0,
    "distinguished": null,
    "edited": 1625994121.0,
    "id": "oatbcn",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oatbcn",
    "num_comments": 583,
    "permalink": "/r/Superstonk/comments/oatbcn/im_calling_it_now_this_week_is_going_to_end_well/",
    "score": 7378,
    "selftext": "This is complete speculation, please take this all with a grain of salt, and no dates… but…\n\n\nFor those of you that have read the DD about the crypto dividend I’m sure you’ve heard of the ability that it has to absolutely fuck the shorts, [much like it did with Overstock way back when.](https://www.irmagazine.com/technology-social-media/how-overstock-used-blockchain-distribute-its-digital-dividend#:~:text=The%20OSTKO%20token%20represents%20a,liquidation%20rights%20of%20common%20shares.) I won’t be going into the details of how well this would work, there’s other DD on that, or the legal issues surrounding it, which GameStop has covered their ass in concern of this, but I will mention why I think that this week will end amazingly.\n\n\nThe date of the token at nft.gamestop.com is July 14th, which many have pointed out to be Bastille Day, where the citizens of France stormed the military fortress and prison of Bastille, a major turning point in the very french revolution (an uprising very much based on ‘eating the rich’). Technically settlement makes this iffy and they could announce the record date being the 16th which would mean that the moass ends on the 14th, which would also be cool.\n\n\nIf Gamestop is to issue a dividend they are to inform the public at least 10 calendar days in advance of the record date, as per NYSE rules. Let’s pretend for a second that the record date is July 14th.\n\n\nJuly 4th would be the latest that this dividend was to be issued, and today is the earliest. Clearly it won’t be today because [CEO Matt Furlong’s compensation is based on the closing price of June.](https://www.reddit.com/r/Superstonk/comments/o7ek0q/a_lot_of_apes_are_forgetting_about_the_details_of/)\n\n\nJuly 4th looks nice, as Cohen [has tweeted](https://twitter.com/ryancohen/status/1399526466770059268?s=19) flags [a couple of times](https://twitter.com/ryancohen/status/1385989779129503746?s=19), but unfortunately July 4th won’t work either, as it is both a holiday and a Sunday. \n\n\nJuly 3rd won’t work because it’s a Saturday (dividends can’t be announced on a weekend because the SEC office is closed).\n\n\nThis leaves us with July 1st and July 2nd. \n\n\nJuly 1st is a possibility, and maybe that would make sense. Furlong gets fairly paid his shares and July 1st is Canada day which could possibly have been construed from Cohen’s recent Terence and Phillip tweet, but that would be on an odd day and that tweet was better related in that DD about him tweeting shit before GME shits.\n\nNow July 2nd… July 2nd. It’s on a Friday, which is lovely, and it’s the weekend preceding the 4th of July. It would be very hype all on it’s own but you know what really makes me think it’s the perfect day? Remember those American flag tweets?\n\n\n[July 2nd is ‘Made in the USA day’.](https://www.checkiday.com/79893609718e2d80665086187bfda4dd/made-in-the-usa-day)\n\n\nAnd guess what happens if those tweets come out after hours. The first trading day following that is July 6th (the fifth being closed for July 4th’s observance). July 6th being the morning of a Tuesday. A Tuesday morning.\n\n[Now where have I heard that before?](https://www.reddit.com/r/Superstonk/comments/mpyk55/tuesday_morning_it_is_streetview_from_the_store/)\n\n\nTits jacked. *ᴮᵘᵗ ᴵ ᶜᵒᵘˡᵈ ᵇᵉ ᵗᵒᵗᵃˡˡʸ ʷʳᵒⁿᵍ ᵗʰᵒᵘᵍʰ.*\n\n---------------------------------------------------------------------------------\n\nEDIT: Additionally, I think it would be in Gamestop's best interest to do so. This would ensure that all the July 16th options go in the money, so even if it doesn't manage to force all the shorts to cover (which in my opinion it does, but let's pretend it doesn't) and simply introduces a ton of buying pressure, the buying pressure + gamma squeeze from those contracts would send the price of GME far past the point of forced liquidation. The E tee H (why is their a filter for something literally Gamestop related) smart contract is also already in place, and while I don't know if they put in the ability to alter it after the fact, if they didn't then this could ensure no interference with said token. I also think if they were to announce that they are launching an NFT platform they would probably do so in conjunction with the dividend, and a few days in advance, not have it be immediately live. Granted, they could just be launching the token then and all of this is irrelevant, but I choose to believe that the leadership is cooler than that and would like to get this along as soon as possible to actually do work in the company and not be inundated with dealing with all of this naked shorting and moass stuff.\n\n(If you're seeing this twice it's because the post got deleted by the automod for crypto words :/)\n\n\nEDIT 2:\n\n[\"Put on your tinfoil hat and look at RC’s past tweets. On April 24, he posted a pic of an American flag. How many days are there between April 24 and July 2? 69 days.\"](https://www.reddit.com/r/Superstonk/comments/oatbcn/im_calling_it_now_this_week_is_going_to_end_well/h3jiz4j)\n\nI'm going to cum.\n\nEDIT 3: I am not saying Friday's going to trade well btw, just that we might get an announcement friday.\n\n~~EDIT 4: Okay so dividend declaration dates might be able to be done on weekend/holidays? I figured not for SEC filing purposes... however I can't find anything that says that they can't [and some evidence that says that they can...](https://www.reddit.com/r/Superstonk/comments/oatbcn/im_calling_it_now_this_week_is_going_to_end_well/h3l5uxx) if so then July 4th might be the actual date.~~\n\nEDIT 5: From reading [this](https://academic.oup.com/rfs/article/2/4/607/1587121?casa_token=WeDq43HiQqkAAAAA:vlVkPBxiT35evI8B8winiCD8HqjUDSCpK90k1qeK-wFSBX98r9e0xXl5QPez_GvhAFwqd4pUTVsXpg) academic article that studies the timing of when dividends are released and their effect on the market, it implies that dividends can only be released on weekdays.\n\nEDIT 6: https://twitter.com/ryancohen/status/1410398196610723842?s=20 \n\nIf it happens tomorrow I'm going to cum. Send all those options ITM? Yes please Daddy Cohen.\n\nEDIT 7: Lmao.",
    "title": "I'm calling it now. This week is going to end well.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oatbcn/im_calling_it_now_this_week_is_going_to_end_well/"
}