{
    "author": "RoyalMnkyDimondHands",
    "created_utc": 1619635340.0,
    "distinguished": null,
    "edited": 1619635569.0,
    "id": "n0lot8",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_n0lot8",
    "num_comments": 245,
    "permalink": "/r/DDintoGME/comments/n0lot8/unpopular_opinion_am_i_the_only_one_sick_of_all/",
    "score": 526,
    "selftext": "Yeah, sure, you could totally go buy a lambo after payday on this HODLing acct. But, why? You want to be seen as a flashy d-bag burning through your money like the asshats we're highlighting in this fight? \nThis money was taken by manipulating the system and ruining lives. I mean, don't get me wrong, I'm probably going to look at leasing a more reliable car, but, probably something EV related, so I don't profit and immediately go into adding a higher carbon footprint etc. \n\nI think that a lot of people invested in this need to take a step back and evaluate what some of the potential timeline look like for becoming rich. Especially knowing what happens to most lottery winners. \n\nStart doing due dilligence on what's wrong with our food and water supplies and what your diet currently looks like. \n\nAll kinds of things you are over and under eating that are increasing your mortality rate. That's great if you become rich tomorrow, but, maybe look at whether or not you have what it takes to make that money last. Or  if you're going to clock out of life from eating garbage and non of this actually mattered. \n\nLook into why the EPA only spent $4Million towards fighting PFAS/PFOS/GenX/PFBS chemicals in water supplies (last year) when companies have been sued for hundreds of millions in various metropolitan districts across the U.S. the past couple of years. Why there's no maximum contamination level for how much of these chemicals are allowed in the water supplies. \n\nBrainstorm now, what things could you get involved in with community apes to better the lives of people around you. You're probably retiring off of these gains, and if it's super early, think about what purpose you want to live your life by. Are you building and planting vegetable gardens in low income housing areas to make people more self sustainable? Are you helping people to get filtration systems for their water supplies to help battle carcinogens from being consumed in a basic necessity of life. Are you helping to entertain seniors and those in special care facilities and children's hospitals by giving your time. Are you taking the time to learn trades so you can build neighbourhoods in impoverished communities. \n\nAre you looking for a quick cashout to game all day everyday, or are you looking for true systemic change? \n\nI love video games, RC and GameStop have me as a lifer, but, GameStop and RC are branching out of what the company held closely as it's tiny mirrored vision to see the big picture for what could have the biggest impact.\n\nWhat do you see in your big picture?",
    "title": "Unpopular opinion: Am I the only one sick of all the Lambo/frivolous post payday expenses posts?",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n0lot8/unpopular_opinion_am_i_the_only_one_sick_of_all/"
}