{
    "author": "Andromeda_2480",
    "created_utc": 1625913697.0,
    "distinguished": null,
    "edited": 1625919551.0,
    "id": "ohgf57",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ohgf57",
    "num_comments": 32,
    "permalink": "/r/Superstonk/comments/ohgf57/yall_are_killing_me_with_these_amazing_lego_memes/",
    "score": 568,
    "selftext": "Just that, wanted to appreciate and thank you all for putting a smile on me nonstop while I'm scrolling through superstonk. :') \nFunny shit!\nWhat a crazy time to be alive.\n\nSo because I don't have enough text I thought I'd post the perfect cake recipe for these times... An Oreo Earthquake cake!!\n\nThis gooey, rich, delicious Oreo Earthquake Cake is layered with Oreo cookies, chocolate cake, cream cheese, and more chocolate that is an explosion of flavor in every bite!\n\nIngredients (full recipe below)\n\n-Chocolate cake mix\n\n-Oreo cookies\n\n-Cream cheese\n\n-Butter\n\n-Confectioners’ sugar\n\n-Vanilla extract\n\n-Salt\n\nTopping:\n\n-Semi-sweet chocolate chips\n\n-Crumbled Oreo cookies\n\n-Chocolate ice cream–This is optional to add after the cake has been baked, but if you have some chocolate ice cream on hand, I would highly recommend adding a scoop to the dessert!\n\nHow to Make an Oreo Earthquake Cake\n\nThis Earthquake Cake is so easy to make, and just like the name implies, it is bursting with flavor! If you love chocolate cake and cheesecake, you get the best of both desserts in this cake. So, preheat the oven to 350°F, prepare a 9×13-inch pan with non-stick spray, and get out the ingredients you need.\n\n1. First, prepare the chocolate cake batter by following the directions on the box. (But don’t bake the cake.)\n2. Next, layer the bottom of the sprayed pan with the Oreo cookies. Just lay them out flat; no need to break them or crush them for this part. I used 24 Oreos to cover the bottom of the pan.\n3. Then, spread the chocolate cake batter that you just prepared over the layer of Oreo cookies.\n4. Meanwhile, in a large bowl, combine the cream cheese, butter, confectioners’ sugar, vanilla, and salt. Beat with a mixer until combined.\n5. Dollop the cream cheese mixture on top of the cake batter and create a marble swirl.\n6. Sprinkle the chocolate chips and crumbled Oreos for the topping and bake for 55-60 minutes. The cake is done when the center is set.\n7. Serve warm, and don’t forget about adding a scoop of chocolate ice cream on top!\n\nI'm sorry I have no pictures, because I'm on the phone right now. Here is the link tho ;) \n\nhttps://iambaker.net/oreo-earthquake-cake/\n\nEnjoy and have a nice weekend!",
    "title": "Y'all are killing me with these amazing LEGO memes! I'm literally laughing out loud with every post and they get better and funnier! THANK YOU SUPERSTONK RETARDS! ♥️",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/Superstonk/comments/ohgf57/yall_are_killing_me_with_these_amazing_lego_memes/"
}