{
    "author": "Notifyd",
    "created_utc": 1617294028.0,
    "distinguished": null,
    "edited": 1617321188.0,
    "id": "mhyv94",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mhyv94",
    "num_comments": 288,
    "permalink": "/r/GME/comments/mhyv94/connecting_the_puzzle_pieces_the_failed_bet/",
    "score": 2047,
    "selftext": "**TL;DR: I will TL;DR this as best as I can. Adding this because people don't want to read. Citadel has been moving to Texas since 2019. They moved right next to some big players in the game. These data centers were setup to hide the more sophisticated Citadel scheme (albeit relatedly structured) involving shorts, FTDs, and moving capital around to make their assets and positions appear larger than they materially are. There are more players in this game than we think. This has been going on for too long. It's only a matter of time before someone lets go.**\n\nTo start things off, I am in no shape or form taking credit for any of this. This is collection of comments and posts that I wanted to create some sort of sense with. Everything in this post can be found in comments across all the posts. For the longest time I couldn't figure out how all of these posts connected:\n\n[The Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/)\n\n[61727054 Says Ken is Next](https://www.reddit.com/r/GME/comments/mg437h/61727054_says_ken_is_next/)\n\n[Theory: Gamestop was in the process of going bankrupt, JP Morgan, Goldman Sachs and Melvin were in the process of profiting from inside information obtained from GME real estate division.](https://www.reddit.com/r/wallstreetbets/comments/lol283/theory_gamestop_was_in_the_process_of_going/)\n\nAnd more. Too many to list here but feel free to leave them in the reply and I will add them.\n\nWhat didn't make sense to me at first was why UT (University of Texas at Austin) was being investigated by the FBI for possible data breaches and how it was being used by outside parties for input on the United States. But then it clicked. UT if you don't know has connections to some of the largest MMs, institutions, and companies out there. One of their literal [\"friends of computer science\"](https://www.cs.utexas.edu/industry/focs/partners) like they call it so happens to be Citadel and friends. What other friends?\n\n- Citadel\n- Jane Street\n- Goldman Sachs\n- Hudson River Trading\n- First Trust Portfolios\n\nJust to name a few. Now I am not saying they are all involved but you can see why the computer science department would be such a target for third parties ;)\n\nNow put on your tinfoil hats because this is about to get interesting.\nWithin the computer science department there is a terminal. Theory is that the terminal is available to UT students and alumni to gain access and data to Citadel and friends. So now you understand why it would be used by third parties. Well in the case of this, it was used by a third party to figure out exactly what Citadel and friends are up to.\n\nBack in 2019, Citadel showed up to Texas and they were hunting for real estate. Moving operations to Austin (or having a datacenter there) is disadvantageous in the field of nanosecond trading; NYSE is a preferred base of operations... so why?\nFor those of you who don't believe me:\n\n[Link 1](https://www.fastcompany.com/90444414/ken-griffins-citadel-securities-is-opening-an-office-in-austin-yes-austin)\n\n[Link 2](https://www.businesswire.com/news/home/20191218005068/en/Citadel-Securities-Opens-New-Office-in-Austin-Texas)\n\nAs [u/your_grammers_bad](https://www.reddit.com/user/your_grammars_bad/) pointed out\n> ..but the reason for moving to Texas might be one of the \"tells\" of the crime - less aggressive or knowledgeable prosecutors (NY has robust financial policing in place, TX less so; TX also has an AG under serious investigation for corruption), but under the guise of lower taxes.\n\nAnd guess where the offices were opened? Congress Ave and Sixth St. right on the corner. Guess who else is on Congress Ave....if you guessed Morgan Stanley (DING DING DING)\n\nNow why would so many MMs, HFs, and big bois have data centers on the same block or in such close proximity? Dark pools and trading amongst each other. These data centers were setup to hide the more sophisticated Citadel scheme (albeit relatedly structured) involving shorts, FTDs, and moving capital around to make their assets and positions appear larger than they materially are.\n\nGuess who just liquidated almost $10 billion? Morgan Stanley.\nGuess why they liquidated? Of course it had to with the margin call but for Citadel & co-conspirators, executing this scheme requires leverage and/or a base amount of cash for all parties to keep playing. But that leverage looks like it's drying up...\n\n&nbsp;\n&nbsp;\n\nNow let's put a tin foil on top of the tin foil we already have because this is about to get a whole lot fucking deeper.\n\n>The governor of NJ ( the location of many major exchanges data centers) is Phil Murphy. Phil Murphy is seriously considering a tax on trades which would net them 10 billion annually. In order to escape this tax, many exchanges are demonstrating their ability to move to other locations. They recently met with gov. of Texas who is a UT grad, and OP mentions alumni networks, and UT was investigated for COVID reasons. Back to Murphy. Murphy is an ex-Goldman Sachs executive - possible connection during his time there he was president of Goldman Sachs Asia, and his state was hit particularly hard by COVID, this is why he says he wants to consider the tax. Could these hedge funds have been cooking the books during the chaos and lightened regulation/concern during COVID and plan on fudging all the numbers during the movement of the data centers and making it all disappear?\n\nYes. This was supposed to be the biggest theft in the history of all fucking thefts. Do you get it now? COVID was the perfect time to prop up the economy and cook the books because of the SLR rules not in effect. Papa JPow isn't gonna check their books until COVID was over and they thought COVID was gonna drag onto next year if not more but they were wrong. Vaccines came. COVID is being fought. And guess what expired yesterday???? The SLR exemption so they can no longer hide their dirty secrets.\n\n---\n\nIt all started with an idea to bankrupt GameStop and take their real estate. The idea was simple, short it to the ground like they have done countless times to other companies. Company goes bankrupt, they don't have to pay for cover, more billions put into their pocket, etc.\n\nWhat was the plan? \n\nCredit to [u/jaa1818](https://www.reddit.com/user/jaa1818)\n> A few names that come to mind are Ivan Boesky, Michael Milken, and the investment bank Drexel Burnham Lambert. Boesky was busted for insider trading as he would buy a stake in a company that was on the verge of a merger or acquisition, and sell once the announcement caused the stock to rise. He was labeled a market manipulator and collaborated with Milken and his investment bank, Drexel Burnham Lambert. Milken was the junk bond king and would use these junk bonds to finance M&A’s. Essentially they would prepare an M&A, get in early, announce, and sell when the price spiked while also making money on the bond fees. When it all came tumbling down the Insider Trading Act of 1988 was passed.\n\n> So what does this have to do with Kenny. Not sure but I’m going to speculate. We know Ken likes to manipulate the market, we know he likes to short companies into the ground, and we know he’s definitely capable of issuing junk bonds. I remember a while back another ape pointing out a connection between him and the exited CFO of GME, Jim Bell. I can’t find the link to the original post so if I do I will link it. For being a CFO, Jim isn’t very good at managing finances and has a back for being in the seat come bankruptcy time. Coldwater Creek - Bankrupt 2014. P.F. Chang’s - basically bankrupt and sold to investment firms 2019. Then come GME, sure fire for bankruptcy. Seems like Kenny and Jim are doing the reverse of Boesky and Milken. Find a target, short the shit out of it, install an insider to ensure its collapse, collect tax free profits and golden parachutes. All out in the open.\n\nAnd then it happened....\n\nRC notices some funkiness and gets his peeps looking into it. THEY see the DTC missing link and find the smoking gun. Mr. Royal Crown realizes that GameStop still has value, but they are tanking it.\n\nHe buys stock then sends a threatening letter to the board that they are being negligent in allowing this to happen. This is him laying his legal framework to ensure he ends up in control of the cards.\n\nThen, January. I think that January was a test by the whales. They didn’t expect it to moon; they expected it to get shut down, but this allowed them to figure out who the rotten culprits were by seeing who bled the most.\n\nIt also allowed for a ton of publicity that the shorts were not quite prepared for. This lead to the mistakes with the media posting things too early, etc, because it was a frantic rush to get ahead of it.\n\nI think that this last earnings call was a catalyst because it was their deadline to put the nail in the coffin. If it had all worked out, they would’ve had the company report massive losses from the quarter, and it would’ve sealed the deal.\n\nNow, they are frantically trying to get ahead of the tumbling dominoes, and they are starting to crumble because of the single fact that GameStop didn’t crumble before this earnings report.\n\nSomehow Morgan Stanley and Shitadel are in bed together; Shitadel hemorrhaging money is a threat to them as well. Perhaps there is another company that MS was doing the same with, and exposing one exposes them both?\n\nAt this point it's not only Citadel is who shitting themself but there are others.\n\n---\nSo what do we do?\nNothing. Just hold. We watch as he continues to make more mistakes. The HFs that have folded and the ones that will be folding in the next couple of weeks aren’t doing so because they’ve gone broke, they’re getting the fuck out of dodge.\n\n“Hey SEC, we can’t be charged or fined because we’re no longer in operation. So anything that you find on us won’t apply and any information that we have we will happy turn over.”\n\nThere will be a catalyst that will blow the roof off and burn these fuckers once and for all. It starts with C ends with O. If this announcement happens and it is who we think it is (not RC), then Citadel and friends are fucked. Look at the board. Look where they came from and their previous positions. Take a guess what the next announcement will be.\n\nAnd for those who think that the economy will collapse and we all become poor overnight. Do you really think that the US government would have pushed that Infrastructure plan if there were any thought that the US economy would be on the verge of collapse because of 1 stock? No. Citadel and others will be made an example. This is just another page in the history books. Give money to the right people (retail), prop up the economy and everything will be fine.\n\nWanted to add another final note here. Look what DFV is posting. Someone is about to let go? Someone who is helping someone is about to let fucking go. Take a guess. I love you all.\n\nHere are the tweets apes\n\n[Tweet #1](https://twitter.com/TheRoaringKitty/status/1377667081223737352?s=20)\n\n[Tweet #2](https://twitter.com/TheRoaringKitty/status/1377651971977404418?s=20)\n\n[Tweet #3](https://twitter.com/TheRoaringKitty/status/1377636875020726272?s=20)\n\n[Tweet #4](https://twitter.com/TheRoaringKitty/status/1377621784523010048?s=20)",
    "title": "Connecting the puzzle pieces. The failed bet.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhyv94/connecting_the_puzzle_pieces_the_failed_bet/"
}