{
    "author": "lighthouse30130",
    "created_utc": 1617288600.0,
    "distinguished": null,
    "edited": 1617288794.0,
    "id": "mhwxtk",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mhwxtk",
    "num_comments": 199,
    "permalink": "/r/GME/comments/mhwxtk/the_sec_knows_since_2013_that_hedge_fund_can_hide/",
    "score": 4923,
    "selftext": "# The only way to appear as if the Hedge Fund covered their short is with deep ITM calls option.\n\nMy DD is a follow-up on THE DD of the week made by:  u/dejf2  \n   [The SI% is fake. I found 44,000,000 million shorts that had their FTDs reset since January 1st using DEEP ITM CALLS. Identifying call option types used for this practice and timeline of events.](https://www.reddit.com/r/GME/comments/mhv22h/the_si_is_fake_i_found_44000000_million_shorts/)\n\n&#x200B;\n\nHOW? It is really well explained in this article: [THE DROP IN GAMESTOP SHORT INTEREST COULD BE REAL — OR DECEPTIVE MARKET MANIPULATION](https://tradesmithdaily.com/investing-strategies/the-drop-in-gamestop-short-interest-could-be-real-or-deceptive-market-manipulation/)\n\n# Here's a summary of how this is possible\n\n* If short sellers are facing a squeeze because shares are hard to buy, or scrutiny for holding an illegal short position, they can create an appearance of having closed their short position through the use of deceptive options trades.\n* A hedge fund that is short a stock can write call options on a stock — meaning they are now “short” the call options, having sold the call options to someone else (typically a market maker) — and simultaneously buy shares against the call options.\n* The shares bought against the call options could be “synthetic” longs — meaning they are not part of the original share float of the stock — as sold to the hedge fund by the market maker that takes the other side of the options trade.\n* This works because, if a market maker buys options from an options writer, the market maker has legal privileges to do a version of “naked shorting” as part of their hedging function. This is necessary, under the current rules and the current system, for market makers to protect themselves when facilitating options trades.\n* As a result of the above transaction, the hedge fund that sold short calls was able to buy synthetic long shares against the calls. (A synthetic share is one that has a long on one side and a short on the other but wasn’t part of the original float.) The synthetic long shares are the other side of the naked shorts, legally initiated by the market maker, so the market maker can hedge.\n* The hedge fund that bought the shares can now report that they have “bought back” their short position via buying long shares — except they actually haven’t! The synthetic shares they bought are canceled out against the short call positions they initiated, a necessity of the maneuver by way of the market maker’s hedging of the call position they bought from the hedge fund.\n\n&#x200B;\n\n# The tactics involved are not a secret. In fact, the Securities and Exchange Commission (SEC) knows all about such tactics, and published a “risk alert” memo on the topic in August 2013.\n\n&#x200B;\n\nHERE IS A LINK TO THE SEC MEMO from 2013 \"[Strengthening Practices for Preventing and Detecting Illegal Options Trading Used to Reset Reg SHO Close-out Obligations \"](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf)\n\n&#x200B;\n\nI read the memo, very interesting, but it does not say much about how we/they can do against this practice. However, on the last page, it says:\n\n\"This options trading activity poses regulatory and reputational risks for broker-dealers and their correspondent clearing firms. The criteria and techniques listed above could be helpful in protecting a broker-dealer or clearing firm from these risks. If you believe that this activity is occurring with customers at your brokerage or your trading firm, or if you have seen this activity occurring on your exchange, please feel free to contact the Commission Tip line at the address below.\n\n[http://www.sec.gov/complaint/info\\_tipscomplaint.shtml](http://www.sec.gov/complaint/info_tipscomplaint.shtml)\n\n&#x200B;\n\n# MY CONCLUSION IS THAT ALL APES WE NEED TO SUBMIT THIS TO THE SEC.\n\n&#x200B;\n\nWhat do you guys think?",
    "title": "THE SEC KNOWS SINCE 2013 THAT HEDGE FUND CAN HIDE THEIR SHORT IN ITM CALLS - WE NEED TO TELL THEM THIS IS WHAT HAPPENING WITH GME",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhwxtk/the_sec_knows_since_2013_that_hedge_fund_can_hide/"
}