{
    "author": "pinkcatsonacid",
    "created_utc": 1617286205.0,
    "distinguished": null,
    "edited": 1617379812.0,
    "id": "mhw44x",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mhw44x",
    "num_comments": 589,
    "permalink": "/r/GME/comments/mhw44x/wondering_where_tf_the_sec_is_the_financial/",
    "score": 6928,
    "selftext": "DISCLAIMER: POLITICS ARE DISCUSSED, BUT ONLY ON AN UNBIASED, FACTUAL LEVEL. NO PARTISAN POLITICS HERE! I’m even leaving some details out to avoid saying certain names to trigger argument or auto mod. Anyways...\n\nI haven’t seen this talked about anywhere so I want to make sure apes are aware of what’s going on on a Federal level right now in the USA. We’re all wondering where the actual FUCK the SEC is in all this, and I think I may have found a clue. \n\nTreasury Secretary Janet Yellen called a random ass [meeting of the minds](https://home.treasury.gov/policy-issues/financial-markets-financial-institutions-and-fiscal-service/fsoc/council-meetings) yesterday in the form of the Financial Stability Oversight Council (FSOC) which was established in 2010. [List of members in attendance](https://www.reddit.com/r/GME/comments/min0gb/the_holders_of_the_boss_key_wondering_who_is_at/?utm_medium=android_app&utm_source=share) I’m not getting out in the weeds with technicals here, that’s what these other smart apes are here for. Just know that this group, a panel that consists of top regulators from SEC, Fed Reserve, NYSE, and Big Brother alphabet forces... has been tasked with **Policing Wall Street Behavior that has the potential to crash the entire economy.** *This is not a new statement, but it is relevant to why it was revived.* \n\nNow, the mainstream media keeps saying that the focus of this meeting was [climate change](https://www.politico.com/news/2021/03/31/yellen-climate-change-fsoc-478769) (insert eye roll for buzzwords- it’s also carefully worded to say a market crash could be caused by the aftermath of the pandemic) but some interesting things have developed from it. Jerome Powell, the Fed Reserve Chair (the guy that makes the money printer go brrrrr) has “presided over the formation of 2 internal committees on “climate risk”- one on issues of relevance to bank examiners, and *the other on potential risks posed to the stability of the entire financial system*, the type that’s of most interest to FSOC.\n\nNow, the good shit... The climate change part was an open meeting. But the meeting’s agenda included a [closed door deliberation](https://www.bloomberg.com/news/articles/2021-03-31/yellen-signals-scrutinizing-hedge-funds-is-a-renewed-fsoc-focus-kmxuj4hu) on open end mutual funds and hedge fund activities. Janet Yellen said she is re-establishing the “Hedge Fund Working Group”- a ~~Pres. O~~ era team of high officials within the council that will *scrutinize hedge funds in particular*, and will also look at ways of making funding markets that serve as the lifeblood of the financial sector more resilient. THE LAST TIME THIS GROUP MET WAS IN 2016.\n\n[Here's the press release ](https://s.wsj.net/public/resources/documents/TreasuryStatement.pdf)\n\nAlso of note from the document: \n\nThe group received an updated presentation from the Office of Financial Research about Hedge Fund activities. So they got to sit through a hedgie slideshow of fuckery. (Do you think any of our DDs made it on a slide? 🧐😂)\n\n**“The council also discussed recent market developments related to hedge fund activities”**\n\n“Chairperson Yellen asked interagency staff to assess potential financial stability risks associated with open-end funds, particularly focusing on **LIQUIDITY RISKS**.”\n\n\nSo, why am I posting this here? What does this have to do with GME? Well, nothing directly. At least, not as presented. First of all, words have meaning in a legal document, every single one. And I noticed a few little blips that refer to CURRENT MARKET FUCKERY BEING INVESTIGATED. I know the press is covering this meeting as just another day at the office for Yellen, but IT HASN’T MET SINCE 2016. WHY NOW?!?! *political speculation gets involved here and thats not what this post is about. I'm not saying it's directly because of GME, but it sure seems to be a sudden priority in a notoriously slow responding gov't*\n\nDo the cops release details when they’re investigating a murder? No. Then the murderer might destroy the weapon and flee the country, maybe even burn down the neighborhood while he’s at it. You don’t show your hand at the poker table til the dealing’s done. \n\nMy opinion as a crayon smoking apette? I think the Everything Short DD was spot on. I think Michael Burry has been trying to warn us for 18+ months that it’s imminent... and I think the US government is trying to get ahead of a fucking speeding freight train headed directly for our $USD. They have every reason to stop this cancer before it fully penetrates and evaporates US treasury bonds. I think they’ve known since pre-January squeeze that this was inevitable, but our little diamond hands on our GME just forced their hand. THIS IS NOT RETAIL INVESTOR’S FAULT. We didn’t create this, and we aren’t responsible for the resulting explosion just because we are the ones that exposed the fuckery! We are individual investors with individual reasons for liking the stock. \n\nBut boy, oh boy do I like it more every day. \n\n💎🙌🏼🚀\n\nTL;DR: Remember❗Hedgies aren't just shorting GME to oblivion. They've been doing this to US Treasury Bonds. Particularly 10 year ones. If that implodes, then the government can no longer guarantee the value of its own dollar, because those \"insurance policies\" i.e. US bonds are worthless=Dollar go boom 💥 Treasury Secretary Yellen called a meeting to seemingly stop that boom.",
    "title": "Wondering where tf the SEC is? The Financial Stability Oversight Council met yesterday, including the HEDGE FUND WORKING GROUP, and why I think it confirms the Everything Short DD.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhw44x/wondering_where_tf_the_sec_is_the_financial/"
}