{
    "author": "apewithabrain1",
    "created_utc": 1626200161.0,
    "distinguished": null,
    "edited": false,
    "id": "ojlfww",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ojlfww",
    "num_comments": 436,
    "permalink": "/r/Superstonk/comments/ojlfww/shfs_are_trying_to_lose_in_a_blaze_of_glory/",
    "score": 4402,
    "selftext": "I believe what we have witnessed since the $344.66 peak on June 8th has been an effort to purposely lose. The SHFs tested the diamond hands on that $344 runup and knew they could not win. There was minimal selling against a mountain of shares that needed to be covered. The SHFs then embarked on the 'ol too-big-to-fail mission to tank the price while they literally unwinded every other \"media named meme\" stock with a large short position.\n\nThe goal was never to win with this strategy. It was to create a truly unwinnable position in GME that will require government intervention. It's likely hedged against a giant market collapse as well. It would not shock me if the DTCC themselves are pulling the strings here.\n\nHere are the factors that have me thinking like this:\n\n* All of the rule changes to protect themselves from SHFs defaulting.\n* All of those netting accounts by the banks.\n* Banks issuing lots of bonds for extra cash readying for the firesale and/or SHFs defaulting.\n* The Reverse Repo record highs looking like collateral to hold some pieces from falling too soon.\n* Weird tickers pumping and dumping almost all seem connected to the SHFs\n* No aggressive buying of GME from hedge funds. It's not just apes that have seen the DD in this sub. These hedge funds/whales appeared to be active in Feb-May, but now are not interested in adding shares as the price has tanked? Are they being ordered to stand down while this shit show unwinds? Is this why so much of the price action is being routed to the dark pools? (ie hedge fund purchases are being denied)\n* Market bleed days where 95% of the market is red. Is this the tax that is being accrued to handle the \"settlement\" of GME?\n* Markets themselves are at all-time highs, but more and more articles are suggesting bubbles and correction coming. As banks report the next few days, is this the catalyst to tank everything for some extra dollars to attempt to resolve GME?\n\nand the biggest confirmation bias I see right now is every \"media named meme\" stock (except GME) has been allowed to run (massive volume and price ascension) in June. Consider:\n\nOld phone / 5G now stock - Massive volume today and also June 2nd and June 3rd\n\nOld phone/autos now stock - June 2nd to June 9th massive volume.\n\nMovie Stock - May 26th to June 23rd massive volume. Price rise from $12.08 on May 21st to a peak of $72.62 on June 2nd.\n\nHousehold brick store stock - June 2nd, June 3rd, and June 29th massive volume.\n\nIMO, the bad guys bought themselves enough time to unwind safely in the \"meme\" stocks EXCEPT for GME. GME was always different because of the float, great leadership, and the diehards of this sub. GME (the stock) is a must-buy even without the MOASS for anyone paying attention. The SHFs have thrown in the towel attempting to win this battle. In fact, they are behaving irrationally trying to drive the price even further into the ground in an effort to make the explosive impact even greater.\n\nIMO, MOASS is certain. How much we get paid might be a question as the assholes in charge have never played fair.\n\nBelieve in Ryan Cohen. Believe in DFV. Believe in your fellow apes. and just buy and hold. And close the ticker if it upsets you. We got this in spades.",
    "title": "SHFs are TRYING to LOSE in a blaze of glory.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojlfww/shfs_are_trying_to_lose_in_a_blaze_of_glory/"
}