{
    "author": "GrilledCheeseNScotch",
    "created_utc": 1624078305.0,
    "distinguished": null,
    "edited": false,
    "id": "o38hiv",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o38hiv",
    "num_comments": 37,
    "permalink": "/r/Superstonk/comments/o38hiv/the_big_picture_data_dump_trading_the_float_and/",
    "score": 601,
    "selftext": "Pt 1. Trading the float.\n\nhttps://preview.redd.it/xyum51i9c5671.png?width=632&format=png&auto=webp&s=90360292ba5ee1b839e61dd83c3da8e8022c5615\n\nUsing a float of 60 million across the board GME has traded it's float or more 18 times in the past year. I spent 10 minutes looking through other stocks including TSLA that experienced squeezes and found only 1 other stock that has traded it's float. AMC on the 25th 26th and 27th.\n\nGME traded it in October of last year a few times in January and a few times since. If we start the period in October which is the first time this happened we get 11.25% we have traded the float over 10% of trading days since October. This so called relatively rare event happens to us all the time I guess we must be special.\n\nhttps://preview.redd.it/csesmn8hc5671.png?width=547&format=png&auto=webp&s=d90115a2a1dd04656655adedfe5327f0de6d6034\n\nFrom here we can make a simple deduction either retail is trading the float all the time or we're not. All indication shows that GME retailers have been buying, holding, and adding to their positions since January. Our sentiment here shows that, our low volume and volatility shows that, and the vote count shows that. Pump and dumps on wallstreetbets don't come close to trading the float so the likely hood that we the originators of diamond hands are somehow regularly trading all our shares and buying them back sometimes multiple times in 1 day is obviously ludicrous.\n\nHowever the conformation bias confirming answer of hedgie fucker in the form of selling fake shares and/or selling shares back and forth with each other lines up perfectly especially with so many of days the float was traded being or touching the 25th of the month aka FTD party day.\n\nOne affirmative statement is clear someone is selling shares that don't exist or selling and buying all the shares they have several times a day and if it's not us then who?\n\nAny claim that the hedgies have covered or are covering is like saying my neighbors house is on fire but hes putting it out. And when you look out the window you see him with a flame thrower actively spreading more fire across his house.\n\nLet me emphasis to make this crystal clear on January 22nd 2021 retailers either bought and sold all the shares that exist 4 times or someone printed 100's of millions of fake shares, forget for a moment hiding short interest in options and FTD cycles because the volume speaks volumes.\n\nThis is a chart overlaying daily return (red) with volume (blue) you can look at the bottom left line 50,000,000 for an approximate gauge of being in trading the float territory.\n\nhttps://preview.redd.it/gtgqrqqsf5671.png?width=1222&format=png&auto=webp&s=07c75908f0d45fe50c91df9223bb906e079e3f73\n\nWhat's important to know is that the second the fake share tap turned of and they couldn't meet the demand with supply we had our test launch hitting just under 500 dollars. The way they stopped the demand problem was by stopping trading possibly because they did not want to continue creating fake shares or were unable to and only did it in the first place because they were blindsided and needed to act with urgency.\n\nhttps://preview.redd.it/hsrlgn6ng5671.png?width=1353&format=png&auto=webp&s=12e1837ddcb196a145d791768885039443414116\n\nPt 2. Data Dump.\n\nWe've gone up 122 days an average of 3.83%\n\nWe've gone down 137 days and average of -3.04%\n\nOn average we go up, we go down more often but when we go up we go up more.\n\nhttps://preview.redd.it/n839llwvh5671.png?width=687&format=png&auto=webp&s=c20e0c4d1bd556ea032ffe05e1103f081fdb1949\n\nThese our are daily distribution of returns, to read this look at 0.1 in the bin column you can see 101 days we have gone up between 0-10% and have done this 38.85% of days,\n\nhttps://preview.redd.it/s02zc9iuh5671.png?width=501&format=png&auto=webp&s=148e2d0d0502f72be2ab3d770136fe4594dc9b90\n\nThis is a visual representation of the data.\n\nYou can see our positive has chunkier tails meaning we more often go up significantly which compounds as its % based.\n\nhttps://preview.redd.it/9rsxvo8di5671.png?width=964&format=png&auto=webp&s=b83a36273a9c42e5a20b898dc37189f5f51d27ee\n\nSeeing the data in this format is very nice it eliminates all the emotional feelings of insanely volatile feeling days and long periods of monotonous sideways trading. We are steadily rising and ignoring any new DTCC rules, Ryan Cohen, or macro economic factors. We are rising maintaining rising maintaining so on and so forth. Any of the above factors could push us along exponentially as we all know. But the important thing is they are slowly losing the battle without any of those factors.\n\n&#x200B;\n\nPt 3. Ken's no no zone.\n\n&#x200B;\n\nWill be updated tomorrow I accidentally hit back and lost my whole post and had to retype everything and am tired. Other changes may also be made to other sections, things may be expanded upon.\n\nPlease share thoughts, critiques, ect. I'm more of data nerd if anyone wants to collab I know my way around a spread sheet and do a lot of reading, let me know what you're thinking.\n\n&#x200B;\n\nIf you need something to jack your tits to.\n\n[https://www.youtube.com/watch?v=HCfVvnF9GOA&t=1s](https://www.youtube.com/watch?v=HCfVvnF9GOA&t=1s)",
    "title": "The big picture. Data dump, trading the float, and Ken's no no zone.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o38hiv/the_big_picture_data_dump_trading_the_float_and/"
}