{
    "author": "SaintHakop",
    "created_utc": 1624043617.0,
    "distinguished": null,
    "edited": 1624456376.0,
    "id": "o2xu9l",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o2xu9l",
    "num_comments": 319,
    "permalink": "/r/Superstonk/comments/o2xu9l/using_nyse_presidents_words_retail_owns_over/",
    "score": 3804,
    "selftext": "Yesterday, an article came out where the NYSE President stated that “price formation (of GME etc.) is not really reflective of what supply and demand is.” In any case that you haven’t seen it yet you can find it [here.](https://mobile.reuters.com/article/amp/idUSKCN2DS2IJ)\n\nHowever, one other quote in the article stood out to me:\n\n“In meme stocks, individual traders contribute as much as 70% of the volume, Cunningham said.”\n\nWhile I am skeptical about this number… LET’S PRETEND, just for a second, that institutions follow the rules and report dark pool/off exchange volume and Pres is telling the truth. I know this is difficult to do, but if THEIR information only further proves our point… then it’ll only show how immensely fucked they are. \n\nIn fact, let’s use this percentage to compare to yesterday’s data to see if it’s possibly correct. PLEASE KEEP IN MIND THIS IS AN ESTIMATE. If enough people request exact numbers I can do that too. This is also assuming EVERY bit of not individual volume is a sell order, so if this turns in our favor that would be really ridiculous… \n\nIf 70% is our base - \n\nYesterday’s Volume ~ 5 million\n70% is ~3.5 million\n\nWe will use the 3-1 buy ratio from Fidelity order information as individual average\n\nConsidering we were barely green yesterday… that doesn’t seem far off… this only supports the conclusion that “institutions are no longer able to consistently drive the price down and are just matching orders to keep it stagnant day to day… presumably saving any hits they can muster for rainier days.”\n\nNow I know the daily [BUY VS SELL ORDERS ON FIDELITY](https://eresearch.fidelity.com/eresearch/gotoBL/fidelityTopOrders.jhtml) have been brought up before and can be controversial. While it has consistently shown a higher number of buy orders than sell orders (typically at least 2.5x, today it’s 4x), these statistics have never been able to show exactly how many shares have been accumulated by individual investors… until now… maybe lol \n\nAccording to \n[barchart,](https://www.barchart.com/stocks/quotes/GME/technical-analysis) GME’s average daily volume for the last 100 days has been 21 million, but honestly that seems so fucking high I don’t even want to touch it. Average volume for the last 50 days has been 8 million, but I want to be EVEN more conservative than that.\n\nI am going to pretend that the daily average volume for the last 6 months has ONLY BEEN 3 million.\n\nAGAIN, Fidelity’s order statistics have CLEARLY shown it’s users are bullish on GME - Showing 2.5:1 Buy:Sell on bad days and while Fidelity doesn’t account for everybody it holds a significant share of retail volume. So we’ll use it as our reference, NO ACTUALLY, we’ll be MORE CONSERVATIVE. LET’S MAKE IT 2:1 BECAUSE THAT’S HOW FUCKED THEY ARE.\n\nDaily Average Volume: 3 Million\n- Retail Daily Volume: 2.1 Million\n- RETAIL BUY:SELL RATIO: 2:1\n\nYou’re telling me, individual investors have been holding onto 750,000+ more shares than they’ve been selling everyday?? Where the fuck are these shares coming from? That means it would take a month and a half to reach the total available float… and it’s been six. Based on these numbers, which I consider fucking GENEROUS to a bearish case on GME… Retail would still manage to own over 100,000,000 shares of a company that in it’s lifetime has only issued 75 million shares (of which only ~30 million are available for purchase by retail).\n\nNo conspiracy, no nothing, just the words of the NYSE President and me counting on my fingers. Hedgies. are. fucked.\n\nEDIT: I have a legitimate question. If a retail investor buys a share and an institution sells them said share, would that count as individual investor volume % or institutional volume %? Again, since Fidelity order stats show a significant number of more orders bought than sold, the conclusion we would still end up drawing is “where are these shares coming from?” Since volume is indicative of more shares being purchased than exist. Still, I want to know.",
    "title": "USING NYSE PRESIDENT’S WORDS - RETAIL OWNS OVER 120,000,000 SHARES - BASIC MATH 🧮",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2xu9l/using_nyse_presidents_words_retail_owns_over/"
}