{
    "author": "R3AL1Z3",
    "created_utc": 1622713977.0,
    "distinguished": null,
    "edited": 1622714072.0,
    "id": "nr9ndn",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nr9ndn",
    "num_comments": 539,
    "permalink": "/r/Superstonk/comments/nr9ndn/please_reconsider_going_to_the_shareholder/",
    "score": 6188,
    "selftext": "Yeahhhhh the closer we get to this thing the more concerned I get….\n\nWithout a doubt, I’m confident when I say that the GME Saga has been a wild ride and a SIGNIFICANT part of almost all of our lives for the last 6 months;\nmaybe more, maybe less. From start to its eventual finish, this is single-handedly the most monetarily impactful, super villain levels of corruption, world awakening event in the history of finance. It’s fucking EXHILARATING and the chance that a lot of us will become multi-millionaires is so strong we can TASTE it. I’m talking A5 Wagyu levels of rich. \n\nThat being said, and at the risk of getting a decent amount of hate for saying this; I don’t think some of you understand the idea that if you go, you’re not just representing yourself but ALL of us here at Super Stonk. Presumably, this will be your first legitimate meeting and, honestly I mean no offense, not only are you not going to look as good as you think you do but if they even DO let any of you in…you’re going to really see how smooth your fuckin’ brain is being in a room with people who all know what they’re talking about. Not only that, what are you really going to add to the meeting? I get it, you want to be a part of history and have a story that your family will tell for GENERATIONS. Here’s the thing, you’re already a part of history, right now!\n\n\nYou read the DDs, you bought, held ,and voted, you are about to see more zeros in one place than a Waifu pillow convention. Why go when, not only do we all know shit is absolutely FUCKED with the share count, but, they’ve sent a release stating the duration of the meeting will be 15 minutes. \n\n#15 MINUTES\n\nFifteen whole minutes. \n\nYou’ll do nothing but waste GameStops time doing whatever it is you’re going to do when you eventually get in, because there’s 100s of us retards crowding in a fucking conference room. Honestly, unless you’re someone like DFV, or are holding 10,000+ shares (just so you don’t think I’m gatekeeping, I can’t even count that high, let alone do I own anywhere near that amount of shares), I don’t think we should go. \n\nAnd to wrap this up, Seriously, you goons look great in your one-size-too-big business suits and your banana ties…. but just think for a second, not About yourself or the “experience” you could have (I saw one guy on here talking about bringing his 4 kids…come on guys, you’re kidding me right?), consider that they have a solid course of action. That’s why their meeting is 15 minutes; they want to get in, get out and get back to work. Don’t make this harder for them than it has to be.",
    "title": "Please reconsider going to the shareholder meeting. I’m probably going to get a LOT of hate for this, but just hear me out before my inbox is flooded with shill accusations.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nr9ndn/please_reconsider_going_to_the_shareholder/"
}