{
    "author": "TheNovaeterrae",
    "created_utc": 1618599184.0,
    "distinguished": null,
    "edited": false,
    "id": "ms9upk",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_ms9upk",
    "num_comments": 137,
    "permalink": "/r/GME/comments/ms9upk/a_mask_off_citadel_great_men_embezzle_amc_gme/",
    "score": 1009,
    "selftext": "Posted by Nova & Carob \n\nTo be clear from the inception of this DD, the purpose here is to shine a light on Hedge Funds and companies that are shorting AMC/GME and/or buying puts against AMC/GME. This light comes from a private community of Apes that have been looking very closely into the activities and inner workings of Citadel and friends. Our community intends to be as transparent as possible with everyape in our family, so we have made a unanimous decision to come forward here in this DD to all of you. We have coined the name The ApesOnWallStreet and before getting into the really good stuff we, Nova and Carob, want to personally provide some information about the Apes in our community. \n\nAnd a small message from Carob; I’m good apes, thank you for your support, hope you enjoy reading our findings.\n\n**The ApesOnWallStreet** \n\n* We are a group of a few Apes that have been talking behind the scenes and merging the few wrinkles on our brains to form one very, very wrinkly Ape mind. The present goal is to create, review, and assist with DD’s to help the Ape community grow in knowledge!\n* I personally am extremely grateful for this opportunity to be a voice against the players trying to manipulate the system. I speak for all of us when I say how grateful we are, to all of you who read our DD’s and for all of your support. Every message, every upvote, every sentiment of encouragement expressed just reinforces our dedication to all of you and our drive to learn & uncover more. \n\nI, Nova, The Student of Psychology, have nothing but the utmost love for every single ape, for all the huddled masses and for everyone struggling in this extremely complicated world of ours.\n\nWe were brought together by Moczak9, who read all of our DD’s and reached out to all of us to bring us together in the belief that we could be a stronger force united. So far, I think he was right. I personally, am extremely grateful to him for this opportunity to be a powerful weapon against a very devious enemy. I personally never imagined that I would ever be part of something like this and now, honestly, I can’t imagine a world without all of you. \n\n# Reddit Usernames ;\n\nu/TheNovaeterrae \n\nu/moczak9 (Founder) \n\nu/-Amewthyst- \n\nu/FuckYouWithAloha \n\nu/umu68 \n\nu/autistic-lord \n\nu/Horror_Carob2817 \n\nu/GGGGG\n\n**Now, let’s get to the juicy part**. You all know I, Nova, love my links and this DD will be full of them. We will only include information that is readily accessible to everyape. No speculation. No opinions. I may include a small motivational speech because I have a need to add at least a dash of emotion into everything I do. It’s my empathy that gives me my greatest strengths as a human being and I am so much less than I am, without that. But most of this will be facts. And links. And pictures. From the links. I hope this helps. \n\n# PART A. THE CONNECTION BETWEEN VIJAYABALAN MURUGESU OR (BALAN FOR THOSE WHO CAN’T PRONOUNCE HIS NAME) AND CITADEL;\n\nNow, most of you might be wondering who is Balan? He isn’t mentioned anywhere on any other DD or anything we’ve seen that has to do with AMC, GME or Citadel. Well, hold onto your seats. \n\nThis is Balan. \n\n&#x200B;\n\nhttps://preview.redd.it/ulqc7n4j0lt61.png?width=225&format=png&auto=webp&s=ab424c79736608c80902fd9d873d6ef4212540e8\n\nLink: Where we found his face. \n\n[https://www.thestar.com.my/news/nation/2005/06/12/global-malaysians-network-spreading-afar](https://www.thestar.com.my/news/nation/2005/06/12/global-malaysians-network-spreading-afar)\n\nIf we start pulling the thread on Balan, you may first encounter Offshoreleaks. On offshore leaks you’ll find 3 entities, all of which are named Redmile. I included a picture below. \n\n&#x200B;\n\nhttps://preview.redd.it/iev02bzj0lt61.png?width=512&format=png&auto=webp&s=53f873296f89143642160206fed07f89056a7921\n\nIf you then search for Redmile, you may encounter the following SEC Report. \n\n( Link: [https://sec.report/Document/0001472225-13-000001/](https://sec.report/Document/0001472225-13-000001/) )\n\nHere I want to show you the Form D/A Redmile Strategic Offshore Fund, Ltd D/A \\[Amend\\] - Notice of Exempt Offering of Securities. This was published January 25th, 2013 at 17:42:45. It was submitted on January 28th, 2013. The filing agent is RedMile Ventures, LTD. Now upon opening this SEC Report, the first message you will see is that “The Securities and Exchange Commission has not necessarily reviewed the information in this filing and has not determined if it is accurate and complete. The reader should not assume that the information is accurate and complete.” \n\nMake of that what you will. \n\nThe jurisdiction here is the Cayman Islands. You’ll see this location quite a few times as you look into Redmile. The reason being, is that the Cayman Islands are Balan’s and Ken’s wet dream palace. Gross, I know. And sorry, that is an opinion, someone might be into that, who knows? Anyway, the Cayman Islands is well known as one of the best tax havens of the world. According to Claire Boyte-White’s article, titled “Why Are the Cayman Islands Considered a Tax Haven” on Investopedia; “Unlike most countries, the Caymans don’t have a corporate tax which is a tax on the profits of a corporation”. This makes it an incredible place for multinational corporations to base subsidiary entities which then act as shields to some or ALL of their incomes from taxation. I’ve included a link below so you can read all about it. \n\n( Link: [https://www.investopedia.com/ask/answers/100215/why-cayman-islands-considered-tax-haven.asp](https://www.investopedia.com/ask/answers/100215/why-cayman-islands-considered-tax-haven.asp) )\n\nNow as you look into Redmile eventually you’ll also notice the name of Jeremy Green. He is noted as the executive officer of Redmile Group, LLC, the Investment Manager of the Issuer. Here’s his face. \n\n&#x200B;\n\nhttps://preview.redd.it/ilcpcqxk0lt61.png?width=263&format=png&auto=webp&s=5cd716fe81ab4d4811a10542cfa6bb46a9aaea60\n\nLink: As a favor to you all, we will not lead you to where we found his face. You’ve seen enough. \n\nNow according to Fintel, “Redmile Group, LLC has disclosed 87 total holdings in their latest SEC filings. \n\nMost recent portfolio value is calculated to be $ 8,258,586,000 USD.” \n\nThis Fintel link has more information here about actual assets under management and so on -> [https://fintel.io/i/redmile-group-llc](https://fintel.io/i/redmile-group-llc) \n\nBut they only matter to me for one peculiar reason. Which is this link - > [http://lacapitalmanagement.com/6pp3bl9m/redmile-group-founder-4f87bf](http://lacapitalmanagement.com/6pp3bl9m/redmile-group-founder-4f87bf) \n\nDon’t worry Andrew, I won’t make you click the link. I know you don’t want to do all that so I’ll make life easier for you and all of the Apes watching your video because I love all of you so much (there go those freaking emotions again). In the link you will find “Additional Series B investors included *Westlake Village BioPartners*, Kleiner Perkins, Cowen Healthcare Investments, *Acorn Bioventures,* HBM Partners, Perceptive Advisors, and **Surveyor Capital (a Citadel company)**”. \n\nKen’s Stupid Face. \n\n&#x200B;\n\nhttps://preview.redd.it/2f60anvl0lt61.png?width=512&format=png&auto=webp&s=4c2dfb51f253f802c7dbc470385d9de87109115f\n\n**Redmile Special Opportunities Fund LTD** \n\nIn between the years of 2019-2021 - Redmile profits skyrocketed. During a pandemic. Their profits...skyrocketed. So while everyone else was losing money, theirs Skyrocketed. If you are still confused, here is a graph to display this. \n\n&#x200B;\n\nhttps://preview.redd.it/5f1006pm0lt61.png?width=512&format=png&auto=webp&s=7e5eba78d43fbb5ec222e0a52dc427659fa15c2b\n\nThe graph can be found on this link that was provided to us by our very own, Lisbeth Salander AKA Amewthyst - > [https://aum13f.com/fund/redmile-special-opportunities-fund-ltd](https://aum13f.com/fund/redmile-special-opportunities-fund-ltd)\n\nAs an added tidbit, Custodians listed under Fund Details include the following… \n\nThe Northern Trust International Banking Corporation, Morgan Stanley & Co LLC, Morgan Stanley Institutional Liquidity Funds c/o Morgan Stanley Services Company Inc, JP Morgan Clearing Corp, JP Morgan Securities LLC, Morgan Stanley Private Bank National Association. \n\n# PART B. Balan and his HedgeFund friends;\n\nLet’s face it, what would a world be for Balan if he only had one HedgeFund friend? That’d probably be so empty, so lonely. That cannot be. Balan and Ken need friends. So we are going to dive into what Hedge Funds Balan is actually connected to, and it is a ton, probably even more than we were able to find. \n\n*Broad peak fund II LTD.;* \n\nA Singapore based company named Broad Peak Fund is connected to Balan, in the Caymans and others from there. ( Link: [https://www.sec.gov/Archives/edgar/data/1743736/000174373619000002/xslFormDX01/primary\\_doc.xml](https://www.sec.gov/Archives/edgar/data/1743736/000174373619000002/xslFormDX01/primary_doc.xml) ). This company is based in several locations, the locations being; Singapore, Oregon and the Grand Cayman. A man named Syed Hyder Ahmad ( we will call him SHA for short ) is also connected to this company through the SingaPore based firm. Now you may ask who this is man? Well, this man is the founder of this company, Broad Peak Fund, but he founded it after he had resigned from his post from another well known company you might possibly recognize, ***Goldman Sachs***. He was the Co-Head of securities for Asia, after he resigned from his position he went on and started Broad Peak Investments, and of course, as we all could’ve guessed, Goldman Sachs is also on the list of custodians. \n\n[https://www.globalcustodian.com/goldman-sachs-director-resigns-to-reportedly-start-his-own-asian-hedge-fund/](https://www.globalcustodian.com/goldman-sachs-director-resigns-to-reportedly-start-his-own-asian-hedge-fund/)\n\n*Pura Vida Investments LLC;*\n\nPura Vida being the name of the onshore company based in the US, they have an offshore fund that is called Pura Vida Offshore fund ONE, get it? The ONE because there are multiple -\\_-  Just like the other funds that Balan is connected to, this offshore fund is also based in the Caymans. The offshore funds are runned by; Ballan, Martin Laidlaw and Philip Hughes. We will call them the *Trio of Trouble* from now on. I’m sure they’ll love that. \n\n1: [https://sec.report/CIK/0001637529](https://sec.report/CIK/0001637529) 2: [https://sec.report/CIK/0001774263](https://sec.report/CIK/0001774263) \n\n*140Summer partners LP;*\n\nAnd yet again another US based Hedge Fund that is associated with Balan! They own 3 onshore funds under the name 140 Summer Partners Onshore, 140 Summer Partners LP and 140 Summer Partners Fund GP LLC. For these 3 onshore funds they also own 2 offshore funds under the names; 140 Summer Partners Offshore LTD and Summer Partners Master fund. The Offshore funds have only posted a Securities offering once, now this isn’t something to worry about since they have been in business for only a year. The company has a total of assets under management (AUM) of around $2.6 Billion in their first year. \n\n&#x200B;\n\nhttps://preview.redd.it/bordrlvp0lt61.png?width=512&format=png&auto=webp&s=ba6d3e1982b7908b0d7142cd12b8281f25353e04\n\nYou see that perfectly normal rising line in every single chart? Yeah we do as well, this isn’t normal stuff unless some bigger company decided to invest in them and gave them a boat load of money.\n\nConveniently enough they have sold the biggest amount of their assets through the fund in the Caymans. The onshore fund sold assets as well, but it was 30% less than what we are seeing in the Caymans.The only thing that the Fund in the Caymans has done is sell their securities, nothing else has been reported from there, *how convenient.*  [https://sec.report/CIK/0001813446](https://sec.report/CIK/0001813446) \n\n  \n\n\nhttps://preview.redd.it/8193olvq0lt61.png?width=422&format=png&auto=webp&s=bb73cf7cd2258fb7deadd01109c4fadb17787163\n\n*Pharo Trading Fund;*\n\nLast but not least for now is *Pharo trading fund*, this is a big company all around the world. So why did this spark our interest? It’s not obviously not because Balan is on there because he obviously is. But the fact that the Pharo Trading Fund, LTD. based in the Caymans has only sold stock, for multiple years, I repeat, they have only sold stock but have never bought any ( At least not by filing them ). \n\n&#x200B;\n\nhttps://preview.redd.it/d2l2i6nr0lt61.png?width=512&format=png&auto=webp&s=83a782f4722fee9b8423cafe364c5fcae0464066\n\nEvery single year they have offered securities/stock around the same time, the only year that stands out to us is the year of 2020 where they were 2 Months late when they previously never were. All of the directors got paid a nice bonus of $10k per person every single year for filing these reports.\n\n&#x200B;\n\nhttps://preview.redd.it/pm8lyn9s0lt61.png?width=512&format=png&auto=webp&s=7badceacfce76aa0f83d0fb6ba4ce8abc09f139d\n\nOur man Balan is on the board of directors for this company as well as; David Bree and Peter Rioda. Let’s say that our man Balan has made a nice profit from only this company alone (around $100k), very lucrative business as you may see, and this is just one of the examples of many. \n\n[https://sec.report/Document/0001085146-19-001050/](https://sec.report/Document/0001085146-19-001050/) \n\n# Part C. THE ENEMY \n\nApes have really only been seriously fighting amongst each other on one thing. GME vs AMC. The great divide. The only thing that has seemingly separated apes is the fact that there are 2 stocks with incredible squeeze potential and because most of us are nerds, we believe that there can only be one. One stock to rule them all, one stock to find them, one stock to bring them all and...okay I’ll stop, I’ll stop…\n\n&#x200B;\n\nhttps://preview.redd.it/3s97l03t0lt61.png?width=133&format=png&auto=webp&s=d6da8000aa9feca94af00eddc910a886f3871f91\n\nAND IN THE DARKNESS BIND THEM! I’m sorry I couldn’t stop. You know that! You know that. But, I digress. Either way, you get it. Well, well, well, how we were all oh so wrong. Because the fact that there are 2 is exactly how we find the enemy. See the enemy of my enemy is my friend. And in this case, the enemy of AMC is also the enemy of GME. If you aren’t following me here, I’m saying that's the connection. These 2 stocks move together like a dance.  \n\n&#x200B;\n\nhttps://preview.redd.it/k6yl9ftt0lt61.png?width=512&format=png&auto=webp&s=4f1483d4f93a641024ca4b568531fbc940b26b90\n\nSo stands to reason...that they share common enemies. Now, we’re not going to completely release all their dirty secrets on this one DD but I have a feeling they’re going to come across this. I just got a feeling. \n\nAnd I’m curious how much of them are going to enjoy all the attention they have coming their way in future DD’s. Here are a few of the names of companies that are interested in what AMC and GME are both doing as of late. \n\nMake of it what you will. \n\n[ADVISORNET FINANCIAL, INC](https://whalewisdom.com/filer/advisornet-financial-inc)**(PUT)** \n\n[SUSQUEHANNA INTERNATIONAL GROUP, LLP](https://whalewisdom.com/filer/susquehanna-international-group-llp)**(PUT) & (CALL)**\n\n[**PRIVATE CAPITAL GROUP, LLC**](https://whalewisdom.com/filer/private-capital-group-llc) **&** [**PRIVATE ADVISOR GROUP, LLC**](https://whalewisdom.com/filer/private-advisor-group-llc) **(PUT) & (CALL)**\n\n[**FLAGSHIP PRIVATE WEALTH, LLC**](https://whalewisdom.com/filer/flagship-private-wealth-llc)\n\n[**EVERENCE CAPITAL MANAGEMENT INC**](https://whalewisdom.com/filer/menno-insurance-service-inc-dba-mma-capital-management)**(?)**\n\n[**DIMENSIONAL FUND ADVISORS LP**](https://whalewisdom.com/filer/dimensional-fund-advisors-inc)**(?)**\n\n[**HUDSON BAY CAPITAL MANAGEMENT LP**](https://whalewisdom.com/filer/hudson-bay-capital-management-l-p)**(?)**\n\n[**UBS ASSET MANAGEMENT AMERICAS INC**](https://whalewisdom.com/filer/ubs-global-asset-management-americas-inc)**(?)**\n\n[**HSBC HOLDINGS PLC**](https://whalewisdom.com/filer/hsbc-holdings-plc)**(?)**\n\n[**SCHRODER INVESTMENT MANAGEMENT GROUP**](https://whalewisdom.com/filer/schroder-investment-management-group)**(?)**\n\n[**ALYESKA INVESTMENT GROUP, L.P.**](https://whalewisdom.com/filer/alyeska-investment-group-l-p)**(?)**\n\n[**PRINCIPAL FINANCIAL GROUP INC**](https://whalewisdom.com/filer/principal-financial-group-inc)\n\n[**SCULPTOR CAPITAL LP**](https://whalewisdom.com/filer/oz-management-lp)**(PUT)&(CALL)**\n\n[**JPMORGAN CHASE & COMPANY**](https://whalewisdom.com/filer/j-p-morgan-chase-co)**(D) ALL OF THE ABOVE**\n\n[**UBS OCONNOR LLC**](https://whalewisdom.com/filer/ubs-oconnor-llc)**(PUT)**\n\n[**IMC-CHICAGO, LLC**](https://whalewisdom.com/filer/imc-chicago-llc)**(PUT)&(CALL)**\n\n[**CITADEL ADVISORS LLC**](https://whalewisdom.com/filer/citadel-advisors-llc)**(D) ALL OF THE ABOVE**\n\n**(WILL ORGANIZE BETTER LATER WITH** **MUCH** **MORE DETAIL)**\n\nSo that’s it. It’s just these companies. Just 18. That seems like more than enough friends right? No. Not enough. So let’s find more of Ken’s friends, we want to really set up that playhouse. \n\n### Antara Capital LP ownership in CLVS / Clovis Oncology Inc\n\n2019-11-14 - Antara Capital LP has filed a 13F-HR form disclosing ownership of 0 shares of Clovis Oncology Inc (US:CLVS) with total holdings valued at $0 USD as of 2019-09-30. Antara Capital LP had filed a previous 13F-HR on 2019-08-14 disclosing 50,000 shares of Clovis Oncology Inc at a value of $743,000 USD. This represents a change in shares of -100.00 percent and a change in value of -100.00 percent during the quarter.\n\nAntara Capital LP has a history of taking positions in derivatives of the underlying security (CLVS) in the form of stock options. The firm currently holds 0 call options valued at $0 USD and 42,500 put options valued at $204,000 USD .\n\nOther investors with closed positions include [Canada Pension Plan Investment Board](https://fintel.io/so/us/clvs/canada-pension-plan-investment-board), [Soros Fund Management Llc](https://fintel.io/so/us/clvs/soros-fund-management-llc), [**Citadel Advisors Llc**](https://fintel.io/so/us/clvs/citadel-advisors-llc)**,** [**Invesco Ltd.**](https://fintel.io/so/us/clvs/invesco)**, and** [**Redmile Group, LLC**](https://fintel.io/so/us/clvs/redmile-group-llc)**.**\n\nA substantial portion of the Company’s options, clearing and financing activities are with a **Bank of America Merrill Lynch subsidiary (“BAML”).** These positions are recorded at fair value under securities owned on the statement of financial condition. This results in a concentration of operational and credit risks with BAML. Such risk, however, is partially mitigated by the obligation of certain of these financial institutions to maintain minimum net capital and to segregate customers’ funds and financial instruments from the financial institution’s own holdings. \n\n**Merrill Lynch. That’s it. Just Merrill Lynch.**  \n\n**And for the internet's sake, Wikipedia.** \n\n* [***The Quants: How a New Breed of Math Whizzes Conquered Wall Street and Nearly Destroyed It***](https://en.wikipedia.org/wiki/The_Quants)\n* [***Merrill Lynch, Pierce, Fenner & Smith Inc. v. Manning***](https://en.wikipedia.org/wiki/Merrill_Lynch,_Pierce,_Fenner_%26_Smith_Inc._v._Manning)**, a 2016 Supreme Court case involving** [**naked short selling**](https://en.wikipedia.org/wiki/Naked_short_selling) **claims against Citadel Derivative Group and Merrill Lynch, and others.**\n\nWell, we’ll end this section here for now but trust that we could have kept going on for days. But know that we fully intend to dive further, in multiple DD’s with each one going really in depth into who runs these companies, how they run their companies, and just doing our part to make sure that everything is being done above board. Just, you know, to help out the SEC because they are just so busy these days, having to read and everything. Y’know that’s pretty new for them so we really just want to help out and we are very ready to take on these responsibilities. But, all jokes aside, does anyone reading this know what the best part of this is? \n\nWe don’t even want a paycheck. We’re not charging anyone, for any of this. Wouldn’t take it. Because even though we live in a Capitalist Society that serves as a breeding ground for corruption, I personally, prefer to look at it as a test of human virtue. Will a person try to create something that helps humanity regardless of how much they make? Will a person deny a Million dollars so his employees can all get better pay? Will a person hoard all the money they can while others struggle? Will a person choose the easy way to live, or the hard way? The moral way. In service of others. I personally think corruption has an expiration date. Maybe. I sure hope so. \n\nAlright, speech over. More links below. Links on links on links. And pictures. These links include compelling information about what has been said in this DD and maybe a bit more. Sorry Andrew, but we think these links speak very loudly enough for themselves. Thank you all for taking the time to read this. I hope you have a new wrinkle now. \n\n**--------------------------------------------------------------------------------------------------------------------------------------**\n\n**https://fintel.io/so/us/clvs/antara-capital**\n\n**https://www.bloomberg.com/news/articles/2021-03-03/citadel-hires-apollo-s-head-of-corporate-credit-trading-barratt**\n\n[https://www.sec.gov/Archives/edgar/data/1146184/000114618420000006/CDRG\\_StmtFinCndtn2019.pdf](https://www.sec.gov/Archives/edgar/data/1146184/000114618420000006/CDRG_StmtFinCndtn2019.pdf)\n\n**--------------------------------------------------------------------------------------------------------------------------------------**\n\n# JPMorgan Sells $13 Billion of Bonds in Largest Bank Deal Ever \n\n# --> [https://finance.yahoo.com/news/jpmorgan-sell-13-billion-bonds-184602000.html](https://finance.yahoo.com/news/jpmorgan-sell-13-billion-bonds-184602000.html)\n\n\\--------------------------------------------------------------------------------------------------------------------------------------\n\n# Cayman Law Bars Suit Over $1B Fund, NY Appeals Court Says\n\nMay 29, 2013 by [owbewcirk](https://www.ieyenews.com/author/owbewcirk/) \n\n[https://www.ieyenews.com/cayman-law-bars-suit-over-1b-fund-ny-appeals-court-says/](https://www.ieyenews.com/cayman-law-bars-suit-over-1b-fund-ny-appeals-court-says/)\n\n\\-----------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\nhttps://preview.redd.it/ffrvc7qu0lt61.png?width=512&format=png&auto=webp&s=7d6ab24bbdb66c8f2f2266f2ac61a28863614229\n\nIf everything stays the same, rest assured the next web will also be more vast and a bit more detailed. Or significantly more detailed. (Cough, cough, Hydra, cough). \n\n**--------------------------------------------------------------------------------------------------------------------------------------**\n\n# Part D. Honest workers, Citadel doesn’t care;\n\nSo you are an ape that has worked their entire life from 9 to 5, you have earned some good pension by now right? Well you do, but Citadel and other funds DO NOT care about that, by investing with brokers from the Caymans they don’t have the protection that they do in the US. They do not care about losing retirement money, as long as it is in their best interest. They invest in risky businesses without having a good broker that has the same regulators as in the US.\n\nWe are talking about millions of dollars they are stealing from the pension funds, and no they do not care about this at all. Firefighters, hospital workers, teachers, they’re basically scamming every single one of them for their own gains. They set these Shell funds up to protect themselves and nothing else. They care about 1 single person in the world and that is themself. So what is our duty now? Go out and show that this behaviour is no longer accepted, show them who's boss and that is US APES.[http://pensionpulse.blogspot.com/2017/11/the-grand-cayman-pension-scam.html](http://pensionpulse.blogspot.com/2017/11/the-grand-cayman-pension-scam.html) \n\nWe hope you all have enjoyed reading our research and this is only the surface that we’re scraping right here. We are coming out with way more in the future, we love all of you guys. All of our PM’s are always open if you have any questions regarding the stocks. Except for Amewthyst. She will block you. \n\nThere are great men, and then there are good men. \n\n***This is not financial advice in any way, we are not financial advisors. We are apes that happened to be put in the same cage at the right time.***\n\n***Dming you now Amewthyst \\~ Carob***",
    "title": "A Mask off Citadel; Great Men Embezzle (AMC; GME)",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GME/comments/ms9upk/a_mask_off_citadel_great_men_embezzle_amc_gme/"
}