{
    "author": "anonfthehfs",
    "created_utc": 1623428816.0,
    "distinguished": null,
    "edited": 1623514866.0,
    "id": "nxk08y",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nxk08y",
    "num_comments": 553,
    "permalink": "/r/Superstonk/comments/nxk08y/change_my_mind_gamestop_is_quickly_becoming_the/",
    "score": 9289,
    "selftext": "# \n\nhttps://preview.redd.it/7f4ydk4jun471.jpg?width=3735&format=pjpg&auto=webp&s=3ef1413833fa53d916654190722b8fdf788c362d\n\n# Dearest Apes,\n\n# \n\nI love you all.  I want to throw this out there for reference, I served two tours years ago Fallujah Iraq getting shot at, rocket/mortars lobbed onto our bases while we slept, driving through IED alley, etc while I was in the Marines.   **I'll always believe that those people who I served with are the toughest SOBs on the planet.  Guess what?  You guys are a close fucking second which is a compliment to say the least.  I've watched GME Apes fucking take lumps daily for months at a time.  Constant FUD.  Wild Swings.  90% losses for us Jan Apes, People watching their life savings disappear in mins, Drops from bid whacking that would scare 99% of investors.......that shit would take a toll on your average person's mental health.....Not you fucking Diamond Handed Crayon eaters**......So hear me out.\n\n&#x200B;\n\n&#x200B;\n\n# Supply and Demand.   The rarest things on earth usually cost more.  If it is hard to obtain and people want; it will be priceless.\n\n&#x200B;\n\n&#x200B;\n\n**If Apes can just keep buying and hodling.  It doesn't matter what outside analyst think, what the media thinks,  it doesn't matter what the government thinks, etc.  We already own the entire float, shorts are stuck, and as long as we never sell; they can't unfuck themselves.  It's that simple.**  **We just broke the system with the most simple concept: BUY & HODL.**  We like the stock, we support the stock/stores, and GameStop will thrive under great leadership and our continued support fueled by short interest driving up the price every couple weeks.  If we keep having solid quarters, whales and institutions will be piling in.  **If you are reading this now, congratulations; you got in at the ground floor of the biggest turnaround in history.  It's like buying Amazon at $400 bucks or Tesla at $60.**  If nobody sells, this stock becomes something special.  **They can't make us sell and they can't stop us from buying.  Therefore, the problem gets too large and it blows up into the largest and LAST MOASS that will ever happen.   (Dear SEC, DTCC, Institutional Analyst who lurk here.....this problem isn't going away.  We understand the game now, and if you don't let it squeeze it will blow up in the world's face.   If they drop it to $1 tomorrow, I'll sell my house and buy the entire float myself and from what I've seen, so will every Ape here.**\n\n# \n\n# Ready for some jacked Tits:  There are about 73,000,000 total (Estimate since we don't know how many got sold at the ATM yet) subtract - 6.57 Million for insiders = 66,430,000 million total for the market.    So 66.43 Million shares for the entire world.\n\n&#x200B;\n\n&#x200B;\n\n# Let's just subtract some of the biggest players positions.\n\n**RC Ventures LLC**  owns 9,001,000\n\n**BlackRock** owns 8,508,379 shares\n\n**Vanguard** owns 5,444,295 shares\n\n**SSgA Funds Management, Inc**  1,858,535\n\n**Charles Schwab Investment Managem...** 996,241\n\n**Geode Capital Management LLC** 916,828\n\n**Northern Trust Investments, Inc.(...**  698,602\n\n**Jane Street Capital LLC** 509,922\n\n**Principal Global Investors LLC** 381,932\n\n**Paradice Investment Management Pt...** 308,442\n\n**Invesco Capital Management LLC**  290,602\n\n**DFV=** 200,000\n\n# Just those right there are  28,806,336 shares.  That would leave 37,623,664 shares available for the float after Institutional Investors (Don't worry ETF's are next).\n\n&#x200B;\n\n&#x200B;\n\n# Now ETF's.\n\n\\*\\*Vanguard Total Stock Market Index...\\*\\*1,477,414\n\n**Vanguard Small Cap Index Fund**  1,284,171\n\n**Vanguard Small Cap Value Index Fu...** 776,788\n\n**Vanguard Extended Market Index Fu...**  773,937\n\n**Vanguard Tax Managed Small Cap Fu...**  459,087\n\n(Vanguard Total ETF: 4,771,397.   672,989 difference from Original number.  )\n\n**iShares Core S&P Small Cap ETF** 3,700,560\n\n**iShares Russell 2000 ETF** 1,352,130\n\n**iShares Russell 2000 Value ETF** 647,980\n\n**iShares S&P Small Cap 600 Value E...** 486,018\n\n(BR iShare total:  6,186,688)\n\n**St. James Place Unit Trust - Glob...**  403,953\n\n&#x200B;\n\n6,590,641 +  Either 672,989 (Combined with other ETFs 7,263,630 shares)  or 4,771,397 (Combined with other ETFs 11,362,038 shares)\n\n&#x200B;\n\n# Total Remaining Shares after ETF's:  (Edit)  I learned that iShares are BlackRocks so I took out the Vanguards.  The updated number is 36,546,722\n\n# \n\n# \n\n# =====================================================\n\n# So the ENTIRE rest of the float for everyone else in the world is 36,546,722  ***This is just like the top 10 holders, I didn't even bother to go further.  So the float is likely much lower than this but I wanted to show how fucked the shorts are.\n\n# =====================================================\n\n&#x200B;\n\n# Now for fun:  Let's pretend like there isn't naked shorts and retail owns zero shares.  There are 425k Superstonk members.   (I'll not even count the overlap apes at WallStreetBets (10.5 Million users) or GME (300k)  Let's say 25k of SuperStonk are shills and bots so 400k hardcore Apes.\n\n# \n\n# I did the math, if each Ape (400k) would buy 91.366 shares (Edit: was 66 now after removing iShares ETF numbers it's updated to 91.366805 right now) at ($216), that would buy up the entire remaining float.  Now, let's stop pretending, and remember we own MILLIONS alone in this sub and guess what, I didn't even bother to do all institutional ownerships.  I just did the fucking top like 10 just to show you how fucked they are.\n\n&#x200B;\n\n&#x200B;\n\nThere is zero doubt we already own the entire float.  Now think about this, each time they try to scare us into selling with these massive drops, if Apes buy or continue HODL if they have no more money left, the noose gets tighter.   The lower the price is, the more shares retail is able to buy.  They are stuck in between a rock and a hard place.  If they lower the price, Apes significantly make the issue bigger when they buy more to HODL.  If they start covering, they will probably go bankrupt.\n\n# \n\n# \n\n# Just think about this.  Let's take the 94 million shares minimum I saw calculated on someone's DD on the options chains synthetics.  Let's say our total float is 26.2 Million shares, that would leave SHF's having to buy back 67.8 million shares that Apes won't part with.  THAT'S FUCKING MINIMUM!!  I think the number is much larger than that.\n\n&#x200B;\n\n&#x200B;\n\n# If each pay period, we buy what we can.........that amount of buying pressure is making each FTD day much bigger than before.   I'll continue buying and holding.  They have to keep hiding their FTD's and each time the number grows and so do the swings up.\n\n&#x200B;\n\n# All you have to do is keep doing what you are doing.  Don't lose faith, buy if you want to, and HODL.  They can't close their positions unless they start buying.  Remember those close to 200 million volume days in Jan, that's how you know they are covering.  Until we see that again, they are just kicking the can down the road..... just keep doing what your doing.  BUY, HODL, till MOASS.\n\n# Lastly, to me, GameStop is the long play regardless.  I'm going to be a lifelong investor of theirs.  I feel like I got in a really good time and I'll keep buying their shares.  I think they have a SUPER bright future.  I'm in it for the long haul.\n\n&#x200B;\n\nOOk OOk!  Thumps Chest, and drops Mic!\n\n# Edit:  Forgot the TLDR:  Total float is between 26.4 Million shares and 30 Million shares for the rest of the world.  Did the math, if 400k Apes keep buying it would only take 91.366 shares each person to own the entire float (Sidenote:  I didn't even bother doing any additional shares outside the top 10 holdings, I just wanted to show how fucked shorts are).  That's not including what we already own which my guess is in the millions of shares.  Shorts can't cover anymore so they just keep kicking the FTD can down the road.   94 million shares were flagged as probable synthetic shares in the options chains.  Just buy and hold until you start seeing volume and green dildos like back in Jan.  Hedgies R Fuked and the problem is getting too big for the SEC/DTCC to ignore.\n\nNot financial advice.  I'm a Marine for fucks sake......Trust me with a M16A2, not your money.  I don't know if we have to keep writing that shit but just in case.  lol\n\n# EDIT 2:   I'm going to take this opportunity if anyone wants to learn a little about Marines.\n\n# \n\nThere is a scene from the Part 2 video. 2:51\n\nThat reminds me of this community. Just sub the word Marine for Ape.\n\n\"He's an Ape, I'll take care of him. \"\n\nFucking gives me chills.\n\nLove you all\n\n&#x200B;\n\nPart 1: [https://www.youtube.com/watch?v=rexpWI0nJTc&t=336s](https://www.youtube.com/watch?v=rexpWI0nJTc&t=336s)\n\nPart 2: [https://www.youtube.com/watch?v=xw05sDpFL3s](https://www.youtube.com/watch?v=xw05sDpFL3s)\n\n&#x200B;",
    "title": "Change my mind: GameStop is quickly becoming the most valuable asset on the market because of this growing community and low float. You have constant buying pressure on a stock with no shares. Hear me out......!!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxk08y/change_my_mind_gamestop_is_quickly_becoming_the/"
}