{
    "author": "kevykev89",
    "created_utc": 1627305609.0,
    "distinguished": null,
    "edited": 1627315579.0,
    "id": "orykb0",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_orykb0",
    "num_comments": 102,
    "permalink": "/r/Superstonk/comments/orykb0/evergrande_norchukin_and_dr_burry_first_go_at/",
    "score": 1393,
    "selftext": "This is something that had grabbed my attention back in early June and I obsessed over it for a few days and then just tossed it to the side but I want to bring it up and get some help connecting more dots. I dont want to call this a DD by any means hoping for more of a Think Tank where we can talk this out together. Here goes nothin \\*anxiety raises exponentially\\* \n\n# Evergrande.\n\nNever heard of em until this post here by  [u/XSOUL1337](https://www.reddit.com/user/XSOUL1337/) [https://www.reddit.com/r/Superstonk/comments/ny6k6r/ding\\_ding\\_junk\\_bonds\\_evergrande\\_can\\_people\\_dive/](https://www.reddit.com/r/Superstonk/comments/ny6k6r/ding_ding_junk_bonds_evergrande_can_people_dive/)\n\nthis video does a good job explaining the situation they find themselves currently in and it only gotten worse. Check it out, its only like 2:40 and lays out pertinent info.\n\n They are China's largest Junk Bond Issuer. If we dont remember what Junk Bonds are...well i got ya back homie \\*Fist Bump\\* \n\n\"Junk bonds are bonds that carry a higher risk of default than most bonds issued by corporations and governments. A bond is a debt or promise to pay investors interest payments along with the return of invested principal in exchange for buying the bond. Junk bonds represent bonds issued by companies that are financially struggling and have a high risk of defaulting or not paying their interest payments or repaying the principal to investors.\"\n\n\\*Default\\* yeah my dude these are quite literally junk, and folks buy them. Well Evergrande is finding themselves \\*DEFAULTING\\* on their own debts now too. So Im sure you can see why its no bueno to see an extremely risky business model issuing HIGH risk bonds also defaulting on their own debt.\n\nAlso, they are China's 2nd largest mortgage writter........\\*yikes\\*\n\n# Norchukin.\n\n[https://www.reddit.com/r/Superstonk/comments/mlyj5e/michael\\_burrys\\_japanese\\_big\\_short\\_norinchukin/](https://www.reddit.com/r/Superstonk/comments/mlyj5e/michael_burrys_japanese_big_short_norinchukin/)\n\nThis gem is what began this rabbit hole for me. Wowza.  [u/Alarmed-Citron](https://www.reddit.com/user/Alarmed-Citron/) knocked it out the park. Big kudos. Check it out because its Supa Hot Fiya.\n\n Their TL;DR  \n\n\"**TLDR:**\n\n**CLOs and CSOs on the rise, quality declines, Japanese Banks own huge amounts of CLOs of good quality. Nevertheless, defaults are predicted to rise. There is still a huge conflict of interest regarding the ratings of CLOs (and probably all kind of structured derivatives).\"**\n\nThis is copied directly from their post and is important for the connection: \n\n **\"Who is Norinchukin? Never heard of?\"** \\- [Nevermind, it's only a bank focused on agriculture, forests and fishery with total assets amounting up to 970,752 Million USD.](https://www.nochubank.or.jp/en/ir/annual_report/pdf/ar_2020.pdf)\n\nas of 31 March 2020. That should be 970 billion USD which is almost 1 trillion USD, if I am right. Nothing, right?\n\n**\"How active is Norinchukin with CLOs?\"**\n\n[As of 1st July 2020, S&P:](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/japanese-banks-warned-of-covid-19-impact-on-overseas-clo-investments-59253681)\n\n\"Japanese banks, among the world's largest buyers of collateralized loan obligations, should be cautious about their holdings of such securitized products as default risk of underlying loans could be rising, albeit still low, amid prolonged pandemic disruptions globally, experts say.\n\nAlthough rising risk aversion have pushed prices of CLO notes down in the secondary market, which has led to unrealized losses for CLO investors worldwide, the Japanese banks are in a relatively better position, at least in the near term, as most of the notes they hold are rated AAA, experts add.\"\n\n**\"Cool, they are rated as AAA. So they are secure.\"**\n\n[Same Source:](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/japanese-banks-warned-of-covid-19-impact-on-overseas-clo-investments-59253681)\n\n: \"Japan's top CLO investor, Norinchukin Bank, told a press conference in May that it would refrain from investing in more CLOs.\n\nThe bank, which manages assets for farms and fishing cooperatives, held ¥7.7 trillion of CLOs as of March 2020. It was down from ¥8.0 trillion as of end-2019 but up from ¥7.4 trillion in March 2019.\n\n**Although default risk of CLOs appears low for now, rising risk aversion among investors had led to an unrealized loss of about ¥400 billion of its CLO portfolio in the March-end quarter.**\n\n\"Of course, there is the big risk of their \\[the Japanese banks'\\] CLO investments,\" said Makoto Kikuchi, CEO at Myojo Asset Management Co. *\"Chances are high that even highly rated bonds will be downgraded,\" hit by recessions due to the prolonged Covid-19 interruptions.*\n\n*S&P Global Ratings recently forecast that the U.S. trailing-12-month speculative-grade corporate default rate will likely increase to 12.5% by March 2021. But if COVID-19 cases resume their rise later this year or early next year, the default rate could go up to 15.5%.*\n\n*JPMorgan, meanwhile, predicts a default rate for leveraged loans to just below 10% by the end of this year.\"*\n\n&#x200B;\n\nWhy TF is it that these Financial Institutions CONSTANTLY expose themselves to so much damn risk?!?!? Oh and they also own 4,019,000 shares of SPY valued at $1,502,624,000 at the time of their last filing. (Sorry lost the link I'll take that L)\n\n&#x200B;\n\n# Dr. Burry.\n\nOk so before dude bounced out in Feb. he changed his Twitter Header to this:\n\n&#x200B;\n\nhttps://preview.redd.it/ire3parz2kd71.jpg?width=1500&format=pjpg&auto=webp&s=01e7e1df400da76ebc4b99d4357011b16f9726de\n\n \n\n [u/Alarmed-Citron](https://www.reddit.com/user/Alarmed-Citron/) explained their theory above but I think Norinchukin is just a part of the puzzle. I think theres a lot more info in this picture. All of this typing is for this.\n\n&#x200B;\n\n\"**What Dr. Burry knew on 2-28-21 the day he deletes Twitter:**\n\nLook at “The Buffett Portfolio” -Q4 of 2020 Warren Buffett Sells off majority of Bank stocks (sachs,JP.Morgan, Wells Fargo, M&T,PNC,Synchrony) Trimming US Bancorp and BNY Mellon but adding BoA(Why?) WF he’s held over 30 years!\n\nThese actions were \"financial warnings\".\n\n\"The Big Short\" begins in Japan with Norinchukin\n\nThey are extremely over Leveraged on their CDo's.\n\nThis coupled with banks and other institutions Shorting Certain \"Credit Derivatives\"(10yr Bonds) and using the 0% interest coupon bond as a \"structured Credit Product\" \n\nHas Make a mess of the ON RRP.\n\nIf we Look at the \"Buffett Letter\" From 2-27-21 He says to \"Never bet against America\" and these institutions have done just that. The downfall of the American economy.\n\nThere's a tiny blue book that's hard to see, that book. \"The Little Book That Beats The Big Market.\" Is that book us retail? The little guy finally getting a win?\n\nLastly, \"The Paradox\"? How crazy of a thought for this to all be happening again. Its impossible right? Wrong. So very Wrong.\"\n\nI think he laid it out step by step how in his super wrinkle brain this was all going to play out, and it looks like dominos are starting to fall. \n\n&#x200B;\n\nOK! This is the most typing Ive done since college and I dont wanna do it anymore,  plus this chair is uncomfortable and my butt is falling asleep and these are just a couple reasons why all of this is probably nothing and I'm rambling and you absolutely shouldnt take me spitballing ideas like this serious because as you can tell i didnt take my ADD meds in a while...K LOVE YA THANX BYEEEEEEE",
    "title": "Evergrande, Norchukin and Dr. Burry. *First go at something like this, be gentle.*",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/orykb0/evergrande_norchukin_and_dr_burry_first_go_at/"
}