{
    "author": "b0mbSquad_1",
    "created_utc": 1626611788.0,
    "distinguished": null,
    "edited": 1626670728.0,
    "id": "ompq0t",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ompq0t",
    "num_comments": 319,
    "permalink": "/r/Superstonk/comments/ompq0t/mining_ethereum_under_official_gme_wallet_address/",
    "score": 3979,
    "selftext": "I am running a total of 5 cards right now on GME and it's mining just fine with no issues.\n\nhttps://imgur.com/532v4hc\n\nhttps://imgur.com/1PdaVDY\n\nI set my pool to 0.01 eth payout so hopefully we hit that soon with 5 cards mining.\n\nTotal of around 200+ MH/s\n\nGME NFT ADDRESS FROM THE SOURCE\n\nGo to GME official NFT website and use that address to link to the rest of the address / contracts.\n\nAlways go to the source\n\nhttps://nft.gamestop.com\n\nhttps://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e\n\nhttps://etherscan.io/tx/0x89df343d7e245d42a09de2c790c8c471a0956f32b55631a53a15268c56a74c2d\n\nhttps://etherscan.io/address/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad\n\nYou can thank the insomniac in me right now.\n\nI should be sleeping with my wife but instead I am mining while her boyfriend is keeping her warm.\n\nI love the stock\n\nI like my apes\n\nThis is my way!\n\n🦍🦍🦍\n\n💪💪🚀🚀💎💎🙌🙌\n\nEdit 8: 2nd payout hit thanks to all the Apes who participated in this test run / trial run.\n\nhttps://etherscan.io/tx/0x3209cfedd5cad563f495b4765f146db1873b0ed9ec818db2f4b00a73581b089b\n\nhttps://www.flexpool.io/miner/eth/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad/payments\n\nEdit 7: That was freaky fast. Someone please get all the GPU apes some jimmy johns\n\nWe got a payout from Flexpool. This is why I love these guys. So freaking fast and efficient.\n\nHere is the transaction from etherscan and you can get more details also under the payment tab on flex pool.\n\nI am not the NFT specialist. I am just a filthy miner.\n\nSomeone else needs to find out if we minted a coin or not. All I know is I can mine to this address and flex pool will initiate a payment to it.\n\nHere is the records. \n\nThanks again u/Shorty-Hunter\n\nThanks again all my apes for coming in clutch like you guys always do\n\nAs always I love the stock and I will pick up more on Monday during pre-market. See you guys on the field.\n\nhttps://etherscan.io/tx/0x033859e88875ce4e7a2277eb6fed4fd4b06634cd771d8f76847fbdcd8c723286\n\nhttps://www.flexpool.io/miner/eth/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad/payments\n\nEdit 6: \n\nI love the worker names you guys come up with. 🤪\n\nI’m just super boring with my worker names.\n\nThanks again for your contributions.\n\nThis proves what brother ape u/Shorty-Hunter said about being able to mine using the Gamestop coin address was true and what bad mod madie said was not true.\n\nhttps://www.reddit.com/r/Superstonk/comments/omijsk/update_from_the_ape_who_is_mining_ethereum_coin\n\nWe hit minimum payout thanks to all apes and should hopefully see a payout next time flexpool does their payments. 💰💰\n\nThis will let us know if they’ve updated the code to begin accepting ether into their wallet which is needed as gas / fuel to power transactions and incentivize miners to process your request.\n\n\nEdit 5: I had to . A single RX580 has entered the battle. All hail single GPU brother APE testing for the sake of science and GME. This is the way!\n\nhttps://www.flexpool.io/miner/eth/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad/stats?worker=RX580\n\nEdit 4: You can mine too for GME if you're bored or want to learn.\nhttps://www.flexpool.io/get-started/eth/GPU\n\nEdit 3: Couple more rigs showed up and now we are at 545 MH/s of power.\n\nhttps://www.flexpool.io/miner/eth/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad/stats\n\nEdit 2: Looks like another ape is an insomniac too and is helping route another 200 MH/s of power our way. RISE UP APES\nTHIS IS NOT MY WORKER. THIS IS A NEW WORKER THAT POPPED UP 28 SECONDS AGO.\n\nhttps://www.flexpool.io/miner/eth/0x10b16eede03cf73cbf44e4bfffa3e6bff36f1fad/stats?worker=WORKER_NAME\n\nEdit 1: Check out pictures if you don't like text.\n\nhttps://imgur.com/532v4hc\n\nhttps://imgur.com/1PdaVDY\n\nEdit to prep Apes for future FUD from shills\n\nEveryone please keep in mind the FUD about payout reverting.\n\nNo one cares if it will be reverted.\n\nJust the fact that I can mine against the wallet/address/contract is enough confirmation bias for me that I know I picked the right company to invest in.\n\nAfter this weekend shit show, I plan to buy more GME badges pre-market Monday.\n\nGME will be cutting edge and will make an example for everyone company to follow into the future.\n\nI love the stock.\n\nI like my apes.\n\nDon’t get me started on MODS.\n\nThis is my way!\n\n🦍🦍🦍\n\n💪💪🚀🚀💎💎🙌🙌",
    "title": "Mining Ethereum under official GME Wallet / Address / Contracts In Progress By Multiple Apes 💪🦍🚀💎🙌",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ompq0t/mining_ethereum_under_official_gme_wallet_address/"
}