{
    "author": "LassannnfromImgur",
    "created_utc": 1619049582.0,
    "distinguished": null,
    "edited": false,
    "id": "mvsu0d",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_mvsu0d",
    "num_comments": 140,
    "permalink": "/r/Superstonk/comments/mvsu0d/i_think_a_lot_of_apes_are_worried_by_atobitts/",
    "score": 2639,
    "selftext": " So always go back to these 4 simple rules:\n\n&#x200B;\n\n1. The price is academic\n2. It's only a loss if you sell\n3. **Shorts must cover**\n4. Hold until 🚀🚀🚀🚀🚀🚀\n\nEverything else is noise.\n\nI will post this once a day to keep spirits up and heads in the game. If in any way the SHFs were to refuse to cover their positions and the DTCC and SEC allowed this to happen, they would all essentially be screaming to the entire world, -- and the entire world is watching this shitshow under a microscope -- \"Fuck you, poor people! We're not letting you get rich! We'll break every rule there is if we have to and there's not a single legal thing anyone can do to stop us!\"\n\nThat would **PERMANENTLY** and **COMPLETELY** destroy the US stock market. Everyone the world over would immediately sell every share of every stock they own and never put another red cent into it. I don't doubt some of the HFs wouldn't give a fuck about this, since they're rich and only care about themselves, but about the entire US stock market collapsing and never recovering the SEC would definitely care and wouldn't let it happen. Plenty of powerful politicians own stocks and they wouldn't DARE allow Wall Street to bankrupt them.\n\nSo in addition to the above four rules, you also only need to remember 2 more things at most: 1) that Ryan Cohen is not going to let his company go out of business and if the HFs refused to cover their short positions, **he would sue them and have plenty of whales backing him.** \n\nAnd 2) that DFV just quadrupled down. **If he's still in, we're all still in!**",
    "title": "I think a lot of apes are worried by atobitt's SUPERLATIVE House of Cards post that the DTCC, SEC, et al. will be able to forcibly prevent the squeeze or somehow finagle our shares out of our diamond hands.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvsu0d/i_think_a_lot_of_apes_are_worried_by_atobitts/"
}