{
    "author": "pinkcatsonacid",
    "created_utc": 1627520494.0,
    "distinguished": "moderator",
    "edited": 1627521323.0,
    "id": "otn8to",
    "text_only": true,
    "flair_text": "👍 Court of Public Opinion 👎",
    "name": "t3_otn8to",
    "num_comments": 158,
    "permalink": "/r/GMEJungle/comments/otn8to/this_sub_is_now_set_to_restricted_you_can_message/",
    "score": 1851,
    "selftext": "# [Based on the results of this official poll post](https://www.reddit.com/r/GMEJungle/comments/orfndd/official_poll_please_read_in_full_and_vote/), this subreddit is set to \"restricted\".\n\n&#x200B;\n\nhttps://preview.redd.it/ua8nihqdl1e71.png?width=512&format=png&auto=webp&s=0819495c8c5ae03a387d194defa1883f0a3497c5\n\n&#x200B;\n\n👉 **Restricted status means that only approved members of this community can post.**\n\n&#x200B;\n\n👉 **All other members of the community and the public can still comment and interact with posts (upvote/downvote, award, etc.)**\n\n&#x200B;\n\n# Approvals\n\n&#x200B;\n\n**YES you can message modmail for approval at this time! (There's a shortcut in the sub's menu that says \"Message for approval\").**\n\n&#x200B;\n\nhttps://preview.redd.it/end9hiv8v1e71.jpg?width=1348&format=pjpg&auto=webp&s=bd587ad6955b4191c161af5091caa7ef1a3f0b1a\n\nRight now the backlog is all caught up, so we can begin approving again- just send a message with the word \"approve\" in the subject line (it can vary a bit on the spelling- \"approval\" or \"approve me\" for example- I am still reading each message and approving individually so as long as it lets me quickly see what you're messaging for, it's good). **This is the only way to become an approved member.** **Modmail>subject line \"approve\">body can say whatever you want>approval message should come to your inbox pretty soon after.**\n\n&#x200B;\n\n# You will receive a message notifying you that you're an approved user when you're approved. That's how you know it worked.\n\n&#x200B;\n\nThe only requirement is that your account was created before July 10.\n\n&#x200B;\n\n**If you sent a message before now and have not received approval, please try again**. This method is not fool proof and I missed some, which I've been going back through and catching what I missed. Thank you for understanding!\n\n&#x200B;\n\nSoon once we get settled in, u/bodysurfdan and I will start to implement automod code again and try to find a new normal. Right now I want to focus on getting everyone approved that wants to be here. I have seen some negative comments about restricting this sub and I will just say, we are certainly not the only GME sub or community out there. This one may not be a good fit for everyone and that's ok. Think of this as the lounge where you sit and share a drink with a fellow ape and talk pretty much anything GME. If that's not your vibe, that's totally ok! Each sub has its own culture, no big deal.\n\n&#x200B;\n\nFor future reference, we can always go back to public should we choose to. And we can also go completely private, which would be so easy because we would already have the userbase approved to see content. It's also an option to have only approved users able to comment as well. I think that will likely come up in conversation in the coming weeks, and likely be put to vote. We have many options. We are just trying this one on for size :)\n\n&#x200B;\n\nEdit: in response to \"what's the point if everyone is approved?\":\n\nIn the future, if/when we become more restricted, the userbase will already be largely approved. This makes instant privacy a viable option, say, during MOASS at millis per share when we would *want* to lock the sub down. This is the first baby step in having more options to lock down further in the future, while still having mass access for our userbase already in place. Rome wasn't built in a day!\n\n&#x200B;\n\n**TL:DR- Anyone can comment. Gotta send a modmail with the subject \"approve\" to be an approved user in order to post. But also, we're human and don't have a bot doing approvals. So please be kind if errors are made or it takes some time :)**\n\n&#x200B;\n\nThis will likely be the last update post from me for a bit, and Dan and I will begin to sticky community posts and DD again in the next day or two after the transition is finished. Thank you all for being a part of this community!! 💖",
    "title": "This sub is now set to \"restricted\". You can message modmail with the word \"approve\" in the subject line for approval to post. The public can still comment. Thank you for being an amazing community! 🦍🌴",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/otn8to/this_sub_is_now_set_to_restricted_you_can_message/"
}