{
    "author": "Horror_Veterinar",
    "created_utc": 1626803487.0,
    "distinguished": null,
    "edited": 1626803987.0,
    "id": "oo77hx",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oo77hx",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/oo77hx/oats_the_cat_and_the_coming_surveillance_of/",
    "score": 675,
    "selftext": "Hello, individual investors!\n\nI must say, I'm very pleased with my investment so far.\n\nNO DATES!  \n\n\nHowever, here are some dates of interest!\n\nLet's talk about OATS! No, not the kind found in your Lucky Charms, but the Order Audit Trail System!\n\n&#x200B;\n\n**WHAT IS OATS?**\n\nI'm glad I asked! Let's dive in:\n\n&#x200B;\n\nhttps://preview.redd.it/o0sq6djljec71.png?width=1106&format=png&auto=webp&s=6657a10d13871d958315621905b877267e3121bb\n\n&#x200B;\n\nhttps://preview.redd.it/lvn6r7spjec71.png?width=632&format=png&auto=webp&s=09bc9e1e600ed48a81b1d4326d018099786a592b\n\nWant some interesting history? Well, the OATS system was established in 1998. That's right! Over 20 years ago! It's basically an order tracking system that is designed to **re-create events in the lifecycle of an order and more completely monitor the trading practices of member firms.**\n\nNow, the reason why they implemented the OATS system is quite interesting.\n\nBack in 1991, there was a hearing conducted that involved ***THE SALOMON BROTHERS,*** **who is now CITIGROUP GLOBAL MARKETS.**\n\nWhat's so special about Salomon and Citigroup Global Markets?\n\nWell, the book-keeping manager for $GME JUST SO HAPPENS TO BE SALOMON SMITH BARNEY! \n\nThe hearing that I'm referring to is a hearing regarding a Treasury Bond scandal that Salomon Barney was caught in, and they had no other than Warren Buffet come in to clean up their act.\n\nHere's an excerpt from the hearing:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xlgct83skec71.png?width=1110&format=png&auto=webp&s=511abd5e1ff6089635c56cb2bf9c4818417e94ed\n\nBuffet goes on to say \" and a spirit about compliance is as important or more so than words about compliance. I want the right words and I want the full range of internal controls but I also ***have asked every Salomon employee to be his or her own compliance officer.\"***\n\n**Ah! What a solution, Buffet! Have them be their OWN compliance officer! What could go wrong!**\n\nBasically, they criticized Salomon brothers for their fraudulent acts, brought up the fact that most volume was executed ***OFF EXCHANGE*** and were concerned about how much power Salomon Smith Barney had. ***Sound familiar?*** At the time of this hearing, they were the biggest bank on Wall Street, and later on would become the ***UNDERWRITERS FOR GME.*** (Handled their first IPO offering)\n\nInterestingly enough, they also accused Salomon Brothers for causing a ***intentional short squeeze*** in the Bond market. Full circle?\n\n**One final note related to Salomon Smith (tinfoil for a second)**\n\nI'm just going to leave these right here:\n\n&#x200B;\n\nhttps://preview.redd.it/ywdvk1f9lec71.png?width=1054&format=png&auto=webp&s=533b6ea8daafa43e7dcf60be3b2554971bc5da85\n\n&#x200B;\n\nhttps://preview.redd.it/rk0zjx6blec71.png?width=851&format=png&auto=webp&s=17441a1ebe4ebf9da8b434d2060096f8bbc403e7\n\n\\--------------------------------------------------------------------------------------------------------------------------------------\n\nBack to the OATS!\n\nSo anyway, the OATS is being retired August 31st of this year, making September 1st the first day that the OATS will no longer be used.\n\nSo you might be asking yourself... ***WHAT IS TAKING ITS' PLACE?***\n\nWell, the Consolidated Audit Trail, of course! or the CAT!\n\nNow, let's look at the CAT, and what it brings to the table:\n\nThe Consolidated Audit Trail, or the CAT, is basically an upgraded ***surveillance system*** that is supposed to ***track*** events during the lifecycle of an order, rather than ***re-create*** events. In other words, they will see interactions taking place between members in real time.\n\n***I FELL THIS IS HUGE!***\n\n***\"Charlie, you still have faith in the system?\"***\n\n\"***Absolutely not!\" But it's fun to pretend.***\n\nSo the reason why I think this is a big deal, is because, again, the legacy system (OATS) has been in operation since 1988, and it's now 2021, and we're FINALLY getting an upgrade with big differences.\n\nAmongst these differences:\n\n&#x200B;\n\nhttps://preview.redd.it/cnhblun4mec71.png?width=1114&format=png&auto=webp&s=eed4176ae3c3a95bcc246fdd6608b927f08919b4\n\nBroker dealers, or \"INDUSTRY MEMBERS\" as defined by the new Consolidated Audit Trail rule, or rule 613, will be REQUIRED to submit customer, order and trade information in \"NMS Securities\", or exchange stocks and options, AND OTC equity securities across **ALL MARKETS** to the **CAT Central Repository.**\n\nTHIS IS A CRITICAL DIFFERENCE\n\nThe OATS had no accountability for broker-dealers, and we all know the shenanigans that go on between them. (security lending, rehypothecation, etc)\n\n&#x200B;\n\n**NMS STOCKS**\n\n&#x200B;\n\nhttps://preview.redd.it/w41eu33smec71.png?width=1109&format=png&auto=webp&s=8d4691dc4c33ec7981f657f9d821d6af65aca6b7\n\nAs you can see, the NMS rules have been updated to reflect the new CAT: Rule 613.\n\n[https://www.catnmsplan.com/](https://www.catnmsplan.com/)  <-- Great resource to learn more about the CAT\n\n&#x200B;\n\nhttps://preview.redd.it/a7c239w9nec71.png?width=618&format=png&auto=webp&s=b5cf4aacabd351f9ddc59fcc67e8d0bae249a440\n\nTL;DR\n\nThe OATS (order audit trail system) created in 1998 to combat the manipulation taking place off exchange, was a system designed to re-create events in the life-cycle of an order to hold member firms more accountable and detect malpractice.\n\nOver 20 years later, that system is now being replaced by the Consolidated Audit Trail, or the CAT, to actually ***track orders throughout their lifecycle, including OTC, options, and equities, and between ALL members, including BROKER-DEALERS,*** a key difference from the OATS. The OATS will be retired on September 1st, and the CAT will then be implemented! This has taken over 20 years to get out, and hopefully will allow for a better market for us all. (one can only hope)\n\n&#x200B;\n\nhttps://preview.redd.it/rr7vf45goec71.png?width=645&format=png&auto=webp&s=787585827ea43295bee78549a47057e487267e87\n\nI LOVE THE STOCK",
    "title": "OATS, the CAT, and the Coming Surveillance of Broker-Dealers!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oo77hx/oats_the_cat_and_the_coming_surveillance_of/"
}