{
    "author": "Diamond_Hands_10000",
    "created_utc": 1619578928.0,
    "distinguished": null,
    "edited": 1619626520.0,
    "id": "n05fe8",
    "text_only": true,
    "flair_id": "681d08c4-85f9-11eb-a69c-0ecac3178a19",
    "flair_text": "Question ❓",
    "name": "t3_n05fe8",
    "num_comments": 284,
    "permalink": "/r/Superstonk/comments/n05fe8/can_anyone_explain_why_all_september_17_options/",
    "score": 2454,
    "selftext": "#Edit 5:\n\nI've decided to remove the text in this post for now because the last thing I want to do is mislead anyone. I've made other edits stating not to get too excited.\n\nSo far, nobody's been able to find anything to verify that there were ever any options for September 17. Even the waybackmachine shows there wasn't.\n\nSo, for now at least, I recommend everyone take it for a grain of salt and consider it to be nothing.. Just to err on the side of caution and not get anyone's hopes up. (Too late 😞)\n\nI'm still not sure what the heck is going on with that. I'm looking into it, but my best guess is I may have been mistaken and have been looking at AMC's option chains. If so.. Good God I'm retarded.\n\nNo idea why Fidelity shows that date for September 17 then.. Others have suggested it may be opening up to options soon. I just don't know.\n\nWell, I slept, I watched GME for hours on end, and did a bit of research. Found nothing. 💩 I'll keep trying to make some sense of this while I eat. If I find out anything definitive, I'll update this post again.\n\nAnd thanks everyone for all the support and coming together to help figure this out. I'm very sorry if this turns out to be nothing but my own insanity. (But seriously though.. Why the HELL does Fidelity have that date?!)",
    "title": "Can anyone explain why all September 17 options have entirely disappeared?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/n05fe8/can_anyone_explain_why_all_september_17_options/"
}