{
    "author": "animasoul",
    "created_utc": 1618425496.0,
    "distinguished": null,
    "edited": false,
    "id": "mqwyg3",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mqwyg3",
    "num_comments": 179,
    "permalink": "/r/Superstonk/comments/mqwyg3/financial_mafias_and_equity_swaps_and_how_one/",
    "score": 2028,
    "selftext": " Apes… You have no idea what you did. With your diamond hands you cut off the blood supply to the “great vampire squid wrapped around the face of humanity” aka Goldman Sachs.\n\nThis moniker was coined by Matt Taibbi in his legendary article **“The Great American Bubble Machine”** from 2010 in Rolling Stone that made a big splash at the time, just after the great financial crisis.\n\n&#x200B;\n\n[Rolling Stone](https://preview.redd.it/c83ut5uul6t61.png?width=695&format=png&auto=webp&s=ffd812ad8cb836f82be1145d8756600258638c34)\n\n# GS is everywhere. So how is it involved in GameStop?\n\nGS is one of **Melvin**’s prime brokers, as you can see from Melvin’s filing here: [https://reports.adviserinfo.sec.gov/reports/ADV/173228/PDF/173228.pdf](https://reports.adviserinfo.sec.gov/reports/ADV/173228/PDF/173228.pdf)  \n\nGS was also the prime broker to the family office **Archegos**.\n\nGME was not Melvin’s biggest short. Its biggest short was **GSX Techedu**. And GSX also squeezed incredibly in Jan but was not widely reported in MSM.\n\n&#x200B;\n\n[\\\\\"Institutional Investor\\\\\" website](https://preview.redd.it/apsmndg5m6t61.png?width=697&format=png&auto=webp&s=4e3993a8e799ca58fac7dc686284688f89f4467a)\n\n&#x200B;\n\n[GSX Techedu squeezing in Jan](https://preview.redd.it/3iifcea7m6t61.png?width=844&format=png&auto=webp&s=54eb7fe5aa31471b91683a19ed6b6a7a7c03bd7e)\n\nMelvin had a levered **short** position in GSX Techedu financed by Goldman.\n\nArchegos had a levered **long** position (via equity swaps) in GSX Techedu financed by Goldman.\n\nSo Goldman was making money in prime broker fees on the same security on both the long and the short side. If you remember the equity swap diagrams in my previous post ([https://www.reddit.com/r/Superstonk/comments/mobnyf/the\\_anatomy\\_of\\_an\\_equity\\_swap\\_how\\_prime\\_brokers/](https://www.reddit.com/r/Superstonk/comments/mobnyf/the_anatomy_of_an_equity_swap_how_prime_brokers/) ), you will know that the prime broker relies on shares being readily available and constantly flowing through the financial system.\n\n# Here’s what doesn’t make sense to me\n\n**Question 1:** Why did Archegos have an enormous long position with enormous leverage in a company like GSX Techedu which is worth $6 billion yet has never been audited? **Muddy Waters** offered evidence that the company was a fraud and that its customers were actually bots, hence its interest for short sellers, including **Melvin**.\n\n&#x200B;\n\n[No link - my post gets deleted](https://preview.redd.it/z85ya5llm6t61.png?width=791&format=png&auto=webp&s=23e430ed4b3ad11aceb8356ce2569e1165c83d5a)\n\n**Question 2:** Why would the big banks provide so much leverage to create such a massive long exposure in a fraudulent company? Unless they thought that the leverage could engineer a sure thing. \n\n**Question 3:** MSM is saying Archegos was “margin called”. But why? When you look at the price charts of some of Bill’s long swaps, they were doing great. Bill was making money. Until GS tanked his shares.\n\n&#x200B;\n\n[Bill's longs - until GS tanked them](https://preview.redd.it/org6uxgrm6t61.png?width=1008&format=png&auto=webp&s=1d4606eca73732c1928f0da6e3d89cd5e9feb0e5)\n\n# My speculative answer\n\nWhat happens to a prime broker when its hedge fund client fails? You can read the details here in my previous post: ([https://www.reddit.com/r/Superstonk/comments/mobnyf/the\\_anatomy\\_of\\_an\\_equity\\_swap\\_how\\_prime\\_brokers/](https://www.reddit.com/r/Superstonk/comments/mobnyf/the_anatomy_of_an_equity_swap_how_prime_brokers/))    \n\n**TLDR: If a hedge fund client fails and shares are not available to unwind the swap, the PB is f\\*\\*ked.**\n\nMelvin’s biggest short was not GME. It was GSX. Both GSX and GME squeezed at the end of Jan. GSX because of Bill. GME because of apes.\n\nRemember that GS was financing Bill on the **long** side of GSX. GS was fine as long as both the short and the long client were making their payments and GS was making money between them. But with apes diamond-handing GME, Melvin collapsed, putting an end to this jolly threesome.\n\nGS was likely helping Bill to squeeze GSX but probably wasn’t planning on blowing up Melvin completely, it just wanted to suck as much money as possible out of both of its clients. For that, they need to be alive. Think, parasite. Or vampire squid.\n\n&#x200B;\n\n[Vampire squid](https://preview.redd.it/8d4roundn6t61.png?width=308&format=png&auto=webp&s=401f695a214fe4bfc2bcaff84ab15e997e606cd3)\n\n  \n\nSo Melvin died, but was put on life support with a bailout from Citadel and Point72. My theory is that Kenny did this to help GS and the other brokers rather than Melvin itself. If you refer back to the diagrams in my equity swap post, you can see that for a prime broker, a short client failing is much worse than a long client failing. Archegos was still going strong, but GS didn’t like the threesome any more without Melvin. *GS only had a sure thing when it was the one in between getting payments from both sides.* Now Archegos is also dead. But GS is still alive. And Melvin, sort of. Melvin is now GS’s albatross.\n\n&#x200B;\n\n[Legendary](https://preview.redd.it/8f8u0ksgn6t61.png?width=564&format=png&auto=webp&s=5efab0a854cbc1844135cc2256b8929d946852d1)\n\n  \n\nThis doesn’t change my theory so far, it just strengthens it. **TLDR if you haven't read my previous posts**  🚀🚀🚀🚀**:** Citadel is helping the prime brokers by doing what it can as a market maker to bring the price of GME down and to engineer “doomsday” (see Kenny’s FT interview) while the position net short on equities and long on gold to make money and to insulate themselves from a market crash. Because GME’s beta is so negative, this seems to mean that to do this, GME will have to moon. We have known for a long time that GME has a weird beta, but **so does GSX Techedu**. Don't ask me why. Are extremely negative betas the new normal?\n\n&#x200B;\n\n[Macroaxis, 14 April 2021](https://preview.redd.it/d83nxi0sn6t61.png?width=738&format=png&auto=webp&s=edcfd167ba73601d2f92a7bf7edf4cac73b606ac)\n\n&#x200B;\n\n[Macroaxis, 14 April 2021](https://preview.redd.it/xlycmnmtn6t61.png?width=734&format=png&auto=webp&s=e6449fd47fb995c8274c131b6a6576c4d192dd3e)\n\nI was going to share some sources but my posts gets deleted. Otherwise, you can find plenty on Goldman online if you google \"Goldman\" and \"mafia\" together.\n\n&#x200B;\n\n[No link](https://preview.redd.it/sc08ssy1o6t61.png?width=810&format=png&auto=webp&s=d60b87c3ba281a33d0e3ca9bb05e45ab2fe2a8e6)\n\n# Last question\n\nWhere is Bill Hwang? Is he dead? Is he in the Caribbean? Why isn’t he suing Goldman? Makes me think of this movie.\n\n&#x200B;\n\n[Movie recommendation](https://preview.redd.it/yf4gvik5o6t61.jpg?width=590&format=pjpg&auto=webp&s=093b70aab5e51c0ed83dfa91b0f022db876be5b9)\n\nCheck it out – is a very good financial thriller about private money, special relationships and sacrificing your life as a whistleblower.\n\nDisclaimer: Not financial advice of course. Educational and entertainment purposes only.",
    "title": "Financial mafias and equity swaps – and how one prime broker rules them all 👁️",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mqwyg3/financial_mafias_and_equity_swaps_and_how_one/"
}