{
    "author": "possibly6",
    "created_utc": 1618438670.0,
    "distinguished": null,
    "edited": 1618500105.0,
    "id": "mr1fvf",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mr1fvf",
    "num_comments": 124,
    "permalink": "/r/Superstonk/comments/mr1fvf/gme_price_levels_to_watch_415/",
    "score": 3754,
    "selftext": "edit: 70% upvoted, shills hard at work and i just posted this. just go buy some damn gme shares and you'll make more than whatever the fuck you get paid to downvote gme posts 🤡\n\nApes and Apettes, finally some mothafuckin ACTION! Welcome back to your (sort of daily) price action recap and price levels to watch for the week. I'm your host u/possibly6 and boy do I got some sweet confirmation bias for you.\n\nAs always, this aint no mothafuckin financial advice, hoe. The views expressed here are solely my approach to investing in this specific equity. I ape an am.\n\nobligatory.\n\nMy apologies for not posting daily anymore, I try to post updates every day but I'm a full time student and run a trading group so if I ever miss a day, just assume I'm a very busy ape.\n\nAnyway, finally a decent green day for GME. Did you buy more? I know I did. I buy at least 1 share every day the squeeze is not squoze, I'm happily in the triple digit range now and if I wasn't a broke young ape I would have many more (I buy more from my trading profits but I'm running out cause I'm 100% GME lol, I don't come from a super wealthy family or anything. Learning how to trade the markets is a priceless skill)\n\nSo what happened today? Here's a view of GME intraday.\n\n[5m view ](https://preview.redd.it/h77v1jnfl7t61.png?width=2856&format=png&auto=webp&s=c47c24ee6c325d90438335615ce337d331a9e5cd)\n\n2 hours into the trading day, GME was up 29.81 points on higher than usual volume. Compare the volume bars of yesterday and today, you can clearly see the relationship.\n\nIf you missed my last post, I trade off mainly elliot wave theory now. I am nowhere near an expert, but have been putting most of my time into learning it, and I must say I am pleasantly surprised.\n\nHere's the 4 hr view of GME so you can visualize my waves.\n\n[4 hr view](https://preview.redd.it/g58z4f8gr7t61.png?width=2854&format=png&auto=webp&s=b49c2ecdd57dc1e0abf9e26cd101ea2446af60e1)\n\nYesterday appeared to complete our wave 2 retracement at 132 so I updated my targets as follows. I see today's movement as wave 1 of 5 inside of a bigger wave 3 of 5. If today's movement is still wave 1, it would be confirmed by a push to 181-183 ish. If that happens, expect a retrace to about low 160s high 150's, followed by a push to 230+ to complete wave 3.   Given today is a wave 1 of 5 inside a 3 of 5, there are 5 waves inside of THESE waves.\n\nWhat's important is we **BROKE THE DOWNTREND !**  this confirms that we are no longer in a corrective wave (2) and in fact starting wave 3 of 5 (white line that goes up)\n\nThat being said, we did not hit my first target price today of 181. We retraced 50% of the first move intraday today to 158.55, confirming the move from open to the HOD was indeed a wave 1 of 5. Remember wave 2 (correction after wave 1) targets at least a 50% retracement of wave 1. **Look at the white line.**\n\n[5m View](https://preview.redd.it/jyrvwcton7t61.png?width=2856&format=png&auto=webp&s=1d3e42f672fc4091c885e3ab48d6cc3770f1950c)\n\nNow here's where it gets interesting. This likely won't make the most sense but I will try my best. Remember how there are waves inside of waves and they follow the same rules as the bigger waves. Let's connect yesterday's low to today's high and see what the retracement targets come out to. Remember we're looking for minimum 50%.\n\n[1hr view](https://preview.redd.it/z0872t1mp7t61.png?width=2868&format=png&auto=webp&s=6cab9219b5a1a6eeffaf0ec2b63a0c7313b32e50)\n\nThe purple lines represent the waves inside the waves inside the waves (a lot to stomach i know, my head is spinning trying to explain lol) with **ROUGH ESTIMATES** from someone who literally just started studying EW theory, so take it with a grain of salt.\n\nTo confirm our retracement, I am looking for price to hit somewhere between 153 and 155. After this is hit, wave 3 targets a 1.618 extension of wave 1, putting our **ROUGH**  wave 3 of 5 pt between 238 and 240. We could very well blow right past it as their is a lot of shit going on behind the scenes that could ignite this rocket, but from a basic TA perspective thats what I'm looking for tmr.\n\nThe main reason I don't write these as frequently anymore is because even as a technical trader, I don't care about the price. Last time I checked its not at $10,000,000/share, so the only button I can see on my brokerage is buy.\n\nReal quick before  I sign off, it's important to note the relative volume. Sure, we finished up over 18%, but volume was only 21m. Can you imagine how explosive this rocket will be when we have some serious firepower in this bitch?\n\n&#x200B;\n\n[Daily View](https://preview.redd.it/y35xsw58r7t61.png?width=2850&format=png&auto=webp&s=6f44fad419573006a69434edcc3e6eea69dd261d)\n\nThis is probably very confusing so I will explain what I am seeing in ape terms.\n\nTLDR: Good price action today on relatively low volume. Using EW theory, I would like to see a retest of 153-155 before making the next leg up to 200+ in the very short term. If you can scoop up shares for sub 200 you're still getting a steal of a price, what goes down (artificially) must go back up! 🚀\n\n&#x200B;\n\nobligatory 🚀 🚀 🚀 🚀 🚀 🚀\n\nEdit: I bought a shirt from GameStop and posted it on my insta story, they saw i tagged them and actually responded! that was all the confirmation bias i needed. \n\nhttps://imgur.com/gallery/1ypF9v3\n\nEdit 2: 2 hours into trading today, my wave 2 target was hit. If we hold these levels we’re looking good into wave 3 😎 https://imgur.com/gallery/dtCzntW",
    "title": "GME Price Levels To Watch 4/15 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mr1fvf/gme_price_levels_to_watch_415/"
}