{
    "author": "strong-ape-bro",
    "created_utc": 1627865091.0,
    "distinguished": null,
    "edited": 1627884492.0,
    "id": "ow439w",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_ow439w",
    "num_comments": 243,
    "permalink": "/r/GME/comments/ow439w/gme_moass_debt_ceiling_suspension_expired/",
    "score": 4029,
    "selftext": "Way too much FUD this weekend!!\n\nLet's go down a quick list:\n\n- \"The markets crashing won't necessarily trigger MOASS\" -- sure, let's just dismiss countless months worth of research on collateral, collateral requirements, and prime brokers liquidating their clients (Shitty Hedgie Fundies). NOT! **Markets crashing will make the MOASS exponentially much more imminent**.\n- \"Politicians are corrupt!\" -- gee, color me surprised? Don't be scared hedgie, we are throwing you in PRISON!\n- \"Here are the X politicians who didn't report their stonks!\" -- are we the congress police now or some shit? bad fud\n- \"The shorting bill BARELY passed!\" -- haha, okay? but it passed, so suck it.\n- \"Robinhood has lost X amount of money on Y date\" -- okay, and who cares?\n- \"Post MOASS there will be a WEIRD situation\" -- what's that? wall street being thrown in prison? not all that weird to me.\n- and many more\n\nThe POINT is: we are being slided on. Do not let all these haters distract us from the **cold, hard, facts**:\n\n- Debt ceiling suspension has EXPIRED\n- Congress in a deadlock in regards to the debt ceiling, on vacation for 6 weeks\n- **Collateral assets to become more expensive**\n- **Shortage of T-Bills**\n- **Secretary Yellen posturing to resort to \"emergency measures\"**\n- Evictions are back on the menu\n- **S&P 400 MidCap inclusion**.\n\n# Keep your eye on GME! MOASS, GME, BUY, HODL, MOON, HYPE. \n\nWe need to be speaking about GME, GME, GME and not what Robinhood is doing, or how corrupt our politicians are. I can't believe we fell for it this weekend.\n\n Anyhow: GME 🚀\n\n🐘🦍**TITS JACKED** 😍✅💰",
    "title": "GME MOASS 🚀!!! Debt ceiling suspension expired ✅, Eviction order expired ✅, S&P 400 MidCap inclusion on 8/4, and more!! Don't let all the shitty FUD from this weekend derail us. GME go MOON 🚀🤑",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GME/comments/ow439w/gme_moass_debt_ceiling_suspension_expired/"
}