{
    "author": "jsmar18",
    "created_utc": 1618279415.0,
    "distinguished": null,
    "edited": 1618318269.0,
    "id": "mpsrno",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mpsrno",
    "num_comments": 156,
    "permalink": "/r/Superstonk/comments/mpsrno/we_dont_know_if_blackrock_and_co_will_recall_and/",
    "score": 1369,
    "selftext": "We're coming up to several important dates reegarding share recall. I think it's safe to temper expectations in light off the recent market manipulation of GME. Let's take a historic view of what has happened previously with BlackRock and share recalls as well as some base knowledge regarding recall risk.\n\n**We’ll cover:**\n\n1. How do shorts, short?\n2. Why loan to a shorter?\n3. WTF is recall risk?\n4. What drives an Institution to recall shares?\n5. Some spicy speculation on BlackRock\n6. A look ahead to what’s on the horizon (more spicy-ish speculation)\n\nLet’s get into it, and as always - hit me up with conjecture, opinions and thoughts!\n\n# 🩳 How do Shorts, Short?\n\nLet’s start with how short-sellers actually get themselves into a position too short in the first place, I feel like this is an important part overlooked by many.\n\n**Hedgefund:** Hi BlackRock (or any other large lender), you **willing** to lend me this stock so I can short it?\n\n**BlackRock:** Sure buddy, just give me collateral equal to it which is marked market value daily and a haircut on top then we got a deal! Oh, I’ll also charge interest for the time you’re borrowing them - hope you don’t mind.\n\n**Hedgefund:** Sick, can’t wait to run this company into the ground! Thanks!\n\n*Marked market value = An increase in stock price prompts a margin call for more collateral, decrease in price entitles short seller to withdraw some*\n\nAs we know from before SI % was adjusted, it was well above 100%. I’d link, but it’s well documented anywhere on [r/GME](https://www.reddit.com/r/GME/).\n\nSo repeat the conversation they had with BlackRock with a bunch of other large lenders out there AND borrowing shares from brokers (think margin accounts), then you have what has resulted in an incredibly high SI % in early 2021 (and if you believe now, which I do, yes now as well).\n\n&#x200B;\n\n[GME SI against Stock Price](https://preview.redd.it/cxmc99enkus61.png?width=1252&format=png&auto=webp&s=aa585c6ff325333f501a036ce020c8f6f21ef6d7)\n\nHere are two pictures just to recap on what historical SI has looked like as well as GMEs stock price. They roughly match up on the x-axis for the most part.\n\nLet’s put aside brokers for another day and focus on the large financial behemoths such as BlackRock, Vanguard etc…\n\n&#x200B;\n\n# 📉 Why loan shares if the underlying asset they own is getting pile driven into the ground?\n\nI’ll take BlackRock as an example as they’ve been in the limelight in the recent past with [Elon ](https://twitter.com/elonmusk/status/1048015756569407488?s=20)throwing shade at them regarding short-selling practices in 2018.\n\nTheir whole position on why they view short selling is good can be found [here](https://www.blackrock.com/corporate/literature/publication/securities-lending-viewed-through-the-sustainability-lens.pdf). They take it as, short selling is good for market efficiency, liquidity, yada yada, which hey - for the most part I agree on to an extent. BUT what i want to focus on here and in many other [papers](http://daniel-schmidt.eu/pdf/passivelenders.pdf) is that stocks with a high % of large passive investors, through lending and short selling result in **faster price discovery**.\n\n**Thought exercise:**\n\nTake a moment and put yourself in say BlackRocks situation, if say, Shitadel or Melvin, or any one of a hundred different HFs came to you asking to borrow not just GME but any stock for shorting purposes\n\nWhy would you say yes to letting them short it, knowing that it leads to faster price discovery?\n\n\\--------------------------------------------------------\n\nIntermission. Use your brain and think about it, you smooth brained ape, develop that wrinkle!\n\n&#x200B;\n\nhttps://preview.redd.it/gl9ilg5qkus61.png?width=1284&format=png&auto=webp&s=6b22725f7312e6a9b42285f2313293bfca14b9df\n\nIntermission over.\n\n\\--------------------------------------------------------\n\nFaster price discovery is [associated ](https://www.idc.ac.il/en/schools/business/documents/paper-june-sokolinski.pdf)with a lower likelihood of large negative returns (there’s a lot of research that aligns with this).\n\nOr if you followed a similar thought pattern to me in the exercise above:\n\n*“If I find the ground truth faster of a stocks price, I can probably manage my risk better when it comes to returns for my investors.”*\n\nThe other side you may have thought of regardless of price discovery or not is:\n\n*“I have done my research, and I think this company is undervalued and will increase, so I’m happy to lend my shares for some decent $$$ in the meantime”*\n\nNote, the above steers clear of the more speculative reasons such as intentional market manipulation - I’m proceeding with what I view as a fairly solid assumption that passive investment funds are playing a “fair” game.\n\nIf they innocently lent out the shares with either of these forethoughts and were faced with the impending collapse in stock price, **why did they not recall their shares earlier to protect their clients?**\n\n&#x200B;\n\n# 📉 Recall Risk\n\nThe two main risks short sellers take on when shorting are margin risk and recall risk. We’ll be focusing on the latter.\n\nRecall risk simply refers to the fact that lenders (or brokers) are able to recall borrowed stock at any time, triggering involuntary close-outs. We don’t know when passive funds lent their shares to shorters such as Shitadel and Melvin - but what we do know is and as mentioned above, SI remained at a reported high until early 2021 (and again, if you believe as I do, remains high).\n\nAs such the assumption here is that shorters have been living under the umbrella of recall risk for a long time now.\n\n&#x200B;\n\n# 📈 What Drives Institutions to Recall Shares?\n\nThere has been a decent amount of research on this topic, most arriving at the same conclusion yet again. Here’s a quote that sums it up nicely from a [paper from UNSW](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2831261).\n\n>*“....High recall activity coincides with institutional selling of the stock and precedes stock price declines, suggesting that lenders recalling the stock act on superior information.”*\n\nWell, that goes against everything we’ve observed…. or does it…?\n\n&#x200B;\n\nhttps://preview.redd.it/ij6svjuskus61.png?width=1348&format=png&auto=webp&s=50618014ce6ceca62c8134c173502e4f536267a5\n\nLet’s go back to our candle chart, marked here is when the last share recall was announced in 2020. It’s also well known that BlackRock did not recall their shares then. This indicates that they were lent out. *(We also witnessed an increase of double in price due to some shares being recalled i believe)*\n\n&#x200B;\n\n# ⏪ Rewind, Why didn’t BlackRock Recall Shares in 2020?\n\n**Activism Existed before RC**\n\nFew may know that activist action began before RC, although they had a [different take](https://news.gamestop.com/node/16636/html) on [“activism”](https://www.thebalance.com/what-activist-investors-mean-for-your-investments-4158859) compared to RC.\n\nBack in [February 2019](https://news.gamestop.com/node/16636/html) (and again in [March 2019](https://news.gamestop.com/node/16636/html)), Hestia and co’s (a coalition of investors) activism took on a more strategic business view lens compared to the vision lens that RC has on. This was in terms of deriving stockholder value through share repurchases, operational efficiency and hiring the right CEO and setting correct incentives for them.\n\nYou can view this as your typical activist approach, for better or for worse. Fun fact Mr Michael Brrrry voted against them in the following section.\n\n**2020 Shareholder Meeting**\n\nBlackRock said it themselves [here](https://www.bloomberg.com/opinion/articles/2019-12-03/making-life-harder-for-short-sellers) what their logic is behind recalling shares, and hey it makes sense.\n\n>*“The decision whether to recall securities on loan to vote is based on a formal analysis of the revenue producing value to clients of loans, against the assessed economic value to clients of casting votes would be less than the securities lending income...”*\n\nBased on the notice of what would be voted on in the [2020 Annual Meeting of Stockholders](https://investor.gamestop.com/static-files/b13f5287-348a-460d-af8e-ed204416435d), we can observe that it was time to elect 10 directors, this included two from *Hestia Capital* and *Permit Capital*, who are the activists.\n\n&#x200B;\n\n[2020 Proxy Notice for Shareholder Meeting](https://preview.redd.it/3zfqec0vkus61.png?width=1344&format=png&auto=webp&s=b36fb22da4866e96134e78705e8639db682d0d4a)\n\nWhile it looks like this would be a good chance for BlackRock to recall shares to vote, does it make sense for them to? Surely this would prove fruitful for their clients?\n\n&#x200B;\n\n# 🚀 Speculation Warning 🚀(New thing I’m trying when I go into big-time speculation mode)\n\nWell, not exactly, we know insider information exists, and it’s evident through the research paper linked and discussed above and many others. I see a few reasons why they would not recall.\n\n1. They knew who would vote and how, rendering recalling shares a negative outcome for clients (if you were to make a decision that’d cost $$$, you’d surely do the game theory too)\n2. Even if the activists did not get voted in, Sherman had a business transformation plan underway (the reason why Brrry voted against the activists)\n\nThese two speculations alone, either way would be reason enough not to recall shares. Everyone knows the stock is undervalued, it’s been spelled out many times in many letters to GME, and DFV even caught wind through his gigantic ape brain.\n\n**In summary:** They did not recall as they knew or had an idea of how the vote would play out without them.\n\n&#x200B;\n\n# 💎 Let’s Circle Back\n\n>*“....High recall activity coincides with institutional selling of the stock and precedes stock price declines, suggesting that lenders recalling the stock act on superior information.”*\n\nSo based on the analysis we’ve gone through on why passive investors such as BlackRock enter a lending agreement with short sellers, a plausible reason why they did not recall last shareholder meeting, and certain evidence they did have their shares on loan due to the prior point, that leaves us with:\n\nWhy did they not recall when their stock price started to tank? After all, it would have produced a negative outcome for their clients if GME were to be shorted into oblivion and the quote above states that recalls usually coincide with stock price declines, in order to protect their clients.\n\n&#x200B;\n\n# 🚀 Speculation Warning 🚀\n\nI believe they made a bet against the shorts, knowing full well that GME was undervalued at the time they lent the shares out (we don’t know when). I won’t go into whether they tee’d up RC, however, I’m speculating they made a bet that if the price was shorted into a range where the share price became so unbelievably attractive, and the stock so unbelievably undervalued, that someone would come along and to turn around the company.\n\nThis is why they never recalled their shares until now, I believe they were very much happy sitting there reaping the benefits of interest being paid to them while they played the long term game. Win-win right?\n\n**So in summary:** They made a bet against the shorts based on the fundamentals of GME. Huh, funny that.\n\n&#x200B;\n\n# 🔮 Looking Ahead\n\nIt’s well known we have a shareholder meeting coming up and I think the date floating around is somewhere mid-April, similar to last year for a share recall from GME. Funnily enough, I’ve been writing this DD up over the past few days, and what just came out?\n\n&#x200B;\n\n[2021 New Release Announcing RC up for vote for Chairman](https://preview.redd.it/ms1p3cuxkus61.png?width=1342&format=png&auto=webp&s=0ae0e236dd45dde6d1dfeda224166db89bfd6afd)\n\nThis bad boy. Oh yeah.\n\n**What can we expect?**\n\nWe know how BlackRock makes decisions when it comes to recalls, they said it [themselves](https://www.bloomberg.com/opinion/articles/2019-12-03/making-life-harder-for-short-sellers).\n\nWe [have an idea](https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-slate-director-candidates-2021-annual-meeting) of what’ll be on the agenda when it comes to the voting side of things (5 new Chewy affiliated directors up for vote), last year in [Schedule 14A](https://investor.gamestop.com/static-files/b13f5287-348a-460d-af8e-ed204416435d) we had the “Notice of Annual Meeting of Stockholders” that outlined what shareholders are asked to vote on in detail. We’re waiting to access this proxy once it’s outlined on their website or the SECs for 2021 **(apparently around the 15th April is what i'm reading)**.\n\nNow, you might be thinking based on what we’ve gone through - this feels strangely odd. There are activist investors once again, there are board seats to be voted on…. So…..?\n\n&#x200B;\n\n# 🚀 Speculation Warning 🚀\n\nI’ll probably get lynched for saying this…. But it’s my speculation that I don’t believe they’ll recall shares based on the current information available. Yes. A sad ending to a long DD. We don’t often have sad endings in DDs written about GME, but hey, it’s good to remain grounded.\n\nA lot of predictions/speculations on here don’t come true often because we’ve got tendie-glasses on, clouding our judgement.\n\n**The reason I believe this is**, based on what we’ve seen happen last year, there’s a good chance that BlackRock and co know that it’d be relatively insane to vote against this (some pretty average activists investors were voted in last time right?), so as per last year, why waste money for their clients through a recall?\n\nSaying this, we do not have the [proxy statement yet](https://news.gamestop.com/shareholder-services/online-investor-kit). So don’t go all doom and gloom on me with the pitchforks just yet….\n\n\\--------------------------------------------------------------\n\nHAPPY EDIT:\n\nAlso forgot about retail investors, yes - ofc RC being chairman is a reason to recall. This is not just about institutions.\n\n\\--------------------------------------------------------------\n\nThere could be another non-voting related reason for institutions like BlackRock to recall shares, which is to fuck with the shorts…. But wouldn't you rather siphon money from them while they have money until the time they implode? If what we’re saying regarding DTCCs insurance policy is true, then they’ll get their tendies regardless while removing a key enemy?\n\nOkay, now you can prepare your pitchforks, I'll be hiding behind the barn…\n\n# Saying all this, take solace knowing that the shorts are still fucked, there's too much evidence that they are in the hole (and it's getting deeper). No matter what way you look at it.\n\n# This is just one of many catalysts they need to dodge. We after all only need to win once, they need to keep dodging them every single time.\n\n&#x200B;\n\n# 💥 Bonus Content TD TOS Update\n\nYou may or may not know, but I wrote a [post](https://www.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/) trying to debunk TD TOS “bugs”. I was wrong. So I went on a mission to try and figure out wtf they were. I spent hours reconciling volume to the glitch volumes to no avail.\n\nLuckily a smart ape based in the US helped out and simply got on the phone to tech support to discuss them.\n\nIn summary, this was the convo.\n\n>*He said their technical team is aware of \"the bug\" in the total volume count in Active Trader; it previously occurred with futures contracts, and they're aware that \"it's currently occurring with some stocks.\" Here's what they asked us to:1) Take screenshots throughout the day; they're not concerned with after-hours2) Send screenshots to* [*support@thinkorswim.com*](mailto:support@thinkorswim.com) *with a title like \"Active Trader Bug - Excessive Total Volume in Binned Data\"*\n\nInterpret that as you wish. And I stress that they’re interested in bugs when the market is open. Not after-hours (yes, that’s when we usually see them, I know…). So if you wanna help TD out, feel free to follow the above instructions. If you figure out wtf is actually going on based on any hints in the above, fucking reach out so I can peacefully sleep at night one more.\n\nNote: The legend who had the convo did not want credit, their modesty blows me away.\n\n**\\*\\*end\\*\\***\n\n&#x200B;\n\nYou may carry on stabbing me with your pitchforks. \\*\\*While I wail in pain *“Not financial advice, I’m just an ape”*\\*\\*\n\n**Please note, this post is purely meant to temper expectations based on historical activity and logic. Any counterfactuals and arguments you have, please share so this post can be improved!**\n\n# Conjecture Edit Room\n\n**Edit:**\n\nu/Bladeace has made some great arguments and logic which point in favour of a share recall from BlackRock. His TL;DR as follows, and comment link [here](https://www.reddit.com/r/Superstonk/comments/mpsrno/we_dont_know_if_blackrock_and_co_will_recall_and/gubv26d?utm_source=share&utm_medium=web2x&context=3):\n\n>This is the perfect time to cause the squeeze. If BlackRock doesn't do it now, they lose their best chance to be in control of the situation. This is a very volatile situation, being in control means a lot. The gains of waiting are low and the risk is high. I think they will recall.\n\nJust as valid and logical, great AND important to understand the positive perspectives as well! Thanks again u/Bladeace!\n\n&#x200B;\n\n**Edit:**\n\nThanks u/serbeardless for linking [this](https://old.reddit.com/r/Superstonk/comments/mpp2yr/why_we_and_our_whales_are_waiting_for_the_dtcocc/). It delves into why LWs could be holding back until the DTTC put up the \"firewalls\" before they press the ignition button.\n\nHighlights an important fact that there are many different scenarios that could play out and this is yet another reason why we do not discuss dates of a squeeze.\n\n&#x200B;\n\n**Edit:** Off to bed, sorry US Apes - i'll return tomorrow morning to any questions and opinions, thoughts and conjecture to add into the above :) Love ya'll",
    "title": "We Don't Know if BlackRock and co WILL Recall. And That's Okay.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mpsrno/we_dont_know_if_blackrock_and_co_will_recall_and/"
}