{
    "author": "mrdoggiedog",
    "created_utc": 1616197684.0,
    "distinguished": null,
    "edited": 1616250261.0,
    "id": "m8uitu",
    "text_only": true,
    "flair_text": "Shitpost",
    "name": "t3_m8uitu",
    "num_comments": 168,
    "permalink": "/r/GME/comments/m8uitu/i_met_a_real_hedgie_manager_at_work_today/",
    "score": 1478,
    "selftext": "I work at a gym and this guy comes in asking about his account with us, we’re sitting at my desk talking and I see him on his phone looking at stocks, he tells me sorry in advance if i feel like he’s not paying attention to what I’m saying, he was busy with his options trades expiring today. \n\nWe sparked up a conversation about GME and he was telling me how in February he shorted the stock and lost from 10-15k!!! But his next move was to set a put to sell it anything below 450 and when we saw that massive drop he said he made back like 5k and cashed out. I’m sure him and his buddies are did the same.\n\nHe was telling me that him and his buddies don’t believe in GameStop as a company and are still betting for it to go out of business, he said that no one buys video games in store anymore, I’m assuming he doesn’t keep up with what GameStop is actually doing? Anyway I told him I owned a few shares but not how many I had, he told me “ha you need to get out of that! It’s going to drop, the company is way overpriced” then said “I recommend you sell your shares and take the profit for a nice dinner or whatever” that did piss me off, he acted as if my gains aren’t anything special but a nice dinner. \n\nHis price target is $50 and if that’s what he thinks I’m sure all his other hedgies are thinking the same, to keep shorting and shorting. These guys have special language they speak in when they speak about losses or gains they refer them as cars, “today I lost a mustang” or “today I got a Benz”. His advice to me was to sell and become a paper hands but I’m not planning on it anytime. \n\nThese hedge funds think we are stupid for buying GME and are still confident about coming out on top, after speaking with him I realized no matter what everyone should keep on holding, it was never about the money, it’s about making a statement that is little guys can come out on top too. I refuse to sell my shares especially after talking with him, this is bigger than we think, he might work for a smaller hedge fund but they all have the same mentality of shorting these companies to oblivion. \n\nThis is not financial advice, I am smooth brained and don’t even know how to count to my price target for GME. 🚀🚀🚀🚀\n\n***EDIT***\n\nGuys! I did some digging and found out this guy likes to gamble on his free time when the markets are closed on the weekends! His name is Steve btw, can’t give out too much info to protect my job but WE CAN CONFIRM THAT THE STOCK MARKET IS IN FACT A CASINO TO THEM! Hope they are ready to lose it all! Tendies are heating up for us apes 🦍🦍🦍\n\n***EDIT***\n\nWow! Just now waking up and seeing this post get a lot of feedback! Thank you so much for all the awards! I love this ape community so much! I hope to follow up with this post since I will be seeing Steve at the gym from time to time, once the apes land on the moon with fresh tendies in hand I will go out of my way to take a picture with hedgie holding up a sign saying “Apes together strong” 🚀🚀🚀",
    "title": "I met a real hedgie manager at work today",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/m8uitu/i_met_a_real_hedgie_manager_at_work_today/"
}