{
    "author": "Macnassmat",
    "created_utc": 1620592225.0,
    "distinguished": null,
    "edited": 1620883936.0,
    "id": "n8mt5x",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n8mt5x",
    "num_comments": 17,
    "permalink": "/r/Superstonk/comments/n8mt5x/i_dub_this_the_oldies_but_goodies_compilation_of/",
    "score": 670,
    "selftext": "Much better revised post of this one please go here\n\n[https://www.reddit.com/r/Superstonk/comments/na2yvm/oldies\\_but\\_goodies\\_compilation\\_of\\_god\\_tier\\_dd/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/na2yvm/oldies_but_goodies_compilation_of_god_tier_dd/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n***Veterans*** in this saga go ahead skip to DD section below, newbies please do stick around\n\n*Alexa play Brenton Wood on Pandora...*\n\nOkay I think it's only necessary to have a compilation on this sub of all the masterful work produced on levels that I am not educated enough to describe worthily\n\nIf any new folks to this GME saga are tuning in, I ***HIGHLY URGE*** you to check out the FAQ here,\n\n[https://www.reddit.com/r/Superstonk/wiki/index/faq](https://www.reddit.com/r/Superstonk/wiki/index/faq)\n\nIn my opinion, it's one of those things that's easily disregarded, but essential. It's kind of like going to the *terms & Conditions* section at the bottom of sites, like your broker's page showing who their clearing houses are and how much you are insured for your securities. It's there, but how many actually look into that shit thoroughly? Not many, definitely guilty of saying fuck that I'm cool..\n\nI recommend even having the FAQ on a tab in case you need to refer back to it. [Investopedia.com](https://Investopedia.com) is also a excellent website to brush up on market basics or to reference as you go. Just like when you are reading a book, you should never skip a word that you have not learned yet, and always keep a dictionary handy to do so. It **will** effect how well you are able to process and obtain the information that you are taking in along with what the context is leading to, as in the overall lesson or message.\n\nAlso would highly recommend that if you're new to also spend some time learning the fundamentals of GameStop, it's important to know how bright of a future this company has. Especially with their pivot into the digitalization/e-commerce sector well on its way. From replacing nearly every C-suite executive with superstars from the likes of Amazon, Chewy, and Google. To the last of the Mohicans, CEO George Sherman, who is on his way out by July 31st.\n\nYou should definitely know who the Chairman and possibly new CEO Ryan Cohen is and what he did with his former company Chewy along with how recent he has came onboard. That company is extremely customer service oriented and still wows their clients up until this day for always going the extra mile. I believe that has been one of the main keys to its success. Also by downsizing a bit and focusing raised capital on distribution centers along with e-retail sales.\n\nLet alone he was able to capture nearly the entire market of pet food which ~~is~~ was a \\~$40b industry, while being built from the ground up with competition from companies like Amazon, Petsmart, and Petco who were already pretty well established in that sector. He amazoned that shit right in Amazon's faces! Now he's here to Cohenize GME!\n\nNow let's take a look at the potential GameStop has with a man like Mr. Cohen steering this ship, as many of us here know, GME has recently got into the Computer hardware/software industry which is valued at about \\~$300B combined. Well guess who just went out of business? Fry's Electronics!\n\nNow let's look at the gaming industry valued at about $65b, guess who is the world's largest video game retailer? That's right GameStop! Now let's take a conservative approach at the Total Addressable Market(TAM) at \\~$365b. For a conservative estimate, let's say GME is able to capture 1/4 of the TAM $365b which would lead to a market cap(Value) of ***opens calculator***  $91.25b. Now let's divide that by how many shares GameStop has in total = 70m that brings us to ***drum roll***\\*...\\* $1,303.57 per share! How long will it take to get there? I have no idea, but just trying to throw some numbers out there for you folks on the potential this company has in the near future. Ryan started from scratch with Chewy, GameStop is already well established **Globally**.\n\nYet in this very moment of writing this, GameStop is valued(Market cap) at 70,000,000 x $161 = $11.4b! Think about that for a bit. Now, let's look at some of the events that have recently transpired, such as GME going from \\~$400m in debt to being debt-free with nearly $1b cash on hand(Capital). What I love the most about that move is the fact that they bought back 34.6 million shares for $178.6 million, at an average price of $5.14 per share back in 2019. Then this year, they sold 3.5m shares for a whopping  $551,000,000! Holy Shiet, now that's GANGSTA!\n\nAnother thing that is very important to note is that the higher the short interest % on said stock, the more **artificial** the prices becomes.\n\n## \"Virtual Hearing - Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide, Part III\"\n\nFrom the most recent part of this hearing, The DTCC said on record that they did not margin call anyone in January, meaning more than likely the same SI%(Short Interest %) or higher is still correct. Which was at **140%+** more on the relevance of this below\n\n**GameStop Completes At-The-Market Equity Offering Program**\n\n[https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program](https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program)\n\nGameStop Announces Preliminary Sales Results for the First Nine Weeks of Fiscal 2021 Reflecting an Approximately 11% Increase Compared to the Prior Year Period\n\n## Sales for the five-week March 2021 period increased approximately 18% from prior year\n\nGRAPEVINE, Texas, April 05, 2021 (GLOBE NEWSWIRE) -- **GameStop Corp. (NYSE: GME**), today announced preliminary unaudited sales results for the first quarter to date period representing the nine-weeks ended April 3, 2021, as compared to the nine weeks ended April 4, 2020.\n\nhttps://preview.redd.it/c46e1ztzuiy61.png?width=1920&format=png&auto=webp&s=354af23488a0878903cd2001234ef55365b571d1\n\n&#x200B;\n\nHere's what some analysts have to say..\n\n&#x200B;\n\nhttps://preview.redd.it/t7zsix1ow5y61.png?width=1057&format=png&auto=webp&s=127343a376f60ac76c3ceb8fbc499227d40abe64\n\nFor more on the fundamentals and such, I think this user u/wowmuchdoge_verymeme did a pretty good write up here. Very speculative indeed, but found it to be pretty damn insightful! Before diving in keep this in mind\n\nWhen reading the **DD**s...\n\nhttps://preview.redd.it/vfouosq7d5y61.png?width=720&format=png&auto=webp&s=ab85f5673ce5c2cca8d5def368e948ce4433c8b4\n\n[https://www.reddit.com/r/GME/comments/lthmqx/why\\_gme\\_is\\_worth\\_at\\_least\\_5000\\_on\\_merit\\_and/](https://www.reddit.com/r/GME/comments/lthmqx/why_gme_is_worth_at_least_5000_on_merit_and/)\n\nAlso, keep in mind that I am only scratching the surface here, there are many more metrics and such involved that are beyond me.\n\nI hope some others with wrinkles can chime in and add value to this vague write up...\n\nOh and when pulling up numbers came across these gems...\n\n# Scion Asset Management Urges GameStop to Buy Back $238 Million of Stock with Cash on Hand\n\n[https://www.businesswire.com/news/home/20190819005633/en/Scion-Asset-Management-Urges-GameStop-to-Buy-Back-238-Million-of-Stock-with-Cash-on-Hand](https://www.businesswire.com/news/home/20190819005633/en/Scion-Asset-Management-Urges-GameStop-to-Buy-Back-238-Million-of-Stock-with-Cash-on-Hand)\n\nGuess who owns Scion? Dr. Michael mf'n Burry!!!\n\nHere's a kicker, look who had a semi-positive article on GameStop before bashing the stock and its shareholders endlessly this year like every other mainstream media news outlet...\n\n[https://www.fool.com/investing/2019/12/10/gamestop-just-bought-back-a-crazy-amount-of-stock.aspx](https://www.fool.com/investing/2019/12/10/gamestop-just-bought-back-a-crazy-amount-of-stock.aspx)\n\nWith one of the quotes being \" You might think these results would be reason to run for the hills, but GameStop's management also made a move that could actually make shareholders very rich one day -- that is, if the strategy works out. \"\n\nLooks like it's working out now bitches! WHO IS THE FOOL NOW!? hahahahaaaa\n\nSo why would the mainstream media do such a thing? Well I think the first thing to note is who owns them\n\n## Who Owns the Media in the U.S.?\n\nAbout [15 billionaires](https://www.forbes.com/sites/katevinton/2016/06/01/these-15-billionaires-own-americas-news-media-companies/#29ae3f3e660a) and [six corporati](http://fortune.com/longform/media-company-ownership-consolidation/)[ons](http://fortune.com/longform/media-company-ownership-consolidation/) own most of the U.S. media outlets. The biggest media conglomerates in America are AT&T, Comcast, The Walt Disney Company, National Amusements (which includes Viacom Inc. and CBS), News Corp and Fox Corporation (which are both owned in part by the Murdochs), Sony, and Hearst Communications. All of them save for Sony make an appearance in our online news sources chart.\n\nNow let's look at the reasoning, well here's a great reference\n\n## What Is Short and Distort?\n\nShort and distort refers to an unethical and illegal practice that involves investors [shorting a stock](https://www.investopedia.com/terms/s/shortselling.asp) and then spreading rumors in an attempt to drive down its price. Such a practice, most often employed by stock [manipulators](https://www.investopedia.com/terms/m/manipulation.asp) who trade daily via the internet, involves the spread of unsubstantiated rumors and other kinds of unverified negative news designed to help them realized a profit on their short position.\n\n## How Short and Distort Works\n\nShort and distort efforts are often practiced as a part of [naked short selling](https://www.investopedia.com/terms/n/nakedshorting.asp), which involves the short-selling of a security without having first borrowed it or making sure it can be borrowed. In such cases the investor uses the proceeds from the short sale to deliver the shorted shares.\n\nThe profit is realized in two ways: in the spread between the price at which the shares were borrowed and the lower price at which they were delivered, and also in the practice of buying more shares than were borrowed at the lower price, which are then put up for sale, further lowering the price of a company's stock.\n\n## KEY TAKEAWAYS\n\n* Short and distort is an illegal trading scheme involving selling short the shares of a company and then spreading negative rumors in order to influence the stock price downward.\n* Short and distort is made more common through the use of online forums and social media channels to spread disinformation quickly and anonymously.\n* Short and distort is a serious crime, and perpetrators can be charged with securities fraud and subject to fines and jail time.\n\nSource: [https://www.investopedia.com/terms/s/shortanddistort.asp](https://www.investopedia.com/terms/s/shortanddistort.asp)\n\nDown below in the DD section we get more into the nitty gritty, players involved, such as those who have a short position in GME such as Citadel also referred to as Shitadel, Melvin Capital who now seems to be out of business, and more. Along with those who have a **long** position which is just as important to know as well.\n\nIt's important to also keep in mind, the relationship between said short sellers and brokers such as Robinhood  who are facing more than 30 lawsuits on top of the CEOs being called to testify before congress in relation to trading being halted back in the end of January during GME price spikes. Which was just for retail investors and only on the buy side which inadvertently removes buying pressure causing the stock to plummet. Basically, when you eliminate the demand(buy orders) and are only left with supply(sell orders) it will make the price drop suddenly and drastically.\n\n\" Congress plans to examine Citadel’s agreement to obtain trading data from Robinhood in exchange for millions of dollars. These types of arrangements, called payments for “order flows,” have become more common in recent years and more lucrative during the pandemic trading boom of the past year. They have also drawn [growing scrutiny](https://www.washingtonpost.com/business/2020/12/17/robinhood-sec-investigation/?itid=lk_inline_manual_24) from federal regulators who have raised concerns that they can hurt average investors.\n\nCitadel and other market makers pay Robinhood a small fee for this privilege, which gives the market-making firms information about retail trading patterns. Citadel said it uses this information to improve its trading algorithms. Market makers also take a small profit on the “spread,” or difference in price between what a Robinhood user pays and the price at which the security is being sold in the market.\n\nRobinhood generated $271 million from all order-flow payments in the first half of 2020, according to regulatory filings. Because it is a closely held company, Robinhood does not disclose how much of its total revenue comes from order-flow payments. A spokeswoman for Robinhood declined to comment on the company’s business model.\n\nLast month, Robinhood paid $65 million to [settle](https://www.sec.gov/news/press-release/2020-321) a charge by the SEC related to its order-flow agreements. The federal agency found Robinhood had misled its users by failing to disclose the payments it received from investment firms and failing to find investment partners that offered the most competitive rates for executing trades. \"\n\nSource: [https://www.washingtonpost.com/business/2021/01/29/robinhood-citadel-gamestop-reddit/](https://www.washingtonpost.com/business/2021/01/29/robinhood-citadel-gamestop-reddit/)\n\n\" Vlad Tenev, the company’s co-founder and CEO, apologized for Robinhood’s performance, including its move to restrict trading in stock of GameStop and other largely overlooked companies targeted by amateur traders organizing on social media. The decision, and similar ones by other online brokers, caught the investors off guard, drew a rash of lawsuits and provoked outrage from lawmakers in both parties.\n\nThe wide-ranging hearing stretched over five hours and also featured testimony from Citadel CEO Ken Griffin, Melvin Capital CEO [Gabriel Plotkin](https://www.washingtonpost.com/context/testimony-of-gabriel-plotkin-founder-of-melvin-capital-management/8882e0d9-a683-4392-bc2e-87e56ba43baf/?itid=lk_inline_manual_9), Reddit co-founder [Steve Huffman](https://www.washingtonpost.com/context/testimony-of-steve-huffman-co-founder-and-ceo-of-reddit/551bce30-3a22-45ea-9632-9bf7b48a2af4/?itid=lk_inline_manual_9) and [Keith Gill](https://www.washingtonpost.com/context/testimony-of-keith-patrick-gill-aka-roaring-kitty/dbb18b2e-400c-4a10-8fc5-156e8856cfd1/?itid=lk_inline_manual_9), the trader known as “Roaring Kitty” on YouTube who helped set off the stock frenzy. \"\n\nSource: [https://www.washingtonpost.com/business/2021/02/18/gamestop-robinhood-citadel-roaring-kitty-hearing-live-updates/](https://www.washingtonpost.com/business/2021/02/18/gamestop-robinhood-citadel-roaring-kitty-hearing-live-updates/)\n\nWell just recently, users of RobbingtheHood were not only unable to execute buy orders, but sell orders as well. You know on that infamous Crypto I'm sure you have all heard about and been seeing a sudden influx of advertisement for\n\n# Robinhood restricts crypto trading ‘due to extraordinary market conditions’\n\n[https://www.cnbc.com/2021/01/29/robinhood-restricts-crypto-trading-as-bitcoin-dogecoin-surge.html](https://www.cnbc.com/2021/01/29/robinhood-restricts-crypto-trading-as-bitcoin-dogecoin-surge.html)\n\n**PUBLISHED FRI, JAN 29 20217:43 AM ESTUPDATED FRI, JAN 29 20211:11 PM EST**\n\nOh wait hold the fuck up, they did it back then and now again, except this time claiming \"Technical Difficulties\"????\n\n# Robinhood Denies Restricting Dogecoin Trading\n\n\"Robinhood, the stock trading app, has denied placing restrictions on Dogecoin trades after some users reported seeing pending message displays when trying to make the cryptocurrency trades.\"\n\nsource:[https://www.newsweek.com/robinhood-denies-dogecoin-trading-restrictions-cryptocurrency-trades-1584090](https://www.newsweek.com/robinhood-denies-dogecoin-trading-restrictions-cryptocurrency-trades-1584090)\n\nBY [**SOO KIM** ](https://www.newsweek.com/authors/soo-kim)ON 4/16/21 AT 4:22 AM EDT\n\n# Robinhood Denies Restricting Dogecoin Trading, While DOGE Price Skyrockets 140%\n\n[https://www.benzinga.com/markets/cryptocurrency/21/04/20658863/robinhood-denies-restricting-dogecoin-trading-while-doge-price-skyrockets-140](https://www.benzinga.com/markets/cryptocurrency/21/04/20658863/robinhood-denies-restricting-dogecoin-trading-while-doge-price-skyrockets-140)\n\n**by** [**Adrian Zmudzinski**](https://www.benzinga.com/user/342953)\n\n**April 16, 2021 9:26 am**\n\nHold on so almost 3 months later and they still didn't get their shit together!? Except this time, they must have learned to not just restrict the buy side alone.\n\nIt's speculated that Citadel and others are using Cryptocurrencies to raise capital in order to prevent being margin called. Here's a scenario, say Citadel & Cronies buy massive amounts of crypto causing the price to skyrocket, then brokers like Robinhood halts trading on their platform. Citadel & CO execute a huge sell off, guess who is holding the bag? By that I mean, guess who misses out on great returns/profits and see possible losses? That's right the very users of RobinngAllHood's platform, retail investors...\n\n# Crypto market cap surges to record $2 trillion, bitcoin at $1.1 trillion\n\n\"NEW YORK (Reuters) - The cryptocurrency market capitalization hit an all-time peak of $2 trillion on Monday, according to data and market trackers CoinGecko and Blockfolio, as gains over the last several months attracted demand from both **institutional** and retail investors. \"\n\nBy [Gertrude Chavez-Dreyfuss](https://www.reuters.com/journalists/gertrude-chavez-dreyfuss) on APRIL 5, 2021 9:36 AM\n\nDamn some of this sounds familiar...\n\n## What Is Pump-and-Dump?\n\nPump-and-dump is a scheme that attempts to boost the price of a stock through recommendations based on false, misleading, or greatly exaggerated statements. The perpetrators of this scheme already have an established position in the company's stock and sell their positions after the **hype** has led to a higher share price. This practice is illegal based on securities law and can lead to heavy fines.\n\n## KEY TAKEAWAYS\n\n* Pump-and-dump is an illegal scheme to boost a stock's price based on false, misleading, or greatly exaggerated statements.\n* Pump-and-dump schemes usually target micro- and small-cap stocks.\n* People found guilty of running pump-and-dump schemes are subject to heavy fines.\n\nSource: [https://www.investopedia.com/terms/p/pumpanddump.asp](https://www.investopedia.com/terms/p/pumpanddump.asp)\n\nMore on all of this below..\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\nNow that you've gained insight on the fuckery at hand and ***some*** of Gamestop's fundamentals, with the **EXTREMELY HIGH** potential of a squeeze, IMHO(In my honest opinion; in case you're reading this pops!) I believe that makes this a win/win situation.\n\n# Now why is the potential for a Short Squeeze so high?\n\nWell based on all of the research done, to say this very briefly, all the data and findings almost certainly proves that the short sellers have not covered their positions (bought back shares that were originally borrowed then immediately sold at market price, in hopes of buying them back later at a cheaper price to collect the difference as profits).\n\nOne of my favorite points of reference is when looking at about the 9 other short squeezes that have happened historically, ***NONE*** have performed like GME post-squeeze. Another is how we've seen days where there was more than ***600%*** of volume (shares traded) in just one day since the supposed squeeze occurred back in the end of January. Which also leads us to believe that there has been illegal practices going on such as Naked Shorting. Refer to FAQ or Investopedia.com\n\n# Why have we dubbed this The Mother Of All Short Squeezes(MOASS)?\n\nWell due to **illegal** tactics like Naked Short selling, these dipshit short sellers have been pretty much creating synthetic shares, allowing more outstanding shares(float) than how many actually exist. Well guess who has been buying all of them? Retail investors(us) and institutions who also have a long position in GME. To give you an idea of how much we(retail) own alone here's a pretty solid estimate..\n\n\" **\\[UPDATED\\] DD: I did the math, there is literally NO DOUBT that we own> 100% of the remaining float.** **\\[including updated remaining float from GME's proxy statement\\] 🚀🚀🚀** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mxrdcb/updated\\_dd\\_i\\_did\\_the\\_math\\_there\\_is\\_literally\\_no/](https://www.reddit.com/r/Superstonk/comments/mxrdcb/updated_dd_i_did_the_math_there_is_literally_no/)\n\nby u/InForTheSqueeze\n\n\" **\\[Final Update\\] Superstonk users ALONE hold between 27 million and 35 million shares. No, really.** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mzuodo/final\\_update\\_superstonk\\_users\\_alone\\_hold\\_between/](https://www.reddit.com/r/Superstonk/comments/mzuodo/final_update_superstonk_users_alone_hold_between/)\n\nby u/TheCaptainCog\n\nEventually rather through any given catalyst, the price will become high enough where the short sellers will become over leveraged in their bets, as in they are at risk of losing more money than they can account for, resulting in them getting margin called. Well when that happens, the regulatory agencies DTCC/NSCC's computers will buy back shares on their behalf. It does not care what the price is, it will execute buy orders!\n\nWell what happens when nobody wants to sell? Even if the institutional holders do, with retail alone holding about \\~200%+ of the float, due to simple supply/demand, for as long as we hold, the price rises. So essentially, we get to set the price. Hence, the floor is 10m per share, why? Because we fucking can.\n\nNow get your big girl panties on, britches for the boomers, and get ready to have your boots laced  tight...\n\n# Introducing the compilation of God Tier DD\n\n**\"** **A House of Cards - Part 1** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mvk5dv/a\\_house\\_of\\_cards\\_part\\_1/](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/)\n\nby u/attobit\n\nJust like how you wouldn't skip a word you haven't learned yet when reading, don't skip prior posts leading up to what's being brought forward. Hence, make sure you digest\n\n**Previous DD**\n\n[1. Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/)\n\n[2. BlackRock Bagholders, INC.](https://www.reddit.com/r/GME/comments/m7o7iy/blackrock_bagholders_inc/)\n\n[3. The EVERYTHING Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n[4. Walkin' like a duck. Talkin' like a duck](https://www.reddit.com/r/Superstonk/comments/ml48ov/walkin_like_a_duck_talkin_like_a_duck/)\n\nby u/attobit\n\n&#x200B;\n\n\"  **THE MOTHER OF ALL WEDGES: AN ENDGAME DD. Technical and Fundamental Analysis with Warden. Where we are now, where we are headed. When might the MOASS begin?** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n5me5g/the\\_mother\\_of\\_all\\_wedges\\_an\\_endgame\\_dd\\_technical/](https://www.reddit.com/r/Superstonk/comments/n5me5g/the_mother_of_all_wedges_an_endgame_dd_technical/)\n\nby u/WardenElite\n\n&#x200B;\n\n\" **\\[1/3\\] The Ultimate DD guide to the moon!!. Crazy Melon\"**\n\n[https://www.reddit.com/r/GME/comments/n2hgxq/13\\_the\\_ultimate\\_dd\\_guide\\_to\\_the\\_moon\\_crazy\\_melon/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/n2hgxq/13_the_ultimate_dd_guide_to_the_moon_crazy_melon/?utm_source=share&utm_medium=web2x&context=3)\n\nby [u/sydneyfriendlycub](https://www.reddit.com/u/sydneyfriendlycub/)\n\n&#x200B;\n\n\" **Hank's Definitive GME Theory of Everything** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n66tzh/hanks\\_definitive\\_gme\\_theory\\_of\\_everything/](https://www.reddit.com/r/Superstonk/comments/n66tzh/hanks_definitive_gme_theory_of_everything/)\n\nby u/HomeDepotHank69\n\nHank the tank!!!!!! You're my boy blue!!!!!!\n\n&#x200B;\n\n[Citadel been like.....](https://preview.redd.it/e3smgycbl5y61.png?width=400&format=png&auto=webp&s=bd186af515dfb20ae0c917c63bb7e9b4b3ab9c6e)\n\n\" **ROCK THE VOTE! Proxy Voting 101- THE MOST IMPORTANT POST ON THIS SUB!- Everything you need to know about how to vote!! ✔** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n6isp6/rock\\_the\\_vote\\_proxy\\_voting\\_101\\_the\\_most\\_important/](https://www.reddit.com/r/Superstonk/comments/n6isp6/rock_the_vote_proxy_voting_101_the_most_important/)\n\nby our majestic mods,\n\nu/pinkcatsonacid & u/bye_triangle\n\n&#x200B;\n\n\" **🚨DR. TRIMBATH TOLD US HOW TO DEFEAT THE FINAL BOSS. APES NEED TO VOTE RIGHT NOW ✅. THIS IS NOT A DRILL. I REPEAT: THIS IS NOT A DRILL🚨** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n6izbz/dr\\_trimbath\\_told\\_us\\_how\\_to\\_defeat\\_the\\_final\\_boss/](https://www.reddit.com/r/Superstonk/comments/n6izbz/dr_trimbath_told_us_how_to_defeat_the_final_boss/)\n\nby another one our almighty mods u/luridess\n\nSpecial thanks to u/attobit for conducting the AMA\n\n=================================================================================\n\nNot necessarily in the God Tier, but still check this shit out!\n\nIn case you missed it made a bit of a compilation from Friday's DD\n\n\" **Is this ENTIRE SUB on Adderall today!???? Geez the DD I have seen in the past hour has fucking blew me away!!! Here's a few in one post for those who might have missed them... been a bit busy myself and almost went to sleep without taking my nightly dive...** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n7ino0/is\\_this\\_entire\\_sub\\_on\\_adderall\\_today\\_geez\\_the\\_dd/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/n7ino0/is_this_entire_sub_on_adderall_today_geez_the_dd/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n\" **Actually useful info you might have missed, 23/04/21** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mwuszf/actually\\_useful\\_info\\_you\\_might\\_have\\_missed\\_230421/](https://www.reddit.com/r/Superstonk/comments/mwuszf/actually_useful_info_you_might_have_missed_230421/)\n\nby u/HPADude\n\n&#x200B;\n\n\" **GME closed $0.01 from previous day close - This has happened only two other days in the past January 12th with a delta of $0.01 and February 23rd with the exact same closing price as open. The next day after each, the price doubled. You're likely seeing the settled price of entrance into margin call** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mvoi4h/gme\\_closed\\_001\\_from\\_previous\\_day\\_close\\_this\\_has/](https://www.reddit.com/r/Superstonk/comments/mvoi4h/gme_closed_001_from_previous_day_close_this_has/)\n\nby u/cpfhornet\n\n&#x200B;\n\n\" **South Korea’s retail investor army declares war on short-sellers** \"\n\n[https://www.reddit.com/r/Superstonk/comments/myaka1/south\\_koreas\\_retail\\_investor\\_army\\_declares\\_war\\_on/](https://www.reddit.com/r/Superstonk/comments/myaka1/south_koreas_retail_investor_army_declares_war_on/)\n\nby u/Chabkraken\n\nAKA the Korean Ants, in case you didn't know, you just don't fuck with the Koreans. 🐜🐜🐜🐜➕🦍🦍🦍🦍 = 🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\n\" **The naked shorting scam in numbers: AI detection of 140M hidden FTDs, up to 400M naked shorts in married puts and massive dark pool activity by Shitadel and the shorts** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mvdgf5/the\\_naked\\_shorting\\_scam\\_in\\_numbers\\_ai\\_detection/](https://www.reddit.com/r/Superstonk/comments/mvdgf5/the_naked_shorting_scam_in_numbers_ai_detection/)\n\nby u/broccaaa\n\n&#x200B;\n\n\" **GameStop Expands Fulfillment Network with New Facility in York, Pennsylvania New 700,000 Square Foot Site to Support Transformation 🔥🚀🔥🚀🔥🚀** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n3tcew/gamestop\\_expands\\_fulfillment\\_network\\_with\\_new/](https://www.reddit.com/r/Superstonk/comments/n3tcew/gamestop_expands_fulfillment_network_with_new/)\n\nby u/juanjoelx\n\nDon't forget Gamestop's Performance Center that had to be closed temporarily due to Covid\n\n[https://gspc.gg/#:\\~:text=The%20GameStop%20Performance%20Center%20is,community%20of%20Dallas%2DFort%20Worth](https://gspc.gg/#:~:text=The%20GameStop%20Performance%20Center%20is,community%20of%20Dallas%2DFort%20Worth).\n\n&#x200B;\n\n\" **The MOASS Preparation Guide** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mm5qle/the\\_moass\\_preparation\\_guide/](https://www.reddit.com/r/Superstonk/comments/mm5qle/the_moass_preparation_guide/)\n\nby u/socrates6210\n\n&#x200B;\n\n\" **The Greatest Lie Ever Told by Wall Street and Why We Will Win.** \"\n\n[https://www.reddit.com/r/Superstonk/comments/moqtwf/the\\_greatest\\_lie\\_ever\\_told\\_by\\_wall\\_street\\_and\\_why/](https://www.reddit.com/r/Superstonk/comments/moqtwf/the_greatest_lie_ever_told_by_wall_street_and_why/)\n\nby u/TheBigKingy\n\n&#x200B;\n\n\" **Holy shit. I was skeptical of all the high ceilings being thrown out until I put the pieces together. I honestly think GME is priceless, and the most valuable stock you will ever buy. Here's the full picture, as I understand it...** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mvcqpi/holy\\_shit\\_i\\_was\\_skeptical\\_of\\_all\\_the\\_high/](https://www.reddit.com/r/Superstonk/comments/mvcqpi/holy_shit_i_was_skeptical_of_all_the_high/)\n\nby u/missing_the_point\n\n&#x200B;\n\n\" **Citadel Securities Has Over $57,500,000,000 In Open Short Positions On Its Books... I Think I Found Out What Happened In January, and Why Trading Was Halted...** \"\n\n[https://www.reddit.com/r/Superstonk/comments/n7g5gp/citadel\\_securities\\_has\\_over\\_57500000000\\_in\\_open/](https://www.reddit.com/r/Superstonk/comments/n7g5gp/citadel_securities_has_over_57500000000_in_open/)\n\nby u/ThatGuyOnTheReddits\n\n&#x200B;\n\n\" **I think I figured out what DFV knows... and it’s pretty simple.** \"\n\n[https://www.reddit.com/r/Superstonk/comments/mtftsq/i\\_think\\_i\\_figured\\_out\\_what\\_dfv\\_knows\\_and\\_its/](https://www.reddit.com/r/Superstonk/comments/mtftsq/i_think_i_figured_out_what_dfv_knows_and_its/)\n\nby u/DSsmith2430\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nUpdate on my tits:\n\n&#x200B;\n\n[Terry Crews status](https://preview.redd.it/jvtfko9ll5y61.png?width=400&format=png&auto=webp&s=35e6c23fd47cd4119695d4535f138657daa496d4)\n\nWill be adding more, just wanted to put this out there, please poke holes in my work. Let me know in the comments, everything here is subject to open discussion. Also attach any DD that should be added here!\n\nThanks enjoy your Sunday funday!\n\nHappy Mother's Day mama!\n\nI love you all!\n\nEdit: Had to remove regular DD section due to",
    "title": "I dub this \"The Oldies, but Goodies\" Compilation of God Tier DD",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n8mt5x/i_dub_this_the_oldies_but_goodies_compilation_of/"
}