{
    "author": "DigitalArts",
    "created_utc": 1620604913.0,
    "distinguished": null,
    "edited": 1620664803.0,
    "id": "n8r19o",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n8r19o",
    "num_comments": 541,
    "permalink": "/r/Superstonk/comments/n8r19o/its_time_to_call_bullshit/",
    "score": 5063,
    "selftext": "Edit: Grammar and thank you for the awards! Credit goes to all the apes who are helping to slide the pieces together and doing legwork. There is so much complexity to all this by fucking design and without the sheer number of people who are working tirelessly daily, none of this may have come to light and retail would keep getting bent over. \n\nBorrowing from u/ForgottenBob, this should help for a summary or TL:DR. Thank you!\n\nhttps://preview.redd.it/mpxkh4gtmby61.png?width=708&format=png&auto=webp&s=1ff1b09e5226a6573b2c5dd848225986b0f1002b\n\n# Well, well, well....\n\n&#x200B;\n\nWhere to start.. I attempted my first piece of DD [yesterday](https://www.reddit.com/r/Superstonk/comments/n7z7ux/prepare_for_war_rise_of_the_atypical_propriety/) writing as I was finding things. It ended up being a bit of a mess, but some ideas started going off in my head as a result of the comments and findings and I think I may have found a thread. No TL:DR because everyone needs to absorb and understand this. Help each other out TO understand this. I'm not making broad leaps here or conspiracies because the data is staring us in the fucking face. I talked about wanting to play a game in my first DD, to see who can run out the clock on this whole fucking fiasco first. Let's see if the information I am about to present advances that in our favor or helps others who are building their own DD. Knowledge is power and we are open sourcing it as we speak. If there is anything I've missed or am wrong on, please let me know. Love all you apes. 😉\n\n&#x200B;\n\n**Disclaimer: Nothing in this is financial advice yada yada yada**\n\n&#x200B;\n\nLet's start with the basics. I'm gonna go on a limb and say that 95% of us have gone through an online broker to buy our stonk right? I don't care who you opened an account with; Robinhood, Webull, TD, Schwab, even our fabled Fidelity as I've pointed out in the previous DD have all committed transgressions, but I digress. I honestly can't find the actual numbers, but I'm gonna speculate that unless you specifically state otherwise, everyone who owns stock through a brokerage online is a beneficial owner of said stock. Don't know if you are or not? You can check the fine print in the customer agreement, or you can ask your broker directly, \"am I a registered or a beneficial owner of my stock?\" Since I have been going through it anyways, here is Fidelity:\n\n&#x200B;\n\n**Fidelity Customer Agreement:** [Direct Link](https://www.fidelity.com/bin-public/060_www_fidelity_com/documents/brokerage-account-customer-agreement.pdf)\n\n&#x200B;\n\nhttps://preview.redd.it/hgp5fcdjh5y61.png?width=731&format=png&auto=webp&s=1bdf963774eb291b02ce147f7ce8215415e8d3a6\n\nRight there, and verifiable. If you bought stock through Fidelity's online brokerage (or transferred stock over) the stocks are held by a custodial party acting on your behalf. In this case, you are the beneficial owner of the stock, but NFS (National Financial Services) is the registered owner of said stock.\n\n&#x200B;\n\nLet's break down the difference between a registered owner of a stock vs. a beneficial owner of a stock. From [Investor.gov](https://www.investor.gov/what-registered-owner-what-beneficial-owner#:~:text=A%20beneficial%20owner%20holds%20shares,own%20their%20securities%20this%20way):\n\n**What is a “registered” owner? What is a “beneficial” owner?**\n\n**As a shareholder of a public company you may hold shares directly or indirectly:**\n\n* **A registered owner or record holder holds shares directly with the company.**\n* **A beneficial owner holds shares indirectly, through a bank or broker-dealer. Beneficial owners holding their shares at a broker-dealer or bank are sometimes said to be holding shares in “street name.” The majority of U.S investors own their securities this way.**\n\n&#x200B;\n\nPretty straight-forward right? You get all the legal rights entitled to a registered owner, but it's held in what's usually referred to as \"street name.\" It's sort of a trade off with the convenience of being able to buy and sell in real-time and without hassle that comes with (traditionally) owning the certificate. The brokers save money by pooling all of their clients' shares into one account, also called an omnibus account. These accounts are supposed to be tightly regulated and have codes corresponding to the actual owner of said stock. Enter my re-hypothecated (;P) quote from \"The Big Short\" to describe this particular pile of dogshit scenario:\n\n&#x200B;\n\n# \"Registered Owner. Beneficial Owner. Omnibus. It's pretty confusing, right? Does it make you feel bored, or stupid? Well, it's supposed to. Wall Street loves to use confusing terms to make you think that only they can do what they do. Or even better, for you to just leave them the fuck alone.\"\n\n&#x200B;\n\nOmnibus accounts on their own, aren't nefarious. They do allow for securities to be bought, sold, lent, or otherwise shifted around quickly and easily. They also protect investors from the risk of fire, theft, counterfeiting...... 😂😂😂😂😂😂 Who the fuck am I kidding? This is fucking Wall Street.\n\n&#x200B;\n\n[wE](https://preview.redd.it/25c1lyi7e6y61.png?width=1047&format=png&auto=webp&s=1a3025135a290bb4df45ed2e2ac301b7abf69e57)\n\n&#x200B;\n\n[wOuLdN't](https://preview.redd.it/rkbi8ntde6y61.png?width=1038&format=png&auto=webp&s=260700a42c4d8db026df450605b36adf2b143213)\n\n&#x200B;\n\n[dO](https://preview.redd.it/pyjrx2cye6y61.png?width=1058&format=png&auto=webp&s=b20b3d4fde67f351d904ac54c825106e272bcee1)\n\n&#x200B;\n\n[tHiNgS](https://preview.redd.it/q592h4z6f6y61.png?width=1054&format=png&auto=webp&s=40c47280b610d2363bbf16f816e1f3e8a687e527)\n\n&#x200B;\n\n[LiKe](https://preview.redd.it/9q8xc4mgf6y61.png?width=1038&format=png&auto=webp&s=acc8938c657739af460fa36f2b9554a83d2127b4)\n\n&#x200B;\n\n[tHaT](https://preview.redd.it/o4wforpmf6y61.png?width=1197&format=png&auto=webp&s=698f23b4d445e79c737b22b79029839f7a056eb6)\n\nSources:\n\n[National Financial Services Disclosure Report](https://files.brokercheck.finra.org/firm/firm_13041.pdf)\n\n[Fidelity Brokerage Services Disclosure Report](https://files.brokercheck.finra.org/firm/firm_7784.pdf)\n\n[SEC Press Release](https://www.sec.gov/news/press/2007/2007-192.htm)\n\n&#x200B;\n\nNow that I've established precedent (and I promise now that I'm putting shit together, I'll find more), we know that they have done it in the past. So how does that tie into this situation?\n\n&#x200B;\n\n# REMEMBER THIS? PEPPERIDGE FARM REMEMBERS\n\nhttps://preview.redd.it/9pxsw9otg6y61.png?width=805&format=png&auto=webp&s=116bd7a3c994cf385a5af7535783b00ea31e235c\n\n[Source](https://www.sec.gov/divisions/marketreg/mr-noaction/2020/finra-fpl-20201022-15c3-3.pdf)\n\n&#x200B;\n\nOh yeah.... We thought it was just Citadel creating shares? **Fuck naw... EVERYONE** was having a lending party taking advantage of the T+2 cycle and why the fuck not? 90% of retail investors lose their money so if you're \"forgetting\" to mark some of these as fully paid, or marginable, or ALREADY LENT THE FUCK OUT, no one will really notice and YOU keep the profit. You skim the top, pocket that, and by the time it gets to be a problem, there are more shares available. MOST of the time, it's gonna work smoothly.\n\n&#x200B;\n\n# Enter The Retards\n\n&#x200B;\n\nHere we are today, knowing that we have WAY more shares than the entire float, and Wall Street kicking the can down the road as much as possible. In that time, we've uncovered naked shorting, re-hypothecation, and so many other ways that Wall Street is fucking over retail. To be fair, I don't think that it's every single person in Wall Street that has had a hand, but it's a few that ended up trying to shift the wrong Jenga block. The rest, as Jared would say....\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/ulr1h3xgm6y61.png?width=2358&format=png&auto=webp&s=e6fc6472cc3f5ebb6a066ae2f0e9a526dfe9ed0c\n\n&#x200B;\n\nYou thought 005 was pulled for a \"technical error?\" If so, you have more faith in the system than you think you do. 005 was pulled so they can keep borrowing to pay those FTD's off and kick this shit down the road more. I said it in my last DD, the rich always default to what has worked in their favor. Time. That's why buying, holding, and voting is so important, but failing that, there are a few other things we can do. I'll cover that in the next one though because I'm going to try it myself tomorrow with one of my brokers before I write it out.  My fucking brain hurts rn though, so I'm done for now.\n\n&#x200B;\n\nWe're closing in on everything. The longer this bullshit situation drags on, the more we find out and educate others.\n\n&#x200B;\n\n# Tick Fucking Tock",
    "title": "It's Time To Call Bullshit",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n8r19o/its_time_to_call_bullshit/"
}