{
    "author": "Edible-Arrangement-",
    "created_utc": 1624931279.0,
    "distinguished": null,
    "edited": 1624931905.0,
    "id": "o9yezu",
    "text_only": true,
    "flair_id": "17e85f56-584b-11eb-a9a8-0e508049721d",
    "flair_text": "☁️ Fluff  🍌",
    "name": "t3_o9yezu",
    "num_comments": 343,
    "permalink": "/r/GME/comments/o9yezu/to_the_apes_with_lower_floors_1_million_dollars/",
    "score": 1823,
    "selftext": "I have a friend I got to buy in who plans to sell when she can make $1 million dollars by selling all of her shares. She thinks that is enough money to completely change her life. \nOkay, I know 1 million dollars is life changing money for a lot of us, and would change your life significantly.. but it’s not as much as you think... \n\nI will share a story of my dad who won $500 000 25 years ago. \nMy dad grew up very poor in Jamaica. He didn’t have shoes growing up. He walked many miles to school barefoot each day. He shared a bedroom with his 6 siblings. They fought over food at dinner because there wasn’t enough to go around.\nTo him, winning $500 000 (lawsuit, he was hit by a drink driver and had significant back injuries) was enough money to change the world. He paid off his house, student loans, car, and put aside $1000 for each of his 7 kids(he thought that would be enough money to get us a good head start in life). After that he wanted to help as many people as possible. He started giving money away to family members. He sent money to schools back in Jamaica. He shipped packages of goods to Africa...he was going to change the world! Until all of his money was gone. \nBut he was okay with that, because he had no debt and he felt that his and his children’s future was secure.\n\nNow a few years later he had to retire from work 15 years earlier than he had financially planned for due to ongoing pain from his back injuries.\n\n25 years later he is living paycheck to paycheck on a very small pension. He is old school and has a very poor mans mentality (will eat rotten food so that it doesn’t go to waste), and can live on hardly anything, but he can barely afford to buy his groceries.\nHe STILL has family calling him for money whenever they are in a tight situation. He only regrets ever giving money to 2 people (my mom and his mother in law! Lol)\n\nI’m sharing this story because I believe a lot of people think that $1 million is enough to be set for life.\nI have been HODLing since February and I believe when we squeeze, Diamond apes will prevail and will sell at astronomical prices. I have shares set aside for the infinity pool that I will never sell.\nI won’t share my personal floor because it keeps changing, but it is an 8 digit number. \n\nDisclaimer: This is most definitely not financial advice!  I really just love the stock and think apes as a whole can change the world with our tendies! It’s not just about you, its about your community, country, and world that we are handing down to our children ❤️\n\nSorry, if this is a stupid post.. new mom and very hormonal 😭",
    "title": "To the apes with lower floors- 1 million dollars is less money than you think and will be gone before you know it",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/o9yezu/to_the_apes_with_lower_floors_1_million_dollars/"
}