{
    "author": "Spoondoggydogg",
    "created_utc": 1627088248.0,
    "distinguished": null,
    "edited": 1627088369.0,
    "id": "oqfopu",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oqfopu",
    "num_comments": 112,
    "permalink": "/r/Superstonk/comments/oqfopu/i_called_the_turning_of_the_tide_in_us_msm/",
    "score": 1586,
    "selftext": "Salutations apes! I hope this message finds you well.\n\nIf any of you saw my previous post you might remember my Europoor perspective of the turning tide a couple months back. If its here [link](https://www.reddit.com/r/Superstonk/comments/nuniy1/the_tide_is_turning_in_us_mainstream_discourse_a/?utm_medium=android_app&utm_source=share). (please excuse my retardedness if this didn't work as intended.\n\nAs explained in previous post i understand how propaganda works. Something previously mentioned in my comments i have a couple of wrinkles on how UK financial regulation and compliance work as this is what i do for irl work. \n\nI'm going to apply my knowledge on both these subjects to let you all know what I see and have seen happening in the past few weeks, and what I'm worried about. Please note, i will not be talking about what happened with the mod drama, as ultimately this is insignificant outside of this sub. \n\n1.\n\nThe narrative changed, and we forced it. \n\nThe *naked shorts yeah* comment on cnbc really did open a can of worms and pandoras box within journalistic discourse, as we've seen with Charles Payne's interviews over the past few weeks on prime time TV. This is not withstanding the numerous written articles I've seen produced. \n\nI've seen a sentiment to disregard these messages and articles because of their sauce (my preference is a proper bernaise with my tendies, there's just something about tarragon with chicken) but the facts of the articles is still 100% true, else they wouldn't publish. There's always a lot of conjecture and padding with the articles *deliberately* written to confuse and obfuscate.\n\nThis can almost always be attributed to an editorial line, this is why most articles seem to contradict themselves, and you see a lot of people doing mental flips to explain away basic fact, this is called cognitive dissonance. \n\nThe reason we encounter  *so many * \"boomer\" \"seasoned\" yadda yadda investors believing this is because the MSM were in the past genuinely trustworthy sources, when they did actual journalism, before advertising and \"promoted articles\" (read press release/propaganda) became the norm, especially within local papers. (but that's a whole other thing about journalistic integrity even outside stocks etc. We live in a world of propaganda) \n\nWe forced the hand and now the owners of the media are in damage control. They're going to pander to us like no tomorrow. To placate us and make us feel like we took a win. At this point the HF and institutions are willing to take a small L to keep us off their backs so they can continue with the casino they've built. \n\nDo not fucking let them. Keep up the pressure and shouting out the *VERIFIABLE* bullshit that if happening. \n\nAs mentioned im a Europoor, and therefore have zero influence on US markets, its up to you guys to appeal to your representatives, because if the US financial markets sneeze. The rest of the world catches a cold. \n\nHowever. With what we know now, if the US sneezes right now, global markers are going to catch a cross breed of covid and syphilis. And as any other deviant knows. You ain't getting rid of syphilis and it leads to madness. \n\n 2.\n\nMy irl work has me worried for the state of markets. \n\nI can't go into too much detail on this, as it would be very easy for me to lose my job and not be able to continue my career in financial compliance. \n\nHowever;\n\nWhat i can say is that I'm seeing a hell of a lot of new financial instruments being produced, which provide next to no safety net to average people. There's a reason Blackrock are buying up housing, and it's happening in the uk too. \n\nWe're having people who agree on a price for a \nproperty who have mortgages in principle being usurped by entities who noone can identify buying up in cash. Alot of these properties are then sitting empty. \n\nTheres something big brewing within the global economic system, something r/superstonk and the legends u/atobitt u/criand et al have started to scratch the surface of. \n\nTLDR\n\nThe MSM narrative changed, but only because we forced it to, and the ramifications of the ill health are unavoidable. We're approaching a time of extreme instability and we must protect are communities from the global forces. \n\nThat can only be done through local organisation. And i would encourage every ape to become active in helping their local communities NOW before the shit hits the fan. \n\nI love you all. \n\nPs. Shoutout to u/broviet_v2. I wish you'd post again. \n\nPeace and love apes.\n\nEdit, user tags cus me spelling is dreadful",
    "title": "I called the turning of the tide in US MSM discourse regarding the current situation. Now I'm back with a warning.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqfopu/i_called_the_turning_of_the_tide_in_us_msm/"
}