{
    "author": "TheKingOfLimbs",
    "created_utc": 1627042126.0,
    "distinguished": null,
    "edited": false,
    "id": "oq11rj",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oq11rj",
    "num_comments": 294,
    "permalink": "/r/Superstonk/comments/oq11rj/superstonk_has_an_upvote_problem_and_idk_if_we/",
    "score": 4535,
    "selftext": "Presently there is a link to an unverified Twitter account with almost 23,000 upvotes on the front page, where the person (popcorn stock holder) claims that the SEC can halt the dark pools at any time, without proof of such a comment.\n\nEarlier this week apes were upvoting multiple posts about someone on Twitter (again, popcorn stock holder) claiming that HFs were creating bots with the names of Las Vegas shooting victims, and the \"proof\" was easily creatable in an hour's time.\n\nBoth are popcorn stock holders. IDK if that's a coincidence or not.\n\nSeveral times this week posts have been hyped to the sky about some IT team lead using their LinkedIn profile to blog about naked short selling. It's been suggested that it'll \"[g]et more professional people to see what’s going on\", without proof that it's anyone more than apes who are reading it, or anything more than attention whoring for their next job.\n\nI guess at this point we should accept that it would be very easy for bad actors to have enough bot accounts to upvote their curated content on SuperStonk.  After all, it only takes a few accounts to post the material and the rest of the upvotes can come from non-approved bots.\n\nApes have also, sadly, shown a penchant for upvoting material that fits their views without actually vetting the source. I've seen the craziest random domains being hyped, and even used as sources. Obviously it is widely known that we cannot trust MSM blindly, but why even trust the small no-name sites that could have been cobbled together for psyops campaigns?\n\nWe cannot stop the bot networks from upvoting trash content. We can, however, use whatever part of our brain has evolved enough to use basic reasoning skills and downvote the content that isn't well sourced or researched. Use some of our combined mental ability to question this shit.\n\nIf we truly do not want to embarrass ourselves with garbage being so highly rated, we need to do better about downvoting it ourselves. Otherwise we will just look like fools to those looking into this.\n\nIt's been said time and time again that the best DD is already done, and what's left is unneeded at best and sus at worst. We need to act accordingly.",
    "title": "SuperStonk has an upvote problem, and idk if we can fix it",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/oq11rj/superstonk_has_an_upvote_problem_and_idk_if_we/"
}