{
    "author": "Digitlnoize",
    "created_utc": 1625920497.0,
    "distinguished": null,
    "edited": 1625922986.0,
    "id": "ohhwkk",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ohhwkk",
    "num_comments": 52,
    "permalink": "/r/Superstonk/comments/ohhwkk/a_basket_of_shorts_why_so_many_meme_stocks_move/",
    "score": 515,
    "selftext": "I’ve been wondering for a while why so many stocks follow the same pattern as our favorite stock. Pretty much everyone is aware of movie stock, but there are literally dozens of other stocks that all spiked n late Jan with GME, and again in early March, and again in late May. All following the exact same patterns. \n\nTo make matters worse there is a second, and possibly even a third subset of stocks that fire off their spikes a week or two *later*, after the GME group spikes. There’s been endless DD looking at T+21/35 and other FTD-related dates trying to explain these, but firm conclusions have yet to be reached. \n\nWell, I’ve been looking for this for a while, but I’ve finally found evidence that GME and other heavily shorted stocks were put into “baskets” and traded basically as **short derivatives.**\n\nBloomberg on 1/25, ladies and gentlemen: https://www.bloomberg.com/news/articles/2021-01-25/gamestop-short-sellers-reload-bearish-bets-after-6-billion-loss\n\n>\tA Goldman Sachs Group Inc. basket of the most heavily shorted stocks rose as much as 4.5% in New York Monday. \n\nSo Goldman Sachs was putting heavily shorted stocks into a derivative “basket” and selling it to other firms?  This would explain why SO MANY stocks spike together simultaneously. \n\nMore here about a similar offering from Goldman to short Chinese stocks: https://www.google.com/amp/s/amp.ft.com/content/a862ddf8-4f1f-11ea-95a0-43d18ec715f5\n\n>\tQuant Insight, a London-based research group, has therefore built a basket of about 40 US stocks with Chinese exposure designed to closely mirror the performance of China’s CSI 300 benchmark. Goldman Sachs has added the index to Marquee, its digital platform, which means it can sell clients derivatives known as total return swaps based on the basket.\n\nFun times. These people are scum. \n\nMy question for the wrinkle-brain apes is this:  Do derivatives have different FTD or date-related rules than standard shorts?  And do derivatives have different SI reporting requirements?\n\nEdit: Some ape was onto this earlier this year: https://www.reddit.com/r/GME/comments/lum9ih/this_is_huge_anyone_heard_of_total_return_swaps/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nEdit2: This is a fun, older WSJ (non-paywall) article: https://www.google.com/amp/s/www.wsj.com/amp/articles/gamestop-resurgence-reinforces-new-reality-for-hedge-funds-11614335400\n\n>\tAnother lesson from GameStop is to avoid disclosing certain holdings so as to not attract attention from opposite-minded investors. One strategy is to use so-called total return swaps, in which investors pay a bank a fee to earn returns on certain securities but don’t actually own those securities, eliminating the need for disclosure.\n\nAnd\n\n>\tA hedge-fund manager with $2.5 billion in assets under management said he now uses total return swaps 80% of the time, up from 50% before GameStop. He avoids buying put options, which give investors the right to sell stock at a certain time and price and must be disclosed, and times his trades to minimize disclosure at quarter-end.\n\nWonder who this mysterious $2.5B hedge fund manager is?\n\nEnter Archegos: https://www.wraltechwire.com/2021/03/29/wake-up-call-failure-of-small-hedge-fund-reverberates-across-wall-street-titans/\n\n>\t“Anytime a derivative is involved, you don’t really know how deep the tentacles go,” said Joe Saluzzi, co-head of trading at Themis Trading.\n\nArchegos crashed due to its heavy short position in total return swaps. It’s been widely reported that these swaps mainly involved Discovery and Viacom, but I’m gonna go ahead and guess GME and others were right along side it.",
    "title": "A Basket of Shorts: Why so many “meme” stocks move together. Hint: it’s not retail.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ohhwkk/a_basket_of_shorts_why_so_many_meme_stocks_move/"
}