{
    "author": "Herastrau90",
    "created_utc": 1625973522.0,
    "distinguished": null,
    "edited": 1626027324.0,
    "id": "ohwtjd",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ohwtjd",
    "num_comments": 385,
    "permalink": "/r/Superstonk/comments/ohwtjd/theory_archegos_was_long_gme_a_prime_leaked/",
    "score": 1261,
    "selftext": "The biggest secret Wall Street did not want you to know: Archegos was in fact the long GME whale.\n\nJust to give some backstory:\n\nArchegos is a family fund formerly known as Tiger Asia. There are other funds like Archegos that came out as offsprings for one of the most prestigious hedgefunds in the world - Tiger Global Management. The guys who made these funds are known as Tiger Cubs.\n\nThe reason I'm making this thread is to take a look at the actual reason the short squeeze was kicked off in January and the actual reason why GME and other stocks go up, especially in a similar pattern.\n\nWe know that Archegos took upon a massive leverage, but why exactly? Most of the reddit community thinks they were shorting GME and were shorting more and more during the runup. What if I told you they were the cause of the GME started short squeeze and it was never in fact reddit? Reddit simply added the fuel to the rocket that was GME.\n\nThe reason Archegos was able to take such a big leverage from all these banks is because of their reputation. Imagine a Tiger Cub, coming from one of the most prestigious hedgefunds ever, the hedgefund that [made the most money last year](https://www.institutionalinvestor.com/article/b1q8fxt5bh8wd6/This-Hedge-Fund-Made-the-Most-Money-for-Investors-Last-Year). That's the safest money you could ever give out, right?\n\nNow, we know that Archegos main positions were in Discovery, GSX and ViacomCBS. However another one of their positions not talked about was in AMCX.\n\n[GSX Chart](https://i.imgur.com/0Fa3Og1.png) \\- Keep in mind the Jan 27 spike.\n\n[ViacomCBS Chart](https://i.imgur.com/ss9cUEg.png)\n\n[Discovery Chart](https://i.imgur.com/uz4wwZh.png)\n\n[AMCX Chart](https://i.imgur.com/xycKm5Z.png)\n\n[All 4 charts combined](https://i.imgur.com/hGCwM6Y.png)\n\nNow why would they all of a sudden start pumping all these stocks in January for no reason? Because Melvin Capital was shorting them all. Archegos was squeezing Melvin Capital out of all of them.\n\nHow do we know this?\n\n[Melvin Capital - 3,260,000 shares in puts on ViacomCBS.](https://i.imgur.com/Hm8c4w9.png) \\+ Likely a short position.\n\n[Melvin Capital - 600,000 shares in puts on AMCX](https://i.imgur.com/vJlw0wg.png). + Likely a short position.\n\n[Melvin Capital - 750,000 shares in puts on GSX.](https://i.imgur.com/4eq1YDg.png) \\+ Likely a short position.\n\nNo public position on Discovery. Most likely only shorted with no puts.\n\nNow where does GameStop come into all of this? It's **The biggest prize** with over 140% of the float shorted. The grand prize for Archegos to walk away with potentially a 100+ billion return.\n\n&amp;#x200B;\n\nNow let's look at the Archegos leverage/portfolio:\n\n[https://www.ft.com/content/c319839d-d185-4e8a-bbc7-659bebe58031](https://www.ft.com/content/c319839d-d185-4e8a-bbc7-659bebe58031)\n\n[https://i.imgur.com/HhElIl0.png](https://i.imgur.com/HhElIl0.png)\n\nNow let's look at that spike and runup on January 27th which also conveniently lines up with the biggest GME's closing day at 347.\n\nHere's more of Melvin Capital's public put positions:\n\n[https://i.imgur.com/HmdrPrb.png](https://i.imgur.com/HmdrPrb.png)\n\n[https://i.imgur.com/6i2ejwg.png](https://i.imgur.com/6i2ejwg.png)\n\nWhat happened to them?\n\n[They.](https://i.imgur.com/A2b5wNo.png)\n\n[All.](https://i.imgur.com/XvgynCI.png)\n\n[Spike.](https://i.imgur.com/SuqfOXm.png)\n\n[On.](https://i.imgur.com/XPOGyir.png)\n\n[January 27.](https://i.imgur.com/RqXL5G8.png)\n\nAnd this was while the rest of the market was taking a huge hit.\n\n[GME Jan 27th.](https://i.imgur.com/Hd0lxTJ.png)\n\n[Archegos portfolio compared to the spike](https://i.imgur.com/fZTitpx.png) iRobot has 500k volume on average so we can easily see when a stock is being moved by a certain group.\n\n**Archegos was squeezing out Melvin down to their last cents so they could not meet the margin call for their short positions, especially GME. January 27th was some of the biggest money injection ever done by a single group.**\n\n&amp;#x200B;\n\nNow let's look at the GME's On Balance Volume and Archegos leverage/portfolio:\n\n[https://i.imgur.com/hQgH1Ze.png](https://i.imgur.com/hQgH1Ze.png)\n\n[https://imgur.com/ZV7zXXJ](https://imgur.com/ZV7zXXJ) (Ignore debt as it's their portfolio not debt).\n\nCredits to this person who made the thread here:\n\n[https://www.reddit.com/r/GME/comments/mjnjyp/correlation\\_between\\_gmes\\_on\\_balance\\_volume\\_and/](https://www.reddit.com/r/GME/comments/mjnjyp/correlation_between_gmes_on_balance_volume_and/)\n\nFrom the correlation above we can conclude that Archegos kicked off the GME gamma squeeze to profit themselves with the help of the reddit crowd.\n\nNow how and why did this happen? It's likely that Melvin's and Citadel's short positions were leaked to Archegos and potentially **other** Tiger Cubs.\n\nAfter the January run up and the broker shutdown, the Archegos fund went dark until their leverage/portfolio started picking up again at the end of Feburary:\n\n[https://i.imgur.com/hQgH1Ze.png](https://i.imgur.com/hQgH1Ze.png)\n\nNow we know that GME and other 'meme stocks'/shorted stocks spiked again on Feb 24th and onwards and then dropped after the Archegos losses/banks selling off their portfolio.\n\n&amp;#x200B;\n\nHere's the GME March 23 earnings crash compared to GSX and Discovery which luckily also lined up with the Archegos portfolio being sold off:\n\n[https://i.imgur.com/CcoaTUm.png](https://i.imgur.com/CcoaTUm.png)\n\nHere's another image of GSX and GME lining up perfectly on Jan 27 and March drop, credits to the mod of the subreddit:\n\n[https://i.redd.it/g8t4c3rche671.jpg](https://i.redd.it/g8t4c3rche671.jpg)\n\n&amp;#x200B;\n\nNow....let's get back to the other Tiger Cubs and Tiger Global Management.\n\nBack in 2018, Tiger Global Management sends a letter to the GameStop board asking to turn the company around:\n\n[https://www.cnbc.com/2018/05/16/hedge-fund-tiger-sends-letter-to-gamestop-urging-retailer-to-adopt-a-turnaround-plan.html](https://www.cnbc.com/2018/05/16/hedge-fund-tiger-sends-letter-to-gamestop-urging-retailer-to-adopt-a-turnaround-plan.html)\n\nTiger Cubs move in masses:\n\n[https://www.institutionalinvestor.com/article/b1kbrryv2kyw84/Hedge-Fund-Cubs-Share-Information-And-Alpha](https://www.institutionalinvestor.com/article/b1kbrryv2kyw84/Hedge-Fund-Cubs-Share-Information-And-Alpha)\n\nHere's a quote:\n\n&gt;Research shows that hedge fund “families” — like Tiger Management and its offshoots — make overlapping trades that result in excess returns.\n\nTiger Cubs love short squeezes:\n\n[https://masonstevens.com.au/the-big-squeeze/](https://masonstevens.com.au/the-big-squeeze/)\n\nQuote:\n\n&gt;**Short squeezes are not as uncommon in the market as you would think – the group of hedge funds colloquially known as “The Tiger Cubs” used to ‘hunt shorts’ together to make quick profits habitually in the early 2000s.**\n\n&amp;#x200B;\n\nNow who are the other Tiger Cubs potentially involved with Archegos?\n\nMaverick Capital, a Tiger Cub hedgefund who [publicly held 4,658,607 shares of GameStop](https://i.imgur.com/aApjus5.png) as of end of 2020. A near 2 million increase since the first half of the year.\n\nThey also held small positions in [AMCX](https://i.imgur.com/ifoEJCd.png), [EXPR](https://i.imgur.com/KoHvi0f.png) and [Blackberry](https://i.imgur.com/7I1NUgS.png).\n\nNow, these 3 are very small positions and they did not exist in the first half of 2020, only in the second, apart from AMCX which was an even smaller position. With GME's beginning to rise in December, was Maverick Capital made aware that Archegos was going after these? Or they did help them squeeze out all the meme/shorted stocks? Hard to tell.\n\nWhat are their positions now?\n\nIn their latest 13F the positions on all these stocks are now gone. They either sold them for profit, or hid them away from the public eye by requesting confidentiality on their SEC filing:\n\n[https://i.imgur.com/1SK4r5s.png](https://i.imgur.com/1SK4r5s.png)\n\n&amp;#x200B;\n\nSo back to present....what's happening now?\n\nIs Archegos still going at it after their bank meltdown, perhaps with new capital? or is it somebody else continuing on with the short squeeze? With rebounds in all the meme stocks such as GME, movie stock, EXPR, BBBY, KOSS, BB, AMCX and other Melvin's put positions since the end of May this seems to be the case. **Tiger Cubs may have prolonged the short squeeze by avoiding massive volatility and approaching stock increases in a technical manner.**\n\nWhy aren't Viacom and Discovery and GSX back on the rise?\n\nPotentially there was too many eyes on these stocks and if they started rising again it would be suspicious. AMCX is the only one rising after the drop, but it was not mentioned in the public. There's also a possibility that Melvin closed their puts/shorts on these positions. BUT, if you look at this [chart](https://i.imgur.com/hGCwM6Y.png) again, we can see Discovery and Viacom are starting to slowly get back on track with AMCX.\n\nHow are other 'meme stocks' involved?\n\nWell, Citadel has:\n\n[5.7 million shares in puts on movie stock) https://i.imgur.com/AS9pK9C.jpg)\n\n[290k shares in puts on EXPR](https://i.imgur.com/fKpyivi.jpg)\n\n[1.1 million shares in puts on BBBY](https://i.imgur.com/elOlRLX.jpg) and also [Melvin's puts](https://i.imgur.com/WCIo9Dn.png)\n\n[3 million shares in puts on Blackberry](https://i.imgur.com/DbgxusL.jpg)\n\n[7.4 million shares in puts on Nokia](https://i.imgur.com/N1uvRFq.png)\n\nThese likely come with some short positions. Do they all still exist today? Are they actually profitting from any of them with their hedged calls/shares? Hard to tell.\n\n&amp;#x200B;\n\nNow if you need anymore proof, here's Marc Cohodes, one of the famous short-sellers on Wall Street confirming that it's the Tiger Cubs vs the SAC Crowd (Steve Cohen, Gabriel Plotkin). He's been shitting on the shorts but he's not a fan of Hwang either:\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1376011174278426628?s=20](https://twitter.com/AlderLaneeggs/status/1376011174278426628?s=20)\n\n&gt;That is my bet.. He lit the fuse on GME to get the squeeze going in the Fraud [$GSX](https://twitter.com/search?q=%24GSX&amp;src=cashtag_click) which  he owned buckets of.. In a weird way its the Tiger Cub Mafia vs The SAC Mafia both lost key lieutenants . Lets see if my hunch is correct.\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1376343704626065409?s=20](https://twitter.com/AlderLaneeggs/status/1376343704626065409?s=20)\n\n&gt;The Mafia turf war between the Tiger Cubs and the SAC Inside Traders has claimed some bodies, something tells me it aint over.\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1377262062565388293?s=20](https://twitter.com/AlderLaneeggs/status/1377262062565388293?s=20)\n\n&gt;Today is the End of the First Quarter, be sure and mark up your positions as much as you can.This applies to The Tiger Cubs and others\n\n&amp;#x200B;\n\n[https://mobile.twitter.com/AlderLaneeggs/status/1378436052105392129](https://mobile.twitter.com/AlderLaneeggs/status/1378436052105392129)\n\n&gt;For all if you enterprising MSM participants, Why was Crouching Tiger Long and Squeezing what Melvin was Short? The fact that the Primes were all part of the Collusion is an issue at least to me. I am also curious how this criminal amassed his wealth.\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1379892041899929600?s=20](https://twitter.com/AlderLaneeggs/status/1379892041899929600?s=20)\n\n&gt;What are the Odds that the Prime Brokers of Sophos &amp; Melvin had their Shorts leaked to Hwang et al? I would bet the over here BIG.It may take time but it will come out. Too many people are \"out of business\" due to Hwang's dirty deeds.\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1398423979338211328?s=20](https://twitter.com/AlderLaneeggs/status/1398423979338211328?s=20)\n\n&gt;Where are all the Ghosts who defended Bill Hwang over the past 6 weeks and why are the Tiger Cubs so silent? You know who you are and I have the receipts saved. Keep telling lies about me and I will come with the truth on you clowns\n\n&amp;#x200B;\n\n[https://twitter.com/AlderLaneeggs/status/1375806249262931981?s=20](https://twitter.com/AlderLaneeggs/status/1375806249262931981?s=20)\n\n&gt;Just wait till people figure out who was behind the [$GME](https://twitter.com/search?q=%24GME&amp;src=cashtag_click) squeeze.. Free Hint, IT WAS NOT THE REDDIT CROWD\n\n&amp;#x200B;\n\nSome more tweets:\n\n[https://twitter.com/AlderLaneeggs/status/1377030504545886208?s=20](https://twitter.com/AlderLaneeggs/status/1377030504545886208?s=20)\n\n[https://twitter.com/AlderLaneeggs/status/1377302508414984193?s=20](https://twitter.com/AlderLaneeggs/status/1377302508414984193?s=20)\n\n[https://twitter.com/AlderLaneeggs/status/1395351882718072836?s=20](https://twitter.com/AlderLaneeggs/status/1395351882718072836?s=20)\n\n[https://twitter.com/AlderLaneeggs/status/1376142161213681665?s=20](https://twitter.com/AlderLaneeggs/status/1376142161213681665?s=20)\n\n[https://twitter.com/AlderLaneeggs/status/1362577087375179776](https://twitter.com/AlderLaneeggs/status/1362577087375179776)\n\n&amp;#x200B;\n\n**Epilogue:**\n\nFun fact: Bill Hwang's Tiger Asia was long on VW during 2008 and lost out on the short squeeze.\n\nCheck out this video to learn more about the Archegos fund and Bill Hwang's risky bets: [https://youtu.be/NtP3xT53dkU](https://youtu.be/NtP3xT53dkU)\n\nAlso Viacom issued shares diluting the stock and the Archegos position causing Bill to be margin called. \n\nAlso JPM had around 4MM shares of GME, Goldman 1MM according to filings at the end of 2020, both were primes for Archegos, both didn't sustain significant losses. \n\n\n\nNote: I will delete this if requested.\n\nThis post is copied from a post on the Archegos sub. The theory is interesting and makes sense to me. If mods consider this inappropriate I will delete. all credit goes to u/archegos-boy",
    "title": "Theory Archegos was long GME, A prime leaked Melvin's positions.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/Superstonk/comments/ohwtjd/theory_archegos_was_long_gme_a_prime_leaked/"
}