{
    "author": "LongTimeGamer",
    "created_utc": 1623880505.0,
    "distinguished": null,
    "edited": 1623895859.0,
    "id": "o1gn2u",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o1gn2u",
    "num_comments": 418,
    "permalink": "/r/Superstonk/comments/o1gn2u/i_processed_16_years_of_data_across_8_stocks_to/",
    "score": 7645,
    "selftext": "I’m back and so is my fondness of the .00. I spent all week trying to shake the thought of it... but just as the return of 005 was, the return of .00 is inevitable.\n\nSpeaking of .00, Did you know in June that 29% of our open, close, high, and low prices have ended in .00? 48 data points, 14 being .00 price points, 29%. That’s up from 15% in May and 13% in April. I didn’t know either until I gave up sleep for this.\n\nhttps://preview.redd.it/1t1ljk5qzo571.png?width=1066&format=png&auto=webp&s=03c7ca7bc4d04d648bd85743b0c809238ff70d87\n\nNow, before you come at me with **why** the frequency of .00 price points are increasing with reasoning such as \"as prices increase so do chances of .00 price points\"... I know! This whole post will be dedicated to proving that even with certain understandings of why a stock might end in .00, **GME is a true outlier** (and you know what that means 🚀🚀🚀).\n\nEarlier this week I succumbed to my madness and had to see if my own noticing of .00 key (open, close, high, and low) price points was *frequency illusions* or fact. Frequency illusion, or [Baader-Meinhof Phenomenon](https://en.wikipedia.org/wiki/Frequency_illusion), is your internal bias that causes something to appear more often only after learning or noticing that thing for the first time.\n\nBefore now, I thought I was simply seeing what I wanted to see. You can check out [my previous post](https://www.reddit.com/r/Superstonk/comments/o002rs/feel_like_gme_closing_prices_are_ending_in_00/) to see what started it all, but a quick recap is that in 2021 GME has a 61.06% rate of having a key price point during a trading day end in .00. The average for the 18 prior years is 9.25%, last year was 5.14%. GME is seeing key price points at .00 more often, and the rate is increasing.\n\nI appreciate the love my first post on .00 received. I also appreciate the perspective that other apes were able to provide as my brain is smoother than the gelato my wife treats me to once a month. Since then, I’ve quadrupled my research in an attempt to directly address some of the top reasonings for .00 price points to determine if GME is following a trend that exists across all stocks or is a **1.00-of-a-kind** in just another way.\n\n**TL;DR: Buy & Hold. Read the title again too. I predict we will continue to see an abundance of .00 key price points as we approach the MOASS. GME is a true outlier and in my next post, I will be mapping GME’s .00 price point frequency to the FTD cycles.**\n\nThis post is broken into sections each starting with a quick summary.\n\n&#x200B;\n\n**.00 | The Data**\n\nI’ve exported all my data from Yahoo's historic price exports. I love transparency.\n\nI am going to cover the following in this post.GME historical data from January 2002 to June 15, 2021\n\nhttps://preview.redd.it/rqloapis1p571.png?width=1211&format=png&auto=webp&s=74931fdcbb473ce80a9d7d0f3c242c9ba8696ffd\n\nAnd the following stocks for comparisons and baselines.AMC historical data from January 2014 to June 15, 2021\n\nhttps://preview.redd.it/9mm4ja572p571.png?width=1213&format=png&auto=webp&s=b9a9589e5ae5d122c6126534a62bef1935487fba\n\nTSLA historical data from June 29, 2010 to June 15, 2021\n\nhttps://preview.redd.it/t98nk6yx1p571.png?width=1214&format=png&auto=webp&s=aa9ca359647049cbe302d86ed3f254db9b90d08f\n\nAMZN historical data from January 2005 to June 15, 2021\n\nhttps://preview.redd.it/ukj589qkiq571.png?width=2190&format=png&auto=webp&s=f2d5405ed53e568480ac66bbca81761ca8e59639\n\nOSTK historical data from January 2005 to June 15, 2021\n\nhttps://preview.redd.it/low31kt12p571.png?width=1213&format=png&auto=webp&s=0305190e7cc57a21911f5ec1c61a525caeaa34eb\n\nAAPL historical data from January 2005 to June 15, 2021\n\nhttps://preview.redd.it/n9pz56g42p571.png?width=1214&format=png&auto=webp&s=e0d024548ebf51cab8dbc71c134a33e24e16fe73\n\nGOOG historical data from January 2005 to June 15, 2021\n\nhttps://preview.redd.it/k4rjivwg2p571.png?width=1213&format=png&auto=webp&s=e3ac23ec63ee2c7ccb02537c1481fa71e2d9b52a\n\nNFLX historical data from January 2005 to June 15, 2021\n\nhttps://preview.redd.it/nawin8uj2p571.png?width=1213&format=png&auto=webp&s=fbc6ac457470b897bb5b60d566cdf03e97edd206\n\n&#x200B;\n\n**Reason for .00 #1.00 | As a stock price increases, .00 key price points are more common.**\n\nIs the statement backed by data: **Yes**. See below.\n\nGME Myth or Fact: **Myth**. Although the rate of .00 key price points has increased with the stock’s price, GME is trending 5-10x higher than the average stock for .00 appearances at price points greater than $100.\n\nBefore I go into the numbers, I want to take a second to explain why this statement is reasonable to believe without first checking the data. If a stock is $1.50 it would require a 33% movement to hit a .00 key price point. If a stock is $15.50 it would only require a 3.2% movement. Therefore, it’s safe to believe that as a stock price increases that the occurrence of .00 key price points will also increase.\n\nThat simple understanding wasn’t enough for this smooth brain of mine. I wanted to see just how common these .00 key price points were within different price brackets. I'm a simple ape that likes patterns and nice flat numbers. My TV volume is at a flat 20 and my stock will be at a flat 20,000,000.00 soon too, and I'll love every short moment of it before the rocket continues rising.\n\nFor this experiment, I deemed testing and verifying using only the Open Price of GME and the stocks in my data pool would suffice.\n\nI tallied the occurrence of how many times each stock opened in my set price ranges and also tallied how many times each stock opened at .00 within my set range. This can be used to tell us the percentage of times my data pool opened at .00 within each price range. There were no surprises here:\n\nhttps://preview.redd.it/0zm3afp13p571.png?width=1138&format=png&auto=webp&s=52dbb7efacf91693a88bbd32a81b8bf10142eea0\n\nLooking across all eight stocks, the percentage of time a stock opened at .00 increases pretty steadily as the stock price increases.\n\nThis confirms the original believed statement that as the price increases so does the appearance of .00 key price points. *However*, we can see that **GME is a clear outlier**. Once the price broke $100, we’ve seen an increase in .00 appearances that is **unlike any other stock**. This tells us that we are not just seeing more .00 appearances in 2021 than previously, but also that GME is trending in more .00 at this price level than normal.\n\n&#x200B;\n\n**Reason for .00 #2.00 | Retail is more likely to place orders at .00 and GME is** ***THE*** **retail movement.**\n\nIs the statement backed by data: **No**. I was not able to find data on retail orders and if orders ending in .00 are more common.\n\nGME Myth or Fact: **Myth**. There is a lack of quantitative data on retail orders and there is no correlation between the percentage of .00 appearances in 2021 of GME (61.06%) and AMC (13.51%).\n\nBefore we go further, I think it's important to understand the reasoning. The idea here is twofold: First, retail is more likely to place orders ending in .00, and second retail’s tremendous support of GME leads to a larger influence of the .00 price point. There is no exact data that I was able to find on the first point, and the second is conjecture based on the first. It’s tough to tackle this directly.\n\nFirst, for retail placing orders ending in .00, It’s unreasonable for me to come to any conclusion on this. I do see a large number of posts educating users on limit orders versus market orders. That tells me that the number of retail investors that are purchasing stock at .00 price points may be smaller than anticipated. There is also an affinity for .69 and 4.20 tail ends as well. Since I can't prove or disprove this, let's tackle the second part.\n\nFor the second part, I would assume the same trend of greater .00 appearances due to increased retail support would also be seen in the movie stock. That wasn’t the case.\n\nA recap of GME's % of trading days with .00 appearances:\n\nhttps://preview.redd.it/bcm10wq93p571.png?width=721&format=png&auto=webp&s=c1aa3c1764c5add6ae589096fb8d9fc39ab188f3\n\nAnd the other stock's rate of .00 appearances:\n\nhttps://preview.redd.it/stx1slea3p571.png?width=719&format=png&auto=webp&s=41a2e63d66bd2c119111ab5444ad6a5024a184b9\n\nFor 2021, it currently sits at 13.51% appearance of .00 key price points, an increase of only +2% on the 8-year average. Even with recent movements, there has not been an increase in .00 appearances.\n\nThis wasn’t enough for me. We all know GME is the real play, so this didn’t seem like a fair comparison. I wanted to take it a step further and attempt to track how much retail interest or hype around a stock would play into the appearance of .00 price points.\n\n**Reason for .00 #3.00 | Large movements in a stock’s price lead to more .00 appearances.**\n\nIs the statement backed by data: **No**. I compiled a total of 106 trading years and tracked the spread of Minimum Open Price and Maximum Open Price for each year compared to that year’s percentage of .00 appearances and see no relation.\n\nGME Myth or Fact: **Myth**. Although GME’s stock price is rising as we approach the MOASS and we are seeing an increase of .00 price points, it appears to only be a coincidence.\n\nThis was a fun one to tackle. How do I compare GME, a once-in-a-ever opportunity, to other stocks?\n\nI felt that the larger the spread between Min. Open Price and Max Open Price in a given year would provide a good telling of a stock’s movement and potential retail hype. I believe that the larger the spread, the more retail hype there would be. I then compared the spread to the percent of trading days with a .00 appearance.\n\nI uncovered that the appearance of .00s doesn’t appear to relate to a more volatile stock.\n\nYears with the lowest spread of Min Open price to Max Open Price:\n\nhttps://preview.redd.it/y1fk1gwi3p571.png?width=950&format=png&auto=webp&s=a1375d04110844ad8780de2c2d39c01f2180d144\n\nYears with the highest spread of Min Open Price to Max Open Price.\n\nhttps://preview.redd.it/qpo7qvzk3p571.png?width=948&format=png&auto=webp&s=44d26632b54922b2f930551aeabd66767ba7158b\n\nAcross the board, there is a pretty flat rate of 12% of trading days seeing a .00 key price point.\n\nIn 2021, GME saw a minimum open price of $17.34 and a maximum open price of $379.71, an increase of 21X. And what is GME’s percentage of days in 2021 with a .00 key price point? 61.06%.\n\nThe largest one-year spread (until GME has its way with me) I found was in OSTK in 2020. I saw a low of $2.54 and a high of $124.65, an increase of 49X. Yet, OSTK’s percentage of days in 2020 with a .00 key price point was only 14.62%.\n\nWhile reason #2.00 was more inconclusive because of a lack of data, reason #3.00 can clearly be dismissed as false. There is no relation between a stock's open spread in a given year with the percentage of trading days with .00 appearances.\n\n\\------------------------------\n\nThat's all I have for now. There are no dates or prices this data allows us to spectate on, but it does show that something is fishy.\n\nI applaud you for making it through this data-heavy DD. As I mentioned at the start of my post, I'm not done yet. I think there is more here as the frequency of these .00s is steadily increasing. In my next post, I will be mapping GME’s .00 price point frequency to the FTD cycle.\n\nNow I look to you, ape. Please help me out by providing further reasoning as to why GME might be seeing .00 price points. I'm happy to do further research, discuss, and add another wrinkle to this smooth brain of mine. I want every piece to this .00 puzzle.",
    "title": "I processed 16 years of data across 8 stocks to prove something no one cares about: GME's price is ending in .00 10X more than it should be.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1gn2u/i_processed_16_years_of_data_across_8_stocks_to/"
}