{
    "author": "Jealous-Bike-6883",
    "created_utc": 1623876629.0,
    "distinguished": null,
    "edited": 1623896814.0,
    "id": "o1f555",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o1f555",
    "num_comments": 73,
    "permalink": "/r/Superstonk/comments/o1f555/iwm_etf_which_contains_both_gme_and_movie_stock/",
    "score": 956,
    "selftext": "Small cap ETF ticker symbol IWM has a large amount of GME and movie stock. GME’s allocation valued at 196.16 million and Movie stocks valued at 10.08 million. This is the second most(GME) and the most(Movie stock) for all ETF’s containing these stocks. And as we know hedgies have been shorting ETF’s containing these stocks to drive prices down. \n\nRecently I was looking through [GME ETF FTD’s](https://failedtodeliver.com/?symbols=SFYF,CSML,PSC,FNDA,VOX,VBR,IEME,IWN,IUS,FCOM,VB,SCHA,IWM,VTWV,UWM,FNDB,PRF,URTY,VTWO) and [movie stock ETF FTD’s](https://failedtodeliver.com/?symbols=SFYF,CSML,PSC,FNDA,VOX,VBR,IEME,IWN,IUS,FCOM,VB,SCHA,IWM,VTWV,UWM,FNDB,PRF,URTY,VTWO) and found for the date May 14th there was a unusually large amount of FTD’s on the ETF IWM. \n\nNearly a billion dollars worth of FTD’s when the last time it has been that high was December 2020 when it was 1.6 billion dollars worth. \n\nIf we apply u/dentisttft DD on T+35 ([T+35 cycle DD](https://www.reddit.com/r/Superstonk/comments/o155a6/t35_is_the_one_true_cycle_evidence_to_back_my/)) this puts hedgies having to settle these FTD’s tomorrow the 17th.\n\nIf I’m right about this months SLD(supplemental liquidity deposits) period starting today the 16th this could cause some green pressure tomorrow. \n\nI’m feeling a bit tin foil hat about this but I can’t help but feel this amount of ETF FTD’s stands out and could point to some major movement starting tomorrow and into next week.\n\nEDIT: It’s been brought to my attention the allocation of GME/Movie stock for IWM is of concern. \n\nAccording to [GME ETF Info](https://www.etf.com/stock/GME) GME’s market value is the second highest in IWM valued at 196.16M with only .30% allocation. For reference FTXD has a allocation of 9.37% and only a market value of 727.57K. \n\nFor Movie stock it is the highest by a good amount valued at 10.08M with only .01% allocation. \n\nSo allocation is relative to the ETF of question. IVM DOES have a significant amount of GME/Movie stock. Second most for GME and the most for Movie Stock.\n\nTL/DR: IVM ETF has over a BILLION dollars of GME/Movie Stock FTD’s having to be settled come tomorrow the 17th. Hasn’t been this high since December 2020 when it was 1.6 billion. We are also in a period called SLD starting today which basically makes it riskier for hedgies to commit any tomfoolery. May 25th run up was caused by combination of FTD’s and SLD period.",
    "title": "IWM ETF which contains both GME and movie stock has nearly a BILLION dollars worth of FTD’s",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1f555/iwm_etf_which_contains_both_gme_and_movie_stock/"
}