{
    "author": "loggic",
    "created_utc": 1623866759.0,
    "distinguished": null,
    "edited": false,
    "id": "o1b844",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o1b844",
    "num_comments": 126,
    "permalink": "/r/Superstonk/comments/o1b844/shell_games_all_the_way_down/",
    "score": 888,
    "selftext": "This DD can stand alone, but it might be easier to follow if you’ve already checked out the House of Cards DDs. Once we know that the markets are fundamentally borked, it then becomes important to see how ETFs provide another layer to the game. It is a Russian Nesting Doll shell game - you lift up a cup, only to find another shell game. The further down you go, the more it becomes clear that there is never a ball. It is just shell games, all the way down.\n\nIt is also important to know that there has been some extreme activity in basically every single ETF containing GME. That activity recently includes a record breaking number of FTDs.\n\nIn order to make sense of what I am talking about, first we need to get a handle on a few concepts:\n\n# ETF:\n\nA typical explanation of an ETF would be like the one found in “What is an ETF?”, which basically says that it is like a mutual fund, except better. They explain it as buying a “basket of goods” through a single transaction with a single ticker. Some explanations may include a mention of the fact that an ETF might not perfectly track the performance of the underlying securities, but it typically ends there. This glosses over some critically important specifics, and those specifics have a pretty dramatic impact on how the market works. I think this impact is basically unknown to retail and largely ignored by basically any institutions that aren’t looking to exploit them. More on that later.\n\nThink of an ETF like a coupon for a cone of ice cream at the local ice cream shop. It has ice cream. It has a cone. They’re separate pieces, but the single coupon can be used at the shop to get both at the same time.\n\n# Arbitrage:\n\nFrom Investopedia:\n\n>Arbitrage is the simultaneous purchase and sale of the same asset in different markets in order to profit from tiny differences in the asset's listed price. It exploits short-lived variations in the price of identical or similar financial instruments in different markets or in different forms.\n\nIn normal language, arbitrage is just buying low and then instantly selling high. Imagine I am in this situation: the barn peasants are selling coupons that can be used at the ice cream and the castle nobles are buying.\n\n&#x200B;\n\n[Why do they have ice cream coupons in a barn?](https://preview.redd.it/ko3jnqzo0o571.png?width=480&format=png&auto=webp&s=6eb4b7837af3580dd3242bf210d1dec0867b2279)\n\nArbitrage is just buying these coupons, then immediately selling it for a profit. In the market, I keep doing this until the peasants wonder WTF I'm doing with this ice cream & start charging more or the nobles have so many coupons that they’re not willing to pay as much. Eventually these two different groups will be trading at the same price, so I will look for profit elsewhere.\n\nThese trades happen almost instantly, so arbitrage is almost risk-free profit.\n\n# Creation/Redemption Mechanism\n\nThis is a mechanic that is absolutely central to the way ETFs actually work in the markets, and it is also central to why ETFs leave the entire market severely exposed.\n\nThe short version is that the big boys (aka Authorized Participants) can assemble and disassemble the “basket of goods”. If they buy enough ETF shares, they can “redeem” them with the ETF Sponsor to receive cash and/or the underlying securities. Alternatively, they can buy up the various underlying securities, then send them to the ETF Sponsor to “create” new shares of the ETF.\n\nSince ETFs trade like shares all on their own, buying pressure will increase the price & selling pressure will decrease the price. By allowing ETF shares to be easily exchanged for their underlying securities, this Creation/Redemption Mechanism allows the big boys to use Arbitrage to keep the ETF share prices from moving very far from what they “should be”. If the ETF is expensive, the big boys can buy up underlying shares, create ETF shares, then instantly sell those shares at a profit. If the ETF shares are cheap they can buy up the cheap ETF shares, break them apart, and instantly sell the components for a profit.\n\nImagine I see someone selling these coupons:\n\n&#x200B;\n\nhttps://preview.redd.it/7dhvm8o01o571.png?width=3600&format=png&auto=webp&s=f43351721524aab3f56fc6b781aae5bf9e947d73\n\nI can buy the coupon for ice cream with a cone, use it to get the treat from the ice cream shop, take the cone off, then sell the ice cream to someone else. Why is someone selling coupons for ice cream + a cone for less than what the individual pieces could sell for? I don’t know, I don’t care. I just buy a stack of coupons, redeem them, take the cones off, then turn around and sell the de-coned ice cream for more than I paid for it. I will keep doing this until that guy starts charging more for the ice cream + cone coupon or starts charging less for the ice cream. That’s how the ETF redemption process works. The coupon is an ETF called $TREAT, and it can be redeemed by the ice cream shop (aka the ETF Sponsor) for the underlying securities $CREAM and $CONE.\n\nThe “creation” process is this same thing, just backwards.\n\nLet’s imagine you turn around and see that the ice cream + cone coupon is now selling for $50. You have a whole pile of cones left over, and I doubt they’re worth much by themselves, so what do you do? You start buying ice cream & putting a cone on it. Weirdly enough, the ice cream shop is then totally willing to accept your assembly & gives you a coupon in return. You take the individual $CREAM and $CONE securities and give them to the ice cream shop to “create” coupons (shares of the ETF $TREAT). Now you have a stack of coupons you can apparently sell to other people for $50 a pop.\n\nEventually, people aren't willing to pay that much, and the price of the coupon ends up being almost exactly the same as the price of the ice cream and the cone. That is how creation & redemption work together with the concept of arbitrage.\n\nThis is also the mechanism exploited to short GME through the ETFs, but the explanations I have seen of that mechanism don’t capture the extent of the BS available here.\n\nWith those concepts in mind, let’s get to it.\n\n# The Fuckening\n\n**Level 1 - “The Basket of Goods” Flavored Trash**\n\nIn order to legally short a stock, you need to find shares to “borrow” in order to short them. ETFs play a role here. These fund managers aren’t just going to sit on a pile of stocks, they’re going to use them to make money. Since the ETF is technically supposed to own the shares of the underlying securities, what do they do? They make those securities available to borrow. When somebody wants to short GME, they go to an ETF manager & borrow all of their GME shares to short on the open market.\n\nThis is the first layer of BS: the ETF that “contains GME” doesn’t actually even own the underlying shares of GME anymore. They have the collateral posted by the shorters & a contract with the shorters that allows them to recall the GME shares if needed. Since ETFs typically track an index or something similar, this traffic is predictable & leaves the shorters with a lot of confidence that they’ll only be recalled if they can’t meet a margin call.\n\nSo, we know that the people running these ETFs don't want to get stuck without enough collateral, so everyone who discusses the risks of an ETF always seems to mention that they use \"over-collateralization\" to mitigate that risk. The rule of thumb for over-collateralization is that the collateral is worth 10-20% more than the loan. In January's run-up, GME increased by more than that in just a few minutes. At the end of February, the price of GME **quadrupled** in 2 hours.\n\nShorting the shares lent by the ETFs didn’t bankrupt GME, naked shorting hasn’t worked, and now I am starting to get worried that everyone will find out I am swimming naked. So what do I do, get dressed? Screw that, I start stripping off everyone else’s clothes.\n\n**Level 2 - The “Passive Management” Share Multiplier**\n\nETFs are traded like shares. They’re created and redeemed through trades & follow those same norms. Since they heavily rely on this mechanism + arbitrage to keep their prices in line, I can strip them, and effectively multiply one share into multiple short positions. The first short position was Level 1, but the second short position is found in the way ETFs are passively “managed”.\n\nI can *naked short the ETF* & the purchaser will almost certainly use those counterfeit ETF shares for redemption. Why? Because I sell the ETF at a *tiny* discount in comparison to the price of the underlying securities.\n\nBut wait, I thought the ETF didn’t actually own any GME shares. How does that work?\n\n*These ETF managers are also market makers.* Rather than going to the market and purchasing the GME shares to then resell, why not just naked short them? On the books this can be cheaply hedged with the loaned shares, because they can theoretically close their own shorts any time by recalling the loaned shares. In the meantime they keep making money on the loan payments & have a nearly free short position open for themselves. Now the ETF has loaned out their shares for shorting (my Level 1 short positions), then I caused them to naked short shares to fulfill their redemption obligations (my Level 2 short positions), & their books are considered balanced.\n\nBut wait, I thought redeeming the ETF shares would increase the price of the ETF shares. Doesn’t the arbitrage mechanism just undo what I did? NOPE.\n\nThe redeemed ETF shares are naked - they never existed. Arbitrage only functions “correctly” when the shares are real. The Net Asset Value of the ETF is calculated by the sponsor regularly, and arbitrage only works when the ETF share price is sufficiently different from the NAV divided by the number of shares outstanding. When I naked shorted the ETF at a discount to the NAV, another market maker jumped in and *used arbitrage for its exact intended purpose: they brought the price of the ETF back in line with where it should be*. When the naked ETF shares were redeemed, the ETF’s assets decreased but so did the *apparent* number of outstanding shares. Based on the ETF sponsor’s information, the redeemed shares are no longer in circulation. This means the NAV vs. shares outstanding ratio is still very close to what it should be, so there isn’t anything left for arbitrage to do.\n\nIn an honest market, or even in a normal market, I would eventually need to cover my ETF short positions. There’s no legitimate market-making purpose to continue the naked position, so I would eventually cover it as a part of some future arbitrage event.\n\nOnce the ETF had been naked shorted as much as I thought I could risk, I could keep the shell game going by *legally* shorting it. The number of ETF shares that are *actually* in circulation (ie - owned by other people) at that point would be far more than the number that *should* be in circulation (ie - the number of ETF shares created through the legitimate creation mechanism) because of my naked ETF shorting. Since it isn’t difficult to locate shares to borrow for shorting, it is reasonable to expect that the interest charged would be low. I can keep doing this until the ETF literally has no more GME shares they’re willing to short to me (likely meaning that they have no more loaned GME shares or options contracts available to hedge with).\n\n**Level 2b - The Masterstroke**\n\nThe masterstroke here is that the offending HF *doesn’t owe the underlying securities, they owe shares of the ETF*. The underlying securities received from redemption & sold on the market were legally binding, even if the ETF shares from the HF were nothing but hot air. The HF might not have successfully bankrupted GME, but they might cause the ETF to collapse & be delisted. If the HF can cause a huge amount of the securities in an ETF to bleed out, then the naked short positions of the ETF could sink the whole fund & relieve the HFs of any debt related to their short ETF positions.\n\nUsing the ice cream shop metaphor: the ETFs aren't ice cream cones, they're **coupons** that can be redeemed with a particular ice cream shop (the ETF Sponsor). If they go out of business, the coupons are worthless. Anybody who owes ice cream is screwed - the price of ice cream might not even change. Anybody who owes **coupons**, however, suddenly is in the clear. Who's gonna fight to get you to deliver coupons that can't be redeemed for anything anymore?\n\nAs much as the accountants might want to *pretend* that a contract for loaned shares is just as valuable as (if not more valuable than) the shares themselves, they absolutely are not. When the shorter misses a margin call, the ETF is stuck trying to use the now inadequate collateral to repurchase a share. Suddenly, the \"balanced books\" are left with significant debt. Not all the shares on loan can be replaced with the collateral held for that purpose, and now the ETF is left with a bunch of short positions & 0 hedge to back them up. The ETF Sponsor realizes they're not making enough money to even cover the costs of business, decides to delist, and leaves anyone who still owns ETF shares holding a bag of hot air.\n\nIf the ETF is getting bled dry, how would they not see it coming? As the total amount of money flowing into the ETF increases from new investment, more ETF shares will be created. While us normal folks would hope that money would be used to pay down debt, the savvy financial folks know that debt is king & cash is for doing business with the poors. As long as the ETF’s naked short positions are secured by a share on loan, they’re making profit on that position equal to the interest payments on the loan minus the risk cost of the short position (which they’ve already assumed is extremely low risk).\n\nInstead, the ETF will purchase *new* positions in the underlying securities without closing any of the old short positions. This increases the NAV, then arbitrage jumps into effect to create new ETF shares & bring the price back into balance. When this happens, it is basically a bat signal to the HFs that there’s more cookies in the cookie jar, so they do it all over again. Infuriatingly, this looks on paper like everyone involved is making a profit & “creating wealth”. After the ETF collapses, the HF would likely even be celebrated for their short positions because of how wildly profitable they become once the ETF is delisted.\n\nWhat is the Masterstroke? The Hedge Funds caused selling pressure on stocks of their own choosing, made sure someone else was stuck with the bill, kicked off Level 3 of the Fuckening, and walked away scott-free with the untaxed money they made from basically just pretending to sell the ETF’s shares back to itself.\n\n**Level 3 - The Share Laundry**\n\nThis whole thing isn’t just a multiplier, it is a cyclical multiplier. If naked shorts are the Sexual Harassment Panda, then the Share Laundry would be the Autofellatio Hydra. Up until this point, I have focused on how I can keep selling pressure up on a particular stock. I legitimately borrowed shares out of ETF portfolios, I induced those ETFs to then naked short the stock using *my short positions* as collateral, and I brought in a whole bunch of money in the meantime by selling piles of nothing. But what happened to the GME shares that were sold?\n\nWell… They were purchased. Seems intuitive.\n\nOnce those shares are purchased, for all intents and purposes they are real shares. Those shares end up in retail’s hands, where they might be held in margin accounts with their brokers. The shares end up in pensions. They end up in all sorts of different accounts, many of which have something extremely unfortunate in common: they’re managed by people who see a pile of shares as wasted potential.\n\nTo initially create an ETF, or to create new ETF shares, they don’t have to purchase new shares. They are often borrowed from places like pensions.\n\nSo there truly is no end to the shell game. An ETF borrows shares from a pension, loans those shares out again, shorts against those loans, then borrows those same shares again. Even worse, the more they go through this the more they multiply the shares, the more easily shares are to locate for borrowing, the cheaper it is to short those shares again. If every borrowed share can result in 2 (or more) short positions, then this is exponential debt. Five cycles in the Share Laundry turns 1 share into 16 short positions, largely funded by people who were looking to *decrease risk* by investing in the diversified portfolio provided by ETFs.\n\nHow does a company with only 70 million shares outstanding suddenly have a trading volume of 200 million in a single day? How does such a highly shorted stock have a short fee that always seems to be dropping to near 0? Just like this.\n\nThere’s no shares, just shell games all the way down.\n\n**Epilogue: Citadel’s Firewalls**\n\nThis whole post has been written as though a single hedge fund is attempting to manipulate the market this way, but the reality is still more complicated. Melvin Capital is not Citadel Securities, even if they’ve been acquired. There is an awful lot of business law that centers on the idea of isolating subsidiaries’ risks from other branches of the company, and I would be absolutely dumbfounded if this wasn’t the case between Melvin and Citadel.\n\nIf we know that there are insurance policies & contractual obligations that will soften the blow to Citadel once Melvin officially goes under, then we should assume that Citadel will structure the transactions being done so all of the most catastrophic failures happen in Melvin’s name. At the same time, the most significant successes will likely happen wherever they’re most valuable. By concentrating the doomed positions into Melvin Capital & allowing Citadel to hold the positions that will potentially hit the “bankruptcy jackpot”, Citadel may very well be able to get out of this alive at the expense of basically every single ETF on the market. If Citadel has naked shorts on \\*every\\* ETF that contains GME, they would profit from not trying to cover those positions \\*at all\\*. In this way they’re not just pushing more GME shares into circulation, they’re pushing out more shares of every single company that happens to be in an ETF that also has GME.\n\nMore than that, by manipulating multiple ETFs at the same time, Melvin and/or Citadel could “cover” their positions. How? They naked short ETFs, go through redemption, then use the shares from redemption to cover their short positions that were borrowed from another ETF. Functionally, they’re using a naked ETF position to cover a GME short position. Citadel’s short GME positions basically just move onto the ETF sponsors’ balances. By twisting their debts into a pretzel, Citadel no longer owes GME shares directly, they owe a boatload of ETF shares. Whether they realize it or not, at that point the ETFs all just owe GME shares to each other. They let themselves get woven into a continuous ring of debt, and every naked position they open could theoretically be a naked position closed by Citadel.\n\nSaid another way: remember when I said that the ETF had naked shorted GME using *my short positions* as collateral? By twisting everything about, I can make it so ETFs naked shorted GME using *other ETFs' naked short positions* as collateral.\n\nIf those ETFs go under, Citadel profits from *all* of those sales, not just the GME portion. Once Melvin collapses and takes the entire ETF market down with them, Citadel’s profits suddenly go through the roof at the same moment the insurance policies on Melvin pay off and mitigate at least some of the damage.\n\nApes get paid, but Citadel may very well live on. As nauseating as it is to contemplate, this may actually be preferable to the alternative. Any organization big enough to absorb Citadel’s assets post-MOASS is not going to be a friend to the little guy. If Citadel goes down, the demented phoenix that rises from those ashes may very well be far worse. No matter what happens, we need a future with better regulators than the ones of the past.\n\nIf you thought this was depressing, stay tuned for the sequel, “Debt is King, Cash is for the Poors”.\n\n**TL;DR** The ETFs that contain GME are potentially being used to push the risks of naked short positions onto the entire market. By exploiting the way ETFs are \"passively managed\", Citadel can exponentially increase the number of GME shares in circulation, force shorting fees to stay low, keep GME selling pressure high, and achieve the “bankruptcy jackpot” against the ETF Sponsors instead of GME. If this is what is happening then they're literally preparing to use the money people put into \"Boomer investments\" (likely those managed by their competitors) to pay for their MOASS debts.\n\nSources:\n\nWhat Is The Creation/Redemption Mechanism?\n\n[https://www.etf.com/etf-education-center/etf-basics/what-is-the-creationredemption-mechanism](https://www.etf.com/etf-education-center/etf-basics/what-is-the-creationredemption-mechanism)\n\nArbitrage\n\n[https://www.investopedia.com/terms/a/arbitrage.asp](https://www.investopedia.com/terms/a/arbitrage.asp)\n\nWhat is an ETF?\n\n[https://www.etf.com/etf-education-center/etf-basics/what-is-an-etf](https://www.etf.com/etf-education-center/etf-basics/what-is-an-etf)\n\nUnderstanding Securities Lending\n\n[https://www.etf.com/etf-education-center/etf-basics/understanding-securities-lending](https://www.etf.com/etf-education-center/etf-basics/understanding-securities-lending)\n\nETF Short Interest and Failures-to-Deliver: Naked Short-Selling or Operational Shorting?\n\n[https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf](https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf)\n\nOver-Collateralization (OC)\n\n[https://www.investopedia.com/terms/o/overcollateralization.asp](https://www.investopedia.com/terms/o/overcollateralization.asp)",
    "title": "Shell Games All The Way Down",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1b844/shell_games_all_the_way_down/"
}