{
    "author": "dentisttft",
    "created_utc": 1623850853.0,
    "distinguished": null,
    "edited": 1624332362.0,
    "id": "o155a6",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o155a6",
    "num_comments": 900,
    "permalink": "/r/Superstonk/comments/o155a6/t35_is_the_one_true_cycle_evidence_to_back_my/",
    "score": 8160,
    "selftext": "*This post is for educational purposes only. Do your own research and make your own decisions before acting on them. Just because this information is correct now, doesn’t mean it will be correct every other day. HFs have a lot of tricks. No one knows what will come next...*\n\n**EDIT10 (6/21): It is more clear to me now that ETF FTD's do not behave the same as the GME FTDs that I use as examples. The ETF FTDs are a work in progress. The ETF FTDs should be weighted as well. If you find a pattern in the ETF FTDs, I'm open to hearing it!**\n\n\\--------------------------------------------------------------------------------------\n\n**TL;DR:**\n\n* **Every spike that is seen can be traced back to T+35.**\n* **I show 1 min spikes to back this claim up**\n* **I provide a guide on how to setup this data yourself.**\n\n# Preface\n\nAlmost 2 weeks ago, I posted some DD about T+35.\n\n[T+21 is NOT actually a thing! \\[Counter DD\\]](https://www.reddit.com/r/Superstonk/comments/nsady3/t21_is_not_actually_a_thing_counter_dd/)\n\nI claim that T+35 is the only T+X that is important, and other T+X “cycles” are actually just from T+35. This concept goes against the general consensus, so as expected... I got mixed reviews. Since then I have seen a different T+X, T+Y, T+Z theory every day, but there is always a catch or some sort of guessing applied. Or the cycle is T+21 one month, but T+19 the other month. As you may imagine, this has gotten frustrating for me. There is no shade being thrown at other DD writers. I just want everyone to realize how simple this is so we can all be on the same page.\n\n&#x200B;\n\n**My T+35 theory doesn’t have guess work. It works every time and it’s based on free data that anyone can get.** In this post, I will show you how. (I know this is starting to sound like an infomercial, but stick with me)\n\n# Where my T+35 theory comes from...\n\n**Reg SHO Rule 204** ([https://www.law.cornell.edu/cfr/text/17/242.204](https://www.law.cornell.edu/cfr/text/17/242.204)) states HFs need to cover their FTDs “before regular trading hours on the 35th day after the FTD date”. My T+35 theory shows they wait until the last possible day to cover, so the 34th day after the FTD date (this is why our third column formula was “=A1 + **34**”). If the 34th day lands on a weekend or holiday, bump it forward to the next business day.\n\nReg SHO states that you cannot short a stock if you have FTDs open. Once the FTDs get covered on that day, GME’s price will not return to that point.\n\nThat’s it. That’s all you need.\n\n&#x200B;\n\n**It’s as simple as…**\n\n1. Get the FTD data\n2. Count 34 calendar days (FTDs need to be covered BEFORE the 35th day)\n3. Those FTDs will be bought all at once on that trading day.\n\n&#x200B;\n\n# Oh, you want to see an example?\n\nOkay, sure.\n\nI have picked out days from April because the FTDs are large and the volume was small. It is very easy to pick them out.\n\nHow about… **April 21**. 32,220 FTDs need to be covered. The day’s volume was low, but there was a 1m volume spike at 12:23 EST of 39,000. GME’s price never came back afterward.\n\n&#x200B;\n\nhttps://preview.redd.it/c82wf7csqm571.png?width=451&format=png&auto=webp&s=ca4a553ffb37e4eb7ef574f3bdd7efc21bbcd413\n\nhttps://preview.redd.it/stvi493tqm571.png?width=760&format=png&auto=webp&s=c63c88a3ef43b64a79c124bf49fc0aaff0057ec9\n\n**April 19**. 140,554 FTDs need to be covered. GME was rising quite fast on it’s own. Remember, they can’t short a stock when they have FTDs that need to be covered. So at 10:25 EST, There was a big jump in volume up to 160k and then the price dropped for the rest of the day.\n\n&#x200B;\n\nhttps://preview.redd.it/lb5q8rbvqm571.png?width=449&format=png&auto=webp&s=6fa055c19c2cf90d9cd6c8bddd1c201c5d5d1543\n\nhttps://preview.redd.it/px47llyvqm571.png?width=805&format=png&auto=webp&s=e344df65f5219edef1d3f7708357a728c5793130\n\nYou see? It's that easy!\n\n&#x200B;\n\n# Meh... this seems like a coincidence\n\nOkay, fine... I'll keep going.\n\n&#x200B;\n\n**April 16** \\- 46,344 FTDs\n\nhttps://preview.redd.it/cmrtpjd1rm571.png?width=449&format=png&auto=webp&s=feaf916cbd63dffe35c043ca34ffeebfb81ee19d\n\nhttps://preview.redd.it/3f8jcft1rm571.png?width=805&format=png&auto=webp&s=89bad926ace29cb36dfb23cfed018e78e642e653\n\n&#x200B;\n\n**April 15** \\- 155,658 FTDs\n\nhttps://preview.redd.it/n75at1i4rm571.png?width=448&format=png&auto=webp&s=5b314710aa16ba499713776eccf36306c5826688\n\nhttps://preview.redd.it/rjz3cpw4rm571.png?width=758&format=png&auto=webp&s=a027c39558f072760bb8c02bc2601580da764abc\n\n&#x200B;\n\n**April 1** \\- Two days needed to be covered this day because 4/4 was a weekend. At 1:25, there was an 83k volume spike followed by a couple 100k-150k volume candles.\n\nhttps://preview.redd.it/dtcgi377rm571.png?width=449&format=png&auto=webp&s=04879f53d128e51679420c3c9acd23be166d06dc\n\nhttps://preview.redd.it/hjktf658rm571.png?width=763&format=png&auto=webp&s=eb96ccede1210db6c24950eeb0f689db122b6f99\n\n&#x200B;\n\n**April 30** \\- 86,859 FTDs. This one got split between two minutes on my chart. The average 1m volume was between 30k-40k shares. And then there are two 70k-80k volume candles at 9:50-9:51 am.\n\nhttps://preview.redd.it/vezj8zkarm571.png?width=453&format=png&auto=webp&s=06957bcdbaeeaa47ba59f34382e1811182c2b07a\n\nhttps://preview.redd.it/fb1lqpyarm571.png?width=855&format=png&auto=webp&s=238276a529cc1e48c34e06e58e9bce7b3a817843\n\nI can keep going. These are the easy ones to spot *just* in April.\n\n# So what about ETF FTDs?\n\nDays with large ETF FTDs also see spikes like this. But it doesn’t convert well enough to show. For instance, 1.9 million ETF FTDs might convert to a 120,000 share GME spike. If someone wants to continue this research and find a way to convert the ETF FTD count into GME shares, go ahead.\n\n# Why do some days lead to large gains and some days drop immediately after the FTD cover?\n\nI wrote about that in my last DD:\n\n[SLD DD \\[A predictable monthly pinch on capital leading to GME gains\\]](https://www.reddit.com/r/Superstonk/comments/nz7mwl/sld_dd_a_predictable_monthly_pinch_on_capital/)\n\n&#x200B;\n\nBut here’s what you need to know if you can’t read two DDs in a row:\n\n* There is a period that **starts on Wednesday** before monthly options expiration and **extends to 9 days after** monthly options expiration where the 30 largest financial companies need to **make large deposits** to the NSCC.\n* During those days, they have **less money** and need to be careful not to spend more or they will get **liquidity called**.\n* Meaning T+35’s with large FTD days that fall in the SLD period will increase GME’s price a lot more than large FTD days that fall out of the SLD period. **Once the price of GME rises within the SLD period, it does not come back down** until 2 days before the end of SLD.\n\n&#x200B;\n\nI even mapped out the SLD periods:\n\nhttps://preview.redd.it/ys4ovwzurm571.png?width=1246&format=png&auto=webp&s=16a4fcd208abfca25a479f87f5f54fc590b2af06\n\n&#x200B;\n\nMarch 5-10 is the biggest spike outside of SLD. Those can be associated with ETF FTDs.\n\n&#x200B;\n\nhttps://preview.redd.it/enpanyhxrm571.png?width=448&format=png&auto=webp&s=3c9b8bb8bb070fe3283ecdb7874e7e94eb283339\n\n# How do I see this for myself?\n\nDownload the FTD data from the SEC: [https://www.sec.gov/data/foiadocsfailsdatahtm](https://www.sec.gov/data/foiadocsfailsdatahtm) and pull out every line with GME and every line of the ETFs GME are in. But that’s a lot of work. Luckily, a lovely ape by the name of u/nequin made a website to do this all for you.\n\n&#x200B;\n\nGet the FTD data:\n\n1. Go to [https://failedtodeliver.com/?symbols=GME](https://failedtodeliver.com/?symbols=GME)\n2. Make a spreadsheet.\n   1. Column A is the FTD date.\n   2. Column B is “=A1+34” and fill down.\n   3. Column C is the number of GME FTDs\n   4. Column D is the number of ETF FTDs\n\n&#x200B;\n\n**ETFs with GME**\n\n[https://failedtodeliver.com/?symbols=GAMR,XRT,RETL,XSVM,VIOV,RWJ,VIOO,PSCD,VIOG,VTWV,IUSS,VCR,VTWO,SFYF,IWC,EWSC,SYLD,PRF,RALS,FNDX,FNDB,VBR,IJS,XJR,NUSC,SLYV,IJR,SPSM,SLY,FLQS,IJT,GSSC,SLYG,VXF,NVQ,IWN,ESML,VB,SAA,DMRS,BBSC,OMFS,FDIS,STSB,SSLY,IWM,SCHA,PBSM,UWM,VTHR,URTY,VTI,TILT,VLU,HDG,AVUS,MMTM,DSI,SPTM,IWV,SCHB,ITOT,DFAU](https://failedtodeliver.com/?symbols=GAMR,XRT,RETL,XSVM,VIOV,RWJ,VIOO,PSCD,VIOG,VTWV,IUSS,VCR,VTWO,SFYF,IWC,EWSC,SYLD,PRF,RALS,FNDX,FNDB,VBR,IJS,XJR,NUSC,SLYV,IJR,SPSM,SLY,FLQS,IJT,GSSC,SLYG,VXF,NVQ,IWN,ESML,VB,SAA,DMRS,BBSC,OMFS,FDIS,STSB,SSLY,IWM,SCHA,PBSM,UWM,VTHR,URTY,VTI,TILT,VLU,HDG,AVUS,MMTM,DSI,SPTM,IWV,SCHB,ITOT,DFAU)\n\n&#x200B;\n\nEDIT 7: I posted my dataset for the people who want to compare. [https://www.reddit.com/user/dentisttft/comments/o1k5s4/t35\\_dataset/](https://www.reddit.com/user/dentisttft/comments/o1k5s4/t35_dataset/)\n\n&#x200B;\n\nEDIT 9: There were some issues brought up in the data. But they shouldn't be issues. Trust the files or [failedtodeliver.com](https://failedtodeliver.com), they are the same.\n\n**~~EDIT 6: IT HAS BEEN BROUGHT TO MY ATTENTION THAT THE WEBSITE IS OFF BY ONE DAY STARTING IN APRIL. PROBABLY BECAUSE OF THE HOLIDAY. I HAVE TAGGED THE PERSON WHO CREATED IT. SO MAKE SURE YOU DOUBLE CHECK SOME DAYS WITH THE FILES UNTIL ITS FIXED.~~**\n\n**~~EDIT 8: APPARENTLY THE WEBSITE USES THE FILES, SO EDIT 6 IS NOT COMPLETELY CORRECT. THERE IS A DISCREPENCY BETWEEN THE FILES/FAILEDTODELIVER.COM AND THE SEC'S FTD GRAPH.~~** [**~~https://sec.report/fails.php?tc=gme~~**](https://sec.report/fails.php?tc=gme)\n\n**~~THE FILES SKIP APRIL 21 (WHICH IN MY OPINION MEANS ZERO) AND HAVE APRIL 30, THE GRAPH WEBSITE HAS APRIL 21 AND SKIPS APRIL 30. SO I THINK THE GRAPH WEBSITE MIGHT BE INCORRECT.~~**\n\n&#x200B;\n\nImportant Notes:\n\n* Column A is the settlement date when the share officially becomes an FTD.\n* Column B is the last possible day to cover the FTD\n\n&#x200B;\n\nYour spreadsheet looks like this…\n\nhttps://preview.redd.it/ox473wz4sm571.png?width=451&format=png&auto=webp&s=0efc2bda56da1c16e3ab3ea4887db568cdbf43b8\n\n# Now what?\n\n1. Google search “what is today’s date”\n2. Find that date in column 2 (the +34 day)\n3. Follow this flow chart.\n\nhttps://preview.redd.it/4ag11hd7sm571.png?width=292&format=png&auto=webp&s=7fc674526dbcd541c60490e9661581559fadade3\n\nIn my experience, a “large number of FTDs” is 70,000+ for GME FTDs or 1-1.5 million FTDs for ETFs.\n\nAgain, this is not guaranteed. This is just based on patterns I’ve seen. There are plenty of tricks that probably have not been shown. Don’t do something stupid based on this data, its for education purposes only.\n\n# Should my tits be jacked!?\n\nHere's the new data for this next week... Use your new knowledge from this post and you decide!\n\n[EDIT5: Fixed the hightlighted section. Accidentally had June 15th in there when it shouldn't be.](https://preview.redd.it/6a5dvr1jxn571.png?width=597&format=png&auto=webp&s=cc76d854e680a88d218b11774b70e0b805276687)\n\n&#x200B;\n\n# FAQ\n\n**New FTD data just came out yesterday. So what about June?**\n\nThe ETF FTDs are quite large for the next 5-7 trading days. Combine that with SLD starting on June 16 ~~17~~, things look good.\n\nEDIT5: Accidentally had the wrong date typed here and the wrong dates highlighted in the photo.\n\n&#x200B;\n\n**Why do the last two days of SLD not behave the same as the other days?**\n\nNot sure. My guess is that HFs have 2 days to pay a liquidity call. So there’s no point in liquidity calling them when they are about to get their money back. It also usually is at the end of the week when option premiums get extremely high, less calls are bought, and gamma ramp slows down.\n\n&#x200B;\n\n**How long does it take before GME/ETFs show up as FTDs?**\n\nThey become FTDs when the trade settles. So for GME FTDs, its T+2. For ETF’s, its T+6. (shoutout to u/karasuuchiha for pointing out the ETF settlement time to me)\n\n&#x200B;\n\n**What causes GME FTDs?**\n\nThis is where the idea of “cycles” comes from. When FTDs fall in SLD and GME spikes, it creates a lot of ITM call options. When those call options are exercised on Friday, they become FTDs upon settling (T+2 settlement). *Note: Buying and selling option contracts settle in T+1, but exercising contracts is T+2*. This causes a lot of new FTDs that need to be covered in 34 more days. **Thus creating an obsession with “cycles” and why other “T+X cycle” theories fall short.** It’s literally just ITM options from the last SLD + FTD spike price increase will create new FTDs on Tuesday (or Wednesday with a holiday).\n\n&#x200B;\n\n**What causes ETF FTDs?**\n\nSSR!!! Remember all those days when SSR didn’t stop GME from going down? It’s because GME is shorted through the ETFs causing ETF FTDs 6 days later when they settle. It did something, it’s just not immediately seen.\n\n&#x200B;\n\n**I’m still not buying it. There are definitely spikes every 21 days!**\n\nWell, I tried. Erase what you know about T+21 cycles and try to understand and apply this post. And maybe you will eventually see what I see.\n\n&#x200B;\n\n**What about Net Capital?**\n\nI don’t know. I avoid FINRA things because in the end… it’s just FINRA. This is based off of NSCC rules. I’ve found enough correlation in only using FTDs and SLD that I didn’t think I needed to look into Net Capital too much. They could definitely both be happening, but in the end, I don’t think it’s too important. I’m open to someone changing my mind on this if you can show me the data (not the rules) to support that Net Capital has more correlation than SLD.\n\n&#x200B;\n\n**What else should I know?**\n\nRule 204 says the 35 day exception applies when you have a long position on the stock. If they’re shorting, how do they get to say they have a long position? I have a theory, but nothing concrete.\n\n&#x200B;\n\n**TL;DR:** The TL;DR is at the top of the post you sweet, tender, smooth-brained ape.\n\n&#x200B;\n\nNow that I have more eyes on my posts, I’m hoping this theory sticks better than the first time. In my opinion, getting distracted on other types of cycles is diluting focus.\n\n&#x200B;\n\npce\\~\\~\n\nu/dentisttft\n\n\\----------------------------------------\n\nShoutout to u/wJFq6aE7-zv44wa__gHq for letting me bounce ideas off of them!\n\n&#x200B;\n\nEDIT1-3: formatting fixes\n\nEDIT4: Added \"Should my tits be jacked!?\" section\n\nEDIT5: Fixed the dates on my new section. I rushed it and highlighted June 15 on accident.\n\n# Bonus Round!\n\nI posted my SLD DD on June 13th at 6:23 PM EST. 6 hours later at 12:02, Elon Musk posted this on Twitter.\n\nhttps://preview.redd.it/83o4bvpgsm571.png?width=616&format=png&auto=webp&s=4527094e5aa1d136adabc4dd554778ac29b5590c\n\nIs it about my DD? No idea, probably not. But it’s fun to think about. If any of the RC Tweet analyzers can find a definite connection, that would make my day.",
    "title": "T+35 is the one true \"cycle\" [Evidence to back my theory up plus a step-by-step guide on how to follow along at home]",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o155a6/t35_is_the_one_true_cycle_evidence_to_back_my/"
}