{
    "author": "_Badtothebone_",
    "created_utc": 1623840535.0,
    "distinguished": null,
    "edited": false,
    "id": "o120xs",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o120xs",
    "num_comments": 371,
    "permalink": "/r/Superstonk/comments/o120xs/the_obv_does_not_lie_the_price_is_wronghodl/",
    "score": 9770,
    "selftext": "Hello Apes, Bones here, im going to explain what exactly the OBV is, what it does and how it pertains to GME.🚀\n\nhttps://preview.redd.it/ynaviphkfj571.jpg?width=828&format=pjpg&auto=webp&s=5d49c34c2259e89c511765963a43ba39c16dfe8a\n\nSo what is the OBV? Well OBV stands for “On Balance Volume” \n\n•On Balance Volume (OBV) measures buying and selling pressure as a cumulative indicator that adds volume on up days and subtracts volume on down days. \n\n⚠️The actual value of the OBV is unimportant; concentrate on its direction.⚠️\n\n*  When both price and OBV are making higher peaks and higher troughs, the upward trend is likely to continue.\n*  When both price and OBV are making lower peaks and lower troughs, the downward trend is likely to continue.\n*  During a trading range, if the OBV is rising, accumulation may be taking place—a warning of an upward breakout.\n*  During a trading range, if the OBV is falling, distribution may be taking place—a warning of a downward breakout.\n*  When price continues to make higher peaks and OBV fails to make higher peaks, the upward trend is likely to stall or fail. This is called a negative divergence.\n*  When price continues to make lower troughs and OBV fails to make lower troughs, the downward trend is likely to stall or fail. This is called a positive divergence.\n\n[https://www.fidelity.com/learning-center/trading-investing/technical-analysis/technical-indicator-guide/OBV](https://www.fidelity.com/learning-center/trading-investing/technical-analysis/technical-indicator-guide/OBV)\n\nNow that you have a brief idea of what OBV stands for and how its used in technical analysis i will present how to use it as an indicator for GME price action.\n\nSo if you look at the (180/1 day) chart for GME you will see that the price of GME is going down (at the moment).... BUT, the OBV is staying flat and actually continuing its upward pattern ever so slightly.\n\n&#x200B;\n\n[\\(GME OBV 180 day chart\\)](https://preview.redd.it/zbht8slsfj571.jpg?width=828&format=pjpg&auto=webp&s=1a1c7e620a3adb137dfabcc783643d6865a8148b)\n\n“But why would the price go down if the OBV is going up or staying flat?”\n\n&#x200B;\n\n[Vlad the stock impaler](https://preview.redd.it/0pvmjydwfj571.jpg?width=828&format=pjpg&auto=webp&s=764c994674f835ade9d1777e19904ea12fc91ca4)\n\nThats because there is actually buying pressure outweighing the selling pressure or coming damn near close to being even! \n\n\\-There are many great DDs out there explaining how hedgies use ETFs to short gamestop. In my opinion I believe the OBV is indicating that YOU, the Diamond Handed Apes are HODLING your shares and buying more that the OBV is staying up do to holding and buying pressure, and it proves that the price is indeed WRONG! \n\nHedgies are shorting gamestop through ETFs/ Dark Pools to artificially deflate the price, this keeps the price of GME down temporarily until they stop, once they stop shorting ETFs, GME begins uptrending because of buying pressure. There are no more shares available to short Gamestop (GME), so they resort to shorting ETFs that contain GME like XRT which is a big one. this does not effect the volume on GME because the hedgies are shorting ETFs, not GME directly, therefore the price of GME deflates but the OBV is showing otherwise. This is only a temporary fix for the hedgies. They are FUK either way.\n\nThis leads me to believe the price is 100% WRONG! Hedgies are trying to get Apes to paper hand and sell. And Apes are proving that it takes nothing to HOLD, and costs them everything to kick the can down the road.\n\n&#x200B;\n\nhttps://preview.redd.it/zzfhrcrfgj571.jpg?width=828&format=pjpg&auto=webp&s=db00d05ef9ca1f0c9f5646f555c37952620a0c32\n\nListen here hedgies, you cant kick the can down the road forever, DIAMOND HANDS got you beat. It costs nothing to hodl these shares to the moon and it will cost you everything to try and make apes paper hand. \n\n[Diamond Hands \\(APES OWN THE FLOAT....and then some\\)](https://preview.redd.it/vubzln7hgj571.jpg?width=828&format=pjpg&auto=webp&s=79588bf1c9fec000bc91e92663b4146a0eb6e10f)\n\n📈As for me, I like the stock📈\n\n🐻Hedies R Fuk🐻\n\n🚀🦍See you on the moon Apes 🦍 🚀\n\n\\-Boner out✌️\n\n(If i missed something or if anyone has info to add please leave it in the comments or DM me and i can add it)  \n\n❌Obligatory: \\*not financial advise\\*❌",
    "title": "The OBV does not lie. The price is WRONG!💎🙌HODL!🚀",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o120xs/the_obv_does_not_lie_the_price_is_wronghodl/"
}