{
    "author": "LetsBeatTheStreet",
    "created_utc": 1623492178.0,
    "distinguished": null,
    "edited": 1623585214.0,
    "id": "ny3dkx",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ny3dkx",
    "num_comments": 86,
    "permalink": "/r/Superstonk/comments/ny3dkx/gamestops_nft_lead_designer_spike_waaaayyyyyy/",
    "score": 697,
    "selftext": "[https://i.redd.it/rd1v5lic6t471.gif](https://i.redd.it/rd1v5lic6t471.gif)\n\nTHIS! **Power to the Creators** … Runner (the DFV inspired cat game on the NFT site) only gave us a small tease of the capability they are building. Keep in mind these guys have been at this for only 2 months or so, just take a look at what the GameStop NFT Lead Designer (Spike) shared. Twitter comment from u/groovycj69 pretty funny in that reply  tweet … Apes not paying attention … come on!  Looks like Spike has few things in mind regarding NFT utility and metaverse :).\n\nSource:   [https://twitter.com/nftspike/status/1402722217474117637](https://twitter.com/nftspike/status/1402722217474117637)\n\n**ELIA:** \n\nThis Tweet is from GameStops Lead NFT Designer named Spike. Spike does not tweet often and he has done so about this and an E3 (Super Bowl for Gaming!) tweet very recently.  I thought our Ape family would want to know.  It may be Spike showcasing via Twitter something he or his team created.  (Speculation Time):  could be a few things:  \n\n1. GME looking to getting further into gaming w/GameTrust (this could be a quick snippet) \n2. GME is looking to partner with a game dev company (thinking Scopely located in Culver City, CA -- RC Tweet :) ) \n3. GME is showcasing the utility of NFTs i.e. the crafts are NFTs, each unique craft will have unique stats to modify how it performs in the game and could be transferable in other games (think skins in Fortnite) \n4. Combo of the above and / or GME working on a metaverse of their own (an alternate digital reality where people work, play, and socialize) \n5. Anything else you want to speculate this to mean!\n\n**ELI5 on NFTs:** \n\nNFTs at the core are designed to be unique, one of a kind. In your MTG example, imagine each original MTG card has a unique serial # associated with each card. Anyone can buy a print of MTG card , but only one person can own the original MTG card #212. In terms of art, only one original Mona Lisa exists which is owned by one person, many other people have Mona Lisa prints.\n\n**Applicability to GME (IMO):** In general, it is Big Business (with a B!) - research shows that in 2020, the digital games industry hit $127B (with a B!), but 78% of that was from free-to-play games where players made in-game purchases. The top free-to-play game, “Honor of Kings,” saw $2.45B in revenue from player purchases. Once, someone spent $22M on a hero skin of a Chinese military general.\n\n* **Power to the Players** \\- NFTs in gaming environments grants players ownership of their in-game assets instead of game developers. Through blockchain technology, gamers can save in-game purchases, sell them to other players, or move them into other supported games. Even if a game is no longer maintained, your in-game purchases will always be under your control, which means that in-game items eventually become digital memorabilia and have a value outside of the game (think collectibles). Recent example: Mythical Games will create “Blanco Block Party,” an open-world game where players own the characters as NFTs. Each Blanko is a NFT that lives on a blockchain. While the game and the 1st Blanko are free, players can pay to customize and upgrade their Blankos, which then makes them (unique) NFTs which the player owns.\n* **Power to the Creators** \\- NFTs allow creators to make money directly from their work. A great example is art, where someone would require an agent to sell and market their work. NFTs eliminate these middlemen and allow the artists or the original creators to interact and transact directly with their customers. This model further benefits the creators by allowing them to earn a commission each time the NFT exchanges hands.\n* **Power to the Collectors** \\- NFTs are designed to give you something that can’t be copied: ownership of the work. To put it in terms of physical art collecting: anyone can buy a Monet print, but only one person can own the original. Just like art, some people will get involved with NFTs for the prospects of making money. There is an entire market today (just like art) of people earning a living from reselling them.\n\nEDIT2 (6/13): added ELIF to thread\n\nEDIT1: added ELIA and wanted to say Thank You for those who gave an award, save your $ for GME though!!",
    "title": "GameStop’s NFT Lead Designer Spike ... WAAAAYYYYYY beyond Runner game ...Check This Out!!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ny3dkx/gamestops_nft_lead_designer_spike_waaaayyyyyy/"
}