{
    "author": "Wraith2098",
    "created_utc": 1627409277.0,
    "distinguished": null,
    "edited": 1627411277.0,
    "id": "osrzza",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_osrzza",
    "num_comments": 59,
    "permalink": "/r/GMEJungle/comments/osrzza/steve_stevie_cohen_the_king_of_wall_street/",
    "score": 833,
    "selftext": "I am disappointed in the lack of Stevie posts! This man is the ultimate criminal of Wall Street and he should be exposed accordingly! I may be retarded, but I'll do my best to break down something I found while searching the interwebs. Again, I am retarded, so please forgive me for this jumbled mess I am about to post with little context given. All I know is Stevie is corrupt and his past should be posted for all to see!  \n\n\nEDIT - Since I didn't include a TL;DR I'll go ahead and attach this elegantly put summary from Stonk\\_Ape!  \n**TLDR: Steve Cohen is a psychopath and a criminal who won't stop raping the world and stealing from all of us until someone puts him permanently out of business and in prison.**\n\nI found a nice little read on this man's past specifically with his SAC HF. All of this ended coincidentally in 2008, yes the year when the markets crashed. Old Stevie was accused of insider trading at a massive scale and his way out was to pay 1.8 billion dollars (he had 10 billion in personal funds at the time) to the government in order to avoid trial/discovery.\n\n[Me accused of insider trading? Guess I'll pay a small fee and keep doing it! ](https://preview.redd.it/00fbg9jymsd71.jpg?width=1478&format=pjpg&auto=webp&s=188e1683f7921db2933227e70adca9d44c7e037c)\n\nFrom the article: \"Then, in the second week of September, Cohen’s lawyers got a call from Anjan Sahni, the co-chief of the securities unit at the U.S. Attorney’s Office. Sahni and his colleagues wanted to talk about settling the case against SAC. Not much had happened during the month of August, after the indictment. The prosecutors noticed, though, that business at SAC had gone on as if nothing unusual had occurred. There were no visible crises in the market, no layoffs or margin calls. Wall Street had absorbed criminal charges against one of the largest hedge funds in the world with barely any disruption. Settling the case was the only resolution that made sense; a trial was a risky proposition for both sides. For the government, losing the SAC case would have led to humiliation, a heavy blow to morale at the office. Mathew Martoma’s trial was approaching, and the FBI still hoped that he would decide to cooperate, in which case prosecutors would need all of their resources to develop that case.\"\n\nYou read that correctly. The U.S. Attorney's Office was afraid of being humiliated by the idea of losing a case and Stevie was petrified at the idea of going into a trial and unveiling his insider trading secrets. So what to do then? Well pay 1.8 billion dollars and still have roughly 8.2 billion left over to start a \"family based\" hedge fund where the law was exempt from preventing Stevie from trading.\n\n\" For Cohen, the calculation was similar. The idea that he would submit himself and his employees to months of discovery and take the stand to answer questions under oath about his trading activities if he didn’t have to was laughable. He was a trader without nerves, but a long, drawn-out court battle that threatened to expose all his secrets was one risk he did not have the stomach for. Plus, if he ended up being charged himself, he needed to reserve all his legal firepower to defend himself. In the end, after all the calculations, the case against SAC Capital came down to a question of how big a check Cohen would have to write in order for it to be over. \"\n\nSo with his tail between his legs, old Stevie settled.\" SAC had agreed to plead guilty and pay $1.8 billion—the company managed to negotiate credit for the $616 million it had already committed to pay the SEC, so in reality the new fine was $1.2 billion. The settlement would also include a guilty plea by SAC, an admission, in court, that the firm had done everything the government was accusing it of. \"\n\nSo lets take a look at the last line there. A guilty plea admitting to everything the government was accusing Stevie and his firm of doing. What was their admission you ask?\" “The tiny fraction of wrongdoers does not represent the 3,000 honest men and women who have worked at the firm during the past 21 years,” SAC’s public relations handler said in a statement. The last line read: “SAC has never encouraged, promoted or tolerated insider trading.” \"\n\nThis was an admission of guilt?? I don't think so Stevie.\" Bharara couldn’t believe it when he read it. **SAC had just signed a guilty plea admitting that it had, in fact, been built on a culture of insider trading.** **Cohen had admitted as part of the agreement that his company had fostered a culture of securities fraud for over a decade.** The chief of Bharara’s securities unit called Cohen’s lawyers and ordered them to retract the statement, which they did. Then they released a new one that stated: “We greatly regret this conduct occurred.” \"\n\nThe crook that Stevie is, tried everything in his power to make himself out to be the victim and failed miserably. He didn't even have to show up to trial, just pay the fee (roughly 10.8% of his 10 billion) and simply continue trading.\n\nHere is a brief summary of the verdict: \"  Cohen didn’t have to show up in court himself. He would be paying the $1.8 billion out of his own funds, but he was barely going to notice that the money was gone. The judge, Laura Taylor Swain, placed a stainless steel coffee cup on the desk in front of her and peered down at the herd of lawyers assembled below. The room fell silent.“Do you understand the charges that SAC Capital is pleading guilty to?” the judge asked. “Yes.” “Are you under the influence of any drugs or alcohol?” “I’ve taken some antibiotics for my condition,” he said. “Do you want me to read the indictment out loud?” Swain asked, holding up a forty-page document. “No thank you, your honor,” Nussbaum said. Laughter rippled through the gallery. In an instant, Swain had brought out just how odd the whole ceremony was, a burial without a body. Nussbaum knew the charges by heart. **His employer of thirteen years was about to admit that it had been run like a criminal empire for more than a decade, amassing hundreds of millions of dollars in illegal profit and making its founder one of the richest men on earth.**“We have paid and are paying a very steep price,” Nussbaum continued. “We are chastened by this experience, but we are determined to learn from it and emerge from this as a better firm.” The judge stared at Nussbaum. A few droplets of sweat had appeared on his forehead. “How does SAC Capital plead?” she asked. Nussbaum pulled himself halfway out of his chair. “Guilty,” he said. “Are the defendants pleading guilty because they are guilty?” the judge said. “Yes, your honor.” With a tap of her gavel, Judge Swain said, “We are adjourned.” \"\n\nIn summary, Steve \"Stevie\" Cohen has an ugly history of criminalizing the markets and getting away with nothing more than a slap on the wrist. You better believe he is pulling every kind of insider trading moves as we speak. Instead of being banned from Wall Street, Stevie just pays a traffic ticket and keeps on trading.\n\nThe article I'm referring to is titled \"**Black Edge**\" and is jammed full of content. I would encourage more people to read it as there are 250+ pages of content. I only went over Justice/Judgment section. I would encourage more people reading this to start more threads based on anything else they find worth posting! Bring Steve \"Stevie\" Cohen's dirty past into the light!\n\nLink to the Black Edge document:[https://weblogibc-co.com/wp-content/uploads/2018/05/Black\\_Edge\\_Inside\\_Information\\_Dirty.pdf](https://weblogibc-co.com/wp-content/uploads/2018/05/Black_Edge_Inside_Information_Dirty.pdf)\n\n&#x200B;",
    "title": "Steve \"Stevie\" Cohen, The King of Wall Street Insider Trading",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/osrzza/steve_stevie_cohen_the_king_of_wall_street/"
}