{
    "author": "stormshawty",
    "created_utc": 1617014036.0,
    "distinguished": null,
    "edited": 1626562590.0,
    "id": "mfmlfd",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mfmlfd",
    "num_comments": 400,
    "permalink": "/r/GME/comments/mfmlfd/115_billion_correlation_ftd_coverage_speculation/",
    "score": 5716,
    "selftext": "[7/14-7/16](https://i.imgur.com/u63ZqPN.png)\n\n&#x200B;\n\n# 182\n\n&#x200B;\n\n(•_•)\n\n&#x200B;\n\n( •_•)>⌐■-■\n\n&#x200B;\n\n(⌐■_■)\n\n&#x200B;\n\n[Enough](https://www.youtube.com/watch?v=ubLRB7tb78Q)\n\n# ~~This thread is still being heavily modified and will continue to be updated throughout market hours.~~\n\n# Final update : 4:00 PM EST\n\n# For safety and privacy, we're going to use **DU** in reference of our deleted \"helper\", for those of you know who I'm talking about, stop spreading his username, thank you.\n\n&#x200B;\n\n# To those who have been threatened recently report everything to mods & LEO\n\n&#x200B;\n\nFrom DU : \n\nhttps://i.imgur.com/piVCLtL.png\n\n&#x200B;\n\n# Updates \n\n>**4:00 PM EST**\n> \n> Close : **181.30**\n>\n> Again we said it last week, \n>\n> Trigger points (speculation) **180-220**, breakout & **pressure is necessary**.\n>\n> [Tomorrow is another day of fighting, break the trigger, receive the breakout.](https://old.reddit.com/r/Wallstreetbetsnew/comments/me1p0i/video_explanation_summary_of_the_epic_battle_that/)\n>\n> Hey look another glitch : https://imgur.com/a/5Dl4baw\n>\n> This will be the final thread.\n\n&#x200B;\n\n>**3:40 PM EST**\n>\n> AS PREDICTED LAST WEEK WHEN WE WERE AT 115, WE WILL FIGHT FOR 182. GOOD LUCK.\n\n&#x200B;\n\n>**2:57 PM EST**\n>\n> [Anomaly today](https://old.reddit.com/r/GME/comments/mfucdc/i_found_a_yahoo_reporting_glitch_2_spikes_at_over/)\n\n&#x200B;\n\n>**12:30 PM EST**\n>\n> Still fighting 180 as stated previously,\n> \n> No new information, post was edited to clear up the recent influx of threats.\n\n&#x200B;\n\n>**12:00 PM EST**\n>\n> Hovering at 180-182, I must be going insane, clearly these numbers couldn't possibly be related right...?\n\n&#x200B;\n\n>**10:49 AM EST**\n>\n> [This is hilarious.](https://i.imgur.com/ymXXLwI.png) \n>\n> https://imgur.com/a/DhPJosy\n>\n> https://youtu.be/LPz7LCybSNk?t=56\n\n&#x200B;\n\n>**10:35 AM EST**\n>\n> [Reloaded](https://i.imgur.com/JY6gwJA.png) \n> 😳... not\n\n&#x200B;\n\n>**10:25 AM EST**\n>\n> [Huh?](https://i.imgur.com/V8TFqGa.png) \n>\n> [Also I heard Vanguard is having issues, anyone confirm?](https://youtu.be/cAgHK47Y1-o?t=30)\n>\n>😂😂😂😂\n\n&#x200B;\n\n>**9:58 AM EST**\n>\n> [Very cute, fake as always.](https://imgur.com/a/jt9qi1D) \n\n&#x200B;\n\n>**9:39 AM EST**\n>\n>Waiting for the ETF shorting spree to begin.\n\n\n&#x200B;\n\n# Disclaimer\n\nNo advice, we could be wrong, read it, believe it, or don't.\n\n*If you do not have expectations, you can never be disappointed.*\n\n&#x200B;\n\nWe posted this information for you guys to put the pieces together, don't bet your life savings on our **predictions** which are labeled as **speculations** because anything can change at [anytime, never underestimate your enemy.](https://i.imgur.com/j0xQHtK.png).\n\n&#x200B;\n\nAs we stated before,\n\n> The intention of this post is to get a better explanation than the one provided and to bring this information out to the **general public**.\n\n&#x200B;\n\nAnd you did just that,\n\n[Credits : /u/jsmar18](https://old.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/)\n\n&#x200B;\n\n*Note : We're going to take some references from this thread,* **we don't agree with it fully**, *I'll tell you why below.*\n\n&#x200B;\n\n# Refresher for those of you who are just going down this rabbit hole\n\n&#x200B;\n\n[My original post on March 25, claiming the anomalies are not bugs](https://old.reddit.com/r/GME/comments/mcnokn/reposting_for_more_exposure_94m_635m_113m_buy/)\n\n&#x200B;\n\n[Follow up thread](https://old.reddit.com/r/GME/comments/mcu6et/why_the_115_billion_buy_order_was_not_a_bug_do/) \n\n&#x200B;\n\nCredits : /u/jsmar18 \n\n[Thread explaining hidden orders](https://old.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/)\n\n&#x200B;\n\n*These numbers are not 100% accurate, could be off by 1-2 million, still within range, still insanely high.*\n\nDate | Buy volume-anomalies | Price\n----|----------|-----\n2/18 | 9-,---,--- | 90~\n2/22 | 94,189,110 | 46.12\n3/23 | 630,776,404 - 634,322,033 | 181.75 - 182.02\n3/24 | 113,540,261 | 120.34\n3/25 | 290,041,143 | 183.75\n3/26 | 167,489,023 | **181.00**\n\n&#x200B;\n\n# Bug theory\n\nThis is out the window and the cat is out of the bag, there is a LOT of technical analysis behind this, along with multiple software engineers both verified and non verified in various fields to have confirm this would be **EXTREMELY** improbable.\n\n&#x200B;\n\n# What we \"believe\" to be occurring\n\n&#x200B;\n\n**These anomalies are NOT bugs, we believe that this is HF's way of loop-holing FTD coverage, exposing their true short exposure.**\n\n&#x200B;\n\nhttps://i.imgur.com/xYEd5MT.png\n\n&#x200B;\n\nBased on the previously defined cycle, there is an approximate timing of 15-20 days a share can “float”, as first borrowed and then as an FTD, before needing to be resolved via a replacement share (ie. **counterfeit** or actual)\n\n&#x200B;\n\n> It is not possible to carry out this massive fraud without the cooperation of large Wall Street firms and regulatory complicity, indifference or lack of competence. **Some firms are blatantly selling shares that do not exist**.\n\n&#x200B;\n\n> It is impossible to ward off the downward price pressure from counterfeit shares diluting a company‘s value. The entire nation‘s value is diminished when the **counterfeiting of securities is rampant**.\n\n&#x200B;\n\n> The counterfeiting of U.S. traded securities is nothing less than a fraud of epic proportions.\n\n[Source : The Counterfeiting of Shares of Fannie Mae and Freddie Mac](https://www.sec.gov/comments/s7-08-09/s70809-407a.pdf)\n\n&#x200B;\n\nSince **naked shorting** is no longer considered speculation seeing as **GameStop themselves acknowledged the SI being above 100%** (can't be \"really\" done without **NS**),\nalong with **ETF's slowly becoming an irrelevant tactic**, HF's will FTD on their short positions **which results in FTDs on their hands that they have to declare\nwhich I presume is the number we're seeing in TDA TOS**.\n\n&#x200B;\n\nThese orders are so big ($115B) they are done in blocks with trigger points or buy limits, 120.34 being one. As it rises so does the trigger point, it moves up 120.34 then 122 etc. Moving up as the price moves up so the blocks are getting bought (although be it with naked shares as we are not selling atm). We need to hit the trigger points and keep hitting them and the algorithm will not be able to wash the shorts through the OTC/DP to replenish the amount they have to use which is why we see them starting with 300k sometimes, **depleting them slowly, as the buying pressure dies down they gain the shorts back**.\n\n&#x200B;\n\n*Once again, as stated before, we believe that retail does not posses the buying pressure that we are seeing.*\n\n&#x200B;\n\n# Post the order, loophole the FTD, recover shorts to continue attacking the price, repeat.\n\n&#x200B;\n\n**You can't continue doing this forever**, the SI will just continue increasing because **nothing is actually being covered**, they never had the shares to begin with, **the entire pool is synthetic**.\nIf the price point were to get triggered, if the buying pressure was too intense for the algorithm to keep up, they would not be able to wash their short's fast enough to replenish the amount of short shares available for the HFT to tank the price and **the price would be on a rapid increase, a reverse snowball will happen**.\n\n&#x200B;\n\nThat would explain such quick price rise into the 130s. It would likely be more around 135ish now as the trigger price would have risen. This combined with the one around 182 if we could link these buy points together **this would trigger a sharp price rise quickly or at the very least allow the price to rise in a more free fall type manner as suggested in the previous thread**.\n\n&#x200B;\n\nWith that being said, due to the attacks we saw on **Thursday and Friday** to **keep the price down**, the trigger point has most likely moved into the **200-220 range**, before you go on a rant about how we're constantly moving the trigger point back each time GME doesn't moon at said trigger point, get realistic please, this is GME we're dealing with here, a **completely fraudulent system** as you all should know by now.\n\n&#x200B;\n\nAs stated before : \n\n> The trigger price is around the 182~ but needs to stay **ABOVE**, simply **hitting the price target and dropping back down seconds** later is **not enough** to start the reverse snowball.\n\n&#x200B;\n\nWhy else would you post such a huge wall on open? *Unless*...\n\nhttps://i.imgur.com/9Z3GyJz.png\n\n&#x200B;\n\nFrom DU :\n> \n> HFT could just naked short the living shit out of it, when the price gets to close to the point of them not being able to control the price anymore and drive it way into the ground, anything is in the realm of possibility at this point.\n\n&#x200B;\n\n# TDA Power outage\n\n[Where have I heard this before? Haha.](https://youtu.be/F3goSYkVPNE?t=80)\n\nDon't assume we harassed the shit out of every intern at TDA over the weekend, because we fucking did.\n\n&#x200B;\n\nWe used over 30 people, 30 different phone numbers, called at different times so they wouldn't assume it was one person calling over and over for some crazy response.\n\n&#x200B;\n\nExcept that's what they gave us.\n\n&#x200B;\n\nFor the most part, they would put us on hold and hangup,\n\n&#x200B;\n\nWe gave TDA a call to ask them about how the volume column works, **a representative from Trader 1 confirmed that this is not a bug and indeed a true number**, however he instantly transferred me to a supervisor who \"should be able to answer all of my questions\"\n\n&#x200B;\n\nWe spoke with the supervisor, conveniently 30 seconds into the phone call after mentioning said anomaly **he told us the power to the entire office went out**, you basically know what happened next.\n\n&#x200B;\n\nWe are going to bury TDA, it doesn't matter what they tell us anymore, we're done talking to them.\n\n&#x200B;\n\n# \"Speculation\"\n\nThis is where our favorite word comes into play, the theory will be tested if we see a proper breakout to initiate the **trigger into a spiral**, along with our **beta of** ~~-36~~ **-7~-26**.\n\n&#x200B;\n\nIf you still think this is a bug, I would highly suggest reading into this more before telling all your friends.\n\n&#x200B;\n\n#Goldman 10.5B liquidation\n\nGoldman liquidating is considered an **[act of war.](https://twitter.com/TheRoaringKitty/status/1376293019842879488)**\n\nhttps://i.imgur.com/fpmLItu.jpg\n\nFrom DU : \n> Today will be a day of reckoning, I feel for the stock and It's price and fluctuations.\n\n&#x200B;\n\n> We saw large block trades happen on Friday and over the weekend as HF were forced to liquidate assets. \n\n&#x200B;\n\n> This could mean one of two things could be in store for us, this of which we won't know till we see some real movement in the price and different pressures.\n\n&#x200B;\n\n> A) It could be a freeing up of assets to have the collateral to **short GME and other already shorted stocks even more.** (as Melvin capital would say \"When you're already fucked why not just double down one more time.) \n\n> Goldman Sachs has **5,900~ puts against GME** so freeing up assets to attack the price could be **real and allow them to recover some of their lost capital and continue the fight**. \n> While at the same time they would be helping themselves, they would also be helping other HF's who have already shorted the stock to oblivion and keep doing so in the hopes that retail will shake and trigger a sell off.\n\n&#x200B;\n\n> B) Could be actually getting the margin call on them and having to add into the already high buying pressure that is pinned against artificial selling pressure. **Eventually the buying pressure should begin to over take the selling pressure allowing a reverse snowball effect to happen where the price would just tumble out of control.** (think back to the robin hood putting a stop to buying how if they would not have done that the price would of gone into the **10s of thousands**, we'll never know.)\n\n&#x200B;\n\n> Pre-market is actually being quite interesting, this is something I have not seen before, the quick jump up is giving me the idea that there is a lot of buying pressure coming up with not very much selling pressure holding it down, or the selling pressure is having to reset every so often.\n\n&#x200B;\n\n> (I'm assuming this is the short share wash happening needing to replenish the stack under pressure allowing a nice price jump to occur.)\n\n&#x200B;\n\n> If we see this nice kind of consolidation throughout all of pre-market and close to the start of open this would be a good sign for whats in store, as **holding the price down through artificial selling pressure is finally coming to an end**.\n\n&#x200B;\n\n> Seeing a nice consolidation going into the end of pre market would allow for the stock price to get a nice drive down (AKA short attack) at the start of open which has been seen as a common thing everyday.) \n> This is one of the biggest things HFT does to help the price hit a jumping point.\n\n&#x200B;\n\n> If all of retail were to hold through the artificial sell off, VWAP would come straight across.\n\n&#x200B;\n\n> If the buying pressure during and after the sell off was high enough** it would launch the price up and over the point of HFT being able to control it**. \n\n&#x200B;\n\n> The price would actually be pulled upwards to the VWAP line giving it added pressure to shoot out the other end, think of this like a **bungee cord**. \n\n&#x200B;\n\n> The HFT **can only artificially tank the price so far before it has to shoot back**, with this theory, **assuming the buying pressure was extremely high throughout this time**, it would send the price moving the other way,** snapping the cable that is tethering it** to the VWAP line.\n\n&#x200B;\n\n>  **I truly believe that the price almost let go on Friday** but during that morning sell off, retail sold their shares and tanked the VWAP, after this the fight was lost. **It was more about consolidating the price, holding the numbers, causing max pain rather than launching the rocket ship**.\n\n&#x200B;\n\n>  My one key thing I can tell you is the **opening sell off is fake and to hold for dear life when it happens**. The bounce with added VWAP pulling **could launch us into the stratosphere, even beyond.**\n\n&#x200B;\n\nhttps://i.imgur.com/96wwhez.png\n\n&#x200B;\n\n**Updates from our deleted friend will be edited into the thread throughout market hours.**\n\n&#x200B;\n\n# TLDR;\n\n&#x200B;\n\n**HODL. NO EXIT STRATEGY. SELL LIMITS ARE BAD. OPTIONS BAD. BUT DO WHAT YOU WANT!**\n\n**NONE OF THIS IS INVESTMENT ADVICE**\n\n&#x200B;\n\nTheory is that these anomalies directly correlate with HF's posting FTD coverage, ~~-36~~ -7~26 delta + gamma squeeze = [tsar bomba](https://www.youtube.com/watch?v=BBNhYOmEgy0)\n\n&#x200B;\n\nTrigger points (speculation) **180-220**, breakout & pressure is **necessary**.\n\n&#x200B;\n\nWe do not know if another thread will be posted after this, things are getting a bit *dangerous* :)\n\n&#x200B;\n\n[WE ARE ALWAYS READY FOR WAR MR KEN.](https://youtu.be/wlVdPl-oEmg)\n\n&#x200B;\n\nAs always, enjoy the read, \n\n&#x200B;\n\nwe thank you for your **time**.\n\n&#x200B;\n\n> P.S, Think we're wrong? Great! Make a post about it and provide evidence to disprove everything we've uncovered this past week, otherwise, **sit back, relax** and **enjoy the show** as always. 🥳\n>\n>**Got it?** Good.\n>\n> Have a great fucking **Monday everyone**.\n>\n> Peace out.\n\n&#x200B;\n\nhttps://www.youtube.com/watch?v=LyYBrywHmvg\n\n&#x200B;\n\n[WHALE WATCH SEASON](https://youtu.be/pWh4O6ujK4o?t=75)",
    "title": "$115 BILLION CORRELATION + FTD COVERAGE SPECULATION THREAD, ENDGAME.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mfmlfd/115_billion_correlation_ftd_coverage_speculation/"
}