{
    "author": "3for100Specials",
    "created_utc": 1617004266.0,
    "distinguished": null,
    "edited": 1617252204.0,
    "id": "mfke2t",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_mfke2t",
    "num_comments": 80,
    "permalink": "/r/GME/comments/mfke2t/double_dd_analysis_massive_volume_glitches_their/",
    "score": 958,
    "selftext": "This Isn'T FinAnCiaL AdVicE. Not like you guys can read anyways. 🦧💎👐🚀🌙\n\nI’m going to need you guys to remain **hyper-raTarded** through this post to make sense of it bc shit is about to hit a lot of fans in the coming week(s). This post pertains to two critical pieces of info I've seen circulating quite a bit now. I filtered a lot of information from both to pull this stuff out of my ass so bear with me\\*\\*.\\*\\*\n\nI’m going to refer to two separate posts further below that I’ve seen circulating quite a bit now. Though it seems there are some conflicting points of interest being noted by the second post (as it answers some ambiguous questions relative to the first), when blended together accordingly, I believe there is a solid insight to be pulled from both of them.\n\n1. [**https://www.reddit.com/r/GME/comments/mewkf8/thesis\\_si\\_is\\_upwards\\_of\\_2000\\_gme\\_is\\_a\\_100/**](https://www.reddit.com/r/GME/comments/mewkf8/thesis_si_is_upwards_of_2000_gme_is_a_100/) Posted by u/Unowned-Instruction. (posted first)\n2. [**https://www.reddit.com/r/GME/comments/mf1f6n/i\\_was\\_missing\\_a\\_key\\_piece\\_of\\_the\\_puzzel\\_this\\_is/**](https://www.reddit.com/r/GME/comments/mf1f6n/i_was_missing_a_key_piece_of_the_puzzel_this_is/) Posted by u/jsmar18. (posted second)\n\nI will refer to these as posts 1 and 2 for simplicity's sake here.\n\nStart here u apes -----------------------\n\n**Massive volume “glitches”, their connection to FTDs, and lastly why DTCC is the end result of a failed DBZ fusion dance between Sauron and Sidious.**\n\n[Notice the extra-chromosomey characteristics..yet they're the true puller of strings \\(we'll get to these dingles shortly\\)](https://preview.redd.it/2jv5l6t1khq61.png?width=200&format=png&auto=webp&s=ee61f4a24f88b0ca82e31f2415b5cffe295f0885)\n\n**What are the glitches?**\n\n* In case these glitches have passed right over some of those smooth brains, there have been multiple verifications of massive volumes appearing on many trading platforms as of recently (**94m, 630m, 113m, 290m, 167m).**\n\nExample:\n\n&#x200B;\n\n[ww.reddit.com\\/r\\/GME\\/comments\\/mf1f6n\\/i\\_was\\_missing\\_a\\_key\\_piece\\_of\\_the\\_puzzel\\_this\\_is\\/](https://preview.redd.it/lv9abfh5khq61.png?width=512&format=png&auto=webp&s=880216e77c3e4ed201376c85ab0ef959e7114594)\n\nAt first, these seemed to be random and perceived to be bugs but as more and more continue to show up, it has become evident that they are not, in fact, bugs at all.\n\n* This is where the two posts I mentioned earlier come into play, **and their conflict of interest as well.**\n\nAs these are respectively very detailed and long posts, I want to get this discrepancy out of the way first. The discrepancy is that the first post links these massive volume “glitches” in a way that shows that **SI is** **>2000%.** This number is calculated based on an additive value of the massive volumes seen as of late. See math below:\n\n[ Source: https:\\/\\/www.reddit.com\\/r\\/GME\\/comments\\/mewkf8\\/thesis\\_si\\_is\\_upwards\\_of\\_2000\\_gme\\_is\\_a\\_100\\/](https://preview.redd.it/ns4u5pn8khq61.png?width=771&format=png&auto=webp&s=80dd870f7dc69a8781a4a33b5a9cac5a467d866a)\n\n**The discrepancy between this reasoning and the second post below:**\n\n&#x200B;\n\n[https:\\/\\/www.reddit.com\\/r\\/GME\\/comments\\/mf1f6n\\/i\\_was\\_missing\\_a\\_key\\_piece\\_of\\_the\\_puzzel\\_this\\_is\\/](https://preview.redd.it/8pgnhcadkhq61.png?width=512&format=png&auto=webp&s=e55156e4baa3897415cef0fa4864cdb78e83d203)\n\nAfter thoroughly reviewing both posts, I believe **it is quite evident that using the additive values of the massive volume bugs to determine SI is an improbable take at what they truly imply.**\n\n1. Though I was hyped to find out that SI could be >2000%, I was a bit confused as to how we could determine this as the massive volume provides no insight into whether it is related to buys or sells. Further, upon digging into the DD referenced (as seen in the top image) by the first post that shows that SI could be even >2600%, I found myself still pondering the same question but also how these values could be **additive?**\n2. **This is my biggest concern with this SI number as it seems far more likely that these massive volumes are relative to the formula fluctuations that take place on that day, or period of days.** The post’s sentiment seems very much ape in point, but the only way this could really make sense is if we **assume that each of these volumes is a buy order**. The math here is where I believe both OP of post 1 and his reference go amiss. Reference's post: [https://www.reddit.com/r/GME/comments/me2dm1/true\\_value\\_of\\_a\\_gme\\_share\\_is\\_722783/](https://www.reddit.com/r/GME/comments/me2dm1/true_value_of_a_gme_share_is_722783/)\n\nIt is only after going through the second post that I think we have finally been able to make real sense of the appearance of these massive volumes. To do this, I’ve provided some portions of the second post I found the most important. That being said, **I HIGHLY encourage anyone reading this to review this post thoroughly as there is a LOT going on in it and it will make far more sense if you understand the terms referred to.**\n\n**Smooth Brain Instructions -** **Begin by reading OP2's description right below the chart, assess his Strategy Breakdown, then visualize the steps accordingly as you visualize the graph\\*\\***\n\n[https:\\/\\/preview.redd.it\\/6n0h8ueutzp61.png?width=512&format=png&auto=webp&s=d3d65fc35389b7aa3a2e95428940d6e77005fa75](https://preview.redd.it/4ww9iojjkhq61.png?width=512&format=png&auto=webp&s=55df4ea4b3f1d1b4a32a452fe71b44b6962b1910)\n\n[https:\\/\\/preview.redd.it\\/oh0valmwtzp61.png?width=684&format=png&auto=webp&s=7aa711aa2cde53c6bc5015d258764685ef8c2b1e](https://preview.redd.it/bpb5r56ymhq61.png?width=684&format=png&auto=webp&s=a9bd275c5cf14f3e8519992357ec9dacaa1a96e8)\n\nI’ll reiterate this again before providing some basic insight as to what’s going on, **read through his post yourself to help make more sense of it. This shit is some complex wrinkle-brained analysis and mine is still as smooth as your wife’s boyfriend’s pipe-laying skills.**\n\n**Ape translation of OP2's charting:**\n\n* In short, post 2 is essentially stating that the short-dicks are using **a variety of order types (as seen in the second image) to manipulate the price of GME on the days we see the massive volumes appear (purple squares) by essentially routing orders to THEMSELVES. --- This makes a lot of sense when you begin to wonder how their short ladders function to not only drop the price but ALSO allow them to grab synthetic shares via High-Frequency Trade (HFTs) orders that they ALSO placed as the price drops.**\n* Keep in mind that these **“Wash Sales”** are possible as Citadel consists of multiple legs\\*\\*. One of which acts as its HF, and the other entity which acts as its Market Maker, Citadel Securities.\\*\\*\n* To make more sense of this, here’s the definition of Wash sales via Investopedia - “*A* ***wash sale*** *occurs when an investor sells or trades a security at a loss, and within 30 days before or after, buys another one that is substantially similar. It also happens if the individual sells the security at a loss, and their spouse or a company they control buys substantially similar security within 30 days.”* [*https://www.investopedia.com/terms/w/washsalerule.asp#:\\~:text=A%20wash%20sale%20occurs%20when,similar%20security%20within%2030%20days*](https://www.investopedia.com/terms/w/washsalerule.asp#:~:text=A%20wash%20sale%20occurs%20when,similar%20security%20within%2030%20days)*.*\n* As for the **reasoning behind this?** Here’s the following portion of **OP2’s DD**:\n\n[https:\\/\\/preview.redd.it\\/hkh4f1uztzp61.png?width=512&format=png&auto=webp&s=2bca0f6bdfe64fba236b463f217e49815291ab8c](https://preview.redd.it/6cd7253fmhq61.png?width=512&format=png&auto=webp&s=673762e4214b1126a4485364a4d6e0e18c0a4e85)\n\nI am simplifying the concepts that probably should not be simplified here, so if the above sounds like a full-autismo kid wrote it, you’re probably right and should **read post 2.** I will now tie it back to **post 1.**\n\nRemember how I said that if meshed together *accordingly*, **both posts functioned well in providing insight on what is truly happening behind the curtains?** Well, it’s at this point that I have to refer back to the **OP1's DD** to help make even more sense of this.\n\nWhen brought together, their posts form the **proper fusion:**\n\n[\\(yeah. I'm GT Gogeta biased @ me\\)](https://preview.redd.it/kvhhlmpxphq61.jpg?width=500&format=pjpg&auto=webp&s=b05209ce8f2cd902df499cab1b40aecf83507056)\n\nOn with the **juice** then,\n\nThough his SI data is a bit of a stretch, I **do believe that OP1 made some solid points in the remainder of his analysis. One of which helps clarify this process even more so when properly integrated into the data provided by OP2.** See below:\n\n[ Source: https:\\/\\/www.reddit.com\\/r\\/GME\\/comments\\/mewkf8\\/thesis\\_si\\_is\\_upwards\\_of\\_2000\\_gme\\_is\\_a\\_100\\/](https://preview.redd.it/n1owzd7jlhq61.png?width=775&format=png&auto=webp&s=0c6042f66a6c9b2b45a288b0c0e5d87de7d594b6)\n\nTo extrapolate on this illustration, I’ll just leave it to OP1 as he makes far more sense of this.\n\n&#x200B;\n\n[https:\\/\\/preview.redd.it\\/2fme96c6uzp61.png?width=735&format=png&auto=webp&s=c86825a18691d45653b7b54e4913026e5ab0cc50](https://preview.redd.it/i2fpt9rslhq61.png?width=735&format=png&auto=webp&s=1a87d725c67843a15d2e1862654f934e7583153f)\n\nTaking this information into account with OP2’s explanation, these ***wash sales*** **become much clearer in their execution (OP1) and function (OP2).** But in case this doesn’t fully convince you that this is what the collective short-dicks at Citadel are up to, here’s some evidence of their fuckery in the past,\n\n&#x200B;\n\n[ Source: https:\\/\\/www.reddit.com\\/r\\/GME\\/comments\\/mcn6gc\\/this\\_isnt\\_the\\_first\\_time\\_citadel\\_has\\_been\\_caught\\/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://preview.redd.it/g4barwvvlhq61.png?width=249&format=png&auto=webp&s=ff18b1ac52efef47c84268b5dd7a364105b8af7e)\n\n**Sound oddly familiar? Maybe you know of some other stocks dealing with similar fuckery?**\n\nPiecing all of this together requires us to draw in a few more wrinkles before concluding this DD. I mean, there is one piece left of this puzzle that I mentioned earlier, remember the fusion of Sidious and Sauron? **It’s their time to shine. D**ti**T**y**C**ity.\n\nThe last bit here pulls together some points from **OP1 and OP2 once more.** Through his post, **OP2 provides us WHY short are utilizing these wash sales we described above that cause borrowed shares to disappear off of iBorrow - that being to cover FTDs, BUT it is via OP1’s post that I believe we have the answer as to why the borrowing fee remains unchanged even as available shares to borrow decreases.** OP1's post:\n\n&#x200B;\n\n[https:\\/\\/preview.redd.it\\/vivrn1eauzp61.png?width=758&format=png&auto=webp&s=89ef1658be73e7078697788923f6689e8660fd44](https://preview.redd.it/yu0dr3bzlhq61.png?width=758&format=png&auto=webp&s=af2888268bcab62ba322fae70162a596c61f0d04)\n\nIt is *this* portion of OP1’s DD which I found quite fascinating. Keep in mind that it is primarily an assumption but when you really begin to look into his explanation and what we’re seeing happen with these progressive margin calls occurring...**it doesn’t seem that far-fetched, does it?**\n\nAccording to OP1, this tactic was likely employed by the DTCC upon discovering how fukt the short positions were/have been. \\*\\*“\\*\\****While DTCC would not literally be the institution making moves on the market, they are dictating what short side institutions do. This idea has arisen largely from the sudden change in various tactics we are seeing, which I will cover now in no particular order.”*** *-* OP1.\n\nIt is by piecing both of these DD’s together that I think a lot more sense can be made from this shitstorm. As I have stated in my previous posts, the **better we understand how the short fuckery functions, the better prepared we are to remain diamond-handed the next time we see it. This was simply my take at two, solid perspectives provided by other apes out there so if you see some holes in my culmination of the two posts, please feel free to mention them below.**\n\nIf you do, just keep in mind there is a **-11 beta value chance that I won't be able to read wtf you wrote.** I’m not even sure I can read half the shit I just wrote.\n\nTruthfully, **I just like the stock. 🔥🚀🚀💎✊🦍🤝🦍💎✊🌙**\n\n\\--------------------------------------------------------------------------\n\n**TLDR:TLDR**: hedge fukt^(2) bc we learned another one of their tricks.\n\n**TLDR:** **There are two posts that have received substantial upvotes in the range of 14-15k+ each over the last day. Though the more recent post provides a far better explanation of the massive volumes we have been seeing than the DD released before it ( it has SI >2000% in its title, many of you have probably seen it already),**\n\n**I think it's still really important to take into consideration many of the other points made in the first of the two DD posts,  as they can help explain the concept of Wash Sales and how they're connected to the Massive Volume \"glitches\" explained by the more recent post.**\n\n\\---------------------------------------------------------------------------\n\n**Oh and for the surprise for those of you who actually made it this far…**\n\nMy **Hooked on Phonics 1-month free trial subscription code**:  >!HedgeRfukt69420.0001!<  (be sure to mention me as a referral. They know me pretty well over there and might add on an additional 4 months and 20 days)\n\n&#x200B;",
    "title": "Double DD Analysis: Massive volume “glitches”, their connection to FTDs, and lastly why DTCC is the end result of a failed DBZ fusion dance between Sauron and Sidious",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mfke2t/double_dd_analysis_massive_volume_glitches_their/"
}