{
    "author": "Sh0w3n",
    "created_utc": 1620316512.0,
    "distinguished": null,
    "edited": false,
    "id": "n6aidd",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_n6aidd",
    "num_comments": 305,
    "permalink": "/r/Superstonk/comments/n6aidd/9_counterdds_to_various_topposts_to_sharpen_your/",
    "score": 2468,
    "selftext": "Let's dive right into it, I will keep it as brief as possible.\n\n*My intention is simple:* **I want you to think critically of everything posted on here to sharpen your mind so you can get jacked to the tits when it is appropriate.** \n\n**Apes are stronger together. I am not doing this to discredit anyone on here. I am really grateful for any DD posted, whether they are right or wrong. If anyone feels offended, please get back to me and I will try to clear it up. I am not saying that I have a better explanation, I am just pointing out flaws to make us think again and come up with something better.**\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/60o54tokrix61.jpg?width=640&format=pjpg&auto=webp&s=8b44b62aa61ef89a2914913bbba9205d3b0a40fd\n\n&#x200B;\n\n**Number 1: Negative 1m Volume Yesterday**\n\n\\-  [CITADEL, MARGIN CALL, 1M MISSING SHARES & THE TRADING HALT](https://www.reddit.com/r/Superstonk/comments/n5yl8r/citadel_margin_call_1m_missing_shares_the_trading/) \n\n\\- [OMFG it looks like all of Shitadel's volume was temporary deleted from the NYSE!!!🚀🚀🚀 This shit is unprecedented. 🚀🚀🚀](https://www.reddit.com/r/Superstonk/comments/n5vqnr/omfg_it_looks_like_all_of_shitadels_volume_was/)\n\n&#x200B;\n\nhttps://preview.redd.it/00udu5zaqix61.png?width=743&format=png&auto=webp&s=7080f3197d6d355f65125bc9a164f7a2494dbeb1\n\nWhile there is already some counter-DD provided up there, I would like to quote Dave Lauer ( u/dlauer ) here. I do not say that this counter-DD is completely false, though it is really upping the expectations of a few apes. It is speculation and should be taken with a big spoon of salt. \n\n*''I'm still trying to figure out what happened, I've asked our data vendor to look into it. Here's what we see on the data feeds from yesterday for GME:*\n\n*2,114,814 total shares:*\n\n*Pre-market: 38,688*  \n*RTH: 1,947,120*  \n*AH: 129,006*\n\n*Again, my theory would be that there was a large volume print that was a mistake, and which was later corrected with a correction message. If it was a retail system that had an issue, it could have affected a set of stocks that system was trading, which is why a bunch of \"meme\" stocks were impacted. Like I've said, this kind of thing actually happens with some regularity. Market data systems regularly have problems - you'll often see an errant price print or volume print that is later corrected. I'll follow-up once I hear from the data vendor.''*\n\n**This states that errors like these are not completely unnatural and happen. So without any assumptions, that is what the CTA stated here as well:** [**https://www.ctaplan.com/alerts#110000353886**](https://www.ctaplan.com/alerts#110000353886)\n\n\\----\n\n**Number 2:** [**DTCC and Citadel intimately connected to a firm called Price Waterhouse Coopers which profited 322M from Lehman's collapse.**](https://www.reddit.com/r/Superstonk/comments/n5yxpd/dtcc_and_citadel_intimately_connected_to_a_firm/)\n\n&#x200B;\n\n[Big Four](https://preview.redd.it/5mnjocw3qix61.jpg?width=991&format=pjpg&auto=webp&s=e3a5fd00d16000f1c462fef9eea4b3325cfedaf5)\n\nI am going to wrap this one up very quickly. If you are working for a major bank, hedge fund or market maker, you most likely worked for one of the big 4 audit firms before. It is literally the best thing to have on your CV. You are not connected to any other firm that has the same accountant as you either, are you?\n\n**PwC, Ernst & Young, Deloitte and KPMG combined make up over 60% of the yearly turnover of auditors. There is literally no firm in the financial sector that isn't audited by them** (check on the proxy statement who is doing it for GME).\n\n\\----\n\n**Number 3: Supressing Buy-Pressure through Dark Pools - Routing Buys through dark pools and sales through open market**\n\n&#x200B;\n\nhttps://preview.redd.it/cd4or3ygqix61.jpg?width=1280&format=pjpg&auto=webp&s=4604d50bc67309bf21c422650379fc9509824b4b\n\nHate to brake it to you. Dark pools are being used to manipulate, but they are not being used the way we thought. Even on Dark pool the price has to be within the NBBO. The DD on that is not right. Same with the suppression of the price.\n\nSince you are all visual and like to see/listen to stuff. Seriously watch the AMA with u/dlauer\n\n[**Link to the Video**](https://www.youtube.com/watch?v=AYct0XX0uTU)\n\nAbout Dark Pool NBBO -> from 54:30 onwards. It is about 5 minutes long.\n\n\\----\n\n**Number 4:** [**Citadel has just been margin called - Linear-Margin-Call-DD**](https://www.reddit.com/r/Superstonk/comments/n27l05/i_may_have_just_figured_out_the_margin_call/) **and** [**I don't to tout the horn without knowing anything, but, i think \"they\" got margin called today.**](https://www.reddit.com/r/Superstonk/comments/n5trot/i_dont_to_tout_the_horn_without_knowing_anything/)\n\nI strongly disagree with this DD since it is pure speculation to a degree that caused a major misconception among apes. Just check the daily thread and see hundreds of comments asking questions why citadel can still short when they have been margin called.\n\nI am a numbers guy and I like the approach the author of the DD has. But it is not that easy. The market is not that easy.\n\n&#x200B;\n\nhttps://preview.redd.it/z5vgggk5oix61.png?width=754&format=png&auto=webp&s=ec5b247ea86f487144ac4c0f8974dbf8ad162b3c\n\nSo why do I disagree with the DD and assumption made?\n\n1. We are basically having two points of data and from there on we make the assumption that a margin call threshold is linear (or close to it). You cannot make such a statement in a changing, intransparent and connected market. We do not even know whether the first two points are even close to being accurate - hell I am going so far that I strongly believe not even citadel knows at which price a margin call would exactly happen. Because the banks / financial institutions decide themselves. \n2. Every HF that is short on GME has its own threshold \n3. The author's assumption would only be anywhere close to accurate when from datapoint 1 and datapoint 2 NO player in the market has done anything at all. No trades, no movement of the stock for literally months. But stocks did move up and down. There were pump and dumps. Weird activity on the options chain. Unnatural price explosions on crypto. Raising capital done by hedge funds and institutions. And business as usual for those HFs as well by buying and selling assets. \n\nSo going by that, it is pure speculation. We do not know whether a threshold for a margin call has moved up, down or is spinning sideways. We do not know and will not know until it happens.\n\nOh while I am at it, let me slide over into the next misconception:\n\n\\----\n\n**Number 5: Margin call = Moon**\n\n&#x200B;\n\nhttps://preview.redd.it/wnd7a0emqix61.jpg?width=2063&format=pjpg&auto=webp&s=1b0d7103c0c81b7e027b98a4156ecf5441a70155\n\nNo. A margin call is nothing unusual. Almost anyone who has traded on margin has had one before. Because the margin call itself is not the issue. Problems arise when you can't satisfy it. But you have time to do so as a HF, and even more time as a MM. **So you will NOT know if citadel has been margin called until they fail to satisfy said call.**\n\n\\---\n\n**Number 6: O**[**MG!!! WTF? Did SHITADEL Register Something in the CAYMAN ISLAND 3MAY21**](https://www.reddit.com/r/Superstonk/comments/n4sbhz/omg_wtf_did_shitadel_register_something_in_the/)\n\n&#x200B;\n\nhttps://preview.redd.it/nvlg2eb3rix61.jpg?width=945&format=pjpg&auto=webp&s=66628e13d52cde117e16d3b45f7451076b9bd2a7\n\nSo, do you think this is something unusual? No. Name one bank, one large hedge fund or one financial institution that doesn't have a subsidiary, fund or bank account over there. Just one.\n\nTo make it short (pun intended): EVERYONE has connections to the cayman island. Unfortunately it is legal for those institutions.\n\nDo I like that? No.\n\nIs the timing weird? Maybe. but maybe not. Look at all these companies continuing with business as usual. New funds there, new SPACs here.\n\nUnfortunately, this is nothing special.\n\n\\---\n\n**Number 7: Negative beta go BRRRRR**\n\nI still see these comments daily. No picture for you here, I am sorry.\n\nTo make it short: The beta only reflects past performance and DOES NOT indicate future performance, especially on a highly manipulated stock.\n\n\\---\n\n**Number 8: -** [**Sell off from Bezos and other CEOs**](https://www.reddit.com/r/Superstonk/comments/n5sfq1/someone_knows_something_jeff_bezos_also/)\n\n&#x200B;\n\nhttps://preview.redd.it/g4ve8rd6tix61.jpg?width=2400&format=pjpg&auto=webp&s=29fc9f6ea30810b2f6b836118d43da8b3235bc42\n\n[This is from the post.](https://preview.redd.it/p0f131ocsix61.jpg?width=960&format=pjpg&auto=webp&s=34fec5573805e0bb9497849567384ef57402b481)\n\nAgain, when you see posts like these, always compare them to the past to see whether they are unnatural. Sorry to brake it to you, bit this is nothing special. Mr. Bezos sells stock regularly to fund other ventures (especially his space company). Same goes with other CEOs that sold that I checked, e.g. Zuckerberg.\n\n&#x200B;\n\n[Sorry.](https://preview.redd.it/owdkeqw2tix61.png?width=2766&format=png&auto=webp&s=3720b30ca5c62df127fa08f7b702e454d9cf0b4d)\n\n\\----\n\n**Number 9:** [**BofA's hedge fund clients are selling equities at the fastest rate since 2008**](https://www.reddit.com/r/Superstonk/comments/n617d8/bofas_hedge_fund_clients_are_selling_equities_at/)\n\n&#x200B;\n\nhttps://preview.redd.it/gvsu2h4ktix61.png?width=700&format=png&auto=webp&s=11a699720102677fc8e03fbca9c40dabfe05d463\n\nWhile in theory the sell off is huge and I agree that this has a reason, the numbers are not comparable. The market has grown at a rapid rate and is MUCH bigger than in 2008, hell even in 2020. Just check all major indexes and compare them to 2008. With a bigger market and more money involved, net flow of sales will be much bigger. Hence these numbers don't bring provide any value.\n\n\\----\n\n**Again, I do not want to discredit or discourage anyone from posting DD. I just want to make sure this does not end in an echo chamber. Everyone needs to do their own DD and question everything so we stay excellent and sharp.**\n\n**I want to make one thing clear. I am balls-deep in GME. I do believe in the MOASS. I do believe that we will see a market crash.**\n\nMaybe I will do these more often in the hope of apes being more thoughtful of info on here.\n\nIf mods feel like this is DD or any other flair, feel free to change it.\n\n**OH AND MODS, while I got you here. May I have the flair ''Diamantenhände 💎👐''?** \n\nK thank you. :-)\n\nSince I do know you like pictures of buildings with lights on, here is one for you.\n\n&#x200B;\n\nhttps://preview.redd.it/gj1oox90vix61.jpg?width=612&format=pjpg&auto=webp&s=75e8cf63d1fbae00569e59f948f125816f7dd10d",
    "title": "9 Counter-DDs to various Top-Posts to sharpen your mind - Buy, Hold and Vote - Nothing has changed.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6aidd/9_counterdds_to_various_topposts_to_sharpen_your/"
}