{
    "author": "SuperstonkBot",
    "created_utc": 1625891928.0,
    "distinguished": null,
    "edited": false,
    "id": "ohc2j8",
    "text_only": true,
    "flair_id": "e577ddb8-9674-11eb-985b-0e910120d0a5",
    "flair_text": "🤖 SuperstonkBot",
    "name": "t3_ohc2j8",
    "num_comments": 80,
    "permalink": "/r/Superstonk/comments/ohc2j8/what_is_cohen_going_to_do_with_2_billion_dollars/",
    "score": 805,
    "selftext": "Okay, to start I have to admit that I'm just a lurker ape who has absolutely zero karma. I have zero interest in owning or maintaining a reddit account (and no, I'm not a boomer). However, the shower thought I had seems important enough to share. Shout out to the mods for creating this avenue (superstonk.net) for posting DD without the sufficient karma to post. However, I've proudly owned GME since January (bought my first share at $300, one of us), and I've been able to convert my IRL wife, my best friend, as well as my dad into apes. **APES STRONG TOGETHER**.\n\nIf you want me to have a name in the inevitable event I become a **\"guy\",** then you can call me Willard (name story: I want to buy a male dachshund fren sometime soon, hopefully with moon tendies, and I will name my sausage fren \"Willard\", with the nickname \"Willy\", *\\*wink wink\\**).  \n\n  \n##### Okay, back to the main question:\n\n#####\n\n# What is Cohen going to do with 2 billion dollars in the bank?\n\nLooooooooots of speculation everywhere here. Banana piles of great ideas that the great Kong himself (not donkey kong, KING KONG u ape) would be proud of. Some ideas are confirmed to be in the works. E-Sports, NFTs, game studios, more fulfillment centers, corporate acquisitions (lookin' at you, Corsair!), new and improved GameStop \"flagship\" stores (think like an apple store) in large urban centers (lots of tech support, console demos, retro stuff, merch, you get the point), that would not all fit in a tiny mall GameStop, dedicating arenas for E-Sports or contracts with existing venues/stadiums for large-scale e-sports events (inb4).\n\nI have no doubt that many if not all of these may come into fruition at some point in time. However, **WHAT** is not as important as **WHEN**.\n\nSo, let's re-phrase this question (sorry for the bait):  \n\n  \n# WHEN is Cohen going to do with 2 billion dollars in the bank?\n\n(okay... the sentence syntax doesn't translate exactly, but good enough for apes)  \n\n  \n##### it's pretty simple: **buy the dip.**\n\n#####  \nCohen is going to buy the dip.\n\nWhat dip?\n\nYou know it. I know it. Everybody knows it!  \n\n  \n## MARKET CRASH!!\n\n##### We all know it's coming. We've read the DD, I won't get into that here. It's going to be bad. Really bad. Biblical, even. Glorious. May God have mercy on SHF souls, because we won't (infinity pool baby)\n\n#####  \nRegarding the crash, I'm aware that there are two main schools of thought (smooth brains get ready):\n\n1. GME moon will cause the crash  \n2. Crash will cause GME moon\n\nfrom all the DD I've read (almost all of it... you apes have been busy typing away at those typewriters!), especially from u/Criand, the more likely scenario is that option #2 is highly more likely. Let's smoothly assume that this is the case.  \n\n  \n### Okay... Cohen will buy the dip, when the market crashes. Sounds good. Makes sense!\n\n###  \nYes, makes sense it does (insert yoda.jpq)\n\nEverything will be on sale: real estate, stocks, crypto (crypto bulls BTFO, should've bought GME), gaming orgs, (not orgies,~~they're~~we're all virgins, good thing our wifes all have boyfriends to take care of that for us).\n\nAmazon has to sell fulfillment centers? **GameStop: dip bought**\n\n[Insert gaming org here] went bankrupt? **GameStop: dip bought**\n\nApple has to sell flagship stores? **GameStop: dip bought**\n\nSports arena defaults on loan? **GameStop: dip bought**\n\nStock on gaming hardware in the dumps? **GameStop: dip bought**\n\nEee Tee Hache, Bee Tee Cee, crypto on sale? **GameStop: dip bought**\n\n~~You know what else will be on sale? People.~~\n  \n\n  \nokay... let's rephrase that before I get cancelled.  \n\n  \n### A market crash will increase the supply of workers for GameStop to cherry pick.  \n\n  \nLots of people will be out of jobs. Good people. Great people. Highly talented tech workers who didn't see the light before. Not just tech, but people from all walks of employment. But specifically tech, because tech is in one hell of a bubble right now, and when it pops, many will jump ship (or get kicked out); also because GameStop is not just transitioning to yet another eCommerce company, but a real tech giant. Patents, baby (by the way... us apes need to keep an eye out for any potential patents that GameStop may or not be filing; someone besides me should look into that).\n\nGameStop is uniquely positioned to snatch up TONS of great talent at the moment of the crash. News will spread. Cohen wants GME to be the cool place to be. For SHF tears out loud, their job board has a banner of lambo's parked outside of a local GameStop. Baller. Forget Google, forget Amazon, forget [insert tech company here]. GameStop will not only be the best place to shop, but also the best place to work. Those who jump on board early before the squeeze will be rewarded with Infinity Tendies. Those who jump on board post-squeeze will envy them, but will not be left with nothing, as GME grows and grows. Morale will be legendary. Powered by tendies, memes, and a genuine desire to delight it's customer base, GME will be the new Google of the techsphere. Silicon Valley? *pfft.* More like **SILICON DALLAS BABY** (i know that grapevine is not technically in dallas, but it's still in the DFW metro, c'mon)\n\n[insert AndTHATisDallasKevin.gif]\n\nHiring the right talent is important. Great talent combined with a great corporate culture breeds ingenuity, creativity, and success. Cohen knows this. See: Chewy.  \n\n  \n### **Okay, so Cohen will both buy the dip and hire new talent after the market crashes?**  \n\n  \ncorrect... but that's not all.\n\nCohen will both buy the dip and hire new talent during / after GME squeezes.\n\nLet me say it again.  \n\n  \n### GameStop will be buying the dip like crazy and hiring new talent like crazy DURING / AFTER THE SHORT SQUEEZE.  \n\n  \nLook here, not there! Classic Art of War. All warfare is deception. Cohen is fighting a battle on many fronts in the financial realm. While GameStop is squeezing, while the news is going bonkers with the ticker price, while the news is spreading FUD about the market crash, GameStop will be moving in the shadows buying up property, making deals, hiring baller talent; **buying the dip.**\n\n**FROM THE MOUTH OF RYAN COHEN:** (June 9th shareholder's meeting)  \n\n  \n### \" We know some people want us to lay out a whole detailed plan today, but that’s not gonna happen. You won’t find us talking a big game, making a bunch of lofty promises, or telegraphing our strategy to the competition... Moving forward, we want you to judge GameStop based on our actions, not our words. Thank you everyone, and as my dad would say, “buckle up.” \"  \n\n  \nPower the the Players.\n\n---\n\n***This is not financial advice!***  \n*This post was **anonymously** submitted via **[www.superstonk.net](https://www.superstonk.net/)** and reviewed by our team.\nSubmitted posts are unedited and published as long as they follow r/Superstonk rules.*",
    "title": "What is Cohen going to do with 2 billion dollars in the bank?",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/ohc2j8/what_is_cohen_going_to_do_with_2_billion_dollars/"
}