{
    "author": "rensole",
    "created_utc": 1616064527.0,
    "distinguished": null,
    "edited": 1616079601.0,
    "id": "m7o6d3",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m7o6d3",
    "num_comments": 1185,
    "permalink": "/r/GME/comments/m7o6d3/synopsis_for_03182021_what_we_need_to_know_before/",
    "score": 10043,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nWho threw Robinhood and citadel under the bus?\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/o140x9a2brn61.png?width=680&format=png&auto=webp&s=b869dc81e840b3c15161f40a9f655a9cdc9765f2\n\nRemember this is not in any way shape or form financial advice.\n\n# Godlike DD\n\nSo some members have indeed seen that the godlike DD we got yesterday was moved, it's new (and hopefully remaining) location is here:\n\n[https://iamnotafinancialadvisor.com/Current-DD/](https://iamnotafinancialadvisor.com/Current-DD/)\n\n&#x200B;\n\nKnow that this is V11, this is a still ongoing research into this entire situation, so expect it to change and it adapting as all good thesis it changes because of feedback.\n\n&#x200B;\n\n# Anyone want some new GameStop?\n\nOk so remember how I was talking about GameStop could change into a new social hub and turn around what it was into something that is totally different.\n\nYeah it's happening! some awesome apes have taken some videos and pictures of how the new stores will look!\n\n[pictures](https://www.reddit.com/r/GME/comments/m79jjv/confirmation_bias_for_you_more_pics_from_a/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\nhttps://reddit.com/link/m7o6d3/video/roftlliecrn61/player\n\nSee those gaming chairs? great for E-sports or lan parties like the old days, place to chill and card games? man count me in!\n\n&#x200B;\n\nSo GameStop is moving into a new type of business, this is evident in the way that their business is changing from brick and mortar \"buy my games and gtfo\" to \"buy the game or just chill\" this in itself will lead to bigger streams of revenue, if you for example look at \"Friday night magic\" (magic the gathering get togethers) they could sell more drinks and small things to \"oh i'm here anyway might as well pick up X videogame/collectable/cards/anything they offer\"\n\nthis with the new push to digital means that it's no longer speculation that the old GameStop is dead, it's becoming fact that a new type of business, a customer centric business has risen from it's ashes.\n\n&#x200B;\n\nhttps://preview.redd.it/44t3r1sxdrn61.jpg?width=640&format=pjpg&auto=webp&s=9ad7b6fa07a6261c8908621136388e06e4e14854\n\n# The hearing\n\nOk can someone go check on Robinhood and Citadel, because they'll need some help getting out from under that bus.\n\n&#x200B;\n\nhttps://reddit.com/link/m7o6d3/video/23eegby3ern61/player\n\nFirst of all mr Dennis Kelleher is spitting some hard facts.\n\nRemember in the god tier DD, it shows that the FTD's are in a cyclical nature.\n\nWith the statements made yesterday we now know that we have this exact thing happen, because all they need is a \"reasonable belief\" to think they can deliver that stock, I really hope the SEC and the Government in general focusses more on this and adopts a European like law saying \"if you don't have it you can't do it\" because with \"reasonable belief\"... man just imagine if we had this rule with taxes or anything for that matter.\n\n&#x200B;\n\nhttps://preview.redd.it/39nwid9rlrn61.png?width=640&format=png&auto=webp&s=2e57c144af410c78e720ae1afc6a5f3508e2463d\n\n\"sir why did you steal that car?'\"oh no because I believed it was mine, I have a reasonable belief I can return this in time\"\"...very well sir please be careful\"\n\nAlso some other important things that came to light in the senate hearing;\n\n**\"Citadel securities is not a systemically significant firm, and FSOC should investigate it....\" MR. DENNIS KELLEHER**\n\nThey said flat out, if Citadel stopped to exist RIGHT NOW it would stop about 26% of us equities, which sounds a lot but look at GME how many times have they \"bought and sold\" the same shares over and over again, Volume does not equate to business nor profit nor importance.\n\n[Dennis Kelleher full testimony](https://www.reddit.com/r/GME/comments/m7e8xk/dennis_kellehers_testimony_is_an_eyeopening/)\n\n&#x200B;\n\nhttps://reddit.com/link/m7o6d3/video/heodqguzfrn61/player\n\nNow this lady, Ms. Alexis Goldstein she has a god damn wrinkly brain.\n\nshe has made some very good facts on how there may be some loopholes in the system that people like citadel could be using to their advantage. we have seen the same happen with the rule of daily to monthly reports of the SEC.\n\nit's something they could say \"oh you say monthly? but this one says daily so these are contradicting so I don't have to comply\" Remember folks no one stays on top with huge businesses and lots of capital by playing nice.\n\nThe only thing I didn't like about the hearing is the fact that they focused on the wrong thing, we don't have a payment-for-order problem, we have a naked/synthetic/shorting-problem.\n\nSeriously if they can't see that GameStop's entire thing is a literal showcase on why short selling is a problem if left unregulated then I don't think anyone in that senate should be there.\n\n&#x200B;\n\nhttps://reddit.com/link/m7o6d3/video/t4moaqyfjrn61/player\n\nhmmm that makes my noggin think....\n\nSEC is looking close in to Citatadel short selling. Big indication of abusive short selling 🤔\n\n&#x200B;\n\nI'm sure I'm missing some other facts here and I'll add them here over time (i'm sure my fellow apes don't mind raising some good points as always 😉)\n\nhttps://preview.redd.it/rrus68g5jrn61.png?width=640&format=png&auto=webp&s=3be2a2b745925711b895d60e859d9b5a754b268d\n\n# Robinhood never had your shares\n\nyup this may as well be as Fud as it gets, just set your account to cash as stated here:[https://www.reddit.com/r/GME/comments/m7jhp4/time\\_to\\_launch\\_the\\_rocket\\_this\\_is\\_the\\_catalyst/](https://www.reddit.com/r/GME/comments/m7jhp4/time_to_launch_the_rocket_this_is_the_catalyst/)\n\nThis forces them to buy the buy the stocks as far as I know\n\nposted in comments by u/AdInternational975\n\n    Remember when you convert to a RH cash account, once you sell, the funds have to settle for 3 days before you can reinvest them again. It’s different than RH Instant. So be sure you want to sell when you hit that button because you won’t be able to buy back in immediately if needed. You can invest any other settled funds just not the ones that have to clear. I’ve been a cash account since this all started. THIS IS IMPORTANT FOR EVERYONE CONVERTING TO CASH ACCOUNTS TO KNOW! Hope it helps.\n    \n    This will be another added factor as to why you should HODL! This is not financial advice in any way.\n\n&#x200B;\n\n# \n\nhttps://preview.redd.it/e1726rbzhrn61.jpg?width=640&format=pjpg&auto=webp&s=c5143fa07c744825e0302f81a1c8efcfab732e3c\n\n# Negative beta\n\nNow in the pas few days something funny happened, reddit found out that due to the negative beta GME is reacting inversely to the market (meaning market go's up gme go's down and vice versa).Funny how we posted about that yesterday and I saw someone on here post that it \"suddenly\" corrected itself.\n\nNow I'm the first to admit I don't have the exact technical knowledge to know whether or not this is normal behavior\n\nBut a smart ape did do a writeup on why the negative beta isn't as important as we first did believe\n\n[Found here](https://www.reddit.com/r/GME/comments/m72qz0/why_gmes_negative_beta_is_meaningless_and_tells/)\n\n&#x200B;\n\nhttps://preview.redd.it/a72gmshmlrn61.png?width=700&format=png&auto=webp&s=c0ce1712c88f23a92c54229ddba22315b9547348\n\n# Einstein has entered the chat.\n\nMost likely the smartes ape amongst us has written a great DD\n\n[Einstein levels](https://www.reddit.com/r/GME/comments/m7be96/oook_ook_ook_ooook_ook_ook_ook_ookook/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nLet's be honest, none of us can compete with this.\n\n&#x200B;\n\nhttps://preview.redd.it/t6hdtjzplrn61.jpg?width=640&format=pjpg&auto=webp&s=de4ae80344a104ec6076282345bc917f04638950\n\n# A one two punch k.o. is comming.\n\nu/heyitspixel did a great writeup on the new DTCC ruling and it's implications.\n\nThe new dtcc rules: [https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/DTC/SR-DTC-2021-003-Approval-Notice.pdf](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/DTC/SR-DTC-2021-003-Approval-Notice.pdf)\n\n&#x200B;\n\n[pixels post](https://www.reddit.com/r/GME/comments/m793h7/new_dtcc_rule_just_passed_in_effect_immediatly/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\nThe great take-away from this post is written by  u/swede_child_of_mine\n\n    This is probably punch one of the one-two punch from DTCC against Citadel & \n    naked options sellers (NOS's).\n    \n    Because this rule is effective immediately, Citadel & NOS need to report \n    to DTCC what their positions are, because you better believe DTCC didn't \n    change this rule to not use it.\n    \n    Punch two comes after either Citadel & NOS:\n    \n    1) Refuse to comply with the new rule\n    \n    2) Comply and reveal to DTCC the really ugly truthful numbers of their operations\n    \n    At that point, the DTCC will quickly turn to its stakeholders with strong cause to immediately pass SR-NSCC-2021-801 - the rule which would allow the DTCC to liquidate problematic firms whose operations expose the broader market to systemic damages.\n    \n    DTCC's interest might be in getting ahead of the next series of options writing, because it sees the damage exposure being brought by the NOSs.\n\nok but what about option 3? they lie?\n\n    Yep. But my guess is DTCC has the receipts of Citadel & NOS's shenanigans. \n    There is too much data available to cover with a compelling lie, \n    especially to the people who are executing all of their securities trades.\n    \n    My guess is: DTCC knew they might lie and already has a compelling case \n    for grounds for their liquidations, which the bad actors can't lie their way out of.\n    Even if they attempt to lie, the DTCC will turn around and say \n    \"These guys lied and are not complying. This is even more cause to liquidate.\"\n    \n    Either way, I think the DTCC might be the biggest player in this whole thing, \n    and wants to get ahead of the next round of options issuance.\n\nAnd I have to agree, everything I've seen from the new DTCC rules lines up with my beliefs that they are hedging their bets (see what I did there?) to make sure they're the ones who get out alive and well from this situation and Citadel is the one who's going to go down for their own problems.\n\n**Addendum:**\n\nSomeone commented beneath pixel with some counter as to how it should be viewed, which is great!  u/the_captain_slog **posted:**\n\n    I agree that this a good thing for the implications on the liquidity deposits,\n     but your analysis is backwards.\n    \n    \"DTC provides regular reports and statements to Participants showing their\n     settlement activity; this includes activity, risk control monitoring and\n     settlement reports. The Procedures of DTC require Participants to reconcile \n    both their activity and positions with DTC upon receipt of applicable daily\n     activity statements at the end of each day and to immediately report any\n     discrepancies. Participants must also provide a month-end confirmation of \n    their activity.\"\n    \n    The statements flow from DTCC to the hedge funds/participants. \n    It was not the hedge funds/participants providing statements once a month.\n    \n    Think of this like a bank statement. Your bank shows you online what all of \n    your activity is now on a daily basis, so you don't need to wait for a \n    month-end statement anymore (even though those are provided electronically \n    as well).\n    \n    Participants / hedge funds are now responsible to confirm the accuracy of \n    their statements and provide reconciliations of discrepancies daily: \n    \n    \"It is the sole responsibility of Participants to perform a daily reconciliation\n    of their activity and positions with the information, reports and statements\n    provided by DTC. Participants must immediately report to DTC any discrepancy\n    between their activity and positions with the information, \n    reports and statements provided by DTC or other issues relating to the accuracy of the information, reports and statements provided by DTC.\"\n    \n    Here is the big part: This monthly confirmation had to happen \n    \"no later than the 10th business day after the last Friday of the month.\" \n    It's very likely that they're now removing the buffer so they can do \n    the margin calls quicker. Before, there was a reasonable cover that \n    existed of \"Oh, I haven't reviewed and confirmed my statement yet.\" \n    Now, that no longer exists. \n    They also now have daily confirmed statements showing any potential \n    issues / weaknesses that exist so they can do the margin calls on \n    more of a real-time basis.\n\nhttps://reddit.com/link/m7o6d3/video/qubv9a7ylrn61/player\n\n# DFV wishes everyone a happy saint paddy's day.\n\nNote the background, just saying.\n\n**Addendum:**\n\nDFV stated he was a kitty in a meme vid of his, so there are 4 cats in this pic.\n\nbackground, bottom right, his Gandalf kitty (remember gandalf always comes just when he's needed wizards are never late) and Himself.\n\nQuadruple kitty vid, may be a reference maybe just poking fun at the quad day\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/lkf980a7mrn61.png?width=640&format=png&auto=webp&s=dba6cea94c50347e11c8d1939c58cd3746cb394c\n\n# I think I speak for everyone when I say, our sincerest condolences Mr. Cohen.\n\nRyan Cohen posted yesterday about his late father, and there where some clowns posting shit about GME on there.\n\nSeriously everyone DONT! show a sense of decorum.\n\nShow this man some love, offer your sympathies and condolences, be nice! we are here today because of him so show him the respect he so well deserves.\n\n&#x200B;\n\nhttps://preview.redd.it/uxgbtjusmrn61.jpg?width=636&format=pjpg&auto=webp&s=325cd34b023476fbe317509304a8f3125020e63f\n\n# Patience is key\n\nOk so now we are closing up on the 19th the \"mystical\" witching day, this has been hyped up so much so expect it to go down. expect fuckery as always.\n\nExpect the 19th to be the lowest day we have since yet seen.\n\nWhy am I saying this?\n\nEasy, if we know the date THEY know the date.\n\nall you need to do is sit back relax, get some nacho's for the dip and sit back.\n\nThis can take days, weeks or months.\n\nDr. Michael Burry had to wait 2 years for it to come out and his calculations to get paid out.\n\nExpect the same, because if you expect the worst it can only get better.\n\nor as Mark Cuban said it:\n\n&#x200B;\n\nhttps://preview.redd.it/4mdobw4cnrn61.png?width=640&format=png&auto=webp&s=fc5c046ef50069cef062464e39550a42bb30cd81\n\n&#x200B;\n\n# REMEMBER TO BE NICE TO ONE AND OTHER!!!\n\nSeriously guys be nice, this makes it so easy to remove the shills.\n\nBecause if everyone is nice these guys stand out, act like everyone here is your best friend, like it's the hot chick/dude you're on a date with, act like this is your ape brother and you're both waiting on a rocket to go to tendytown.\n\nyou know why? because we are friends.\n\nNothing matters, only thing that matters is simple\n\nApes dont fight Apes\n\nApes help other Apes\n\nBecause anyone who isn't an ape get's banned faster then a monkey eats a banana.\n\n&#x200B;\n\nhttps://preview.redd.it/488tmpzjnrn61.png?width=400&format=png&auto=webp&s=3d5f43d1cdd31d462f0a9479df415c855dfd4122\n\nRemember none of this is financial advice\n\nRemember none of this is financial advice, I'm so retarded I'm not allowed to go to the zoo 'cause they'll put me in the cage with the rest of my ape brothers.\n\nIf anything happens throughout the day I will be adding it here.\n\nbackups:\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n&#x200B;\n\nEdit 1:\n\nSTOP POSTING YOUR POSITIONS!\n\n[https://www.reddit.com/r/GME/comments/m71xqx/stop\\_posting\\_your\\_positions/](https://www.reddit.com/r/GME/comments/m71xqx/stop_posting_your_positions/)\n\n&#x200B;\n\nSeriously listen to her, this is why I've been against posting positions, Dragnetting is a thing.\n\nNow you heard it from a smart person so please listen\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/1gonw9puwsn61.png?width=640&format=png&auto=webp&s=60ba564119e999f927f9711a8ee1b0212c7dd3d0",
    "title": "Synopsis for 03-18-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GME/comments/m7o6d3/synopsis_for_03182021_what_we_need_to_know_before/"
}