{
    "author": "tiides",
    "created_utc": 1625246970.0,
    "distinguished": null,
    "edited": 1625265269.0,
    "id": "ocex3f",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ocex3f",
    "num_comments": 39,
    "permalink": "/r/Superstonk/comments/ocex3f/a_working_theory_what_gamestop_is_doing_with_nfts/",
    "score": 507,
    "selftext": "This is a repost of a post that ran afoul of the automod, and I'm reposting a sanitized version for visibility for the sake of the community. Note that farther down in a quoted section, when I use \"**\\[left intentionally blank for automod\\]\"** I'm referring to the crypt0 network pictured in most images below. Alright, now that that's out of the way.\n\n# Part 1 - I don't think I understand\n\n* 0x13374200c29C757FDCc72F15Da98fb94f286d71e = NFT contract for Gamestop. Old news by now.\n\n&#x200B;\n\n[ nft.gamestop dot com ](https://preview.redd.it/lu35gg1p0u871.jpg?width=637&format=pjpg&auto=webp&s=4526d89e678bbe5fe6357e3eaafeb32de2837fd7)\n\n# \n\n* 0x10B16eEDe03cF73CbF44e4BFFFa3e6BFf36F1Fad = within contract code as address public owner (of above contract)\n\n&#x200B;\n\n[ 1337420 contract lists the address public owner in its code ](https://preview.redd.it/pmjhfuzr0u871.jpg?width=1328&format=pjpg&auto=webp&s=e7b972eae79969867a4044322c845b04ddc7442e)\n\n* Contract details for address above = contain multiple references to gnosis \\[dot\\] io\n\n&#x200B;\n\n[ Stefan and Richard, hello! ](https://preview.redd.it/25xq4dcy0u871.jpg?width=1328&format=pjpg&auto=webp&s=8a54de0ebae60eeea1e43921907fff9fa02e9e63)\n\n* What does that website say about themselves?\n\n&#x200B;\n\n[ Well that seems promising and very relevant to current speculation about NFTs ](https://preview.redd.it/uiwn6e211u871.jpg?width=935&format=pjpg&auto=webp&s=92c88ddcac51157b55ea114e380adc40965a8605)\n\n* 0x76e2cfc1f5fa8f6a5b3fc4c8f4788f0116861f9b = contract creator (of above contract)\n\n&#x200B;\n\n[ My my, aren't you busy little bees? ](https://preview.redd.it/98ijgbe41u871.jpg?width=1394&format=pjpg&auto=webp&s=16bc2bf2cad55bcbe43c9430e2b8a0d7e0173843)\n\nI'd appreciate an explanation/translation of the above from anyone more versed in the ee tee aych ecosystem please! To me it looks like a protocol/contract/service, which Gamestop may be employing for NFTs, is seeing a lot of use right now [🤷‍♂️](https://emojipedia.org/man-shrugging/) Gnosis doesn't really come up again beyond these proxies, so it could be that they're simply the framework for whatever else is happening.\n\nThis was where I initially left it, but I couldn't resist continuing to dig. I think things became a lot clearer as I explain below.\n\n# Part 2 - I think I understand completely now\n\nI noticed the 1337420 contract is holding 1 Card from a game called Gods Unchained.\n\n&#x200B;\n\n[ What is this game? ](https://preview.redd.it/t2mcomsk1u871.jpg?width=653&format=pjpg&auto=webp&s=15fc22028439a87bb5b09c02555fd391f6035843)\n\n* Gods Unchained, as described in their FAQ, and then some choice snippets:\n\n>is a free-to-play tactical card game that gives players true ownership of their in-game items. Led by the former game director of Magic The Gathering: Arena (**\\*Note:Chris Clay, remember this for later\\***), the game focuses on competitive play, which means players must strategically outsmart their opponents by building decks that are able to combat a wide variety of tactics. In Gods Unchained players completely own their digital items, giving them the freedom to trade, sell and use their cards any way they like – just like owning real, tangible cards.  \n>  \n>Play to Earn (P2E) means you can earn cash just by playing the game. In Gods Unchained, this is seen through the ability to earn in-game items that you can sell for real-world cash.  \n>  \n>Traditionally, items in games are owned outright by the companies that create them. When you buy in-game items, like a favorite skin for your character or a card for your deck, you don't own it – the game company licenses it to you. By minting cards and items to the **\\[left intentionally blank for automod\\]** network, we’re changing this old practice to give players real ownership over the items they purchase or earn in games. This gives you the right to sell an item for real money, use it in Gods Unchained or even take it into a different game. Basically, how you use it is completely up to you! Best of all, the game developer (in this case, us) can’t change the value or power of that item to force you to buy the next DLC to remain competitive or nerf you outta existence. There are other things blockchain technology brings to the table that we’re looking to bring in future seasons, such as proving the history of individual assets. Imagine an incredible play in the final round of the World Championship coming from a card that nobody expected. Now imagine the player who made that play digitally signs the card and auctions it off for charity. Because its transaction history is immutably recorded in the blockchain, any future owner can digitally prove everywhere that card has ever been, including in the final round of that tournament, since its creation. Blockchain is opening the doors to not only give players more control and ownership of their time but for gaming to do more – and we’re leading the charge.  \n>  \n>\" Players deserve better. \"  \n>  \n>\" **TRUE OWNERSHIP FOR PLAYERS** \"\n\nDo the two quotes above echo any particular sentiment with which we're familiar? Maybe something like, oh I don't know, **Power to the Players**?\n\nJordan Holberg who is the new GameStop Principal Engineer, has written about how he explored usages of NFTs with Wizards of the Coast in the past ([https://www.linkedin.com/pulse/magic-gathering-multiverse-metaverse-jordan-holberg](https://www.linkedin.com/pulse/magic-gathering-multiverse-metaverse-jordan-holberg)), possibly around the time Chris Clay was at WotC?\n\n&#x200B;\n\n[Hey, wen did you work for MTG friendo? ](https://preview.redd.it/09l5k3el2u871.jpg?width=793&format=pjpg&auto=webp&s=29ed912919d43dd48484e51b4644dc784a9a2115)\n\n&#x200B;\n\n[ Oh, so you mean it was exactly when Holberg was exploring NFT usage with his company, which WotC ultimately didn't pursue?? ](https://preview.redd.it/718o8vhn2u871.jpg?width=774&format=pjpg&auto=webp&s=32222f1886cc72d0be2aeae18bff06f5b0edbe19)\n\nChris Clay pursued NFT applications after that stint and runs his own NFT game company. And now Holberg is Principal Engineer at GameStop, and GameStop holds a Card from his game in their 1337420 contract.\n\nBorrowing below from user u/Pkmnpikapika from their comment history (I see you evangelizing this theory! Hello ape!) and a comment on the last post, I think I may have linked some crucial filler data here to bolster that this theory laid out below is accurate.\n\n&#x200B;\n\n>Jordan Holberg, principal engineer of NFTeam at gamestop, has an out of the box idea. It is a wallet that holds money. It remembers the balance. It can also hold in-game characters that remember the balance of the EXP, how much HP is left, or anything in-game, like a horse that you level-up, or an armor with break points. [https://hodlberg.com/faq](https://hodlberg.com/faq)\n\n&#x200B;\n\n>Gamestop is making a wallet that can hold money as well as in-game evolving characters that remembers the stats, balances of the HP, EXP. So maybe Gods Unchained will be one of their flagship games that they launch(even though it's already out there) that is compatible with whatever they will announce\n\nI think the social media branding change, followed by the focus on \"Power to the players\" may be portending this announcement/launch specifically among some possible others.\n\n**TLDR: Hodlberg + GameStop = GameWallet**, leveraging partnerships with many existing and new c0ins, NFTs, games, tokens, etc. and ushering in a whole new era of possibilities.\n\n**EDIT**: Piggybacking off a user comment, these are the current NFT contents of the GameStop contract ***visualized***: [https://nft20.io/gallery/0x13374200c29C757FDCc72F15Da98fb94f286d71e](https://nft20.io/gallery/0x13374200c29C757FDCc72F15Da98fb94f286d71e)\n\nIt contains as /u/Ineedgold points out, the card Astric Implosion from the above game, in addition to 3 Crypt0 Kitties. Looks like internal testing is almost done!",
    "title": "A Working Theory - What GameStop is doing with NFTs",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ocex3f/a_working_theory_what_gamestop_is_doing_with_nfts/"
}