{
    "author": "Wild_Investigator622",
    "created_utc": 1625226936.0,
    "distinguished": null,
    "edited": 1625229567.0,
    "id": "oc8j9i",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oc8j9i",
    "num_comments": 28,
    "permalink": "/r/Superstonk/comments/oc8j9i/goldman_sachs_what_happened_in_june/",
    "score": 945,
    "selftext": "I previously posted about JP Morgan and their registering of new charges, including as recently as June 25th. So I wanted to have a look around and see if I can find any sort of similar activities with some of the others. I didnt find much if I'm honest and most banks etc hadn't registered charges in over a decade.... so I decided to have a look at a bank that had a possible connection to all this mess, and landed at our friends at GOLDMAN SACHS. \n\nGoldman Sachs have been registering charges all year aswell (like JP) and who are these with? That's right, its BNYM again! (This is important because it allows me to see if BNYM are consistent in their document wording.) Charges can be viewed here:\n https://find-and-update.company-information.service.gov.uk/company/02263951/charges \n\nExamples for apes that only like pics: http://imgur.com/a/GeysECZ \n\nNow interestingly they had been registering 2 charges a month all year, but June has had 5 charges registered! Most recently on the 30th of June (Wednesday). \n\nIn the most recent charge document (30 June) we can see Goldman are issuing senior notes to the tune of 1.5 billion dollars! \n\nSee here: http://imgur.com/a/eAHAa7i \n\nAnd the collateral provided in this agreement? Pages worth, looking like everything! Give it a read here its screenshots of the relevant section: \n\nhttp://imgur.com/a/LEmd506 \n\n\nWhy the sudden flurry in June? I'm unsure but something is afoot and if any other wrinkles would like to try to find anything significant that can be linked please let me know! Looks to me though like they need some cash! Bare in mind they also do pay interest on the notes. \n\nSide Note: In my JP Morgan post I had highlighted the BRRD amendment that had been included in the docs recently and was told to see if this this could just be standard in these kind of documents. However, i saw no BRRD provisions in these, so if standard why not standard? This agreement actually comes after the one I was highlighting in the JP review so even if it was new language that they were including everywhere, why not then include it in an agreement 5 days later? \nFood for thought for most of you but signals to me that maybe they needed it in JP but not here, which tells me what I can infer from that!  \n\nHere is a link to my JP Post, not because I'm a narcissist, but it ties in and if some of the stuff in this post doesnt seem explained, I have likely explained in that post. \n\nhttps://www.reddit.com/r/Superstonk/comments/oauenv/found_out_why_the_lights_are_on_at_jp_morgan_in/?utm_medium=android_app&utm_source=share \n\nAs always if anyone has any insights please chime in! If this can be proven insignificant or just wrong, then please let us know, comment or make a post and I will stop reading these incredibly boring documents. Thanks! \n\nLastly, I know a lot of you gave me advice on how to include pics in the post rather than linking imgur and it looks like I was really grateful but then didnt listen to you guys at all..... I honestly am doing all of this on my phone and it wont let me copy pasta like suggested sorry!\n\nEdit: THIS EDIT COULD BE DEEMED TIN FOILING SO IF NOT INTERESTED FEEL FREE TO IGNORE:\ninteresting that this is for 1.5 billion, because they were hired for robinhood ipo and robinhood just disclosed losses of 1.44 billion.\n\nSee this Yahoo finance article from 19 hours ago: https://www.google.com/amp/s/uk.finance.yahoo.com/amphtml/news/trading-app-robinhood-files-publicly-171841631.html \n\nSpecifically this paragraph: The company’s credit lines include a $600 million revolver from banks including JPMorgan Chase & Co., Goldman Sachs Group Inc. and Morgan Stanley, according to data compiled by Bloomberg. \n\nCould be something could be nothing",
    "title": "📢 GOLDMAN SACHS - WHAT HAPPENED IN JUNE?! 📢",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oc8j9i/goldman_sachs_what_happened_in_june/"
}