{
    "author": "thegreatself",
    "created_utc": 1626373144.0,
    "distinguished": null,
    "edited": 1626386387.0,
    "id": "okymj0",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_okymj0",
    "num_comments": 153,
    "permalink": "/r/Superstonk/comments/okymj0/as_a_wageslave_there_is_no_amount_of_my_savings/",
    "score": 3054,
    "selftext": "A survey conducted in my \"first-world\" country with an extremely (and relatively) high \"standard of living\" (wooo 🇨🇦!) indicated that [roughly half of us are within $200 of not being able to cover our bills](https://www.ctvnews.ca/mobile/business/half-of-canadians-within-200-of-not-being-able-to-cover-bills-debt-payments-survey-1.5379871) - alternatively, [for every $1.00 of disposable income the average household owes $1.71 in debt](https://www.bnnbloomberg.ca/household-debt-ratio-rises-to-170-7-per-cent-statcan-says-1.1535105)\n\nSo, like most of us I don't have much money to safely ~~gamble~~ invest but I feel absolutely NO FEAR in YOLO'ing my very modest savings on $GME because really, *what's the alternative to the MOASS*?\n\nWage-slavery until I'm old and crippled, bitter and broken? \n\nSpending almost every free moment of my waking life in subjugation and service to the \"superior\" notion of capital and profit?\n\nContinuing to participate in a labour market that does not recognize my fundamental value as a human being?\n\nSounds like hell exists on earth and I don't want to live in it. I participate only because there is no choice but to participate, unless I thought ending it all was somehow the better option - and sometimes it might seem that way when you stop and consider the world and Humanity's - OUR - place in it.\n\nI am already going to exist largely \"on credit\" for the remainder of my short life - if I lose my savings I'm barely any worse off than I was when I started.\n\nThink I should be scared of \"losing it all\"? \n\nLMAYO! \n\nJokes on you - I have nothing to lose.\n\nI'm HODLING $GME until I'm free or I die, whatever comes first.\n\nFuck Ken Griffin. Fuck Vlad Tenev. Fuck Steve A. Cohen especially, the ugly fat repulsive fuck. Fuck Leon Cooperman. Fuck Gabe Plotkin. Fuck Thomas Peterffy. Fuck Jim Cramer. Fuck Jeff Yass. Fuck Michael Bodson.\n\nGet fucked and lick my taint you parasitic skidmarks. \n\nWelcome to a New Age.\n\nMeme it to manifest it 🚀🌘",
    "title": "As a wage-slave there is no amount of my savings that I \"can't afford to lose\"",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/okymj0/as_a_wageslave_there_is_no_amount_of_my_savings/"
}