{
    "author": "wobshop",
    "created_utc": 1626337089.0,
    "distinguished": null,
    "edited": 1626354516.0,
    "id": "okohfa",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_okohfa",
    "num_comments": 278,
    "permalink": "/r/Superstonk/comments/okohfa/seen_some_people_complaining_about_the_lack_of/",
    "score": 5441,
    "selftext": "> We know some people want us to lay out a whole detailed plan today, but that’s not gonna happen. You won’t find us talking a big game, making a bunch of lofty promises, or telegraphing our strategy to the competition; that’s the philosophy we adopted at Chewy.\n\nAnd then later\n\n> Moving forward, we want you to judge GameStop based on our actions, not our words.\n\nPersonally speaking, I’m more than happy for the company to make their moves in the dark and only announce them after the fact - it provides much less opportunity for the shorters to retaliate or react effectively. \n\nWe can hype dates, get excited, go down weird rabbit holes and whatever else, but at the end of the day that’s all noise. \n\nIf you trust the company and their strategy, no matter how opaque it may be, holding is easy. \n\nLet them do their thing. When the time is right, they’ll let us know.\n\nEdit: to those saying that they haven’t done or announced anything so far, and the least they could do is give us something, here’s another quote.\n\n> Here are a few things we’ve done so far: refreshed the board, added technology and retail experience to the leadership team, paid off all our long term debt and strengthened the balance sheet, and begun laying the foundation for long term growth.\n\nThey’ve also purchased a couple of enormous fulfilment centres. And remember - they announced none of the above in advance.\n\nEdit 2: credit to u/MrMaintenance for this one\n\n> We are trying to do something that nobody in the retail space has ever done, but we believe we are putting the right pieces in place and we have clear goals…\n\nBullish. Have patience.",
    "title": "Seen some people complaining about the lack of concrete plans and directive from the board. Here’s an excerpt from Cohen’s speech at the shareholder’s meeting, for those who missed it.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/okohfa/seen_some_people_complaining_about_the_lack_of/"
}