{
    "author": "ramenologist",
    "created_utc": 1626982598.0,
    "distinguished": null,
    "edited": 1626983267.0,
    "id": "oplb7q",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_oplb7q",
    "num_comments": 78,
    "permalink": "/r/GME/comments/oplb7q/i_think_those_blackrock_issued_etfs_are_worth_a/",
    "score": 741,
    "selftext": "u/horror_veterinar found these insane ETFs issued by blackrock containing the entire US economy (in essence) with the strongest positions on those ETFs held long by Citigroup, Wells, JPM, BAC etc. Some have also speculated he’s found the reverse repo counterparties, go check out his stuff it’s great.\n\nAnyways: today SPY shot up and banks bled but I noticed an interesting resemblance. (Skip to image link if you like: I’m on the bus, reddit mobile is glitching, and I’m not moving it)\n\n[Where link should be]\n\nNow here’s my gut feeling, some of these ETFs contain the forbidden movie stock (the one with a laughably small SI%) but none of them contain our beloved GME. Imo the reason none of the ETFs contain actual GME is because these ints. don’t want to buy shares/contracts directly to hedge because buying them would kick start the MOASS ‘most 100%. They want the liability for this naked mess to stay w the SHFs as it should (Kenny G and Steve r fuk and should stay fuk). So what do you do to avoid catastrophe in light of the impending squeeze? Hedge and circle jerk as ints and HFs do best. And they’re doing so by hedging with the largest ints. GME holder (BR) and the fed reserve is likely in on it too I’m sure of it. Only question is how exactly? Blackrock would also likely see an immense (gargantuan proportion of a) jump in liquidity during the MOASS so could carry the US financial sector through the gap up on a life boat of sorts. I’ve watched most of u/horror_veterinar ‘s videos and my theory has always made sense to me all along. We’ve also seen blackrock motivated to transfer exclusively into environmentally sustainable tickers and how that could corroborate this. \n\nHERE’S WHY I THINK THIS THEORY NEEDS A SECOND LOOK:\n\n[Major ints. and GME 22/07 14:56](https://imgur.com/a/8b8ukoM)\n\nGuys … I’m just starting to think they’re more hedged to GME (or at a minimum the puppet hands of everything else they’ve used to hedge the MOASS in these ETFs that are tied to how GME trades … in some way we’ve been missing). \n\nTell me the general resemblance of those tickers today doesn’t exist. Tell me I ate too many crayons for breakfast this morning. I think a hefty few apes wrinklier in brain than I should be looking into these ETFs NOW. It’s odd enough for those tickers (minus GME and its beautiful negative beta) to be lapsing the way they did but even while SPY has been on a cakewalk up all day (but most importantly, almost identically to GME) This screams complex hedging and the shoe fits imho. Literal, entire states in the US are buying into GME in buckets; you don’t think JPM and Wells etc wouldn’t have caught wind first and wanted to prepare? I just want to find out how \n\nTLDR- I need brains on this so if you didn’t read, or can’t; hodl… you’re doing great. These BR issued ETFs might hold a ton of confirmation bias if we can pin how they’re actually being used to hedge the entire financial sector w GME and in anticipation of the MOASS.\n\nEdit: tpyos \nEdit: structure fixes",
    "title": "I think those Blackrock issued ETFs are worth a second, third, and fourth look",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/oplb7q/i_think_those_blackrock_issued_etfs_are_worth_a/"
}