{
    "author": "YoshiPendragon",
    "created_utc": 1622167232.0,
    "distinguished": null,
    "edited": 1622215589.0,
    "id": "nmn8en",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nmn8en",
    "num_comments": 338,
    "permalink": "/r/Superstonk/comments/nmn8en/mods_please_put_a_stop_to_the_attention_seeking/",
    "score": 5135,
    "selftext": "This is getting absurd. I've seen more posts and comments about eating or ingesting dangerous things, shoving something up their ass, or engaging in potentially illegal behavior to celebrate what are microscopic gains today than any other singular topic. Behavior like this makes the entire community look bad and just adds fuel to the fire that Redditers are a bunch of idiots only winning through strength in numbers. A couple weeks ago a big part of the community was willing to paint targets on their backs to say they're (insert prestigious profession here) and don't need the government regulating their investments. Now we have people so far on the opposite end of the spectrum that I'm just waiting for someone to try and launch an M-80 from their butthole and end up hospitalized or dead. Seriously, what in the actual fuck people? Mods please discuss adding rules prohibiting explicit or self-harming behavior from being posted on this sub. We do NOT need negative attention drawn here that can ultimately get this sub deleted because people encourage these actions and someone dies, gets maimed, or ends up in jail. \n\nI'm going back to eating my red crayons, I fucking miss the apes that enjoyed red crayons quietly and respectfully. Green crayons are a hell of a drug.\n\n\nEdit: I wish I could say I'm surprised by the amount of direct attacks in response to this post, but I'm not. Besides the hateful comments from a lot of people who just recently joined, haven't voted, and have a very questionable account history, I've also gotten numerous threatening private messages and self help reports. I think I may have hit a nerve with the shills. I appreciate the folks speaking up in support. If the mods decide people are welcome to post explicit or harmful content here, then that's their decision and will send a clear message about what this community stands for.\n\nEdit 2: So to all those folks commenting that I'm a lone ape and this is not the majority opinion, this post is currently at over 4600 upvotes with a **92% upvote rating.**\n\nEdit 3: u/rensole has made an official statement stating that NSFW behavior like the banana thing are not welcome here. It would be really nice to see rules updated to officially ban this type of behavior.",
    "title": "Mods, please put a stop to the attention seeking karma farming over ultimately insignificant price movement. People are starting to do vile, dangerous shit that can get someone truly hurt. We aren't \"Jackass: GME Edition\"",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nmn8en/mods_please_put_a_stop_to_the_attention_seeking/"
}