{
    "author": "WBSdiamonds",
    "created_utc": 1624681075.0,
    "distinguished": null,
    "edited": 1624682399.0,
    "id": "o83m79",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o83m79",
    "num_comments": 167,
    "permalink": "/r/Superstonk/comments/o83m79/update_gamestops_new_700000_sq_ft_fulfillment/",
    "score": 4129,
    "selftext": "Good evening Diamond Handers!!\n\nAs part of GameStop's efforts to expedite their deliveries and expand their product lines on the East Coast, they've leased out a 700,000 SQ Ft. center in York, PA (This is also my hometown, JTTT). Yes, this information has already been disseminated, but here's an update! The hiring event for their Day One team will begin on July 8th. Their listing outlines the direct benefits employees will receive, which if you ask me, seems like they really care about their employees AND making customers happy!\n\nWhat better way to compete with an E-Commerce giant than to attack them where they're weak? Customer Support & Employee Relations!\n\nHere's the contents of their job listing:\n\n>**Description:**\n\nReady Player One!\n\nGameStop is currently hiring for the DAY ONE TEAM in our new York, PA Fulfillment Center!\n\nJuly 8th\n\n10:00 am – 4:00 pm\n\n20 Leo Lane, York, PA 17406\n\nApply Online in Advance\n\nOur July 8th hiring event will include open interviews with on-the-spot offers!\n\nWe have openings for entry-level fulfillment center associates, leads, and machine operators/drivers!\n\nJoin our team to earn money and great benefits while having fun, earning a discount on GameStop products, and learn more about the growing world of fulfillment and e-commerce!\n\nWe offer full-time opportunities in a climate-controlled environment with excellent training, career advancement opportunities, and a competitive benefits package to include paid time off, full health and wellness benefits, 401(k) and more. \n\nJoin GameStop and become part of the dedicated team that creates an exceptional customer experience through e-commerce. Stay active during your work day in this fast-paced warehouse environment.  You could be on the move for your whole shift.  Fulfillment Associates do a wide range of warehouse functions. Your duties may include receiving, inventory, picking, packaging, and shipping products for distribution to stores or individual consumers.\n\n**✋🚀** **✋🚀** **✋🚀** **MOON** **🦍💎** **🦍💎** **🦍💎**\n\n[Current Facility \\(Operations shown are from a prior business's operations\\)](https://preview.redd.it/qqj14b11dj771.png?width=1454&format=png&auto=webp&s=7ae3c2104719fc5be1a0546eaeda2000ede9cb2a)\n\n*Edit: I did some extra dorky math for y'all.* The average GameStop store is 1,700 Sq Ft(taken from their 2017 annual report). This means you could fit roughly 411 GameStop's inside of this facility or 8.5% of the GameStop's in existence ;). IT'S BIG. ",
    "title": "[UPDATE] GameStop's NEW 700,000 Sq Ft. Fulfillment Center in York, PA!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o83m79/update_gamestops_new_700000_sq_ft_fulfillment/"
}