{
    "author": "thr0wthis4ccount4way",
    "created_utc": 1618529514.0,
    "distinguished": "moderator",
    "edited": 1619093695.0,
    "id": "mrqvf1",
    "text_only": true,
    "flair_text": "𝗦𝘂𝗯 𝗔𝗻𝗻𝗼𝘂𝗻𝗰𝗲𝗺𝗲𝗻𝘁",
    "name": "t3_mrqvf1",
    "num_comments": 233,
    "permalink": "/r/DDintoGME/comments/mrqvf1/welcome_to_dive_deep_into_gme_newcomers/",
    "score": 859,
    "selftext": "https://preview.redd.it/gie11p6r8ft61.png?width=1500&format=png&auto=webp&s=fb9c0dd4cbc5e016a4d1b4a6809e20a4aa4dd606\n\nThis community is dedicated to the **provision and discussion of truthful information related to GameStop stock ($GME)**.\n\nOur cause is to protect all shareholders of GME through education & research meant to bring out the truth while exposing criminal activity: market manipulation, pump & dump schemes, scams, collusion, FUD, and others.\n\n*Find out more in the* [*About Us Wiki*](https://www.reddit.com/r/DDintoGME/wiki/about)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xnnj369lgmt61.png?width=1600&format=png&auto=webp&s=0cdd62d192a2cdf4842a7f554ec3991d82520d3a\n\n# How We Operate: Information Review\n\nBeing an information-specific sub in a time when misinformation floods Reddit, we have incorporated an advanced Information Reviewing process whereby all submitted posts are vetted by a team of DD Vets and feedback sent back to the poster as a request for amendment where the execution of which would certify the post as **Reviewed**.\n\nAmendments are normally requested to specify what is hard-fact (through evidence/referencing), and what is speculation, opinion, or hypothesis. This enables readers to easily distinguish between hard-fact and theory/opinion.\n\nThe process also makes it easy for users to understand which posts require more caution than others in identifying criminal activity such as market manipulating FUD & scams, thereby safeguarding readers from being tricked with deceit.\n\nThe DD Vets remain unbiased about the content of any submission during review and exercise transparency of the full process.\n\n&#x200B;\n\n# Posting DD & Review Process\n\n* When posting Deep Dives users should choose the **Unverified DD** flair.\n* **Once DD Vets start a review**, we will add the **review notes as a Sticky Comment**.\n* **Once a review is complete** and all notes added into the sticky, **the poster will be alerted with a Modmail message** with the very same notes + a request for an amendment if necessary.\n* If/When the user makes the requested amendments, **the poster should alert the DD Vets by replying to the modmail message** that the post is compliant.\n* DD Vets will inspect the post and manually change the flair to **Reviewed Deep Dive ✔️** provided that it now meets the content guidelines & rules.\n* The DD Vet **notes will remain in the sticky** for transparency, and in case the original poster edits the post after flair change.\n\n&#x200B;\n\n# Caution to users while reading DD\n\n* When reading posts tagged as **Unverified DD - stay vigilant** about what you read and **report** anything which seems to break the [rules](https://www.reddit.com/r/DDintoGME/about/rules) or [content guidelines](https://www.reddit.com/r/DDintoGME/wiki/contentguidelines).\n* Always **check for any stickied notes** to understand what amendments the DD Vets may have requested from the poster.\n* When reading posts tagged as **Reviewed Deep Dive ✔️ - read the sticky notes anyway** since posters may deceive you by reverting the changes that were required to obtain Review-certified flair.\n\nTL;DR above 3 points: **Always stay vigilant of material and always read the DD Vet notes.**\n\n&#x200B;\n\n# Clarifications\n\n* Posts with other flairs (*Speculation, Discussion, News, Data, Requests & FUD*) will also be reviewed by DD Vets, but should not undergo flair changes unless an inappropriate flair is chosen.\n* DD Vets may post a Sticky Comment to alert poster and readers if the content of the post includes anything suspicious, or a minor issue not requiring an edit.\n* The poster will also be alerted through a modmail message.\n* DD Vets will continue to remain unbiased throughout the review process and will exercise transparency via the sticky comment notes.\n* DD Vets will not post opinions in the sticky thread but may engage in separate un-stickied comments if they wish to add their opinion to the thread.\n* DD Vets may choose to include links to related work or material in the sticky of any post (regardless of flair) to build upon the post and increase engagement in the discussion.\n\n&#x200B;\n\n*All of the above information can be found in the* [*How We Operate Wiki*](https://www.reddit.com/r/DDintoGME/wiki/operation)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/1ocmlg8pgmt61.png?width=1600&format=png&auto=webp&s=240956aefda2cf0e33fac7d0d6727cc432184234\n\nOur [Content Guidelines](https://www.reddit.com/r/DDintoGME/wiki/contentguidelines) provide you with what's acceptable and unacceptable content for submissions and comments. We urge you to take 2 minutes to go through them, and then another minute to [Read the Rules](https://www.reddit.com/r/DDintoGME/about/rules).\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/k723ip0rgmt61.png?width=1600&format=png&auto=webp&s=a3457722d5f0cb2b68ad51fec2644707f25e2158\n\nBeing an information sub, our flairs are: **Deep Dive / News / Data / Speculation / Discussion / Request /  FUD / Sub-Announcements**\n\nRefer to our [Flair Usage Guide](https://www.reddit.com/r/DDintoGME/wiki/flairs) for more information. You can also *filter posts by flair* through the toolbar feature.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/m3er0sw0j1u61.png?width=1600&format=png&auto=webp&s=10f5177a1bf60b022379de6167c5d9b28eb74818\n\n## Wiki Info, Tools, and Resources\n\nOur [Wiki pages](https://www.reddit.com/r/DDintoGME/wiki/index) provide information about the sub as well as a **plethora of tools and resources** that will be continuously updated and added into.\n\nMake use of the toolbar (or Menu tab on mobile app) for easy access to the Wiki, Resources, Tools, & more.\n\n&#x200B;\n\n## Moderator Team\n\nThe mod team is splitting up the work so that no one gets overloaded. Each member has a designated role: DD Vets, Peacekeepers, Flair & Wiki Managers, and Mod-mail Admins.\n\nWe will be posting a 'Meet the Mod team' submission soon\n\n&#x200B;\n\n## Support Us\n\nIf you support our cause encourage DD authors to repost on our sub and crosspost our submissions elsewhere. If you have any suggestions or criticism [send a message through modmail](https://reddit.com/message/compose?to=r/DDintoGME) and we will get back to you.\n\n&#x200B;\n\n[Official Disclaimer](https://www.reddit.com/r/DDintoGME/wiki/disclaimer)\n\nAll Graphics by u/AzzyAus",
    "title": "Welcome to Dive Deep into $GME - Newcomer's introduction & getting to know this sub",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/DDintoGME/comments/mrqvf1/welcome_to_dive_deep_into_gme_newcomers/"
}