{
    "author": "keenfeed",
    "created_utc": 1627486778.0,
    "distinguished": null,
    "edited": 1627511748.0,
    "id": "otcfrd",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_otcfrd",
    "num_comments": 270,
    "permalink": "/r/Superstonk/comments/otcfrd/the_biggest_lie_ive_ever_heard_is_that_no_one/",
    "score": 7363,
    "selftext": "Hence, Hedge funds don't ever lose on option plays. The recent hype \"dated\" posts made apes lose so much in option trading. Simply don't trade options. \n\nI am not going to start this off by saying \"I am smooth brained Ape with little knowledge blah blah...\" No, I know what I am talking about and this is how the whole story develops: \n\n1. We get so hyped up from certain \"dated\" posts (DD) and we expect the price to shoot up in that specific date.\n2. Market Makers/Hedge Funds create option calls and sell these calls to Apes and make a killing. Apes buy those calls thinking it's a win win for them.\n3. Hedge Funds/MM look at the \"calls\" ratio and see it's very high, because of course Apes think they price will shoot up.\n4. Hedge funds/MM buy \"puts\" against Apes' \"calls\". \n5. Hedge funds/MM or aka \"Shitadel\" direct buy pressure or FOMO, if any, through dark pools and can even short the stock with very small amount of phantom shares.\n6. The price tanks on that \"hyped\" date and Hedge Funds collect tendies from their puts. On the other hand, Apes get frustrated, helpless and powerless. \"BTW that's the psychological war that they have been playing since Jan. They want you to hate the stock and wash your hands from it\".\n7. As you can see, they make money on both ways. Selling new call options to Apes and buying puts on the way down. \n8. Rinse and repeat for the last 6 months and make millions of dollars off Apes.\n\nThat's why I have been saying this since January. Apes will never win this war until they completely stay off options. Don't give them more ammo. Please don't. \n\nFurthermore, Apes need to downvote every hype post with specific \"date\". Or simply ask Mod to add a rule and ban dates. Just hodl, buy the dip whenever you can and wait for RC and his team to do something about this. Be fucking patient. Apes got this. \n\n- Low volume, doesn't matter \n- FTD, doesn't matter \n- Interest rate, doesn't matter \n- TA, doesn't matter \n- Exponential chart, doesn't matter\n- REPO payment, doesn't matter\n- Number of phantom shares, doesn't matter\n- The Ken's ex wife story, doesn't matter \n- s&p 400 or even 500, doesn't matter \n- MACD, doesn't matter \n- Positive Earnings, doesn't matter\n- VWAP crossing, doesn't fucking matter \n- Don't expect SEC or DTCC to do something about this. Apes are dealing with professional criminals who have been doing this for decades. \n\nThe only thing that matters in this fight is RYAN Cohen. RC needs to act and take the matters into his own hands. I am sure he's working tirelessly and has a plan in place to expose the criminals and protect shareholders interest. Also, remember, besides fighting for apes, he's also fighting for his own 9,000,000 million shares and his future.\n\nEdit: the \"we\" in the title refers to \"shareholders\" who are interested in GME, not \"we\" the cult one. Aka, everyone is this sub is a shareholder and we all care about the future of the company. \n\nEdit 1:  9,001,000*\n\n\nEdit 2: RC is well-aware that Apes can make or break his company. At the end of the day, we are the one who buy their products, not Hedge Funds. We already saved the company by buying its underlying stock. But most importantly,  we continue to buy their products. I am sure he will fight to protect those who protected him.",
    "title": "The biggest lie I've ever heard is that \"no one knows where the price of any stock is going\". Well, if Shitadel control 40% of retail orders then you 100% can take the stock in any direction you wish. This is not a free market as they have been telling us. Here is how we can win 👇",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/otcfrd/the_biggest_lie_ive_ever_heard_is_that_no_one/"
}