{
    "author": "Nickel_Bottom",
    "created_utc": 1627246948.0,
    "distinguished": null,
    "edited": 1627271834.0,
    "id": "orjxfg",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_orjxfg",
    "num_comments": 76,
    "permalink": "/r/DDintoGME/comments/orjxfg/there_is_so_much_fucky_shit_going_on_what_seems/",
    "score": 580,
    "selftext": "How to see this for yourself:\n\nGo to google in a private browser (to avoid personalized results) and search \"GameStop\", then click the \"News\" tab. Now click \"Tools\" and click \"Sorted By Relevance\", then switch it to \"Sorted By Date\"\n\nOr just look at this [screenshot.](https://i.imgur.com/KRniqMv.png) I did this same search for a few companies and tickers.\n\nExploring further, these articles are posted by an \"Alex Lowe\", and at least some of them are word for word [reposts from reuters](https://i.imgur.com/aUzaSux.png) and other news sources from earlier in the year. Look at the bottom left corner - January 29th. Now look to the right of the author's name - July 25th, today.\n\nSo - who is [Alex Lowe?](https://i.imgur.com/M13Q3nR.png) Well, he claims to have worked for Bloomberg as a financial journalist, so let's head over there.\n\n[So...](https://i.imgur.com/QzwXvNg.png) he's either someone that died in 1999, or he's [this other person](https://i.imgur.com/XOT88Gb.png) that has a profile on Bloomberg - who, I may note, is NOT a financial journalist.\n\nLooking a little further by searching for Alex Lowe + JRK Property Holdings brought me to [this guy](https://i.imgur.com/CHlSUBF.png) - who seems to match the profile on Bloomberg, but is almost definitely not the same person as the picture on Fintech. Odd little coincidence - this Alex Lowe is a former Real Estate Analyst for Blackrock.\n\nWhat about if I check the twitter or facebook links at the bottom of the [Fintech page?](https://i.imgur.com/M8VhoE0.png)\n\nSo in summary: This website, Fintech Zoom, seems to love nothing more than to post negative articles about GameStop exclusively. Well surely someone on reddit has already talked about it, [right?](https://i.imgur.com/pqfCVUK.png)\n\nOh.\n\nNot financial advice. Please double check my results. This is about the extent my knowledge can take me, if anyone else can prove me wrong, I'd love it. \n\nRemember, even if this Alex Lowe at Fintech isn't a real person - no brigading and no harassment. I can't think of a single good reason I can't find more information about this supposed financial journalist, but maybe I'm missing something.\n\nEdit: Discovered by /u/st0nkaway in the comments below\n\n> Did Google image search on the author photo of “Alex Lowe” showing on the articles. Found this guy named “Richard Lowe” … who is a Mediation teacher? https://sensoryawareness.org/sensory-awareness-psychotherapy-and-mindfulness/ / wondering if he’s aware that his photo is being used for shill spam …\n> \n> Digging down further: another “article” on Fintech Zoom is written by a “James Albert”: https://fintechzoom.com/fintech_news_author/james/\n> \n> Google image search reveals his name is actually “JR Smith” on his Linkedin: https://www.linkedin.com/in/jr-smith-a54aab1ba\n> \n> Tl;dr: Fintechzoom steals photos from random people on the web, changes their names, invents backstories for them and slaps them onto shitty bot spam.\n\nEdit 2: /u/akareil thinks this could be just a botted Google Adwords website\n\n> Yes, there is possibly pump and dump but these sites are generally set up to take advantage of ad payments from Google. They are a blight but they aren't specifically targeting GameStop. Just have another look at the space sub you referenced and all the MSM sites listed. They are in it for ad revenue.\n\n/u/karlallan found a muckrack profile for someone by the same name, but the Fintech Zoom articles listed have been deleted. Clicking them gives a 404\n\n> I can’t see the screenshot, but a quick Google search turned up articles by a financial reporter named Alex Lowe, https://muckrack.com/alex-lowe-3\n\nThe writer for the other article, posted on Mondaq.com, is clearly a different Alex Lowe who is also not a financial journalist.\n\n>  Alex is a senior lawyer specialising in employment law. He helps private sector businesses, typically mid-market owner-managed businesses, address and resolve human resources issues and concerns. Alex has a a particular focus on human resources issues arising out of the insurance sector. He qualified as a solicitor in October 2009.\n\nEdit 3: /u/let_it_bernnn found this:\n\n> Fintech Zoom has the category 11-50 employees on LinkedIn with only 4 confirmed employees on their page. Their founder is listed as CEO of some other financial companies, the one I looked at he was CEO and the only employee. Whole thing is suspect\n\n> https://www.linkedin.com/company/fintech-zoom\n\nMy findings regarding that.\n\n>Interesting. Pedro Paulo, the \"CEO\" is standing in front of a wall that says \"Gatewit.\"\n\n>Check this out: https://www.trustpilot.com/users/5e4c297d7168c0433d4e8cdd (this was also pointed out by /u/st0nkaway below)\n\n>This is the only person that has given positive reviews to Fintech. They have also given a positive review to Gatewit. The Gatewit website is no longer active and I can't pull up a version from the WayBack Machine.\n\nEdit 4: While looking into the people on LinkedIn, I found out [this profile pic was likely stolen](https://i.imgur.com/GsxdHql.png):\n\n> I used reverse image search - John Martin (https://www.linkedin.com/in/john-martin-1042b0170/?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACifU5QBqqUnz8dr5y_2ZTO141i_B0mwDGY), \"VP of Sales na Fintech Zoom\" stole this guy's picture:\n\n> https://www.uic.es/en/noticia/dr-vicenc-sarrablo-new-full-professor-uic-barcelona-school-architecture",
    "title": "There is so much fucky shit going on - what seems to be a bot website is posting misinformation and reposts about GameStop and it's flooding the News tab on Google",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/orjxfg/there_is_so_much_fucky_shit_going_on_what_seems/"
}