{
    "author": "dlauer",
    "created_utc": 1621971757.0,
    "distinguished": null,
    "edited": 1621975792.0,
    "id": "nky8jv",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_nky8jv",
    "num_comments": 823,
    "permalink": "/r/Superstonk/comments/nky8jv/thoughts_on_price/",
    "score": 13820,
    "selftext": "I'm not about to talk about what price I think is a \"floor\" or make any kind of price prediction whatsoever, because I honestly don't think anyone knows what's going to happen here. I am not a financial advisor and this is in no way financial advice. But I've been asked many times why I bought some $GME, and wanted to write down my thoughts. Besides the fact that I wanted some skin in the game as I engage here with all of you, there is another reason. The initial gamma squeeze back in January was massive, and had all the hallmarks of a flash crash - until it repeated itself a couple of days later:\n\n&#x200B;\n\nhttps://preview.redd.it/5rvznty0kb171.png?width=1004&format=png&auto=webp&s=4e5c5b12abeab83ef853067c84656ce3643f17c1\n\nWhen I saw that, and then saw it go back up to the mid $200s in March, I saw something that looked very familiar. I am a strong believer that flash crashes and other extreme moves actually have information within them. And I have often seen them act as magnets for price. They might appear to be flukes or weird occurrences, but I've seen the price come back to them too many times to dismiss them. So seeing GME trading at $138.80, it seemed like a no-brainer to [jump in](https://www.reddit.com/r/Superstonk/comments/naoqr9/bought_some_gme_yesterday/).\n\nWill it hit those levels from January? I wouldn't be surprised, but I don't claim to know. Will there be a MOASS that takes it to levels no stock has ever seen before? Again, I have no great insight on this. I think that anything is possible and if the DD and theories around naked shorting and FTDs are correct, then we're in for a hell of ride.\n\nThis is a very unique confluence of conditions, and I want to see how it plays out - and hopefully make some money in the process. I'll never tell you to buy a stock, and I'll always urge you to only invest what you can stand to lose. But so far the ride has been fun, and I can't wait to see how this all shakes out.\n\nEdit: For clarity around my thoughts.\n\nEdit 2: **tldr; I like the stock.**",
    "title": "Thoughts on Price",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nky8jv/thoughts_on_price/"
}