{
    "author": "redchessqueen99",
    "created_utc": 1624668371.0,
    "distinguished": null,
    "edited": 1624872692.0,
    "id": "o80eky",
    "text_only": true,
    "flair_text": "🙌💎 Red Seal of Stonkiness 💎🙌",
    "name": "t3_o80eky",
    "num_comments": 1754,
    "permalink": "/r/Superstonk/comments/o80eky/no_brigading/",
    "score": 14119,
    "selftext": "It has become an increasingly problematic situation for r/Superstonk and our nearly 500,000 members that some individuals are repeatedly harassing other subreddits. As moderators, we have declared a zero tolerance policy for brigading and have mentioned this multiple times in our daily news posts, as well as on YouTube and Twitter, so as to reach as many of you as possible.\n\n# Automod Change - No Subreddit Mentions\n\nNonetheless, the problem has persisted. Several moderators from other subs have supposedly reported this to Reddit admins, and we have now received messaging from Reddit admins about this very topic, and the following has been forcibility added to our automod code:\n\n    #do not remove per admins\n    \n        title+body (regex, includes): ['\\br/ ?(?!superstonk)\\S+']\n        action: remove\n        action_reason: \"links to other communities {{match}}\"\n    \n    #do not remove per admins \n    \n        title (includes): [\"r/\"]\n        action: remove \n        action_reason: \"call outs of other communities {{match}}\"\n\nAlso, I have added the following words to automod for instant removal: **gme\\_meltdown**, **melvincapitallove**, **wallstreetbets**, **amcstock**, **WSB**, and **AMC**. This list will be adjusted as necessary in regards to preventing discussion of other subs, in accordance with Reddit Admins.\n\n# No Tolerance for Brigading\n\nBrigading can include the following:\n\n* Vote manipulation of other subs' content, either positively or negatively\n* Harassing other subs' posts and comment threads with pro-r/Superstonk content\n* Making posts on this subreddit about other subs and their members\n* Organizing in any way to influence other subs one way or another\n* Posting negative comments or posts on r/Superstonk itself\n* Posting screenshots of posts from other subs\n\nWe understand that there are many issues coming from other subs. I will not name those issues because of the new Reddit automod rule that says we cannot discuss those subs. But many of us have felt defensive in this regard. I kindly ask all of you to stay focused on r/Superstonk, the stock we all love $GME, and issues of the financial world, and not those of the reddit world. As of today, you can no longer discuss other subs on this subreddit.\n\n**We have also DISABLED CROSSPOSTING for the foreseeable future, so as to not include other subreddits in any way.**\n\nPlease note that we cannot enforce these rules off of Reddit, such as on Twitter, Discord, or YouTube, unless it is by means of our own individual accounts. However, we do discourage making this a big issue on other social media, because that could also be used against us.\n\n# No Brigading Rule\n\nWe have also added a new rule that will be used to remove content and potentially BAN users for this behavior:\n\n>Under NO circumstances, will brigading be tolerated on this subreddit or any other. Individuals who are discovered to be participating in this, risk being permanently banned for this reason.  \n>  \n>Brigading includes:  \n>  \n>\\- organized voting on other subs  \n>  \n>\\- harassing other subs  \n>  \n>\\- using r/Superstonk to defame other subs  \n>  \n>\\- sharing screenshots from other subs  \n>  \n>Additionally, Reddit Admins have placed an irremovable code into our automod that prevents linking other subs entirely.\n\nIf you violate this rule, you will be considered an instigator in directly attempting to take down r/Superstonk, and we will respond as intensely as can so as to prevent that circumstance.\n\n# Additional Measures\n\nWe are currently exploring additional measures on how to comply with Reddit Admins' anti-brigading rules, and that may include increasing karma/age limits considerably as well as bringing in considerably more moderators that we trust and can rely on to properly moderate the sub. We are making these changes due to outside parties reporting us for facilitating brigading and also due to Reddit admins contacting us directly in a very concerning manner.\n\nIf you see brigading, please discourage it as intensely as you can. We do not allow this, and it is a bannable offense. We hope to comply entirely with Reddit Admins' requests, as that is the platform we are on. We need to comply with Reddit rules above all else. Thank you.\n\n# Edit: Automod Code for Other Subs\n\nI have also created an automod code that can be easily copy/pasted into other subreddits' automod, which will effectively block crossposts from r/Superstonk. I just tested it and it works great! If other subs are truly having issues with our members crossposting into their subs, they can use this to block us:\n\n    ---\n    \n    # SUPERSTONK GTFO\n    \n    type: crosspost submission\n    crosspost_subreddit:\n        name: [\"Superstonk\"]\n    action: remove\n    message: |\n        We don' like yer kind 'roun 'ere.\n    \n    ---\n\nAs of current, our automod and rules are updated to be strict against brigading, limiting certain words and references to other subs, and all crossposting is disabled. I am unsure personally how to prevent this further, so here is code that other subs can use to block specific words and mentions:\n\n    ---\n    \n    # I DONT LIKE THE STOCK\n    \n    title+body (regex): [\"GME\", \"$GME\", \"to the moon\", \"paperhand\"]\n    author:\n        is_moderator: false\n    action: remove\n    message: |\n        We don't like the stock, but we haven't read enough DD.\n    \n    ---\n\nHopefully now it can be evidently clear that we are making zero efforts to Brigade other subs, and are now actively bolstering their capabilities against us. I am confident r/Superstonk will nonetheless grow and continue to unearth the truths of the real market due to GameStop stock and research around it. I like the stock. I love the company. CAN'T STOP; WON'T STOP.",
    "title": "NO BRIGADING",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o80eky/no_brigading/"
}