{
    "author": "anonfthehfs",
    "created_utc": 1624104280.0,
    "distinguished": null,
    "edited": 1624112273.0,
    "id": "o3ejbo",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o3ejbo",
    "num_comments": 246,
    "permalink": "/r/Superstonk/comments/o3ejbo/the_endgame_is_inevitable_if_people_continue_to/",
    "score": 4435,
    "selftext": "# \n\n[Moon, we are coming soon....](https://preview.redd.it/36zu6q2aq7671.jpg?width=1080&format=pjpg&auto=webp&s=8d951593adfaf25f9fdd29e09ba26f2e696fd4f9)\n\n# Dear Apes,\n\n&#x200B;\n\nI'm writing because I've been Zen for a while now.  Short Hedgies know they are fucked but they will continue to fight until Marge comes.  In the meantime, GameStop went from a $2.88 target of short hedge funds just last year to the greatest turnaround in the history of the market.\n\n&#x200B;\n\n&#x200B;\n\nLet me explain.  Don't worry about SHF (Short Hedge Fund) kicking the can down the road.  Seriously, each time it gets harder to do and most costly.  They are stuck.  They can't tank the price or apes buy more, making the problem even worse. They can't cover because they no longer have enough money and it will bankrupt them.  They can't lie to Apes through Main Street Media anymore, they can't trick Apes with fake short interest % or numbers, like a hydra they could shut down this sub tomorrow and 10 will shoot up in it's places.  They can shut down Reddit but Apes will regroup other place.  Imagine that feeling.  No matter what they do, they lose if Apes can HODL strong.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**Apes own multiple floats at this point.  GME has grown to such a problem they are telling the MSM to ignore it.  They won't even speak about GameStop unless it's negative.**  **That's what GME has become, the elephant in the room about to crush people.**  You see, I think they have between 90 million to 500 million counterfeit shares floating around at it's peak.  Regardless, let's pretend the numbers are smaller.  Let's say they have to buy back 25 million shares from Apes = Hedgies R Fuked.  **You have seen what just like a couple hundred thousand shares of actual buying pressure does to the stock.  Now imagine millions needed to be bought back all at the same time.**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nOk, what happens if they allow this to continue.  This isn't FUD but a thought experiment.  Let's just say that GameStop will continue business as usual.  Each proxy, runs the risk of exposing how bad this has gotten.  Each ATM raises billions of dollars more for GME to acquire other more profitable gaming companies.  Good acquisitions mean more institutional buyers and remember, they have MILLIONs more shares to buy back so share dilution isn't really a thing.   Those long whales buys can't be hidden in the Dark Pools and OTCs.  That buying pressure sends the stocks up....Boom Marge calls.  This loops continues, until GME is now in the S&P 500 and on every major ETF.  If Marge hadn't been called, she will be then.\n\n&#x200B;\n\n**Do you see the problem?  Short Hedge funds literally can't win no matter what happens.**  They needed GameStop to go bankrupt.   It's not.  They need the price lower so they can close without going bankrupt, it's not.  If the price drops Apes will make the problem 100X worse by buying even more.  Whether it MOASSes tomorrow or they keep kicking the can through some illegal shit, they are still fucked.\n\n&#x200B;\n\n&#x200B;\n\nAll this is possible by Buying & HODLing your stock like a normal long investor because you like the stock.\n\nGame Over, see ya on the moon!!",
    "title": "The endgame is inevitable, if people continue to buy and HODL GameStop, it can't be stopped. Every institutional investor could sell their stocks and GME would just be bought up by Apes over time. They will continue raising money through ATM's and have billions to acquire profitable companies.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o3ejbo/the_endgame_is_inevitable_if_people_continue_to/"
}