{
    "author": "Broviet_v2",
    "created_utc": 1624158676.0,
    "distinguished": null,
    "edited": 1624159463.0,
    "id": "o3w9dj",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o3w9dj",
    "num_comments": 401,
    "permalink": "/r/Superstonk/comments/o3w9dj/what_comes_next_is_terrifying_but_there_is_no/",
    "score": 3945,
    "selftext": "\"**Try to separate a man from his soul. You'll only strengthen him, and lose your own.\"**\n\n&#x200B;\n\nHello once again, my beautiful dipshits! I find myself in a type-y mood this evening, so I might as well put it towards a bit more confirmation bias. But this wont be all feel-good vibes. I've gotta hit you with some realness as well, and I hope you'll be receptive to it. But first, a little more of that yeezus juice for your veins:\n\n&#x200B;\n\nYou aren't market manipulators, gamblers, a \"cult\", or any other form of bullshit MSM or the shorts would have you believe. In fact, they're all holding back smirks as they try to paint you as the culprit when they'd do the exact same in your place. In fact, I'll wager one mooned GME share that Melissa Lee and friends are all long on this bitch. You've made arguably the most intelligent single play in market history, followed closely by the shorting of the British pound. And it fucking infuriates them. You little plebs from all walks of life, with your imperfect information, your memes, and....ugh, your HOPE. Disgusting.\n\nHow could you possibly have found, understood, and capitalized on a decade's worth of education in a matter of months? How could you be holding through the wildest swings and the most extensive fraud the market has ever seen, defying \"economic fundamentals\" the whole way? As popular as behavioral economics have become in recent years, this is still unprecedented behavior. What good is buying \"one more day\" when the end result will ALWAYS be the same? How is it possible that NOTHING has an effect on diamond hands?!?!\n\n&#x200B;\n\nThey've never understood, and never will. They haven't been through what you have. To them, the American Dream is still very much alive. How couldn't it be, when it was handed to them on a silver platter at birth? It takes a special kind of idiot to shirk your birthright, your easy path to easy paydays. To allow the shame and regret of what you're a part of wash over you completely and drive you down another path, rather than bottling it up and hoping it doesn't eventually kill you.\n\n\\*waves\\*\n\nTo John Q Public, the American Dream is dead, and has been for some time. As I've said before, the proletariat is only complacent until they're not. History doesn't repeat itself, but it does rhyme. This boom/bust cycle has become steadily and steadily more egregious and offensive each iteration. And as wonderful wrinkly fuckers like /u/dlauer, /u/criand, and /u/atobitt have pointed out, this situation runs SO much deeper than just Gamestop, just \"meme stocks\", just individual stocks. This has pervaded every dark nook and cranny of the global economy, but especially here in the U.S. And for the first time in history, technology (as obscured as what we have access to is) is allowing us to expose it in real time.\n\nYou'll see a lot of people pointing to '08, Overstock, or recent examples of FTDs being dragged out ad infinitum. And even though grandfathering was abolished after the Overstock situation, with the promise that it would never happen again, who knows what shorties might try this time around? They have access to all these tools and tricks and fuckery we don't, right? Well, yeah, but as many others have pointed out, there are simply too many eyes on this now. Everything they do or try is exposed here and on other social media platforms within hours. And yes, it would be the ultimate \"fuck you\", the ultimate kick in the balls, the ultimate sign to retail from around the globe to NEVER touch our markets ever again.\n\nBut, believe it or not, the problems for our nation and our government run a lot deeper than just that.\n\nGME is just the tip of the iceberg. Don't get me wrong, it's a WONDERFUL tip. I can't think of a better example of fundamentals winning out over fuckery. Unlike a certain popcorn stock, there are wonderful, trustworthy, customer-focused professionals at the helm. Our Goliath nation has been holding open auditions for the role of David for quite some time now, and Ryan Cohen couldn't be a better candidate. However, as I've always urged, when you're talking about the likelihood of a scenario happening, you can't ever view that scenario in a vacuum.\n\n&#x200B;\n\n**What's Coming**\n\nAgain, as the posters I listed above have pointed out extensively and thoroughly, what we're headed for is scary. Terrifying, even. We will see \"the worst economic fallout since the Great Depression, and possibly even worse\" (quote courtesy of Broviet Sr.). One is forced to consider the ramifications of letting (or even incentivizing) this to happen, versus what stands to be lost.\n\nGiven the depth of the fuckery afoot in all corners of the market, GME will truly be a drop in the bucket, even if they're paying out millions+ per share. There's more toxic bullshit being traded back and forth than you could shake a stick at. The coming crash is undoubtedly going to disenfranchise and destroy millions of lives. '08 on PCP. Global devastation. So why, with all the other dogshit positions that must be addressed, would they care about making sure the lil ol' Gamestop rocket goes off as it should?\n\nJust ponder, for a moment, what a monumental pain in the dick it has been to pass just a couple measly stimmies. And even when we do manage to get them approved, they're for a paltry amount of money that does almost nothing to save the average drowning citizen. Yet since they are available to every citizen, even a paltry sum like 1200 bucks adds up to a massive payout.\n\nA GME mooning would cost the market and the FED the equivalent of a few stimmies. The difference is how that money would be appropriated. First, as has been discussed, the federal and state governments will get back half that can immediately be put to use staving off the disaster that is headed our way. But you have to look beyond just that. If you give a 1200 dollar stimmy to an apartment complex full of people...congrats, you've saved them a month of rent. If you give a GME hodler 50 million dollars, he can buy the damn apartment complex and turn it into a homeless shelter or soup kitchen, etc.\n\nThe consolidation of tendies isn't inherently evil. It's only evil when consolidated by evil people. Any behavioral economist worth his salt could spend a week on Superstonk and tell you that, from a utilitarian perspective, allowing this squeeze to happen (and even forcing it to) is the absolute best thing that could be done for the average global citizen, given the fallout that's coming. This play not only gives the government a ton of cash to play with to address widespread economic distress, but apes will be helping them every step of the way.\n\nThe alternative? Well, that's....much darker. You'd be talking about hundreds of thousands, if not millions, of disenfranchised, homeless, dead. And if that happens, Occupy Wall Street would be choosing a much less friendly verb this time around.\n\n&#x200B;\n\n&#x200B;\n\n**TLDR: I'm not sure how many of you even realize this, but your behavior is indeed \"hyper-rational\". People always talk about \"not investing money you can't afford to lose\". Well, when the alternative is losing the shirt off your back anyways, you tend to give far less fucks about that few grand you dumped into the one play that might save your family's lives. There is less than nothing that they can do to force you to paper-hand. It could drop to 20 dollars on Monday, and I'd have not a shadow of a doubt in my mind that 99% of you would be gripping and ripping right back to the promise land. There's nothing that can be done, and they're running out of time. All digging the hole deeper does is widen the prospects of what we can do for our countrymen (no matter where on Earth you are) once the MOASS does hit.  The government/SEC may not choose to fuck Wall St outright, but if they've any sense at all, they certainly won't be stepping in on their behalf. It's okay to be \"tired\" or \"scared\". But you know damn well you ain't selling until you see a stupid number 😈**\n\n&#x200B;\n\n**STLDR: \"I'm just bout that action, boss.\" -Marshawn Lynch**\n\n&#x200B;\n\n🙌💎🚀❤❤❤",
    "title": "What comes next is terrifying, but there is no fear. No uncertainty. No doubt. You've already won. But will you make it count? 🙌💎🚀❤",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o3w9dj/what_comes_next_is_terrifying_but_there_is_no/"
}