{
    "author": "Specimen_7",
    "created_utc": 1627061854.0,
    "distinguished": null,
    "edited": 1627062349.0,
    "id": "oq7eir",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oq7eir",
    "num_comments": 60,
    "permalink": "/r/Superstonk/comments/oq7eir/have_you_heard_of_d1_capital_partners_an/",
    "score": 1213,
    "selftext": "I commented this in the daily thread but since someone else said they hadn't heard of D1 either, I figured I'd make a new thread about it which will probably get lost here but oh well.  \n\n**TLDR: I'm just rambling about the 13F's from one firm (D1 Capital Partners) who (1) I hadn't heard of before, and (2) lost over $4b shorting GME.**  \n\nThis is kinda interesting...so I read the thread about Point72 backing a company called Wata Games. The article I read also mentioned that earlier this year, Cohen Private Ventures, LLC was part of an investor group (with Turner and D1 Capital Partners) that acquired another similar company called Collectors Universe. I hadn't heard of D1 Capital Partners before so I did a little research (emphasis on little).   \n\nSide note - Cohen Private Ventures, LLC is run by Andrew B. Cohen, who acts on behalf of Steven Cohen. From P72 website...  \n\n>Andrew B. Cohen is the Chief Investment Officer and Co-Founder of Cohen Private Ventures which invests long-term capital, primarily in direct private investments and other opportunistic transactions, and manages family office activities, **on behalf of Steven A. Cohen**.  \n\nAnyways, back on topic.  \n\n**D1 Capital Partners** had $21.2b in their 13F @ the end of 2020. **They reported losing $4b in the first quarter just from shorting GME**, and then reports say they gained back 90% of that loss by April 2021.   \n\n- Their 13F for the period ending 3/30/2021 (so this covers the 'by April 2021' part) says its total value was $13.5b.  \n \n- So pre-squeeze, they had $21.2b in 13F, and at the end of March, they had $13.5b in the 13F, a decrease of ~$7.7b (~36%) over the 3-month quarter. So outside of their GME losses during that quarter, which they claimed was $4b, their 13F also declined in value by another $3.7b.     \n\n- *Interestingly, their ADV from 3/30/2021 says they had $33.9b AUM, so about $20b of assets they manage were from things outside their 13F filings (cough convertible bonds). The ADV also says that $18.4b of the $33.9b AUM (~54%) are from clients who are non-US persons, fun fun!*\n\n- Then they said they apparently earned 90% of the GME losses back. We'll see at the next filing I guess, but at the actual quarter-end (3/30/2021), they were still down an overall 36% from their 13F investments compared to the beginning of the year, but they had the media report (in vague language at that) that they gained back 90% of losses.   \n\nSide note 2 - GME never appears in any of their 13F's :)   \n\nThis is the description of D1's investment strategy:  \n\n>Regarding the public markets, the firm invests in publicly traded equities and other related securities such as **equity derivatives and convertible bonds**. It utilizes a global Long/short equity strategy with a focus on medium to long-term returns.  \n\nThe interesting thing here to me is that they say they not only invest in publicly traded equities but also **equity derivatives and convertible bonds**. I was wondering what their strategy for equity derivatives was, so I wanted to look at their filings and see what options they had invested in over the years. If you look at their 13F filings on SEC Edgar since D1 began, *only ONE filing has ever had anything other than straight-up stocks being reported in it*.  \n\n- The one and only 13F filing of theirs that had anything other than stocks was the first one, which was for the quarter ending 12/31/2018. The only options they ever reported in their 13F was 1.3m call options in Alibaba. So they went into 2019 with 2.0m shares of Alibaba and 1.3m call options for it.  \n\n- The next 13F they filed for the quarter ending 3/31/2019 had ZERO shares and options for Alibaba. Everything they had in Alibaba was gone by 3/31/2019.     \n\n- Guess what, in the next 13F they filed for the quarter ending 6/30/2019, they reported having 4.2m shares of Alibaba, and no options at all.   \n\nSo they went from having 2.0m shares and 1.3m call options at 12/31/2018, to 0 shares and 0 call options by 3/31/2019, and then back up to having 4.2m shares by 6/30/2019.   \n\n- If you check out the stock price movement over that period of time, it was at ~$180 per share at the end of 2018. Then during the next quarter (so the quarter they sold EVERYTHING Alibaba related) it peaked at $205 in January and hit $200 again in mid-March. Then during the next quarter (so the quarter they went from 0 shares to 4.2m shares) it dropped to a low of ~$165 in April.  **They made a lot of money on the ONLY option they EVER reported in their 13F's**. I'm not saying they had any inside information, but going from 3.3m worth of shares (in shares and options) to 0 to 4.2m in less than 6 months is an interesting strategy. And Cohen is known for his insider information.  \n\nMy sources were limited as I mainly just pulled from official filings:  \n\n[A link to SEC Edgar for all of their 13F's.](https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&CIK=0001747057&type=13F&dateb=&owner=exclude&count=40&search_text=)  \n\n[A link to the article about P72 investing in Wata Games, which started me down the D1 path.](https://www.businesswire.com/news/home/20210714005598/en/Collectors-Universe-Expands-Into-Video-Game-Authentication-Grading-with-Acquisition-of-Wata-Games)  \n\n[A link to Point72 website talking about Andrew B. Cohen.](https://www.point72.com/leadership/andrew-cohen/)  \n\n[A link to an article (Bloomberg paywall unfortunately) about their $4b loss from shorting GME.](https://www.bloomberg.com/news/articles/2021-01-28/dan-sundheim-s-20-billion-d1-capital-loses-about-20-this-month)  \n\n[A link to an article (Bloomberg paywall unfortunately) about them recouping their losses.](https://www.bloomberg.com/news/articles/2021-04-21/dan-sundheim-s-d1-shakes-off-its-4-billion-reddit-fueled-fiasco)",
    "title": "Have you heard of D1 Capital Partners, an investment firm that lost over $4b shorting GME?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oq7eir/have_you_heard_of_d1_capital_partners_an/"
}