{
    "author": "HomeDepotHank69",
    "created_utc": 1627083796.0,
    "distinguished": null,
    "edited": false,
    "id": "oqeggr",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oqeggr",
    "num_comments": 172,
    "permalink": "/r/Superstonk/comments/oqeggr/investigating_gmes_preearnings_parabolas_sexual/",
    "score": 4338,
    "selftext": "**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* I am not a financial advisor, this is not financial advice \\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\nSALUTATIONS\n\nMany of you probably saw [that I recently posed a question](https://www.reddit.com/r/Superstonk/comments/oq6uq7/uhhhhhh_why_has_no_one_talked_about_this/) about how it seems odd that both of the $350 price spikes occurred right before earnings. Thankfully, I'm not as retarded as I assumed and not many people have talked about this, so I decided to do some digging myself. \n\nhttps://preview.redd.it/jd8px4i4t1d71.png?width=770&format=png&auto=webp&s=89b3d728010502cb35e171c160e83035d4917a88\n\n**Just how pervasive is this trend?** \n\nhttps://preview.redd.it/d51l5727l1d71.png?width=1324&format=png&auto=webp&s=85ac78a900833b636f5448ebe7c0f7a552d30044\n\nHere's the first two instances I was talking about. Pretty obvious. There's a run up right before earnings. Then, the stock fucking plummets. Interestingly, it does not close at or near the $350 level right before earnings, it has always fallen from this level before earnings. What's even stranger is the fact that volume between these two runs is night and day. The first one had some pretty zesty volume, while this previous run up was drier than my wife when her boyfriend isn't around (bitch!). Obviously, that's probably because buy volume is being suppressed due to dark pools but you get the point. Additionally, GME's earnings haven't even been that bad. No, they were not good (and you are lying to yourself if you think they were) but were they bad enough to justify the stock falling by almost 50% each time? Not even close! \n\n&#x200B;\n\n**Ok Hank, way to point out the obvious, is there any more to this?**\n\nUhhhhhh huhhhhhhhhh. \n\nhttps://preview.redd.it/kylob7l0m1d71.png?width=1032&format=png&auto=webp&s=eb820e17b2087746b30a624f2a8879ec80607a92\n\nIf we go back to before the original squeeze, we can see that this pattern repeats itself - an earnings parabola. What's also interesting is that GME announced their ATM offerings during these parabola periods. I'm not sure if there's any significance to this because they did these offerings well after the peak of price and volume but who knows, maybe there's something there (also interesting that they didn't do an offering during the original squeeze). \n\n&#x200B;\n\n**Ok Hank, maybe that's just how the stock trades?** \n\nhttps://preview.redd.it/1kydalycm1d71.png?width=2206&format=png&auto=webp&s=a7240f460068f3f316169476658d98ae17335cda\n\nNope. If we go back even further, we can see that this has not always been the case for GME. Interestingly, this all seemed to stop right after they discontinued their dividend. Why is that significant? Well, if you're a hedge fund who specializing in ~~shorting~~ eating your own ass, and you hear that a company has discontinued its dividend what does that tell you? It tells you that the company is in poor financial condition (i.e. a perfect short candidate). In fact, the last time GME gave a dividend was March 2019 (the stock was around $11). The stock reached a low of about $3 during this period and did not go back up to $11 until September 2020 (around when GME was really picking up due to DFV and RC). \n\nFinally, notice anything funny about IV (the blue line)? Well, there is a noticeable and substantial increase in IV right after the dividend stopped and the share price plummeted. IV increases when general options activity increases (i.e. more buying and selling of options). It's pretty remarkable that GME's IV has consistently stayed above 100% since about July 2019 (that is absolutely abnormal for a non low-float stock. \n\nhttps://preview.redd.it/rulu1mjmn1d71.png?width=2200&format=png&auto=webp&s=961a30b40d618bb2c255017a68cb22abd411271d\n\n**Seriously Hank, fuck off. It's a well known fact that stocks have earnings run ups**\n\nDing ding ding. You are correct, they do have earnings run ups. \n\nhttps://preview.redd.it/tnp4o8hwo1d71.png?width=2594&format=png&auto=webp&s=363f93f0f30ba9135612400245c68c8a97716ceb\n\nSo, did this just destroy my entire argument and did you just read this post for absolutely nothing? Yes, that's the end of the post, goodbye\n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n. \n\n.\n\n.\n\n.\n\n.\n\n&#x200B;\n\nhttps://preview.redd.it/2785dek6s1d71.png?width=960&format=png&auto=webp&s=53b38eb45c2410d47bc66b5f640b4206a62bc85f\n\n(If just one person falls for that then my job is complete)\n\nYes, stocks often do run up in anticipation of earnings (not always but sometimes). The key, however, is that they usually do not run up to the magnitude of GME and they do not follow GME's pattern. From the research that I've gathered, stocks will run-up anywhere from 10-20% before earnings (sometimes slightly more but usually not much). For example, maybe you're a stock trading at $20 and Wallstreet expects an excellent quarter, so you run up to $22 or $24. That's normal. Look back up at those charts. That's not 10-20%. That's fucking 20-200%. Let me tell you, THAT is not normal. What's even stranger is that most stock run-ups before earnings peak on the day of earnings. Not GME. GME peaks a week or more before earnings and falls massively. That's not normal. \n\n[This is AAPL, not GME](https://preview.redd.it/qodo1drxp1d71.png?width=2218&format=png&auto=webp&s=7006cfcd46745d026ef1f057c1b03b362718502b)\n\nFinally, many of you also probably remember my recent post with the quant apes where they used statistical tests to prove that GME is correlated in price action to the major \"meme stocks.\" That might lead you to think that this is definitely just a HF pump and dump to take advantage of retail investors who are addicted to these stocks. That's definitely a possibility, but I think it's unlikely. After looking at some of the other meme stocks (movies, KOSS, BBBY, BB, etc.), I DID NOT see a similar earnings parabola pattern. Some of them have followed this pattern slightly as of recent but ONLY GME has had this pattern persistently for many years. Moreover, the whole retail investor phenomena wasn't really a thing until early 2020 with covid, so I don't think this is all just an elaborate pump and dump that's been going on for years. \n\n&#x200B;\n\n[Ah yes, every Shawt Hedge Fund's dream girl](https://preview.redd.it/j0g1egrit1d71.png?width=1000&format=png&auto=webp&s=b1ba3c7ea3a770d35bbc8346e3328a19dffd560c)\n\nSo now I've laid out the pattern for you: GME has extraordinarily strange run-ups before earnings. Like really strange. This pattern is unique to GME and volatile meme stocks have only started slightly following it as of recently. I also identified when this weirdness started (and when IV started to increase). Perhaps that marks when the heavy, naked shorts started piling on? Idk. Why do we see these strange earnings parabolas in GME? Again, idk. I have some theories though. Maybe HFs are just playing pump and dumps because they know that earnings attracts more interest. Maybe HFs are doing emergency covering in case there is some crazy announcement at earnings that moons the stock or forces covering. Maybe this is the work of an algo (doubtful). Maybe this has something to do with options expiry. I really couldn't tell you why this is happening. Similar to my previous posts on the FTD cycle, I can't tell you why this is happening but I can lay out the pattern for you and give you some possible explanations. Since I made my first post about the FTD cycle, apes have filled in the holes, answered the \"why?\", and taken that theory beyond what I ever thought it would be. Maybe this will be the same (but then again, I could be finding something from nothing here, so who knows). \n\n*Not sure when I'll see you apes again but I'll leave you with this:*\n\nIt's like DFV said, we'll never see this kind of set up again. GME was just a crazy collision of a bunch of things: a stock that was massively over-shorted (this is probably pretty common but GME seems to have been exceptionally over-shorted), a stock that garnered massive attention from value investors, and...... oh yeah....... some fucking retarded primates who LITERALLY have created a wall of support because they refuse to sell. It's literally the perfect storm. \n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* I am not a financial advisor, this is not financial advice \\*\\*\\*\\*\\*\\*\\*\\*\\*\\***",
    "title": "Investigating GME's pre-earnings parabolas (SEXUAL)",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqeggr/investigating_gmes_preearnings_parabolas_sexual/"
}