{
    "author": "wetdirtkurt",
    "created_utc": 1627063030.0,
    "distinguished": null,
    "edited": 1627072388.0,
    "id": "oq7sni",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oq7sni",
    "num_comments": 70,
    "permalink": "/r/Superstonk/comments/oq7sni/new_dtcnscc_filing_mentions_naked_shorts_hedgies/",
    "score": 2414,
    "selftext": "The filing came out yesterday.\n\n369 (nice) pages long. I read almost everything and summarized it in this video. **Watch the video before reading the below. You will not have context.**\n\n[https://youtu.be/L4eWbGc1cMM](https://youtu.be/L4eWbGc1cMM) \\- PRO TIP: Use the YouTube video speed changer if it is reading too slow for you. Or more likely, too fast.\n\nThe filing - [https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-010.pdf](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-010.pdf)\n\nIn short, these are not market regulations. This is more a \"new service\" that the DTC/NSCC is trying to offer institutions. The things mentioned in this filing make me believe like they are trying to set up a standard operating procedure for the possible event of a MOASS. Specifically, they are trying to \"Safeguard\" institutions and other public investors (us) not to suffer on the event in which multiple hedge funds need to liquidate as their losses become unbearable and they need to cover their shorts by selling their entire portfolio.\n\nRemember Archegos? They lost $20 billion in 2 days and their bet wasn't even GME or the other stock related.\n\n*\"*[*As Bloomberg reported*](https://www.bloomberg.com/news/features/2021-04-08/how-bill-hwang-of-archegos-capital-lost-20-billion-in-two-days)*, Hwang’s portfolio grew to USD100 billion. This would equate to 5x leverage in a cash portfolio. Under US regulations, PBs are allowed to extend credit on a cash portfolio up to 6.6x; i.e. a 15 per cent portfolio margin requirement.\"*\n\n*\"On March 26, 2021, banks offering* [*prime brokerage*](https://en.wikipedia.org/wiki/Prime_brokerage) *services to Archegos started to liquidate billions of dollars' worth of various* [*stocks*](https://en.wikipedia.org/wiki/Stock) *after it had failed to meet a margin call. The stocks were reportedly tied to the total return swaps held by Archegos. This sale was reported to be the cause of a 27% plunge in share price of* [*ViacomCBS*](https://en.wikipedia.org/wiki/ViacomCBS) *and a similar fall in the price of* [*Discovery, Inc.*](https://en.wikipedia.org/wiki/Discovery,_Inc.)[*\\[6\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-jcwsj-6)[*\\[8\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-:0-8)*\"*\n\nJust to add, Bill was begged to sell his position in Viacom as it began to decrease in value suddenly, but refused to listen probably due to his superiority complex. Sounds oddly like the same sentiment that shorts who refuse to cover have, eh?\n\n\"*On March 29, the share price of Credit Suisse was down by 14%, while Nomura Holdings shares declined by 16%.* [*\\[5\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-sfdt-5) *A press release from Credit Suisse said that \"the loss resulting from this exit ... could be highly significant and material to our first quarter results.\"*[*\\[16\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-cs-16) *According to* [*The Wall Street Journal*](https://en.wikipedia.org/wiki/The_Wall_Street_Journal)*, Goldman Sachs and Morgan Stanley were able to limit their losses relating to Archegos by acting more quickly than Credit Suisse and Nomura Holdings.*[*\\[8\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-:0-8) *Other banks, such as* [*Deutsche Bank*](https://en.wikipedia.org/wiki/Deutsche_Bank)*, were able to close their substantial positions quickly and avoid any losses.*[*\\[17\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-17)[*\\[18\\]*](https://en.wikipedia.org/wiki/Archegos_Capital_Management#cite_note-18)*\"*\n\n&#x200B;\n\nhttps://preview.redd.it/aj1j9jxr30d71.png?width=608&format=png&auto=webp&s=f56422651119a55f622b6bcecea9d7df1d91fa25\n\nEven with such a horror story, hedge funds remain ultra leveraged. The DTCC/NSCC probably used Archegos as a case study and saw how these banks pretty much tried fucking each other over to firesell their positions before the others did - which is exactly what this new DTCC/NSCC service is trying to prevent. Implosions of hedge funds like this cause obvious rippling effects across the financial system.\n\nLast number I saw for Melvin was that they were still at a \\~47% loss YTD. That $3 billion dollar injection from Jenny and Stacie is HALF of the capital left in Melvin (12B > 9B > 12B > 6B).\n\nNow imagine 20 Archegos sized hedge funds imploding all at the same time due to various margin calls.\n\nThat isn't even unreasonable to think. [hf-implode.com](https://hf-implode.com) looks like an old website that someone made to track every hedge fund that imploded back in 2007 and 2008. \"We counted 117 major funds at 71 outfits \"imploded\\*\" from the 2007 crash\"\n\n117! No wonder that shit took forever to recover from, everything was literally fucked. I think institutions are getting nervous and want to make sure they get their fucking money if anything goes down.\n\n&#x200B;\n\nAlright that is it. I will be making a follow up video that includes some more details like I mentioned above and some other comments on the filing itself, so make sure you subscribe to my StonkTube.",
    "title": "New DTC/NSCC filing mentions naked shorts, hedgies, fire sales, institutional defaults and even 2008.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oq7sni/new_dtcnscc_filing_mentions_naked_shorts_hedgies/"
}