{
    "author": "FIIKY52",
    "created_utc": 1616374037.0,
    "distinguished": null,
    "edited": 1616417636.0,
    "id": "maapa3",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_maapa3",
    "num_comments": 622,
    "permalink": "/r/GME/comments/maapa3/gme_shorted_shares_cant_vote_in_the_upcoming/",
    "score": 10075,
    "selftext": "Here is a link to a story about last year's meeting.\n\n[https://www.wsj.com/articles/how-investing-giants-gave-away-voting-power-ahead-of-a-shareholder-fight-11591793863](https://www.wsj.com/articles/how-investing-giants-gave-away-voting-power-ahead-of-a-shareholder-fight-11591793863)\n\nIt verifies:\n\n1. Shares are recalled for verification before the meeting.\n2. Recall Notice goes out 60 days prior to meeting; that's April 12 for us.\n3. Shorted Shares can't vote.\n\nIt says that even though Institutional represented 40% of the shares, they only carried 5% of the vote.  That's because the fund manager's had lent out the shares for shorting.  The top three funds were:\n\n1. Blackrock\n2. Vanguard\n3. Fidelity\n\nEveryone NEEDS to read this article to understand what's coming.  You have to be sure you've turned off margin on your $GME shares otherwise, the fund managers will find a way to loan them out.\n\nThis is important because it's our only shot at proving all the naked shorting that's been going on.  When they go out to verify shares, and it comes back as over 100% outstanding, that may be our only proof to kick off an audit of shares.\n\nIf the fund managers loan out YOUR SHARES for shorting, your votes won't count.  If the total comes in under 100%, nothing will happen.  NO LAUNCH!!!\n\nEven if you don't upvote, please, everyone at least read this.\n\n&#x200B;\n\nEDIT1: OK, so I got my wish - a lot of people have read this.  Good.  This isn't meant as FUD.  I found this article last night and it scared the crap out of me so, I shared it.  Hedgies have every advantage on their side.  It seems like if we make one mistake, the reset button gets hit again.  I'm sharing this because I wanted people to be aware they need to be sure their shares can't be loaned out because it isn't clear to me from this article, we couldn't still get screwed.\n\nTo those of you who found this post helpful, thank you.  To those of you who think this was intentional FUD, then screw you.  There's a lot of new apes in here, including me.  If you already know better, good for you.  There's a bunch of us who need this information.",
    "title": "$GME Shorted Shares Can't Vote in the Upcoming Shareholder's Meeting",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/maapa3/gme_shorted_shares_cant_vote_in_the_upcoming/"
}