{
    "author": "The_Basic_Concept",
    "created_utc": 1626206910.0,
    "distinguished": null,
    "edited": 1626227492.0,
    "id": "ojnspx",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ojnspx",
    "num_comments": 249,
    "permalink": "/r/Superstonk/comments/ojnspx/inflation_is_the_catalyst_for_gme_it_will_break/",
    "score": 3250,
    "selftext": "&amp;#x200B;\n\n[I am me?!](https://preview.redd.it/twat99sh91b71.png?width=480&amp;format=png&amp;auto=webp&amp;s=c644e4747b8fcd616d5711ddfbf4dd29f4e853ff)\n\nWho am I? Im just a crayon sniffing almost boomer who has been investing since 2001. \n\nI have loved value plays because generally they fly well below the radar before MSM starts talking about them. GME caught my attention due to the other sub that I may or may not be able to mention, its the one that CNBC Clowns speak of. Ive been long since early December, but have since added multiple times my original position.\n\nWhat is this post about?\n\n&amp;#x200B;\n\n[Wut doing?](https://preview.redd.it/ffy8ly3z91b71.png?width=494&amp;format=png&amp;auto=webp&amp;s=daaafe0181dee4a7d3b09ac5e1d07debf56fa817)\n\nI feel that most of us are pretty well verse in stocks, some well versed in options and futures as well, but there are so many other types of derivatives that are out there that can be used to control the narrative, so I wanted to bring some basic light to these other financial products and speculate on what is going on with our own stock.\n\nThis post will have some of the other products and ill try my best for an ape definition, then I will close it out with my own crayon fueled banana powered speculations.\n\nThere are other investment poducts besides stocks? \n\n&amp;#x200B;\n\n[mind blown](https://preview.redd.it/dgst6skba1b71.png?width=260&amp;format=png&amp;auto=webp&amp;s=20bc94e3a9ad3a169f141bccd35ad8fa1d0fb9fc)\n\nYes we can start with the basics, I won’t include options/futures here since there are many threads/posts explaining them. (Definitions taken from investopedia, google finance, Webull, etrade etc) Ape terms are what I make of them, these are my opinions, might be wrong please correct or share a better way to describe them.\n\n**WTF is an ETF?**\n\nAn ETF is an exchange traded fund, generally speaking its a computer based fund designed to track a sector or an index. \n\nAPE speak: A basket of stocks but with some commonality, if you got oranges, lemons and limes together, all citrus but still a fruit basket.\n\n**WTF is a Mutual Fund?**\n\nMutual fund is similar to an ETF, main difference is that this is managed by a person, usually a person that wants part of your profits to manage it.\n\nAPE speak: Basket of stocks with/without commonality with a sales pitch; green apple basket is better than red apple basket because green means go, and green pays me more so ….\n\n**WTF are Derivatives?**\n\nCalls, puts, futures, contracts, obligations and swaps, anything derived from the underlying security/commodity.\n\nCall, puts and futures are pretty easy to find and understand.\n\n**WTF are SWAPS?**\n\nThere are many many many many many types of this deceiving product, here are a few examples.\n\n**Credit Default Swap(CDS)**: If the underlying asset falls or fails, the default goes up in value.\n\nAPE speak: a fancy PUT for an underlying asset/security\n\n**Interest Rate Swap**: an exchange between parties, one with variable rate interest and one with fixed rate.\n\nAPE speak: Similar to refinancing a variable rate mortgage for a fixed rate one, no risk to really any party, its really there for fancy accounting and tricking banking regulations.\n\n**Currency Swap**: exchanging loan + principal from one currency to another currency\n\nAPE speak: IMO its a way to use loan products to make pennies on the dollar from trading it back and forth, if you do it with a large enough bank, those pennies are now millions of dollars.\n\n**Security/Commodity swap**: Two parties exchanging cash flow derived from the underlying security/commodity.\n\nAPE speak: I want the cash flow but not the risk, I will pay you to take on the risk. \n\n**Total returns swaps**: A total return swap is a swap agreement in which one party makes payments based on a set rate, either fixed or variable, while the other party makes payments based on the return of an underlying asset, which includes both the income it generates and any [capital gains](https://www.investopedia.com/terms/c/capitalgain.asp). In total return swaps, the underlying asset, referred to as the reference asset, is usually an equity index, a basket of loans, or bonds. The asset is owned by the party receiving the set rate payment.\n\nAPE speak: Bank A buys an ETF, Hedge Fond buys the TRS (total return swap), makes payments to Bank A to continue to own this contract, in return the Hedge Fond keeps any capital gains, dividends.\n\n\\--------------------------------------------------------\n\nNow that we have those out of the way, lets talk about banks for a few…..\n\nBanks make money via selling information, financial products, interests, etc. Banks are greedy, when they run out of things to sell they make new products that are more/less the same but just repackaged to be different.\n\nLets go back to 2008 to take a quick look at this. \n\nDuring this time the mortgage backed securities were falsely held up by credit rating agencies and the ignorant and corrupt people in power like Alan Greenspan etc.\n\n“Mortgages and their bonds will not fail, its a sure bet, it will never happen, the MBS market is strong and can survive the failure rate” - 2005-2008 multiple analysts and advisors.\n\nResidential MBS market collapse wouldn’t have been as big as 2008 if the banks were a little less greedy. Basically people like Michael Burry saw an opportunity to make money from the collapse by betting against it, the arrogance of Wall Street took his and others money thinking it would never happen hence free money, they didn’t care that they would have to pay 200:1 on some of the products being sold the knew it wouldn't happen. What crashed the system was the CDS(Credit default swaps) market ballooning to a crazy amount and banks not able to create or secure a net neutral or a net positive position and were eventually unable to pay out.\n\nAPE speak: Wall-street said, why make little when make lot is the same risk? lets write more subprime loans so that we can sell more MBS, when we have more MBS we can sell more CDS on them……. Repeat until crash and get bailed out.\n\n&amp;#x200B;\n\n[its fine meme](https://preview.redd.it/4h35b2ugb1b71.png?width=536&amp;format=png&amp;auto=webp&amp;s=67148df63257f2f7c0d231d6816c742e9e51f46e)\n\nFast forward to a recent past, there is a plethora \n\n&amp;#x200B;\n\n[Plethora 3 amigos](https://preview.redd.it/biovt2rlb1b71.png?width=500&amp;format=png&amp;auto=webp&amp;s=67262ab47bc8eac4e5a306838f98c0e47d57422e)\n\nof businesses already struggling due to various reasons, add in a pandemic that restricts or eliminates disposable income and we have the recipe for that sure fire bet again, especially when these analysts and advisors are suggesting that the pandemic will last a lot longer than it did. Wall Street greed comes in to play again. They want to short everything to make a quick profit off of struggling humans who can barely put food on the table for their families.\n\nGamestop is a dying business model, they will never financially recover from this, no one is buying anything from gamestop and their outdated business model, they will be unable to recover from this pandemic because their bonds will expire before the pandemic does, share target price $0.50/share. - Almost all hedge Fonds 2020 and beyond.\n\nI wonder where we have heard that level of certainty before? Lol\n\nOne last thing I want to mention before I start my speculation,\n\nWTF is a Synthetic ETF?\n\nA synthetic ETF is is a pooled investment that invests money in [derivatives](https://www.investopedia.com/terms/d/derivative.asp) and [swaps](https://www.investopedia.com/terms/s/swap.asp) without the ownership of stocks or ETFs.\n\n&amp;#x200B;\n\n[that thing is real?](https://preview.redd.it/jcsex5med1b71.png?width=640&amp;format=png&amp;auto=webp&amp;s=d38feb9183e5bfa3aa7617fe12277c1f2bfdd428)\n\nYes this is real!!!\n\nSpeculation starts here:\n\nWTF is a Synthetic ETF? (Continued)\n\nAPE speak: I honestly don’t even know how to describe this, while researching this I went down a crazy rabbit hole that drove me crazy. I kept finding these connections that were too obvious, linking these products to citadel etc on the risk side of these and the FED(overnight/reverse repo) and Black rock on the profiting side of these, I have been researching this for a week now and I still don’t have a clear idea on WTF is going on. My best guess is that some of these synthetic ETFs is where our FTDs are, alternatively: the fact that blackrock and the FED have a hand in them leads to me believe that this might be a future bailout collection fund, I honestly don’t know and would love for people to chime in and share their insights. While I was digging for this information I actually came across a YouTube channel (Charles Vids) that has also located these so I know I’m not alone and didn’t stumble by coincidence, I know they are related, just don’t know how yet. \n\nWhere are we now? Well they started shorting legally, eventually ran out of shares to borrow but continued to short because when a company is delisted or closed down, no one cares about the number of shares in FTD. Then January happened and it became public, so they had to find ways to hide their short positions: in comes ways of transferring their shorts to ETFs, Indexes, other financial products.\n\nIMO TRS are the new CDS from 2008. When this market crashes due to inflation probably, the rest of the market will crash with it creating 2008 version 2.\n\nI know the market will crash soon due to inflation, because black rock is buying single family houses. \n\n&amp;#x200B;\n\n[inflation is here](https://preview.redd.it/b0wys4qjd1b71.jpg?width=828&amp;format=pjpg&amp;auto=webp&amp;s=9c2988cf5bf83316f214423fdb4c0b31fdfdf562)\n\n“We see the restart and higher inflation driving up the rental income and a more mutated response to interest rates to rising inflation than in the past supporting real estate valuations”\n\nBlack rock controls over $9 trillion in assets, this is their hedge against inflation and rising interest rates. Black rock is now IMO in the asset protection mode, they know that the stock market will crash soon, they have signaled it in an article here:\n\n[https://www.cnbc.com/2021/07/07/blackrock-downgrades-us-stocks-says-reopening-momentum-is-peaking.html](https://www.cnbc.com/2021/07/07/blackrock-downgrades-us-stocks-says-reopening-momentum-is-peaking.html)\n\nAsset protection is a real strategy for most banks/institutions. \n\nIn bear market or impending crash, the asset protection should/will switch from stocks to bonds and treasuries etc. However, this time is different, since the underlying stocks are doomed to fail the bonds/treasuries linked to said securities are no longer part of asset protection. \n\nSo what does an institution do in this case? Buy houses, a class that is outside of the securities market, protected from inflation, about to boom with more renters when the market crashes and the average person can no longer afford the housing market due to rising interest rates and inflation.\n\n**TL:DR** \n\nIMO the market crash is the catalyst for GME, simply because the market currently is over extended on leverage, which is keeping margin requirements in check and stopping the liquidations from happening. The TRS market is keeping up with the liquidity requirements which is being kept in check by the Over night repo market.\n\nNow if something out of the normal happens, like a crypto dividend, clearing house switch, merger etc then GME can/will moon on its own which will crash the market consequently. Either way the resulting outcome is the same, they are both related due to the nature of Wall Street greed, complicated and purposefully confusing investment products such MBS, CDS, CDO, TRS, etc.\n\nIMO inflation will cause the market wide panic selling, which will elevate margin requirements, which will lead to force closures and liquidations which will create that buying pressure and send GME in to the thousands….\n\nEdit 3: I’m not saying it ends at thousands, I don’t know where it will go, just saying it will start here, no one selling can/will take it higher. \n\nBuckle up, this is just the beginning 🚀🚀🚀🦍🦍🦍🌚🌚🌚\n\n\nEdit 1: this is not financial advice, or advice in general, it’s 1 step above word vomit.\n\nEdit 2: word corrections.\n\n\nEdit 4: as if you need confirmation bias lol\n\nhttps://www.reddit.com/r/Superstonk/comments/ojgmav/for_anyone_interested_there_is_currently_a_risk/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nEdit 5: Inflation\n\nI did a poor job explaining my reasoning for my belief.  \nInflation works by making cost of goods more expensive, reducing your buying power. When things cost more the extra income is no longer there.  While no one will be selling their GME shares, retail may be forced to sell other stuff they own to be able to survive with the high cost of everything. The market currently has a ton of retail investors that may exit the market due to inflation. This pressure will also translate to consumer discretionary sector which will/may bring down the market.  Since a lot of the collateral being used by hedge fonds will also lower in value, the margin calls will result in defaults and liquidations. \nHopefully this helps.",
    "title": "Inflation is the catalyst for GME it will break the system due to over leveraged investment products",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojnspx/inflation_is_the_catalyst_for_gme_it_will_break/"
}