{
    "author": "Blanderson_Snooper",
    "created_utc": 1626187494.0,
    "distinguished": null,
    "edited": 1626560692.0,
    "id": "ojh2eh",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ojh2eh",
    "num_comments": 722,
    "permalink": "/r/Superstonk/comments/ojh2eh/ultimate_wargame_theory_the_beginning_total/",
    "score": 7238,
    "selftext": "I have been working on the Ultimate Wargame Theory for almost two months now. Then today I had an aha moment:\n\n**I think what I’ve learned might explain RRPs and the role of Total Return Swaps (TRS) in the Gamestop saga and the global economic volcano.**\n\nThis wargame short story will also serve as a foundation for what’s to come, because there is a lot to take in. For now, enjoy this theory on RRPs, TRS, and the full extent of what Apes are up against.\n\n**tl;dr:**\n\n1. I explain Total Return Swaps and how they potentially connect Gamestop to Reverse Repos\n2. I open new possibilities for understanding short interest, how the game is played and prolonged, and shed light on new possibilities about the March event and May run-up. I'm hoping our technical DD wizards will take this information and run with it\n3. I explain where the MOASS money comes from\n4. I explain the mechanics behind this financial leviathan, and how it might explain why the market is so overleveraged as well as connect it to the arbitrage profit machine explained in [Where are the Shares](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/)?\n5. I identify nearly 100 hedge funds connected by more than 1,500 securities since 1999, for the first time defining our enemy at its actual scale\n\n[https://preview.redd.it/6oydghxerza71.jpg?width=572&format=pjpg&auto=webp&s=a95ea83a119b8ca9c4d01bfe6f4f9fa1559a64b0](https://preview.redd.it/6oydghxerza71.jpg?width=572&format=pjpg&auto=webp&s=a95ea83a119b8ca9c4d01bfe6f4f9fa1559a64b0)\n\nA huge thanks to all the investigators and DD authors that have helped me make and confirm the connections I've found. There are too many to call out, and I'll link to the work of as many as I can find in these Ultimate Wargame posts. Everything we do here is built off our collective effort to uncover and understand information in a system that makes it very hard to do so. Much love to you all.\n\n\n💎🙌💎💓🦍🚀🚀🌜\n\n**Caveat 1:** Though I've identified patterns and key dates all the way back to 1999, this post is most concerned with the past 3-4 years, when (I believe) the current scheme really got rolling. A lot of these hedge funds opened within that time frame and have very specific new portfolios to track, which can help us understand the current market and media situation. This is not one crime we're tracking, but the latest iteration of a global syndicate that goes back to the late 1970s and really got rolling in the '80s.\n\n**Caveat 2:** As with all Wargame Theories, nothing in this post should be considered an accusation. Every piece of information in this post comes from public SEC records and/or publicly available mainstream sources of information such as Wikipedia, Bloomberg, the Financial Times, etc. Wherever I have to reference hedgie media, they are clearly called out as complicit and not credible. Speculation, where necessary, will be called out as such. This is a narrative pulled together from that public information.\n\n**Caveat 3:** I’m not going to link to bullshit hedgie media, so if I need to I’ll post a screenshot of the article. You can verify that the articles exist with a Google search if you want to do so without giving them a click as well.\n\nAll that said, let’s have some fun.\n\n💎\n\nIn [Hank's Big Bang: Quant Apes Glitch the Simulation](https://www.reddit.com/r/Superstonk/comments/nu9qq9/hanks_big_bang_quant_apes_glitch_the_simulation/), u/homedepothank69 suggested that Total Return Swaps might have something to do with the cycles we are seeing. I decided if it was important enough for Hank to mention it, it was important enough for me to look into.\n\nBeing smoothbrained, I had to go learn what a Total Return Swap was (TRS). I learned everything I know about TRS from Investopedia, so I’ll drop links when I reference something. Otherwise, I’m going to try to ELIA as I go. I’m sure people will correct me if I’m wrong.\n\nI think u/Criand and u/broccaaa will be interested in what I’ve found as well, since it provides additional context for understanding the scope and possibilities available to the shorts.\n\n**What is a Total Return Swap?**\n\nSince it’s fucking up the market and could devastate the global economy, you’ve probably already guessed that it’s a financial derivative. First the definition, then a picture.\n\n[From Investopedia](https://www.investopedia.com/terms/t/totalreturnswap.asp):\n\n>A total return swap is a swap agreement in which one party makes payments based on a set rate, either fixed or variable, while the other party makes payments based on the return of an underlying asset. The underlying asset is usually an equity index, a basket of loans, or bonds. The asset is owned by the party receiving the set rate payment.\n\n* In a total return swap, one party makes payments according to a set rate, while another party makes payments based on the rate of an underlying or reference asset.\n* Total return swaps permit the party receiving the total return to benefit from the reference asset without owning it.\n* The receiving party also collects any income generated by the asset but, in exchange, must pay a set rate over the life of the swap.\n* The receiver assumes systematic and credit risks, whereas the payer assumes no performance risk but takes on the credit exposure the receiver may be subject to.\"\n\nHere's my smoothbrain translation of that into an image.\n\n[https://preview.redd.it/6nnvzlhgrza71.jpg?width=1280&format=pjpg&auto=webp&s=e7de759b71a8013ad6e67a9102c3d1064914011d](https://preview.redd.it/6nnvzlhgrza71.jpg?width=1280&format=pjpg&auto=webp&s=e7de759b71a8013ad6e67a9102c3d1064914011d)\n\nJust a couple of things to know before we get to the meat of things.\n\n1. The **Asset** “is usually an equity index, a basket of loans, or bonds.”\n2. The **Set Rate** is typically a combination of a fixed rate and a variable rate. It’s a bet, after all. The example on Investopedia uses LIBOR, which is very convenient for this theory.\n\n**How Does This Relate to GME? (My Theory)**\n\nI think at some point Kenny hatched a plan to double short his entire portfolio without reporting it *and get paid to do so*.\n\nThe basic plan is this: Kenny bundles a bunch of stocks, including one or more that he believes will go bankrupt, and offers them to banks in a TRS agreement. Kenny gets paid if the Asset remains neutral (perfectly hedged), he gets paid *more* if the Asset depreciates, and he only loses money if the Asset increases more than the set rate. Kenny chooses stocks he can easily manipulate and sets up an algo to keep them balanced against the set rate.\n\nLet’s say the set rate is 2%, like in the Investopedia example. Kenny has basically bought himself a 2% cushion on his hedging, and he knows that he can drop the prices of many of these securities in order to stay net positive on the trade. PFOF helps him immensely with this, in addition to its many other nefarious uses.\n\nOk, so why would the banks take him up on this? Well, for one, the set rate is often based on LIBOR, which had steadily been declining throughout 2019, and then crashed due to COVID-19 economic policies. LIBOR, again from Investopedia is \"a benchmark interest rate at which major global banks lend to one another in the international interbank market for short-term loans.\"\n\n[https://preview.redd.it/9jlugywhrza71.jpg?width=1378&format=pjpg&auto=webp&s=73fd24ee33c3a57c9f5c0ea2053bd53ce84dbf7d](https://preview.redd.it/9jlugywhrza71.jpg?width=1378&format=pjpg&auto=webp&s=73fd24ee33c3a57c9f5c0ea2053bd53ce84dbf7d)\n\nKenny doesn’t care that LIBOR is low, in fact that’s his lure to the banks. They get a cheap set rate against a low-risk Asset, who could refuse?\n\nAlso, LIBOR is notorious for being used in [financial derivatives crimes in the U.S. since at least 1991](https://en.wikipedia.org/wiki/Libor_scandal). Kenny does like to collect and combine scams, doesn't he?\n\nLet’s take a closer look at it from both sides. (EDIT: Before we do, I want to link to [this series of comments that takes issue with my breakdown of TRS](https://www.reddit.com/r/Superstonk/comments/ojh2eh/ultimate_wargame_theory_the_beginning_total/h51wl41?utm_source=share&utm_medium=web2x&context=3). I'm too smooth and tired to figure it out, so for now I'm linking to the comment. If some wrinkles come in and clarify, I'll edit the post to reflect it.)\n\n[https://preview.redd.it/y8shajglrza71.jpg?width=1232&format=pjpg&auto=webp&s=29ed6398d3ffcf5fe8863a604c2a68ea9ab6ac27](https://preview.redd.it/y8shajglrza71.jpg?width=1232&format=pjpg&auto=webp&s=29ed6398d3ffcf5fe8863a604c2a68ea9ab6ac27)\n\n# Citadel (Payer)\n\n* **Owns the Asset (ETF)**\n\nOf course, we know it’s really “owns” the asset, but not very many other people know that, maybe nobody. Certainly not when this scheme was hatched.\n\n&#x200B;\n\n* **Collects income if the Asset depreciates**\n\nWho makes Assets depreciate faster and more reliably than Kenny? Not many people, that’s for sure!\n\n&#x200B;\n\n* **Takes on the receiver’s credit exposure**\n\nNow, normally banks are the ones with the credit exposure. They loan you money, and if you default on that loan the bank is out of luck. However in a TRS, the hedge fund takes on all the Asset’s risk. In this case, banks can bet on the long-term growth of the market against an already-hedged instrument from one of the most “solid” hedge funds around.\n\n&#x200B;\n\n* **Forfeits the risk associated with the performance of the Asset**\n\nThis is an understatement here, because we know Kenny’s plan is to short some of these companies into oblivion. Remember the chart above, if the Asset depreciates, the banks have to pay Citadel.\n\n&#x200B;\n\n# Bank (Receiver)\n\n* **Collects income if the Asset appreciates**\n\nI don’t know if you know this, but stonks only go up. At least, that’s been the trend in the DJI and NDX for the past few years. Betting that a random bundle of, say, 50 stocks is going to appreciate over time is a good bet.\n\n[Dow Jones Industrial Average](https://preview.redd.it/gl6alynmrza71.jpg?width=702&format=pjpg&auto=webp&s=23dcb87651a3ba7da97c0074f2b5826b31da094e)\n\n&#x200B;\n\n[NDX Nasdaq 100 Index](https://preview.redd.it/1182gv6rrza71.jpg?width=1177&format=pjpg&auto=webp&s=21b611a1c27891af45d02b9d6f76386af7f1bbc3)\n\n* **Assumes systematic/market risk**\n\nThis just means that if the market takes a shit, the banks are going to be on the hook for a ton of money because the underlying Asset is going to dump as well. Remember, the bank pays the SHF when the Asset depreciates.\n\nAlso remember that in this way, the SHF has pawned off all the risk of the Asset depreciating. This is great if you’re planning to short companies out of existence.\n\n&#x200B;\n\n* **Takes on the payer’s risk of default**\n\nThis just means that for the Asset in question, the owner (SHF) has no risk of default because the bank pays them proportionally when the Asset reduces in value. This is how the scheme becomes an off-book double shorting opportunity for Kenny. The banks are literally paying him to short his own holdings, and the more he shorts the more they pay.\n\nThat was a lot, so let’s bring back the financial relationship chart and you can put it all together yourself.\n\n[https://preview.redd.it/mxffaaftrza71.jpg?width=1232&format=pjpg&auto=webp&s=38b16156efbeadb8647530fdc67db486be12761b](https://preview.redd.it/mxffaaftrza71.jpg?width=1232&format=pjpg&auto=webp&s=38b16156efbeadb8647530fdc67db486be12761b)\n\n**tl;dr:** In early 2020, Kenny thought he’d trapped the banks and planned to make a ton of money off them, no one being the wiser because it was hidden in ETFs with dozens of other stocks.\n\nIt’s just like the Big Short, except with overvalued securities instead of overvalued mortgages. Kenny knew he had some “BBB tranches” hidden in with the A tranches, and sold them to banks in what seemed like a good situation for them but was in reality a double good situation for Kenny.\n\nI don’t think he was trying to blow up the banks, just executing some psycho plan he’d cobbled together from all the greatest investment scams of the past two decades. He wins big, the banks might win a bit or lose a bit, and all it takes is putting a few measly companies and their thousands of employees out of work. But neither side cares about that anyway, so they don’t look too closely. Of course, it's possible they're all in on it together.\n\n&#x200B;\n\n**So What Happened Next and How Could It Be So Big?**\n\n(Link Safety Notice: All of the links in the following section go to Superstonk or directly to filings on sec.gov)\n\nIn [June](https://www.sec.gov/Archives/edgar/data/0001326380/000092189520001762/sc13da512166002_06122020.htm) and [August](https://www.sec.gov/Archives/edgar/data/1326380/000101359420000673/rc13da1-083120.htm) of 2020, Hestia Capital and RC Ventures buy large stakes in Gamestop (1.5% and 9.5% respectively) and the price stabilizes after a volatile period.\n\nOn December 17th , RC Ventures [increases its stake to 12.9%](https://www.sec.gov/Archives/edgar/data/1326380/000119380520001571/e620151_sc13da-gamestop.htm). Let’s look at Gamestop’s chart for the back half of the year.\n\n[https://preview.redd.it/qmm4rfjvrza71.jpg?width=1407&format=pjpg&auto=webp&s=b37cceffe6027c68bcbbd759ae7464a70cfc1fa5](https://preview.redd.it/qmm4rfjvrza71.jpg?width=1407&format=pjpg&auto=webp&s=b37cceffe6027c68bcbbd759ae7464a70cfc1fa5)\n\nThe next 13D filed by Gamestop was on January 10th, [outlining the provisions of RC’s agreement](https://www.sec.gov/Archives/edgar/data/1326380/000119380521000031/e620202_sc13da-gamestop.htm) with the current board.\n\n[https://preview.redd.it/clf49a6yrza71.jpg?width=1885&format=pjpg&auto=webp&s=394cd26915458dd203097b0fe976d3eb137406fd](https://preview.redd.it/clf49a6yrza71.jpg?width=1885&format=pjpg&auto=webp&s=394cd26915458dd203097b0fe976d3eb137406fd)\n\nI put the end date of RC's Standstill Restrictions at February 9th, which is 120 days prior to the first anniversary of the 2021 meeting. Had we found this earlier, maybe we would have voted Sherman out last month after all. RC just couldn’t say otherwise. Anyway.\n\nLet’s look at the 13Ds and 13Gs since:\n\n💎\n\nOn **Jan 26**, [Blackrock files an Amended 13D](https://www.sec.gov/Archives/edgar/data/1326380/000083423721001340/us36467w1099_012621.txt) showing that as of 12/31/20 it had:\n\n* 13.2% ownership (almost identical to RCV’s stake)\n* \\>5% “ownership on behalf of another person”\n\nThat person? **iSHares Core S&P Small-Cap ETF**.\n\nWho names their kid that?\n\n💎\n\nOn **Jan 28**, Korean company Dooyong Kimeunmi Koo Must Holdings Inc files to let the SEC know they used to own more than 5% [but now own 0 shares of Gamestop](https://www.sec.gov/Archives/edgar/data/1326380/000119312521019848/d945183dsc13ga.htm).\n\n💎\n\nOn **Feb 8th**, Fidelity’s FRM, LLC [files ownership of 13.3%](https://www.sec.gov/Archives/edgar/data/315066/000031506621001050/0000315066-21-001050.txt), again very close to the percentages of RCV and Blackrock.\n\nOn **Feb 10th**, FRM, LLC files to report [a reduction of its stake from 13.3% to 0%](https://www.sec.gov/Archives/edgar/data/315066/000031506621001389/0000315066-21-001389.txt) (they now own 87 tickets to the moon, down from 9 million).\n\nHuh.\n\nAlso on **Feb 10th**, Vanguard Group [reports ownership of 7.4%](https://www.sec.gov/Archives/edgar/data/102909/000110465921018148/tv0931-gamestopcorpclassa.htm).\n\nBut all of this is just background information, here is where things get interesting.\n\n💎\n\nOn **Feb 12th**, State Street Corp files that on 12/31/20 it [distributed its 3.5% stake across four of its subsidiaries](https://www.sec.gov/Archives/edgar/data/93751/000009375121000355/GameStopCorp.txt): SSGA Funds Management, State Street Global Advisors Ltd (UK), State Street Global Advisors Australia, State Street Global Advisors Trust Co.\n\nOn **Feb 12th**, Senvest Management LLC files that [their 7.24% stake is now under joint control of their managing member, Richard Mashaal](https://www.sec.gov/Archives/edgar/data/1326380/000090266421001289/p21-0581sc13ga.htm).\n\nOn **February 12th**, Donald A Foss, billionaire founder of Credit Acceptance Corp, [files that he has reduced his stake to 0%](https://www.sec.gov/Archives/edgar/data/901185/000110465921022073/tm216322d2_sc13ga.htm).\n\nOn **Feb 12th**, Dimensional Fund Advisors LP files that [as of 12/31/20 it has a 5.6% stake](https://www.sec.gov/Archives/edgar/data/354204/000035420421000127/SEC13G_Filing.htm).\n\nThen it reveals this (which may or may not be boilerplate language for proxy voting, but is convenient for explaining things):\n\n&#x200B;\n\n[It's managers all the way down](https://preview.redd.it/lbr1dqx2sza71.jpg?width=1878&format=pjpg&auto=webp&s=a9267e1131004a08162074e491a18fe323dfca32)\n\nThere it is. Six weeks into this research, and I’ve found a succinct, legal description of what we’re up against. Once we’re done with the filings, I’ll blow the whole thing wide open.\n\n💎\n\nOn **Feb 16th**, Susquehanna files that [their 6.3% stake is spread across three subsidiaries](https://www.sec.gov/Archives/edgar/data/1326380/000110465921023554/tm216465d8_sc13g.htm): Sus Fundamental Investments, Sus Securities LLC, and Sus Investment Group. Brian Sopinsky is the signatory for all three companies, as General Counsel, Secretary, and Assistant Secretary.\n\nOn **Feb 16th**, Maverick Capital Management [filed that their 6.3% stake is spread across four entities](https://www.sec.gov/Archives/edgar/data/934639/000119312521044436/d120770dsc13g.htm): Maverick Capital Ltd, Maverick Capital Management, Lee S. Ainslie III, and Andrew H Warford. Mark Gurevich is the signatory for all four, by power of attorney.\n\nSame stake, same day, although the share count is slightly different for each.\n\n💎\n\nThere have been no 13D or 13G filings for Gamestop since Feb 16.\n\nOk, but how does this link Gamestop to the entire global economy, much less RRPs? Well, because Citadel is a relatively new player in a much larger game. There may be hundreds of overleveraged funds all tied into the same network, each of which manages assets from billions to hundreds of billions. This is our real enemy. They are the Five Rings, and Citadel is just Ben Kingsley’s Mandarin.\n\n# Ultimate Wargame Theory: The Players\n\nIn the [original Wargame Theory](https://www.reddit.com/r/Superstonk/comments/mvov2f/the_gme_wargame_a_new_theory_of_everything_my/), I lumped together Citadel and all its affiliated media, hedge funds, banks, and other allies as “The Bads.” My research over the past two months has now identified them more clearly.\n\n**I have examined the SEC filings of more than forty financial institutions going back to 1999, covering thousands of securities, and identified clear patterns that link them together and link them to the Gamestop saga in 2021**. I have correlated the movement of thousands of securities, and researched the people and places behind these companies to come to this conclusion:\n\n**We are not just facing Citadel, but a global network of banks, hedge funds, family offices, and other financial institutions who have created a de facto private stock market** and hold the fate of thousands of companies, trillions of dollars, and perhaps entire countries in their hands. I call this the Voltron Fund, but it is *not* a cosmic defender.\n\n[https://preview.redd.it/jcskiqp6sza71.jpg?width=486&format=pjpg&auto=webp&s=946e8cd8f39d5f30c39257fea63da175a17f3072](https://preview.redd.it/jcskiqp6sza71.jpg?width=486&format=pjpg&auto=webp&s=946e8cd8f39d5f30c39257fea63da175a17f3072)\n\nThis monster is completely divorced from normal market mechanics because of its interconnectedness. **I believe there is a universal algorithm, Voltron’s Sword, managing the assets not of one of these companies, but all of them.** If one institution needs net capital, they get it from another with room to spare. If they need a loophole, they transfer the problem to a type of institution that can bury it in different loopholes and regulations. Sometimes they just ship it offshore, to a regulatory black hole like Luxembourg, Bermuda, or the Cayman Islands.\n\nMaybe what we're seeing [around net capital days](https://www.reddit.com/r/Superstonk/comments/ny2ov4/a_revisit_to_net_capital_what_is_truly_driving/) isn't buy-sell pressure from Citadel, but the entire fund moving assets to balance one another's books. We aren't fighting humans, we're fighting the wealthiest, most powerful algorithm in the world.\n\n**We don’t need to bankrupt one of them, we need to bankrupt all of them.**\n\nWith respect to OP, I also don't think Citadel is [absorbing the liabilities of smaller funds](https://www.reddit.com/r/Superstonk/comments/o5z8vc/working_theory_the_shf_white_square_that_just/) that “go bust.” I think it is balancing the assets and liabilities of the entire network using HFT to put out fires wherever they arise. That’s why funds are reporting reducing positions and heavy losses rather than margin calls or liquidations. They share thousands of individual investments among themselves, as shown on the 13Fs, and can move them whenever and however often they want since they have an in-house market maker and banks with fully aligned portfolios all over the world.\n\n**This also gives them a functionally limitless common pool of stocks to manipulate for arbitrage profit.**\n\nI’ll be publishing more analysis as fast as I can write it, but for now I want to focus on the scope of what we are up against so that future analyses of things like Total Return Swaps and RRPs can take into account the scale of our enemy.\n\n# “For Now We See in a Filing, Fastly”: How I Identified the Voltron Fund\n\nLike many of you, I have been frustrated by Reddit’s constant connection problems over the past month, but it wasn’t until the weekend of June 26-27 that my DD-sense was triggered. Superstonk was barely working, or not at all, **yet between June 24-27 redditstatus on Twitter did not update once to make people aware of the problems.** On top of that, I couldn’t find any evidence that it was a widespread problem.\n\nReddit’s servers are run by Fastly, which had suffered a meltdown around June 8th that had some Apes wondering if Citadel was behind it. redditstatus was all over it, as they were for problems on the 21st, the 24th, and the 29th. Yet, between the 24th and 29th they said nothing about the CDN problems that Superstonk users were experiencing. Obviously the problems have continued unabated, but only for Superstonk as far as I can tell.\n\nI remembered that someone had commented about [Citadel recently taking a stake in Fastly](https://www.reddit.com/r/Superstonk/comments/nv1cbp/citadel_almost_quadrupled_their_amount_of_shares/), so I wondered whether the stake was large enough to gain precise control over Fastly’s servers. And if it was, how and why?\n\n**First Discoveries**\n\nMy first stop was Nasdaq.com, which is a great resource for tracking institutional ownership between the quarterly 13F and 13G filings. I looked up Fastly, clicked institutional holdings, and sorted by “% Increased.”\n\nI spent many sleepless nights looking at every SEC filing for everyone listed on the first two pages of results going back as far as they go back, and I found so much crazy shit. I encourage you to go look around, and have advice for doing so at the end of this post.\n\nThe first thing I found was an amazing correlation between the portfolios of all of the following companies, who I have since come to understand as correlated to the Voltron Fund.\n\n&#x200B;\n\n[https://preview.redd.it/glwli0k9sza71.jpg?width=1542&format=pjpg&auto=webp&s=0bf1ff1a7b0864ed0c3a1410dc2f588f600157a9](https://preview.redd.it/glwli0k9sza71.jpg?width=1542&format=pjpg&auto=webp&s=0bf1ff1a7b0864ed0c3a1410dc2f588f600157a9)\n\nThis doesn’t even include the Abdiel Global Management fund, which [took a 29% stake in Fastly in 2019](https://www.sec.gov/Archives/edgar/data/1508239/000119312519227993/d791811dsc13da.htm) and continues to move Voltron-affiliated stocks around between its various funds as recently as June. Abdiel is registered in the Cayman Islands, but run out of New York by a former Goldman Sachs employee, and is correlated in many other ways.\n\nLet’s just say that at this point Citadel is Fastly and Fastly is Citadel.\n\n&#x200B;\n\n>**Build Your Own DD #1:** I’ll get into how one of Fastly’s new board members is connected in a later Ultimate Wargame story, or you can try to beat me to it by figuring it out first!\n\n&#x200B;\n\nI thought I had found a good portion of the network in this filing, and that the network had come together sometime between 2015 and 2017. I was wrong on both counts. I have traced the beginnings of the Voltron fund back to a specific filing in 1999, although I don’t think Citadel becomes involved until around 2015.\n\nFor now I’m going to focus on the timeframe of 2015 to the present, because I think that’s where our part of the story starts to take shape. I am leaving out a few pieces of information and connections, because they belong in other wargame stories, but this should be enough to establish the interconnectedness of the Voltron Fund.\n\n**Second Discoveries**\n\nWhile following the [trails uncovered by the Wargame Theory II](https://www.reddit.com/r/Superstonk/comments/ng4ja0/wargame_theory_ii_the_mother_of_all_fud_moafud/), I came across two hedge funds started in 2018 by Citadel employees who quit to start them: Candlestick and Cinctive. (One of them is Steve Cohen's brother-in-law.) It was here I first noticed the connections that would lead me to Voltron, but it wasn’t until the Fastly connection that I understood how to dig in to find it.\n\nThe method is simple, and I encourage you all to dive in and find more connections as well as verify mine. I know there are more, but I had to stop at some point to tell you all what I had found.\n\nA 13F-HR is where a fund discloses all of its holdings, so a typical section will look like this.\n\n&#x200B;\n\n[Who are all those flowers for, Kenny?](https://preview.redd.it/71wfj7qbsza71.jpg?width=1538&format=pjpg&auto=webp&s=020299b5a8b9f88daf7da8b28ffce8ebe81725a0)\n\nAnd for a while that’s where I was looking, because I couldn’t believe how well these portfolios were coordinating (I’ll have a separate post detailing some of my findings). But then I started looking at the Cover Pages for the filings, and that’s where things got REALLY interesting. Remember Dimensional Fund’s explanation above?\n\n&#x200B;\n\n>“Dimensional furnishes investment advice to four investment companies, serves as investment manager or sub-advisor to certain other commingled funds, group trusts and separate accounts (such investment companies, trusts, and accounts collectively referred to as the “Funds.”\n\nNow, they’re talking about voting rights and beneficial ownership, but what I want to focus on is the fact that they “furnish advice” and manage investments for other companies as well. You can find such relationships (when they’re properly marked) on the Cover Page of a 13F filing under two categories, which are on two separate parts of the page: Included Managers (IM), and Other Managers Reporting (OMR).\n\nIn fact, here are all the interesting things you can find out from the cover page of a 13F:\n\n* The address of the company\n* The address of the Compliance Officer signing off on the form (often different)\n* Other Managers Reporting (OMR):\n* Other Included Managers (IM):\n* The number of different investments\n* The total value of those investments\n\nFor example, here’s the Q1 2021 cover page for Advisors Asset Management, an absolute lynchpin:\n\n&#x200B;\n\n[Sorry for the whitespace, I didn't feel like fixing it](https://preview.redd.it/3x78qciesza71.jpg?width=920&format=pjpg&auto=webp&s=54b3c89ea01ade234303433468773fdd8c830ff5)\n\nManaging $6.5 billion right outside Austin, TX, [location of so many data centers affiliated to the Voltron Fund](https://www.reddit.com/r/GME/comments/mhyv94/connecting_the_puzzle_pieces_the_failed_bet/)? Wut doin'?\n\nI’m going to end this section with a list of funds that my research has turned up. I make no claim to know their affiliation, only that they show up on one another's public 13F filings as managers and/or share a common pool of thousands of investments. A few things to keep in mind:\n\n* I have investigated only about half of this list, so there may be some unaffiliated names included. However, no name is included here if it did not have some connection back to the master portfolio.\n* Remember, too, that this is by no means the entire list, and most of these companies have multiple affiliates just like Susquehanna, Dimensional, State Street, and Maverick showed us above.\n* This doesn't include Bads that show up in these filings such as Apollo Global Management, Virtu, L Brands, and Axa.\n* This doesn't include affiliated banks, which will be covered in a future post. A few of them rhyme with Coldman Snacks, Cheddar Swiss, Sploitch. I guess you can see that and more on the Fastly filing.\n* Also, who knows how many of the [$10 trillion in non-reporting family funds like Archegos](https://www.afr.com/wealth/investing/archegos-and-the-10trn-world-of-family-offices-20210406-p57gtp) there are in the mix? (Link goes to an article on the Financial Review website)\n\nWant to know who's going to pay for the MOASS?\n\n# The Voltron Fund\n\nAbdiel Global Fund\n\nAdvent Capital Management\n\nAdvisors Asset Management\n\nAffinity Investment Advisors, LLC\n\nAH Lisanti Capital Growth LLC\n\nApex Capital Management (Dayton, OH)\n\n~~Archegos~~\n\nAtivo Capital Management, LLC\n\nBahl & Gaynor\n\nBlueshift Asset Management\n\nBrown Advisory LLC\n\nBrown Capital Management, Inc.\n\nCampbell Newman Asset Management, Inc.\n\nCandlestick Capital Management\n\nChanning Capital Management, LLC\n\nChicago Equity Partners, LLC\n\nCinctive Capital Management\n\nCitadel\n\nCity National Rochdale\n\nCooke & Bieler, LP\n\nDecatur Capital Management, Inc.\n\nEAM Investors, LLC\n\nEdgar Lomax CO/VA\n\nExchange Traded Concepts\n\nExodusPoint Capital Management\n\nFiera Capital Inc.\n\nFortaleza Asset Management\n\nFourpoints Investment Managers SAS\n\nGlacier Capital\n\nGlobeFlex Capital, LP\n\nGlovista Investments, LLC\n\nGreenoaks Capital Partners\n\nGroup One Trading\n\nHanseatic Management Services, Inc.\n\nHartford Investment Management\n\nHerndon Capital Management\n\nHightower Advisors, LLC\n\nHolland Capital Management LLC\n\nIFP Advisors, Inc\n\nKG&L Capital Management LLC\n\nLombardia Capital Partners, LLC\n\nManaged Asset Portfolios, LLC\n\nMar Vista Investment Partners LLC\n\nMatarin Capital Management, LLC\n\nMelvin Capital\n\nNational Asset Management, Inc\n\nNicholas Investment Partners, LP\n\nNorthPointe Capital LLC\n\nOakbrook Investments LLC\n\nOpus Capital Group, LLC\n\nParadigm Asset Management Co LLC\n\nPhocas Financial Corporation\n\nPiedmont Investment Advisors LLC\n\nPNC Capital Advisors LLC\n\nPoint Break Capital Management\n\nPoint72\n\nRedwood Investments, LLC\n\nReinhart Mahoney Capital Management Inc\n\nSeizert Capital Partners LLC\n\nSimplex Trading LLC\n\nStackline Partners LP\n\nSteward Partners Investment Advisory, LLC\n\nStoneRidge Investment Partners, LLC\n\nStrategic Global Advisors, LLC\n\nSusquehanna\n\nThe Edgar Lomax Company\n\nThomas White International, Ltd.\n\nTwin Tree Management, LP\n\nTwo Sigma Investments, LP\n\nVision Capital Management, Inc\n\nWhite Square Capital\n\nZevenbergen Capital Investments LLC\n\n&#x200B;\n\n**Primary Industries Represented by Holdings**\n\n* Biotech/Biotherpeutics (had to misspell for automod)\n* Cloud Computing and Servers\n* AI\n* Semiconductors\n* Business Data\n* Transportation, Shipping, and Logistics\n* Pharmaceuticals\n* Healthcare Data\n* Energy Production\n* Food Production\n* Communications Media\n* Commercial Real Estate\n* Residential Real Estate\n* Chinese ADR/ADS in all of the above\n\nIt's much, but it ain't honest.\n\n**Total Assets Under Management?** My guess, in the tens of trillions. Some of the funds manage $30-50 billion themselves, and there's at least $10 trillion completely off the books in family funds according to the Financial Review article I linked earlier.\n\n[https://preview.redd.it/evwbhsrhsza71.jpg?width=455&format=pjpg&auto=webp&s=0b3ea9d2f6b4263aaa739b76fdb44cf1d5374236](https://preview.redd.it/evwbhsrhsza71.jpg?width=455&format=pjpg&auto=webp&s=0b3ea9d2f6b4263aaa739b76fdb44cf1d5374236)\n\n# Conclusions\n\nI think this research gives us a clearer picture of how certain things are possible, like hiding 2,000% short interest.\n\nI think it gives us a clearer picture on how the whole thing is funded, building on the work of [Where are the Shares](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/) and others. Citadel makes profits *in several ways* every time a stock is traded, so I think they can basically print money by moving stocks around between funds to take advantage of arbitrage. Depending on the particular need, they can move it between hedge funds, market makers, banks, and family offices at will. There is always a buyer and always a seller, and the terms are what benefits the whole. Two companies might do a trade where both lose if it means strengthening Voltron itself. This is not a rational system, it is a shadow economy sucking the real economy into itself through bankruptcy jackpots, hostile mergers, busting out, PFOF shenanigans, and outright fraud.\n\n**Speculation:** I think they do the same thing with options, which is why buying them for any stock in the shared pool is a sucker's game. They are in control of thousands of stocks, and manipulate them all for maximum options advantage.\n\nIt isn't just about whether or not GME will hit its options prices in a given week or on a given security. The Voltron's Sword algo looks at options across their entire portfolio and maneuvers the stocks for maximum profit and minimum damage. The more you buy, the more information they have, and the more they can use options to manipulate the game. We know options expiries for one stock that we own, they know them for thousands of stocks that they own.\n\nIf you want to see how connected this is with media, see the Widespread Manipulation teaser below.\n\nIt's possible that we live in a completely fraudulent system.\n\n&#x200B;\n\n**Bringing It Back to RRPs and Total Return Swaps**\n\nThese companies can just make shit up and call it an investment. **What would happen if I owned, say, four million GME and spread it out between four different companies?**\n\nFour times as many derivatives contracts! Four times as much leverage!\n\nAnd **what happens to banks on the other end of these swaps when the Asset (GME bundle)** ***appreciates*** **instead of depreciating like everyone assumed they would?**\n\nEvery single exposed fund has to start pumping cash into the counterparty banks.\n\nThis may explain why we didn’t see an end of quarter spike last month, because RRPs have already been increasing steadily basically since the March runup. Is there a connection? Here’s a totally speculative theory:\n\n&#x200B;\n\n* The shorts got hidden in January by the Married Puts and other mechanisms we have identified, but that’s the last time that was going to happen on that scale\n* The Voltron’s Sword algorithm determines that someone needs to go, and so Archegos gets the call (remember, [Archegos is a biblical term meaning “a sacrifice, one who goes first,”](https://www.reddit.com/r/Superstonk/comments/ng4ja0/wargame_theory_ii_the_mother_of_all_fud_moafud/)) and that causes the March runup\n* While they’re waiting for the Archegos fallout to appear, the Voltron Fund fragments its holdings and prepares to use a series of Total Return Swaps to keep the price under control when it shoots up as a result (similar to how they shut down January, but through a different mechanism)\n* Right after that, in mid-March, is when RRPs start to rumble and they’ve been basically growing ever since, as the TRS’s leak more and more cash into their counterparty banks. By sacrificing Archegos and keeping the price steady, they have been able to draw out the charade much longer\n* They keep the price flat and money flowing through HFT shenanigans between members, and they keep the shorts hidden using TRS swaps and non-reporting family funds\n\nThis would explain the low borrow rate and reports that they are low because there is no interest in borrowing GME. They have been borrowing and shorting as part of the strategy, but the main thing keeping them alive is spreading massive leverage over trillions of dollars AUM and dozens of companies so that every company in the fund is at least $0.01 in the black. They're mostly using their own shares to manipulate the price, it's just that before we didn't know all the places we had to look.\n\n**I'd wager a guess, based on this research and how they seem to do things, that every single institutional share not accounted for actually belongs to Citadel through the Voltron Fund.**\n\nThey will take pieces off the board here and there (Archegos, Citadel Luxembourg, White Square Capital) just to maintain equilibrium across the entire fund. I believe the May runup *might* have been a result of Citadel Luxembourg closing and Glacier Capital absorbing some of its positions, I have a post on that incoming as well.\n\n**Whew.**\n\nI hope this will give some of you a lot to dig into while I finish up different pieces of this project. I also hope I’ve inspired you to look into some of this yourself, if only to verify what I’m saying. I started this entire project by triangulating the Q4 2020 assets under management of three of the companies on the Fastly list. Take your pick and report your findings so we can put more pieces together.\n\nI know this been a lot to take in. It took me six weeks, tendonitis in my mouse-clicking hand, and several nervous breakdowns to put it together (mostly joking). I will spin out some of the implications of the Voltron Fund in future posts, including how I accurately identified two stocks that would begin correlating with GME last week by re-opening the investigation into Glacier Capital.\n\nAnother post will show that our investment media environment is as completely fabricated as the stock market itself. \n\nI hope this first Ultimate Wargame story has convinced you that we are up against far more than Citadel, but the fundamentals haven't changed:\n\n**Buy and Hold, and love one another and the world around you. We are going to be alright, we are going to win, and we are going to have a chance to forge a better future for ourselves and the world.**\n\nI look forward to continuing this conversation with you in the comments.\n\n💎🙌💎💓🦍🚀🚀🌜\n\nBlanderson",
    "title": "Ultimate Wargame Theory: The Beginning - Total Return Swaps, RRPs, and the Voltron Fund",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojh2eh/ultimate_wargame_theory_the_beginning_total/"
}