{
    "author": "Chemical-Pop-8576",
    "created_utc": 1621129249.0,
    "distinguished": null,
    "edited": 1621143636.0,
    "id": "nddod9",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nddod9",
    "num_comments": 1986,
    "permalink": "/r/Superstonk/comments/nddod9/exposing_warden_here_he_is_calling_superstonk/",
    "score": 7419,
    "selftext": "Dear Apes,\n\nAfter tonight's new \"DD\" about the \"Updated MOASS\" TA and selling the VWAP, I feel obligated to post this.\n\nI posted a comment thanking Warden immediately after reading his DD.  I thought that the use of VWAP as a technical indicator to sell during the MOASS was spot-on.  After re-reading the post, and getting downvoted to hell just for defending myself...I popped into his Discord.\n\nHere is Warden calling out SuperStonk members as \"idiots\" and saying that Ryan Cohen cannot possibly pilot this stonk into the heavens.\n\n&#x200B;\n\nhttps://preview.redd.it/o91661uzydz61.png?width=2200&format=png&auto=webp&s=8471c9a42acfdb77d4c626207f4de99446841389\n\nThere are thousands of people that watch Warden's streams and donate to him.  People lurk in his Discord and praise him all the time.  I think he does have some excellent knowledge about trading.\n\nHowever: people have pooled their life savings into this stonk.  There are homeless hodlers out there.  There are XXXXX holders, all the way down to fractional hodlers.  In this chat, you can see the mood.  People making fun of fractional hodlers.  It's all FUD...and it's bad for ya.\n\nI'm choosing to post this, as I feel it's necessary.  I believe that Warden has some explaining to do.\n\nEdit 1:  Now I'm getting disgusted.  This post was temporarily removed at the same time as Warden suddenly posted his own stickied response to the thread. So he gets to remove the post temporarily as a mod? Is this for real?  Here is a screenshot of the sticky immediately followed by an Ape telling me the post was removed and then it's right back like magic!\n\n&#x200B;\n\nhttps://preview.redd.it/rdtunite6ez61.png?width=2348&format=png&auto=webp&s=64cc48ff4f51ee8ef4721e25a46626e3f38f98f4\n\nhttps://preview.redd.it/u9g0sypc6ez61.png?width=1784&format=png&auto=webp&s=d3c054f7371430a97248430b0aa3b1988407f63a\n\nEDIT 2: 11:53 PM EST:\n\nMods have revoked Warden's mod privileges temporarily.  He also now appears to be resigning per u/redchessqueen99's Twitter.\n\n&#x200B;\n\nhttps://preview.redd.it/brjwitxwnez61.png?width=1496&format=png&auto=webp&s=2ab15c68d3950b0c54734a97409a944e41c4fa78\n\nEdit 3: I'm getting alot of requests to link to the original DD that Warden posted.  The DD has been removed from this sub but has been archived.  The original post is what started this whole mess.\n\n[https://www.removeddit.com/r/Superstonk/comments/ndc1rc/selling\\_on\\_the\\_way\\_down\\_a\\_definitive\\_dd\\_on/](https://www.removeddit.com/r/Superstonk/comments/ndc1rc/selling_on_the_way_down_a_definitive_dd_on/)\n\n&#x200B;\n\nEdit 4:  It's 1:37 AM and he's still going in his Discord Channel.  \n\n&#x200B;\n\nhttps://preview.redd.it/up7bybxb6fz61.png?width=3549&format=png&auto=webp&s=066dbd92342d4fea51c4eed8d96617ef53c6d5d1\n\nhttps://preview.redd.it/dpar3dde6fz61.png?width=3065&format=png&auto=webp&s=ee91f1f3b73f4fe5bb3289cc418009fd49b025a3\n\n[Warden seems completely unphased by the fact that he just let down 200k plus Apes.  He's in his channel answering questions as if nothing happened.  ](https://preview.redd.it/uirwiofh6fz61.png?width=2756&format=png&auto=webp&s=6a850c0c880b8471814f277edd1daf34c24d4f95)\n\n&#x200B;",
    "title": "Exposing Warden: Here he is calling Superstonk users \"Idiots\" on His Discord.",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/Superstonk/comments/nddod9/exposing_warden_here_he_is_calling_superstonk/"
}