{
    "author": "skystonk",
    "created_utc": 1621101548.0,
    "distinguished": null,
    "edited": 1621139799.0,
    "id": "nd4n02",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nd4n02",
    "num_comments": 204,
    "permalink": "/r/Superstonk/comments/nd4n02/shills_desperate_be_prepared_gme_getting_smeared/",
    "score": 2186,
    "selftext": "One of the first posts I saw this morning was from r/relationships by a 2hr old account with a post from 2 hours ago. \n\nTo summarize, it’s a story about how her excited bf blew joint savings £9000 to buy 50 shares and she’s upset because xyz.  They brought it into a legal sub as well but mod was good there\n\nhttps://www.reddit.com/r/LegalAdviceUK/comments/nd04nh/my_partner_used_our_mortgage_savings_to_buy_about/gy7y8hq/\n\nAt first I thought it was just to get others to hate Apes but now I believe it’s meant to create divisions within the sub. I’m expecting it to be used in forum slide and that shills will try to create in fighting by stoking both sides of “the argument”\n\nSecondary objective is probably to drag apes into the wild of Reddit where we are easily painted as assholes or crazies (possibly as a gambit to help get us shut down). If you do decide to engage anything like this, tread very carefully and keep a civil tone. \n\nStay vigilant. Every day we’re getting closer to the moon. \n\n🦍💎🙌💎🦍🚀🚀🚀🚀🚀🚀🚀🚀🚀🌔🚀🚀🚀🚀🪐🚀🚀🚀🚀\n\nEdit: I guess the post was removed from uk legal. May have been done by mod as they said it belonged in a different sub \n\nhttps://www.removeddit.com/r/LegalAdviceUK/comments/nd04nh/my_partner_used_our_mortgage_savings_to_buy_about/\n\nEdit 2:  Was reminded 🌈🐻 media sources love jumping on this kind of generated conflict as divisive clickbait.\n\nEdit 3:  Thank you for all the awards! I’m just glad I could make a positive contribution.",
    "title": "Shills desperate, be prepared. GME getting smeared on other subs. Content looks primed to be a wedge in our community.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nd4n02/shills_desperate_be_prepared_gme_getting_smeared/"
}