{
    "author": "Tomato-Jealous",
    "created_utc": 1627171817.0,
    "distinguished": null,
    "edited": 1627228214.0,
    "id": "or17j9",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_or17j9",
    "num_comments": 45,
    "permalink": "/r/GME/comments/or17j9/rc_is_helping_prepare_the_nation_for_a_massive/",
    "score": 558,
    "selftext": "Alright, on a different post, I stated that I had a tinfoil hat theory. This shit will either make sense to a lot of you and some additional wrinkle brains will have a new perspective to look at. Please change the flair if it is incorrect 😊\n\nThis will not be an elaborated explanation but will be filled with tomatoes (smush them as you may). First, I want to thank this Sub for allowing me a lurker ape to get this out of my head and out on something other than a damn note pad. I will source links later but I will reference previous DD that has helped me get to where I am mentally now.\n\nLet's get to this shit. \n\nWe have been in this fuckery now for about 8 months. DFV has been working on dissecting the MOASS and has been a pioneer in releasing the information we now have today. RC came in saw the potential of this situation, boom becomes chairman. \n\n\"Okay, tomato, we all know this already\" \nYes, I know my ape familia, sit down and buckle up. \n\nRC is a visionary and so forward thinking he is not the individual that only plans 3,6,9, or even 12 months down the road. He is an individual that plans each step with precision (with his team of course) while having one ultimate end goal for the companies or organizations he runs or owns. Something else you can see in RC is legacy. If we look at Chewy and what it stands for, it's more than just a company, their clients are treated like what? Oh that's right FAMILY (insert vin diesel meme) \n\n\"Okay, tomato, seriously, get to your fucking point\"\nI thought I told you to buckle up? \n\nWe all know that house of cards, all of u/criand DD, as well as citadel has no clothes as all phenomenal and realistically for me is all the confirmation bias I needed to buy and hodl.\n\nBut why would RC take on such a large task in being a part of reviving a company like this? Unless he had a larger vision than any of us actually believed up until now. \n\nRC came into this understanding what Michael Burry did during the big short in the very beginning. Here's the difference, not only is RC going to blow up the market, he's also going to fucking save it. Mother fucking HERO. Here's why I've got my tinfoil hat on guys and like I said poke holes as you like but it is starting to make sense...\n\nRC's tweets are a good resource, why he was in VA in the tweet from May which everyone has several theories on. I think everyone actually is right, he did meet with the feds, he did go talked the super league (he's a busy man after all)\n\nThe south park references have been very heavy in his tweets, when he tweets about the train coming for him on the 4/25 he's literally letting us know he's getting hit by something soon(most likely his meeting with the Feds!), then follows up with pink the next day (which is literally shit). shit while we're here let's spread joys and cheers. Hankey is all about Christmas after all. \n\nAlright, still with me here? You in the back, wake the fuck up *throws tomato* \n\nHow long could deliberations in a this type of conversation take...oh idk 30 days to plan how to further proceed with the feds. Incoming tweet on may 28th...RIP Dumbass. Ryan didn't sell out to the feds but he is giving them a chance to not fuck themselves and our entire economy. He could pull the plug at any time with a dividend, the nft is launching soon, etc. There's too many ways he could spark the MOASS. What's more patriotic though than power to the players on idk 4th of July and GameStop tweeting GMERICA🇺🇸  \n\nRC is not going to make GameStop just a better company its going to be the company that helps save the world economy from going to absolute shit. \n\nI mean why else do they have all this time to make regulation after regulation. Daddy Cohen said yes I will help you but you have a deadline and I'm pulling the plug. \n\nWhat a legacy it would be to not only be apart of reviving a company from pretty much ashes and turning it into a global brand, aiding in the salvation of the economy but freeing/helping the market from the corrupt casino game it is now... get it CAN'T STOP, WON'T STOP. GAMESTOP. \n\nAlright, throw some tomatoes apes, buckle up, buy and hodl also not financial advice all that shit.  See you on the moon 🚀🚀🚀🚀🚀🚀🚀🦍🦍🦍\n\nEdit: Mr. Hankey not Pinky (my ass thought about Next Friday subconsciously 🤣)",
    "title": "RC is helping prepare the nation for a massive shift and begin a legacy that will last generations!!",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/GME/comments/or17j9/rc_is_helping_prepare_the_nation_for_a_massive/"
}