{
    "author": "YoshiPendragon",
    "created_utc": 1624405731.0,
    "distinguished": null,
    "edited": 1624406665.0,
    "id": "o60kvl",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o60kvl",
    "num_comments": 55,
    "permalink": "/r/Superstonk/comments/o60kvl/it_wouldnt_even_take_hfs_covering_to_trigger/",
    "score": 630,
    "selftext": "Sitting here watching Netflix while taking a sick day and I felt the most unusual sensation... My brain gained a tiny wrinkle. I was thinking about how apes continue to buy day after day to increase their stake in GameStop and that every time they buy, someone has to pull some magic shares out of their ass to fill that order. Then I thought, shit what if they didn't fill the order? Well those naked shorts aren't just for driving the price down, it's to straight up keep the price from mooning. Yeah, getting the price lower is a nice thing for them because it reduces their liquidity requirements, but it also helps apes who want to buy more shares. Should they suddenly stop producing synthetic shares, hundreds of thousands or millions of buy orders every day would go unfulfilled because APES AREN'T SELLING. GameStop is done selling off additional shares, and the whales can't sell because their shares are likely lent out at insane interest rates to the fucks creating the synthetic shares. Right now they're producing shares at anywhere from 6 to 9 times as many shares as are being sold by long positions in order to fill buy orders. \n\nLet's do a little math here. According to NASDAQ, GME averages 7.66 mil in share volume daily. If it's reporting a 6:1 buy to sell ratio, that means just over 6 million shares are being bought per day. I'm not sure if it works exactly like this, but I would assume the net difference is the true reflection of shares created (6M buys with 1M long sells). So we're looking at roughly 5 million synthetic shares needed daily in order to fill all of those buy orders, seeing as I highly doubt any buy orders at market price are going unfulfilled. If retail has owned the float since March (just over 3 months), then HFs have needed to create nearly 450M shares JUST TO FILL THE BUY ORDERS (5M shares/day for 90 days). If they were to abruptly stop, the buy pressure would be so tremendous we would see a huge price jump followed by margin calls galore. Now it's unlikely they all stop at once, so odds are it will be a price curve as we see smaller short sellers get margin called and no longer be able to naked short. But every day these HFs will have to keep spending more and more on interest just to maintain their position, much less gain any ground. There is literally no way for them to win this, as there's nothing they can do to buy back the float unless every single ape sells all of their shares. \n\nI'm buckled in.\n\n\nEdit: ok so my theory on buy/sell ratio is off but it doesn't change the fact that synthetics are absolutely needed daily to keep the price from mooning.",
    "title": "It wouldn't even take HFs covering to trigger MOASS, it would happen if they just stopped naked shorting.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o60kvl/it_wouldnt_even_take_hfs_covering_to_trigger/"
}