{
    "author": "Technical_Challenge",
    "created_utc": 1626188665.0,
    "distinguished": null,
    "edited": false,
    "id": "ojhgph",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ojhgph",
    "num_comments": 580,
    "permalink": "/r/Superstonk/comments/ojhgph/a_journalists_view_on_gme/",
    "score": 6916,
    "selftext": "Good Morning, Afternoon or Evening Apes!\n\nHappy Tuesday. Hope you are all had a fantastic weekend relaxing and taking it easy.\n\n**AN INTRODUCTION**\n\nFirst of all – an introduction. I will need to be vague about certain parts but will endeavour to introduce myself best I can. I have worked as a journalist in media at all levels from local newspapers & TV stations – all the way to the national & international stage. I have travelled around the world and reported on every major news event you could imagine. I have also won numerous international awards around the world for my work.\n\nI am more than happy to verify my identity to mods of r/Superstonk to help give this post a little more authority and meaning. In fact I would encourage someone from the mod team to reach out because I don't want to be labelled as a fake. \n\n**WHY ARE YOU MAKING THIS POST?**\n\nI wanted to put together some thoughts and share with you those thoughts. These include thoughts about the work being done here, the level of research & quality. I also wanted to dive a little deeper into why you are seeing the media act the way they are, and why this story is not the front page of every newspaper or lead story on every TV network on the planet. I want this to be a bit of a different DD - a \"cultural DD\" rather than a technical DD , so I can try and explain what is happening in the media at the moment, and how we got here. \n\n**FIRST OF ALL –  CONGRATULATIONS**\n\nFirstly – I want to congratulate the research and DD writers on this sub.\n\nWithout a doubt – the quality of DD, research and investigative journalism that is on display here is unlike any I have seen in my career.\n\nIf the system wasn’t corrupt to its core – some of you would be, in my opinion, in line for some of the most prestigious awards and accolades for investigative journalism (more on that latter)\n\nOnce again, I will reiterate. The kind of DD & in-depth analysis that we are seeing in documents like House of Cards is some of the most well thought out, researched and important information I have ever seen. If you knew the stories I have been involved in, you would understand the weight of this statement.\n\n**What is being discussed here on this sub is the most important thing in the world right now.** We have stumbled across the largest criminal racket on the planet, in history. It affects every single person, and the criminality and corruption is something that has stolen trillons of dollars from billions of people around the world. For the first time in history, a think tank with different sets of skills, talents and abilities saw the data and worked out what was going on – and they did it in public, not behind the closed doors of some board room or towering sky scrapper. All the research and information are right here for everyone to see. More importantly - the DD is peer reviewed. There is a healthy debate, and many times things are debunked. This is incredibly healthy.\n\n**IT’S JUST ONE BIG CLUB**\n\nMedia concentration is one of the biggest crimes that has happened to humanity. If you are old enough to remember, it wasn’t that long ago that there was thousands of newspapers, TV stations and radio stations around the country that were independent. They were run by local families or often were set up by a wealthy individual. You use to know the family who was running the local TV station - you would see them at church, or at the supermarket. \n\nOver time that independence has died. Almost everything you read, watch and listen to is now controlled by only a handful of companies. This includes both factual programming such as news, but also entertainment such as movies and TV Shows.\n\nSome of the main players are\n\n* News Corp\n* WarnerMedia / AT&T\n* ABC Disney\n* ViacomCBS\n* NBC Universal\n* New York Times Company\n* Sinclair Broadcasting Group\n\nThese companies have controlling interest in a lot of what the world reads and watches not only in the United States – but around the world.\n\nMany times these companies will also take a 33% or greater stake in a foreign media company to have a footprint in additional markets / countries as well. There is also affiliate deals that happen – so there are a few local news companies that own hundreds of “local” TV Stations – but in essence they are still run by a corporation.\n\nAn example of this was Sinclair – who owns hundreds of local TV stations sent a “Must Run”. Must Run’s are things that are mandated to be reported on or played in the local TV network. In my experience they are rare, but they do happen. You can see what a “must run” looks like in this clip below\n\n[https://www.youtube.com/watch?v=\\_fHfgU8oMSo](https://www.youtube.com/watch?v=_fHfgU8oMSo)\n\nMany of the companies you get your information from are also multi layered in their ownership.\n\nTake for example the website MarketWatch. They are owned by the company “Dow Jones & Company” – who is then owned by News Corp – who is owned by Rupert Murdoch. Of course NewsCorp then owns Wall Street Journal, Fox Business, Fox News….\n\nIt’s all the same owner.\n\nAnd TRUST me when I tell you this – the owners of all these media conglomerates all have each other’s phone number, and do talk to each other and have lunch more often than you might realize.\n\n&#x200B;\n\n[The Mouse owns the world](https://preview.redd.it/2057xwo5qza71.jpg?width=2500&format=pjpg&auto=webp&s=da4ddd7295e0de871780325340c3c1ece51be8a1)\n\n&#x200B;\n\n**THE GREAT DUMBING DOWN OF AMERICA AND THE WORLD**\n\nOne of the great (and many crimes) that has happened in the United States in the last 50 to 60 years has been what I call “The Great Dumbing Down of America”\n\nIn my opinion, there has been a very strong effort to keep people uninformed about what is happening to them and their life, while at the same time also slowly reducing the attention span of the average adult.\n\nI can’t even begin to tell you how many times important stories have gone to waste because they couldn’t be explained in under 1 minute 30 for a TV news piece. How the FUCK do you try and explain to the entire world something like MOASS or how billionaire hedge funds have been using peoples pensions and savings to gamble on insane investment products and hiding illegal behavior – the simple answer is you cant.\n\nA perfect example of how this dumbing down of America can be seen in one of my brothers. I have tried so hard to sit down and show him the evidence and ask him to read things like “House of Cards” or other important documents from this subreddit.\n\n**Do you know what his response was?**\n\n**“Is there a TikTok length video that can explain this?”**\n\nThat’s where we are right now. We don’t have an adult population capable of dissecting large amounts of complex data or information, and with the invention of Instagram, TikTok etc – the attention span is getting worse, and worse. It’s not just the population – about 85% of the journalists I work with can’t digest or understand the data I have shown them with regards to the GameStop saga.  How do you think the public can be informed when the people that are meant to inform us cant even understand whats going on?\n\nThat’s how these mother fuckers get away with it. Because they KNOW the population including journalists are now at a point where they a) don’t have the comprehension skills to deal with it and b) don’t have the attention span to even TRY and comprehend it.\n\nIt’s the greatest crime that has happened to this country. Not only has the comprehension levels gone to an insanely low levels, but they are actively pricing out many young people from a decent college education – and in my opinion College has started to become a large group think exercise, and not the free thinking place it use to be. This has eroded skills like critical thinking to a dangerously low level. \n\nAnd a final note on the Great Dumbing Down – I believe that we have all seen in the last 60 years an insane level of dictatorship level propaganda that has led the majority of the population to believe they live in the greatest country on earth.\n\nBecause of this red white and blue, flag flying brainwashing – we have led the greater public to simply believe they are living the best life they possible can. When in truth America has severe and epidemic proportioned problems with third world issues such as basic workers rights (such as annual leave and maternity leave), healthcare, education, violent crime, infant and child mortality, high level government and business corruption – and a host of everything else.\n\nI love the United States – and I do believe it’s an awesome country – but we HAVE to start seeing the problems we have that has been caused by corrupt businesses and politicians, and understand other countries figured out how to deal with these issues’ decades ago. We have to start rejecting the propaganda that this is the BEST, number 1 country on the planet, We must start understanding that tens of millions of adults and children are living below the poverty line, and are being left behind. The great lie comes through all forms of media – the movie industry, the nightly news. It is designed to lull you into a sense of “you are doing fine, no need to be any better”. We must strive to be better. We must demand a better level of leadership in this country to make the country better on such basic issues such as letting people take a piss while they are working (I'm looking at you Jeff Bezos)\n\nI really like this clip from the TV show \"newsroom\" that kind of explains what I am thinking.   \n[https://youtu.be/bIpKfw17-yY](https://youtu.be/bIpKfw17-yY)  \n\n\n**DO YOU REALISE HOW LUCKY YOU ARE? THE CULT-ISH MINDSET**\n\nMany of these organisations indoctrinate their staff by having a cult like attitude to the branding of the company they work for – and the name they represent. It is not lost on new staff on the history of some of these organisations – and the people that came before them. They might show them old, famous news reels from major world events. Vietnam War, Desert Storm etc. They might show them the notebooks of old reporters that came before them.\n\nThe idea is to make people realize how lucky they are to be sitting on that desk, in that newsroom. That they are special – and loyalty is demanded of them. **Don't ask questions, don't go against the grain, just do your job.** \n\n**STAFF – A TWO TIER SYSTEM**\n\nPlease note – the information here is regarding large national newsrooms, and not your local newsroom.\n\nThese organisations are run with a top down, fear-based style of leadership.\n\nThe leader of a news organisation will be the head honcho, and many times will be the person calling the shots on how news is covered, and what news is covered. Below them are a number of “lieutenants” – these could be “Vice President of *insert flashy title* here. The point is – that these organisations are run HEAVILY top down.  As a journalist, many times you are simply told this is the story you are covering, now go cover it.\n\nNow as far as staff go – there are two levels of players.\n\nThe first level are the seniors. These are people that have been with the company or industry for decades – and they are compensated well for towing the line and doing their job. Many of these salaries are low to mid six figures for background staff and management – and then on air staff going from the high 6 figures, and into the 7 figures.\n\nThey live a comfortable life, nice big homes, lots of travel with work, and outside work as well. Why would you ever open your mouth and fuck that up? They don’t. They have a great life and its just best to keep being the cog in the machine that makes it work.\n\nThen there are the second level – juniors that are out of college. They are paid okay amounts for a first job but live in constant fear. They live long hours, but are promised that if they work hard, they will get paid more – get to travel – get to do bigger and better things.\n\nFor both of these tiers of staff – why would they fuck anything up? They are both living their own dream – and they want to continue working in these prestigious institutions, getting paid huge salaries and living comfortable lives. No one wants to step out on a limb anymore for stories, they just like getting shit from a press release and taking everything as face value.\n\nNepotism is also a huge issue in the industry. It is very much an oddity if you manage to land a job within one of these major organisations without knowing someone on the inside. The amount of people who are nieces, nephews, sons, daughters, friends is disgusting. Many times the jobs you see advertised on the career page are done out because rules state they must be advertised externally – they already know who they are employing for many of the roles.\n\n**TWITTER IS DESTROYING THIS COUNTRY** \n\nIn my humble opinon - the art & science of good journalism died when Twitter became a major platform for newsrooms. Where there use to be a really big push to take it easy, take thing slow to make sure we get the numbers / figures/ facts correct - modern day journalists are SO quick to tweet something out - even if it is speculation.  Many of the journalists I have worked with a) Thrive of being a \"Blue Ticker\" - it gives them purpose and meaning, and B) Get dopamine hits from how many likes / retweets they get from their tweet. \n\nThis is also why we have seen a HEAVY increase in the last few years of what I call \"Activist Journalists\". People that tweet things to get reactions because they crave the attention. I think we all know one ass clown that craves attention in the financial world more than most - that clown Cramer.   \n\n\nI have had some journalists sit down with me, and spend a ridiculous amount of time coming up with snarky ways to say something - they get their thesaurus app out to find words that are longer to sound smarter. It's pretty fucking pathetic. Many of them REALLY get off on being popular on Twitter.\n\n&#x200B;\n\n**RELATIONSHIPS**\n\nFirst - a picture. \n\n[\\\\\"Journalist\\\\\" Andrew Ross-Sorkin with Shitadel Leader Kenneth](https://preview.redd.it/yhr9dhlcnza71.jpg?width=719&format=pjpg&auto=webp&s=65ff83899461b7e08987bcb3e0d1e3616b535b7d)\n\nMany time people go into this industry with good intentions - but the system gets ahold of them and changes them into someone they never thought they could be.   \n\n\nYou can see the relationships between some people who call themselves journalists, and the likes of Ken Griffen easily if you notice the signs to look for. First of all the body language in this picture above to me says they are much closer than just a Billionaire investor & journalist.  \n\n\nSecondly, many times you will notice the ONLY person on a tv network that always has the exclusives with a certain person is the same person. Look at during the January fuckery how many times Andrew Ross-Sorkin was the guy saying \"I am hearing Melvin Capital has closed their positions\" \"I am hearing Citadel is stronger then ever\"   \n\n\nIts because these people usually have the dudes phone number and are getting texts directly from them. And just like the twitter thing - instead of being a good journalist and asking for proof, or checking another source, they just believe it blindly because they want to a) Help their powerful friend and B) Be the big hero and be first.  It's a two way relationship - they both get something out of it.   \n[https://www.cnbc.com/video/2018/07/23/hedge-fund-billionaire-ken-griffin-markets-bitcoin-real-estate.html](https://www.cnbc.com/video/2018/07/23/hedge-fund-billionaire-ken-griffin-markets-bitcoin-real-estate.html)\n\n[https://www.cnbc.com/video/2021/02/19/citadel-ceo-ken-griffin-i-dont-see-aeconomic-underpinninga-of-cryptocurrencies.html](https://www.cnbc.com/video/2021/02/19/citadel-ceo-ken-griffin-i-dont-see-aeconomic-underpinninga-of-cryptocurrencies.html)\n\nHe even admits in this clip that he took a phone call from Gabe Plotkin and just went on his word that he closed out of GME completely. \n\n[**https://www.youtube.com/watch?v=1HYBo5teFTU**](https://www.youtube.com/watch?v=1HYBo5teFTU)\n\nI tell you one thing - I would fucking LOVE to get Andrew & Gabe under oath and have legal discovery on what was said between them during January, I think it would be very telling of the true situation we are in today.  \n\n\nAny journalist worth half their salt would have asked for additional proof before going on air to say \"Yup, they closed their position yesterday\"  - I smell bullshit. \n\n**I HAVE NO IDEA WHAT I AM DOING**\n\n[When Payday?](https://preview.redd.it/9mi5uy32tza71.png?width=455&format=png&auto=webp&s=12b1674d7865397ed9df717f7649e8f999df83f5)\n\nAnother major problem in this industry is we are hiring people with no life or work experience at all. They come into these organisations, told they are God's gift to the world - and told to start doing journalism. They have no understanding of how the real world works, or how real working class people live or survive.\n\nI cant go into names, but I had a discussion with a person years ago with knowledge of the industry about how many financial journalists actually understand what the fuck is happening - and they said many of them don't understand anything past the basics.   \n\n\n**This is why this sub has impressed me so much - You're looking at data, graphs, charts and SEC filings in a way no journalist has.** \n\nThese people are meant to be financial journalists, and many of these people couldn't read a chart or SEC filing to save their life. I cant read charts or candles - and I will be the first to admit that. And I would NEVER get on a soapbox and pretend I knew what was happening from XYZ chart. But many of these people do... when in reality they are just getting their information from either a press release, or the very people who have vested interest in a story being portrayed a certain way. \n\n&#x200B;\n\n**CONCLUSION**\n\nI feel like I am dragging on a bit - and I am talking like a crazy person, but I don't really know what else to say.   \n\n\nI really just wanted this group to know that the level of research - and the level of peer reviewed research is some of the best I have ever seen. The media don't understand it, they don't get it. Maybe they will after MOASS - but I don't think they will.   \n\n\nI have personally put everything into this basket - I have looked at all the information on hand as a journalist, and as an investor - and I continue coming back to the only conclusion there is.   \n\n\nI don't want this to turn into an AMA - but if you have any questions, please just submit a comment below.  \n\n\nMOASS soon. Have faith!",
    "title": "A journalists view on GME,",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojhgph/a_journalists_view_on_gme/"
}