{
    "author": "Horror_Veterinar",
    "created_utc": 1626217703.0,
    "distinguished": null,
    "edited": 1626238107.0,
    "id": "ojrdhq",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ojrdhq",
    "num_comments": 153,
    "permalink": "/r/Superstonk/comments/ojrdhq/blackrocks_etf_ecosystem/",
    "score": 2441,
    "selftext": "Hello apes. Link to video for directly related to this post can be found on SLIDE one of the PowerPoint below.\n\nEDIT:\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\nXTSLA, the BlackRock fund, IJR and IWM update:\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nIJR: Down 0.1% weight. Down -44k shares\nIWR: Down 0.5% weight. Down -77k shares\n\nEDIT:\n\nIWN, IWM, AND IJR ALL HAVE THE BLACKROCK FUND XTSLA IN THEM\n\nHOLY TITS\n\nEDIT: Since making these posts, these headlines have came out:\n\n&#x200B;\n\nhttps://preview.redd.it/mn4dizuen2b71.png?width=494&format=png&auto=webp&s=a8feef803739fa20d001399d6d8a8697bf9b506b\n\n&#x200B;\n\nhttps://preview.redd.it/ljiknf7kn2b71.png?width=838&format=png&auto=webp&s=b4282029e7edecc1423e11c3a4ca7e2e4ddc3d31\n\nAnd this came out after my post that I made yesterday:\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/cy53rgrko2b71.png?width=610&format=png&auto=webp&s=82eb9db22019649bf2222824b0772d4a4b9ca937\n\n[POWERPOINT](https://1drv.ms/p/s!AgLOXVUYbs6Vg0pocVjiqBEIWHiY?e=Oxn4ML)\n\nThe PowerPoint going along with that video is available here:\n\nSo I started to dig a little further.\n\nBefore I begin, I feel it's relevant for those of you who are not familiar with me to give a slight background. If you don't GAF, then please skip to the next section. I just know that Youtubers are shunned here, but I'll explain why that shouldn't be the case for me:\n\nI have a YouTube channel that I created back in late March to actually try and help the YouTube community learn something rather than follow a bunch of hyping popcorn stock salesmen.\n\nI'm not in it for subs, views, or money, as I think at this point I've made that very clear. I'm in popcorn stock and GME, spread about 80% GME, and 20% AMC. My subs are aware of this, and I've taken shit for it, however, I don't care. My subs know I'm on YouTube for one reason: to NOT be like the others. To bring out facts in the most accurate and informative way as possible, and while saving the viewer's time. YOUTUBE IS NOT FREE. THE VIEWER IS THE PRODUCT. That's why my videos are always short, and to the point, ironically other than this one. (first one this long ever other than live)\n\nThings I've done showing I support APES, and not HYPE:\n\n\\*made several videos going over the AA situation with Centricus, Citadel, the offerings, leadership differences\n\n\\*called out Tom Zuzolo for promoting his business\n\n\\*called out BAM for promoting the \"model\" he stole from a White Paper called \"Model of Behavioral Analytics\"\n\n\\*Called out Lou for lying to his subs about his crimes\n\nAnd I'm still here! Anyways, that's that. Onto the DD!\n\nSo this post is referring to a resource available at the iShares website:\n\n[https://www.ishares.com/us/literature/investor-education/ishares-investigates-authorized-participants-market-makers-part-1-en-us.pdf](https://www.ishares.com/us/literature/investor-education/ishares-investigates-authorized-participants-market-makers-part-1-en-us.pdf)\n\n&#x200B;\n\n&#x200B;\n\n[ETFs Explained, Slide 1](https://preview.redd.it/jbmfia8332b71.png?width=1431&format=png&auto=webp&s=1564151474a3de32550a79535ece05583b1a88b2)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nBACKGROUND:\n\n&#x200B;\n\nSo yesterday, I started looking into the ETFs IJR and IWM, both issued by BlackRock. For time's sake, please refer to this post my latest post before this in my profile.\n\n&#x200B;\n\n&#x200B;\n\nOkay, so now that we know that IJR, the ETF with the most exposure to GME (9.6 Million shares) is trading ABOVE GME's daily volume, let's look at how this shit all works according to BlackRock:\n\n&#x200B;\n\n[Basically, AP's, or Banks, such as JP Morgan, manage creation or redemption of ETF shares, which manages the shares outstanding.  The Market Makers, Jane Street and Citadel, provide a key role by providing liquidity to the ETF Ecosystem that ensure \\\\\"CONTINUOUS AND EFFICIENT ETF TRADING IN THE SECONDARY MARKET\\\\\" They are BOTH NEEDED for this process to work, but APs and Market Makers can play both roles in \\\\\"certain ETFs\\\\\".](https://preview.redd.it/pkdc36d142b71.png?width=933&format=png&auto=webp&s=7ebe69e0bbadf7a68660c8f2c870dd55ce5e0f76)\n\n&#x200B;\n\n[Shows the Ecosystem, with some ape-speak added in.  Outside square is the creation process, and the smaller square is the redemption process.](https://preview.redd.it/kgqy4koi42b71.png?width=907&format=png&auto=webp&s=b789738effa1f41f74d6f333c65590bcac8b67b4)\n\nOkay, so now we know that Banks, Hedge funds, and the Issuer, being BlackRock in this case, are all REQUIRED to make this process work smoothly.\n\nCitadel / Jane Street provides the LIQUIDITY, Banks manage the shares outstanding / creation and redemption process.\n\nBlackRock provides the ETFs agreement with the banks, and issues the ETFs.\n\nSo according to BlackRock, this there's TWO ways you can go about the creation process:\n\n&#x200B;\n\n[\\(full picture in powerpoint\\)](https://preview.redd.it/9nml6fe952b71.png?width=778&format=png&auto=webp&s=a94531ce7c60881d3dd59e1057e034b743f1ab42)\n\nSo it says here, that when DEMAND for ETF shares exceeds the supply of shares available in the market, APs (Banks and/or Market Makers) work with ETF providers (BlackRock) to create additional shares.\n\nAn AP (Bank and/or Market Maker) can initiate creation in TWO WAYS:\n\n1. Delivers the *Creation Basket*, which is just a fancy way of saying bundle of securities, in this case, to BlackRock. Done with REAL SHARES.\n2. Provide CASH EQUAL TO THE FULL OR PARTIAL VALUE to BlackRock.\n\nNow, I don't know about you, but if I had to guess, I'd say that there's no more real Baskets of GME laying around, since we've already eaten those all up A LONG TIME AGO, so they're likely paying cash.\n\nNow, in return, BlackRock will deliver the \"synthetic shares\" to the...SYNTHETIC ETF.\n\nhttps://preview.redd.it/s3ylgx4862b71.png?width=578&format=png&auto=webp&s=562e44afc04979011819d51ade35ad01623679c6\n\nWHAT THE MICHAEL BURRY IS GOING ON HERE?\n\nLet's look at the redemption process:\n\n&#x200B;\n\nhttps://preview.redd.it/eam77d7j62b71.png?width=708&format=png&auto=webp&s=0febcfbd66574611bf85f1ff2b7b2afb78cfd7ce\n\n\"Conversely, when there are too many ETF shares outstanding\" due to more investors selling shares than buying in the secondary market (retail market), or SUPPLY EXCEEDS demand, a Bank or Market Maker will buy ETF shares on the exchange and return them to the ETF issuer.\n\n&#x200B;\n\nDING DING DING!!! THIS IS WHAT WE NEED TO HAPPEN.\n\n&#x200B;\n\nHowever, we're not done here. They can either be \"obtained by inventory\" or \"purchased on the exchange\".\n\n&#x200B;\n\nObviously, method two would make us go boom boom. How do we make that happen again?\n\n&#x200B;\n\nOh, yeah! DEMAND. Let's look at the outstanding shares!!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/5p2txhu872b71.png?width=1105&format=png&auto=webp&s=46703426c8750a246cf7830d2a414577ccc3ab3f\n\nSHARES OUTSTANDING: 632,650,000 AS OF JULY 12TH\n\nBID ASK SPREAD 0.01%?\n\nDAILY VOLUME 11 MILLION?\n\nETF IS GOING ON HERE?\n\nSo based on what we learned thus far, seeing the Bid/Ask spread at 0.01% means Market Makers are not making much profit.\n\nIts' traded on NYSEArca, which if you look, was 80% short on GME based on the volume for yesterday. Will edit and provide an update for today later on.\n\nSo we know the demand is already overinflated based on the shares outstanding. We know that the fund has the most exposure to GME out of any other ETF on the market, and we also know that BlackRock is the issuer of this ETF.\n\n&#x200B;\n\n[This last caption concludes where I've left off, and where I'm starting to dig more.](https://preview.redd.it/nps40dyz82b71.png?width=1454&format=png&auto=webp&s=07aabc4f87c6751b346c5179e423c7810058a1c6)\n\nIf you notice, XJR has a much lower amount of shares outstanding, as well as a much lower exposure to GME.\n\n&#x200B;\n\nBut they have one thing in common:\n\n&#x200B;\n\n&#x200B;\n\n[They Both hold the TXSLA fund, or BlackRock's CASH FUND.](https://preview.redd.it/qdw02x0692b71.png?width=962&format=png&auto=webp&s=3b889c8f70448d4017e660d8c8ec7c54fff7e9f1)\n\nWhat do we remember about CASH?\n\nIt's needed for CREATION in synthetic ETFs as use for collateral.\n\nBased on all of this, is it possible that BlackRock has its' own fund inserted into both of these ETFs to funnel cash where needed to create more shares just to inevitably deliver to the banks, who then just go and sell them into the market, creating more artificial demand, calling for more artificial creation, but yet preventing MOASS at the same time?\n\nI feel this is important, and will continue working diligently on this.\n\nTL;DR\n\nIJR is a Synthetic ETF issued by BlackRock, that's #2 holdings are BlackRock's CASH FUND, and GME.\n\nAccording to BlackRock's own definition of its' ecosystem, large shares outstanding means that shares need to be sold into the market. The problem is, they're all synthetic, which in turn creates more artificial demand for the underlying ETFs. BlackRock's CASHFUND could be a tunnel of money flow between IJR, and IJX, another, smaller ETF with very little shares outstanding, and very little exposure.\n\nWill they just keep inflating ETFs, while using the extreme amount of married OTM Puts/Calls from Jane Street / Citadel, and others to keep the bid/ask spread 0.01% or lower, then move onto the next, rinse and repeat? Or does this come to an end? How big can the bubble get?\n\nThis shit is getting crazy, and nothing these people are doing makes any sense.\n\nAs Michael Burry said:\n\n\"The room is crowded, there's about to be a fire, and only those closest to the door will get out.\"\n\nTalk to you latERR! TO MOON!\n\n\\[LACK OF EMOJIS\\]!!!!!!!!!!!!!",
    "title": "BlackRock's ETF Ecosystem",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojrdhq/blackrocks_etf_ecosystem/"
}