{
    "author": "Munoz10594",
    "created_utc": 1626218565.0,
    "distinguished": null,
    "edited": 1626318274.0,
    "id": "ojrn47",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ojrn47",
    "num_comments": 412,
    "permalink": "/r/Superstonk/comments/ojrn47/jp_morgan_why_todays_earnings_release_was_good/",
    "score": 8405,
    "selftext": "Alright guys. We had our first day of earnings season, and while the banks posted big earnings there's reason for pessimism moving into the 2nd half of the year.  I'll be focusing on the corporate investment bank portion of the earnings in this post. This is my best attempt at foreshadowing what's to come based on how their investments performed and what we could expect from other banks based on JP Morgan Chase Corporate &amp;amp; Investment Banks earnings report. I am not perfect and this could be completely wrong, but I'm confident in my analysis and open to criticism. If this was posted earlier I apologize. Just got off work and had some time to sift through the earnings and thought this was important.\n\nEDIT: Link to my post on Goldman Sachs...  [(59) Goldman Sachs &amp;amp; Why todays earning release was good for GME : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/ojuvh1/goldman_sachs_why_todays_earning_release_was_good/) \n\nEdit2: Link to post on Bank Of America: https://www.reddit.com/r/Superstonk/comments/okjs13/bank_of_america_why_todays_earning_release_was/\n\n**TL;DR: JP Morgan Chase Investment Bank posted a net revenue slump of nearly $1 billion in whats been a bullish market. Real revenue slumps couldve been much larger if not offset by other factors. Moreover, They are compressing margins and thus warned hedge funds of margin calls/liquidations. They also pulled out of the Depository Trust Company (DTC) for their Municipal Bond Dealer, possibly due to a 44% net revenue decrease. In other words, the house of cards is crumbling and we've been watching it this entire time and we called it. Enter cheat-code: SHOW ME THE MONEY**\n\nJP Morgan Chase Investment Bank posted a net revenue decrease of 9% in Q2 2021 with net revenue of $13 Billion. Q1 saw a net revenue of $5.74 Billion and Q2 was $4.99 Billion.\n\nCorporate banking revenue was at $5.1 Billion (+1%) and Investment banking revenue was at $3.4 Billion (+1%). The only reason they turned a small gain in net revenue here is due to a 25% increase in fees.\n\n**In addition, JP Morgan received $1.5 billion in wholesale payment revenue (+5%) but offset by margin compression.** In other words, corporations or investors had to deposit more money due to JP requiring more to cover margin trading accounts to prevent margin calls and this offset their net revenue gains in wholesale deposits. **JP Morgan is tightening down on their leverage to reduce risk and required at least $1.5 BILLION IN MARGIN DEPOSITS! MEANING MARGIN CALLS WERE LIKELY ISSUED BUT MET!**\n\nMoreover, lending revenue was $229 million **(-15%)** due to lower net interest revenue. Meaning they realized a decline in revenue from interest bearing liabilities like commercial loans and securities. Could be because of closed/satisfied loans or defaults on loans. I'm not sure about you, but I've seen the unfortunate closing of many small businesses in my area and different states so I'm leaning towards this being the reason why they've made a net-loss here.\n\nMarkets & Securities Services revenue was $8.1 Billion **DOWN 28%** so they are legit bleeding this money. That's 28% net revenue decline in just 1 QUARTER! The following is the breakdown:\n\nMarkets Revenue was $6.8 Billion **DOWN 30%**! *What the f JP?* This breaks down into 2 buckets for JP:\n\n*Fixed Income Markets and Equity Markets:* Fixed Income Markets revenue was $4.1 Billion **DOWN 44%!**  JPMORGAN CHASE BANK/CORPORATE MUNICIPAL DEALER recently was removed from the DTC and this is probably why! Equity Markets revenue was $2.7 Billion (+13%) and is their other investments in the stock market. Seems like they did okay here and offset some of their huge slumps in the Fixed Income market. Still a huge net-decline.\n\n*Securities Services Revenue:* was **$1.1 Billion (-1%)** and was mostly driven margin compressions, meaning margin deposit requirements. Again, margin calls were likely issued at some point this quarter! They also had a net revenue gain of $233 Million from Credit Adjustments &amp;amp; *Other* because of valuation adjustments this year. This is huge because this is driven by the funding spread on derivatives.\n\nF in the comments for JP Morgan. Looks like the end is near for at least one of our friends and their friends.\n\n*This is not financial advice and is just my opinion on what the earnings report means for JP Morgan. I'm just a retard who likes to gamble and loves GameStop stock.*\n\nSources:\n\n1. [(43) JP MORGAN WARNS HEDGE FUNDS TO EXPECT MARGIN CALLS🚀🚀🚀🚀 : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/ojdfqi/jp_morgan_warns_hedge_funds_to_expect_margin_calls/)\n2. [JP Morgan warns hedge funds to expect intraday margin calls - Risk.net](https://www.risk.net/investing/7853221/jp-morgan-warns-hedge-funds-to-expect-intraday-margin-calls)\n3. [To: (dtcc.com)](https://www.dtcc.com/-/media/Files/pdf/2021/7/13/15625-21.pdf)\n4. [2Q21 Earnings Press Release (jpmorganchase.com)](https://www.jpmorganchase.com/content/dam/jpmc/jpmorgan-chase-and-co/investor-relations/documents/quarterly-earnings/2021/2nd-quarter/e5628b2a-f923-4c04-8008-58236a2f7999.pdf)",
    "title": "JP Morgan & Why todays earnings release was good for GME",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojrn47/jp_morgan_why_todays_earnings_release_was_good/"
}