{
    "author": "Dismal-Jellyfish",
    "created_utc": 1625358996.0,
    "distinguished": null,
    "edited": 1625429715.0,
    "id": "od9tt1",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_od9tt1",
    "num_comments": 67,
    "permalink": "/r/Superstonk/comments/od9tt1/a_deep_dive_into_some_more_of_the_data_released/",
    "score": 1022,
    "selftext": "[Hello, r\\/Superstonk Jellyfish here!  ](https://i.redd.it/k2eixqtt63971.gif)\n\nI want to continue [trying to tie data](https://www.reddit.com/r/Superstonk/comments/od11xo/a_dive_into_lina_khans_first_meeting_as_ftc_chair/) from posts this week together. Specifically, the [jobs report](https://www.reddit.com/r/Superstonk/comments/ocjp7f/us_department_of_labor_june_update_in_june_2021/) and [census report](https://www.reddit.com/r/Superstonk/comments/ocj7ko/us_census_bureau_household_pulse_survey_62_of/).\n\nU.S. Department of Labor June Update: In June 2021, the unemployment rate was 5.9% and added 850,000 jobs to the economy, including 343,000 jobs in leisure and hospitality. The economy is growing faster than at any time in 40 years BUT is still 9 million jobs short of pre-pandemic job levels.\n\n14.7 million people are still claiming state or federal unemployment benefits, including 11 million people on federal PUA or PEUC benefits. [There are definitely record fraud claims in](https://abc7chicago.com/ides-unemployment-in-illinois-fraud-report/10367159/) these numbers, but it is a LOT of real people too!\n\nAll of this when average hourly earnings for employees on private nonfarm payrolls went up by 10 cents per hour in June, from May to $30.40, after having risen 13 cents in May and 20 cents in April, for a 43 cent per hour increase in three months, or 5.7% annualized.\n\nhttps://preview.redd.it/z7z961e693971.png?width=1455&format=png&auto=webp&s=91a2fe87ea1af4f2e92e1060844138325c219a7e\n\nI think that number is a bit misleading (white-collar higher-paying jobs haven’t shut down like the service industry for example, so this skewed wages upward) BUT there is definitely a push upward on wages in general in the market.\n\nLower-paid employees being pulled back into jobs in large numbers, and this should push down average hourly wages (since those working before were more 'highly skilled'/paid?\n\nThe fact that the average is still rising despite the influx of lower-paid workers shows just how much pressure there is on wages at the moment though. Even with republican states ending [expanded pandemic unemployment benefits](https://www.cbsnews.com/news/unemployment-benefits-states-end-federal-aid/) altogether in most cases.\n\nStill, even with the big 850k + jobs report, we're still down 9 million jobs from before the pandemic started--remember [the head of the Minneapolis Fed Neel Kasharki](https://www.reddit.com/r/Superstonk/comments/oblqlb/us_bureau_of_economic_analysis_bea_announced/h3oilba) says people returning to work will tamper inflation...(this has me working on another inflation post though, so if you like that topic, stay tuned!)\n\n[credit u\\/assman323232](https://preview.redd.it/n8gzi3of79971.jpg?width=700&format=pjpg&auto=webp&s=69f5c4254ba86c826b4eecc399445cddebc02c12)\n\nBreaking the numbers in the jobs report down further, the leisure and hospitality industry jumped by 343,000 jobs in June, after having added 306,000 jobs in May, since restaurants and hotels are desperately trying to bring on workers. Yet, total employment in the sector was still down by about 2.18 million people, compared to the peak in February 2020, before the pandemic ‘started’.\n\n[https:\\/\\/fred.stlouisfed.org\\/graph\\/?g=SJz](https://preview.redd.it/4svave2b93971.png?width=1463&format=png&auto=webp&s=189299a331156b4bb5881d2200d7d3d59ea8d028)\n\nEmployment in manufacturing up 15,000 jobs following 39,000 jobs added in May, amid widespread complaints by manufacturers that they’re having trouble filling orders because they’re having trouble “finding suitable candidates for current vacancies,” [according to the HIS Markit Manufacturing PMI](https://www.markiteconomics.com/Public/Home/PressRelease/0501c114d9194cb889d175b0ba828bf1).\n\n[https:\\/\\/fred.stlouisfed.org\\/series\\/MANEMP](https://preview.redd.it/8vxcq4dg93971.png?width=1461&format=png&auto=webp&s=8f0f37594c0cb3294ca281bbdf67d7af733716cc)\n\n# So it is labor shortages and not just material shortages causing issues.\n\n# All of this in the backdrop of:\n\n**• Childcare Disruption: Of adults living in households with children, 9.6% were in homes where children were unable to attend daycare/another childcare arrangement because of the coronavirus pandemic in the last 4 weeks.**\n\n**• Children’s Telehealth: Of adults living in households with children, 21.3% were in homes where children had an appointment with a doctor, nurse, or other health professional by video or phone in the last 4 weeks.**\n\n**• Food Assistance from School: Of adults living in households with children enrolled in public/private school, 22.3% were in households where students received food assistance from school in the last 7 days.**\n\n• Household Telehealth: 23.8% of American adults had an appointment with a doctor, nurse, or other health professional by video or by phone in the last 4 weeks.\n\n• Planned Trips: 36.2% of adults are planning to take overnight trips or trips to places more than 100 miles away in the next 4 weeks.\n\n**• Expected Loss in Employment Income: 12.3% of American adults expect someone in their household to experience a loss in employment income in the next 4 weeks.**\n\n• Telework: 23.7% of adults live in households where at least one adult teleworked because of the coronavirus pandemic in the last 7 days.\n\n**• Food Scarcity: 9.7% of American adults lived in households where there was either sometimes or often not enough to eat in the previous 7 days.**\n\n**• Housing Insecurity: 6.2% of adults are not current on their rent or mortgage payment and have slight or no confidence in making their next payment on time.**\n\n**• Eviction or Foreclosure: Of adults living in households not current on rent or mortgage, 32.9% report eviction or foreclosure in the next two months is somewhat or very likely.**\n\n**• Difficulty with Household Expenses: 28.3% of adults live in households where it has been somewhat or very difficult to pay usual household expenses in the last 7 days.**\n\nSo really, there is a shortage of people willing to work under the current system of rising but still, shit wages, shit benefits, and shit working conditions, living in constant fear of one's day-to-day security. This is like a quiet strike, just not really organized, ***yet.***\n\n# Right now there are over 14.7 million people are still claiming unemployment compensation, including the extra $300 a week from the federal government contemplating life decisions.\n\nhttps://preview.redd.it/zhqvl1ps93971.png?width=610&format=png&auto=webp&s=aaad93166bb8554b24bfb088005a9ed3890a4c33\n\nIn my opinion, this is why the brigading rule has come down HARD, as 'they' are petrified, throwing everything and the kitchen sink, and ultimately Reddit wants to avoid being sued in that fallout?\n\nBut look what the Apes of r/Superstonk have accomplished float-wise with 500,000 members just liking, buying, and holding the stock.\n\nLet’s say it’s only 10 million sitting at home (because fraud is *that* rampant?) and they all decide to buy two shares at $202.80 for $405.60 (the last bit of discretionary income they have left say, since 3 stimmies were sure enough to cover us all through this, right ???).\n\n[you can see the 3 stimmy spikes... ](https://preview.redd.it/emc3uax8a3971.png?width=1459&format=png&auto=webp&s=0886880ed03cd8cf03ac9e1f486935e28bdb1c0f)\n\nThat’s a hole that gets 20 million shares deeper and now with something enforcement agencies and politicians fear the most—more voices. Voices that will garner more MSM attention, which will perpetuate more buying…\n\n**This situation terrifies them. They could laugh at Occupy Wall Street since it was a group composed of idealists and people with little skin in the system, railing at the system from the outside. This is hitting them from within, and by their rules.**\n\nIf luck is when preparation and opportunity meet, there is ‘luck’ in this rhyming moment in history. For preparation, Apes who just like the stock have DD and Zen out the wazzoo—the price goes up, hold, the price goes down, hold, the price goes sideways, hold….\n\nThis preparation paired with the opportunity of another 5% of the working population discovering, educating themselves on, and potentially buying tickets to the moon? This is 'LUCKY' and is what is different from 08, there is a big percent of the population willing to reevaluate their lives right now. [This is true across the world as well!](https://www.nytimes.com/2021/07/03/world/asia/china-slackers-tangping.html)\n\nHowever, the more Apes join in this 'attack' (yeah, buying and holding is an 'attack on the system'.../snark) the worse this gets for them.\n\nhttps://preview.redd.it/mw5s4uyhb3971.jpg?width=274&format=pjpg&auto=webp&s=5304ea437a16f601697751f9f1cb6a16cbe6d6b3\n\nhttps://preview.redd.it/aup3ru4jb3971.jpg?width=640&format=pjpg&auto=webp&s=93b5bef99f91cbe19d7a5e99805bd3fd6fc29c06\n\nLast comment /social commentary I would like to make. Yes, the idea of more Apes joining the cause is exciting. But these are the ‘just don’t dance statistics’ too. This just sucks all around and leads to an anxiety-filled environment all around. Hell, even of people who ‘have made it’, [60% of millennials earning more than $100,000 per year are living paycheck to paycheck](https://www.businessinsider.com/high-earning-henry-millennials-six-figure-salaries-feel-broke-2021-6).\n\nWhat is even winning in this current system?\n\nThis is leading to [greater alcohol consumption in America](https://www.theatlantic.com/magazine/archive/2021/07/america-drinking-alone-problem/619017/). Prohibition is not and never is the answer, but the causes of this anxiety and drive to drink have to be addressed.\n\n[https://www.youtube.com/watch?v=3Xa1L01ZNaY&t=144s](https://www.youtube.com/watch?v=3Xa1L01ZNaY&t=144s)\n\n'Like Loki, Maher can be a smarmy worm, but he loves to be right!' I do believe he tries to be an honest broker, please don't hate me if he's not your thing.\n\nSo Apes, on this long holiday weekend, please take care of yourselves and look to the person to the left of you and to the right of you—we are all in this together.\n\nHave a great rest of the weekend and enjoy the fireworks!\n\n[BOOM!](https://i.redd.it/yg7orrgrb3971.gif)",
    "title": "A deep dive into some more of the data released this week. Some of it is bleak, but there is HOPE in here! 🚀🚀🚀🚀",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/od9tt1/a_deep_dive_into_some_more_of_the_data_released/"
}