{
    "author": "utopian_potential",
    "created_utc": 1623657976.0,
    "distinguished": null,
    "edited": 1623670345.0,
    "id": "nzhs3o",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_nzhs3o",
    "num_comments": 472,
    "permalink": "/r/Superstonk/comments/nzhs3o/i_want_you_to_understand_this_they_absolutely_can/",
    "score": 2318,
    "selftext": "TL:DR. The DTCC as a collective can absolutely cause a fake squeeze. This is not a squeeze until its 100,000+ and it is not the MOASS until its 1,000,000+ and how far it goes is entirely dependent on how much apes decide to diamond hand.\n\nTA:DR. Buy (if you can) Hold, Buckle up, and expect all manner of fuckery\n\nThere is a theme I have seen come up quite often and I would like us to have a discussion about it.\n\nPeople say that once it gets passed X amount - a few thousand, then marg will be calling and it will be game over.\n\nTHIS IS FUNDAMENTALLY WRONG.\n\nLike, are you fucking serious? At this point of the game, you actually think there are things that they CAN'T do to the market?\n\n1. IF, the house of cards is as big as our DD suggests.\n2. IF, the major players are as interconnected as we think they are\n\n# THAT MEANS our opponents are every major institution in the DTCC; If not the entire DTCC itself.\n\nWe are talking about bankrupting hediges and market makers until the DTCC feel it. You don't think they will band together to protect that?\n\nNow, They have shown they can limit buying (I don't think they will again). They have shown they can flood the market with fake shares they have shown they can do pretty much whatever the fuck they want.\n\nThe DTCC said to congress that they **\\*waived additional margin requirements in January\\***\n\nYou don't think they will waive those requirements to prevent margin calling?\n\n&#x200B;\n\nSo, they let the price go to 15,000. They flood the market with \"volume\" on the way up and down to make it look like covering. They announce some hedgies go bankrupt. The price crashes back down. The squeeze is over.\n\nThe collective will of the DTCC is absolutely able to make that happen.\n\nIMO this is not a squeeze until its 100,000+\n\nThis is not the MOASS until its into the 1,000,000+\n\nIf this is going to be a squeeze or the MOASS is entirely on what you have the fortitude to diamond hand through.\n\n<3 you Apes  \n\n\n\\*Last edit - depression and shit. If im wrong, that's great!  Not trying to spread FUD. Im just wanting Apes to be prepared for criminals to do criminal shit that is currently regarded as \"impossible\". \n\nI think underestimating them would be a terrible mistake.\n\n\\*typo's and stuff and TADR",
    "title": "I want you to understand this. THEY ABSOLUTELY *CAN* CAUSE A FAKE SQUEEZE",
    "upvote_ratio": 0.68,
    "url": "https://www.reddit.com/r/Superstonk/comments/nzhs3o/i_want_you_to_understand_this_they_absolutely_can/"
}