{
    "author": "visijared",
    "created_utc": 1625938009.0,
    "distinguished": null,
    "edited": 1625973194.0,
    "id": "ohmx88",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_ohmx88",
    "num_comments": 776,
    "permalink": "/r/Superstonk/comments/ohmx88/blackrock_raises_the_inflation_alarm_plans_to/",
    "score": 6041,
    "selftext": "Summary of article from yesterday (not linking it sorry, screw 'em) titled: \"**BlackRock’s chief strategist for Canada on how to position your portfolio for the tougher investment days to come**\"\n\n\\- admits to \"*higher inflation environment emerging*\" over the next several years\n\n\\- \"*we have to find other solutions*\" instead of \"*holding cash or government bonds*\"\n\n\\- over the next year Blackrock is \"*reducing our exposure to government bonds even more*\"\n\n\\- \"*migrating our geographic preferences to regions of the world ... where growth momemtum is pickup up. For example,* ***Europe and Japan***\"\n\n\\- \"*We would very much* ***push back against the idea that investors are going to continue to receive returns*** *in their stock portfolio that they received in the recent past, and* ***even in the past decade***\\*.\\*\"\n\n\\- \"*Part of the struggle is needing to be more active within the bond market, to be making decisions about where to have exposure. This requires quite a bit more due diligence than the kind of set-it-and-forget-it approach that investors used from the early 1980s to, basically, now*.\"\n\n&#x200B;\n\nIn other related Blackrock news;\n\n\\- Blackrock raised over $250m for renewable power generation, energy storage solutions, electrified transportation services and other climate finance in Asia, Latin America, and Africa. This is on the crest of SEC and POTUS pushing Green Energy funding.\n\n\\- \"*Asset manager BlackRock this week* ***downgraded US stocks to neutral*** *and opined that the reopening trade was largely played out in the domestic markets. Thus, in its view, the growth from the economic revival was peaking.*\"\n\n&#x200B;\n\nTL/DR; **Blackrock is again openly hinting at rising inflation, that the Fed is useless, that recent market returns are going to drop off severely, that holding cash/bonds is a bad idea, and that moving into Europe/Japan/Africa/Asia/Latin America (basically anywhere other than U.S.) is a good idea.**\n\n**Their plan to gtfo of the US after shit goes down is going swimmingly as they use clean energy project pitches (and support from POTUS/everyone) to suck up gov funding for offshore industries it already has a monopoly in, and as they continue to invest heavily in Europe/Japan especially.**\n\n&#x200B;\n\nEDIT:  This post is about Blackrock in Canada and not about Blackrock U.S., which iirc is essentially doing the opposite by scooping up all available real estate assets in order to basically turn America into Blade Runner. Sorry for any confusion, apes. I'm referencing Canadian articles only.",
    "title": "Blackrock raises the inflation alarm, plans to exit U.S. investing scene",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/Superstonk/comments/ohmx88/blackrock_raises_the_inflation_alarm_plans_to/"
}