{
    "author": "leisure_rules",
    "created_utc": 1625765646.0,
    "distinguished": null,
    "edited": 1626134493.0,
    "id": "ogc4wf",
    "text_only": true,
    "flair_text": "Question ❓",
    "name": "t3_ogc4wf",
    "num_comments": 308,
    "permalink": "/r/Superstonk/comments/ogc4wf/hey_sec_can_you_hop_off_ph_and_update_the_private/",
    "score": 9853,
    "selftext": "As the title implies, the SEC - or specifically, Division of Investment Management’s Analytics Office - is supposed to share the quarterly update of [*Private Funds Statistics*](https://www.sec.gov/divisions/investment/private-funds-statistics.shtml)\n\nThis aims to provide detailed reporting of the **aggregate investment exposures by asset type for certain hedge funds as well as new analysis of private funds' borrowing, beneficial ownership, and use of stress testing**. I'm no expert, but I have to imagine there'd be some interesting data in the last 3 versions of that report.... the PF forms are required to be filed quarterly by the funds, so where are they?\n\nFilings are grouped by their report date within their reported year: \u0088\n\n* (Q1): February 15 to May 14\n* (Q2): May 15 to August 14 \u0088\n* (Q3): August 15 to November 14 \u0088\n* (Q4): November 15 to February 14\n\nHere's the last one filed for Q3 2020, released back in December, but reflects data from Fourth Calendar Quarter 2018 through Third Calendar Quarter 2020: [https://www.sec.gov/divisions/investment/private-funds-statistics/private-funds-statistics-2020-q3.pdf](https://www.sec.gov/divisions/investment/private-funds-statistics/private-funds-statistics-2020-q3.pdf)\n\n&#x200B;\n\n[donde?](https://preview.redd.it/qwluskzay0a71.png?width=993&format=png&auto=webp&s=d1e22395c643e4338c579a788469bcd09ee00100)\n\n**EDIT**: submitted a request and sent an email to the Records Management Office of the SEC:\n\nhttps://preview.redd.it/9zse15oz91a71.jpg?width=1702&format=pjpg&auto=webp&s=e3fda80a7ba6d5a6959aec4c501fc44fbe982bc2\n\ngoing to call the EDGAR Filer support as well, I'll keep you all posted\n\n**EDIT 2**: I've now sent a few emails and called:\n\nRecords Management Office\n\nChief Counsel's Office (CCO)\n\nTrading and Markets Department\n\nInvestment Adviser Regulation Office\n\n& the EDGAR General Inquiry Line\n\n**NO ONE ANSWERED**, but I left messages, so hopefully someone will take a break from scrolling the latest PH uploads, and call me back.\n\n**EDIT 3:** I think it's safe to say that I'm not going to get an answer today, I'll follow up here and/or create another post when (if) I get a response.\n\n**EDIT 4:**\n\n**Ok I had some more time to dig into these** \\-\n\nafter looking back through the release dates **on the documents themselves** over the past few years (started in 2015), the **4th Quarter of the year prior** (which is the next one we'd be expecting) traditionally **comes out in July/August of the following year**. But in 2020, things got set back:\n\n&#x200B;\n\n* Q4 2015 - released **July** 22, 2016\n* Q4 2016 - released **July** 7, 2017\n* Q4 2017 - released **August** 2, 2018\n* Q4 2018 - released **July** 23, 2019\n* \\*\\*Q4 2019 - released **October 2**, 2020... took 'em an extra few months on this one.\n* \\*\\*Q1 2020 - released December 1, 2020... still about a month behind the 'normal schedule'\n* \\*\\*Q2 2020 - released January 25, 2021... back on schedule...\n\nBut looking at the past two **Q3** releases:\n\n* **Q3** 2019 - Released **May 14, 2020**\n* **Q3** 2020 - released **May 5, 2020**... what? gotta be a typo, right? [It's printed on literally every page though](https://www.sec.gov/divisions/investment/private-funds-statistics/private-funds-statistics-2020-q3.pdf). It's kinda hard to miss. My guess is that if it is a massive typo, it *should* be May 2021, which would track with 2019 and prior. But there's no press release for that one, the latest [this press release from Dec 2020](https://www.sec.gov/news/press-release/2020-313) that I referred to in the original post, which states:\n   * \"The most recent version of the report, published today...\"\n   * The latest release, according to the document itself, came out way back in May of 2020, not December... **leading me to assume that** **we were way behind track here.**\n   * I think that press release was in fact referencing the Q1 2020 report *(even though that paper is actually dated 10 days prior to the PR release... so close guys)*, but it would more or less line up with our 'schedule'\n\n**So looking ahead** and assuming we're back on track - *hopefully without anymore fuckin typos*, this is what we should expect:\n\n* Q4 2020 - should be released any day now if we go on the 2015-2019 average... we'll see\n* Q1 2021 - again based on the above, should be OCT-NOV 2021\n* Q2 2021 - Jan 2022\n* Q3 2021 - May 2022\n\nI will still update regarding any response from the people I contacted, which hopefully will either confirm or deny my projected timeline here. We still don't know if the next one still might not be ready for a few months.\n\n**Between the typos, mis-dated press releases, delays, and lack of response, I still think someone should revoke all of their PH premium access. But for now, I think we can put the pitchforks down and hope Q4 2020 is delivered in the next week or two.**\n\n# FINAL EDIT:\n\n**I just received a reply from an individual in the Analytics Office, within the Division of Investment Management:**\n\n*Good evening*\n\n*I wanted to reply to let you know that consistent with prior years, our* ***2020Q4 Private Fund Statistics report will be published in the coming weeks***\\*. Generally, the Q4 reports are released in late July or August. As you can see\\* [*here*](https://www.sec.gov/divisions/investment/private-funds-statistics.shtml)*, our most recent 2020Q3 report was published in May 2021. As the instructions to* [*Form PF*](https://www.sec.gov/files/formpf.pdf) *and our indicate, annual filers are not required to report until 120 days after the end of their fiscal year, so we take that into account before publishing our reports for a given quarter. More detail on our handling of the data can be found in the appendix of our reports.*\n\n*If you have any additional questions please let me know.*\n\n*Thank you*\n\n*------*\n\nAdditionally, the date on the latest Q3 2020 Report has been updated to **May 5, 2021**\n\n[https://www.sec.gov/divisions/investment/private-funds-statistics/private-funds-statistics-2020-q3.pdf](https://www.sec.gov/divisions/investment/private-funds-statistics/private-funds-statistics-2020-q3.pdf)\n\n**edit to the edit:** \n\n**one more thing to add, especially after going through a lot of these comments, as well as a few of these Private Funds Statistics reports...** \n\nthe SEC as a whole has a lot of bad rap for a lot of legitimate reasons, and while and I'll be the fist one to call them out I want to just point out that the team that puts these together deserves some credit for the work put into these reports. These are some seriously wrinkled individuals that have to sift through thousands of PF forms, verify the data is correct, make amends, and then compile it into a document that hopefully some other people will read and understand. \n\n**So, again, while we should absolutely hold the SEC accountable to the mandates its set out to accomplish, it's good to still recognize work being done on the individual level.** ",
    "title": "Hey SEC, can you hop off PH and update the Private Funds Statistics you're obligated to share every quarter...? You're 3 quarters behind now...",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ogc4wf/hey_sec_can_you_hop_off_ph_and_update_the_private/"
}