{
    "author": "myplayprofile",
    "created_utc": 1622756927.0,
    "distinguished": null,
    "edited": 1622792559.0,
    "id": "nroyh0",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nroyh0",
    "num_comments": 246,
    "permalink": "/r/Superstonk/comments/nroyh0/i_know_you_quant_it_63_trading_analysis_and_a/",
    "score": 3804,
    "selftext": "I'm thrilled so many of you were able to read yesterday's [POST](https://www.reddit.com/r/Superstonk/comments/nqzo1o/i_got_what_you_quant_6221_trading_analysis_and_a/?utm_source=share&utm_medium=web2x&context=3), I really like some of the conversations it's started among 🦍, and especially between 🎮🦍 and 🦍that like movies. Thanks for all the awards, and for everyone that's sent me messages, please be patient, I'll try and respond when I get a chance. If you haven't read the 6/2 analysis post, I advise doing so now. Before today's tea, I wanted to address newer and young 🦍ling's - The action today, especially in the movies, highlights how critical it is to **REMOVE ALL STOP LOSS ORDERS**! Set pricing alerts if you're concerned, reassess things at that time, and if your investment doesn't make sense to you anymore or a narrative has changed make changes as you see best fit, but having stop losses in place plays directly into Citadel's HFT algos that hunt for stop losses and cause paper hands. Don't invest anything into any stonks you can't afford to lose. Understand, the 💎🖐 shown from more seasoned 🦍 that like movies, that were on full display today when the stonk lost half it's value from premarket highs, have been forged through the trials and tribulations on 2021. If you still like the movies, don't be ashamed or regret if you 🧻🖐, learn from it, and understand you are up against incredibly sophisticated HFs & MMs that earn $BILLIONS upon $BILLIONS every year trading. If this seems overwhelming or too difficult, that's normal. Determine your own risk tolerance, and if being involved in this saga seems too high, nothing wrong with sitting on the sidelines and watching the show. This is not financial advice, and please don't be offended if I ignore the questions or messages that I feel like should directed to a financial adviser. THIS IS A MOVEMENT.\n\n&#x200B;\n\nTea Time! New day, more data, thesis from 6/2 remains unchanged. The linear relationship between GME-AMC further deteriorated, and the logarithmic relationship remained the same. Here's a pretty picture -\n\n&#x200B;\n\n[6\\/3 Update - Plot of AMC and GME closing prices - LOG R\\(sq\\) = 0.72; Linear R\\(sq\\)=0.42](https://preview.redd.it/3dc7uceqz3371.png?width=726&format=png&auto=webp&s=97a8d545e659e8a19f2f9255d0d27981abc54273)\n\n&#x200B;\n\nBefore giving my thoughts on today's trading, I'm going to try and clarify some things from yesterday's post. Scroll past if you just want to get to today's tape -\n\n\\------------------------------------------------------------------------------------------------------------------------------------------\n\n* Some 🦍 with statistically savvy wrinkle 🧠's had some good input on R^(2), but there still seems to be some confusion on the point I was making. Using statistics for financial risk analysis is very different than the textbook \"hypothesis\" testing used to analyze data to determine dependency -  i.e. do the numbers in data set \"A\" influence data set \"B\" in a significantly important way. In financial risk, this doesn't matter, because VaR is not trying to prove anything, rather VaR recognizes relationships exist, and correlations with low R^(2) are weighed less heavily than higher R^(2) in the linear algebra/matrix multiplication that gives a single value for a large set of data. I'm going to try and put something together soon that looks into all meme stonks, but until then, I recommend learning more about matrix multiplication and linear algebra if you're into that sort of thing and want a deeper understanding. As a preview, here's a snapshot of example of the matrices my VaR model generates from my pre-pandemic portfolio -\n\n[Correlation Matrix](https://preview.redd.it/u03ae68j54371.png?width=785&format=png&auto=webp&s=95aa2f34d589b96003a20964d6820888b7d1710d)\n\n[Covariance Matrix](https://preview.redd.it/54xnaokp54371.png?width=770&format=png&auto=webp&s=81fb0676e9824b2c57e92a6eda60b9de34060f2f)\n\n* There was also some talk about removing \"outliers\" from the underlying data to improve the linear R^(2). **This is a MAJOR NO in risk analysis**. When your data sets suddenly present outliers, that means it's time for a closer look into the data and some critical thinking, because sudden outliers signify trend changes and potential tectonic shifts that can quickly blow out your VaR if not closely monitored. This usually leads to portfolio rebalancing to get your risk back down to the desired level.\n* I saw lots of comments calling for a $100 AMC ceiling/price target. I want to reiterate, if AMC gets to that level, it does not mean AMC immediately gets dumped, and could even mean the complete opposite. The importance of $100 AMC is that is the point of parity between GME and AMC for hedging, and past that level, any hedge an AMC long position gave to a GME short position begins to quickly deteriorate. Mathematically, this is explained through calculus, i.e. if f(x) = ln(x), then f'(x) = 1/x and the mathematical principle 1/ ♾ = 0.\n* More on the important difference in linear and logarithmic correlations, specially in regards to GME prices. **When AMC and GME shared a linear correlation, the magnitude of price changes throughout the trading day candles was very similar. Now that the linear relationship has deteriorated, and the logarithmic relationship has strengthen, the magnitude of GME price change candles is reduced relative to AMC upticks, and amplified by AMC downticks.** This goes back to the calculus involved with logarithmic correlations given that f(x) = ln(x) and f'(x) = 1/x.\n\n\\-------------------------------------------------------------------------------------------------------------------------\n\nAfter today's trading, I am more confident in the thesis laid out yesterday, and excited to see what tomorrow brings with option expiry. Please take a moment to reflect on the comment the CEO of AMC made today after they announced the 11 million share offering -\n\n&#x200B;\n\n\"*Our current market prices reflect market and trading dynamics* ***UNRELATED*** *to our underlying business, or macro or industry fundamentals, and we do not know how long these dynamics will last\" -AA*\n\n&#x200B;\n\n**ATTENTION 🦍!!! THE CEO OF THE MOVIES** **~~CONFIRMED~~** ***PROVIDES FURTHER EVIDENCE SUPPORTING*** *(Edit 2)* **THE THESIS LAID OUT YESTERDAY!!!!**\n\nNow, did he say verbatim that 🔔a💩 is manipulating the the stock higher due to a dynamic in the stock price that has made it a hedging tool against GME shorts? No, because the PR teams that release public statements from CEO's aren't that blunt, but given what we discussed yesterday, 🦍 can read between the lines, well, at least those that can read...\n\n&#x200B;\n\nTime for another pretty picture -\n\n[Today's Clues - Note Pink and Yellow Circles](https://preview.redd.it/jssbkzde74371.png?width=1668&format=png&auto=webp&s=11522658acb3a50fa7f301443581ebb6029bf34d)\n\n&#x200B;\n\nMain points I want to touch on, are the pink circles really highlight more evidence in support of yesterday's thesis. I am interested in what happened the last 30 min of the day though, and I want to reiterate this point -\n\n* **When AMC and GME shared a linear correlation, the magnitude of price changes throughout the trading day candles was very similar. Now that the linear relationship has deteriorated, and the logarithmic relationship has strengthen, the magnitude of GME price change candles is reduced relative to AMC upticks, and amplified by AMC downticks.** This goes back to the calculus involved with logarithmic correlations given that f(x) = ln(x) and f'(x) = 1/x.\n\nIn the last 30 min of today's trade, it seems like this started to breakdown, so it might be a sign things are changing once again. We'll know more tomorrow.\n\n**TL/DR (for🦍 that can't read) :**\n\n💎🖐🦍➡💩a🔔🎆➡🔥🚀🚀🚀🌙➡🍗🍗🍗\n\n&#x200B;\n\n**EDIT 1:** Shoutout and thanks to the Mods for **SATORI!!!** There's no way yesterday's post would have reached as many 🦍 as it did without it! Also, grammar....\n\n&#x200B;\n\n**EDIT 2:** Changed ATTENTION 🦍!!! verb to be less definitive\n\n&#x200B;\n\n**EDIT 3:** I've gotten many requests to share the data points I've used. I pulled all the pricing data from yahoo finance and used excel.  [GME Data](https://finance.yahoo.com/quote/GME/history?p=GME)  [AMC Data](https://finance.yahoo.com/quote/AMC/history?p=AMC)\n\n&#x200B;\n\n**EDIT 4:** For those visual learners, cred to  u/omishikenshin  recent post showing the dynamic tick for tick here - [https://www.reddit.com/r/Superstonk/comments/nrh23o/when\\_kenny\\_copied\\_someone\\_else\\_homework\\_and\\_got/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/nrh23o/when_kenny_copied_someone_else_homework_and_got/?utm_source=share&utm_medium=web2x&context=3)\n\n\\----------------------------------------------------------------------------------------------\n\n**EDIT 5:** I intentionally did not mention \"short squeeze\" after AA's comment because I do not think this is main driver of AMC's price at this point, but have seen many questions about it, so I'll share my opinion. It's impossible to know if the buying pressure from short's covering is done yet. I've seen posts stating the short positions haven't covered, but only the SHF know for certain if they have. Here's some key facts to consider to help draw your own conclusion - \n\n* Since 5/27, approximately 4 billion AMC shares have been traded\n* AMC had a float of \\~450 million shares on 5/27, and since has completed two share offering, increasing the float another 20 million shares to \\~470Mil\n* From the 13F, on 4/1, 💩a🔔 owned 724,599 AMC shares and 4,110,000 Calls. I don't know what they own today, but have seen posts claiming 11 million AMC I did not verify, because that is a drop in the bucket compared to the share equivalent of their calls. On 4/1, AMC was in the single digits and I believe the highest strike price available in the option chains was 40. This means every call 🔔a💩 still owns from their 13F filing is now in the money. **I don't know how many calls they still own**, but because each option contract is for 100 shares, **IF** they still own 4M+ calls they are effectively long over 400,000,000 shares. That would translate into 💩a🔔 owning \\~85% of the float (400mil/470mil). After AMC's latest share offering, I believe the total number of outstanding shares is approximately 525 million. With 400,000,000 shares, 💩a🔔effectively owns 76% of all AMC stock (400mil/525mil).\n* 💩a🔔 is the largest market maker in the industry. They handle \\~50% of all retail orders, \\~25% of all market orders, and nearly 100% of retail option trades. This is not just AMC. This is every stock and ETF in existence. During the regular market trading session, 1/4 of the ticks higher or lower in ANY stock or ETF in THE ENTIRE MARKET are a result of 💩a🔔 putting their high frequency trading algorithm to use. Let it settle in for a second. Every time you check yahoo finance or refresh your favorite broker app, the 25% of the time the price you see is the price 💩a🔔 executed a trade for ANYTHING. \n\nSo given the facts, IMHO, I think any SHF that wanted or needed to cover their short has at this point because 4 Billion shares have traded hands, and 20 million fresh, real shares have been created. I do not believe all shorts have covered, but do think the ones that were forced to have. I do think SHF naked shorted AMC, but nowhere near GME, because fundamentally movies were always going to reopen after the pandemic - the product they sell is an experience with many repeat buyers, not a \"dying brick and mortar retailer\" selling \"one time purchased goods\". Also, it's much easier for MSM to shout \"LOOK, SQUEEZE!\", because to an untrained eye that's all AMC recent price rise looks like. One of the biggest lessons all 🦍 should take away from everything happening right now, is the MSM is owned by the extremely wealthy, they control the message broadcast to the peasants, and that message is always going to be aligned with their interests. Shout out to  u/omgheatherjana  offering more insight into the MSM here - [https://www.reddit.com/r/Superstonk/comments/nrjcpo/media\\_theorist\\_here\\_lets\\_talk\\_about\\_how\\_to\\_talk/](https://www.reddit.com/r/Superstonk/comments/nrjcpo/media_theorist_here_lets_talk_about_how_to_talk/)\n\n&#x200B;\n\nThis edit ended up being a mini post, but my final thoughts and disclaimer. I was a movie 🦍 until I looked more into 💩a🔔 13F, and 2 weeks ago sold and moved those 🍗🍗 over to GME. Wrote a post stating it [HERE](https://www.reddit.com/r/GME/comments/nh6iz0/the_investment_opportunity_got_me_involved_but/?utm_source=share&utm_medium=web2x&context=3). I do own AMC puts to hedge my GME shares based off the DD's I've shared. Unlike GME, I am not as well versed in how deep SHF are short AMC, AMC FTD's, or the estimates for movie liking🦍's ownership of the float. I fully support movie liking🦍's, and if they continue to like the stonk and 💎🖐, AMC likely goes higher. AA now has fresh capital and new shareholder engagement that undoubtedly adds fundamental value to the stonk. I simply like GME, RC, and exciting potential of NFT integration more than the movies. **The $100 AMC price I've mentioned is not a ceiling, price target, or price level destined to result in an immediate share dump, rather, I think it's the price GME and AMC go their separate ways and begin to write independent stories.** There are still many AMC shares sold short, and covering those shares has and still will impact the price, but **I believe since 6/2, short covering has not been the PRIMARY driver of AMC share price**. GL and Goodnight to all you 🦍s.\n\n&#x200B;\n\n&#x200B;",
    "title": "I Know You Quant It - 6/3 Trading Analysis and a Deeper Dive into the Tape",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nroyh0/i_know_you_quant_it_63_trading_analysis_and_a/"
}