{
    "author": "EtoshOE",
    "created_utc": 1622736248.0,
    "distinguished": null,
    "edited": 1622736569.0,
    "id": "nrh013",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nrh013",
    "num_comments": 140,
    "permalink": "/r/Superstonk/comments/nrh013/liquidity_providers_and_market_makers_and_how/",
    "score": 2120,
    "selftext": "Hello apes! \n\nOver the past months I have picked up bits and pieces like all of you, and I think there is a tie we have failed to respect on a day to day basis: The role of liquidity providers and market makers in a hard-to-borrow stock like GME. \n\nI'm writing this DD to also solidify my understanding, if you spot any gaps or mistakes then discuss it in the comments! I'll update the thread accordingly. **A lot of this will be repetition of prior things, but I hope to link some important points nicely.** \n\n> \"Liquidity provider\" is essentially synonymous with \"market maker.\" Their function is to facilitate trading in securities and other financial instruments by providing a pool of shares, (which they own), so that buyers and sellers can trade easily without having to locate and deal with other individual traders.\n\n^^(https://smallbusiness.chron.com/liquidity-provider-67347.html)\n\nSo, all market makers are liquidity providers and vice-versa. They generate a pool of shares from which investors can buy and sell easily on the market while under the impression you are dealing with other active buyers and sellers in that very moment. \n\nSay you place a buy order for GME at $260 but there is no active seller on the market, a market maker would give you shares out of their pool once there is no higher bid than yours. Once a seller enters the market and places a sell order at $260 (or lower), the market maker will gobble it up and essentially link the earlier buyer with this seller now. Neither the buyer nor the seller would recognize a thing because of these marketmaking middlemen. \n\n> **Market makers are high volume traders** that, you guessed it, provide liquidity **for multiple trading venues** at a time. They are the more traditional choice when opting for a liquidity provider and can include third-party and cross-exchange entities.\n**With third-party market makers, the “party” is usually a hedge fund.** They act as arbitrageurs, sourcing liquidity from other exchanges by hedging their positions in other markets. **Market makers strike a deal with the venue they operate on**, usually asking for a certain profit level for providing liquidity. If the maker’s profits fall below the agreed-upon rate, the exchange will generally pay the difference as per the agreement.\n\n^^(https://swanfinance.medium.com/liquidity-providers-vs-market-makers-everything-you-need-to-know-dcd1c0f46916)\n\nSo, market makers trade volume, not price. They receive and catch buy orders, they receive and catch sell orders, and their purpose is to connect them. If you buy a stock today, you are buying the right to be delivered that stock in T+2 settlement days. Chances are, you are not buying from another real person, but from a marketmaker. Now, Shitadel is not a new case. In the 2000s already there were financial institutions who were operating entirely on the idea not to deliver those shares. In the case of Overstock the legal discovery brought emails to light [(Rollingstone)](https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/) about **Goldman Sachs wanting to fail on delivering the shares**, just like **they never intend to cover their shorts, they never intend to deliver the shares**. That's what the MOASS is: A delivery event. One which is long overdue. \n\nWe talked about what happens when you go on the open market and buy a share: You receive the right to be delivered a share in T+2. Now, as we know, the real shares of all DTC participants are held by the DTC and never leave that place [(Investopedia)](https://www.investopedia.com/terms/d/dtc.asp). So, naturally the outstanding shares are IOUs of those held with the DTC. When you go on the market, you buy an IOU of an IOU, with a T+2 timer. As a designated marketmaker like Citadel who of course wants to fail on all these IOU IOUs, should I call them IOU^2? Or synthetic IOUs? Anyway, they then have T+21 business days to settle these FTDs, where settle means reset or close. How do they reset FTDs? By matching sell orders of today to FTDs from up to 21 business days ago and not linking them to buy orders of today, which will turn into an FTD in T+2, and then start the T+21 timer all over again. How do they close FTDs? Well, if there is a bigger overall buy pressure than sell pressure, **they don't**. Over time their problem just continues getting worse. Right now Citadel has the tough challenge of matching FTDs in the $160-290 range with sell orders at the current price. If they match the higher price FTDs then they make a bigger paper loss on the lower price FTDs, if they match the lower price FTDs first then they start making a paperloss on all recent FTDs, damned if you do damned if you don't. If they are unable to reset all FTDs in time due to *sell pressure recently being lower than buy pressure over the last weeks where they failed to deliver*, they are forced to **reset FTDs by gobbling up all incoming sell orders instead of matching them** to incoming/recent buy orders. This is why the amount of available shares to borrow you see drop at 7:16EST every day does not mean you will see a red day, or even a dip at all. It's also why the other way around, if you don't see any new shares borrowed for the day, it may still be an intra-day dip or longer than. That is because borrowed shares can be used to reset FTDs or simply be returned after some time instead of being shorted, but the threat is too good if you can spam 20% of the frontpage and comments in the daily thread. If they want to catch you offguard by not announcing a sale through borrowed shares, then they can simply offload all recent sell orders all at once while holding back on the buy orders, executing those at the lowered price. Pushes the price down, causes panic, gets paperhands going. Obviously this is a giant sewer pipe and Citadel is trying to stop the massive burst with a ping pong bat, but still, the amount of borrowed shares at this point is nothing more than the modern filibuster: The mere threat of using them is enough to kill opening buy pressure in anticipation of a dip, creates a self-fulfilling prophecy and Citadel has to compete with less buyers to catch orders and reset FTDs. How many threads and comments yesterday warned of the definitive dip that was coming because \"oh my god 700k borrowed shares we're so doomed just get ready\" while we were chilling around $250 and ended the day on a 33USD plus? Please, stop it. The FUD is hidden, but it is strong in this one. \n\nNow, these algorithms are optimized to make a tiny bit on each trade. These algorithms are what wreak havoc, but only on an intra-day basis, each day is a new one for them so to say. These HFTs are toying with you day in day out, in every single stock on the market. The market as a whole makes no gains during market hours, [all gains in the last 30 years have happened outside of regular hours.](https://www.ccn.com/wp-content/uploads/2020/05/After-hours-stock-market-gains.png.webp) [(CCN)](https://www.ccn.com/the-stock-markets-biggest-gains-always-happen-at-the-same-time-each-day/)\n\nMarket makers make their money exactly that way, they want to garner as many sell orders for a low price, and as many buy orders for a high price, match them together and pocket the difference. **Volume = Profit.** But this is all predatory, intra-day performances literally do not matter because this is just HFTs toying with people who check charts all day. If there are more buys than sells in a day, then HFTs make it so that the stock does not have to go up that day. They match the buys and sells to each other, everyone got the trade they asked for, but then market makers, designated or third party, use the premarket and after hours to drive the price in the direction it deserves based on the activities that happened during the day. Instead of the 10 million volume during the day driving the price, it is HFTs using a volume of 100k to drive the price, while during the day wreaking havoc collecting buy and sell orders from market participants, matching them for a profit, then driving the price down at little-to-no cost outside of regular trading hours on little volume. But it establishes itself because that is where the price deserves to be according to recent price action, it's merely manipulated.\n\n**Liquidity providers and market makers argue that this liquidity improves spreads and reduces risk, I argue it is unhealthy to be the literal traffic manager of stocks by introducing a middleman: a systematic vulnerability in an important industry prone to reckless and corrupt behaviors**\n\n**How does this tie into GME?** As HFTs wreak havoc only intra-day, you should ALWAYS zoom out in the chart to see the bigger picture before panicking. But this is no normal stock, last year there was human intervention from the financial players behind these algorithms to flush the market with these IOU^2 (the right to be delivered a share in T+2), with the intention not only to just not cover, but to not even deliver while delivering the deathblow. They were fighting this battle for many years already, last year they failed to finish the job. Since then, it is in each and every single company's hands what happens as they all have squeeze potential. Some act in the best interest of shareholders, others don't. In my opinion, GME is the best among the popular squeeze stocks in acting in the shareholders' best interest and I trust in you apes. What is happening with GME is that shortsellers have hidden their official shorts which are legitimate IOUs which is why the reported short interest is so low, but the price we are seeing now is not a result of that, it is a result of all the additional IOUs, the synthetic ones, the IOU^2, that were generated to curb the January craze: They hid the original 100 million shorted shares through OTM puts or faking the reports for a ridiculously low fine in a year or two.\n\nOnce they have to start covering, they not only have to cover all the FTDs, but then they can actually start covering the 100 million shares they officially sold short. \n\n**How do they make love to T+2 tho?** Well it's simple. This whole middleman mechanic is only possible because of T+2. They are excluding you from the market on the day you are participating and spread out your orders over weeks as it suits them while you sit on your real tendies. Citadel manages 48% of all retail orders, soon to be 0%, but if you move from T+2 to T+1, you are not changing anything at all, except reducing the profit time window of HFTs and marketmakers. **The only way to eliminate this systemic risk is by moving to a T+0, real-time settlement. They are deathly afraid of this, because it removes control from financial institutions and gives it to retailers, power to the players and people.** Instead of your order being hidden for weeks or matched to other orders that don't even exist, this will help return the stockmarket to the reality it was detached from in recent decades. Maybe not the end-all-be-all, but a damn good start to the ape financial revolution. \n\nGet bent all of you predatory liquidity providers, designated and third party market makers, and shortsellers. \n\n*TA;DR: Market makers and liquidity providers are a scam, purely intra-day they distort the market to their advantage and their overall role is to make the movements of a stock relatively smooth. The scam comes from abusing settlement longer than T+0 and the resulting ability to Fail to Deliver, this is taking power from real investors of all kind and giving it to financial institutions with algorithms optimized to skim as much as possible from every trade, while introducing a systemic risk for no excuse other than \"iT rEduCeS sPrEaDs\", allowing more buddies of theirs to take a slice of the pie. The algorithm was beat a year ago, the meeting of Margin Call about the billions riding on a single faulty algorithm already happened last year, it's fucking over. There are ways to initiate share recalls in this peculiar situation, so just*\n***buy hold and vote***. It will not take much longer, they are at the end of their wits and we are about to be* ***richxxfamous***.",
    "title": "Liquidity Providers and Market Makers and how they make sweet, sweet love to T+2",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nrh013/liquidity_providers_and_market_makers_and_how/"
}