{
    "author": "platinumsparkles",
    "created_utc": 1626092564.0,
    "distinguished": null,
    "edited": 1626092823.0,
    "id": "oiq5wx",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oiq5wx",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/oiq5wx/what_if_ryan_cohen_is_trying_to_tell_us_something/",
    "score": 278,
    "selftext": "I thought it would be fun to look at RC's tweets.  It's probably nothing, but how fun is it to think our guy is giving us messages through twitter?\n\nLet's say he knew there was going to be a run-up Feb 24th, well here's the chart for Feb 24th through March 11.\n\n[Feb 24 - March 11](https://preview.redd.it/9qmqaj0atra71.png?width=2100&format=png&auto=webp&s=2970762fa16adf123fe977fa5311486ea68d8979)\n\nWhat if he was telling us to look into the companies?\n\nWell that could be fun---\n\n&#x200B;\n\n# Mcdonald's\n\nWhen I searched for Mcdonald's and hedge funds I got this article\n\n[https://finance.yahoo.com/amphtml/news/hedge-funds-ditching-mcdonald-corporation-172318804.html](https://finance.yahoo.com/amphtml/news/hedge-funds-ditching-mcdonald-corporation-172318804.html)\n\nAccording to Insider Monkey's hedge fund database, **Citadel Investment Group,** managed by Ken Griffin, holds the largest position in McDonald's Corporation (NYSE:MCD). Citadel Investment Group has a $205.7 million call position in the stock, comprising 0.1% of its 13F portfolio\n\nLatest 13f they had 1,719,307 shares of McDonald's.\n\nFucking Shitadel.\n\nOk that's kind of juicy, what's next?\n\n# Pets.com\n\n[https://www.investopedia.com/ask/answers/08/dotcom-pets-dot-com.asp](https://www.investopedia.com/ask/answers/08/dotcom-pets-dot-com.asp)\n\nThe company raised $82.5 million in a February 2000 IPO but filed for bankruptcy nine months later.\n\nBehind the fall of Pets.com, the darker story of underwriting banks and their analysts loomed during the internet boom. Even as Pets.com posted losses and the stock price dropped, the issuing firm's analyst, Merrill Lynch's Henry Blodget, did not change his buy rating until the summer.\n\nSeems like he's in on that bankroll.\n\nKeeping Pets.com in business for as long as possible was in Merrill Lynch's best interest, as the bank was collecting millions in investment banking fees, regardless of the company's condition. This is an example of where the investment bank and equity sides of a bank can play favorites and protect each other. Granted, the idea of a **Chinese Wall**, which is meant to limit this type of collusion, has grown since the dot-com bubble.\n\n**Tell me more about this Chinese Wall**\n\n[https://www.investopedia.com/terms/c/chinesewall.asp](https://www.investopedia.com/terms/c/chinesewall.asp)\n\nThe term Chinese wall, as it is used in the business world, describes a virtual barrier intended to block the exchange of information between departments if it might result in business activities that are ethically or legally questionable. In the United States, corporations, brokerage firms, investment banks, and retail banks have used Chinese walls to describe situations where there is a need to maintain confidentiality in order to prevent conflicts of interest.\n\nThat sounds familiar.  I don't think it's working over at Shitadel.\n\n[https://www.google.com/amp/s/www.cnbc.com/amp/2019/07/25/hedge-fund-manager-einhorn-compares-chewy-to-petscom-during-2000-bubble-in-new-letter.html](https://www.google.com/amp/s/www.cnbc.com/amp/2019/07/25/hedge-fund-manager-einhorn-compares-chewy-to-petscom-during-2000-bubble-in-new-letter.html)\n\n**Here's when Chewy got compared to pets com by a shortie and RC  wrote  an opinion piece disagreeing**.\n\n[https://www.cnbc.com/2019/07/26/opinion-chewy-is-no-petscom.html](https://www.cnbc.com/2019/07/26/opinion-chewy-is-no-petscom.html)\n\nIn Mr. Einhorn’s letter to his investors, he paraphrased Benjamin Graham in saying “Over the short-term the market is a voting machine and over the long-term it is a weighing machine.” I fundamentally agree with this quote, but not for the reasons it appears that Mr. Einhorn does. Just as the daily stock price is no indication of the quality of a business, the quarterly profitability of a company like Chewy has no bearing on the terminal value. We consistently chose to defer profitability in the short term in order to maximize shareholder value over the long term.\n\nValue investing and entrepreneurialism are very much the same in the sense that they require contrarian decisions without immediate payback and run the risk of being misunderstood by the market for long periods of time. We’ve seen this playbook pay off for companies like Amazon and Netflix, but their success doesn’t make it any less nerve racking – especially when you have thousands of employees that depend on you for their job. Without conviction in the underlying economics of the business, I would have found it very hard to sleep at night if I thought our strategy wasn’t in the best interest of those employees, our millions of customers, or Chewy’s shareholders.\n\nAll this to say that comparing Chewy to Pets.com is not only fundamentally incorrect but requires a deliberate misunderstanding of the evolution of e-commerce since the days of 1999-2001, as well as the importance of investing in the long-term viability of the business. While a quick glance may tell you that this business is no different than any other online pet retailer, ask any of Chewy’s customers and you’ll get a very different answer.\n\nEven though I left Chewy last year, I’m extremely proud of the company and team we built. I urge investors to dig deeper into understanding the Chewy business and next time, let’s compare apples to apples. Times have changed.\n\n&#x200B;\n\nMaybe he wanted to give us that message without having to say it again.\n\nThen we have Harry taking a wild shit! Maybe he knew the stock might dump?\n\n&#x200B;\n\nA few days later, he posts a picture of his Dad.\n\n&#x200B;\n\n[RC's Dad](https://preview.redd.it/oslve8siura71.jpg?width=680&format=pjpg&auto=webp&s=4248950253b688a8c5c34e04abf1b710890c9ee5)\n\nIf you didn't know, his Dad is the one who got him into the stock market.\n\n**His Dad**\n\n[https://archive.is/L39dU](https://archive.is/L39dU)\n\nCohen never went to college or had what he calls “a real job.” His father was his mentor and closest adviser while he was building Chewy and taught him the principles of stock analysis, which he took to heart when selecting his stocks. Back in early 2017, Cohen was getting the paperwork together to take Chewy public, while also considering offers. Then his father had a heart attack. “It put things in perspective,” he says. He shelved the initial public offering plans and sold the business. He resigned as chief executive officer of Chewy in 2018 to spend as much time as possible with his father.\n\nHis father died suddenly in December, and the past several months have been rough. Cohen says he isn’t itching to start something new. He’s doing what few high-octane entrepreneurs ever do: taking a break.\n\n&#x200B;\n\n&#x200B;\n\nNow for the second run-up!\n\n&#x200B;\n\n&#x200B;\n\n[May 25 - June 11](https://preview.redd.it/6g2y3kt7wra71.png?width=2100&format=png&auto=webp&s=d05838b80191fbf973ee7eb9a74160b23c8ebc9c)\n\nSometimes the simplest explanations make the most sense.  I think the pool boner was bc he knew it WAS GOING UP!!\n\nOh and it did go up.\n\nTombstone - maybe that's a special message for Kenny :)  that only he would understand.\n\n# Sears\n\nThe primary owner of Sears (SHLD) was hedge fund manager Eddie Lampert. His ESL Investments firm bought a controlling stake in Kmart following its own bankruptcy in 2003 and then merged it with Sears.\n\n[https://www.google.com/amp/s/amp.cnn.com/cnn/2018/10/16/investing/retail-sears-private-equity/index.html](https://www.google.com/amp/s/amp.cnn.com/cnn/2018/10/16/investing/retail-sears-private-equity/index.html)\n\nYou'll notice that Sears isn't the only one that couldn't be saved by the supposedly smartest guys on Wall Street.\n\nAblin added that many private equity investors lack the expertise to effectively make the shift from traditional retail to online commerce and that they were also reluctant to commit more capital for the long-term to transform these struggling retailers.\n\nSears was the fifteenth retailer to file for bankruptcy that year.\n\nHedge fund manager? He's fine.\n\nESL Investments is based out of Bay Harbor Islands and is run by Eddie Lampert. ESL Investments is a hedge fund with 3 clients and discretionary assets under management (AUM) of $750,136,916 (Form ADV from 2021-03-31).\n\n&#x200B;\n\n[https://www.insidermonkey.com/blog/hedge-fund-and-insider-trading-news-eddie-lampert-citadel-investment-group-point72-axon-enterprise-inc-aaxn-strongbridge-biopharma-plc-sbbp-and-more-691936/](https://www.insidermonkey.com/blog/hedge-fund-and-insider-trading-news-eddie-lampert-citadel-investment-group-point72-axon-enterprise-inc-aaxn-strongbridge-biopharma-plc-sbbp-and-more-691936/)\n\n**Citadel** holds a small amount of Sears Holdings Corp (NASDAQ:SHLD) shares as of the end of March and also disclosed owning ‘Put’ and ‘Call’ options underlying shares of the company. Moreover, its latest 13F filings also show that Citadel hasn’t been bullish on Sears, holding small amounts of shares that were hedged with options.\n\n[https://www.insidermonkey.com/blog/billionaire-ken-griffins-citadel-trims-stake-in-seritage-growth-properties-srg-but-its-ownership-increases-363165/](https://www.insidermonkey.com/blog/billionaire-ken-griffins-citadel-trims-stake-in-seritage-growth-properties-srg-but-its-ownership-increases-363165/)\n\n&#x200B;\n\nSo Shitadel has it's hands in everything, no surprise there.\n\nAfter this runup,  another photo of his Dad.\n\n&#x200B;\n\n[I think he'd be so proud right now :\\)](https://preview.redd.it/rz39xaw4xra71.png?width=469&format=png&auto=webp&s=1b33e3c21516c23143a51371fffffc402c55d8ce)\n\n&#x200B;\n\nIt could just mean fuck-all but how fun is it to think the Chairman of the board of a gaming store is playing a game of letting us know hedies r fuk?",
    "title": "What if Ryan Cohen is trying to tell us something?",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/Superstonk/comments/oiq5wx/what_if_ryan_cohen_is_trying_to_tell_us_something/"
}