{
    "author": "rensole",
    "created_utc": 1615722845.0,
    "distinguished": null,
    "edited": false,
    "id": "m4txe0",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m4txe0",
    "num_comments": 451,
    "permalink": "/r/GME/comments/m4txe0/synopsis_for_0308_to_1203/",
    "score": 3941,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nAnd this is the weekly recap\n\n&#x200B;\n\nhttps://preview.redd.it/sop2ixo5azm61.png?width=680&format=png&auto=webp&s=f926b50ff3a6d283344b99f57e962f49ba863fa7\n\nNone of this is financial advice, just recapping the stuff that happened in the past week.\n\n&#x200B;\n\n# The mod team\n\nGuys I want to thank each and every member of this sub, we put a lot of trust in you guys by letting this entire sub be self governing and decide for themselves what is good info and what is BS.\n\nThe only thing some people seem to overlook is that I am not the \"main mod\" or anything like that, this is a group effort.\n\n[**u/BearBiPolar**](https://www.reddit.com/user/BearBiPolar/)\n\n[**u/Toasterrrr**](https://www.reddit.com/user/Toasterrrr/)\n\n[**u/chickthief**](https://www.reddit.com/user/chickthief/)\n\n[**u/SpaceMillionaire**](https://www.reddit.com/user/SpaceMillionaire/)\n\n[**u/thr0wthis4ccount4way**](https://www.reddit.com/user/thr0wthis4ccount4way/)\n\n[**u/oxxadam**](https://www.reddit.com/user/oxxadam/)\n\n[**u/redchessqueen99**](https://www.reddit.com/user/redchessqueen99/)\n\n[**u/plumdragon**](https://www.reddit.com/user/plumdragon/)\n\n&#x200B;\n\nKnow that with the upcoming hype and everything that's happening we will see a huge influx of bots, shills or people who just want to spread FUD, remember to always take a step back, vet their sources and come to your own conclusions.\n\nNever take anyone's word for fact, even mine, double check everything and everyone.\n\nAlso take in mind that there are companies out there who do \"shit talking' for their work, or as someone had linked me an example of someone who used to do this work:\n\n[https://www.investorvillage.com/smbd.asp?mb=445&mn=25514&pt=msg&mid=1288319](https://www.investorvillage.com/smbd.asp?mb=445&mn=25514&pt=msg&mid=1288319)\n\n&#x200B;\n\n# New rules imposed by DTCC signed this weekend.\n\nwell it seems someone is scared some people wont be able to pay up.\n\nCredit goes to [u/LongTermTendieLoser](https://www.reddit.com/u/LongTermTendieLoser/) for initially finding this and bringing it to the boards attention.\n\nThe DTCC just posted this over the weekend\n\n[https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-801.pdf](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/NSCC/SR-NSCC-2021-801.pdf)\n\nSo just to get back to some basics, as I'm sure we will be seeing a lot of new members in the coming days.\n\n&#x200B;\n\n# What Is the Depository Trust and Clearing Corporation (DTCC)?\n\nThe Depository Trust and Clearing Corporation (DTCC) is an American financial services company founded in 1999 that provides clearing and settlement services for the financial markets. When the DTCC was established in 1999, it combined the functions of the Depository Trust Company (DTC) and the National Securities Clearing Corporation (NSCC).1﻿ The NSCC is currently a subsidiary of the DTCC\n\nIf you want more info on this I'd say check out this website:\n\n[https://www.investopedia.com/terms/d/dtcc.asp](https://www.investopedia.com/terms/d/dtcc.asp)\n\nI'd like to thank [u/neversell69](https://www.reddit.com/u/neversell69/) for doing a great writeup which boils this down to it's basic points.\n\nThings found in these pages:\n\n**(page 22):**\n\nAs described above, the proposal would strengthen NSCC’s ability to maintain sufficient liquidity to complete end-of-day settlement in the event of the default of a Member. a member like for example, Melvin and Citadel.\n\nThe proposal would do this;\n\nby allowing NSCC to calculate and collect, when applicable, SLD every Business Day from those Members that pose the largest liquidity exposures to NSCC on that day.\n\nThe proposal would also include a mechanism to allow NSCC to collect SLD on an intraday basis, including on the first Business Day of the Options Expiration Activity Period, when liquidity exposures are historically higher.\n\n**(page 41):**\n\nThe Corporation may require any such Member to deposit additional amounts to the Clearing Fund pursuant to Rule 15.\n\nRule 15 basically says the members can't be fucking idiots and if they are wilding out the NSCC can protect themselves by demanding more money to reduce their risk\n\n**(page 88/89):**\n\n(iv) increased Clearing Fund deposits (including additional amounts required in respect of trade activity received by the Corporation after calculation of the applicable Required Fund Deposit);\n\n(v) additional payments to the Corporation in such amounts as may be determined by the Corporation each morning reflecting a percentage of up to 100 percent of the participant’s (i) average amount of total daily net debit positions or (ii) morning gross debit activity;\n\nWhat's a net debit position? Here's the fucking Investopedia summary because I know your too lazy to Google it:\n\n    If the income collected from all options sold results in a lower money value  than the cost of all options purchased, the result is a net debit to the account, hence the name debit spread. If shit gets really fucked the DTCC can ask for a supplemental liquidity deposit (SLD), which basically means when the market is fucked and the member is looking at a fat options loss the dtcc can make them pay an extra fee to make sure  they can cover the loss  \n\n**(page 52):**\n\nOverview. The Corporation requires sufficient liquidity to enable it to effect the settlement of its payment obligations as a central counterparty. The two principal sources of liquidity for the Corporation currently are deposits to the Clearing Fund and a committed line of credit. A substantial proportion of the liquidity needed by the Corporation is attributable to the exposure presented to the Corporation by its Members who would generate the largest settlement debits during options expiration activity periods in stressed market conditions. In order to ensure that the Corporation has sufficient liquidity to meet its payment obligations, it is appropriate that such Members provide additional liquidity to the Corporation in the form of supplemental liquidity deposits to the Clearing Fund.\n\nThe new rule changes basically means the DTCC can now calculate this **'fat loss fee'** everyday and even during the day and force a payment.\n\nSo the DTCC is covering their ass and are going to liquidate the member themselves when shit hits the fan.\n\naka the DTCC will fucking crucify Citadel/melvin and other Short sellers the day this pops off, and if it does, they will be forced by them to cover all at once. and remember it's not just us retailers, it's also other sharks swimming with us who smell a golden opportunity to take out the competition all at once.\n\nWhat does this mean? it means that the DTCC is covering their own ass, it means they can force the whales who are itm to buy, they can force people who's short contracts are up to pay up and buy back in.\n\nfor the noobs: see this as a Patch being installed, they're correcting the PVP combat because someone was OP and they just now got Nerfed.\n\nI've said it before but the new head for the SEC is someone I actually respect, he was at the helm when the 08 crash happened and he took action to make a hefty legislation against this ever happen again.\n\nGary Gensler, he passed the *Dodd*\\-*Frank* Act, giving regulations to swaps (the thing caused the crash) which until he came along where not regulated at all!\n\nAlso with Senator Elizabeth Warren wanting a investigation into the GME saga.\n\nThese two combined are already making waves right now, so stop asking IF or When the Squeeze will happen, know that we are on the right side of history and this shit is going to get FUCKING wild.\n\n&#x200B;\n\n# New FUD tactics\n\nlots of people are suddenly asking \"who will pay\" and \"what if melvin/shitadel goes bankrupt\"\n\nIDC, just like when I'm selling my car I dont care where the money comes from, all I care about is the cash in hand at the end of the day. how the buyer get's the money is not something I worry about nor care about.\n\ngoogle how the market works, and see why I don't care.\n\n&#x200B;\n\n \n\n# Market isn't even open but we are seeing proof RC is being tapped as the next CEO.\n\n[https://www.reuters.com/article/us-gamestop-activist-idUSKBN2B019T](https://www.reuters.com/article/us-gamestop-activist-idUSKBN2B019T)\n\nGameStop Corp has tapped shareholder Ryan Cohen to lead a shift towards e-commerce, Bloomberg reported on Monday, sending the company’s shares up 10.3% before the bell.\n\nCohen’s RC Ventures activist firm reached a settlement with GameStop in January, giving Cohen seats on the company’s board.\n\n \n\n# GameStop offered a press release, Board Has Established New Strategy Committee\n\n[https://news.gamestop.com/news-releases/news-release-details/gamestop-provides-corporate-governance-update](https://news.gamestop.com/news-releases/news-release-details/gamestop-provides-corporate-governance-update)\n\n&#x200B;\n\n# Deepfuckingvalue just tweeted!\n\n[https://twitter.com/TheRoaringKitty/status/1368952570874654730](https://twitter.com/TheRoaringKitty/status/1368952570874654730)\n\n&#x200B;\n\n&#x200B;\n\n# Media Blackout.\n\nAs some more astute apes have seen yesterday(03-08).... no news on GME?\n\nok that's weird, they've been saying GmE B@d for weeks now, now its in the green... \\*Crickets\\*\n\nWhat makes this more funny is that Jimmy Cramer has gone full blackout, this dude was having multiple tantrums on twitter per day and bitching about GME on \"mad money\" the entire time.\n\nBut now it seems that Jim Cramer's show \"mod money\" wont be on this week, and his twitter has gone black, this in combination with nobody else reporting on the entire thing makes me believe we may be facing a media blackout, this in order to make sure that not more people buy in.\n\nWord of mouth is one of the most valuable things right now.\n\nyesterdays news, nothing on GME?\n\n[https://www.cnbc.com/2021/03/08/discovery-amc-networks-heavily-shorted-huge-2021-gainers.html](https://www.cnbc.com/2021/03/08/discovery-amc-networks-heavily-shorted-huge-2021-gainers.html)\n\n \n\n# Now is the time to gain control of your emotions.\n\nSeriously I get it 200 is an awesome number, less then 2 weeks ago we where at 40, but if your goal is 100.000 K then 200 a share is nothing.\n\nAdjust your expectations and adjust your way of looking at big numbers, because if you hold like a lot of people said, then it will take some days before it gets to 100k , and if you don't adjust your baseline then you will fold early.\n\n10.000 sounds like a lot right? but if I told you you could get a salary of 100.000k its nothing.\n\n100.000 sounds like a lot, but compared to 500.000 its a lowball offer.\n\nITS OK TO BE GREEDY! but be patient.\n\nTrust the other apes, they have held for a long time (over a month) and they didn't fold.\n\nSo trust them now when you are winning.\n\nGreat post about managing behavior with these type of things, I honestly think it's a good read for everyone in GME\n\n[https://www.reddit.com/r/GME/comments/lzxbzm/be\\_adamant\\_some\\_reminders\\_for\\_managing\\_behavior/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/GME/comments/lzxbzm/be_adamant_some_reminders_for_managing_behavior/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\n# DFV tweeted!\n\n[https://twitter.com/TheRoaringKitty/status/1369307339568873473](https://twitter.com/TheRoaringKitty/status/1369307339568873473)\n\n&#x200B;\n\n# If this break $xxx dollars I'll do ....nothing!\n\nBecause I'll be holding to 100k minimum.\n\nif I look at the graph it tells me the last spike was $347 (nasdaq) just to give you an idea we are just a 100 bucks or so away from that RIGHT NOW.\n\nfolding at a $1000 is still paperhanding in my book but that's just me, I'll be holding for 100 times that.\n\nbecause this is a once in a lifetime opportunity and I don't think we will ever see a situation like this ever again. especially with the new DTCC rules that are coming in.\n\nAdjust your baseline and expectancy, adjust your view to see big numbers and see where the nice tendyman will bring you.\n\nBecause soon will the Tendyman come to take our rocket into the sun <3\n\nAlso some decent explanation of the new DTCC rules:\n\n[https://www.youtube.com/watch?v=05AhD8QRW5I&ab\\_channel=StonkNewsNetwork](https://www.youtube.com/watch?v=05AhD8QRW5I&ab_channel=StonkNewsNetwork)\n\nyes I know the guy looks like a tool and a douchebag but his explanation to my understanding is not bad.\n\n# \n\n# Gme going 10k-50k-100k-500k\n\nOk so I heard a lot of talk about \"if it go's to 100k it will ruin the economy\".\n\nNo it may ruin the stock market for a hot minute but not the economy.\n\nwhy you ask? easy the Economy is not the stock market or vice versa.\n\nfirst of all 'ruin the economy' is, and always has been, a dogwhistle for rich people losing their superyachts, how many times was the \"economy\" ruined and the people on wall-street went on with business as usual?\n\nthe thing is, once we get our gains and we pay the taxes the economy is back up.Due to the gains being put back into the economy right away (paying off debts, mortgages, bills in general) the economy will be healthier then ever, also we'll most likely see a lot of people start their own charity or business or something along the way.\n\nwhich also stimulates the economy further.\n\nSo when they cry on tv saying \"they're ruining the economy\" no jackass we are doing the same thing to you that you did to all of us for years. the economy wont crash, the economy will flourish as people will for once be able to pay their bills, for once they'll be able to LIVE instead of EXIST to work from paycheck to paycheck.\n\n&#x200B;\n\n# My expectations.\n\nI think by looking at all the data I have available in front of me\n\n    https://iborrowdesk.com/report/GME \n    https://gme.crazyawesomecompany.com/ \n    https://finviz.com/map.ashx?t=sec \n    https://finance.yahoo.com/quote/gme/?p=gme&guccounter=1 \n\nI believe that they have one last ditch effort, they're going to let it rise to close to 1k (be it 500/750 or 800 or 1000) and then drop it down. just in an effort to get most of us to paperhand.\n\n[u/OurLordOfWar](https://www.reddit.com/user/OurLordOfWar/) did a write up [here](https://www.reddit.com/r/GME/comments/m1n88r/they_will_more_than_likely_short_gme_at_1k/)\n\nBut let me surmise;\n\n    They will let it rise. $500? $800? $1000?  \n    And as their last resource. \n    They will make it drop RIGHT THERE and start with the media saying, that was it. \n    That was the squeeze.  \n    The shills will spread FUD  The shills will post gains that are tempting to the eye. \n    Making you want to do the same.  \n    They will sooth your smooth brain with false words and false DD.  \n    They might go as far as closing all subreddits to cut communication and cause panic.  \n    An animal that is cornered and about to die will fight with everything they got.  \n\nNow I hope with this you understand why we put in the \"posting age requirement\" and banned \"gain and loss porn\".\n\nThis is something we could see coming a mile away, but this time let's be smarten then them.\n\n**Let Logic guide you, do not let your emotions run you! be in control of your emotions!!**\n\n**(addendum: wow did we call this or what? it's exactly what we have been seeing since this week)**\n\n&#x200B;\n\nhttps://preview.redd.it/7p2refq3dzm61.png?width=512&format=png&auto=webp&s=2786fb5204e2e0572b05efdacdf39ac4041e58ca\n\n# PSA: NEW SHILL TACTIC IS TO ANNOUNCE WHOLESOME/CHARITY DEEDS ALONG WITH A LOW GME PRICE TAG LIKE 1K OR 10K\n\n[u/slash\\_sin\\_](https://www.reddit.com/user/slash_sin_/) did a writeup on this and seems dead on with it.\n\n[https://www.reddit.com/r/GME/comments/m1f0cy/psa\\_new\\_shill\\_tactic\\_is\\_to\\_announce/](https://www.reddit.com/r/GME/comments/m1f0cy/psa_new_shill_tactic_is_to_announce/)\n\nLot's of people saying \"oh but I will donate to ST. Jude childrens hospital.\n\nSounds awesome right? well if you're in the UK you know that ST. Jude is one of the most overfunded childrens hospitals in Europe. they have multiple charity drives each year, which includes a comedy show they have yearly on tv to get donations.\n\nSo whenever you hear \"my donations will go to ST. Jude\" be weary.\n\nAlso when you see a lowball number (yes I believe 1 and 10 k are low in this situation) then be extra vigilant. why you may ask easy.\n\nThis is a psychological trick, a cognitive bias called “price anchoring” described by researchers Amos Tversky and Daniel Kahneman if you’ve ever read the book Thinking Fast Thinking Slow.\n\n“Anchoring or focalism is a cognitive bias where an individual depends too heavily on an initial piece of information offered to make subsequent judgments during decision making. Once the value of this anchor is set, all future negotiations, arguments, estimates, etc. are discussed in relation to the anchor.”\n\nOften a tactic used in pricing goods or negotiation.\n\nClassical conditioning sets you in a specific mindset, like pavlov had with the dogs. you hear a bell and you start salivating because you know hey it's food time.\n\nSame go's if someone says hey 1k is the goal over and over, you start to believe that.\n\nSo from this point on if someone posts a low ball 1/10k \"My GaIn$ wIlL Go To X when 1/10k\" I'll just delete these threads because they're bullshit, 1k is the minimum this stock was thought to do by both Ryan Cohen and RC Ventures and Domo Capital.\n\n**1K IS NOT A SQUEEZE!**\n\nthanks to [u/ellosee](https://www.reddit.com/u/ellosee/) for pointing out the \"price Anchoring\"\n\nOne thing to note, people can of course donate to anywhere and St. Jude does do amazing things for kids, as you can see this weekend on r/wallstreetbets people have been donating in small amounts to a gorilla foundation, this is not bad because of a very fine outliner.  \nThey didn't sell their gme to do so, none of those posts even talk about gains or such, you don't see a dollar amount they're donating all they are showing is they helped a sanctuary.\n\n \n\nhttps://preview.redd.it/ja2vx42sdzm61.jpg?width=720&format=pjpg&auto=webp&s=82d76b2923ea01c47d1caec730d30b1f8a848911\n\n \n\nDon't over focus on what they're doing, expect fuckery, but keep your eye on the prize people.\n\nfocus on your moon, on all that heavenly glory, and let it bring you calm that we have slowly but surely been gaining momentum once more.\n\nThese guys will run out of money at some point, if the DTCC rule kicks in and they're still in this they are most likely fucked. as the DTCC can say \"pay up bitch\" and they're done within a week.\n\nDon't expect the HF who oppose us to give up, they'll fight you to their very last breath however they can. but know we are currently at the time of writing on 242 euro that's $288 USD. again going up massively. we may be moving slow, but we are moving.\n\n&#x200B;\n\n# Gamestop changed their \"about\" page.\n\n[https://investor.gamestop.com/news-releases/news-release-details/gamestop-announces-fourth-quarter-and-fiscal-year-2020-earnings](https://investor.gamestop.com/news-releases/news-release-details/gamestop-announces-fourth-quarter-and-fiscal-year-2020-earnings)\n\nGameStop Corp., a Fortune 500 company headquartered in Grapevine, Texas, is a digital-first omni-channel retailer, offering games and entertainment products in its over 4,800 stores and comprehensive e-Commerce properties across 10 countries. GameStop, through its family of brands offers the best selection of new and pre-owned video gaming consoles, accessories and video game titles, in both physical and digital formats. GameStop also offers fans a wide variety of POP! vinyl figures, collectibles, board games and more. Through GameStop’s unique buy-sell-trade program, gamers can trade in video game consoles, games, and accessories, as well as consumer electronics for cash or in-store credit. The company's consumer product network also includes [www.gamestop.com](http://www.gamestop.com/) and Game Informer® magazine, the world's leading print and digital video game publication.\n\n&#x200B;\n\n# GME investor conference call\n\nTuesday, March 23, 2021. The company will host an investor conference call at 5:00 pm ET on the same day to review the company’s financial results. This call and any supplemental information can be accessed at GameStop Corp.’s investor relations home page at [http://investor.GameStop.com/](http://investor.gamestop.com/). The phone number for the investor conference call is 877-451-6152 and the confirmation code is 13715567. The conference call will be archived for two months on GameStop’s corporate website.\n\n&#x200B;\n\n#  Q4 Earnings report will also be unveiled on the 23rd after market close. \n\n&#x200B;\n\n# DFV Tweeted!\n\n[https://twitter.com/TheRoaringKitty/status/1369667682480558080](https://twitter.com/TheRoaringKitty/status/1369667682480558080)\n\n&#x200B;\n\n(here the midweek flash sale happened)\n\n# DFV just tweeted, he's still with us\n\n[https://twitter.com/TheRoaringKitty/status/1369706302222503940](https://twitter.com/TheRoaringKitty/status/1369706302222503940)\n\n&#x200B;\n\n# This was premeditated \"assasination selling\"\n\nGME got a trading halt at 03/10/2021 12:41:05 GMEwithin a minute they already put out articles\n\n[https://www.marketwatch.com/story/gamestop-stock-was-reaching-new-heights-but-shares-in-the-meme-stocks-just-plummeted-11615398208?mod=mw\\_RHF](https://www.marketwatch.com/story/gamestop-stock-was-reaching-new-heights-but-shares-in-the-meme-stocks-just-plummeted-11615398208?mod=mw_RHF)\n\nLook at the publishing date and time\n\nPublished: March 10, 2021 at 12:43 p.m. ET\n\nthat's the fastest type writer in the west....\n\n&#x200B;\n\nApparently CNBC is so fast they wrote this in less then 50 seconds...\n\n[https://www.cnbc.com/2021/03/10/gamestop-surges-40percent-then-wipes-out-gain-completely-and-is-halted-again.html](https://www.cnbc.com/2021/03/10/gamestop-surges-40percent-then-wipes-out-gain-completely-and-is-halted-again.html)\n\n**PUBLISHED WED, MAR 10 202112:41 PM EST**\n\nthe halt was on... you guessed it 03/10/2021 12:41:05\n\nThat's either some extremely talented folks there with the fasted written shit ever, or this was some premeditated fuckery.\n\nLike I said, expect fuckery\n\n&#x200B;\n\n# Garryyyyyyyyyyyyyyy!\n\nMadlad Gensler is getting appointed today!\n\nSeriously guys stfu and stop hating because he worked with Obama, yes we get it Trump bad Obama bad Biden bad. we don't care it's not about politics here so stfu.\n\nWhy do I have so much respect for this motherfucker?\n\nfor one his head is brighter than my future, second do you know who made laws so hedgies can't pull the same trick they did in 2008? this motherfucker.\n\nHe made the Dodd-Frank Wall Street Reform and Consumer Protection Act, this law basically said oh you did what? swaps? these fucking things aren't regulated? one sec fam I got you.\n\nAnd this guy spat in the face of everyone and just went and legislated this shit so hard that you probably haven't heard about swaps in a long time. he is known for giving zero fucks and doing what he thinks is right. not what the corporations think, no what HE thinks is morally right.\n\nSo yeah this is one of the few people in politics I like enough to share a beer with, maybe even a meal... call me Garry <3\n\n[https://www.congress.gov/nomination/117th-congress/80](https://www.congress.gov/nomination/117th-congress/80)\n\n&#x200B;\n\n#  If you're unsure take a step back and look at the bigger picture\n\n&#x200B;\n\nhttps://preview.redd.it/x4x2a3klezm61.png?width=1569&format=png&auto=webp&s=4ddc65697de35491355e280e3505ec751fe63bff\n\n \n\n**I'm noticing shills commenting FUD and quickly removing their usersname.**\n\n**If you see a shill and tag me or one of the other mods, also include their user name so we know who to ban ;)**\n\n&#x200B;\n\n# Set dates\n\nPlease please PLEASE guys, chill about the 19th or any other dates, this will come whenever the fuck it's here, and you'll know trust me.\n\nDo not set hard dates, it will happen when it happens. We don't know for sure when the squeeze will be here, what will set it off or around what specific dates.\n\nRemember this is a public forum and anyone can view this, so expect Melvin/citadel to have at least a few people browsing this.\n\nTherefore do not think March 19th is a SET date, dates hold no value, the squeeze does.\n\nSo be level headed and expect fuckery, if everyone says the 19th (or any date) is the date you'll only be setting yourself up for disappointment, let this happen naturally. this is part of mentally preparing you.\n\n&#x200B;\n\n# Backed up all my Dailies here: [https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n&#x200B;\n\n# March 17th is when the house financial services hearing continues\n\n[https://www.crowdfundinsider.com/2021/02/172654-house-financial-services-committee-game-stopped-part-ii-scheduled-for-march-17th/](https://www.crowdfundinsider.com/2021/02/172654-house-financial-services-committee-game-stopped-part-ii-scheduled-for-march-17th/)\n\n&#x200B;\n\n# GME is up 441% since 2/24\n\nSo because I've been seeing a lot of shill posts yesterday and have not used the delete button this hard since mom found my \"Homework\" folder.\n\nLets look at some basic facts.\n\nDid the dip change anything? are we still on?\n\nGuys nothing changed, we had a dip we have had red days since the 27/18th of January and we had it for weeks. One dip doesn't change anything in my book.\n\nlook at the 24th of feb, this is less than 2 weeks ago and we went from 40 to 250, this is still up A LOT!\n\nSo guys chill the fuck out, I get it, this is exciting and scary at the same time but we are still going up, but don't expect stocks to be all green every day. we can and will have red days.\n\nFor example if this go's up 10k and closes on 9.2k it will be a red day, does that mean it was all for nothing? no it means the stocks have reacted to something.\n\nSo step away from the emotions you may have when looking at this and take a step back, look at the bigger picture and take a breather.\n\nBecause I've seen a lot of negativity on the subs since yesterday, which is to be expected.\n\nRed day forecast is shilly, in the low 90 degrees and slightly overcast.\n\nAs much as we would love to see it, we're not gonna see gains of 30-40% every day. It's costing the hedgies millions each day in short interest, all we've gotta do to keep fucking them is to keep getting the sweet dip and holding.\n\n \n\nhttps://preview.redd.it/t4ts8yd8fzm61.png?width=960&format=png&auto=webp&s=d79404918ee5729f58acc1d8ce4c68398ccd00aa\n\nSee something familiar?\n\nThis is why I keep spouting on about \"everyone should educate themselves\" the more you know the less panic you will face.\n\nall thanks go's to [u/atrivell](https://www.reddit.com/u/atrivell/) for posting it [here](https://www.reddit.com/r/GME/comments/m2wjp8/gme_is_doing_what_its_been_doing_all_week_i_am/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nso if you look at the MACD ( **moving average convergence**/**divergence**, is a trading indicator used in technical analysis of stock prices)\n\nas he stated:\n\n    We've seen this action that's happening today A LOT,   \n    we just haven't had people who bought at $348.50 complaining before.   \n    Support lines are trending up, FASTER than last week,   \n    and we have seen this buy and sell off many times in the past   \n    few days when everyone was a diamond hands beast.   \n    this is a simple analysis of the chart and not financial advice.  \n\nso what does that tell us?\n\nThe support going up faster is a good indicator that you'll get a more upwards trend.\n\nThe faster that go's the higher it can go, but wtf do I know?\n\neven Yahoo is posting about this\n\n[https://finance.yahoo.com/news/we-should-see-the-gme-short-squeeze-continuing-s-3-partners-174542296.html](https://finance.yahoo.com/news/we-should-see-the-gme-short-squeeze-continuing-s-3-partners-174542296.html)\n\nthe most important take away is at the end:\n\n    “This has not been a profitable trading week for GME short sellers,   \n    after being down -$1.36 billion on Monday and Tuesday,” Dusaniwsky said.   \n    “[Wednesday’s] +7% price move added another -$202 million in additional   \n    mark-to-market losses.”   \n    All in, GameStop shorts have now lost $6.8 billion year-to-date,  Dusaniwsky said. \n\n&#x200B;\n\nhttps://preview.redd.it/12ftxtpffzm61.png?width=640&format=png&auto=webp&s=9450e7808add04f81207d339a23d5abfb99f4dfe\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/3e5s1nkhfzm61.png?width=1080&format=png&auto=webp&s=ed54a119bbfed7a3eb4ebd5f81e69b46981aeb3d\n\n# Such a hard Stimmy right now\n\nOk so people where talking about this yesterday so I thought I'd include it.\n\nThe stimulus checks will be hitting from this weekend on, just imagine what this could do, imagine what the fuck is going to happen if thousands of apes yolo their stimmy in GME... fuck guys we wouldn't need a catalyst we'd be our own haha.\n\nBut again not investment advice, Just saying this would be the funniest shit I'd see in my life if this happened\n\nThere is a letter to the board.\n\nOk so yesterday I was in a stream and this got brought to my attention : [https://www.stockholdersrights.com/](https://www.stockholdersrights.com/)\n\nTheir main interest is to present this on monday to the board of GME, this to do an audit of shareholders, meaning checking the shares, checking everything that's going on with the shares and to make sure the synthetic/naked shares are tracked down so something can be done against it.\n\nSo please I ask everyone to quickly sign it and make sure the board get's this on monday\n\n&#x200B;\n\nhttps://preview.redd.it/m49zch1mfzm61.png?width=640&format=png&auto=webp&s=f1c898da3241597def50d25f040951a456a149d9\n\n \n\nNot sure who originally posted this but thank you!\n\nThis is exactly why you'll see red days before this is implemented.\n\nRemember everything happens for a reason, red days, people spreading FUD or disinformation. we have seen this for weeks, no one folded then, no one has folded now.\n\nagain trust your fellow apes and see where this ends up.\n\nAnd just to make sure because I've seen some other people saying \"Oh BuT ReNs0Le DoEsNt BeLiEve in X aMoUnt\" trust me that's the fastest way to get banned from this sub.\n\nI believe this can hit 100,000.00 a share, you can call me an idiot for believing, you can call me a moron for having high hopes, but NEVER try to tell me or other people what they \"really\" believe\"\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/he6j1knpfzm61.png?width=640&format=png&auto=webp&s=19537f1ac4da35ea6577998495811c29f516fac6\n\n \n\nAgain the best advice I can give you retarded apes is when you go into this to be logical, don't let your emotions rule you, rule your emotions.\n\nAlso if you worry if this will go up or not, look at the fundamentals of the company, look how they turned around their company, look at who got brought in.\n\nI personally think if the company is sub 1000 USD it is undervalued, again you can disagree but show me proof.\n\nAnd remember none of this is financial advice, just a retards opinion.\n\n&#x200B;\n\nAlso guys, it's weekend go outside and don't hang on the sub.\n\nNo news here in the weekend, nothing changes only shills throwing around fake/bad DD and FUD.\n\nSo best way to fight that, don't be here in the weekend.\n\n \n\nhttps://preview.redd.it/1zmen12zfzm61.png?width=400&format=png&auto=webp&s=8d4ebc0fe18cf1499bcf91bb5760e3237a0b0e5f\n\nBackups: [https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)",
    "title": "Synopsis for 03-08 to 12-03",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m4txe0/synopsis_for_0308_to_1203/"
}