{
    "author": "creamy_surprise",
    "created_utc": 1623085969.0,
    "distinguished": null,
    "edited": false,
    "id": "nuhupd",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nuhupd",
    "num_comments": 275,
    "permalink": "/r/Superstonk/comments/nuhupd/psa_peterffy_ceo_of_interactive_brokers_was_among/",
    "score": 6372,
    "selftext": " Friends,\n\nIn case you forgot, I feel like we have to talk about this. More and more posts and comments start to emerge about Thomas Peterffy, CEO of Interactive Brokers being \"a good guy\".\n\nLet me remind you, in January:\n\n&#x200B;\n\n1. Disabled buying GME on Interactive Brokers\n2. Interctive Brokers is **used globally by dozens of retail brokerages** as \"prime brokers\" (you could see this with all the voting problems as well. IB popped up many times as the main culprit behind the scenes why apes couldn't vote)\n3. The moment he stopped buy orders **half the world blacked out**. All the brokerages that use IB as middleman had to stop as well. I'd wager that combined this effect caused more damage than Vladboy from Bulgaria. RobinHood is US only, whereas IB covers the whole world.\n4. Went on CNBC and said: \"**I'll allow buy orders when GME hits $17 again**\". 1 day later **the uploaded CNBC clip had this part removed**.\n\nCheck out the video in this tweet, its only two minutes long. The way he laughs makes my blood boil.  \nstart at 0:20 if you are impatient.\n\n[https://twitter.com/bullinvestpr/status/1354887834252017669?s=21](https://twitter.com/bullinvestpr/status/1354887834252017669?s=21)\n\nEven though Citadel might be the bogeyman behind the scenes, this shitsack of a CEO is as much part of the problem as they are.\n\n**They did a magnificent job of damage control**. All the hate and anger is directed towards the Boy from Bulgaria. But **Interactive Brokers was among the first ones to limit buy orders** in the so called \"meme stocks\" **in january.** \n\nDon't let the forum slide, and **don't believe his lies**. He wants to save his ass, thats all there is to him, but given his actions in january he wouldn't piss on you if you were on fire.",
    "title": "PSA: Peterffy (CEO of Interactive Brokers) was among the first to limit buys in GME. 🛑STOP🛑glorifying him, its FUD.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nuhupd/psa_peterffy_ceo_of_interactive_brokers_was_among/"
}