{
    "author": "anonfthehfs",
    "created_utc": 1624454059.0,
    "distinguished": null,
    "edited": 1624481494.0,
    "id": "o6ckta",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o6ckta",
    "num_comments": 365,
    "permalink": "/r/Superstonk/comments/o6ckta/change_my_mind_the_fact_that_on_any_given_day_you/",
    "score": 11112,
    "selftext": "&#x200B;\n\n[Dark Pools...](https://preview.redd.it/a6mhlqepi0771.jpg?width=570&format=pjpg&auto=webp&s=ebb1bf94d1ea8b9375b7d19ad25c219c6a9d1c1f)\n\n&#x200B;\n\n# Dear Apes,\n\nI'm not smart enough to write real DD.  The best I can do is just point out problems that I'm learning about with admittingly VERY  limited knowledge that I have, at least at the moment.  I'm attempting to gain wrinkles each and everyday.  I spend hours reading and trying to learn things.  I want to talk about OTC's and Dark Pools.   If I have anything wrong here or I misinterpreted things, please let me know but this is just here to point out information for others.\n\n&#x200B;\n\n[https://www.investopedia.com/articles/markets/050614/introduction-dark-pools.asp](https://www.investopedia.com/articles/markets/050614/introduction-dark-pools.asp)\n\n&#x200B;\n\n# \" Dark pools are sometimes cast in an unfavorable light but, in reality, they serve a purpose. However, their lack of transparency makes them vulnerable to potential [conflicts of interest](https://www.investopedia.com/terms/c/conflict-of-interest.asp) by their owners and predatory trading practices by some high-frequency traders. \"  -  Investopedia\n\n&#x200B;\n\n&#x200B;\n\nSo here is my opinion.  I think the fact these even exist is bullshit.  The whole reason these were even created, was to basically allow wealthy and big players to do big moves without \"affecting\" the market.      Basically, they are able to hide what they are doing from the public because they don't want to spook the market.  **To me that sounds like, rich people/institutions want to get  themselves in the best positions possible without the poor's getting spooked and then pump/dump something down or up to maximize profits.  Change my mind.**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nYou see if they had to do EVERYTHING on the open market they wouldn't be as profitable because others would see what they are doing.  **Not only that but through these vehicles, they can literally control the price of stocks and the market without the public seeing it.**  Their HFT machines combined with Dark Pools/OTC transactions at their disposal, they can essentially negate retails buying pressure lets just say our favorite stock.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n# GameStop's (GME) short interest is over 50% EVERY SINGLE FUCKING DAY and 40 to 60% of the daily transactions are done through dark pools/OTC's.  THAT SHIT IS NOT NORMAL!!\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n[Off Exchange = Dark Pools \\/ OTC  - this is just one days example for GME](https://preview.redd.it/89lhkqsuv2771.jpg?width=972&format=pjpg&auto=webp&s=4274c98779a15546c072934705fb70636eff7424)\n\n&#x200B;\n\n&#x200B;\n\nOnce you realize they can manipulate the price of a stock at any time, it opens an entire can of worms.  That means that the entire markets are essentially just controlled by the 1% and it's all a show.  They get to move the pieces where and when they want.   When GME moves, it typically is only moving from bigger players who they can't reroute their traffic;  they are hiding a huge chuck of retails buying pressure.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nThe DTCC-  Knows what is happening and wishes this would just go away.  They have dragged their feet on these rules for months.   They hope and prayed this would just disappear.   Retail will get bored they hoped.....now here we are.  This is starting to put a strain on the system.  My guess is there are hundreds of millions of counterfeit shares of GME and it's Prime Brokers / a couple of Market Makers who are all sweating right now.  They have known since probably Dec into Jan how bad this got.  They tried to cover it up and hoped it would go away.   But guess what......It's worse now.\n\n# \n\n&#x200B;\n\nSo here we are......again.   New rules about to be in place.   Hedgies dumping out of crypto, pumping and dumping stocks through Wall Street Bets to raise additional capital.   The DTCC and SEC have been hoping this would get swept under the rug to they can continue business as usual.  Problem is, it's fucked.\n\n&#x200B;\n\n&#x200B;\n\n# Apes are an immovable object now who aren't going to blink first.  They know the truth and are unwilling to be shaken from their positions.\n\n&#x200B;\n\n# \n\n# \n\nSo these Dark Pools and Over the Counter (OTC) are a real fucking problem.  Their lack of transparency and ability to completely manipulate stock/markets for months at a time.  That shit has got to go.They\" tried to cheat and lie back in Jan.  \"They\" lied to our Politicians.  At this point, I'll hold FOREVER if it means exposing their corruption.\n\n&#x200B;\n\n# They only have one way out at this point.   They either let it MOASS or Apes rip apart the system piece by piece.  The longer they let this continue, the closer their house of cards is to being toppled.  Apes numbers are growing each day.  Regular people are asking questions about the market and these \"meme\" stocks (Which really should be called illegally shorted to fuck stocks) and it's getting worse each day.  I keep buying each and every time I have money.  I'll do it forever.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nFuck this accepted \"Dark Pools\" and OTC's have a purpose defense.    GameStop is joining the Russell 1000.   Half of it's volume shouldn't be going through off the market exchanges that do not allow price discovery.   The market's are fucked.   I trust the DTCC, SEC, Market Makers, Prime Brokers and Banks as far as I can throw them.  We need reform.   That means we need new politicians.   We need these greedy fucking pigs on Wall Street out of politics so we can clean up this mess.\n\n&#x200B;\n\n&#x200B;\n\n# TLDR:  Dark Pools and OTC's are bullshit.  Real non-penny stocks like GME should be traded on major exchanges for fair price discovery.  I'm HODLING until stupid money and change.   Fuck those guys....fuck them up their stupid asses....\n\n&#x200B;\n\n&#x200B;",
    "title": "****Change my mind: The fact that on any given day you can erase retail's/smaller firms buying/selling power through OTC's and Dark Pools means that the big guys can manipulate any stock/market at any time. The entire market system needs to be reviewed for loopholes and fixed. ***",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6ckta/change_my_mind_the_fact_that_on_any_given_day_you/"
}