{
    "author": "Fast_Sandwich6034",
    "created_utc": 1624451728.0,
    "distinguished": null,
    "edited": 1624479809.0,
    "id": "o6bx5n",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o6bx5n",
    "num_comments": 163,
    "permalink": "/r/Superstonk/comments/o6bx5n/im_not_too_excited_about_002_im_being_realistic/",
    "score": 2362,
    "selftext": "Just want to tell people what I see from my perspective. \n\nI have been optimistic, but cautious about most large events. HFS and Shills lurk this site and when I see people get excited about dates, I end up feeling bad because a majority of those dates have ended red. It makes me wonder how many new investors are exiting their trades at a loss because they expected moon/lambo due to people hyping a date. \n\nThe only dates that matter are listed below:\n\n-Past dates that can be used to verify data\n\n-TBD - Future date of large, cheating hedge funds getting margin called\n\n-TBD - future date when my bank account has 2-3 commas in it and it resembles a fucking phone number\n\n- TBD - future date when large cheating hedge funds go bankrupt and possibly to jail for their illegal and manipulative practices. \n\nOutside of those dates, no other ones matter. The implementation of 002 feels good, but I’m pretty sure it will not be Thor’s Hammer, or the Elder Wand. It has been proven through DD, of which I am super proud of this community for producing and committing to, that the people keeping the share price down do not care about the rules, and they won’t care until the punishment for their actions is either $500,000,000/transgression, or they get banned from the market. \n\nA domino fell yesterday in London, and 002 goes into effect today. Do not hype this up. I will leave you with the wisest words I have ever read……\n\n“Buy. Hodl.”\n\nEdit 1:  look at that….. a red day, and I guess 002 was delayed until tomorrow. Good thing we didn’t hype this up and now have to look for reasons why our predictions didn’t come true like QAnoners. \n\nI believe this will squeeze, just not when everyone expects it to or due to any catalyst we hype up on here",
    "title": "Im not too excited about 002. I’m being realistic. January Ape",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6bx5n/im_not_too_excited_about_002_im_being_realistic/"
}