{
    "author": "grungromp",
    "created_utc": 1623175182.0,
    "distinguished": null,
    "edited": 1623179096.0,
    "id": "nva7nh",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nva7nh",
    "num_comments": 1726,
    "permalink": "/r/Superstonk/comments/nva7nh/satori_the_one_week_security_update_important/",
    "score": 603,
    "selftext": "# Important Security Update for June 8th:\n\nWe have been sending messages to approved users from u/satori-blue-shell.  We realized that this may cause an unintentional security risk. To remove confusion in the future, all messages will be sent directly via the subreddit. You can recognize an official message when the sender information contains \"via /r/Superstonk.” (see below) Any other message from an account claiming to represent Satori should be reported to the moderation team.\n\n&#x200B;\n\n[Examples of Official Satori Messages](https://preview.redd.it/ily5i0per2471.png?width=1342&format=png&auto=webp&s=9eb887c382b5541429d2876d97fa6623845dbdb9)\n\n**The Next Evolution in Seeking the Blessing of Satori**\n\nWhen we launched Satori just over ten years… wait… one week ago (time is meaningless right now apparently) we were confident that the tool we had developed could be very valuable to this community. We hoped Apes would be able to see the incredible potential this had to be a total game-changer, but we never imagined this level of positive response and immediate support. Thank you all for your trust and assistance.\n\nWanting to make sure we do right by the community, we’ve been hard at work to make sure Satori is the best tool we’re capable of making. From the moment of reveal we’ve been having Apes inquiring how to get Approved status. We’ve had great success with our current system, and we’re now announcing that we’ve made a significant upgrade! From the time of this post forward (like in the comments to this post, if you’d like) if you comment **!apeprove!**, you will send a message to Satori to enter you into a priority list to be approved. You will also then receive a message through the official method (as highlighted above) outlining the updated process.\n\nWe are so happy that we can now give frequent commenters and those right around karma limitations the ability to join the fold of the Approved as soon as possible!\n\nA couple quick points:\n\n* You only need to comment !apeprove! once to be added to the queue. Spamming the command will not speed up your process, and can result in your removal from the Approval queue completely. Shills spam. Don’t do it.\n* If you are already an Approved User, then you do not need to do anything more! Keep enjoying the omniscient benevolence of our robot overlord!\n* Continue to Buy, Hold, and for DFV's sake vote cuz there’s some deadlines coming real fast.\n* We are now also moving to prioritize Apes who are below- or just above current karma requirements. We want to be able to contribute without the fear of being downvoted into silence.\n* REMEMBER: Approval is not an endorsement. It does not mean anything beyond the fact that an account has yet to act in a suspicious way YET. Do not let your guard down at any point.\n* 🦧🧠💎👐🚀🦍🌝\n* EDIT: Anyone commenting will be seen by Satori. Even if you don't have sufficient karma to comment, it will get flagged in our system before removal by automod. So EVERYONE CAN GET IN. \n\n**Now, with that out of the way, a few pieces of housekeeping**\n\n*Defending the Sub: How to Report Nefarious Activity*\n\nWe have received a TON of help in many forms in keeping the sub clean. This has come in people sharing screenshots of shill posts, sending messages to the Satori team members, contacting mods, etc. Thank you so much for that! Remember, \\*We. Are. Satori.\\* Our Mind Reading Monkey is only as effective as the community itself. Please continue to be vigilant, use those down/upvote buttons, and if you see something, report something.\n\nA word of caution: Just because you may think a post feels negative, or you disagree with it's premise or claims, doesn't automatically qualify it as FUD. Be aware of amplifying the echo chamber. And absolutely do not threaten those making the posts. We've got ways to deal with this properly.\n\nWe'd now want to give you specific guidance to allow you to be the most effective with your defense of this sub.\n\nThe absolute best way to draw the All Seeing Mind of Satori to specific posts or users is to use the \"message the mods\" function of the sub. This sends a message to the entire mod team, which means there's a greater chance someone will see it sooner than if you message an individual. Satori will then be fed the information given in the message, meaning you reach both parties with one click. It's a one stop shop to get the report to every single party who needs to see it, and also keeps the sub clear of posts of screenshots of FUD.\n\n*A Return to Old Tactics: Bad Actors doing Bad Things*\n\nThe last week has proven to us that we're under the skin of those trying to bring the sub down. What we're doing is working. With heavy restrictions in place for posting and commenting, we're seeing a move back to older strategies, as well as a few new ones. There's been a surge in private messages, in downvoting folks below karma limits, reports of suicidal tendencies, and many other strategies to try and unnerve our community. Please be on the lookout, keep your heads on swivels, and if something looks or feels suspicious, report it to the mod team and Reddit.\n\nSatori co-creator and r/Superstonk moderator u/catto_del_fatto did a much more in depth breakdown of what we're seeing, and what you can do to counter it, in yesterday’s Jungle Beat, which is linked at the bottom of this post\n\nThe-Definitely-Not-Mind-Controlled-By-The-AI-We-Created-Team Satori\n\n&#x200B;\n\n*Want to know more about Satori? Start here.*\n\n\\[Announcement Post\\]\n\n[https://www.reddit.com/r/Superstonk/comments/nplhx7/game\\\\\\_stop/](https://www.reddit.com/r/Superstonk/comments/nplhx7/game_stop/)\n\n\\[Follow-Up Post By One Of The Creators\\]\n\n[https://www.reddit.com/r/Superstonk/comments/nqnora/satori\\_the\\_first\\_36\\_hours/](https://www.reddit.com/r/Superstonk/comments/nqnora/satori_the_first_36_hours/)\n\n\\[New and important information from Team Satori in the Jungle Beat from 6/7/2021\\]\n\n[https://www.reddit.com/r/Superstonk/comments/numi3i/the\\_jungle\\_beat\\_monday\\_06072021\\_2\\_days\\_til\\_annual/](https://www.reddit.com/r/Superstonk/comments/numi3i/the_jungle_beat_monday_06072021_2_days_til_annual/)\n\nEdits: Formatting. So much formatting.  \nEdit: Clarification for low karma commenters",
    "title": "Satori: The One Week Security Update (Important Information Inside)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nva7nh/satori_the_one_week_security_update_important/"
}