{
    "author": "Branch-Manager",
    "created_utc": 1623158052.0,
    "distinguished": null,
    "edited": 1623239566.0,
    "id": "nv3r0i",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nv3r0i",
    "num_comments": 528,
    "permalink": "/r/Superstonk/comments/nv3r0i/the_squeeze_only_starts_when_the_hedge_funds_are/",
    "score": 14503,
    "selftext": "The first to be margin called (and eventually liquidated to cover their shorts when they fail to meet margin requirements) are the hedge funds... \n\n**They’re the small fish.** This might cause the price to go into the thousands. **The media will put them on blast hoping we believe that once all the hedge funds are margin called that it’s over**... but this is where it just begins...\n\n**Next will be the market makers and prime brokers** who’ve been “operational shorting” to “provide liquidity to the market.” As Wes Christian has explained, these are the big fish, the real mother fuckers. This is Citadell, Bank of America, JP Morgan, etc. They’re given privileges to short ETFs, fail to deliver, hide shorts/ fails with options, and to skim profits off retail by front running orders, and used these privileges to collude with hedge funds to manipulate prices by diluting the shares in circulation. \n\nThis is where we could see the price go into the hundreds of thousands....\n\nBut it still ain’t over...\n\n**Next in line to cover would be the Clearing Houses (collectively the DTCC).**\nThey’ve been allowing all this to occur because they profit off all that sweet liquidity. \n\n**This is what they’ve been wanting to avoid and why the FUD/ bots/ shills leading up to this point will seem like a light seasoning compared to the avalanche we’ll see the closer we get to this point.**\n\nWhen the DTCC has to start shelling out, that’s when the price could go into the millions/ tens of millions.\n\n**And then the final boss would be the Fed.** And don’t think for a minute their hands are clean of the blood of the innocent that has been shed by this predatory naked short scheme. \n\nExpect fuckery at every step of the way, and don’t expect all margin calls to happen in one seamless stream; their goal is to never cover. They will try to drag this thing out and shake as many paper hands as possible.\n\nEdit: u/Upper_Piano1809 made a [great point ](https://www.reddit.com/r/Superstonk/comments/nv3r0i/the_squeeze_only_starts_when_the_hedge_funds_are/h13x6h9/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf&amp;amp;amp;context=3) that everyone, especially new apes need to know:\n\nCitadell is not just a hedgefund. It is conglomerate with multiple beaches. They’re also a self-clearing market maker. \n\n“ I can already see it. ‘Shitadel has covered it’s short positions the redditors have won the game had ended’ FUD article and potential fake flash crash to scare off the paper hands and gullible baby apes if there are still any though I highly doubt it after these six tough months of Moon Camp. they’re going to want to deploy this when **Shitadel HEDGE FUND (just one ‘arm’ of the conglomerate Shitadel is)**  covers. When in reality that’s nothing, it’s **Shitadel SECURITIES A.K.A the BIGGEST MARKET MAKER in the world who’s doing the synthetic counterfeit predatory shorting** and that’s the real Piñata we apes are here for. But it doesn’t end there...”\n\n\n^(I posted this as a comment and was encouraged to make it a post for visibility.)\n\n^(Edit: distinguished margin call from liquidation)",
    "title": "The squeeze only starts when the hedge funds are margin called. The whole financial industry is complicit the predatory naked shorting scheme.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nv3r0i/the_squeeze_only_starts_when_the_hedge_funds_are/"
}