{
    "author": "Dismal-Jellyfish",
    "created_utc": 1623981672.0,
    "distinguished": null,
    "edited": 1625585626.0,
    "id": "o2dw45",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o2dw45",
    "num_comments": 196,
    "permalink": "/r/Superstonk/comments/o2dw45/thoughts_on_the_feds_balance_sheet_after_todays/",
    "score": 3004,
    "selftext": "Evening r/Superstonk, neighborhood Jellyfish here! Today, the Fed released its updated balance sheet for the week. (through June 16th)\n\n&#x200B;\n\n[https:\\/\\/www.federalreserve.gov\\/releases\\/h41\\/current\\/](https://preview.redd.it/z6jc5bml1y571.png?width=2012&format=png&auto=webp&s=6803371f79a5211291d60b4b3296928ae46d1a83)\n\nEven as the Reverse Repo operations continue hoovering money **OUT** of the system at a record clip, the assets on the Fed’s balance sheet **INCREASED by $112 Billion** to—and stop me if you have been hearing this a lot around here about things—**a new RECORD $8.064 trillion**. Let’s write this one out: **$8,064,000,000,000**\n\n&#x200B;\n\n[Look at it grow!](https://preview.redd.it/psmffj3q1y571.png?width=1462&format=png&auto=webp&s=551c890fab9ae3896ee0059fe821f90e74748acf)\n\n&#x200B;\n\nSince the Covid-19 brrrrr started last March, the Fed has added $3.75 trillion to the balance sheet to get to $8.064 trillion, which is more than **double** what it had [on the balance sheet since the Repo market crisis of September 2019.](https://en.wikipedia.org/wiki/September_2019_events_in_the_U.S._repo_market)\n\n# So what caused the jump in the balance sheet?\n\nThe majority of the S112 billion increase was:\n\n$24 billion increase in Treasury securities to $5.15 trillion and $84 billion increase in Mortgage-Backed Securities (MBS) to $2.33 trillion.\n\nAnother thing I find interesting is the Treasury General Account (TGA), which Yellen said in February she wanted to [get to $500 billion by the end of June](https://home.treasury.gov/news/press-releases/jy0011), actually increased by $92 Billion to **$765 Billion**.\n\nI think it is safe to say Yellen is going to miss her end-of-the-month goal and the drawdown of the TGA will continue into the summer, **BUT** it is likely that $265 Billion is going right into the Reverse Repo market.\n\n&#x200B;\n\n[Funny how the drawdown coincides with the RRP blow-up.... ](https://preview.redd.it/7mf3e9jv1y571.png?width=1456&format=png&auto=webp&s=40bb172ffc50a304dd90e7caf9d842da072fec40)\n\n# OK Jellyfish, all of us find this Fed stuff fun (NOT), but why should I care and how can this tie to GME?!?!\n\n&#x200B;\n\n[I like being beaten over the head with Fed information, NOT!](https://i.redd.it/s14kkni02y571.gif)\n\nRemember the other day when [I posted that inflation is the lit match that is going to light the fuse to our rocket?](https://www.reddit.com/r/Superstonk/comments/nxxwqt/tldr_i_believe_inflation_is_the_match_that_has/)\n\nWell, JPow did his best to rain on the parade yesterday and make the case that inflation is transitory, **but** all his brrrrr and the participants locking up cash in the Reverse Repos market tells a different story!\n\n&#x200B;\n\nhttps://preview.redd.it/2zp3vsn52y571.png?width=1459&format=png&auto=webp&s=01152bcbbd435e97cc2f6942560079b9d943d888\n\n&#x200B;\n\n[M2:  I’ve mastered the ability of standing so incredibly still… That I become invisible to the eye. Watch. ](https://preview.redd.it/jdhnuw472y571.jpg?width=300&format=pjpg&auto=webp&s=cf692b4fc944262ce58aa33dd51a08cdfdccf323)\n\nNotice that? The velocity of money is grinding to a record (there’s that word again) low! When discussing inflation, folks rightly get caught up in the jump in prices. However, money velocity is often overlooked. What does the 1.122 number tell us? That cash is just sitting there and taking a LONG time to trickle into the economy.\n\nSuppose that that velocity (V) remains low at 1.122% per year. Next, let’s assume that the real output (Q) [grows by the 6.5% the Fed forecasted in March](https://www.usnews.com/news/economy/articles/2021-03-17/fed-ups-2021-economic-forecast-significantly-leaves-interest-rates-unchanged). [Now the Fed stopped reporting on the money (M) supply (not Sus at all right?) but it was up by 25% this past year](https://www.stockinvestor.com/50573/did-the-fed-stop-reporting-the-money-supply-m2-why-inflation-is-coming-back/).\n\nCranking the numbers through the [Monetarist Theory](https://www.investopedia.com/terms/m/monetaristtheory.asp) equation (the Fed operates this way focusing on maintaining stable prices, promoting full employment, and achieving steady gross domestic product (GDP) growth), the resulting estimate for inflation is:\n\nM + V = %P + Q\n\n25 % + 1.122 % = % P + 6.5 %\n\n**P% (inflation) = 19.622%**\n\nYeah, this estimated number for inflation (which I can be totally wrong on mind you!) is 4x greater than the 5% number reported the other day. Tell me again JPow, you really think this is transitory?\n\nOpinion: Because of inflation, the shorts are going to drown in their cash. There is no place for it to go to earn a positive yield greater than what inflation will eat, or should be acceptable for the level of risk of default.\n\nWith nowhere to park this cash to generate positive yields and while having to contend with balance sheets that are having assets eaten away, participants will continue to use the Reverse Repo to buy time until:\n\n1. Being down in real terms because of inflation is something that cannot be made back up to service the debt and will weigh on balance sheets as they try to protect from margin calls.\n2. Their existing collateral on the balance sheet can get re-rated lower, re-appraised lower, or just eaten by inflation to the point even what they are borrowing in treasuries can’t meet the requirements to hold off a margin call.\n3. They hit the 80 billion Reverse Repo limit because of nowhere else to place cash, are tapped out on treasuries, and no longer able to post acceptable collateral to meet their margin requirements.\n\nTL:DR – I believe inflation is still the match that has been lit that will light the fuse of our rocket.\n\n&#x200B;\n\n[ Tick Tock and I hope I didn't screw this up too badly! ](https://i.redd.it/o4aq5gwa2y571.gif)\n\nEDIT 1:\n\nOK, this is where I **think** (and ready to be corrected) the [rules of growth rates come into play](https://saylordotorg.github.io/text_macroeconomics-theory-through-applications/s15-01-the-quantity-theory-of-money.html).\n\n>If you have two variables, x and y, then the growth rate of the product (x × y) is the sum of the growth rate of x and the growth rate of y. We can apply this to the quantity equation:money supply × velocity of money = price level × real GDP.The left side of this equation is the product of two variables, the money supply and the velocity of money. The right side is likewise the product of two variables. So we obtaingrowth rate of the money supply + growth rate of the velocity of money= inflation rate + growth rate of output.\n\nWe have used the fact that the growth rate of the price level is, by definition, the inflation rate.We continue to assume that the velocity of money is a constant.In fact, the velocity of money might also grow over time as a result of developments in the financial sector. Saying that the velocity of money is constant is the same as saying that its growth rate is zero. Using this fact and rearranging the equation, we discover that the long-run inflation rate depends on the difference between how rapidly the money supply grows and how rapidly output grows:inflation rate = growth rate of money supply − growth rate of output.\n\nEven assuming the velocity of money @ 0, that would still be 18.5%?\n\nEDIT 2: The conclusions of this post are challenged and possibly debunked [here](https://www.reddit.com/r/Superstonk/comments/o49o2w/debunking_the_20_inflation_dds_it_is_crucial_to/)\n\nEDIT 3: [Waffle House Index](https://www.reddit.com/r/Superstonk/comments/o59uyb/no_inflation_my_waffle_house_has_had_to_print_new/) backing this up in the 'real world'?",
    "title": "Thoughts on the Fed’s balance sheet after today’s record $755.800 Reverse Repo operations and what it means for inflation and the GME rocket.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2dw45/thoughts_on_the_feds_balance_sheet_after_todays/"
}