{
    "author": "ajquick",
    "created_utc": 1623906943.0,
    "distinguished": null,
    "edited": 1624563245.0,
    "id": "o1p904",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o1p904",
    "num_comments": 63,
    "permalink": "/r/Superstonk/comments/o1p904/using_fails_to_deliver_to_estimate_future_gme/",
    "score": 804,
    "selftext": "## This method did not work. It is (obviously) more complicated than this basic computation. The SHFs are doing a LOT to surprise the price right now.\n\nThis is based on the [DD](https://www.reddit.com/r/Superstonk/comments/o155a6/t35_is_the_one_true_cycle_evidence_to_back_my/) written earlier today by u/dentisttft.\n\nIn the DD, the OP lays out data showing a possible correlation between Fails to Deliver (FTD) and a T-35 cycle in which the FTDs are forced to be covered on the 35th day (or the day following a weekend or holiday). Since the SEC maintains [FTD data](https://www.sec.gov/data/foiadocsfailsdatahtm) and posts it with an approximately 15-30 day lag time, we can get the FTD data **before** the T-35 date has passed! This means that we can *possibly* forecast what kind of impact the upcoming FTDs will have one the price.\n\nHere I am going to try to provide an **EXTREMELY ROUGH ESTIMATE** based **SOLELY UPON THE FTDs** and no other potential news and / or catalysts.\n\n**Methodology**\n\nHow exactly am I going about this? I have loaded the previous FTD data from May - June 2021 and looked at the FTD volume vs historical volume and then saw what impact that FTD purchase had on the stock price for that day. I plotted the percentage of FTD volume vs price impact and found a linear relationship. This helped me determine what kind of an impact the FTDs may have on the stock in comparison to the estimated volume of trades that would occur on a particular day.  That's it. Is it flawed? Most definitely! Does it neglect all other external motivators of price action on any given day? Absolutely! Should it be trusted? **Hell no.**\n\n## This is not financial advice.\n\n**Historical Data**\n\nI wanted to point out a few particularly juicy data points to try and articulate what *could be* happening with these FTDs and price action on a few select days.\n\nOn May 18, 2021 there were 8,161 FTDs to be covered, which was 0.30% of the volume traded on that day. The difference between low and high was 5.81%. The difference between open and close was -0.62%.\n\nOn May 24, 2021 there were 91,171 FTDs to be covered, which was 1.95% of the volume traded on that day. The difference between low and high was 8.72%. The difference between open and close was 2.37%.\n\nOn June 1, 2021 there were 103,819 FTDs to be covered, which was 1.08% of the volume traded on that day. The difference between low and high was 12.29%. The difference between open and close was 6.66%.\n\nPerhaps you can see that the intraday difference was much more varied on some of these days compared to the open and close. Since covering an FTD is purely a buying force, we must assume the price would go from low to high on the execution of the sale. If I had a little more time, I might go and try to find the exact time the FTDs were covered and check the minute by minute change of the price as a percentage. **I didn't do this.** Instead I just tried to figure out how much an impact the FTDs had on the price as a percentage of the volume traded on that day.\n\nGeneral guidelines:\n\n* Higher FTD number the higher percentage increase expected.\n* Higher percentage of FTD to volume the greater impact it would have.\n* Lower FTD number more than likely generate sideways / negative days.\n* SHFs are always shorting on any given day.\n\n## Calculated Data\n\nHere is an estimate of where I think the price could go over the next few weeks. This is based **SOLELY ON THE FTD DATA**. There are no other catalysts factored in such as good news, alien invasion, reverse repos, zodiac signs or jacked tits. There is no real price target, *just up*. Maybe it will be somewhere in the yellow band. **I don't know.**\n\n[\\\\\"Look at this graph. Every time I do, it makes me laugh.\\\\\"](https://preview.redd.it/qew0oosgsr571.jpg?width=1100&format=pjpg&auto=webp&s=9a6826808b478ec47fa43af1248dc09e13a1b83b)\n\nFor these calculations I used an estimated daily volume of 12 million for the days June 17 - July 2. I used the FTD data we have, and based the estimated impact on the price based on the previous data. Some days with really low FTD numbers have negative impacts. This makes sense because previous low FTD days had seen price drops. The big days coming up will be **NO DATES** (just like me IRL).\n\nOkay, but look at this table:\n\n&#x200B;\n\n|Date|FTDs to Cover|Est Volume Percentage|Impact on Price|\n|:-|:-|:-|:-|\n|06/17/21|7455|0.06%|\\-0.61%|\n|06/18/21|0|0.00%|\\-1.57%|\n|06/21/21|86688|0.72%|9.55%|\n|06/22/21|17804|0.15%|0.72%|\n|06/23/21|75521|0.63%|8.12%|\n|06/24/21|27904|0.23%|2.01%|\n|06/25/21|0|0.00%|\\-1.57%|\n|06/28/21|66739|0.56%|6.99%|\n|06/29/21|749|0.01%|\\-1.47%|\n|06/30/21|18598|0.15%|0.82%|\n|07/01/21|52275|0.44%|5.14%|\n\n&#x200B;\n\nAgain, this is based on an average daily volume of 12M shares traded.\n\nWhat happens if we have really shitty volume like 3.5M?\n\n&#x200B;\n\n|Date|FTDs to Cover|Est Volume Percentage|Impact on Price|\n|:-|:-|:-|:-|\n|06/17/21|7455|0.21%|1.71%|\n|06/18/21|0|0.00%|\\-1.57%|\n|06/21/21|86688|2.48%|36.54%|\n|06/22/21|17804|0.51%|6.26%|\n|06/23/21|75521|2.16%|31.63%|\n|06/24/21|27904|0.80%|10.70%|\n|06/25/21|0|0.00%|\\-1.57%|\n|06/28/21|66739|1.91%|27.77%|\n|06/29/21|749|0.02%|\\-1.24%|\n|06/30/21|18598|0.53%|6.61%|\n|07/01/21|52275|1.49%|21.41%|\n\nWait and minute, you're telling me **HOLDING** works? Yeah, if you don't sell, the FTDs need to pay whatever the market is asking. Can you believe just 86,000 shares could drive the price up 36.5%?\n\nHere is a graph I am **calling** the Titty Jacker Express.\n\n[Titty Jacker Express](https://preview.redd.it/3ibxn1zesr571.jpg?width=1100&format=pjpg&auto=webp&s=7a3bb576424daa424f556e3e750d797ae49612d8)\n\nThis is not financial advice. For real, I'm pretty dumb. You shouldn't take advice from me. I just think we're gonna see anywhere from 0% - 350% increase in the next 2 weeks based on FTDs alone. BUY & HOLD is the way.\n\n**EDIT:** I made a few mistakes on my calculations, updated the data tables and updated the graphs. These numbers should be fairly conservative and it doesn't include ETF FTDs, maybe on Part #2.\n\n**EDIT 2:** I am going to go ahead and mark this as inconclusive. I couldn't get the calculation figured out when I introduced ETFs into the mix. Obviously the pricing has not followed the aforementioned estimates. Whatever the SHFs are doing, the are doing it harder now than ever before to hide it.",
    "title": "Using Fails to Deliver to Estimate Future $GME Share Prices",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1p904/using_fails_to_deliver_to_estimate_future_gme/"
}