{
    "author": "wkowdyw",
    "created_utc": 1621878155.0,
    "distinguished": null,
    "edited": false,
    "id": "nk3nn0",
    "text_only": true,
    "flair_text": "𝗡𝗲𝘄𝘀",
    "name": "t3_nk3nn0",
    "num_comments": 44,
    "permalink": "/r/DDintoGME/comments/nk3nn0/ex_citadel_manager_spilling_tea_in_a_new_book_fed/",
    "score": 526,
    "selftext": "\\--- start of article ---\n\nhttps://preview.redd.it/1y8hxpxsu3171.jpg?width=421&format=pjpg&auto=webp&s=a09652c6c45da3be5f20c5028153b3b72ea224a9\n\n# Fed Up!: fascinating tale of immense wealth, tough choices, and compromised values\n\nBy [Community News Releases](https://communitynewspapers.com/author/community-news-releases/) \\- May 24, 2021\n\nIn October 2019, the world was still riding a 10-year bull market — having no idea what was just around the corner.\n\nAnd while everyone experienced the impact of the global pandemic, not many know what it was like in the eye of the financial storm that COVID-19 precipitated. In his new novel, Fed Up! Success, Excess and Crisis Through the Eyes of a Hedge Fund Macro Trader (Harriman House; May 2021), Colin Lancaster offers an inside look at that storm — spinning a fascinating **tale of immense wealth, tough choices, and compromised values.**\n\nThe story Lancaster tells — which is **based on real people and real events** from his own career — is of a macro trader. They call him “Boss.” He lives and breathes the markets, to the detriment of his relationships with family and friends. The “family” Boss spends his time with is his team at the trading desk — Elias, their smooth-talking, party-loving trader; Jerry, their economic model-builder trying to gain a foothold in a career that demands complete devotion; Rabbi, their brilliant but pessimistic analyst, always looking for the down side, and Lifecoach, the only woman on the team, part lawyer, part CFA, and part fixer who plays a mean game of beer pong.\n\nBoss narrates a nine-month period, from October 2019 through June 2020, providing readers a crash course in macro trading — “investing in assets on the basis of changes in the fundamental landscape: the ups and downs in growth and inflation and interest rates” — and a front row seat on trading activity. At the same time, Boss struggles to balance his personal principles with the **compromised values of the world around him** — and to hang on to his fortune as the world slips into misfortune.\n\n“At the end of the day, we macro traders have unique jobs. **We are not paid to do anything productive for society. We are paid to turn a pile of money into a bigger pile of money**,” he laments.\n\nAs the pandemic worsens, and the **central banks and governments try to forestall economic collapse**, Boss and his team scramble to keep their heads above water. Meanwhile, Boss’s wife increasingly questions his commitment to their family and Boss begins to have **serious doubts about one of the members of his team** ‚— all with a backdrop of CNBC’s talking heads and the often irrational tweets from “The Big D,” a.k.a. Donald Trump.\n\nFollowing Boss and his team from London to Las Vegas and from New York to New Orleans, Fed Up! is a wild ride that provides unique insights into high-stakes trading while also raising important questions about the very basis of our economy.\n\nColin Lancaster, the author of Fed Up!, is a 25-year Wall Street professional who has managed investment operations in London, New York, Hong Kong, Singapore, Chicago, and San Francisco. He has run two of the highest profile global macro businesses for top-performing hedge funds **working directly with Ken Griffin at Citadel** and Dmitry Balyasny at Balyasny Asset Management. For many years, Lancaster’s monthly newsletter — Views from the Desk — was a must-read among Wall Street insiders and the largest allocators in the world.\n\nLancaster has often been quoted in The Wall Street Journal, The New York Times, and the Financial Times. A graduate of Princeton University and Marquette University Law School, he and his wife divide their time between London and Miami.\n\nSource: [https://communitynewspapers.com/biscayne-bay/fed-up-fascinating-tale-of-immense-wealth-tough-choices-and-compromised-values/](https://communitynewspapers.com/biscayne-bay/fed-up-fascinating-tale-of-immense-wealth-tough-choices-and-compromised-values/)\n\n\\--- end of article ---",
    "title": "Ex Citadel Manager spilling tea in a new book: Fed Up! Success, Excess and Crisis Through the Eyes of a Hedge Fund Macro Trader",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nk3nn0/ex_citadel_manager_spilling_tea_in_a_new_book_fed/"
}