{
    "author": "pinkcatsonacid",
    "created_utc": 1623257485.0,
    "distinguished": null,
    "edited": 1623258438.0,
    "id": "nw0i5u",
    "text_only": true,
    "flair_id": "ab9d5506-95d3-11eb-ac2a-0e4e06bdb513",
    "flair_text": "🚀 Moderator 🚀",
    "name": "t3_nw0i5u",
    "num_comments": 1309,
    "permalink": "/r/Superstonk/comments/nw0i5u/shareholder_meeting_i_did_not_do_any_interviews/",
    "score": 20254,
    "selftext": "Hi apes! Yes I surprised everyone by showing up to the shareholders meeting today. Due to car trouble, I wasn't able to make it as early as I had hoped to be able to stream. Rough 24 hrs to get to Dallas for this meeting. But can't stop won't stop. \n\nI went and spoke to the gentleman standing outside HQ doors when I arrived, and was told only shareholders with certain proxy info were allowed inside, which I didn't qualify for as a broker held shareholder. Also that NO MEDIA PHOTOGRAPHY/ LIVESTREAM WAS ALLOWED ON THE PROPERTY- INDOOR OR OUT. But I was told we would be welcome to film from across the street. He also said he had heard of Superstonk which got me hype.\n\nUpon setting up, a CNBC camera man came and got a live feed of the apes that were set up there. He was a camera man, not a producer or interviewer. He was getting live B roll footage. Which yes, I got a little cute for and said hello. They asked for details to share with his producer about the apes. So I told him what subreddit we were members of, and that we like the stock. And I made it clear I DO NOT REPRESENT ANYONE. I am just 1 of many administrators and moderators on the subreddit. In fact, I made it very clear that there was NO ORGANIZATION because I didn't want the story twisted by mainstream media about why anyone was there. u/BodySurfDan was there for that conversation, as were several other apes. \n\n\n**I DID NOT DO AN INTERVIEW WITH ANYONE.**\n\n**IF CNBC HAS FOOTAGE OF ME, IT'S HANGING OUT WITH APES AT HQ. NOT AN INTERVIEW.**\n\n\n\nAfter the meeting, I intended to stream with the apes that went inside and I was gathering them and talking to them to go live, but we were asked to leave the location immediately by the property owners. And that's when our livestream had to end, so as to respect the private property rules from the owner. That's it. That was the whole crazy 15 minutes. \n\nHope that clears some BS up. I went through hell to get here and get a camera on HQ somehow. Hope the real apes understand. \n\n**Just had a civil conversation.** Haven’t done any interviews.✌\n\nEdit: words, spaces, punctuation, and clarified a pronoun.\n\nEdit 2: when I said \"we're talking to CNBC right now, say Hi superstonk!\" Or whatever the exact quote was... I was literally talking about the live CNBC camera in our face, filming all of us.",
    "title": "Shareholder Meeting- I DID NOT DO ANY INTERVIEWS",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/nw0i5u/shareholder_meeting_i_did_not_do_any_interviews/"
}