{
    "author": "Leenixus",
    "created_utc": 1620257492.0,
    "distinguished": null,
    "edited": 1620303382.0,
    "id": "n5trot",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n5trot",
    "num_comments": 2127,
    "permalink": "/r/Superstonk/comments/n5trot/i_dont_to_tout_the_horn_without_knowing_anything/",
    "score": 14478,
    "selftext": "First of all, control yourselves. This isn't confirmation bias. I'm probably wrong. Treat what i have below as such and keep expectations low. Don't fomo into weekly contracts or plan to trade based on what i'm about to say. I'm not a financial advisor and this is not financial advice.\n\n\\----------\n\n***Seriously, don't get excited and don't hype this. We don't know anything, this is a theory, nothing more.***\n\n***I have 0 concrete data on any of what i'm about to write.***\n\n\\----------\n\nEDIT: A user mentioned that today's missing Volume might be due to a technical issue. More [here](https://www.reddit.com/r/Superstonk/comments/n5u3bm/cta_processing_issue_resolved_update_417_pm/?utm_medium=android_app&utm_source=share) and [here](https://www.reddit.com/r/Superstonk/comments/n5t2fi/disappearing_1m_volume_mystery_solved/?utm_medium=android_app&utm_source=share). I speculated that today's missing volume were cancelled trades due to someone getting margin called. IF this is the issue, then perhaps my DD is dogshit and maybe don't read it. Up to you.\n\n&#x200B;\n\n# Kudos to whom deserves it.\n\nFirst of all, kudos and attribution to the person who came up with the idea.  [u/AOCsquad126](https://www.reddit.com/user/AOCsquad126/)\n\n[https://www.reddit.com/r/Superstonk/comments/n27l05/i\\_may\\_have\\_just\\_figured\\_out\\_the\\_margin\\_call/](https://www.reddit.com/r/Superstonk/comments/n27l05/i_may_have_just_figured_out_the_margin_call/)\n\nWhen i read this, i almost shat myself. I like patterns and stuff like that and i instantly loved what this ape theorized as it looks (to me) to be legit. Please read his DD first before continuing it's vital to understanding what i'm about to write next. Attribute awards and stuff like that to him, not me.\n\n&#x200B;\n\n# Ok, ready?\n\nI think he's right. I think that everyday that does pass, \"they\" (i don't know who they are) are losing on average $4.80 off their GME \"ceiling\". Basically he theorized that he almost perfectly calculated at what price the Market Makers and friends are to be margin called. I think he hit the jackpot.\n\nAgain, calm your mammaries. We won't know if this is true until it happens. Calm down. Don't forget that HOLDING through bullshit dates and theories is the way. Just buy and HOLD.\n\n&#x200B;\n\n# So here's the \"data\"\n\n***It's fucking raw***\n\n&#x200B;\n\n*Legend*\n\n* **Linear Margin Call Trigger Price:** This is the theoretical price at which \"they\" (the baddies) get margin called. It goes -$4.80 dollars per day because they are bleeding.\n* **Peak For The Day:** Pretty much the all time high for that day. (Data from tradingview premium subscription+feeds)\n* **Closing Price:** Pretty much the price at which the market closed for GME for that day. Easy.\n* **Diff from Trigger (Peak):** The formula for this is (Peak for the day - LMCTP)\n* **Diff from Trigger (Close):** The formula for this is (Closing Price - LMCTP)\n\n&#x200B;\n\nhttps://preview.redd.it/bhxtx831vdx61.png?width=1296&format=png&auto=webp&s=8b91abdf7b1728188bfe1a60daba56c52db27272\n\nYeah i know, it looks like shit and you don't understand. Don't worry, i'll explain here and below what you're looking at.\n\n**ELIA:** Scroll up, you'll notice that the 2 last columns, the ones named \"Diff from Trigger (Peak)\" and \"Diff from Trigger (Close)\". Also keep the \"Peak for the Day\" in mind.\n\nNotice that as time moves forwards, the \"Diff from Trigger (Peak) and (Close) get closer to 0. The idea is that once that number reaches 0 or ABOVE (+), they are margin called.\n\n**This is important as fuck. Don't forget this.**\n\n&#x200B;\n\n# When did they almost get margin called?\n\nWelp, go up and look at the data. Look at the 3 following dates and i'm 10000% sure you remember at least 2 out of 3.\n\n1. January 28 (The day they cheated)\n2. March 10 (The day we saw the $100 dollar drop whipsaw movement in 10 minutes)\n\nGo up and look at these dates. Come on... i'll wait. What do you see? What's the Diff from Trigger values? What's that? They're positive? But that would mean... yes. They almost got margin called.\n\nThis perfectly explains January 28 and March 10.\n\n***\"bUt WaIt, YoU sAiD tHeRe'S 3 DaTeS\"***\n\nApril 29 - May 5, take a look at those. I'll wait here.\n\nYep, also \"almost margin called\". But wait, this has gone on for 3 days now and the price hasn't dropped like it did the last 2 times.\n\nWhat else did we see today? **WHAT'S THAT? SOME VOLUME DISAPPEARED FROM THE GME CHARTS????**\n\n**I think they got margin called. I think their orders for today got cancelled. That's what we're seeing.**\n\nTHIS IS A THEORY THEORY THEORY THEORY. Don't perpetuate it.\n\n&#x200B;\n\n&#x200B;\n\n# DON'T FUCKING DANCE (Yet)\n\nHere's the data above, visualized. (kek, you're welcome, i made you look at punk ass raw data first lmao).\n\n\\---------\n\n**The blue line is important.** This is where they supposedly get margin called. This line is lava, you touch it you die.\n\n**Green and Purple.** These are important too. If they touch 0 or go above it, game over, call an ambulance (for them).\n\n**Yellow and Red.** If these touch the blue line or go above it, it's game over (for them).\n\n\\---------\n\nNow... LOOK AT IT.\n\n**January 28, we booped all the lines, they panicked and cheated.**\n\nhttps://preview.redd.it/z8qg4kjlwdx61.png?width=1623&format=png&auto=webp&s=34dc24e9dac4c3f3a5ff9edf5b46395b63992874\n\n&#x200B;\n\n**March 10 - The day GME did a whipsaw and dropped $100 dollars in 10 minutes.**\n\nhttps://preview.redd.it/v1j0ydccxdx61.png?width=1625&format=png&auto=webp&s=626e0891d32348826e41fc01060512909bc719c2\n\n**April 29 - May 5 - The day... wait what?**\n\nhttps://preview.redd.it/5mp8920ixdx61.png?width=1627&format=png&auto=webp&s=d635d87f1f39724620f68e485f013e149eb8ce4d\n\nYep that's right gentlemen. The lines touched each other ;)\n\nWhat's more... the price didn't dip like it did before. Is this it?\n\nCALM YOUR TATAS PLEASE. I know that some of you are jaqued to the le tit, but please calm down. DON'T HYPE.\n\n&#x200B;\n\n**THIS IS THEORETICAL.**\n\n**I do not have access to Citadel's or Melvinators or anyone's office data to verify that they truly get margin called above this THEORETICAL price. DO NOT HYPE DATES. DO NOT. Let's sit back ad we always have, do our DD and watch things happen.**\n\nNothing's changed. We haven't won. We will win when we win if we win. Continue your DD, don't get any hopes up, none. Just keep this in mind, and let's see what happens.\n\n&#x200B;\n\n# Now what would happen after this \"Margin Call\"\n\nWelp, if they have truly been margin called, today, then... If this is an Archegos type blowout, we could expect the first domino (MM or HF) to drop in UP TO T+35 days from now. Once the first domino drops, the rest will follow.\n\n&#x200B;\n\nMARKET MAKERS HAVE A T+35 DAYS PRIVILEDGE TO DELIVER FTDs (SHARES THAT FAILED TO DELIVER)\n\nHEDGE FUNDS ONLY HAVE UP TO T+6\n\nIF CITADEL IF IF IF THEY GOT MARGIN CALLED, THIS COULD GO ALL THE WAY OUT TO T+35\n\nT+35 CALENDAR DAYS [https://www.sec.gov/investor/pubs/regsho.htm](https://www.sec.gov/investor/pubs/regsho.htm) (Search for \"35\" )\n\n~~T+35 FROM TODAY IS JUNE 24 NOT JUNE 9 :D~~\n\nI'm unable to find the provision that indicates when and how long it takes to resolve a margin call. If an ape can direct me there that'd be great otherwise i'll find it myself.\n\n&#x200B;\n\n**(BIG ASSUMPTION about Archegos here, we don't know if Archegos shorted GME)** Once the first HF or MM gets margin called, you will NOT hear about it. Archegos got margin called sometime in February as far as i'm aware and is likely why we ran up to $276. When did we hear about Archegos? Yes that's right, around over a month later.\n\nThe same will happen here. If someone has fallen, we will not know for another T+35 days max. But once we do know someone has fallen in T+35, then this DD is verified and we perhaps win, let's see. We're either going to be in a controlled uncoil and recoil FTD squeeze or a stupid massive squeeze to high heavens. Nobody knows. Have a floor (not a ceiling).\n\nAlso they can't issue new bonds (or can they) because only AA2 bonds or above are now accepted as investment grade collateral. (Shamelessly stolen by that DD we saw this week about bonds by a man who's username i don't remember & another ape who reminded me of this)\n\nThank you. And once again, please no hype, no reposting, do not hype this and then when nothing happens you'll have a bad day because GME didn't make you rich bois. Continue with your life and if things happen, they'll happen.\n\nThank you. Here's the raw data for the charts and the theory. [https://pastebin.com/fNPmDNBe](https://pastebin.com/fNPmDNBe)\n\nAgain please take a look at [u/AOCsquad126](https://www.reddit.com/user/AOCsquad126/) who came up with the idea initially. I just built a bit upon it. We've talked and he's aware i'm posting this.\n\n**EDIT: An ape in the comments said that a Citadel Executive of 16 years stepped down today. Article below. CONFIRMATION BIAS TO THE MAX. I'm JAQ LE TIT**\n\n[https://www.pionline.com/money-management/head-citadels-surveyor-capital-steps-down](https://www.pionline.com/money-management/head-citadels-surveyor-capital-steps-down)\n\n&#x200B;\n\n# EDIT: Please if you're going to talk about this. Make sure you're informing everyone that you're talking about a THEORY. Make sure your audience is well informed and don't deceive them.\n\nJust buy and HOLD. It's the only true way. Don't base your trades on dates and bs.\n\n\\------------\n\n**tldr: I believe they just ran out of money and have gotten margin called based on some numbers that are theory and have no basis in reality.**\n\n**tldr tldr:  Maybe, maybe not.**",
    "title": "I don't to tout the horn without knowing anything, but, i think \"they\" got margin called today.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/n5trot/i_dont_to_tout_the_horn_without_knowing_anything/"
}