{
    "author": "Yonsei",
    "created_utc": 1615233049.0,
    "distinguished": null,
    "edited": false,
    "id": "m0ob9u",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m0ob9u",
    "num_comments": 487,
    "permalink": "/r/GME/comments/m0ob9u/technicals_show_gme_is_going_much_higher_analysis/",
    "score": 4248,
    "selftext": "**TLDR; Volume, MACD, and Short Availability are all extremely bullish for GME. HODL 🚀🚀🚀🚀.**\n\nHang on to your bags, this puppy is going higher. The technicals all point BULLISH signals and signify GME is going much higher.\n\n**Case 1 : VOLUME**\n\nLook  at the volume and price action for the last few weeks. Volume was  actually decreasing from Feb 25 to Mar 3, and the price went UP, this is  extremely bullish. Typically, if price stays flat or up on decreasing  volume, this is bullish.\n\nSecondly, since Mar 3, we have seen increasing volume with higher prices. This is bullish.\n\n&#x200B;\n\n[Wow, look at this set-up](https://preview.redd.it/yutvew3azul61.jpg?width=467&format=pjpg&auto=webp&s=c45a49ab8722ca5a1e287f70e8952e6ec00354e6)\n\n**Case 2 : MACD**\n\nMACD  stands for Moving Average Convergence Divergence and essentially shows  the relationship between two moving averages. The crossover occurred  when Ryan Cohen tweeted his infamous McDonald's vanilla ice cream cone  photo (coincidence?). MACD shows strong momentum and is pointing GME to  higher prices.\n\n&#x200B;\n\n[MACD looks bullish](https://preview.redd.it/v2797p7czul61.jpg?width=493&format=pjpg&auto=webp&s=51982ef08fc93dc8e47b3a1a09d13223212af3c1)\n\n**Case 3 : AVAILABLE SHARES TO SHORT**\n\nFrom  last Friday to today, the shares available to short have dropped a  whopping 600,000 SHARES! Yet the price is up 35%+ today. This is  extremely bullish, the shorts can't even drop the price given 600,000  shorted shares. Now keep in mind, this is counting the shares that are  available to short, and does not include the millions of shares that are  ALREADY shorted. If GME continues to climb higher, the short sellers  may be margin called and forced to sell.\n\n&#x200B;\n\n[600,000 shares shorted!](https://preview.redd.it/qx30867ezul61.png?width=498&format=png&auto=webp&s=c8b08889b2d0198c8879f98d8d5bed78dfc5a281)\n\n**Final Thoughts**\n\nThere  are a lot more tailwinds that can catalyze GME. This analysis doesn't  even consider the possibility of another gamma squeeze or how many  shares are now becoming ITM or \"In The Money\". This will require Market  Makers to purchase additional GME shares if they don't have it in  possession on exercise.\n\nThis also  doesn't consider the fundamental change in the company and how to  properly revalue GameStop from a traditional brick and mortar to an  e-commerce player.\n\nThe technicals signify bullishness and you should continue HODL. Don't be scared with dips as long as the trend is your friend. **🚀🚀🚀🚀**",
    "title": "Technicals Show GME is Going Much Higher. Analysis on Volume, MACD, and Short Availability. 🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m0ob9u/technicals_show_gme_is_going_much_higher_analysis/"
}