{
    "author": "WaldoTheRanger",
    "created_utc": 1618419985.0,
    "distinguished": null,
    "edited": 1618449056.0,
    "id": "mqv0v7",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_mqv0v7",
    "num_comments": 55,
    "permalink": "/r/Superstonk/comments/mqv0v7/remember_that_blackrock_is_only_on_our_side_this/",
    "score": 503,
    "selftext": "They're the largest fund in the world.\n\nWe're helping them wipe out essentially all their competition.\n\nThat's bordering on monopoly territory, which considering this is the financial sector we're talking about, is honestly almost scarier than a bit of behind the scenes manipulation.\n\nWe are fighting alongside an enemy of our enemy, not a friend, and we need to keep that in mind post-squeeze.\n\nThat's all. I know this has been said before, but of all the things that are repeated here daily this is the one that concerns me the most.\n\n&#x200B;\n\nFrom u/brcole, further down in the comments:\n\nLet's look at this from a purely logical perspective.\n\n1. This is a retail uprising against a well-entrenched system.\n2. People making absurd amounts of money do not want change and uncertainty.\n3. The enemy of my enemy is my friend. From the retail perspective Blackrock is currently a \"friend\", just like we are a \"friend\" to Blackrock.\n4. Whatever Blackrock's motives are for their current position the LAST thing they want is millions of empowered retail traders with millions of dollars. We may be a friend this time but that doesn't mean we wont be on the opposite side next time.\n5. Now that many of us have experienced the RUSH of sitting and waiting, we are going to need that rush again and they know this. This means they know many will be back, post GME, for more. See 2 above.\n6. Therefore the only way for Blackrock to come out of this ahead is to let the squeeze happen to achieve their premeditated goals, whatever those may be, and then shutdown retail as quickly as possible.\n7. Assuming the new rules pass and others can't cover losses, they are part bag-holder.\n\nI don't like how this adds up but what I get out of it is once the squeeze happens retail and any institution are no longer \"friends\". This is a battle and I currently feel many apes will be too focused on partying all way up, rather than preparing for a fight. Read your DD, get a game plan, draw on your face with crayon and buckle up.",
    "title": "Remember that Blackrock is only on our side this time, in the future they may become the monster.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mqv0v7/remember_that_blackrock_is_only_on_our_side_this/"
}