{
    "author": "International_Gold20",
    "created_utc": 1623861999.0,
    "distinguished": null,
    "edited": 1623906025.0,
    "id": "o19ak7",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o19ak7",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/o19ak7/the_bigger_short_srdtc2021005_the_return_of_dr/",
    "score": 1417,
    "selftext": "It is no secret that Sun Tzu's *The Art of War* is a popular book amongst the Wall Street elite. So if I were a depraved, worthless hedge fund manager stuck in the unenviable position of being forced to purchase the millions of counterfeit shares I had created in my efforts to deliberately bankrupt a viable company and walk away with tax free profits, what would I do? My only hope at this point is to make retail investors anxious or frightened or uncertain, thus causing them to sell their shares at prices that are *astronomically* lower than their actual value. Otherwise I will not survive and I won't be able to continue my acts of financial terrorism that have allowed me to steal literally hundreds of trillions of dollars from honest, hard working people over the past few decades.\n\n**“The whole secret lies in confusing the enemy, so that he cannot fathom our real intent.”**\n\nHow might I attempt to create FUD that could potentially weaken the apes' morale? Well, they are rather jubilant and many seem to be convinced of imminent victory given everything happening at the moment.\n\n**“All warfare is based on deception. Hence, when we are able to attack, we must seem unable; when using our forces, we must appear inactive; when we are near, we must make the enemy believe we are far away; when far away, we must make him believe we are near.”**\n\nOr as Sun Tzu more simply stated:\n\n**“Appear weak when you are strong, and strong when you are weak.”**\n\nPerhaps it's time for me to unleash a massive FUD campaign or create another colossal dip in an effort to shake some apes off the tree?\n\n**\"Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.\"**\n\nSo for the real me, the \"dumb money\" retail investor:\n\nI must continue to guard against overconfidence and a mercurial temperament.\n\n**\"Prohibit the taking of omens, and do away with superstitious doubts. Then, until death itself comes, no calamity need be feared.\"**\n\nWhile I am certainly happy with my investment in GME, I am not celebrating anything yet. I am not concerned with dates or timelines.\n\n**“Wheels of justice grind slow but grind fine.”**\n\nI do not care about what anyone else thinks I should do with my portfolio or when I should do it.\n\n**“You have to believe in yourself.”**\n\nI am a simple investor. I like GME. I purchased my first shares a long time ago because I believed in Ryan Cohen and the company, but also because I saw that financial institutions had put themselves in a precarious situation because of their greed, wickedness, and the knowledge that they would not be held accountable by any regulatory agency (because they've never been held accountable before).\n\n**“Begin by seizing something which your opponent holds dear; then he will be amenable to your will.”**\n\nDespite the constant FUD and deception perpetuated by the mainstream media, I have continued to purchase shares because the more time that passes, the more I learn, and the more that I learn, the more confident I am in GameStop and in my investment.\n\n**“In the midst of chaos, there is also opportunity.”**\n\nI will continue to BUY and HODL shares of the company indefinitely. Every additional share I own enhances my ability to obtain financial freedom, contribute to efforts that will improve society, and force changes in our corrupt, fraudulent financial system.\n\n**“Opportunities multiply as they are seized.”**\n\nBut the entities on the opposite side of my investment have proven themselves to be immoral, unethical, and criminally ruthless, so I must not lose focus.\n\n**\"The enlightened ruler is heedful, and the good general full of caution.\"**\n\nThis is why no matter what happens, I will simply continue to BUY and HODL. I believe that is an unbeatable strategy. Everything else is just noise.\n\n💎🙌🦍🚀\n\n**Edit:** I just realized that it seems like this...\n\n**\"Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.\"**\n\n...is what Ryan Cohen has been doing to perfection, consistently outmaneuvering the short sellers, as well as everyone else currently acting in opposition to his rapidly transforming company that sits at the center of the juggernaut that is the global gaming industry.",
    "title": "The Bigger Short, SR-DTC-2021-005, the return of Dr. Michael Burry, OBV, the reverse repo market, upcoming NFT, Citadel Luxembourg dissolved...so many reasons for my mammary glands to be stimulated, but I think it's time to recall the words of Sun Tzu...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o19ak7/the_bigger_short_srdtc2021005_the_return_of_dr/"
}