{
    "author": "stsoup",
    "created_utc": 1623843341.0,
    "distinguished": null,
    "edited": false,
    "id": "o12s3z",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o12s3z",
    "num_comments": 462,
    "permalink": "/r/Superstonk/comments/o12s3z/the_usa_govt_has_printed_50_blackrock_is_buying/",
    "score": 3845,
    "selftext": "**The Greatest Financial Crash of all time?**\n\nMichael burry, the guy behind the movie \"The big short\" Who was the first person to predict and Bet agaisnt the market before the 2008 financial crash, in the last 2 days has tweeted out saying basically that \"He's back with a vegence\".  \nPublicly he has (his company) so far put nearly a billion into betting agaisnt the market this year and who knows how much behind the scenes.\n\nHe also tweeted out that he knows we are in the biggest bubble of all time, in all things. Essentially that we are about to pop. He said this bubble is worse by a magnitude of 2 which works out to exactly **100x worse.**\n\nIt just came out today that Blackrock, one of the largest hedge funds, has started taking money out of the stock market and investing it in homes left and right, several thousand homes by the seems of it across canada and america, they surely know that the dollar and stockmarket is about to take a hit, as hedging both ways is what they do.\n\nThere are many other factors, like stock market debt/repo etc being 10X+ higher than ever before, and the fact that major corporations have already JUST received bailouts due to covid, **Meaning this time there may be no fallback whatsoever like in the 2008 Crash.**\n\nSome very informed people outside of GME are saying the stock market and the dollar are going to crash simultaniously due to debt and overprinting of Fiat by basically every country due to covid, and that this next depression starting possibly this year, or at least within 2-3 years, **will make the great depression look like a walk in the park.**\n\n*So* *What the hell do we do?*  \nI posted this in 2 other financial subreddits, and the main advice was to hold onto your butts and buy GME as this could be a catalyst to force shorts to cover.  \n\n\nI'm genuinely worried for myself and my family, thinking about how crazy people wen't over toilet paper when there wasn't even an *actual shortage*.......  \n\n\n*A message from a Silent Ape.*",
    "title": "The USA govt has printed 50%+, Blackrock is buying Property instead of Fiat or Stocks and Michael Burry (of The Big Short movie) is back with a vengence.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o12s3z/the_usa_govt_has_printed_50_blackrock_is_buying/"
}