{
    "author": "2basco",
    "created_utc": 1623896441.0,
    "distinguished": null,
    "edited": 1623902119.0,
    "id": "o1m089",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o1m089",
    "num_comments": 71,
    "permalink": "/r/Superstonk/comments/o1m089/there_is_a_chance_that_udlauer_is_going_to_offer/",
    "score": 500,
    "selftext": "Everyone is assuming that Dave is going to go on CNBC and support the [reuters article](https://www.reuters.com/business/meme-stock-prices-may-not-properly-reflect-demand-nyse-president-2021-06-16/) stating that dark pool trading is affecting supply/demand in a way that impacts retail traders. I think he's mentioned in the past that this is not true due to the way NBBO operates. I could be wrong, but we should manage our expectations.\n\nIf he does offer a counter to the article, it's honestly fine. The fact that the discussion is being had is good and provides momentum for GME. It may further offer a platform for him to address the massive FTD problem that keeps giving us buying opportunities week over week. Buy and hold.\n\nEDIT: Many thanks to u/Retardnoobstonk. I should have said \"hampers price discovery\" instead of saying that it affects supply/demand.\n\nAlso looks like Dave **does share the opinion of the article,** [which he shared](https://www.reddit.com/r/finance/comments/1lciqa/high_speed_trading_impact_on_retail_investors_and/cby0qn7?utm_source=share&utm_medium=web2x&context=3) in r/finance.\n\n>I think the existence of dark pools is hampering price discovery because of how much market share they've gotten. I think dark pools that do shady things, like provide cross-connects or use SIP to price NBBO, while the broker's HFT/prop desk uses direct feeds, is harming investors.\n\nWe still don't know what he'll say, but a little cautious optimism never hurt anyone.",
    "title": "There is a chance that u/dlauer is going to offer a counter-opinion to the article about NYSE dark pool trading by saying that it doesn't affect supply/demand. And that's ok.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1m089/there_is_a_chance_that_udlauer_is_going_to_offer/"
}