{
    "author": "BodySurfDan",
    "created_utc": 1626631328.0,
    "distinguished": null,
    "edited": 1626660312.0,
    "id": "omvrjv",
    "text_only": true,
    "flair_text": null,
    "name": "t3_omvrjv",
    "num_comments": 655,
    "permalink": "/r/GMEJungle/comments/omvrjv/at_the_request_of_apes_a_little_bit_about_myself/",
    "score": 1420,
    "selftext": "To everyone who knows me, whats good ape! To those who don't, nice to meet you I'm u/BodySurfDan aka The Real DMT (my musical pseudonym). Firstly, I met some of you at the shareholder meeting which ended up getting surrounded by lots of confusion. (If there are any questions about that, ask away and I'll answer)\n\nMany of you know me as the Silverback MC, I have been making gme themed music and I may make more songs and post them up. If I do become a mod, I don't want anyone to think I'm abusing my mod to promote my music, I was always posting music up, its one of the ways I lend my energy to uplift the community. However, I wont be stickying it or anything like that, I'll just post it and leave it up to the wind as I always have.\n\nSo now that we have that out of the way, a little about myself. Corruption pisses me off. You can hear it in just about every song I've ever made. I believe a painful truth is better than a lovely lie. I am loyal and would give just about anything to a friend in need, but I have no problem saying no when I sense that I'm being taken advantage of. I have had a rocky upbringing in life and it gave me a wide perspective at a young age and a lot of empathy. I am trained martial artist from a young age, in a Dojo from ages 5-11 which taught me the path of both war and peace. I choose the light side in every game I play, and go for the best possible endings. I was a huge FF7 player, and still start a new game from time to time.\n\nI smoke trees and like long walks on the beach with my girl where i get sunburned, we hunt for beachglass and I go bodysurfing (she mostly watches me from the shore but lately has started to go in the water, not too deep yet though 😂). Many people already know I live in NY near the ocean, for the sake of privacy i wont say more about my location.\n\nI got into GME in late February and was a latecomer to the reddit party. I was a young lurker at the very end of WSB, unable to post but riding the vibe. I was into a few other stocks at the time, but after reading the DD and growing my first wrinkle I quickly liquidated my entire portfolio into GME.\n\nWe are tied together by the fact that we are all GME shareholders, harmed investors by the corruption running rampant on wall street. Bad actors assault from any angle they can, and it takes integrity and vigilance to fight against the tide of corruption. I dont really know what else to say, if you have any questions ask and I'll answer to the best of my ability. OOK OOK Apest Together Strong 💪🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍💪 Edit- Added paragraphs to break up the \"wall of text\"\n\nEdit 2- Adding links to my music for context- [12 Years Ago](https://youtu.be/hOdbQKRkmY8) \\-  [4 Years Ago](https://soundcloud.com/therealdmt/cavalry?in=therealdmt/sets/dmt-playlist)  \\- [Current](https://youtube.com/playlist?list=PLwnVWRXo1Yyj_wOZOER8S5XNPlGHl1mIq)",
    "title": "At the Request of Apes - A little bit about myself and my thoughts on moderation",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GMEJungle/comments/omvrjv/at_the_request_of_apes_a_little_bit_about_myself/"
}