{
    "author": "Skyebits",
    "created_utc": 1626611183.0,
    "distinguished": null,
    "edited": false,
    "id": "ompl1e",
    "text_only": true,
    "flair_text": null,
    "name": "t3_ompl1e",
    "num_comments": 125,
    "permalink": "/r/GMEJungle/comments/ompl1e/moass_is_imminent_all_the_pieces_are_finally_in/",
    "score": 649,
    "selftext": "First let me start by saying that this is just my opinion and some speculation. However, I genuinely believe we are in the endgame and MOASS could happen very soon, like within the next week or two.\n\nWe all know this is a crazy unprecedented situation with lots of parties involved. Because of the diamond handed apes, MOASS is not a matter of if but a matter of when. With lots of implications when MOASS occurs, parties like the DTC and such wanted to make sure it happened in a controlled and organized manner. That's where the new regulations came into place in order to minimize the damage and provide a framework for dealing with this situation.\n\nWe have now reached the point when are the new regulations have been put in place and are effective. This is why nothing has happened before, they were waiting for these rules to be established before they let anything happen. Each rule was systematically put In place in order to ensure they control the situation and MOASS doesn't trigger too early. That's why the automatic margin call rule was one of the last ones to be put in place.\n\nNow, remember those 400k+ puts that expired last friday? Those were likely tied to the massive amounts of ftd in the later half of june. Because they are finally ready for MOASS, I believe those ftd's could potentially be the catalyst that runs up the price, trigger the MOASS. One the new regulations did specify they could not hide their ftd through options anymore. Meaning, they might actually have to cover these ftd now and can no longer kick the can further down the road. \n\nI know it may be ignorant to say this week or the next, MOASS will trigger. But, all the pieces are in place and we have been due for a runup. Trust the process my fellow apes because I have a feeling the end is near. We have waiting months and months so what's another week or two? The dd hasn't changed so stick to the plan, buy and hodl. \n\nAnd don't ever forget, hedgies r fuk. ;)",
    "title": "MOASS is imminent. All the pieces are finally in place.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ompl1e/moass_is_imminent_all_the_pieces_are_finally_in/"
}