{
    "author": "MyDogHasToes",
    "created_utc": 1626588113.0,
    "distinguished": null,
    "edited": false,
    "id": "omkufn",
    "text_only": true,
    "flair_text": null,
    "name": "t3_omkufn",
    "num_comments": 9,
    "permalink": "/r/GMEJungle/comments/omkufn/revisiting_net_capital_t21_and_t35_fail_to/",
    "score": 30,
    "selftext": "Most of you guys don’t know me, but amongst the dumpster fire of Reddit this week, I think there is something crucial we need to talk about. \n\nAnd instead of having somebody who knows what they are doing talk about it, this is  \nNet Capital, and Fail To Deliver cycles: Smooth 🧠 Edition\n\nhttps://i.imgur.com/oPqxQnk.jpg\n\nShoutout to u/Criand for being one of the coolest MF’s on Reddit. I’m a huge fan and I hope I don’t fuck this up. If I do, please tell me and make my day. I’m serious. I want to be able to tell people that you told me I was full of shit.  Moving on\n\nThis is Criand’s Net Capital Cycle from a few weeks back.  What’s I find interesting is that as  June 24th passed without a rise in share price, it seemed like we’ve lost excitement over this cycle. \n\nAgain, I hope I’m understand correctly, but the share offering that GameStop conducted most recently could have bailed the SHF out on this past T+21 cycle. That means that the theory still holds as true as ever, but that it was just pushed back due to the share offering. \n\nI also think that it’s worth noting that the share offering was just a drop in the bucket compared to the estimated SI%\n\nAll of this leads to the fact our next T+21 day cycle happens on July 26th, or the Monday after this next week. \n\nNow, I’m going to let you in on a secret, I LOVE DATES \n\nDates are the shit, and nobody can tell me otherwise. As long as mods are busy with their dumpster fire I will continue to rant about dates. \n\nhttps://i.imgur.com/VfoImUu.jpg\n\nThe only think I like more then Dates is dates that either overlap, or run together. That’s the ENTIRE reason I made this smooth brain post that has been about 99% opinionated, because I am too lazy to source facts and provide them to you. I’m very possibly full of shit, but I told you that.\n\nCheck this shit out.\n\nhttps://i.imgur.com/qdNqdyX.jpg\n\nSomebody has 462,852 Fail to Delivers that went on paper for June 18th. Can anybody guess what 35 calendar days from June 18th is? \n\nYou guessed it! Frida_\n\nNO YOU SMOOTH BRAIN\n\nTHINK APE THINK\n\n4th of July being a Sunday this year means that we observed Independence Day on July 5th, as you probably remember the markets being closed.\n\nThis means that if I’m not a complete idiot who has completely misinterpreted DD on this sub, and twisted it into my own crazy fan fiction, we have something to look forward to on July 26th. \n\n\nWith all of that said, if you made it this far, I can almost guarantee you are bored AF and just looking for some complimentary stock information.\n\nHave a good weekend apes, turn your phone off and go get laid before you get rich and can’t trust anybody.  That’s my advice for\nthis weekend.  I will now conclude with a famous quote from our sub\n\n\n“Dear SHF, \n\nFuck you, pay me.” \n   \n   -Multiple Users (unverified origin)",
    "title": "Revisiting Net Capital T+21, and T+35 Fail to Deliver Cycle: Smooth Brain Edition",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GMEJungle/comments/omkufn/revisiting_net_capital_t21_and_t35_fail_to/"
}