{
    "author": "DigitalArts",
    "created_utc": 1624238406.0,
    "distinguished": null,
    "edited": 1624296097.0,
    "id": "o4js5r",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o4js5r",
    "num_comments": 157,
    "permalink": "/r/Superstonk/comments/o4js5r/happy_fathers_day_kenny_ssr_days_dont_mean_dick/",
    "score": 2476,
    "selftext": "\\*Edits for grammar/spelling/formatting and thank you for the awards, but what would help more? Whether you copy/paste everything, share the link, or simply educate brother and sister apes on the topic, please share this information (I don't even care about credit). Hopefully the SEC can pull away from watching videos of some dude banging  his step-sister to at least take a look.\n\n# Happy Father's Day Apes!\n\nSo u/AnnihilationGod dropped Christmas presents off early last night in the form of [DD](https://www.reddit.com/r/Superstonk/comments/o3e9kg/annihilationgod_presents_the_big_short_data/) just as I was in the middle of an interesting find. 12+ hours later, after I got as much data as I could, I started looking for patterns to see what shook out. I'll be goddamned if Kenny and friends didn't deliver.\n\nOne thing that has been eating at us in our jungle here, is that we know no one is selling, yet on SSR days it doesn't seem to matter cos they short it on the uptick, downtick, sidetick, and anything in between, right? So we all knew it was being manipulated, but no one knew HOW or WHY. I don't even have the full data set (no darkpool data) and nothing with ETF's yet, but I'm about to take apes to school on ANOTHER instance of \"Nothing to see here.\" If you need any of the work, data, whatever let me know. If there is something I'm missing or is wrong, please DM me and I'll correct it.\n\nSo apes, pull up a chair, peel a banana, and get comfy.\n\nKenny, hedgies, broker/dealers, and ESPECIALLY our regulatory bodies that say \"iT's hArD tO pRoVe MaNiPuLaTiOn Is GoInG oN,\" this may get a little weird.\n\n&#x200B;\n\n[Wall Street, this is gonna get.. a little awkward](https://i.redd.it/efi2njh6zh671.gif)\n\n# TL:DR: Abuse of the short sale exemption rule allows SHF's to get around the SSR. SEC says nothing wrong here. 🤷‍♂️🚀🚀🚀🚀🚀🚀🚀🦍🦍🦍🦍🦍🌑🌑🌑🌑🌑🌑\n\n# Short Sale Rule\n\nI'm not gonna talk about the legitimacy or not of short selling, because regardless it's been... problematic at best. The [Securities and Exchange Act of 1934](https://www.investopedia.com/terms/s/seact1934.asp) was created, in part, due to the predatory practices of the financial industry setting up The Great Depression. This act established the short sale rule, which was adopted by the SEC, and it restricted short sales to be priced above the most recent trade price. This is also known as the \"uptick rule.\" After that, all of the major players on Wall Street said \"we promise not to do it again\" and we've had no problems since. 😂😂😂\n\n&#x200B;\n\n&#x200B;\n\n[Yeah, right.. ](https://preview.redd.it/8b0dm984dj671.png?width=574&format=png&auto=webp&s=5cdb6f9a504ac71bc85ff4822bcbde8b7f048016)\n\n&#x200B;\n\n# Status Quo\n\n&#x200B;\n\nAs the years went on, it didn't matter if it was uptick, downtick, or sideways, shorts just kept right on shorting. How do we know that they kept doing it? Because in 2005, we got [Reg SHO](https://www.investopedia.com/terms/r/regsho.asp). Incredibly, the \"myth\" of naked shorts, yeah, was not happening so much, that they needed a way to ensure that the shares could be \"located.\" It goes something like this:\n\n**Me: Hey Mike, can you find a share of GME that I can borrow?**\n\n**Mike: Yeah, I think so.**\n\n**Me: Cool**\n\n**\\*sells share that I just \"borrowed.\"**\n\n&#x200B;\n\nThat's pretty much it... 🤷‍♂️ They don't have to actually find it at that time, just be able to *reasonably locate* said share. Better still, with the way share lending is just free wheeled behind closed doors, multiple people can call Mike up there, and even though he only has the one share somewhere, he says he thinks he can find it to all of them. Now all of them turn around and sell the same share.\n\n&#x200B;\n\n[No MM needed! ](https://preview.redd.it/q5ajpkq36n671.png?width=498&format=png&auto=webp&s=4086ea98879ab9012b4d36cd0d8d40c3ba2c1c39)\n\n&#x200B;\n\n# Welcome to the shit show.\n\n&#x200B;\n\nWe won't mention that any FTD pre-Reg SHO were forgiven through grandfathering, 😒 but real quick, the other part of the amendment states;\n\n**\"The \"close-out\" standard represents the increased amount of delivery requirements imposed upon securities that have many extended delivery failures at a clearing agency.\"**\n\nHuh, I think GME would like a word, but that's another time.\n\n&#x200B;\n\nAlmost there, I promise!\n\n&#x200B;\n\n[SEC Office Circa 2007](https://preview.redd.it/cs44u4hg5i671.jpg?width=1630&format=pjpg&auto=webp&s=9b79b3f89f78ace1564f52a585354429a11d385d)\n\n&#x200B;\n\nIn 2007, while the dumpster of the world economy was just starting to really get warm, the commission had an idea. The SEC, in it's incredible wisdom (pre-Pornhub), concluded that removing short-selling constraints would have no \"deleterious impact on market quality or liquidity.\"  As long as you can \"locate\" the share, you had a free pass to short no matter the price action. Well, we know how the next few years went....\n\n&#x200B;\n\n&#x200B;\n\n[Thank you, Mr. Baum](https://preview.redd.it/x642aoa23k671.png?width=2556&format=png&auto=webp&s=5721ea9a0cfbce15f044267d44dfde15521d2e2f)\n\n&#x200B;\n\nThis takes us to 2010, and realizing the absolute stupidity of giving shorters free reign, the commission said \"our bad\" and amended Reg SHO to include the alternative uptick rule. This is the rule we know and love today that kicks in when a stock's price has dropped 10% below the previous day's close. When that happens the security is placed on the Short Sale Restriction List (SSR), and short sales are only allowed on the uptick for (usually) the remainder of the day and until close of the following trading day.\n\n&#x200B;\n\n[Tripping the SSR 06\\/03\\/21](https://preview.redd.it/yen0bqjggi671.png?width=1085&format=png&auto=webp&s=d304cbce0f02c14a33bf84e5a463c7605a61609f)\n\nNow, the commission couldn't just let a rule be a rule to actually protect investors, they decided it would be wise to include an exception. Because, of course they did. 😑 Let's take a look at it because at this point, I'm not sure what the fuck the SEC is even for.\n\n[https://www.investopedia.com/terms/s/shortexempt.asp](https://www.investopedia.com/terms/s/shortexempt.asp)\n\n[Whoever is lending \\(broker-dealers\\) the shares marks them short exempt if they \\\\\"believe\\\\\" it qualifies](https://preview.redd.it/b8av8160ji671.png?width=694&format=png&auto=webp&s=2c9c8305b7c820d4d1941ca255bf49d599f3b505)\n\n# \n\nhttps://preview.redd.it/07y32lzaji671.jpg?width=500&format=pjpg&auto=webp&s=4cfb76c2ac49e74e8938f0189112aacb9d5d8848\n\nSo, wait, even though there is a SSR, if the lender (broker-dealer) decides it qualifies, they mark it short exempt and then off it goes? Yep. \"Yeah, but it even says it's a rare exception and can be audited at any time, and it's closely monitored\" so that should keep them in line, right? You caught the last line there, huh? About all orders marked SSE will be closely checked by self-regulatory organizations and the SEC? Be a shame if a layman with partial data and in less than 24 hours could see a problem....\n\n# Let's look at a couple random boomer stocks from [stockgrid.io](https://stockgrid.io) because I've already driven myself crazy with our stock.\n\n&#x200B;\n\n[Facebook](https://preview.redd.it/wbq5bxreki671.png?width=1790&format=png&auto=webp&s=84eb672bb6edc589721b4911fa2700126f1c12b2)\n\n&#x200B;\n\n[GM](https://preview.redd.it/8ypciicoki671.png?width=1822&format=png&auto=webp&s=cff5a404cc75fac5c3338716f0a2086d175c98f3)\n\n&#x200B;\n\n&#x200B;\n\nFor the most part, looking at just two stocks that are \"stable,\" it doesn't seem too crazy. Some of the volume there is insane with less than 100,000 short sales marked exempt.\n\n&#x200B;\n\n# Ready to see our baby? 😁\n\n&#x200B;\n\n[BEHOLD!](https://preview.redd.it/gwtfwikuli671.png?width=1821&format=png&auto=webp&s=d0918517d44bc8269406347fb51a16966dd523df)\n\n# Well, shit.. That's a lot of exemptions.\n\n&#x200B;\n\n&#x200B;\n\n[Not done ;\\) ](https://preview.redd.it/hznybjjcmi671.jpg?width=250&format=pjpg&auto=webp&s=c01c372b70c55fb9a670c04a5f86219ed96adf6d)\n\n&#x200B;\n\nNow I got to thinking. With all those exceptions, surely they aren't that stupid...\n\n# Narrator: They were, in fact, that stupid.\n\n&#x200B;\n\nI started digging through all the data for volume, short volume, and short sale exempt shares. Then I pulled the list of days that the SSR trigger has been on for GME (I actually have going back to 2015, but in 2019, GME tripped the SSR all of 5 times for the year. 2020 is where things started to heat up beginning in January. RC buying 9m shares last year dropped a major kink in the bankruptcy lotto plan and hedge fucks have been struggling since. Let's hit it.\n\n&#x200B;\n\n[That's a lot!](https://preview.redd.it/15q379h6oi671.png?width=1437&format=png&auto=webp&s=03a1e92c274ac34f3727663c7d11ef52d9ccd618)\n\n&#x200B;\n\n[This isn't even all of them. There are 3m more that I didn't add in on SSR dates](https://preview.redd.it/1703k4w0qi671.png?width=640&format=png&auto=webp&s=8e4e6a9c1420a2d6f998bd90d73103591aa59e48)\n\nKeep in mind, this is missing dark pool data which in some of the cases make up half of the volume. Nor have I even started cracking into ETFs.... Like, seriously? Are they short exempt because it's on the SSR or some shit? Now, you're skeptical on how they are able to manipulate the price, right? I got you. 😊\n\n&#x200B;\n\n[Enhance!](https://preview.redd.it/wxqv4136ri671.png?width=1241&format=png&auto=webp&s=0d91ba892897d9f0cb7adb220f1aa4e3efa662d8)\n\nSome of our LARGEST drops are on days when there are an AWFUL lot of exceptions to the short sale rule. This is where I'm at now and I don't even need to go further, but guaranteed the longer this goes on, the more I'm going to dig.\n\n&#x200B;\n\nNow, in less than 24 hours, on half or a little more of the data, there is pretty damning evidence of manipulation, no? How the fuck are we sitting here six months later, still?\n\n# Bonus:\n\nIn my search I found short sale exemption codes. What kind of exceptions are allowed?\n\n&#x200B;\n\nhttps://preview.redd.it/kl5oj93ayj671.png?width=817&format=png&auto=webp&s=182c6510138a06c01be4a1a16f4bb39472cd26f7\n\n&#x200B;\n\n[Sauce](https://btobits.com/fixopaedia/fixdic50-sp2-ep/tag_1688_ShortSaleExemptionReason_.html)\n\nAll of them are bullshit, but odd lots... Like the weird order numbers that we see? 🤔\n\n&#x200B;\n\n[Screen from today, 6\\/21\\/21](https://preview.redd.it/8ue9zholkn671.png?width=454&format=png&auto=webp&s=ebfbdea81ecb76936cb839ad19ae0bc8a2125595)\n\n&#x200B;\n\n&#x200B;\n\n[Fuck you, Wall Street](https://i.redd.it/fcvs90uyri671.gif)\n\n&#x200B;\n\n&#x200B;\n\n# Buy, Hold, and Hedgies R Fuk",
    "title": "Happy Father's Day Kenny! SSR Days Don't Mean Dick Do They? I've Got A Surprise From Us To You! ❤🦍🤗",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4js5r/happy_fathers_day_kenny_ssr_days_dont_mean_dick/"
}