{
    "author": "luridess",
    "created_utc": 1617126324.0,
    "distinguished": null,
    "edited": 1617136703.0,
    "id": "mglmzi",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mglmzi",
    "num_comments": 42,
    "permalink": "/r/GME/comments/mglmzi/why_understanding_gamestops_10k_legalese_is/",
    "score": 546,
    "selftext": "[u/luridess on her way to 🦍, 🦍 &🍌 LLP](https://iili.io/qelHCu.jpg)\n\nHi fellow 🦍s,\n\nI was kind of bummed out, as I think we all were, to see the attempted character assassination against u/WardenElite yesterday.\n\n[Not cool. ](https://redd.it/mg82iw)\n\nBefore the original post was locked and a bunch of comments were deleted, I noticed that the people attacking him were the same ones attacking me in [yesterday's SEC Legalese post](https://redd.it/mfrvgq).\n\n***EDIT:*** *Some of you are asking me to identify who these users were and call them out as shills. I'm not going to do that for a few reasons:\n\n1. Starting a witchhunt on this, or any sub, is not only unhealthy but it would also add to the toxicity and divisiveness, which is exactly what the HFs want. We are better than them. \n2. I have no definitive proof that they are shills. They could just be 🦍s who jumped on the FUD bandwagon too quickly without realizing what they were doing.\n3. Everyone makes mistakes, and absent definitive evidence to the contrary it's important to give everyone the benefit of the doubt.*\n\nWhat caught my eye and what I really wanted to point out, is that in my post I was accused of being a shill-spreading FUD because I pointed out, and rightly so, that GME DID NOT CONFIRM IN IT'S SEC 10-K FILING THAT THE STOCK WAS SHORTED.\n\nThey were trying to discredit me, first by saying that I was wrong because I didn't provide enough authorities, and then by trying to say that my translation was too overly simplistic. I stand by what I said and you can read my reasons in my post.\n\nBut I digress, let's go back to the point of my post.\n\nThis is a screenshot from u/WardenElite's [post yesterday](https://redd.it/mg10gp):\n\n[Character assassination attempt using FUD](https://iili.io/qelmSR.jpg)\n\nNotice anything?\n\nThey were trying to discredit u/WardenElite's DD using the incorrect assumption that a lot of 🦍s who don't read legalese made.\n\n**By incorrectly stating that Gamestop confirmed in their 10-K they are shorted over 100%, WHICH GAMESTOP NEVER ACTUALLY SAID, they are trying to discredit DD, assumptions and theories posted by u/WardenElite & possibly other users.** \n\nI don't know anyone. I'm not friends with anyone. I don't make money off of being here. I don't know if the DD u/WardenElite or anyone else provides is good or not. I read through everything and I make up my own mind.\n\nAnd so should you. Because we're all human and no one is perfect.\n\nI could honestly just sit back, be silent, not contribute, and keep my legalese knowledge to myself. So could all the other apes who provide excellen, and much more useful DD than little old me.\n\nSo please, before you attack anyone or jump on the character assassination bandwagon, please make sure you have the correct information and that you challenge what's being said.\n\nThey wouldn't be attacking DD if they weren't scared.\n\nAnd I bet they didn't think that anyone would comb through the legalese in the SEC 10-k to explain the nuances.\n\nKnowledge is power, and the more tools in your toolbox, the better armed you are to spot and ignore shills/FUD.\n\nBut I hope that this gives you all something to think about.\n\nThanks again for listening to my little rant, and please be kind to each other. Because at the end of the day we all want the same thing. But we all have to make up our own minds on what we want to do, and we're just here because we want to share & discuss our opinions/knowledge/jokes etc with other like minded 🦍🦍🦍s.\n\n🙏🙏🙏🙏🙏🙏\n\n\nPs. 💎💅🚀🌕\n\n\n**EDIT: Thanks for the downvotes, shills! I love a good fire sale! **",
    "title": "Why understanding Gamestop's 10-K legalese is important to help identify FUD: Using yesterday's failed attacks against u/WardenElite as an example",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mglmzi/why_understanding_gamestops_10k_legalese_is/"
}