{
    "author": "Suspicious-Singer243",
    "created_utc": 1620091228.0,
    "distinguished": null,
    "edited": 1620134727.0,
    "id": "n4con3",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n4con3",
    "num_comments": 254,
    "permalink": "/r/Superstonk/comments/n4con3/the_march_to_zero_liquidity_pt_2_the_beat_goes_on/",
    "score": 4607,
    "selftext": "*Tick tock. Tick tock.*\n\nYesterday, we reviewed [volume data on GME for every day since mid-January](https://www.reddit.com/r/Superstonk/comments/n3ehw0/the_march_to_zero_liquidity_volume_or_bust/) in part one (of an undetermined number of posts). In that post, **the data showed a trend of declining volume since the first squeeze and made a case for the increasing risk of slippage and volatility**.\n\nGiven the short hedge funds have made volume drier than the steak my wife's boyfriend's made tonight, it's becoming important to look for other indicators of the trend in this story. Volume is so low that even a day featuring more **volume is still net down when looking at a multi-day trailing average** (as demonstrated in Sunday's post).\n\nSo, let's get to sleuthing. **There will be no TL;DR as this is largely just a picture book, my apes.**\n\nHere are three important things to note:\n\n* **The first hour of trading is typically features** the biggest moves in the shortest amount of time and **the largest amount of volume during the day.** In fact, most professional traders only trade a couple hours a day (the first and last). This is because it provides enough liquidity through volume for them to get in and out of their positions with ease. This is why those mid-day big candles are so perplexing. Here are examples of several liquid stocks with 1 hour candles.\n\n&#x200B;\n\n[Small sample size but you can look at virtually any stock and their first hour of trading will be feature the most volume. Except GME today.](https://preview.redd.it/gc93o9sf60x61.png?width=714&format=png&auto=webp&s=245d991c1b8eee5d841aba6e3add993cd1f8df6d)\n\n* **Short volume increased in proportion to yesterday**, which makes sense given the return of the sustained short attack that we haven't seen in a while. Haven't gotten some of that sweet, sweet dip buy in a while. Felt good.\n\n&#x200B;\n\n[Net increase in volume boosted by an increase in recorded short volume.](https://preview.redd.it/9oegb4tw50x61.png?width=616&format=png&auto=webp&s=bc810c3dbebc6dd39ea53ea037a370d25dc12d98)\n\n* **This morning's flaccid first hour was the most limp we've seen in 2021**. The lowest volume first hour of trading of each month is featured below (Edit: column language format).\n\n&#x200B;\n\n[Yeah, I checked every first hour TradingView volume candle in 2021 cause I got time like that.](https://preview.redd.it/oztkmu9ru3x61.png?width=297&format=png&auto=webp&s=ce19b96a85f990c328b8a784b6f0c4ff2101395e)\n\n**So, what's this mean?**\n\n**Volume continues to march toward theoretical zero liquidity** in a downward trend as we move closer to the apex of a massive ascending triangle. How do we know this? Well, a key indicator can be found in the limp first hour of trading on May 3.\n\nThe beat goes on. Just slower.\n\n*Tick...tock.*",
    "title": "The March to Zero Liquidity Pt. 2: The Beat Goes On. Just Slower.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n4con3/the_march_to_zero_liquidity_pt_2_the_beat_goes_on/"
}