{
    "author": "LeCyador",
    "created_utc": 1620605753.0,
    "distinguished": null,
    "edited": 1620619884.0,
    "id": "n8ra9p",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n8ra9p",
    "num_comments": 67,
    "permalink": "/r/Superstonk/comments/n8ra9p/citadel_nyse_and_the_sec_in_the_case_of_the/",
    "score": 750,
    "selftext": "\nBIG EDIT:\nThese are not representative of dark pools, instead they are various third party exchanges that are being suspended.\nThis is likely due to fee structure or other issues. You can read a summary in the linked comment.\n\nhttps://www.reddit.com/r/DDintoGME/comments/n8k4be/found_this_in_the_latest_nyse_rule_filing_appears/gxk18ck?utm_medium=android_app&utm_source=share&context=3\n\n\n\n\n**Incorrect original post below**\n\n\n\nOn Friday, the SEC suspended the use of a number of ~~dark pools~~ exchanges that were in use by various members of the exchanges.\n\nSpecifically, the following: (sourced from [https://www.reddit.com/r/DDintoGME/comments/n8k4be/found\\_this\\_in\\_the\\_latest\\_nyse\\_rule\\_filing\\_appears/](https://www.reddit.com/r/DDintoGME/comments/n8k4be/found_this_in_the_latest_nyse_rule_filing_appears/))\n\n&#x200B;\n\n[List of Suspended Third Party Systems and Data Feeds](https://preview.redd.it/w6615cm1o6y61.png?width=640&format=png&auto=webp&s=7b45579c0e2df6c98e24f11f5dde6d9692dcc7cb)\n\n&#x200B;\n\nThis suspension means that many of these ~~pools~~ exchanges that were allowed to provide connectivity services filed for an amendment to allow for these other 3rd party systems, \n\nTimeline:\n\nMarch 10, 2021 -An amendment is proposed: Which would change the colocation services offered by the Exchange to provide Users the option to access to the systems and data feeds of various additional third parties. These various third parties being the list above.\n\nApril 9, 2021- Amemdment passed:  The proposed rule change became operative\n\nBetween April 9, 2021 and May 7, 2021-More Users added: 5 Users have contracted to receive the services that were added in the Filing.\n\nMay 7, 2021 - SEC suspends amendment:  the Commission suspended the Filing and instituted proceedings to determine whether the proposed rule change should be approved or disapproved.\n\n&#x200B;\n\n**Reason to suspend ~~Dark Pools~~ Exchanges of Citadel, TD Ameritrade, Morgan Stanley, Virtu Financial, and UBS**\n\n\"Pursuant to Section 19(b)(3)(C) of the Act,12 at any time within 60 days of the date of filing of an immediately effective proposed rule change pursuant to Section 19(b)(1) of the Act,13 the Commission summarily may temporarily suspend the change in the rules of a self-regulatory organization (“SRO”) if it appears to the Commission that such action is necessary or appropriate in the public interest, for the protection of investors, or otherwise in furtherance of the purposes of the Act  \n\n Whether the Exchanges have demonstrated how the proposed fees are consistent with Section 6(b)(5) of the Act, which requires, among other things, that the rules of a national securities exchange not be “designed to permit unfair discrimination between customers, issuers, brokers, or dealers\"\n\nsee 15 U.S.C. 78f(b)(4), (5), and (8) \n\nSO, pulling info from this, we can see the the SEC thought these new ~~dark pools~~ exchanges that had been created may not have been fairly dealing with all customers, issuers, brokers, or dealers. \n\n&#x200B;\n\nFrom the filing:\n\n The Commission is instituting proceedings to allow for additional consideration and comment on the issues raised herein, including as to whether the proposed fees are consistent with the Act, and specifically, with its requirements that the rules of a national securities exchange provide for the equitable allocation of reasonable dues, fees, and other charges among its members, issuers, and other persons using its facilities; are designed to **perfect the operation of a free and open market and a national market system, and to protect investors and the public interest**; are not designed to permit unfair discrimination between customers, issuers, brokers, or dealers; and do not impose any burden on competition that is not necessary or appropriate in furtherance of the purposes of the Act; as well as any other provision of the Act, or the rules and regulations thereunder. \n\n&#x200B;\n\nThe SEC believes there may be a reason to look at these ~~pools~~ exchanges, their fee schedules, and the anti-competitve nature that they may help to create in the market. The NYSE has taken SR-2021-38 out in an attempt to delay this suspension by a week. I'm not sure why the NYSE is seeking this change, though I am surprised that they would look to get any trading off their exchange (perhaps there are some lucrative opportunities by providing another way to route to the exchange, I don't know).\n\nUltimately, I don't think this is a big deal, there are many available ~~dark pools~~ exchanges, but it is interesting that the ones that were created only in April 9th of this year have been suspended. I also find it interesting that the ones listed include a number of the ones that other GME posters have been wary of. I speak specifically to the MEMX, Morgan Stanely, and TD Ameritrade ~~pools~~ exchanges.\n\nThe NYSE having many of these services that could possibly have a latency advantage on other services that are not co-located could also be the target that the SEC wants to look at. Giving a service preferential latency, and then charging for that service may be enough anti-competitive behavior that the SEC suspended the amendment.\n\nIn any case, keep searching for the corruption, root it out, and we all get a better place to trade.\n\nSources:\n\nSecurities Exchange Act Release No. 91790 (May 7, 2021) (SR-NYSE-2021- 15, SR-NYSEAMER-2021-13, SR-NYSEArca-2021-15, SR-NYSECHX-2021- 04, SR-NYSENAT-2021-05). \n\nSecurities Exchange Act Release No. 91388 (March 23, 2021), 86 FR 16433 (March 29, 2021) (SR-NYSEArca-2021-15). \n\n[https://www.nyse.com/publicdocs/nyse/markets/nyse-arca/rule-filings/filings/2021/Arca.pdf](https://www.nyse.com/publicdocs/nyse/markets/nyse-arca/rule-filings/filings/2021/Arca.pdf)",
    "title": "Citadel, NYSE, and the SEC in the case of the Disappearing Dark Pools!",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/n8ra9p/citadel_nyse_and_the_sec_in_the_case_of_the/"
}