{
    "author": "Golden_D9",
    "created_utc": 1620591412.0,
    "distinguished": null,
    "edited": 1621262700.0,
    "id": "n8mizw",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n8mizw",
    "num_comments": 462,
    "permalink": "/r/Superstonk/comments/n8mizw/here_is_a_complete_compilation_documenting_the/",
    "score": 13989,
    "selftext": "**TL;DR** To all the shills screaming \"SuPeRsToNk iS lItErAlLy QaNoN\", here is a complete list of market manipulation tactics used by Hedgies so far as documented by PhDs, professors, CEOs, and people that are generally in all accounts way smarter than you. Enjoy. **💎🙌 🚀**\n\n\\-------------------\n\nAs shills and FUD posts continue to attack apes on their personal decisions to hold GME shares, I feel that it is necessary to create a central hub displaying every market manipulation tactic used by hedge funds in this GameStop Saga so far. To be absolutely honest, the mere fact that there are shills that care so much about other people's personal financial decisions is basically proof that the GameStop situation is **not** over. That being said, I understand that there are people suspicious of r/Superstonk and that actions by certain members in this subreddit is definitely not helping. If there are any journalists willing to report on this incident, this can be a good place to start researching as well.\n\nThis compilation will start with the overall thesis on Naked short selling, the influence of the DTCC, and then go on in a somewhat chronological order of the discovered tactics.\n\n# Naked Short Selling\n\nTop of the list is obviously the book Naked, Short and Greedy by Dr. Susanne Trimbath. Below is a link to buy her book.\n\n* **Naked, Short and Greedy— Wall Street's Failure to Deliver**\n   * [https://spiramus.com/naked-short-and-greedy](https://spiramus.com/naked-short-and-greedy)\n\nIf you are interested in the impact of Naked short selling on proxy voting, here's an article recommended by Dr. Trimbath during the Superstonk AMA. It was written by Bob Drummond and published in *Bloomberg Markets*.\n\n* **Corporate Voting Charade**\n   * [https://web.archive.org/web/20060421085925/http://www.rgm.com/articles/FalseProxies.pdf](https://web.archive.org/web/20060421085925/http://www.rgm.com/articles/FalseProxies.pdf)\n\nAnd of course, here's the link to the AMA interview with Dr. T herself.\n\n* r/Superstonk **Live - Dr. Susanne Trimbath, PhD - April 29, 2021**\n   * [https://www.youtube.com/watch?v=fGVY2Kco8ng&t=2451s](https://www.youtube.com/watch?v=fGVY2Kco8ng&t=2451s)\n\nIf you simply want a fairly concise version of what is naked short selling, here is an article published in *The Journal of Trading* by Robert Brooks and Clay M. Moffett. You should be able to finish this in around 45 minutes.\n\n* **The Naked Truth: Examining Prevailing Practices in Short Sales and the Resultant Voter Disenfranchisement**\n   * [https://csbweb01.uncw.edu/people/moffettc/about/Research%20Papers/IIJ-JOT-BROOKS.pdf](https://csbweb01.uncw.edu/people/moffettc/about/Research%20Papers/IIJ-JOT-BROOKS.pdf)\n\nIf you prefer to listen to a business CEO instead of an academic, here's a lecture recorded by Patrick Byrne, CEO of [Overstock.com](https://Overstock.com).\n\n* **Dark Side of the Looking Glass -- UNCUT and intact audio**\n   * [https://www.youtube.com/watch?v=qtkaMx12otQ&t=2323s](https://www.youtube.com/watch?v=qtkaMx12otQ&t=2323s)\n\nAnd here's a basic 4-minute video explaining what is Naked short selling by Patrick Byrne.\n\n* **Patrick Byrne: What is Naked Shorting?**\n   * [https://www.youtube.com/watch?app=desktop&v=BdBe5\\_8z53A](https://www.youtube.com/watch?app=desktop&v=BdBe5_8z53A)\n\nIf you prefer to watch documentaries instead, here's a documentary laying out the basics of Naked short selling directed by Kristina Leigh Copeland. Must watch if you have no idea what's going on.\n\n* **The Wall Street Conspiracy Full Movie Free Online With Permission of Owner.**\n   * [https://www.youtube.com/watch?v=Kpyhnmd-ZbU](https://www.youtube.com/watch?v=Kpyhnmd-ZbU)\n\nIf you prefer to read blog posts instead, here's a series of blog posts written by Larry Smith, someone who has worked on Wall Street for nearly 30 years.\n\n* **Part 1 in a Series of Reports on Blatant, Widespread Stock Manipulation that is Enabled by Illegal, Naked Shorting**\n   * [https://smithonstocks.com/part-1-in-a-series-of-reports-on-blatant-widespread-stock-manipulation-that-is-enabled-by-illegal-naked-shorting/](https://smithonstocks.com/part-1-in-a-series-of-reports-on-blatant-widespread-stock-manipulation-that-is-enabled-by-illegal-naked-shorting/)\n\nIf you want a super technical explanation on how profitable Naked short selling and general manipulative short selling behaviours are, here's a paper written by Professor of Finance at Fordham University, John D. Finnerty. This paper is reposted by the SEC itself.\n\n* **Short Selling, Death Spiral Convertibles, And The Profitability of Stock Manipulation**\n   * [https://www.sec.gov/comments/s7-08-08/s70808-318.pdf?fbclid=IwAR25gnSvXR0Fo0FCVrzlgmnwiN4MikTgxAKU5jQFBLNQ\\_\\_GEzvYAtPFB7cI](https://www.sec.gov/comments/s7-08-08/s70808-318.pdf?fbclid=IwAR25gnSvXR0Fo0FCVrzlgmnwiN4MikTgxAKU5jQFBLNQ__GEzvYAtPFB7cI)\n\nFor some bonus sources, here is a letter to the SEC written by Dr. Jim DeCosta talking about Naked short selling abuse. Full letter here.\n\n* **Letter by Dr. Jim DeCosta**\n   * [https://www.sec.gov/comments/s7-08-08/s70808-428.pdf](https://www.sec.gov/comments/s7-08-08/s70808-428.pdf)\n\n# DTCC\n\nIf you want to know all about the DTCC and how you don't actually own the stocks that you have, here's a paper written by Prof. David C. Donald,\n\n* **The Rise and Effects of the Indirect Holding System: How Corporate America Ceded Its Shareholders To Intermediaries**\n   * [https://www.ilf-frankfurt.de/fileadmin/\\_migrated/content\\_uploads/ILF\\_WP\\_068.pdf](https://www.ilf-frankfurt.de/fileadmin/_migrated/content_uploads/ILF_WP_068.pdf)\n\n# Short Ladder Attacks (aka Wash Trades)\n\nOne of the first uncovered tactics (allegedly) used by hedge funds are Short Ladder Attacks. For months shills have claimed that Short Ladder Attacks do not exist and are created by \"Wall Street Bet conspiracy theorists\". Turns out, we simply got the name wrong— Short Ladder Attacks are actually called Wash Trades. The only reason I added \"allegedly\" is because Wash Trades are, in fact, very illegal.\n\n* **Wash Trading**\n   * [https://www.investopedia.com/terms/w/washtrading.asp](https://www.investopedia.com/terms/w/washtrading.asp)\n\nHere is ex-Citadel employee Dave Lauer confirming that wash trades could happen.\n\n* **AMA with** u/dlauer **from earlier today. 🚨awesome interview🚨 All the short ladder attacks we've been talking about, price manipulation? Yup. So amazing to have a true wrinkle brain let us know what's going on. I highly recommend you watch the full video. Thanks** u/jsmar18\\*\\*.\\*\\*\n   * [https://www.reddit.com/r/Superstonk/comments/n5svjw/ama\\_with\\_udlauer\\_from\\_earlier\\_today\\_awesome/](https://www.reddit.com/r/Superstonk/comments/n5svjw/ama_with_udlauer_from_earlier_today_awesome/)\n\nEdit: Now, we have evidence that Wash Trades exist, we have evidence that Wash Trades could technically happen in Citadel. But do we have evidence that Citadel actually committed Wash Trading? Now, we don't know if they did this time, but we *definitely know* that they have committed Wash Trading *in the past*. Here is some direct evidence. Citadel was fined a grand total of $115,000 on 1/9/2014 for alleged Wash Trading. Check out Disclosure 40 in this document. (Credits to u/[scienceismydogma](https://www.reddit.com/user/scienceismydogma/))\n\n* **BrokerCheck Report— Citadel Securities LLC**\n   * [https://files.brokercheck.finra.org/firm/firm\\_116797.pdf](https://files.brokercheck.finra.org/firm/firm_116797.pdf)\n\n\\-------------------\n\n**It is important to note that all of the following allegations came up** ***after*** **the 28th of Jan. This is concrete proof that the GameStop situation is** ***not*** **over and that shorts have** ***not*** **covered.**\n\n# Shorting Through ETFs\n\nShills are quick to jump in and say things like \"tHeY'rE uSiNg OlD dAtA\" when it comes to the GME Short Interest. But what if they're not shorting GameStop directly but indirectly through ETFs that *contain* GME? What if hedgies have gone so desperate that they are shorting the entire Russell 2000? Here is a paper written by Prof. Richard B. Evans, a professor from the University of Virginia. Interestingly, his last edit was in March of 2021 to include in the GameStop situation.\n\n* **ETF Short Interest and Failures-to-Deliver: Naked Short-Selling or Operational Shorting?**\n   * [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=2961954](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2961954)\n\nIf you prefer to watch lectures instead, here's a lecture Prof. Evans did on the same paper.\n\n* **ETF Short Interest and Failures-to-Deliver: Naked Short Selling or Operational Shorting?**\n   * [https://www.youtube.com/watch?v=ncq35zrFCAg&t=1641s](https://www.youtube.com/watch?v=ncq35zrFCAg&t=1641s)\n\nAnd here are the ppt slides for the lecture.\n\n* **PowerPoint Slides**\n   * [https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/09/Evans-Slides.pdf](https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/09/Evans-Slides.pdf)\n\n# Hiding/ Resetting FTDs in Deep ITM Options\n\nThis is a more technical theory that claims Market Makers are hiding/ resetting FTDs through deep ITM options. Personally, I'm not an options expert, so I haven't been following this theory this closely. But you know who *is* an expert on this theory? John W Welborn at Dartmouth College. You know who else is an expert? The bloody SEC. Here are their papers.\n\n* **Married Puts, Reverse Conversions and Abuse of the Options Market Maker Exception on the Chicago Stock Exchange (John W Welborn)**\n   * [https://www.deepcapture.com/wp-content/uploads/2007.10.09-J-Welborn-Married-Puts-and-Reverse-Conversions.pdf](https://www.deepcapture.com/wp-content/uploads/2007.10.09-J-Welborn-Married-Puts-and-Reverse-Conversions.pdf)\n* **Strengthening Practices for Preventing and Detecting Illegal Options Trading Used to Reset Reg SHO Close-out Obligations (SEC)**\n   * [https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf)\n\n# Buying Shares in Dark Pools & Selling Them in the Open Market\n\nThis theory suggests that Money Makers and Hedge Funds (allegedly) buy shares in Dark Pools like the FADF, and then selling them in the open market, thus suppressing the price of GameStop. The original evidence can be found here in this Reddit post.\n\n* **Sells through the major exchanges. Buys through the FADF - a dark pool.**\n   * [https://www.reddit.com/r/Superstonk/comments/mpebkz/sells\\_through\\_the\\_major\\_exchanges\\_buys\\_through/](https://www.reddit.com/r/Superstonk/comments/mpebkz/sells_through_the_major_exchanges_buys_through/)\n\nNow, are there any credible individuals or groups who support this claim? Shills are quick to draw a literal dark pool in a meme and laugh at it on r/gme_meltdown. Dennis Kelleher, CEO of the non-profit group Better Markets, risked his reputation to file an amicus brief against Citadel. You can find it here.\n\n* **Better Markets Amicus Brief in Citadel v. SEC**\n   * [https://bettermarkets.com/sites/default/files/Better%20Markets%20Brief%20in%20Citadel%20v.%20SEC.pdf](https://bettermarkets.com/sites/default/files/Better%20Markets%20Brief%20in%20Citadel%20v.%20SEC.pdf)\n\n# Payment for Order Flow\n\nAfter all the market manipulation we have seen, the problem of Payment for Order Flow seems oddly insignificant. Personally, I believe that the only reason this was brought up in the hearing was to purposely ignore the many elephants in the room. But if anyone is interested, here's the testimony of Dennis Kelleher from the second GameStop hearing.\n\n* **Testimony of Dennis Kelleher Before the U.S. House Committee on Financial Services Hearing: “Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide, Part II”**\n   * [https://bettermarkets.com/sites/default/files/Kelleher%20HFSC%20Testimony%20GameStop%20Hearing%203-17-2021%20FINAL%20%282%29.pdf](https://bettermarkets.com/sites/default/files/Kelleher%20HFSC%20Testimony%20GameStop%20Hearing%203-17-2021%20FINAL%20%282%29.pdf)\n\n# Bonus Material\n\nApart from the above (alledged) tactics, there are many more that we simply can't prove. The reason for restricting the buying of GME and many other \"meme stocks\" by Robinhood, the collusion with the media to pump up other unrelated investments and to reduce the attractiveness of GME, and many more. But as a bonus piece, here is the host of CNBC show *Mad Money*, Jim Cramer, bragging on live TV how he and other hedge funds manipulate the stock market.\n\n* **Jim Cramer explaining the basics of stock market manipulation**\n   * [https://www.youtube.com/watch?v=8DJlogbrDcA](https://www.youtube.com/watch?v=8DJlogbrDcA)\n\nAnd here is Robinhood CEO, Vlad Tenev, lying under oath when asked about liquidity problems.\n\n* **GameStopped Hearing May 6th -did Vlad Tenev of Robinhood commit perjury during the Feb 18 hearing?**\n   * [https://www.youtube.com/watch?v=j0CSzev8T4Q](https://www.youtube.com/watch?v=j0CSzev8T4Q)\n\nFor a full list of how malicious actors control internet forums, here's a post that details it. (Credits to [u/TheGoombler](https://www.reddit.com/user/TheGoombler/) for making the post and u/[DishwashingUnit](https://www.reddit.com/user/DishwashingUnit/) for reminding me.) Of course, no academic can confirm this, but you could basically tell by yourself that these tactics do work.\n\n* **PUTTING SHILLS ON BLAST, A CONCERNED /BIZ/NESSMAN HAS COME TO SNITCH ON HEDGIE SPYS. MORE INSIDE.**\n   * [https://www.reddit.com/r/Superstonk/comments/mscsb5/putting\\_shills\\_on\\_blast\\_a\\_concerned\\_biznessman/](https://www.reddit.com/r/Superstonk/comments/mscsb5/putting_shills_on_blast_a_concerned_biznessman/)\n\nNow, ok. A list of forum manipulation tactics isn't really actual evidence. Do we have actual evidence of bots infiltrating subreddits? Yes! Here are screenshots of bots pumping up obviously fake stocks with tickers such as $SSR, $CUM, and $ASS.\n\n* **WSB shill bots think SSR is a ticker and are spamming it🤣🤣🤣**\n   * [https://www.reddit.com/r/GME/comments/lxo166/wsb\\_shill\\_bots\\_think\\_ssr\\_is\\_a\\_ticker\\_and\\_are/](https://www.reddit.com/r/GME/comments/lxo166/wsb_shill_bots_think_ssr_is_a_ticker_and_are/)\n* **LADIES AND GENTLEMEN, WE GOT EM**\n   * [https://www.reddit.com/r/GME/comments/ly07ap/ladies\\_and\\_gentlemen\\_we\\_got\\_em/](https://www.reddit.com/r/GME/comments/ly07ap/ladies_and_gentlemen_we_got_em/)\n* **Ass and Twitty**\n   * [https://imgur.com/gallery/q4GECmh](https://imgur.com/gallery/q4GECmh)\n\nLast but not least, for those who would like to \"know thy enemy\" so to say, here is a speech by Ken Griffin uploaded in 2013.\n\n* **Ken Griffin Speech - Economic Club of Chicago (ECC) - May 2013**\n   * [https://www.youtube.com/watch?v=9cwf-JrrE9g](https://www.youtube.com/watch?v=9cwf-JrrE9g)\n\n\\-------------------\n\nI'd like to leave this post with two quotes from our boy Kenny taken directly from his speech above.\n\n(34:29) **\"No company in America deserves the privilege of being too big to fail. None.\"** \\~Ken Griffin\n\n(36:05) **\"Market discipline is a really important function. When companies are poorly managed, they fail. And that releases the resources that are trapped in poorly running businesses to explore and undertake new opportunities.\"** \\~Also Ken Griffin\n\nWell Kenny, let's just say that a lot of your resources will be going to be used to \"explore and undertake new opportunities.\" And as you've said, \"No company in America deserves the privilege of being too big to fail.\"\n\n\\-------------------\n\nThis is, of course, by no means an exhaustive list. **If anyone has any other important sources feel free to put them down in the comment section.** To the GME sceptics, now you have it. To all the journalists, now is the time to do your job.\n\nPeace out. **💎🙌 🚀**",
    "title": "Here is a Complete Compilation Documenting the Existence of Every Market Manipulation Tactic Used by Hedge Funds in this GameStop Saga",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/n8mizw/here_is_a_complete_compilation_documenting_the/"
}