{
    "author": "MacroMikey",
    "created_utc": 1619556922.0,
    "distinguished": null,
    "edited": 1619565563.0,
    "id": "mzye4q",
    "text_only": true,
    "flair_text": "🙌🏻 Charity 😇",
    "name": "t3_mzye4q",
    "num_comments": 243,
    "permalink": "/r/GME/comments/mzye4q/when_this_rocket_takes_off_i_am_going_to_save_my/",
    "score": 4896,
    "selftext": "My wife was diagnosed with HD (Huntington’s Disease) about 5 years ago. HD is a genetic disease that is passed down through family, to sum it up, \n  “Huntington's disease is a rare, inherited disease that causes the progressive breakdown (degeneration) of nerve cells in the brain. Huntington's disease has a broad impact on a person's functional abilities and usually results in movement, thinking (cognitive) and psychiatric disorders.” \n Although she was diagnosed she continues to work full time, the changes that I can notice are slight but also apparent at the same time. My wife lost her father when she was 5 years old to colon cancer. Her mother was diagnosed with HD when she was 32. She is no longer with us. My wife also has three older brothers. All of them have been diagnosed with HD. Basically it’s 50/50 odds wether or not you will contract the disease. My wife’s mother’s family consisted of 9 siblings. Out of the 10 children only 1 sister was not diagnosed with HD. \n  There is no cure for HD (yet) although there have been some clinical trials that showed some promise, but recently the trials were cancelled due to the unsuccessful attempts. My wife and I are both 37. It pains me to say I don’t know how many “good” years we have left... I want to give her everything, although she asks for nothing. I want to take her everywhere! See the world! I want her to live as much of a life as possible before the inevitable. I was planning on taking out a loan against my mortgage one day to be able to do these things. Still don’t have a mortgage... I am so close to buying a home, and continuing my plan for the future. Unfortunately this takes one thing she does not have. Time.... \n  When this short squeeze takes place, and I walk away diamond handing millions of dollars I am going to try and Cure Huntington’s Disease. I am going to make sure that every person in the world knows what HD is and how many people it affects. Maybe we will figure out a cure. Maybe we won’t. I can guarantee one thing. Once we moon, and I can say the words “we don’t have to worry about money anymore” we are hitting the road! Cars trains and airplanes! I can’t change what my wife’s been through. I’m praying I can change her future! And possibly a lot of others as well. \n\nBAND WITH ME FELLOW APES! BUY AND HODL!  STAND YOUR GROUND! \nAPES&GME CURE MARIE! APES&GME CURE MARIE! \n\n\n\nEdit: WOW what an amazing community! I truly love all you Apes! This beautiful synergistic atmosphere that we’ve all created here is shifting the world’s spiritual energy for the better. There going to write books about us and these sub Reddit’s!!!  Marie and I are truly overwhelmed by the support. Word can’t explain how much this means to us. I mean it! I fucking love you allllllll! \n\nHODL THE MOTHERFUCKING LINE!!!!!!\n\n [Huntington’s Disease Society of America](https://hdsa.org)",
    "title": "When this Rocket takes off I am going to save my wife’s life! Fuck Huntington’s Disease!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mzye4q/when_this_rocket_takes_off_i_am_going_to_save_my/"
}