{
    "author": "plants69",
    "created_utc": 1618720084.0,
    "distinguished": null,
    "edited": 1618788019.0,
    "id": "mt62vm",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mt62vm",
    "num_comments": 72,
    "permalink": "/r/Superstonk/comments/mt62vm/the_big_picture_dd_a_comprehensive_dd_suitable/",
    "score": 2120,
    "selftext": "EDIT: some people had a problem with my claim about how the high institutional ownership is indicative of naked shorting so I rephrased that part. Although, I think it's unlikely institutional ownership can be as high as it is without the presence of naked shorting, and this does not even factor in retail ownership.\n\nI originally wrote this up as a 29-slide powerpoint presentation to explain GME to my boomer parents who only invest in index funds, but I decided to convert it to a reddit post because I think it would be useful to new apes or people who wish to see some key DD in one place. I also took out some content about DFV that's widely known by the community here. Anyway:\n\n# The Big Picture DD\n\nThis is a **comprehensive** due diligence intended to be both wide-reaching and approachable, but there are some concepts later on that may require more advanced knowledge.\n\nsome disclaimers:\n\n• To the best of my knowledge, the information presented is accurate, although I am not infallible and neither are my sources.\n\n• I am not a financial advisor and this is not investment advice.\n\n# Gamestop news prior to Jan. 2021\n\n&#x200B;\n\nhttps://preview.redd.it/3s2pl2d1qut61.png?width=2484&format=png&auto=webp&s=109071482185654f0bb39c78ffe1be5ef3712bea\n\n&#x200B;\n\nhttps://preview.redd.it/bskciot3qut61.png?width=1656&format=png&auto=webp&s=c4d65f2c16b430a9ed9779a2fa7a93c36116ee5f\n\n&#x200B;\n\nhttps://preview.redd.it/m0b2e285qut61.png?width=1490&format=png&auto=webp&s=d20c2734bb146827886569a64752017212a9f139\n\n# Where we are now:\n\n&#x200B;\n\n[RC has hand-selected a dream team at Gamestop!](https://preview.redd.it/ea5bo3d8qut61.png?width=1376&format=png&auto=webp&s=e471f6a2518ec98a8d06d576a0fc772786d866fb)\n\n&#x200B;\n\n[No more debt!](https://preview.redd.it/jxxf3hhcqut61.png?width=2054&format=png&auto=webp&s=45d9369dfac32e45b217e797313abfd96954c09a)\n\n# Why does the debt repayment matter?\n\n• The bear thesis of Gamestop imminent bankruptcy is **dead.**\n\n• The junk bonds held some concerning clauses, now the takeout opens the gate for many profitable opportunities ahead.\n\n&#x200B;\n\nhttps://preview.redd.it/j11ebgmpqut61.png?width=1188&format=png&auto=webp&s=5986207eb234af44c645ed43a5a0ecc0c759e934\n\n&#x200B;\n\n[From DOMO Capital Management. Key takeaways underlined in red.](https://preview.redd.it/w7w3471xqut61.jpg?width=1164&format=pjpg&auto=webp&s=c13eac6b5444155f1198dfa7f962843e0e93d8be)\n\n* Debt repayment provides flexibility, allowing Gamestop to engage in mergers, make better use of their real estate assets, and perhaps most importantly: **declare a dividend.**\n* The importance of the dividend will be covered in greater depth during the short theory section.\n\n# DFV has quadrupled down since the congressional hearing in Feb.\n\nHe easily could have sold his options and/or held onto cash but **he didn't.** Bullish af.\n\n&#x200B;\n\nhttps://preview.redd.it/wktwfbhkyut61.jpg?width=500&format=pjpg&auto=webp&s=0d05cf886340be20f87b4e0679ba2a929808cccd\n\n# Gamestop: the big short squeeze theory\n\nWhy the stock holds more than long-term potential and a comprehensive list of strong signals that Gamestop is headed for a short squeeze of unprecedented volatility:\n\n# Other major short squeezes and their SI%, other stats\n\nVW squeeze in 2008\n\n* “On 28 October 2008 a short squeeze on Volkswagen stock propelled this car maker tobecome the **world's most valuable company for a day.”**\n* “In 2008, short sellers had shorted **13% of Volkswagen** (VW) shares... betting the stock wouldtank because it was too expensive. (At the time, VW traded at 19 times earnings—”\n* “On October 26, 2008, Porsche announced that it had bought enough stock and options to control 74% of Volkswagen’s shares. twice that of its competitors.)”\n* “Another firm, Northern Saxony, held 20% of the company... It wasn’t selling. Passive index funds owned another 6%, and they couldn’t sell shares either.”\n* **“Combined, they accounted for 100% of VW shares...** So as soon as Porsche exercised its options, there would be no shares left for short sellers to buy to cover their positions.”\n\nTSLA squeeze in 2019 – 2020\n\n&#x200B;\n\n* “Many of Tesla’s short sellers have closed out their positions over the course of 2020, with **short interest falling to less than 6% of the float from nearly 20%** a year ago, according to S3 data.”\n* **“With shares up over 730%, Tesla bears have seen more than $38 billion in mark-to- market losses this year**, according to data from S3 Partners. By comparison, the next- biggest loss for short sellers was on Apple Inc., at just under $7 billion, S3 data shows.”\n\n# Why didn’t Gamestop squeeze in Jan. 2021?\n\n* Gamestop reached an intraday high of $483 on January 28th The options activity was extremely aggressive this week as far OTM options needed to be hedged by market makers, retail FOMO, and media hype fueled mass-buying as the stock continued to multiply in price.\n* Then, major retail brokerages including Robinhood halted and restricted the **buying** of GME shares, artificially decreasing buy volume. The stock plummeted below $100 in a few days and below $40 over the following weeks.\n* One particular hedge fund, Melvin Capital, had run out of liquidity during the price surge of Jan 28 and was likely on the verge of being margin called until....\n* “**GameStop short-seller \\[Melvin Capital\\] down 30% this year gets $2.8 billion bailout from the firms of billionaire investors Steve Cohen and Ken Griffin \\[at Citadel\\].”**\n* Why would Citadel inject funds into a struggling hedge fund? Likely because the margin calling of this fund would have added jet fuel to GME rocket and collapsed all other shorts with it as they are forced to exit their short positions one by one. The shorts *must* work together or the entire house of cards will fall, leaving behind the biggest bag of financial shit of all time on the DTCC’s desk.\n* Abusive shorting, the restriction of buying, and aggressive negative MSM campaigns drove a narrative that Gamestop was simply a pump-and-dump meme stock of little value and that the short squeeze was over.\n\n# But wasn’t that the squeeze? Short interest dropped off too!\n\n* Market makers and players on the short side of this bet have ways of **hiding the true short interest of stocks.** To summarize the main methods they use:\n* Market makers buy deep-ITM call options to reset their FTDs (failures to deliver, aka shares owed to the institutions lending shares to short that are due to be returned at recurring deadlines, see the link for more FTD stats). [https://wherearetheshares.com/](https://wherearetheshares.com/)\n* Exchange-traded funds holding Gamestop have been aggressively shorted. ETFs are meant to be passively held funds, and iborrowdesk has shown consistent shorting of **ALL ETFs holding GME.**\n* Shady brokers have been diverting retail buying through dark pools in order to suppress buying pressure on the stock to keep the price artificially low. They then dump sell orders on the open market to drop the price.\n* “Dark pools are exchange forums that replicate open stock exchanges, closed off to the public designed to hide institutional trading intent. In other words, by Gary Gensler himself, dark pools are designed to lack regulation, transparency and the light of transparency must be shone upon them” - u/umu68\n* Bloomberg terminals indicate >140% institutional ownership of GME. This is difficult to achieve without naked short-selling, essentially selling a synthetic share that isn’t supposed to exist, creating new shares in the process. Gamestop is supposed to have 70 million shares outstanding issued by the company itself. Many signs point that the number of synthetic shares far exceed the total of outstanding shares.\n* DD for Deep ITM calls: [https://www.reddit.com/r/GME/comments/m05jed/mystery\\_solved\\_the\\_deep\\_itm\\_calls\\_are\\_coming\\_from/](https://www.reddit.com/r/GME/comments/m05jed/mystery_solved_the_deep_itm_calls_are_coming_from/)\n* DD for Dark Pools: [https://www.reddit.com/r/Superstonk/comments/movevb/dance\\_of\\_darkness\\_the\\_sec\\_and\\_dark\\_pools/](https://www.reddit.com/r/Superstonk/comments/movevb/dance_of_darkness_the_sec_and_dark_pools/)\n* DD for ETF shorting: [https://www.reddit.com/r/GME/comments/ls830a/found\\_the\\_reason\\_for\\_the\\_dip\\_they\\_are\\_shorting/](https://www.reddit.com/r/GME/comments/ls830a/found_the_reason_for_the_dip_they_are_shorting/)\n* Bloomberg terminal of institutional ownership: [https://www.reddit.com/r/stocks/comments/le7syu/gme\\_institutions\\_hold\\_177\\_of\\_float/](https://www.reddit.com/r/stocks/comments/le7syu/gme_institutions_hold_177_of_float/)\n\n# Damn, that’s a lot of shady shit. Why can’t they just do that indefinitely...aggressively short to always keep the price down?\n\nHedge funds have been abusive shorting over the decades, and they HAVE been getting away with it indefinitely, and Gamestop was their bankruptcy jackpot. But now, there are some key differences:\n\n**Retail investors own the float. Institutional and insider ownership have been squeezing them for much longer than January of 2021, starting as early as last year’s annual meeting with share recalls. RC’s 9 mil stake purchase in 2020 put even more pressure on shorts.**\n\n* Insiders & Institutions own > 100% of the outstanding shares, even evidenced on the Gamestop website itself.\n   * [https://news.gamestop.com/stock-information/institutional-ownership](https://news.gamestop.com/stock-information/institutional-ownership)\n* DISCLAIMER: This post is highly speculative in nature. The only people who can know how much of the float is owned by retail investors are the ones on the short side of this bet who know their own positions.\n   * [https://www.reddit.com/r/GME/comments/m6vbay/etoro\\_has\\_20mil\\_users\\_905\\_of\\_them\\_is\\_invested\\_in/](https://www.reddit.com/r/GME/comments/m6vbay/etoro_has_20mil_users_905_of_them_is_invested_in/)\n* The post above indicates that roughly 2 million Etoro users have bought GME. Across other major US retail-oriented brokerages, similar rates of retail ownership could be estimated with high user counts. The average number of shares per user can be speculated to be 5/user, 10/user, 20/user, and beyond in order to estimate the SI%. It is purely speculative though, but for example, if 10 million Americans own GME and the average shareholder has 20 shares, that is 200 million shares, or nearly 3x the outstanding shares, NOT including institutions or insiders.\n* Users on Fidelity are placing >75% ratio of buying to selling orders. This signals extremely bullish retail sentiment. (Important: these ratios do not indicate the quantity of buy/sell orders, but this ratio has remained consistently very high).\n   * [https://www.reddit.com/r/wallstreetbets/comments/lajjs2/almost\\_75\\_of\\_all\\_retail\\_gme\\_orders\\_were\\_to\\_buy/](https://www.reddit.com/r/wallstreetbets/comments/lajjs2/almost_75_of_all_retail_gme_orders_were_to_buy/)\n   * [https://www.reddit.com/r/GME/comments/msyhlq/fidelity\\_users\\_purchased\\_about\\_61\\_million\\_more/](https://www.reddit.com/r/GME/comments/msyhlq/fidelity_users_purchased_about_61_million_more/)\n\n# Remember the VW squeeze info?\n\n* VW squeezed to become the most valuable company for one day on only 13% short interest. This was largely achievable because about 100% of the float was being held by companies and institutions long on VW, drying up the market liquidity, making it extremely difficult for shorts to cover and pumping the stock to infinity and beyond.\n* We’re in a similar situation with Gamestop at institutional ownership exceeding 140%, not including retail ownership, ETFs shorting, or other maneuvers market makers/hedge funds have used to hide their positions.\n* So the float is overwhelmingly held by passive funds and insiders who are **RESTRICTED** as to when they can trade shares... Sounds like a nightmare liquidity situation for shorts who could owe hundreds of millions of naked shares. Even with absolutely massive retail panic selling, the amount of GME float choked by institutions and insiders alone could drive an extremely powerful squeeze far greater than the VW squeeze, with SI% being at unfathomable, systemically questionable levels that compromise the stability of US markets as a whole.\n* The thing is, retail investors like the stock. They REALLY like the stock. They don’t want to sell either.\n* **So the short interest is likely greater than 300-500% (based on institutional ownership knowns, retail ownership estimates, missing FTDs, ITM options hiding of SI%) and nobody is selling. What could possibly go wrong?**\n\n# Now that we know our rocket is primed let’s outline the potential catalysts for liftoff\n\n* As mentioned before, now that Gamestop has paid off its junk bonds, it can now issue a **dividend.** And likely a crypto dividend. This is really, *really* bullish news and gone over in greater depth in dividend section.\n* The DTCC (Depository Trust & Clearing Corporation) is a $60 trillion dollar company that settles almost every security transaction in the United States. \"DTCC is a holding company of DTC, FICC and NSCC...**DTCC common shareholders include approximately 362 banks, broker-dealers, mutual funds and other companies in the financial services industry participating in one or more of DTCC’s clearing agency subsidiaries, including NSCC.”** – US treasury gov website.\n* Why does the DTCC matter? **The DTCC has passed several regulations in the recent couple of months that when acted upon at any time, could trigger a squeeze.** And unlike the SEC, the DTCC has incentive to enforce these rules because when Citadel and other hedge funds implode from their reckless activity, the DTCC will be left holding the bag. They want to reduce the weight of it if possible.\n* **Share recall for the annual meeting.** This particular catalyst is imminent, as the deadline to recall looms closer. For shareholders to vote in the annual meeting, they must recall their shares from the players who are borrowing them to short sell.\n* Any positive news: “RC is the new CEO!” “DFV just went all in!” “Gamestop announces new crypto coin dividend!”\n\n# Crypto Dividend\n\nhttps://preview.redd.it/lsbhojusvut61.png?width=958&format=png&auto=webp&s=b9051487f46875c8b372559d28ba902d2595a901\n\n* [https://www.reddit.com/r/GME/comments/mqbu5a/gme\\_possible\\_overstock\\_20\\_overstock\\_issued/](https://www.reddit.com/r/GME/comments/mqbu5a/gme_possible_overstock_20_overstock_issued/)\n* How does a share dividend work? Shareholders get paid the dividend, whether its $1 per share $5 per share. **But shorts do not receive a dividend, in fact they have to PAY the dividend per share**. And since shorts have sold potentially hundreds of millions of shares, they’ll have to pay dividends on all of those holdings.\n* Overstock was being abusively shorted and the CEO issued a crypto dividend. The stock hovered in the $3 range in March of 2020, only to squeeze to $128 later that year after issuing a crypto dividend.\n* In the words of u/Stupiddum: \"Overstock didnt just issue *any* dividend the issued a fucking **CryptoDividend** By doing this they FORCED a share cover... In a normal dividend they can just credit the amount to the account boom\\* bam\\* done.. with a cryptodividend they reside in the blockchain.. and the only way to receive said dividend is to have that physical share. \"\n* Crypto Dividend signals company strength, acknowledges the shorts, increases the stock price, and forces shorts to cover unlike a cash dividend. The coin would increase sales and company growth, increasing the brand value of Gamestop as a ‘tech stock.’ Any shares that are not being held by the lender will have to be returned in order to cash out on the dividend. Many if not most of GME’s shares are being lent out and will have to be repurchased in order for the stock owners to receive their dividend.\n\n# DTCC Rules for Dummies\n\n* All credit goes to u/Antioch_Orontes read this DD if you want an ELIAPE explanation for all of the recent DTC, NSCC, and OCC filings.\n* [https://www.reddit.com/r/Superstonk/comments/msh5mt/a\\_brief\\_overview\\_of\\_recent\\_filings\\_from\\_the\\_dtc/](https://www.reddit.com/r/Superstonk/comments/msh5mt/a_brief_overview_of_recent_filings_from_the_dtc/)\n* The amount of rules that pertain to the market loopholes we’re witnessing hedge funds use to manipulate $GME shows that the DTCC is well-aware of the mess looming around the corner. They want to shrink the bag they’ll be holding when Citadel goes under.\n\n# Ok so GME is a ticking time bomb waiting to blow up... what are the broader market implications of a squeeze?\n\nI’m so glad you asked!\n\n# The Everything Short – by u/atobitt\n\n* Nothing I can write here will truly replace a full reading of this post. It covers the systemic risk that Citadel and other institutions have imposed on U.S. markets via abusive short selling U.S. treasury securities. I’ve included u/atobitt’s key parts for condensed reading but the full post is a worthy read.\n* [https://www.reddit.com/r/GME/comments/mgucv2/the\\_everything\\_short/](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n* I'm sure most dedicated APES have read The Everything Short DD, but if you haven't I would say it is the single most important DD to read on this sub. I have personally read it 3-4 times and there are some components that go over my head but essentially:\n   * Citadel has abusively shorted the U.S. treasuries market to oblivion the same way they've shorted stocks. They use the repo market as a money printer, but now liquidity is drying up and now they're desperate to buy bonds, with a major squeeze signaled in the U.S. Treasury market to come.\n\n# Jerome Powell’s Recent 60 Minutes Interview\n\n* [https://www.youtube.com/watch?v=FOm1JM-yxNU](https://www.youtube.com/watch?v=FOm1JM-yxNU)\n\nWatch this 2 and a half minute video until the end. Notice JP’s body language change for the last question and listen to his careful word choice.\n\nThe interviewer asks questions about what happened to Archegos and the affected institutions that lost big. Could an event like this happen again? Hmmmm...\n\n# New SEC Rule coincides with record-shattering bond selling\n\n&#x200B;\n\nhttps://preview.redd.it/b6rnd3ynxut61.png?width=2130&format=png&auto=webp&s=ada60ae1e755af8be2757417a54dd68304c5ae03\n\n&#x200B;\n\n[      ](https://preview.redd.it/69acnknoxut61.png?width=1156&format=png&auto=webp&s=890d6e84b11af65e84e693d963fb7832e3eac132)\n\n* On April 15th, news broke that JPMorgan sold $13bil in bonds to break records and only the next day does BOFA come in and shatter that record with $15bil bond deal.\n* All of this coincides with a new sec ruling:\n   * [https://www.sec.gov/news/public-statement/staff-fully-paid-lending?utm\\_medium=email&utm\\_source=govdelivery](https://www.sec.gov/news/public-statement/staff-fully-paid-lending?utm_medium=email&utm_source=govdelivery)\n* “SEC rolling out the hits today - Brokers that lend out a customers shares must ensure they have enough capital to cover the customers shares”\n   * [https://www.reddit.com/r/Superstonk/comments/msaqew/sec\\_rolling\\_out\\_the\\_hits\\_today\\_brokers\\_that\\_lend/](https://www.reddit.com/r/Superstonk/comments/msaqew/sec_rolling_out_the_hits_today_brokers_that_lend/)\n* **This rule is to be implemented on 4/22/21. This means lenders have until this date to secure additional capital or else risk being margin called and liquidated**, triggering a chain reaction that could lead to wide-spread institutional collapse.\n* If shorts do not have the capital to cover their positions, they must either raise capital or close out of some of these positions, but they can’t close out of these positions without the security prices spiraling out of their control. Game over.\n* Wow... the SEC is actually cracking down on these guys? Yes that’s thanks to **Gary Gensler, recently appointed chairman of the SEC. About him: “Progressives expect him to look into digital currencies, the GameStop trading mania and how corporate America prioritizes environmental, social and governance issues.”**\n   * [**https://www.cnbc.com/2021/04/14/gary-gensler-confirmed-to-lead-the-sec.html**](https://www.cnbc.com/2021/04/14/gary-gensler-confirmed-to-lead-the-sec.html)\n\n# What’s going to happen to our economy? What about my life savings and 401k?\n\n# I just read The Everything Short and I’m terrified to say the least.\n\nMe too.\n\nThere will be collateral damage. It’s important to not twist the narrative when the house of cards falls. It was rampant greed and the reckless abuse of short-selling by major institutions that have imposed high risk on U.S. markets, not retail investors.\n\nMy biggest hope is that our populace will become more educated about markets as a result and that increased market transparency via new technology and increased regulation efforts will guide us toward a fairer economy after the inevitable occurs.\n\nIn the meantime: can’t stop. Won’t stop. Gamestop.",
    "title": "THE BIG PICTURE DD - A comprehensive DD suitable for new and old apes alike that broadly covers the entire GME saga to date.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mt62vm/the_big_picture_dd_a_comprehensive_dd_suitable/"
}