{
    "author": "ThePatternDaytrader",
    "created_utc": 1618721212.0,
    "distinguished": null,
    "edited": 1618772966.0,
    "id": "mt6bju",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mt6bju",
    "num_comments": 184,
    "permalink": "/r/Superstonk/comments/mt6bju/why_banks_randomly_decided_to_sell_billions_in/",
    "score": 2348,
    "selftext": "Hey there! 👋 \n\nI have mostly lurked and occasionally commented, but I felt like it was worth posting this DD because I haven’t seen anyone else post about it yet.\n\nI’m sure everyone has already seen that a bunch of banks are selling an *assload* of bonds. Buy why? Is it because the Fed isn’t offering ~~infinite money glitches~~ exemptions past this month? Or is there a *deeper fucking reason?*\n\nGuess what all these banks - the only banks selling billions of dollars in bonds - have in common?\n\nThey all have positions in GME.\n\n[Bank of America sells $15 billion in bonds](https://www.google.com/amp/s/www.marketwatch.com/amp/story/bank-of-america-tops-charts-with-15-billion-bond-deal-the-biggest-ever-from-a-bank-11618606409)\n\nYeah, I know it’s from MarketWatch. Bear with me (pun not intended).\n\nOkay, so that seems like a suspiciously large amount of money that they “suddenly” needed on Friday (announced after market close, standard fuckery manuever used during the 2008 crisis). They apparently needed it for “general corporate reasons.” Or maybe...\n\n[March Bloomberg Terminal Drop](https://preview.redd.it/p9f1c97762p61.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=697cfd5c71e0fa2dade4f5e8e5fef0b50f7907cb)\n\nCourtesy of u/RogueYorkShire, this Bloomberg terminal drop shows put positions reported in December. AFAIK, these are reported quarterly and I don’t have access to a BB terminal to show this quarters so this is what I had to work with.\n\nRuh-roh, is Bank of America on there?\n\nBank of America has 5,500 put contracts in GME, they are lucky number 13 with Melvin Capital being 1st obviously. They also have shares.\n\nBut that was just one bank that sold a bunch of bonds and coincidentally had a huge position in GME, right?\n\n[Goldman Sachs sold $6 billion in bonds](https://www.google.com/amp/s/www.barrons.com/amp/articles/goldman-sachs-bank-america-jpmorgan-bonds-dividends-51618602441)\n\n*Oof.* Looks like Goldman Sachs is number 12 on the list of institutions with GME puts.\n\nBut wait! There’s more!\n\n[More institutions with GME puts](https://preview.redd.it/qjzidc7762p61.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7b9c4422d1788a1c03c905615727d41e05cd706c)\n\n[JP Morgan Chase sells $13 billion in bonds](https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/jpmorgan-sell-13-billion-bonds-184602000.html)\n\nJP Morgan Chase is #29 on the list! They had puts on GME too!\n\n*Holy. Fuck.*\n\nGuess who else has GME puts? Take a look at number 28: *Credit fucking Suisse.*\n\nTL;DR a bunch of banks are selling everything that isn’t nailed down because they have skin in GME and know *something* is about to happen and/or are getting ready for a feeding frenzy now that the Fed isn’t letting them print infinite money. \n\nThey gotta pay us our tendies. 🚀🚀🚀\n\nEdit: spelling\n\nEdit 2: As pointed out by u/Significant_Pirate84, I mistakenly put March as the reported date. The screenshot was taken in March but the shorts were reported in December. If another ape could post more recent short positions I will update my DD accordingly.\n\nEdit 3: Since I snort crayons, these are apparently put positions not shorts. The short positions are obviously wayyyyyy higher, but it’s still odd that these 3 banks with lots of puts and shares decided they needed cash the same day.",
    "title": "Why Banks Randomly Decided to Sell Billions in Bonds",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/mt6bju/why_banks_randomly_decided_to_sell_billions_in/"
}