{
    "author": "LtMrDan",
    "created_utc": 1626555648.0,
    "distinguished": null,
    "edited": 1626571820.0,
    "id": "omco6m",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_omco6m",
    "num_comments": 180,
    "permalink": "/r/GME/comments/omco6m/an_updated_breakdown_of_the_gme_squeeze_situation/",
    "score": 2106,
    "selftext": "I was asked to repost this every once in a while... and now seems like a better time than ever to cut through the noise with the GME situation, and to focus on what is important to understand / consider.\n\nA lot has changed since I last posted this, and so I am rewriting this breakdown completely... considering where we currently are in the GME timeline. There is too much to fit into simple bullet points, so this time I have written it out in a longer format.\n\nFor those who are new to considering investing in GME, or if you have already invested and you are trying to piece things together to get a broad overview of the whole GME situation, I have put this post together to hopefully help new investors better understand the situation, to highlight important events that have taken place recently, as well as to point out some things to potentially look forward to. Others have done the real DD, and this is simply an attempt to organize the important points so that new apes can quickly understand what is happening.\n\n**I am not a financial advisor, none of this is financial advice, and I encourage you to do your own research on all of these topics / any trade that you decide to make.** I am simply presenting opinions, and information that I have found elsewhere.\n\nI will provide my own personal opinion and sentiment for GME, but I am not asking you to think the same. I am interested to hear your personal thoughts after you consider the situation from your own perspective / research.\n\nhttps://preview.redd.it/yd1suad86ub71.jpg?width=500&format=pjpg&auto=webp&s=ea8bb88123ca959c047a88ccf751ff008401ecf6\n\n# 2 types of potential value\n\n**Let me start by saying, that I am personally more bullish than ever on the fundamental value of GameStop, as well as the possibility of the most massive short squeeze ever.**\n\nWhich brings up the two most important factors to consider: **#1** Fundamental / future value, and **#2** Short squeeze potential.\n\nIf you are thinking of investing in GME, or if you already have, you have likely heard about the massive potential for a short squeeze of \"meme stocks\". Many people have invested in \"meme stocks\" while only considering the squeeze potential, but one stock in particular stands out to me (and so many others) as a stock that has massive fundamental value in addition to / aside from it's massive squeeze potential.\n\nWhere many of the \"meme stocks\" have been / are still shorted heavily by hedge funds, and therefore have the potential to squeeze far beyond their current price... not all of these stocks have the potential to settle at a fair / fundamental price that is much higher than the current price. i.e. It is widely believed and discussed, that GameStop is destined to reach a much higher price based on the value / future value of the company, considering the fair stock price that would reflect such value. This is a consideration that brings tons of confidence to many investors like myself.\n\n# Expanding fundamental value\n\nSo first let’s discuss the fundamental value / future value of GameStop. This can be considered “aside from the squeeze”, but it affects the potential squeeze anyways, because as the value of GameStop goes up, the hedge funds get closer and closer to being margin called.\n\nYou may have heard that GameStop was making a transition to online sales, but this does not begin to cover what GameStop is doing to transform itself. With the new leadership of chairman Ryan Cohen, and the board of directors that he recently hired from Amazon, Google, Facebook, and more… GameStop is transforming into something beyond just a video game company.\n\nPay close attention to something that Ryan Cohen said for his vision of GameStop, beyond being the \"Amazon of Gaming\". He didn’t say it was going to be a video game company that delights customers... he said it will be a **technology** company that delights gamers. A *technology* company. The products that GameStop has expanded into already show this, but I believe much more is to come. GameStop already sells TVs, Home Theater systems, Home Security, Wearable Technology, Tablets, Computers / Computer parts, Cameras, and more.\n\nBut they are expanding beyond technology too. They also now sell Toys, Collectibles, Computer chairs / Stools, and Clothing. GameStop has also confirmed future expansion into even more products as well.\n\nGameStop only closed it’s underperforming stores... and so in addition to becoming an online retailer, they have **nearly 5,000 stores**!\n\nThey have **over 6,000 jobs posted** on their website, and I shit you not most of them were posted today (7/17)!\n\nGameStop has reported growth in overall sales for the past two quarters, **earning GME a spot in the Russel 1000 index**.\n\n**GameStop now has 2 billion in cash, and is debt free.**\n\nGameStop also just opened **two new HUGE fulfillment centers** to support their transformation!\n\nBeyond these amazing things, what people are so excited about is whatever GameStop has in store with their new NFT project (See Below).\n\nhttps://preview.redd.it/djlx12c37ub71.jpg?width=1920&format=pjpg&auto=webp&s=001f1dd2482a3a09d30c230a391724bfe9d7cc97\n\n# Consider the market cap\n\nThe market cap of a company is at the core of things to consider when determining whether the current stock price is high / low considering the value / future value of the company. The market cap is the number of shares, multiplied by the stock price. So GME currently has a market cap of about 12 billion, with 75 million shares at the price of $170.\n\nSo note that the fewer shares a company has, the more the price must be to maintain the same market cap. So to make a comparison that DFV once did… let’s consider Amazon which is trading at about $3,500 per share, with a market cap of about 1.8 trillion. But GME has fewer shares than amazon, and so if GameStop were to have the same market cap as Amazon, the share price of GME would need to be about $22,000.\n\nSo it is important to note that one stock trading for $200 is not the same as another stock trading at the same price, if they have a different number of shares. That being said, although $200 may seem like a high price in comparison to what GME was trading at before, in terms of market cap it is still considered by many to be a low price, especially considering the transformation that GameStop has been going through.\n\nAnother comparison that is often made, is the market cap of Chewy vs. GameStop… since Ryan Cohen turned Chewy into a multi billion dollar company and now is at the head of a company with way more potential.\n\nChewy has a market cap of over 30 billion, which is over double what GME is. You consider for yourself, the possibilities and the fair value for GameStop, a tech / gaming company... as compared to a pet company (albeit an amazing one).\n\nIt is my opinion, as well as the opinion of MANY others, that the fair value for GameStop is several multiples of its current price, despite the fact that its price has already been multiplied. This just goes to show how low hedge funds were able to bring the price down before traders began to see the value in masses.\n\nAnother comparison that I personally like to make is Netflix Vs. GameStop, even though the two companies are very different... considering my belief in Ryan Cohen, as well as the possibilities for what GameStop can do with NFTs, I personally feel that in time GameStop can reach the Netflix Market cap (if not more) of around 230 billion, which is almost 20x it’s current value. This is based on potential fundamental value alone, and is not considering the squeeze.\n\nhttps://preview.redd.it/245uibdb6ub71.jpg?width=500&format=pjpg&auto=webp&s=fa271f3bb93b7121c2a1de6aa8b8798cc9488728\n\n# What is a short squeeze?\n\nOkay so most of the people reading this have known what a short squeeze is for a long time, but I don't want to make assumptions, and I am sure there will be new people who read this who don't really understand a short squeeze or even a short sale. So I will explain.\n\nA short sale, is when someone borrows a share from someone else, and then sells it at the current market price. They are basically selling a share that didn't belong to them, and promising to replace it later. Taking on a short position means that the shorter / the borrower agrees to replace the share they borrowed at a later time (i.e. agrees to buy it back / cover the short).\n\nSo people will short a company that they think will go down in value in the future, so that when they buy back the share and give it back to who they borrowed it from at a later time, they didn't pay as much for the share that is being returned... and so they get to keep the extra cash from the difference between the old price, and the new lower price.\n\nBut things can go the other way too. If the company increases in value after someone shorted the company, and the stock price goes up, that person who shorted still has to buy back the share, except in this case the price is higher than when they borrowed / sold / shorted the share... and so they actually lose money.\n\nHedge funds shorted GameStop into oblivion, but GameStop made a comeback and started increasing in value. If this had *not* happened, the hedge funds would have made tons of money.\n\nBut it *did* happen. The company value exploded / is exploding, and now hedge funds are stuck with a gigantic short position that must at some point, be covered (They must buy back the shares that they shorted). In a normal world, hedge funds would have either covered their position when the price was still very low, or they would simply cover at a higher price and take a loss if they waited too long. But this is not a normal world. Since hedge funds did *not* cover at a low price (hoping the company would go completely bankrupt), they waited until it was too late, and until the price was too high. Eventually, covering meant taking on a huge loss, and after more time using dirty tricks to \"kick the can down the road\", covering meant being completely liquidated.\n\nSo it is believed that hedge funds have a larger short position in GameStop than any other company ever, and so it is expected that the resulting short squeeze for GME will naturally be greater than the other short squeezes... not just because of the sheer size of the open short positions, but also because during the anticipation for the squeeze... retail investors have become highly educated on squeezes and the possibilities of selling at \"unimaginable heights\" if they make the personal choice to hold until a higher price is reached.\n\nI personally choose to follow in the steps of a great man named Dwight, and decide to HODL.\n\nhttps://preview.redd.it/o6klw41q6ub71.jpg?width=1280&format=pjpg&auto=webp&s=92391b6ae311636a900ebc72447039d862240578\n\nP.S. Short squeezes actually happen all of the time, with low float stocks. It is not uncommon for a \"small cap\" stock to squeeze 10x.\n\nSometimes a short squeeze can happen when the shorters voluntarily cover their position, but at this point it will likely take a failed margin call and forced liquidation for most of the hedge funds to cover, or more specifically for them to *close* their positions completely. If a hedge fund with a smaller position decides to be the first to cover, it may cause a domino effect where the price becomes high enough to margin call / liquidate the other hedge funds with bigger positions.\n\nA margin call happens when a financial institution has too much debt and not enough assets, and they are given a certain amount of time to deposit / come up with money before forced liquidation of assets. As time passes, the price goes up, and hedge funds lose money on their short positions... the likelihood of receiving & failing a margin call becomes higher and higher.\n\n# Shorts have not covered, and GME continues to be shorted\n\nHedge funds have not covered / closed their short positions. The true amount that hedge funds have shorted GME is not currently known, but there has been plenty of evidence to strongly suggest (I can't say \"prove\") that the short positions exceed the total number of shares that are supposed to exist. Similarly, it is strongly believed (I can't say \"known\") that many more shares are in existence than should be possible / legal. For those who don't know what / why this is... some hedge funds create synthetic shares by \"Naked Shorting\". It is a detrimental phenomenon that has been driving companies into the ground for years, and therefore has been impacting stock market prices for years. It allows institutions to sell shares that do not exist, which is why the short positions for \"meme stocks\" were able to become so outrageously large, and why hedge funds were able to get the price so low when people weren't actually selling very much.\n\nIt was not until someone discovered that at one time GME had a reported short interest of 140%, that the world finally started talking about it openly online, and eventually on national news. Of course now the reported short interest is conveniently much lower, but I encourage you to do further research into the ways that institutions can misreport these numbers.\n\nThere are methods that hedge funds use to hide their short positions from the public, and to also hide what are called \"Failure to Deliver\" / FTDS, which occur when the hedge funds fail to meet the obligations created by the short position that they took on. These methods are used not just to hide massive short positions, but also to buy more time before hedge funds are required to finally cover / close their positions. One of these methods that hedge funds use, entails using \"Options\" (Calls / Puts) to hide their positions and/or FTDs.\n\nI will not attempt to explain this, but it is very real... and there was even a rule recently passed by regulators to prevent institutions from doing this. Whether or not this rule will be enforced is up for debate. A large number of options contracts expired on July 16th, and since it is believed that these options were being used to hide FTDs… many people now are waiting to see what happens now that the rule is supposedly in place.\n\nThere are many different ways that people have gathered evidence to support massive open short positions, and many more shares existing than there should be. It is widely believed that the entire float, or more (number of shares that exist / are available to trade) is owned by Reddit traders. Some suggest that hedge funds could possibly have shorted the float up to 10 times over.\n\nDespite Fidelity reporting at least 5x as many buy orders as sell orders for GME, the stock continues to be heavily shorted. Not only does this show a bullish market sentiment for GameStop, but it suggests that a small number of institutions / investors are desperate to go against that sentiment (Perhaps because they are so short and can’t afford for the price to go up without being liquidated...).\n\nWhen thinking of previous statements made by institutions / the media claiming that the squeeze is over and that they covered their short positions... consider a financial institution who has a massive short position, who sees the price rocketing up, and therefore sees their money bleeding away… consider how much an entity like this would want for others to believe that their positions were closed. Now consider the lengths that they might go to to make people believe this, especially if the institution in question had a history of breaking the law and had known ownership of major media outlets other than Reddit. Consider what they would / would not do to get the price back down. If they had been using illegal methods to bring the price down while trying to make money, do you think they would continue using these methods to slow the bleeding? I do. This is why it is important to understand that \"Short Attacks\" are real. Sometimes they happen very quickly, and sometimes they happen over a longer period of time.\n\nUnderstand that short attacks are real, and the negative feelings that they cause are exactly what the attackers want you to feel, in order to make you feel like selling.\n\nhttps://i.redd.it/2yliqj8j6ub71.gif\n\n# GameStop NFT\n\nSomething big is going on at GameStop, on their brand new “NFT Team”. Note that the info below is highly speculative, as Ryan Cohen holds his cards close, and he outright said that he will not announce his plan to competitors before he is ready to take action. But what I hope you will consider is that if any one of the possibilities mentioned below becomes true, GameStop may completely revolutionize the gaming world, if not the entire financial world.\n\nFirst, let me just say that I don’t know a lot about block chain, or digital currencies / tokens, but what I have gathered from so many people who do know about these things... is that whatever GameStop is working on, will be huge.\n\nRecently GameStop revealed a hint that they are working on an NFT (Non Fungible token) project, [nft.gamestop.com](https://nft.gamestop.com), but they have not told anyone what it is yet. The possibilities of what GameStop could be doing with these digital tokens are beyond exciting. It seems to me that there is no application that wouldn’t be revolutionary.\n\n**Possibilities include:** Issuing a digital dividend to shareholders, making the resale of used digital games possible, allowing creators to build / sell their own games / in-game content, allowing characters / items / currency to be transferred from one game to another, creating a virtual world like in “Ready Player One”, or even possibly creating a depository / exchange where assets like stocks or dividends can be traded / issued without corrupt financial institutions acting as middle men.\n\nMany are hoping for a digital dividend, as this was a method that Overstock was able to use to stop the short attacks on their stock as well as to cause shorts to cover their positions, therefore causing a short squeeze. You can research more about this if you like, but the logic behind this is that when a dividend is issued, the shorts are responsible for paying the dividend, and if a unique digital dividend is issued but only for the amount of shares that should exist… the institutions that have large short positions will need to buy back the shares when they are unable to provide the digital dividend.\n\nBut even if this is not what GameStop intends, the other possibilities for a gaming / tech company to use NFTs are absolutely exciting when considering where the gaming world may go next... as well as when considering where the GME price will go in the future, as a result.\n\n# Squeeze potential\n\nYou may see some people saying what their “floor” is, meaning that an individual investor has made a personal decision to not sell their shares until the price reaches a certain point. Some have resolved not to sell some of their shares at all.\n\nhttps://preview.redd.it/24xzor0wpub71.jpg?width=501&format=pjpg&auto=webp&s=a9b95d3932092b08831600ce6c35d40f3dd8a81c\n\nYou might see that many people have set their floor in the tens of millions of dollars, per share.\n\nThis is where it is good to understand that one of the first things traders learn about a short position, is that the potential loss is infinite. So, during a short squeeze the price of a stock can potentially go to “unimaginable heights” (To quote the CEO of Interactive Brokers).\n\nI would like to bring your attention to a few stocks that may expand your mind with concern to the possibilities of a stock going to “unimaginable heights”. These are NOT ALL examples of a short squeeze, but a couple of them did happen because of a short squeeze. No I do not have an example of a stock that squeezed to the magnitude that many believe will happen with GME... because nothing of this magnitude has ever happened before / i.e. it is said to be a once in a lifetime opportunity, and so we can only use squeeze examples that fall short of the current potential. That being said, use your logic / imagination as to what could happen in the GME situation, if / when the short interest is much higher than the examples of other squeezes.\n\nFirst, let’s check out these two stocks. They do not represent a short squeeze, but it is simply to let you know that super high prices exist / are possible. i.e. The very least you can take from this... is that the charts are not going to break when high prices come.\n\n**OSAT**: This stock traded for over 74 billion (yes billion with a capital \"B\") per share in the year 2000, and traded in the millions until about 2009. I can already hear people saying the following, despite my disclaimer above, “This was from stock splits though”. Yeah I don’t really care, the price existed, and for this stock that is all I am trying to convey.\n\n**BRK-A**: This stock currently trades at over $400,000 per share. Yes I know there are not a lot of shares in the float. Again, my point is that it’s not like the systems have never seen these prices.\n\nOkay so let’s look at a couple example of stocks that actually went through a short squeeze.\n\n**DGAZF**: This stock squeezed from $400 to $25,000\n\nYou might also consider taking a look at **Overstock** which squeezed about 1000%, and also **Volkswagen** which was not as dramatic but still made VW temporarily the most valuable company in the world, during the squeeze.\n\nIf GME temporarily became the highest market cap, its price would be beyond $25,000. In my opinion, considering the evidence that suggests GME is shorted far beyond what VW was, it is reasonable to believe that this could happen.\n\nhttps://preview.redd.it/es7l4vxr6ub71.png?width=512&format=png&auto=webp&s=8bd9ff5976556e876afa9cef9d11a8252290d5f3\n\n# The dark side\n\nAll of this transformation doesn’t take place without a battle. Despite GameStop’s trajectory / transformation, the presence of those who oppose GameStop is a very noticeable thing… from the attacks on the price, to the negative sentiment that is spread through mainstream media. The stock is still being shorted, and the news does not like to speak about the amazing things that GameStop is doing. They are everywhere... even in the forums, trying to make people feel FUD (Fear, Uncertainty, and Doubt).\n\nThe shills may imagine themselves \"not going down without a fight\", but it is my opinion that they have been \"going out kicking and screaming\" for months now.\n\nhttps://preview.redd.it/xywzzuws6ub71.png?width=500&format=png&auto=webp&s=5267de20a73a767f968b35fba295c112577dcaac\n\n# The strongest catalyst: Time\n\nIt is natural and logical to always be looking for a specific catalyst that may suddenly spark the squeeze, and although it may come to be that something like a digital dividend or a news catalyst will cause the squeeze to begin... I believe that time itself may be what finally causes hedge funds to be margin called, to fail the margin call, and then to have their positions automatically liquidated / covered.\n\nAs time passes, nothing really happens to the long side besides paying less taxes after a year, but the short side is in a constant battle against time, as their short positions get worse and worse, and continue eating away their capital / assets that are needed to pass the margin call. The very thing that keeps them alive in the short term, is making their failure more certain in the long term.\n\nhttps://preview.redd.it/6g4bu4bx6ub71.jpg?width=355&format=pjpg&auto=webp&s=7cc3d11f71b3e9919c86440079c415f16cc7900c\n\n# The bottom line\n\nShorts must cover. If you so choose to buy and hold, which I certainly fucking do, you stand the chance of being a part of the biggest wealth transfer that has ever taken place. I and many others own shares that hedge funds have promised to buy back at market price, and it is my choice to hold my shares until that price has reached “unimaginable heights”.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nhttps://preview.redd.it/eqezolqy6ub71.jpg?width=500&format=pjpg&auto=webp&s=be5b2d6304b930b8db5d6d251df66253602d1644",
    "title": "An UPDATED breakdown of the GME squeeze situation: Things to look forward to",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/omco6m/an_updated_breakdown_of_the_gme_squeeze_situation/"
}