{
    "author": "Parsnip",
    "created_utc": 1626242100.0,
    "distinguished": null,
    "edited": 1626249602.0,
    "id": "ojy1iz",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ojy1iz",
    "num_comments": 227,
    "permalink": "/r/Superstonk/comments/ojy1iz/diamantenhände_german_market_is_open/",
    "score": 2378,
    "selftext": "Guten Morgen to all of you Great Apes across the world! 👋🦍\n\nDiamantenhände HODL through it all - through dips, through FUD, and most certainly through every attempt to provoke Apes to sell. Yesterday's US market had higher volume, coinciding with many low-effort attempts to make Apes feel discouraged. The SHFs are *really* trying to make us sell low.\n\nOn a related note, I'd like to thank u/pinkcatsonacid for everything she does and has done for this community, and offer unconditional support for the personal decision she announced today. It's obvious that the shills stepped up their \"mod drama\" narrative, trying to add fuel to an already difficult situation. Mods of r/Superstonk: you are appreciated and you have our support. You cultivate a community in one of the most challenging environments on Reddit. Thank you for *everything* you do, and take care of yourselves.\n\nToday is Wednesday, July 14th and you know what that means! GMErican Apes are (or should be!) asleep, so join other apes around the world to watch low-frequency updates from a single German exchange!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟩 120 minutes in: **$182.21 / 153,90 €**  *(volume: 293)*\r\n- 🟩 115 minutes in: $181.32 / 153,15 €  *(volume: 280)*\r\n- 🟥 110 minutes in: $181.12 / 152,97 €  *(volume: 258)*\r\n- 🟩 105 minutes in: $181.80 / 153,55 €  *(volume: 253)*\r\n- 🟩 100 minutes in: $180.97 / 152,85 €  *(volume: 253)*\r\n- 🟥 95 minutes in: $180.91 / 152,80 €  *(volume: 249)*\r\n- 🟩 90 minutes in: $181.32 / 153,15 €  *(volume: 238)*\r\n- 🟥 85 minutes in: $181.12 / 152,97 €  *(volume: 221)*\r\n- 🟩 80 minutes in: $182.03 / 153,75 €  *(volume: 205)*\r\n- 🟥 75 minutes in: $181.03 / 152,90 €  *(volume: 171)*\r\n- 🟩 70 minutes in: $181.32 / 153,15 €  *(volume: 170)*\r\n- 🟥 65 minutes in: $181.09 / 152,95 €  *(volume: 168)*\r\n- 🟥 60 minutes in: $181.38 / 153,20 €  *(volume: 167)*\r\n- 🟥 55 minutes in: $181.53 / 153,32 €  *(volume: 153)*\r\n- ⬜ 50 minutes in: $181.86 / 153,60 €  *(volume: 97)*\r\n- 🟥 45 minutes in: $181.86 / 153,60 €  *(volume: 97)*\r\n- 🟩 40 minutes in: $181.89 / 153,62 €  *(volume: 84)*\r\n- ⬜ 35 minutes in: $181.86 / 153,60 €  *(volume: 84)*\r\n- ⬜ 30 minutes in: $181.86 / 153,60 €  *(volume: 84)*\r\n- ⬜ 25 minutes in: $181.86 / 153,60 €  *(volume: 80)*\r\n- ⬜ 20 minutes in: $181.86 / 153,60 €  *(volume: 78)*\r\n- 🟥 15 minutes in: $181.86 / 153,60 €  *(volume: 78)*\r\n- ⬜ 10 minutes in: $182.00 / 153,72 €  *(volume: 71)*\r\n- ⬜ 5 minutes in: $182.00 / 153,72 €  *(volume: 61)*\r\n- 🟩 0 minutes in: $182.00 / 153,72 €  *(volume: 0)*\r\n- 🟥 US close price: $180.06 / 152,08 €   *($178.31 / 150,61 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from a single German exchange and converting to USD. Today's euro -> USD conversion ratio is 1.18395457. There are occasionally small differences in price that are below the rounding error to two decimal places, which can lead to colorful boxes without obvious price change. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Two weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojy1iz/diamantenhände_german_market_is_open/"
}