{
    "author": "xRehab",
    "created_utc": 1626287753.0,
    "distinguished": null,
    "edited": 1626289694.0,
    "id": "okam0g",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_okam0g",
    "num_comments": 53,
    "permalink": "/r/Superstonk/comments/okam0g/stumbled_on_this_pdf_on_the_sec_site_titled/",
    "score": 817,
    "selftext": "I'm not a smart 🦍 but I have been trying to understand the chain of responsibility between Brokers/MM/Clearing houses/DTCC. Found this in my searches, and it seems to address a lot of things we are seeing with GME. MM abuse of FTDs, oligopoly as a security becomes volatile and hard to borrow....\n\n[PDF on the SEC site titled **\"Failure is an Option:\nImpediments to Short Selling and Options Prices \n\"**](https://www.sec.gov/comments/4-520/4520-6.pdf)\n\nSound like things we are seeing with our favorite stocks right now? Anyone wrinkled want to read this over?\n\nA couple of excerpts that stood out to me enough to post this here...\n\n> The popularity of failing and the price improvements it provides short sellers\nencourage us to step back and consider the economic case for delivery\n\nthen we have\n\n> Thus, the cost of failing to deliver is the cost of a zero-rebate\nequity loan plus the expected incidence of buy-in costs. **If this incidence is low enough,\nthen failing is a valuable alternative to borrowing the harder-to-borrow stocks**. We show\nthat the alternative to fail is valuable and key to the pricing and trading of options. \n\nand \n\n> We can see the advantage directly in the market maker’s shorting experience.\nHalf the time the market maker shorts a hard-to-borrow stock, it fails to deliver at least\nsome of the shares. **And it never accepts a negative rebate, always choosing to fail\ninstead.** This advantage could in principle be offset by frequent buy-ins, but we find a\nvery low frequency of buy-ins, executed with small price concessions. How much of this advantage does the market maker share? Estimating the market\nmaker’s trading profits, net of rebate reductions and buy-ins, **we document a significant\naverage profit.**\n\noh and this gem\n\n> This favors the few highest-volume traders because, since their portfolios\nturn over so much, their fails are rarely the oldest. **Thus, we hypothesize that option market competition tends to oligopoly as stocks grow hard to short.** \n\nA calculation on how it costs MM next to nothing for FTD\n\n> that the buy-in trades are executed at prices 0.53% worse than\nthe volume weighted average price (VWAP) for the given stock on the buy-in day. The\ndeparture from VWAP is statistically significant but even so, if we assume that the\nmarket maker pays the same 0.53% to put the short back on, the overall expected buy-in\ncost is (0.12%)(2)(0.53%), or 0.1bp. **So the expected buy-in cost is, for our market\nmaker at least, vanishingly small.** \n\nAnd they REALLY focus on how clearing houses has unique ways of handling \"special securities\" (GME anyone)\n\n> **We hypothesize that the clearing corporation handles fails in a way that\nfavors higher-volume market makers, resulting in weaker competition when stocks grow\nspecial.**\n\noh boy, and it looks like bigger MMs have to buy-in A FUCK TON less than the average:\n\n>Finally, we can see directly that **our data supplier experiences an abnormally low\nincidence of buy-ins on its fails**. On the average day, across the 502 sample trading days,\nthis large market maker is failing on 4.4M shares. This is about 1.75% of the ~250M\nfails on all NYSE/AMEX/NASDAQ stocks on the average day, in Boni (2005) (see\nFigure 1 of that paper). In Table II we see that our market maker experienced 86 buy-ins\nacross the 502 days, or **about 1/6 buy-in per day**. If this is about 1.75% of buy-ins, we\nshould see about 10 buy-ins per day. But the DTCC reports more than 4,300 buy-in\nnotices per day, and the fraction of notices that result in buy-ins is presumably greater\nthan 1/430. **Thus, our data provider’s fails appear relatively unlikely, compared to other\ntraders’ fails, to beget buy-ins.** \n\n**CONCLUSION**\n\n> IV. Conclusion\n\n> We show that the option to fail is significant to both the trading and pricing of equity\noptions. **We show that it is often in-the-money, and that when it is, market makers profit\nand so do their customers**\n\n\nCan I get a Silverback in here to help wrinkle my brain on this?",
    "title": "Stumbled on this PDF on the SEC site titled \"Failure is an Option: Impediments to Short Selling and Options Prices\" - can I get some silverback wrinkles to read this over with me?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/okam0g/stumbled_on_this_pdf_on_the_sec_site_titled/"
}