{
    "author": "Boringhate",
    "created_utc": 1619116033.0,
    "distinguished": null,
    "edited": 1619271312.0,
    "id": "mwba7s",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mwba7s",
    "num_comments": 160,
    "permalink": "/r/Superstonk/comments/mwba7s/dtcc_the_final_boss_black_hole_liquidity/",
    "score": 1823,
    "selftext": "**V.2**\n\n\n\nV3 NEW UPDATED DD [https://www.reddit.com/r/Superstonk/comments/mx9mxv/v3_dtcc_the_final_boss_corruptor_of_markets_dr/?utm_medium=android_app&utm_source=share]  \n\n\n\n\n\n\n\n\n\nReposting again for more Dissemination , but more enhanced & readable.hopefully can get some discussion this time\n\nTLDR included but recommended you read what the fuck has been going on  for decades\n\nwe must understand everything and go deeper With the DTCC and Cede, we have to talk about it !\n\n&#x200B;\n\n[GIANT FTD Thread where I got this from](https://cmkxunofficial.proboards.com/thread/2494/stock-counterfieting-dr-jim-decosta) if you have the time to gain all the knowledge about how EVRYTHING IS HAPPENING , how deep a grave the hedges can dig themselves read the whole thread. :)\n\n# FTD & CNS\n\n&#x200B;\n\nWhen a naked short seller fails to borrow shares to deliver to the buyer, he fails delivery to the NSCC – the intermediary in the trade. So he has a Failure to Deliver (FTD) sitting there at the NSCC – an IOU to the NSCC for shares. The NSCC is in charge of guaranteeing delivery to the buyer, so the NSCC either dips into the SBP (SHARE BORROW PROGRAM) and borrows some shares to give to the buyer, or if there aren't enough shares at the SBP the trade moves “Ex-Clearing” – outside of the DTCC system.\n\n&#x200B;\n\n&#x200B;\n\n“Ex-Clearing” is where the buying broker and the selling broker make a contractual agreement to handle delivery of the shares off-line, outside the system. Nobody polices these arrangements, so there is no way of knowing when, if ever, the shares are delivered – that is between the two brokers.\n\n&#x200B;\n\n&#x200B;\n\nThis results in share counterfeiting, as the buyer is represented to have received valid “Share Entitlements” when in fact they are nothing of the sort, until the book-entry shares are delivered – which may never happen.\n\n&#x200B;\n\nSo share counterfeiting can occur in a number of ways, but always because of the same factors – the buyer’s broker misrepresents invalid “Share Entitlements” as real to his client.\n\nPretty simple. It is all driven by Wall Street not wanting to have to give back commissions when shares are un-delivered. So a flood of fake “Share Entitlements” – counterfeit shares – are traded in the system as real, and as long as all the brokers treat the fakes as though they are real, everyone on the industry side of the fence wins big – more trades, more commissions, more shares with which to drive down prices for the large, super-important customers of Wall Street – the hedge funds. That is what is known as creating “liquidity” by creating fake shares. It is pervasive, and the SEC and DTCC refuse to tell anyone exactly how big the problem is, or to divulge the size of the problem by company.\n\n&#x200B;\n\n**Everyone on Wall Street – the financial press, the brokers, the DTCC/NSCC/DTC, the research firms, the banks – all have a ton to lose by this being understood by Main Street America.**\n\n&#x200B;\n\nThe Continuous Net Settlement System (CNS). A system implemented by Wall Street to speed transaction processing, which nets sales against purchases, and against the accounts of DTCC participants.\n\n&#x200B;\n\nWhat does it have to do with the magnitude of the Fail To Deliver (FTD) problem?\n\nTurns out, a lot.\n\nBecause of the netting, many delivery failures never show up as such at the DTCC, and consequently are never reported. The DTCC literally doesn't know they exist. How can that be?\n\nHere's an example created  by Dr. Susanne Trimbath , PhD, an authority on the clearing and settlement system:\n\n&#x200B;\n\nHere’s what happens if you settle trade for trade\n\nSell “Deliver” at customer account level (some level below your DTCC account)\n\n\\-100    \n\\+0  \n\n\\-200    \n\\+200  \n\n\\-500    \n\\+500  \n\n\\-800    \n\\+700  \n\ni.e., you are short 100 shares at this level, with 200 shares failed to be delivered and received\n\nNow look what happens at the end of the same day after NSCC Account nets to the -800shares position:\n\nSeller’s DTCC Free Account\n\n9,000\n\nNSCC settlement: -800\n\nBalance after settlement: 8,200\n\n&#x200B;\n\nThere are no failures to deliver at NSCC that day because there were sufficient shares in the sellers free account to cover their bill\n\nTa-dah! Netting hides the failure to deliver\n\n&#x200B;\n\nIn other words, Prime Broker A could have, say, 1 million long shares of NFI in their account, and during the course of the day, several of their big hedge fund customers could fail 400,000 shares, and those would never show up as FTDs because the CNS system would net the fails against their securities in their account, essentially netting the fails against shares in their DTC account.\n\n&#x200B;\n\nHere's how it was further clarified by Dr. Trimbath:\n\n\"For your question, you need to follow through to the DTC account, where shares are taken automatically for CNS settlement by NSCC. Here, we’re talking about a hedge fund that failed to deliver to Prime Broker A, a specific trade that failed delivery. However, because the “free” shares are taken from Prime Broker A’s account there is no reported failure to deliver at NSCC\n\n&#x200B;\n\nIf, for example, the failure is in IBM, and Prime Broker A has a ton of shares hanging around the house account, then those get swept up for delivery and there is no failure in CNS. There is a failure in the system somewhere, but the DTCC never sees it. Prime Broker A should be tracking it, we hope, to be sure they get the shares... But there are no SEC rules about Prime Broker A reporting that. (From what I’ve seen in NYSE audits, the Prime Broker A's of the world aren’t keeping very good records on this sort of thing, frankly).\n\n&#x200B;\n\nNow what if those are NFI, and Prime Broker A doesn’t have a ton of shares hanging around the house account? Now, there’s nothing to get swept out for settlement and you get a reported FTD from NSCC. This helps explain why smaller companies show up on threshold lists more often\n\n&#x200B;\n\nOK, so I get it. CNS nets against the NSCC accounts of the participants, and the only FTDs that are reported are trades over and above whatever each participant has on account, after all trades for the day are netted against each other.\n\n&#x200B;\n\nSo realistically, delivery failures hidden by the CNS system could be much larger than what shows up as FTDs at the DTCC, given that 90+% of all trades are netted. Literally, most of the issued shares of a company on account at the DTCC via brokers could be used up in netting BEFORE the first FTD showed up as we think of them, or as they would show up on a FOIA request.\n\n&#x200B;\n\nNow think about that for a second.\n\nhow much is due to the slop in the system - the CNS hidden delivery failures? Nobody knows.\n\nSo what does that say about market integrity?\n\n&#x200B;\n\nTry this one out. In addition to CNS netting hiding the true level of delivery failures, we also have ex-clearing, wherein failures are moved out of the system and treated as a contractual agreement between two brokers - thus out of, or \"ex\", clearing system. Nobody really knows how large that is, either. And foreign clearing firms also net behind their own curtain, further minimizing the problem's size.\n\n**Are you starting to get it now?**\n\nand further consider how much is hidden behind the curtain of CNS.\n\nHow's that for scary?\n\n&#x200B;\n\nTLDR : The short way of saying it is that CNS netting could easily be minimizing the apparent FTDs problem by 90+%. .\n\n&#x200B;\n\n&#x200B;\n\n# DTCC & COUNTERFEIT SHARES\n\n&#x200B;\n\nThe key to naked short selling fraudsters is to get these trades involving the sale of nonexistent shares to “Clear” even though “Settlement” Which involves the “delivery” of that which was thought to be being bought i.e. genuine “shares” or “packages of rights” attached to a specific U.S. Corporation may never occur. The “Automated Stock Borrow Program” at the DTCC allows shares held in “Street name” at the DTCC to be borrowed from an anonymous “Lending Pool” of shares. This allows the firm of the buyer of these nonexistent shares to receive delivery of “something” that at least resembles a legitimate share at first glance.\n\n&#x200B;\n\nThe problem is that the buying firm is allowed to immediately place these “Shares or share facsimiles” right back into this same anonymous “Lending pool” of shares **AS IF THEY NEVER LEFT IN THE FIRST PLACE. THE BUYING FIRM IS THEN HANDSOMELY REWARDED BY THE DTCC WITH THE CASH EQUIVALENT OF THE SHARES DEPOSITED INTO THE POOL AND CHOSEN TO CLEAR THE NEXT FAILED DELIVERY. THIS WONDERFUL ABILITY TO CONVERT A CLIENT’S PURCHASES OF REAL SHARES OR “PSEUDOSHARES” INTO CASH FOR THE USE OF THE BROKERDEALER PROVIDES PLENTY OF INCENTIVE TO KEEP THE “LENDING POOL” FULL TO CAPACITY.**\n\n&#x200B;\n\nTHE SELF-REPLENISHING ASPECT ALSO HELPS KEEP IT FULL TO ADDRESS AS MANY “FAILED DELIVERIES” AS THE SYSTEM WILL GENERATE WHICH IS AN INFINITE AMOUNT IF NO REGULATOR MONITORS FOR THE APPROPRIATENESS OF THE USE OF THE “BONA FIDE” MM EXEMPTION FROM BORROWING BEFORE SHORT SELLING\n\n&#x200B;\n\n&#x200B;\n\n*The “Counterfeit Electronic Book Entries” “CEBEs”-electronic book entries at the DTCC without a certificated share in a DTCC vault to justify its existence that result from the lack of buying-in these failed deliveries then appear on investors’ monthly statements as readily-sellable “Pseudo-shares” despite the fact that there is no paper certificate in a DTCC vault to justify its existence. Keep in mind that the DTCC at all times has full visibility of the number of “CEBEs” as well as genuine shares held in their vaults. The “Supply” variable that interacts with the “Demand” variable to determine share price then becomes the arithmetic sum of all genuine paper-backed electronic book entries at the DTCC plus the number of “Counterfeit Electronic Book Entries”. This greatly enhanced “Supply of readily-sellable shares” then interacts with a greatly diminished “Effective Demand” for shares due to buy orders for shares being effectively neutralized by the sale of nonexistent shares into these buy orders resulting in the typical precipitous drop in the share price of the preyed upon U.S. Corporation. This allows the unknowing investors’ funds to flow into the lap of those that sold nonexistent “Entities” but still refuse to cover*\n\n&#x200B;\n\n# Dr Jim Decosta Against abusive shorts\n\n&#x200B;\n\nDr Jim Decosta sent many letters to sec trying to change the abuse but we all know sec does nothing.\n\nbut he fought for many years along time ago  and he is extremely knowledgeable about all of this thats going on .\n\nhowever I can not find much information on him other than his letters\n\n&#x200B;\n\n*\"As the “surrogate legal owner” of all shares held in “street name” Cede and Co. as the nominee of the DTC subdivision would clearly be empowered to execute buyins when the shares that they are acting as the “surrogate legal owner” of on behalf of the purchaser never showed up. Acting as the “surrogate legal owner” has fiduciary duties attached. Any market intermediary acting as the “surrogate legal owner” on behalf of the purchaser of securities would according to UCC Article 8 “exercise due care in accordance with reasonable commercial standards to obtain and maintain the financial asset”. This “surrogate legal owner” would owe a fiduciary duty of care to the “beneficial owner” of these securities i.e. the investor that paid for them. Cede and Co. was to take on the role of the “surrogate legal owner” of all shares held in “street name” ONLY in an effort to enhance efficiencies otherwise each stock transaction would necessitate the cumbersome transfer of deed-like instruments. It was strictly forbidden to utilize this “surrogate legal ownership” title and role as LEVERAGE over the “beneficial owner” that purchased the shares whom this “surrogate legal owner” theoretically represents. Note that if the investor purchasing securities were to remain the “legal owner” it would obviously be given access to the information revealing that what he “owns” never got delivered. This generous volunteering of the DTC to act as the “surrogate legal owner” cleverly results in the purchaser of shares not realizing that the securities he purchased never did get delivered. Why? In the case of abusive naked short selling it’s because they never existed in the first place.'*\n\n&#x200B;\n\n\" A bona fide MM would rather sell nonexistent shares at a higher level than at a lower level UNLESS HIS CURRENT NAKED SHORT POSITION HAS GOTTEN OUT OF HAND TO THE POINT THAT COLLATERALIZING AN ASTRONOMICALLY HIGH NAKED SHORT POSITION AT HIGHER LEVELS MIGHT BE COST PROHIBITIVE. SHOULD THIS SITUATION PRESENT ITSELF THEN FRAUDULENT NAKED SHORT SELLING IS OFTEN SEEN AS THE ONLY ESCAPE ROUTE AND A “BLANKET” OF FRAUDULENT NAKED SHORT SELLING IS OFTEN PROVIDED BY THE TROUBLED MM AND ANY WILLING CO-CONSPIRATORS THAT HE CAN “RECRUIT \"\n\n&#x200B;\n\n[Jim Decosta sec letter](https://www.sec.gov/rules/proposed/s72303/decosta010404.htm)\n\n[Sec letter 2 Pdf](https://www.sec.gov/rules/sro/nasd/nasd2005112/jdecosta112405.pdf)\n\n[google link with many results of his letters -if you're feeling like learning from the master](https://www.google.com/search?q=dr+Jim+Decosta+sec&rlz=1C1UEAD_enCA942CA942&oq=dr&aqs=chrome.0.69i59j69i57j0i433l2j46i433j69i60l2j69i61.4127j0j4&sourceid=chrome&ie=UTF-8)\n\n&#x200B;\n\n# Terms\n\n&#x200B;\n\nDTCC: The Depository Trust Clearing Corporation – clears and settles virtually all trades in the US.\n\nNSCC: National Stock Clearing Corporation – subsidiary of the DTCC, acts as the “back office” of a bank, handling debits/credits for stock trades (basically handles the money) and acts as the contra-party in all trades\n\n&#x200B;\n\nSBP: Stock Borrow Program – a program at the NSCC where shares are available from the DTC, on loan, to cover temporary delivery failures.\n\nSelf-Replenishing: The SBP is operated on the honor system, and it allows member brokers to put shares into the anonymous pool of shares in the SBP, to loan to the NSCC. It is said to be self-replenishing because once a share is borrowed by the NSCC, and delivered to the buyer, the buyer’s broker is free to put that same share back into the pool, to be relent out again to someone else. In that manner, one genuine share can give birth to a daisy chain of fake \"Security Entitlements\" at the brokers.\n\n&#x200B;\n\n\n\n\nEdit :1\nShare borrow program no longer exist. But corruption and naked shorting is still there. We drive deeper into how corrupt the market really is And house of cards part 2 might shed more light \n- \n\n\n\n\n\n\n\nTLDR: they been corrupt working together for a long time \nRules has since been put in place to stop these and naked shorting all together. However naked shorting still continues and with hedgies working with dtcc they can get away with alot. But since the mess is so big with gme, dtcc is putting an end to it and try to redirect attention \n\ndtcc loop holes and cede loopholes , hedge funds abuse and sec does nothingits all illegal and been illegal for a long time but nobody cares\n\n&#x200B;\n\nlets talk about it now that we are all mentioning the DTCC & CEDE  \nlets learn together",
    "title": "DTCC THE FINAL BOSS : Black hole liquidity",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mwba7s/dtcc_the_final_boss_black_hole_liquidity/"
}