{
    "author": "thatskindaneat",
    "created_utc": 1619108709.0,
    "distinguished": null,
    "edited": false,
    "id": "mw8k5b",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mw8k5b",
    "num_comments": 80,
    "permalink": "/r/Superstonk/comments/mw8k5b/when_gme_moons_im_very_concerned_about_a_greater/",
    "score": 729,
    "selftext": "Yesterday I had a realization - I genuinely think the US government is already involved in GME and that's why we've been seeing SUCH manipulation of this stock recently. It makes sense to me that they would, they've got to try to land the plane. this isn't 2008 where no one wanted to look, the new administration probably looked immediately after taking over or surely after the initial squeeze in January. \n\nBecause I truly believe we're in a holding pattern until everything can be netted out, I also believe this will reverberate across the entire economy and it concerns me for my friends and family. I have always been the opposite of conspiracy theories, I'm known for always telling people to follow occam's razor, frankly I pride myself on being a logical and critical person. So, to write your father and father in law and say \"I think the market could crash as early as tomorrow\" is a significant step for me so I wanted to come with the facts. \n\nI'm not a financial advisor and I'm not trying to get them to buy GME. That's their choice, I'm just going to hold til it happens because it's happening. But, GME is the symptom of a broader market disease that, like Michael Burry wrote, is on a knife's edge. \n\nSo here's what I wrote them - It is after I had conversations with them both so it may be intentionally missing context because I already spoke to them, but you apes will surely be able to fill the gaps. I'm just going to copy paste because I've wasted enough time writing the thing. I hope the hyperlinks go through. It's my most logical explanation to why I want them to be diligent in the coming days. I made this DD because it includes my theories backed by some research. \n\nPoke holes in it if you'd like, use it (or the premise) if you're struggling expressing to your loved ones that a major market event could potentially be on the horizon. whatever. Just don't take this as financial advice, it is most assuredly not. I'm far too dumb for that. \n\nHello again,   \nI wanted to give a bit of information as some back data that are more focused on the economy at large. The reason I think specifically it could crash today has to do with GameStop but, if that whole theory is wrong or the government really is involved trying to land the plane, then who knows when it'll happen. I'm more than happy to be wrong on this!   \nBut here are my red flags to the economy at large - because of these red flags, if there is a big squeeze on gamestop, I think that's the knife edge that will start the margin calls because we're so leveraged. So, in no particular order, just as they come to mind, here's why I'm de-risking and hedging our long term investments. \n\nMichael Burry,  the \"big short\" investor who called and shorted 2008 is [predicting that the market will crash](https://markets.businessinsider.com/news/stocks/big-short-michael-burry-warns-stock-market-huge-risk-crashing-2021-2-1030106969?utm_source=markets&utm_medium=ingest) again. [He was then visited by the SEC and he deleted Twitter](https://markets.businessinsider.com/currencies/news/big-short-investor-michael-burry-stop-tweets-sec-regulators-visit-2021-3-1030222890). He was one of the [initial people to start the gamestop theory](https://markets.businessinsider.com/news/stocks/big-short-investor-michael-burry-scion-gamestop-stock-price-frenzy-2021-2-1030050393) in 2019. The line that sticks out to me from his twitter warnings is \"people said I didn't warn last time. I did, but no one listened. So I warn this time. And still, no one listens. But I will have proof I warned.\" (last quote in first article)\n\nWarren Buffet [sold off $6 Billion of his bank stocks](https://ca.finance.yahoo.com/news/billionaire-diaries-warren-buffett-selling-203028879.html). He then [warned his investors](https://www.theceomagazine.com/business/finance/berkshire-hathaway-warren-buffett/) in March in his shareholders letter saying \"fixed income investors worldwide - weather pension funds, insurance companies, or retirees - face a bleak future\". He's been [transitioning his portfolio](https://ca.finance.yahoo.com/news/billionaire-diaries-warren-buffett-recession-180037782.html) to prepare for recession. The Buffett Indicator, which is the US stock market cap against US GDP, i[s at an all time high of 123%](https://ca.finance.yahoo.com/news/warren-buffett-indicator-hits-ominous-163026181.html). When it crosses 100% the belief is we're in a recession. \n\n[Bank Bond Sale ](https://www.fa-mag.com/news/morgan-stanley-joins-bank-bond-bonanza-with-three-part-sale-61557.html)\\- Largest ever in history. 6 of the 7 major banks in the span of 5-10 business days. Wells Fargo, who didn't, [sold their asset management arm](https://www.cnbc.com/2021/02/23/wells-fargo-sells-asset-management-arm-to-private-equity-firms-for-2point1-billion-.html) to a private equity for $2.1 billion. \n\nAll big [bank CEO's were called to a congressional hearing in May](https://thehill.com/policy/finance/548490-big-bank-ceos-to-testify-before-congress-in-may) \\- this isn't normal. and it's reportedly due to lending practices of banks. \n\n[Insiders are selling their stock at the highest rate since 2006](https://www.barrons.com/articles/company-insiders-are-selling-stocks-others-are-buying-what-that-means-for-the-market-51618860196). Just to call it out - there's some reason for this trend. due to taxes this time of year it's always higher, but this is higher against the norm. \n\nThe graph I sent about 340% margin percentage is difficult to find but it was found by [Yardeni Research](https://www.yardeni.com/). Here's [who Dr. Yardeni is ](https://www.yardeni.com/pub/ey_bio_2.pdf)so you can independently validate if you trust his firm. \n\nBlackrock Chief Investment Officer [warns of too much liquidity](https://www.cnbc.com/video/2021/01/19/rates-could-go-up-quite-a-bit-more-equity-strategist-mike-wilson.html) in the markets. They also have t[he most cash on hand in years. ](https://www.bloomberg.com/news/videos/2021-03-29/blackrock-s-rieder-running-highest-level-of-cash-in-years-video) Now, this part is just weird. the first link goes to the CIO's CNBC interview. If you watch it to the end, it's cut short. [On the live program he actually said one more thing ](https://www.youtube.com/watch?v=MeKMOrn7nEk)but CNBC edited it. I guess that's their prerogative, but it seems like the CIO of the worlds largest investment firm saying \"with so much liquidity in the market today, there is literally no value in the market today\" would be a pretty important opinion to share with your viewers! Also, Blackrock is the largest fund who is long on Gamestop as an FYI. \n\n[This piece came out yesterday on Bloomberg ](https://www.bloomberg.com/opinion/articles/2021-04-21/dogecoin-symbolizes-the-conundrum-facing-investors)and I think it does a good job addressing the speculation bubble. \n\nHere's an interesting article that looks at the [technical analysis of the market in previous bubbles.](https://northmantrader.com/2021/04/21/has-the-bubble-already-popped/) He thinks it might have already popped. Sven Henrich is an independent reporter  and a guest on a lot of the financial TV programs you're familiar with. [Here's his bio.](https://northmantrader.com/about-us/) I would say he doesn't have the credence of a Burry or Buffet but it's good analysis none the less. As a whole, he very much feels we're in a bubble and close, but nothing he does is really GameStop related. \n\nNow, GameStop is a whole other connundrum that I wanted to separate from my general uncertainty in the economy. My fear is, if GameStop squeezes, it's going to cause margin calls. I do think GameStop will squeeze again, though it's impossible to say when. But, because of that, it makes me believe that it will be the trigger to the knifes edge we're on. \n\nLastly - I was looking into Archaegos last night and wondering how they could get margin called in an economy that only goes up. I looked at their [top 8 holdings](https://markets.businessinsider.com/news/stocks/archegos-capital-margin-call-20-billion-liquidation-8-stocks-plummeted-2021-3-1030254795) and they were all either at their peak or very close to it. all were up significantly in the previous 12 months and some like Viacom and Discovery were on absolute bull runs of being up $75+ a share in 4/5 months. I'll be honest, I just expected them to be holding some stocks that had significant corrections, but they didn't. Their long positions were printing money. \n\nSo how do they go under? It has to be short positions. And we know they don't have to report those short positions because of swaps. The fed chair, Jerome Powell's recent interview on 60 minutes about Archaegos is interesting but [this bit in particular](https://www.cbsnews.com/news/federal-reserve-jerome-powell-60-minutes-2021-04-11/). Does his response to \"is Archaegos the last one like this we'll see?\" give you much confidence?\n\nRealistically, there's only one stock in the market that could have a short position SO underwater that it negates the incredible gains of their long positions and that's Gamestop. So, after I independently looked at all their stocks, I looked at Gamestop the day Archaegos was margin called.  On the day they were margin called and selling their long positions [GameStop dropped from 180 to 120](https://www.google.com/search?q=gamestop+stock&rlz=1C5CHFA_enUS949&oq=Gamestop+&aqs=chrome.0.69i59l3j69i57j69i60l3j69i61.1239j0j9&sourceid=chrome&ie=UTF-8) (check 3/23 - 3/25) and the next day it immediately went up to 180 again. As someone who watches gamestop closely everyday, and as you can see by the 6 month view, the last 2 months or so it's traded pretty steadily, all be it trending down, for a long while now with significantly lower volumes. That day was an anomoly and crazy to be a part of. \n\nI say that, to say this - [There was a drop on March 12 from 348 to 200 ](https://www.cnbc.com/2021/03/10/gamestop-surges-40percent-then-wipes-out-gain-completely-and-is-halted-again.html)that was like nothing I've ever seen before or ever heard of in the stock market. It was a flash crash, in an instant it was down 80 dollar and then a long line of scared retail sellers took it down further in minutes. Everyone in Reddit was livid and assuming it was hedge funds manipulating the stocks, that that $350 number must be the magic number for the margin call (you don't block sell exiting a position because it tanks the price, you do it slowly to get all your shares at high as price as possible)\n\nIt's part of the Gamestop idea, get the stock high enough that it pops the first Hedge Fund so they are forced to cover and then the number drives up so the next one goes and then it's a feeding frenzy to cover your positions before everyone goes bankrupt. as a Hedge Fund, having someone get margin called on GME can't happen, that'd be it. In the January squeeze magically all the most popular trading apps stopped allowing you to buy, we thought it was another thing like that. \n\nMaybe this idea is a bit tinfoil hat, maybe it really is just hedge fund manipulation through shorting, but to tie it all together here's what I think. The government has been watching this like a hawk since the initial squeeze. Maybe they didn't know everything, but they knew more then any of us. I think that March 12 run up popped Archeagos and I think that flash crash was a government fail safe. They weren't ready to let everyone go bankrupt, they needed firewalls in place. If 345 pops your bubble but then it shoots down to 220 you'd be fine again and technically not in a margin call. That moment made the banks aware of just how leveraged Archaegos was and over the next few business days they started the unwinding. They might not be margin called anymore by a computer but banks wanted their money back. \n\nFast forward a few business days and as controlled of a margin call as can be, happens. Remember, GameStop randomly drops out of nowhere at the same time, so if Archaegos were short GME they can magically cover at $120 on the day they get margin called, maybe enough shares to let credit suisse escape without going under themselves. If Credit Suisse was leveraged out for 20 billion and didn't even know it... well, how are their losses from that only 4 billion? What changed in the moments of \"surprise, you're 20 billion dollars leveraged\" to we're only taking a $4 billion loss? It all just seems odd and it makes me think the SEC/Fed has been involved for a while now and doing what they can to mitigate this thing when it happens. \n\nSo, I hope that sounds logical enough. All the concerns I have with the economy outside of Gamestop and then you have this massive time bomb. Clearly all these new SEC and DTC laws and regulations I sent yesterday are aimed at mitigating what we theorize Gamestop could be. It doesn't mean that it is, but these rules are being put in place because if something like Gamestop did happen, we're too leveraged as an economy to withstand it. \n\nHappy to answer any questions if you have them - I think I'm mostly sending this to you both trying to show my work because I care deeply about you both and worry that I'm coming off as a tin foil hat conspiracy theory person as opposed to someone who's been following something that's become very strange and it has me concerned. ",
    "title": "When GME moons I'm very concerned about a greater economic crash so I sent this to my parents",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/mw8k5b/when_gme_moons_im_very_concerned_about_a_greater/"
}