{
    "author": "puppetjustice",
    "created_utc": 1617762510.0,
    "distinguished": null,
    "edited": false,
    "id": "mls5p1",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_mls5p1",
    "num_comments": 70,
    "permalink": "/r/GME/comments/mls5p1/new_fud_wave_how_we_all_hodl_for_the_highest/",
    "score": 530,
    "selftext": "Hello, my Diamond Handed fellow apes. If you have been here forever or just joined I love you just the same. \n\nEdit: this is not a traditional number crunching DD. This is psyc based and communication to solve issues with FUD. If you don't need to know. Enjoy your day nothing to see here. But it is still worth a read. I done did work. \n\nTLDR; FUD is everywhere. They are making a concerted effort to engage in open conversation and convince you the expectations are too high telling you the price floor should be low and not $10m at least. Your best weapons are patience, education, and trust in your fellow Apes. Apes strong together = getting all the mother fucking tendies in the tendiverse. But you should seriously read it though because it is worth a read and might add a wrinkle. \n\nWelcome to the Apeship Stonks on our maiden voyage to explore the tendiverse.\n\nWhile we fuel up and do all the pre flight checks, I would like to draw your attention to the inflight screens as we watch the latest round of comical FUD from the Shill empire.\n\nI am sure you will have seen shills spreading low price points around, or even some confused apes with genuine questions about how it can get to $10mi+. So, sit back and relax with this pre flight video about our trip to the tendiverse and how you can get that dream floor price.\n\n(This is not financial advice; I am clearly drunk on melted crayons. You do you.)\n\nWelcome aboard the great Apeship Stonks fellow Ape traveler. I am your in-flight Ape Puppetjustice. I will be talking to you briefly about the FUD you will see out the window on our Maiden voyage into uncharted tendiverse territory. It is exciting, but we do have to go over a few items for the trip. Please keep your arms inside at all times and don’t feed the shills. \n\nThis is a Once in a lifetime trip for the great Apeship Stonks. The Ape council has placed us all on the highest alert against attacks from the Empire of Shill. These loathsome jealous pitiful little creatures’ prey on the weak and fearful. Spreading FUD where every they can. Sometimes they can even look like fellow Apes. Trying to act and sound like fellow Apes. Trying to take advantage of Apes trust in fellow Apes. So, we here at Apeship Enterpises would like to teach you, Ape traveler, how to defend against any evil Shill and their weapons of mass FUDing.\n\nThe cowardly Shills are so good at hiding some Apes can get confused with a member of the evil Shill empire just for asking questions. This sadly happens from time to time but remember, Ape no fight Ape. Most members of the Shill empire don’t know what one of these is ? \n\nThey will simply spread FUD around like a baby Ape spreads poop in their diaper. They aren’t interested in whatever this is ? they just want to tell you why your wrong. Fellow Apes want to learn and want to understand. Help people understand. If they avoid this ? then they are probably a undercover member of the Shill empire. Remain calm and advise your other nearby Apes of the Shill. They will be asked to leave via the nearest airlock.\n\nWith that out of the way….\n\nIf you are here, then you earned your place through hard work and dedication. You have diamond hands and diamond nerves. I respect the hell out of you, and I am proud to stand with you as a fellow Ape.\n\nI would like to take this time to remind you to read the amazing Ape DD provided to this community by some truly wrinkly brained Apes. These DDs are expert level within their various fields. Businesses would normally pay huge bucks for DD that accurate, and these generous Apes just handed it out. Why? That’s right! because Ape together strong.\n\nThese are also the first steps to defending the against the evil forces of Shill and their FUD weapons so we can reach the furthest parts of the tendiverse. By understanding the DD and trusting your fellow Apes to be there with you, the Shill cowards won’t find a weak member to prey upon. But remember questions are fine, we all want to learn. ? Is your friend. Just random shouting is not.\n\nFor our fellow Apes, we got you, relax the hard part is over. You bought your ticket. You are on the rocket ship. now hodl and read the DD you haven’t. \n\nWe can wait there is no rush. We are patient and happy to learn. \n\n(Awesome intermission Jazz hold music with a funky looking Ape in a suit.)\n\nYou’re back? Welcome back. I see some of you just checked to see if there was any new DD, because you read all the rest. Good work everyone.\n\nYou just completed another step in your FUD defence training without even realizing. It doesn’t matter how far they kick the can down the road, we just have to be patient and hodl. Patience is just a virtue, it is a winning strategy right here right now. We win by simply being hodl. Be at one with yourself. Be happy and free from worry and doubt.\n\nBut what did understand from the DDs you patiently read?\n\nWe understand they have borrowed shares to short the stock of a company they thought would fail.\n\nWe understand they thought they could drive the company bankrupt and never had to pay back the borrowed shares.\n\nWe understand they got greedy and created fraudulent shares to make even more money.\n\nWe understand that they now owe more shares than exist several times over.\n\nWe understand they are spending millions a day to pretend that this isn’t happening.\n\nBecause.....\n\nMost importantly my fellow Apes, we understand that all shorts must cover.\n\nBut the Shill empire is vast and cunning and if one weapon won’t work they will try another FUD. \n\n\"The price won’t get that high. You are setting other apes up to fail and lose everything. You Apes are evil. Get out now or their financial blood is on your Ape hands.\"\n\nThis is upsetting for Apes. The thought of hurting other Apes is one of the last things we would want. We don’t want that for our trusted fellow family member. Ape together strong. Ape no fight Ape after all.\n\nSo, is the FUD attack real? No like all weapons of the Shill empire they are just smoke and mirrors.\n\nLet us take one of the many examples of single digit Apes from countries or financial situations that are dire. Surely, we wouldn’t endanger this precious member of the Ape community? Would We?\n\nOf course not. \n\nLet’s look at the worst-case scenario single digit ape holds through all the ups and downs. Diamond hands through the 100k Asteroid fields of the inner solar system. Diamond hands past the 250k gravity well of the gas giants. Diamon hands past the inky blackness of the 500k inter galaxy void. Is just about to make it to the next Galaxay, the $1 million cluster of the tendiverse. Further than any space Ape has Aped before. But tragedy strikes. Just before we arrive, sadly the Ape in dire straights in hurt and falls into a mysterious coma. She misses the entire trip. OOOH no!\n\nIn a horrible accidental coma, she misses every chance to get unthinkable amounts of bananas as we cruise the farthest reaches of the tendiverse. Only to arrive back on earth missing the whole thing. Waking up at the end of the wild ride.\n\nLuckily the great Apeship Stonks tickets are still worth money, even after the trip has finished. \n\nGamestop will not go bust. The target price is way above where we are now. Even when the MOASS happens everyone is buying back in because we like the god damn stonk. \n\nSo, fear not fellow Apes our single share coma patient Apes will be just fine even if they missed the whole thing. They will still have their golden ticket for the next ride or to cash in if they need it. \n\nSo how far can the great Apeship Stonks go?\n\nWell, that is up to us fellow Apes. This is why there is so much FUD from the Shill empire and their evil overlords.\n\nThey must buy the stonks we Apes hold. The DD is clear, the numbers are clear. The wrinkliest of Ape scientists reviewed and check the figures. There are so many fraudulent shares out there they have to do it several times over as well. \n\nBut what if the hedge funds get a couple of shares and just trade them back and forth.\n\nWell, that’s not how it works. \n\nRemember earlier how we talked about they borrowed a share. Those shares were fake. When a company is large enough and has enough bananas in the tree, they are trusted that even if something weird happens they can still afford to pay however many bananas needed for the share they leant out. So, they are trusted to lend shares that aren’t real, on the trust that they will spend the bananas needed to go get a real one when it is due if they have too.\n\nThese are still owed. \n\nThey don’t want to buy the Apes shares. Apes are all asking for $10 million bananas a share. That is ridiculous. \n\nThe owners of the company aren’t selling. Without these shares they can’t maintain control of the company.\n\nThe huge King Kong Apes and space whales aren’t selling either. Why wouldn’t anyone sell something priceless for pennies? \n\nIf the short sellers can’t produce the shares their assets get liquidated, and the clearing houses go to the market and buy what ever they can at the price is there.\n\nNow on a normal trip into the tendiverse no Ape has ever had the chance to steer the ship. Apes have always been passangers having to jump off at the stops along the way.\n\nBut this is our ship. We own the ship; we decide where it stops. We have formed the single greatest democratized investment in the history of the world.\n\nStop and think for a second Ape, how truly amazing you are. To be part of a world shaping event. Not by luck, not because you didn’t know. You did this for yourself, for your family, your friends and your community. Don’t let any Shill ever try to convince you, you didn’t deserve to be here with all of us. \n\nThe old ways don’t work. Apes together have weathered 3 months of constant attacks from the evil overlords of the Shill empire and their weapons of mass FUD. Here we are, still here strapped in and more diamond handed than ever.\n\nThis spaceflight is a giant game of chicken. How far can you fly into the tendiverse before pulling the rip cord. \n\nIf everyone holds on, the price goes up. Remember, all shorts must cover. If everyone holds for the center of the $10 million tendiverse. Well buckle up buckaroo we are setting course and on our way.\n\nNormally we wouldn’t know when the other Apes were getting off, so we would make our plans to keep ourselves safe. This is different. We are all in this together. We all win together. All we have to do is Hodl\n\nJust Hodl and get off at the end. \n\nAs I said at the start. I respect the fuck out of you just for being here with your ticket in hand. That takes serious diamond hands. \n\nIf you want to get off early. That is on you. You lose nothing by sitting on the ship and seeing how far the ride takes you. You brought your ticket already. You have done your part. Sit back and enjoy the ride. \n\nBut what if I missed the peak? Was that the peak? Was that the furthest we go?\n\nLook to your left, look to your right, are Apes still there? Course we are. Never before have people been able to check that their fellow Ape passengers were not only on the flight but jacked to the fucking tits about it. \n\nAs we discussed the great Apeship Stonks has to come back stops at and any point on the way back down. The cruise around the Tendiverse will take days, weeks even. You will not miss the view just because you were distracted ordering from the inflight drinks and crayon cart.\n\nAs with the worst case scenario, even if you did (like our tradgic one stock Ape) fall into a coma and miss the return flight, you ticket is still valid for travel to the island of $GME profits. \n\nWe own this ship. We set the destination. Even if we miss the uncharted outer limits, we will still be cruising the stars.\n\nSo, with this in mind, do you still worry about the Shill empire and their FUD weapons.\n\n“Careful Apes, you might only get 9 million bananas for your friends and family. WooOOOooOoOoo, scary amounts of taxes to pay to make your country better and help your society. HooOOeOOOwOOWOeee. Beware your shattered dreams of only having 900,000 bananas. Fore shame on you and your ancestors for daring to rick it for a better life. Fore Shame.”\n\nApeship travel agencies would like to express our heartiest Fuck Offs to the Shill empire and their evil overlords and wish fellow Apes the greatest of adventures now and in the future. Wherever the Great Apeship Stonks take you, fly with pride you beautiful diamond handed beast. \n\nSuck my hairy Ape nuts KG and your other hedgie short scumbags.\n\nAdd up all your stuff, divide it by the number of apes on board, hand it over and then Fuck Off.\n\nThanks and enjoy your flight.",
    "title": "NEW FUD WAVE. How we all Hodl for the highest price DD. Please read and spread with fellow Apes. Shills using new tactics to reduce floor limit. I welcome the shill down votes [cross post from superstonks]",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/mls5p1/new_fud_wave_how_we_all_hodl_for_the_highest/"
}