{
    "author": "thinkmoreharder",
    "created_utc": 1626010042.0,
    "distinguished": null,
    "edited": 1626024408.0,
    "id": "oi4fy8",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oi4fy8",
    "num_comments": 62,
    "permalink": "/r/Superstonk/comments/oi4fy8/dont_put_life_on_hold/",
    "score": 756,
    "selftext": "Don’t put your life on hold waiting for the MOASS. Even when your investment returns millions, you must do SOMETHING all day, every day, for the rest of your long life. Start to think abut the person you want to be post-MOASS. I don’t mean do you want to be kind, philanthropic, adventurous etc. i mean, will you be interesting to talk with. \n\nOnce you have money, you will have more entertainment options (lots of vacations around the world, drinking mai tais on various beaches or climbing the great pyramid (yes, rich people are allowed). And if you are old, with a bad hip and only a few years left, rest all you want, my friend. \nBeware, rich people run the risk of becoming very lazy. And that makes them boring. \nAfter you have done all of the “I’m rich” vacationing and you have 20/30/40 years of life left Do Something!\n\n“I’m gonna run a charity like Bill Gates.”  Great, but he ran a business from inception to world domination. He collects art and probably has a dozen topics that he can discuss in depth. Jimmy Carter still swinging a hammer (nail gun) for Habitat. I bet either of them would make a really interesting conversation. \n\nPlan to occasionally get up off your game playing chair and go learn something or physically build something. \n\nFinally, you dont have to wait for money to begin this change in YOU. I dont mean emotionally or metaphysically. \nDo you have a shitty job, but like to work with your hands, tomorrow, ask someone how to become an electrician. Prefer to sit quietly, learn to be a programmer. You have options now. When you have money, you will have more options. \n\nPrepare to be your future self. By the time you get the tendies, you will already be on the way to the, even slightly, better you. \n\nDont become rich and boring. Become rich and awesome.\n\nEDIT: “Even if your investment returns millions…” corrected to “Even when …”. Thanks for pointing that out.",
    "title": "Don’t put Life on Hold",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/oi4fy8/dont_put_life_on_hold/"
}