{
    "author": "Threesus25",
    "created_utc": 1628191737.0,
    "distinguished": null,
    "edited": 1628202100.0,
    "id": "oyptop",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_oyptop",
    "num_comments": 56,
    "permalink": "/r/DDintoGME/comments/oyptop/descending_wedge_breakout_or_fakeout/",
    "score": 554,
    "selftext": "It looks like we've followed the last pennant and now this descending wedge pretty faithfully. Just wanted to share a progress update as we near the end of the wedge. Depending on what scale you look at (regular or log) the end should be around Aug 12th or Aug 26th (both scales work for the first pennant pattern). It looked like we were breaking out today but we're falling back into the wedge boundaries now. I predict we'll keep following the wedge formation until the end - the 12th or 26th depending on scale. I would lean the 12th as it's also much closer to coinciding with the same length of time since the peak to breakout on the previous pennant.\n\nBut I also think the hedgies know this and specifically act around the TA to try to affect longs psychologically. I think they take us down the wedge until the end, and like last time they then drive the price further downward to try to force a breakdown to the low side. Hopefully, like last time, longs aren't having any of it and buy buy buy until we breakout up again!\n\nEither way, I'll be buying and holding 🦍\n\n[Regular Scale](https://imgur.com/09LMcPX)\n\n[Log Scale](https://imgur.com/ZcYlYjv)\n\nEDIT: typos on the dates (I had 6th/12th, meant 12th/26th)\n\nEDIT: pretty sure the downvote brigade is in full force on my post / just enough to keep it from getting any more traction. It keeps jumping back down after it gets a few more upvotes, looks like 75 is when marge starts to call 😂\n\nEDIT: either that ^ or you fuckers just really really like the number 69",
    "title": "Descending Wedge: Breakout or Fakeout?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/oyptop/descending_wedge_breakout_or_fakeout/"
}