{
    "author": "rensole",
    "created_utc": 1618909960.0,
    "distinguished": null,
    "edited": 1618917008.0,
    "id": "mumdnt",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_mumdnt",
    "num_comments": 4986,
    "permalink": "/r/Superstonk/comments/mumdnt/synopsis_for_04202021_what_we_need_to_know_before/",
    "score": 16591,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nDo you smell that? pass that!\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/fyovn831fau61.png?width=680&format=png&auto=webp&s=8553a0769e002c1296f071c3d82c800d627be4c9\n\nAs always none of this is financial advice, just a typewriter ape\n\n# Yolo with Domo\n\n[https://www.reddit.com/r/Superstonk/comments/mtnian/official\\_ama\\_justin\\_dopierala\\_founder\\_and/](https://www.reddit.com/r/Superstonk/comments/mtnian/official_ama_justin_dopierala_founder_and/)\n\ntoday at 4:20\n\n# DFV FUD\n\nOk let's start with the obvious one in the room, I've seen loads of people/new accounts say DFV sold.\n\nNo he didn't, why? he is a value investor, he sees deeper fucking value in a company, and it would be stupid to put this much in and pull out BEFORE the transformation of the company is over.\n\nSo the argument of him having pulled out is nonsensical.\n\nHe will at one day though because doing a stock market is to make money, but don't expect any value investor to stop halfway through.\n\nhttps://preview.redd.it/5kk3rbmifau61.jpg?width=960&format=pjpg&auto=webp&s=4cf73fc2a0b5c982c876d63b2bb74503aa6aee70\n\n# Twitcher offered a 1000 to lie, lied yo\n\nPeople were quick to jump on this but the dude who said he was offered a 1000 bucks to post bad shit about GME was lying, again be sceptical even if it feeds into your bias.\n\nthe post got removed, as the person himself confirmed later that it was fake.\n\n&#x200B;\n\nhttps://preview.redd.it/4kbktjbbgau61.png?width=640&format=png&auto=webp&s=7ef84f21d959c5958fa231405c0e792d7cba35c0\n\n# Team for the man with a plan\n\n[https://www.sec.gov/news/press-release/2021-68](https://www.sec.gov/news/press-release/2021-68)\n\nGary named his initial team, give it a read and know who you'll be working with.\n\nAgain yes I know the SEC had been lacks to say the least, but again I believe that this guy can bring big changes.\n\nAlso a brief overview of the recent filings.\n\n[https://www.reddit.com/r/Superstonk/comments/msh5mt/a\\_brief\\_overview\\_of\\_recent\\_filings\\_from\\_the\\_dtc/gv61tmd/?context=3](https://www.reddit.com/r/Superstonk/comments/msh5mt/a_brief_overview_of_recent_filings_from_the_dtc/gv61tmd/?context=3)\n\nhttps://preview.redd.it/mqdfevbqgau61.jpg?width=660&format=pjpg&auto=webp&s=ab21c159ab44463e5619d180050424f89c26daf8\n\n# MacD\n\ngood thread about MacD\n\n[https://www.reddit.com/r/Superstonk/comments/mu5m16/macd\\_on\\_gme\\_is\\_showing\\_bullish\\_signs/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/mu5m16/macd_on_gme_is_showing_bullish_signs/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\n[Not sure if the correlation is caustation](https://preview.redd.it/pkf3emfliau61.png?width=828&format=png&auto=webp&s=bf929a22cad13a01a95537f3c0dc3f79c9536117)\n\n# 60% of the time time it works a 100% of the time\n\n6 out of 7 of the biggest american banks have made a statement in the past week.\n\nGive it a decent read.\n\n[https://www.reddit.com/r/Superstonk/comments/mu8a5m/6\\_out\\_of\\_the\\_7\\_top\\_listed\\_us\\_banks\\_have\\_made/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/mu8a5m/6_out_of_the_7_top_listed_us_banks_have_made/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nhmmm [https://www.reddit.com/r/Superstonk/comments/mty87p/domino\\_effect\\_drumroll\\_whos\\_next/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/mty87p/domino_effect_drumroll_whos_next/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) ??\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/1szuo8pciau61.png?width=380&format=png&auto=webp&s=b73f21d1d0237d18640fe4c5909596714ede6ffb\n\n# They're watching\n\n[https://www.reddit.com/r/GME/comments/mu6a4n/psa\\_remember\\_hfs\\_are\\_watching\\_us\\_dont\\_give\\_them/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/GME/comments/mu6a4n/psa_remember_hfs_are_watching_us_dont_give_them/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nSo as that thread stipulates they are watching us, I mean I would if I were them. look at all the free data we offer them\n\nbut we are doing the same\n\n[https://www.reddit.com/r/Superstonk/comments/mug1th/citadels\\_late\\_night\\_google\\_searches/gv6d1x4/?context=3](https://www.reddit.com/r/Superstonk/comments/mug1th/citadels_late_night_google_searches/gv6d1x4/?context=3)\n\nAgain not sure how accurate those google results are but interesting none the less.\n\n&#x200B;\n\nCan't stop won't stop\n\n[https://www.reddit.com/r/Superstonk/comments/mu6y3m/𝗚𝗮𝗺𝗲𝗦𝘁𝗼𝗽\\_𝗘𝘅𝗲𝗰𝘂𝘁𝗶𝘃𝗲\\_𝗧𝗲𝗮𝗺\\_𝗕𝗼𝗮𝗿𝗱\\_𝗼𝗳\\_𝗗𝗶𝗿𝗲𝗰𝘁𝗼𝗿𝘀\\_𝗨𝗣𝗗𝗔𝗧𝗘𝗦/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/mu6y3m/𝗚𝗮𝗺𝗲𝗦𝘁𝗼𝗽_𝗘𝘅𝗲𝗰𝘂𝘁𝗶𝘃𝗲_𝗧𝗲𝗮𝗺_𝗕𝗼𝗮𝗿𝗱_𝗼𝗳_𝗗𝗶𝗿𝗲𝗰𝘁𝗼𝗿𝘀_𝗨𝗣𝗗𝗔𝗧𝗘𝗦/?utm_source=share&utm_medium=web2x&context=3)\n\nNEW GAMESTOP\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/g69yaf7klau61.png?width=256&format=png&auto=webp&s=02221009c8b259515a07195b05ed338aa95a76e6\n\nSo at this point you might think \"ok Rennie, it's missing it's OOMPH today\", and you're right I've been focussing on something else, yesterday I got pulled aside by some friends and how r/superstonk is looking right now and I had to take a good hard look at the sub and the mentality we hold.\n\nAnd I personally didn't like some of the stuff I've seen, people who are trying to help are getting called shill because they come with lower numbers, people who want to help and immediately getting kicked to the side as shill, this is not what I want guys.\n\nAgain we need to keep our head straight and look at every possible scenario.\n\n**None of this is financial advice, but I do feel people should examine their risk/rewards.**\n\nI know many of us will jerk react to what I am about to say and think it is FUD, but I feel it is something we need to explore as the MOASS is impending. There are several things that you need to know when it comes to extremely high market volatility. Selling isn't as easy as pressing \"sell at market\" and expecting the number you \"sold at\" to appear in your brokerage account. When trading in extremely volatile conditions, like the upcoming squeeze, it's important to know exactly HOW to exit your position and not fall victim to these traps.\n\n**I know that the DD on this sub is good but in trading nothing is a 100% guaranteed**\n\nThis is not meant as FUD in any way, but rather to get everyone to think about their own positions and what they want to do, and how they want to do it. also if possible to get people talking and have different conversations so people make an educated estimation/decision of what they want and how they want it.\n\n**This is a personal choice for everyone, so listen to your own logic, reasoning and research.**\n\nI've seen a lot of people talk of 100 million is a \"sure thing\", I'm sorry I know you all like this but I want everybody to be grounded for this.\n\nThe statistical probability this will even reach 1 million is an anomaly, I'm not saying it won't happen I'm saying in my personal opinion I don't expect to reach that level. Yes I know the memes of 1 million and everything, but let's be honest there is a high likelihood that before that happens the government would step in, the nasdaq would stop trading or something else can happen.\n\nWe do not know how far it will go.\n\nAnd just as much the [gmefloor.com](https://gmefloor.com/) thing, please realise it's a meme.\n\nThe thing is with a short squeeze it is impossible to know how high it can, or will go to or how long it will last, I've seen people post it would be minutes, I've seen others post that it will be days. One thing I do have to say is that I rethought my own exit strategy, it used to be \"catching the falling knife\" but it has changed as I think it would be closer to catching a falling piano.\n\nso this leads me to my other point.\n\nEveryone here should evaluate **their own** Risk vs reward situation.\n\nAnd at the same time I'd ask you to be realistic, no one knows what will happen and anyone telling you that ANY price is a 100% is wrong. We can have all the specific indications for a Moass/squeeze but we don't know what will happen.\n\nSo in order for people to make a well educated decisions on their own stock they should ask themselves some questions.\n\n1. how much money do I want to make with this stock\n2. how high can it go?\n3. how much can I afford to lose? (for example if the stock goes back down at some point)\n\n\\^ these are important questions that people need to ask themselves and act on them.\n\nAn exit strategy for me is covering my initial cost of investing at a \"lower hanging fruit\" number, when it squeezes, as it's more likely I'll cover that point, from that point on I can let it ride to higher numbers and be sure I'm playing with the house's money. (this means lowering exposure and still have a possibility of reward).\n\n&#x200B;\n\n**Everyone should think on his own how he or she wants to exit.**\n\nThere is no perfect plan, unless you're DFV and you're the time traveler.\n\nBut let's look at a few different versions of exit strategies.\n\nhttps://preview.redd.it/nqyzxkxamau61.png?width=600&format=png&auto=webp&s=d25af6b3270d19faee5f0df3b85b26a310c92223\n\n**\"The Tiered exit\"**\n\nOne I've heard a lot about is a \"tiered exit\" a tiered exit is putting everything in tiersfor example:\n\n15@ 10\n\n10 @ 15\n\n20@ 20\n\netc etc, this depends fully on how you want to place this and what you think is a logical step, this could be at 5000, a 10000 or any number whatsoever. **(remember I'm giving examples, I'm not setting numbers for you to follow).**\n\nAnother exit strategy is\n\nhttps://preview.redd.it/utw7mkazlau61.png?width=1600&format=png&auto=webp&s=e26c4adbe667c2dc006505bd33b2b48b9d1bf91c\n\n**\"The value investor\"**\n\nThis is what DFV did, he saw an opportunity with a company and invested on a number he thought the company would be low, but he will ride this to a certain set point for him and either cash out then, or do so in layers like in the tiered exit.\n\nThis means he said to himself X number is low, I want to have Y number for returns etc etc, this is also called the long play.\n\nor how he got his name, seeking deeper value in things and seeing them before others do.\n\nBut even DFV has a number set in his head where he want's to take profit.\n\n&#x200B;\n\nhttps://preview.redd.it/m43dw07umau61.png?width=1200&format=png&auto=webp&s=203f6be178ae92085ab49f0637408639f185276f\n\nAnother would be\n\n\"**the mixer\"**\n\nThe mixer is a simple concept of my own tbh, just take a bit from the **Tiered exit,** a bit off the **Value Investor**.\n\nYou can choose to get some of your initial investment out at a certain point, have another part you want to leave with that company, and a part you'll sell at a higher point.\n\nOr any mix you'd like, remember this is fully up to you and up to your own risk assessment.\n\nSome examples of other exit strategies:\n\n[https://www.netpicks.com/trading-exits-vital/](https://www.netpicks.com/trading-exits-vital/)\n\n[https://www.investopedia.com/articles/active-trading/020915/mustknow-simple-effective-exit-trading-strategies.asp](https://www.investopedia.com/articles/active-trading/020915/mustknow-simple-effective-exit-trading-strategies.asp)\n\n[https://www.ig.com/en/trading-strategies/trading-exit-strategies--a-complete-guide-for-traders-210208](https://www.ig.com/en/trading-strategies/trading-exit-strategies--a-complete-guide-for-traders-210208)\n\n[https://www.jumpstarttrading.com/trading-exit-strategies/](https://www.jumpstarttrading.com/trading-exit-strategies/)\n\nThere are loads of exit strategies out there, but be sure to research what is best for **YOU!** (seriously google is a thing people, use it, do your own DD and your own legwork).\n\nAgain I don't question the DD at all, I do however think people here need to take a good hard look at their risk/reward system and at reasonable numbers, I personally don't think 10m is something that can happen, again I could be a 100% wrong and if it does hell I'll be just as excited as everyone else, I just think the chance of happening is low to none.\n\nWhat I am saying is what I've said before, you should not risk more than you are comfortable with.\n\n&#x200B;\n\nhttps://preview.redd.it/cdkr5x32nau61.png?width=462&format=png&auto=webp&s=cd02d4b9b9033840c294dd16a73f3ee0bec89cf0\n\nNow something else I want to touch on.\n\nYou have to realise that yeah sure it's all fun and games checking out all those buildings and what's going on in them, but what if we have one idiot in here that's mentally unstable?what if they think it's ok to go there and he hurts someone or worse?\n\nSeriously everyone have a sense of decorum.\n\nDo not under any circumstances pester the personal that works there, as these are still people who just have a job, you may not agree with what they have done but that's what the courts are for.\n\nwe need to stay on our best behavior always, because we are better than they are. I want everyone to be logical and decent here, and everyone here does his or her own part in that.\n\nSo I'm asking you please, PLEASE guys chill, we are in what people can say is a \"high stress\" situation, and tempers can run high.\n\nDon't call people SHILL because you don't agree with them, I've said before go into conversation with them and you may be able to learn why they think a certain way.If it's logic then you can learn, if it's a troll you'll notice soon enough.But don't kneejerk react that everyone who disagrees is wrong.\n\n&#x200B;\n\nhttps://preview.redd.it/oxpvu1oooau61.png?width=554&format=png&auto=webp&s=ca6e9670df6055dbb33a60d9ada07412f85bd0d4\n\n# EXCELLENT!\n\nBe friendly, help others!\n\nas always we are here from all different walks of life and all different countries.\n\nThis doesn't matter as we are all apes in here, and apes are friends.\n\nDoesn't matter if you're a silverback a chimp or a bonobo.\n\nWe help each other, we care for each other.\n\n**Ape don't fight ape, apes help other apes**\n\nthis helps us weed out the shills really fast, as if everyone is helpful, the ones who aren't stand out.\n\nremember the fundamentals of this company are great, so for the love of god if someone starts with trying to spread FUD, remind yourself of the fundamentals.\n\nThere is no sense of urgency, this will come when it comes, be a week, be it a month be it six.\n\nWe don't care, just be nice and lets make this community as Excellent as we can!\n\nRemember one of the only ways to counter the Cointelpro we have seen is by being overly nice, so treat all the other apes as if you're dating and you wanna get to first base.\n\n&#x200B;\n\nhttps://preview.redd.it/lsyole5roau61.png?width=400&format=png&auto=webp&s=0f21c9bcfa23dfac3fc0b600741e9fdd2021973f\n\nRemember none of this is financial advice, I'm so retarded I'm not allowed to go to the zoo 'cause they'll put me in the cage with the rest of my ape brothers.\n\nIf anything happens throughout the day I will be adding it here.\n\nbackups:\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/HeyItsPixel1](https://twitter.com/HeyItsPixel1)\n\n[https://twitter.com/warden\\_elite](https://twitter.com/warden_elite)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\nAnd I'll be posting updates as they happen here:",
    "title": "Synopsis for 04-20-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/Superstonk/comments/mumdnt/synopsis_for_04202021_what_we_need_to_know_before/"
}