{
    "author": "TheSteveGraff",
    "created_utc": 1626104933.0,
    "distinguished": null,
    "edited": 1626140591.0,
    "id": "oitzxu",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oitzxu",
    "num_comments": 162,
    "permalink": "/r/Superstonk/comments/oitzxu/my_congressmans_office_just_called_me_back_re_an/",
    "score": 2852,
    "selftext": "\nI e-mailed re: abusive short selling and the SEC’s failure to enforce trading laws etc. The staffer told me there are no hearings scheduled at this time but that Taylor (Who is on the Financial services committee) is definitely interested in the subject. \nHe may contact me to discuss this. I’m going to pass along more information until that happens. Suggestions on stuff that would be relevant to a Congressman’s perspective on the issue? The staffer said she would be looking for more messages from me.\n\n**EDIT: USA apes: I will create a doc that we can crowdsource and use for all of our representatives in Congress.\n\nEdit 2: a draft of my letter:\n\nDear Representative Taylor,\n\nA member of your staff reached out to me this morning in response to an e-mail I sent previously. I appreciate the attention that you are giving to the subject of market manipulation. \nI know you are well aware of the January incident involving Vlad Tenev’s “Robinhood”, whereby retail traders were blocked from buying stock in a popular Texas company (GameStop) while it was undergoing a rapid run-up in price, and I thank you for investigating that matter last February. \nWhile the actions of Robinhood were indeed problematic, to say the least, I think it would be accurate to say that those actions were the symptom of a much larger problem that begins with the naked shorting of a company’s stock. \n\nNaked shorting is a predatory practice used to drive a vulnerable company into bankruptcy, so that the shorting parties can profit off of their demise. The Market Makers and Authorized Parties choosing to abuse this power are able to use ETFs to operationally short and bankrupt target companies for tax free returns. (https://www.youtube.com/watch?v=ncq35zrFCAg&amp;amp;amp;amp;amp;amp;amp;feature=youtu.be) There is a conflict of interest when a market maker is able to “create” shares for the purpose of shorting. This is a form of market manipulation and corrupts the price discovery function of a market.\n\nIf shorting ALL of the available shares of a company is profitable for a shorting party, shorting MORE than the available shares is even better. Shorting more than the available shares is of course impossible unless the shorting parties and brokers are abusing their privileges. Entities designated as market makers (MMs) / and authorized participants (APs) have been given special powers of creation and redemption on ETFs (https://www.youtube.com/watch?v=iX7fOx5G40A&amp;amp;amp;amp;amp;amp;amp;feature=youtu.be)  for “liquidity purposes”( https://www.sec.gov/rules/sro/nscc/2020/34-89088.pdf) which has led to a loophole allowing illicit parties to continue to create illegal naked short positions.\n\nThere is ample evidence that this practice has happened in the past, and is likely happening now with GameStop. GameStop has recently admitted that the company is cooperating with the SEC with some matter regarding their stock; I hypothesize that this may be the subject of that investigation.\n\nThe goal of a shorting party is to never buy back the shares that they have sold short. To this end, they engage in complex transactions (i.e. married puts and ITM calls) using the options market to “hide” those shares and to delay their repurchase. Additionally, by using strategic (also illegal) option strategies, they are able to hide these naked short positions. (https://www.sec.gov/news/press-release/2013-151)\n\nTexas attorney Wes Christian has been fighting to expose this form of “financial terrorism” for two decades, an estimated multi-trillion dollar problem.\n\nhttp://www.csj-law.com/attorneys/jchristian.html\nhttps://m.youtube.com/watch?v=2rJujnpKiqM  \nhttps://m.youtube.com/watch?v=q8-JO3g5bm4",
    "title": "My congressman’s office just called me back re: an e-mail I sent re: abusive short selling.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oitzxu/my_congressmans_office_just_called_me_back_re_an/"
}