{
    "author": "Leenixus",
    "created_utc": 1622680013.0,
    "distinguished": null,
    "edited": false,
    "id": "nr0jd5",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nr0jd5",
    "num_comments": 236,
    "permalink": "/r/Superstonk/comments/nr0jd5/sec_foia_reply_fee_waiver_was_declined_so_i_tried/",
    "score": 4500,
    "selftext": "https://preview.redd.it/7g18khg3zx271.png?width=1227&format=png&auto=webp&s=fbdd208906bbe8ef8ea604a497b88b8fe9491e3a\n\nhttps://preview.redd.it/d4h6bxs3zx271.png?width=1227&format=png&auto=webp&s=40fe2e8960a99c4f118d07a20b13711cafa6aa70\n\nhttps://preview.redd.it/kp8pi8vjzx271.png?width=1227&format=png&auto=webp&s=75181eb0258329530553c4dd1c4e609a4892cf2c\n\n&#x200B;\n\n**TLDR:** They agreed to give me 2 hours of research and a max of 100 pages of research on the subject of SR-DTC-2021 and declined to waive any fees beyond that. I filed an appeal not to appeal them denial to waive fees, but i appealed in order to change my FOIA's fee classification and offered to give them a bunch of money so that they'd do a better job at finding ANY information on SR-DTC-2021-005.\n\nBasically offered to throw a decent portion of this month's salary on this, but i think it's worth it. If i can do it, you can do it. Though they already accepted the request, 2 hours of research sounds abysmally small. This extra cash i offered should at least increase that to 10-15+ hours of research on SR-DTC-2021-005 or two full working days of research IF my appeal is accepted.\n\n&#x200B;\n\nNow you're not gonna like this part, and it will get me hated by many but i don't care so there. Hate away all you like. I doubt i'll get banned for this, but if i do, oh well, still hodling, still love GME. \n\nI have a few basic life principles and those are to be truthful and transparent even when non disclosure is the better thing to do, like in this case below. Chill this is a public forum and there's nothing weird going on, our mods are great and so are you. Remember... public forum... public... everyone can see it... ok? If you don't like my reply, tough luck. You should have made your own FOIA. If you don't like me mentioning superstonk, tough luck. \"I can't believe you wrote that, have my downvote\" /shrug.\n\nNow onto (you) getting mad as heck. Here's my appeal. Not gonna even hide it and keep this thread with 0 controversy, no, you get to see what shit i wrote and you get to be a keyboard warrior about it.\n\nGot out of bed at 2AM to and spent 2 hours writing everything and compiling all of this so i can get flamed, believe it.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n>Hi,  \n>  \n> Based on your determination that the fee waiver should not be applied to this request, i'd like to request a change of fee classification.  \n>  \n>As the fee waiver has been denied, i'd like to pay the amount of $1000 dollars US (up-front) in order to cover any additional hours of research that may be required beyond the initial 2 free hours and 100 free pages offered under 17 CFR 200.80(g)(3)(i)(ii)(iii)(iv)(v).  \n>  \n>Additionally, I'd like to express the willingness to pay additional fees in case it's required for additional research hours or duplication fees that however do not exceed $500 dollars US.  \n>  \n> As for the reasons behind requesting the information in regards to SR-DTC-2021-005, a portion of retail traders such as myself as well as another \\~350 000 on a single sub-reddit such as /r/SuperStonk have dedicated the past 4 months  on learning everything possible regarding the US Securities Markets from the ground up.  \n>  \n>  \n>  \n>4 months ago, said community did not know what an option contract was, today the community does quality DD (Due Diligence) papers every day on subjects directly related to the US equities market market mechanics, old SEC regulations and their pros and cons as well as an extremely big interest in the newly filed OCC, FICC, SEC, DTC regulations that were filed in the past 2 months as a response to the increasing risks in the US markets in general.  \n>  \n>During their and my own research into the various new regulations filed, passed and implemented, we noticed that a single regulation that was filed (SR-DTC-2021-005) was removed with no notice within 1 week of it's filing. The reddit community /r/SuperStonk of which i am part of has since then done it's own due diligence on the subject of SR-DTC-2021-005 in general as well as due diligence on the actual sudden disappearance of the regulation (SR-DTC-2021-005).   \n>  \n>Two of the more easily digestible threads in regards to the disappearance of SR-DTC-2021-005 as well as a mail of correspondence between a redditor and a SEC employee can be found here:  \n>  \n>[https://www.reddit.com/r/Superstonk/comments/mzkf8v/where\\_is\\_srdtc2021005/](https://www.reddit.com/r/Superstonk/comments/mzkf8v/where_is_srdtc2021005/)  \n>  \n>[https://www.reddit.com/r/Superstonk/comments/ncnz1l/where\\_in\\_the\\_world\\_is\\_srdtc2021005\\_we\\_were\\_told/](https://www.reddit.com/r/Superstonk/comments/ncnz1l/where_in_the_world_is_srdtc2021005_we_were_told/)  \n>  \n>  \n>  \n>I suggest that both threads/topics are at least skimmed through and the SEC employee - reddit correspondence be read so it may serve as context.  \n>  \n>  \n>  \n> It has been approximately 2 months since SR-DTC-2021-005 disappeared from the DTCC website. According to the correspondence between the SEC employee and the redditor posted above, the re-filing of SR-DTC-2021-005 should have been a matter of 1 week.  \n>  \n> Myself and the reddit community (As well as other communities such as /r/amcstock) who have been tracking all the new incoming SEC regulations extremely diligently are at this point in time concerned that the removal of this regulation with no notice at all whatsoever pre or post removal is a red flag and that it's something that needs to be looked into by the appropriate authority which in this case as it's understood is the SEC itself.  \n>  \n>Finally, as reddit and /r/SuperStonk are just a website and a community of retail investors from around the world, everyone is taking their own decisions on how to react on subjects related to the US Equities / Securities market. I myself am not a US citizen and do not live in the US or any US territories. I've taken the decision to contact the SEC in regards to this subject matter on my own volition as an EU citizen living in the EU and plan to make the results of this FOIA publicly available to all users on Reddit's sub-reddit named /r/SuperStonk.   \n>  \n>All personally identifiable information that falls under the EU's GDPR such as names, emails, phone numbers, addresses etc will be redacted before publishing.  \n>  \n>Thank you for your time.\n\n&#x200B;\n\nhttps://preview.redd.it/ohnm4upbyx271.png?width=1785&format=png&auto=webp&s=962f6bfcf8e0e77f0fe5fde203f3e1205e5a5fc6\n\nhttps://preview.redd.it/e0fbo9q72y271.jpg?width=1440&format=pjpg&auto=webp&s=0c3bf6d58ac8a22c4f1eba3d145102fd4abfef45",
    "title": "SEC FOIA reply. Fee waiver was declined so i tried doubling down.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nr0jd5/sec_foia_reply_fee_waiver_was_declined_so_i_tried/"
}