{
    "author": "Sh0w3n",
    "created_utc": 1622638749.0,
    "distinguished": null,
    "edited": 1622644813.0,
    "id": "nql7qe",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nql7qe",
    "num_comments": 343,
    "permalink": "/r/Superstonk/comments/nql7qe/vix_beta_borrowed_shares_premarket_movement_dips/",
    "score": 4670,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/b3i7n3a7ku271.jpg?width=1280&format=pjpg&auto=webp&s=ae38980b0a7c0526af6ea8228c456fba4cb69cd4\n\nListen Apes, we need to talk. I know we all love confirmation bias. We all love to predict the movement.\n\n**We are great at spotting out FUD, wrong information and debunking it. Yet these myths and wrong information have been accepted by the community for months. It encourages day-trading due to ''forecasting'' the stocks movement, hence being bad for us.**\n\nBut when I check the daily, every few comments mentions one of the above.\n\nI am going to go for a quick one here. No memes, no jokes.\n\nTell me: Do you recognize any of these?\n\n\\-----\n\n**''OMG THEY BORROWED 700 TRILLION SHARES, EXPECT A DIP''**\n\nProbably the number 1 comment on the daily. This metric is completely useless right now. Let's just assume that the numbers are correct - which I don't believe btw - please answer to me:\n\nHow do you know what happened when the number decreased? **Anyone?**\n\n**Does it mean they will use the shares to drop the price? NO!** They could have used the shares to satisfy a different short position, to satisfy FTD, to delta hedge a call or the numbers could have dropped simply because shares were removed from being available to borrow. You doubt all numbers, yet you believe these figures blindly.\n\nTo clarify: this is not 'covering' in terms of reducing the number of open short positions. It is kicking the can down the road. I am just pointing out that borrowed shares aren't necessarily being used to drop the price.\n\n\\----\n\n**''OMG VIX IS SPIKING - LET'S GOOO'' or ''WHY IS GME RED BUT VIX IS SPIKING?''**\n\nOne of the most favorite comments on r/Superstonk. [Vix is a volatility index that tracks the option activity and is designed to reflect the volatility of the U.S. stock market in the next 30 days:](https://www.cboe.com/tradable_products/vix/)\n\n>*The VIX Index is a calculation designed to produce a measure of constant, 30-day expected volatility of the U.S. stock market, derived from real-time, mid-quote prices of S&P 500® Index (SPX℠) call and put options. On a global basis, it is one of the most recognized measures of volatility -- widely reported by financial media and closely followed by a variety of market participants as a daily market indicator.*\n\nIt is not connected to GME. Nor does it imply that GME does anything.\n\n\\--- this leads me to:\n\n**''MARKET RED, NEGATIVE BETA SO GME BRRRRRR''**\n\nThis one gives me a headache. **Correlation does not** imply causation. Just because GME has been performing quite the opposite to the market, does not mean it will do so in the future. And most of the time GME had a correlation to the overall market in the past few weeks.\n\n\\---\n\n**''WE ARE DOWN 2% IN PREMARKET ON LOW VOLUME, BLATANT MANIPULATION!''**\n\nJust no. Premarket has low volume, hence the price moves in one or the other direction quickly due to the lack of liquidity. A wider spread implies movement. Not every movement downwards is manipulation, yet every movement upwards is normal behavior. Stocks move both ways, especially in pre market.\n\n\\---\n\n**''Short Volume = New short positions''**\n\nSame explanation as shares borrowed. It does not mean new short positions have been opened.\n\n\\---\n\n**EDIT: ''SSR IS ON, LET'S GO''**\n\nSSR doesn't mean jack shit for us. You can still short the stock, just limited to shorting on an uptick. Seriously, this doesn't change anything.\n\n\\----\n\n**Just buy, hold and vote and educate yourself.**\n\n🚀💎",
    "title": "✋🏽🛑 VIX, Beta, Borrowed Shares, Pre-Market Movement, Dips, Short Volume - SIT DOWN & LISTEN, this has to STOP. ✋🏽🛑",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/nql7qe/vix_beta_borrowed_shares_premarket_movement_dips/"
}