{
    "author": "fsocietyfwallstreet",
    "created_utc": 1623179433.0,
    "distinguished": null,
    "edited": 1623187410.0,
    "id": "nvbsip",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nvbsip",
    "num_comments": 852,
    "permalink": "/r/Superstonk/comments/nvbsip/theory_hedgies_have_not_defaulted_and_seen_their/",
    "score": 6651,
    "selftext": "#Background & reason for post:\n\nI see a lot of comments today about how the moass could begin- which seem to look past critical points we’ve learned from the DD and what our subject matter experts have shared with us from their publications & AMA’s.  These theories mean well, and prepare the masses for what might be expected - where there could be large gaps of time between the rocket stages firing due to delays as insolvency cascades down, starting with the hedgefunds.  But i’m not sure that’s how this is going to go down, because that theory conflicts with other facts we now know, and if it were true - it should have happened months ago.\n\n\n#Here are the key observations I’m drawing from:\n\n-Prime brokerages, who have largely remained nameless due to the terms of the settlement, were involved in all of Wes’s settled lawsuits involving naked short selling.  \n\n-As evidenced in the overstock case - prime brokerages, such as goldman sachs, were the mechanism which allowed hedgefunds to naked short.  There is a littany of finra and sec history of prime brokerages improperly marking transactions with shorted shares as ‘long’\n\n-“We will let you fail” is a quote from one of the emails found during discovery in the overstock case that is inked onto my so, so smooth brain.  Prime brokerages make tons of money ‘lending’ these stocks.  They haven’t had any need to actually locate stocks to lend for decades, the penalties are a joke and there’s no jail time.  \n\n-The dtcc’s myriad of new rule changes don’t have a single thing to do with hedgefunds.  They’re for members, such as prime brokerages, clearing houses and market makers.  Hedgefunds are their customers, they’re nobody to them but a means of making money by brokering & clearing their trades, and lending them stock.  \n\n-Melvin capital was reported as being bailed out with 2.75b on 1/25.  Assuming they didnt close those short positions, if they looked bad enough to need that bailout when gme closed at $76 on 1/25- imagine how bad it looked on 1/28 when it almost bounced off $500.  Reality is, they probably should been defaulted then and there.  Or on 3/10 when we almost bounced off 350.  Or today when the same thing happened.  But they didn’t.  I believe that’s because the prime brokers who let them get into this big a mess - helped them make it bigger by increasing their short position.  This allows the hedgies to ‘average down’, at the expense of higher risk, and pocket the money for these ill-gotten shares at even higher prices, which they will undoubtedly fail-to-deliver.\n\n-When a hedgie blows up their account - the broker can proceed unwinding the account as they see fit, so long as the brokerage itself remains solvent after inheriting the account’s failed short position.  Unless the brokerage itself gets the rug pull by a dtcc subsidiary - the brokerage can attempt to unwind the position slowly, just like what happened with archegos.  To this day, months later - it is unclear whether that is fully unwound- just how they like it.  Keep us in the dark.  \n\nSo why haven’t these guys been margin called, and why are we not on the moon already?  Because the prime brokerages who literally executed many of these naked short trades - know damn well that a margin call that results in a defaulting short hedgefund means they themselves will default, as covering a huge gme short position will undoubtedly trigger the moass.  \n\nSo, like the title suggests, my thesis is simple: the brokerages involved with these short hedgefunds are doing everything possible to avoid defaulting one of these accounts holding a massive short position on GME.  \n\n#What’s happening, and what happens next:\n\nMargin calls on hedgefunds by their brokers have came and went, and will continue to, until one of the prime brokerages themselves are unable to meet margin requirements of their dtcc subsidiary membership.  At that point, the 002 (once approved) and 004 wind down kicks in and pulls the rug out from the brokerage, hedgefunds and all come right down with it.  And those processes outline a streamlined liquidation process - that shit will rip fast because ‘if you aint first - yer last’.  Ask credit suisse.  \n\nBut until then, these brokerages have no choice but to keep this up, and i am convinced they have colluded with at least one market maker (cough citadel) to roll the fails resulting from these naked shorts, but also to exert downward pricing pressure using all their illegal tools of price sorcery, many of which we’re seeing as I type this.  And if they can collude on that level, it’s reasonable to suspect they are also colluding to profitably use reddit to pump & dump other tickers, to help stymie their losses as they hopelessly continue to wage war against the apes.\n\n#Wrapping up:\n\nSmaller margin calls, and covering is probably happening every single day.  I know for a fact that there are still retail investors dumb enough to keep doing it - so maybe some of the otherwise erratic / inexplicable action we’ve seen on non t+21 days, like today, could be explained by that.  \n\nSo, while I appreciate the efforts by other stonkers to help keep expectations low, as it helps apes remain calm and patient - i however think the moass is going to happen without warning, produce the largest, most violent green crayons imaginable, and believe it may not even have anything to do with a particular price point or movement once the last of these dtcc rules go into effect.  \n\nTruth is, no one can tell you how it’s going to go down.  Either they are like me and they don’t know - or they know but can’t say.  Either way, you’ll know beyond the shadow of a doubt when moass is upon us, so just buy, hodl, and try and enjoy the scenery along the way.  \n\n#Bonus Theory:\nMy theory also provides a common-sense answer to why the borrow fee % is so low: no reputable broker can get their hands on any appreciable amount of shares legally to borrow and short gme at this point.  The ones who can offer borrows - can because they’re doing it illegally, and need to keep that fee cheap so as to help keep their hedgie buddies trapped on their own sinking ship - afloat. \n\n#Tldr;  \nPrime brokerages who’ve facilitated naked shorting are going to do everything under the sun - including lots more naked shorting - to ensure melvin or some other hedgie with a huuuuuge short position doesn’t default.  When a prime brokerage goes tits up - the price is gonna rip straight up so fkn hard it makes you dizzy.\n\nObligatory: Not financial advice.  Also brrrrrr 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nEdit: I edited for formatting a lot faster than 005.  Lightspeed faster, actually.\n\nEdit: more edits for spelling.",
    "title": "Theory: Hedgies have not defaulted and seen their accounts unwind - because their prime brokers refuse to let that happen, as doing so would destroy themselves.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nvbsip/theory_hedgies_have_not_defaulted_and_seen_their/"
}