{
    "author": "Snowbagels",
    "created_utc": 1627241180.0,
    "distinguished": null,
    "edited": 1627245798.0,
    "id": "ori2y3",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ori2y3",
    "num_comments": 1255,
    "permalink": "/r/Superstonk/comments/ori2y3/single_want_more_gme_oneweeks_worth_of_meal_prep/",
    "score": 19146,
    "selftext": "TLDR; I’m a mom and seeing y’all eating ramen is stressing me the fuck out. The vast majority of our ape brethren are likely men, so I’m here to help.\n\nMy kids are with their dad for the Summer, so I’ve been on a strict diet of ‘fuck everything else, buy more GME.’ No bullshit. I haven’t gotten my nails done in months and I’m eating the same damn thing everyday. Post-MOASS, I’ll be feasting on ribeye and filet marinated in the tears of the wealthy elite. Until then… \n\nBreakfast \n\nSmoothies: \n\n🚀 Bag of frozen fruit ($5-$10)\n\n🚀 One large carton of vanilla yogurt ($2.50)\n\n🚀 One bag spinach ($2.00)\n\n🚀 One carton of plain oats ($2.00)\n\nTotal: $16.50\n\nBlend one cup frozen fruit (no need for ice), 1/4 cup of yogurt, 1/4 cup old fashion oats (uncooked), handful of spinach, and add water or juice. Boom. Breakfast smoothie.\n\nTired of smoothies? Cook the oatmeal and add honey, fresh fruit, and/or brown sugar. Boom. Healthy oatmeal.\n\nOR \n\n🚀 One dozen eggs ($2.50)\n\n🚀 One loaf of whole wheat bread ($2.00)\n\n🚀 Bag of grapes ($3.50)\n\n🚀 Bunch of bananas ($3.00)\n\n🚀 Box of blueberries ($1.50 \n\nTotal: $12.50\n\nDon’t like smoothies? Great, you save $17.00 and boom... Eggs, toast, OR French toast and fresh fruit.\n\nLunch AND dinner:\n\n🚀 Big ass bag of rice (brown, basmati, white, whatever… I buy basmati… $8.00)\n\n🚀 Two cartons of low-sodium chicken or beef stock ($2.50/ea, $5)\n\n🚀 A bag of beans (black, red, garbanzo, whatever… I buy garbanzo) ($1.29)\n\n🚀 A large bag of frozen vegetables (I buy broccoli florets or mixed… $2.50)\n\n🚀 Three avocados (@ $1.50/ea, $4.50)\n\n🚀 Meat (optional).. I buy ground turkey or ground chicken ($5.00-$7.00)\n\nTotal: $28.29\n\nGrand total: $57.29\n\nPro tip: use chicken or beef stock instead of water to cook the rice. More flavor and it’s delicious. Cook your meat with salt/pepper/whatever, steam your veggies (you can cook your spinach and throw that in, too) cut up half of an avocado (when ready to eat. They go bad quick), and toss on top. \n\nYou’ll spend under $100/mo if you buy the rice, oats, bread, eggs and meat in bulk. Frozen fruit can be expensive (fresh fruit is fine) but don’t spend more than $10/bag. \n\nPros: These items are extremely versatile, easy to make, and will last you all week - if not longer. Budget-friendly and a million times better for you than ramen (high sodium content). Also, MORE GME.\n\nCons: You’ll never want to eat a single grain of rice again when this is over. \n\nIf you have other healthy meal suggestions, drop them in the comments. \n\nTake care of yourselves. 🚀🚀🚀🦍🤘🏻\n\nEdit: I’m not worthy, but thanks for the awards. Legitimately want everyone here to be happy and healthy. ❤️\n\nSuggestions from our ape brothers and sisters added are in the comments. \n\nu/bvttfvcker (lmfao, I love this sub): Tired of Rice and wanna treat yourself to some protein? Quinoa is fuckin hella cheap as well.\n\nu/PollutionNice7392: Ever try boiling an old boot?\n\nu/KateSoundsGood: Protip. When cooking rice with stock dont use more salt. Stocks has plenty.\n\nI also cook grits with stock. \n\nMmmmm. Soooooo good.\n\nMainly use veggie stock.\n\nu/PrecariouslyLevel: Also, make sure you add garlic. Butter garlic sticky rice (I use medium grain) is great stuff even when you're not trying to budget.\n\nPotatoes are cheap, filling and HIGHLY nutritious.  You can live for months at a time on just potatoes -- the longest I did was three months, but then I had to break for travel.  Add a little dairy and you've got a diet that supported people in great health for hundreds of years.  I'll blow a couple of extra pennies to keep up on the nutrition side.",
    "title": "Single? Want more GME? One-weeks worth of meal prep for under $60/week.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/ori2y3/single_want_more_gme_oneweeks_worth_of_meal_prep/"
}