{
    "author": "TheSadBantha",
    "created_utc": 1622471999.0,
    "distinguished": null,
    "edited": 1622628812.0,
    "id": "np4wwu",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_np4wwu",
    "num_comments": 2612,
    "permalink": "/r/Superstonk/comments/np4wwu/etoro_got_their_15_of_all_gme_holder_straight/",
    "score": 13533,
    "selftext": "I see I received the inconclusive flair, I guess that is fair because there are still a lot of questions unanswered. What I find a bit sad is that the mods didnt reached out to me for more information.\n\nFriday Etoro dropped a bombshell that they had around [1.5% of all GME shareholders](https://www.reddit.com/r/Superstonk/comments/nmos5k/what_the_actual_fuck_did_etoro_just_say/) on their platform.\n\nPeople  took this information with a bucket of salt, because how was it possible for Etoro to possibly know this. for them to know this they must either a) know the total amount of GME-shareholders across all brokerage firms or b) someone legit provided them with this data\n\nAccording to the screenshot below (not mine, please ape come forward so you can get the credit: -> it was u/jd94jd) and u/silver-reserve-3764 (please check his post [https://www.reddit.com/r/Superstonk/comments/np9k08/etoro\\_update\\_so\\_far/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/Superstonk/comments/np9k08/etoro_update_so_far/?utm_medium=android_app&utm_source=share) for more information) is doing a following up with etoro.\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n**Edit11: I have received a lot of flack for** u/jd94jd **being my source because apperantly he is active on GME\\_meltdown. so let me clear some stuff up. was he active yes, did he engage with members on that subreddit yes he was, did he inquire an counter argument yes he did.But what has been ommitted from this is that he is banned on GME\\_meltdown.Also it is healthy for an investigation the gather all sides of an argument, I lurk at GME\\_meltdown all the time to look for counter DD I can investigate.and by the way, you know who else is active on that subreddit and engages in arguments** u/atobitt. **Does that make him a shill? ofcourse not, because there is nothing wrong with discussing this with anyone.**\n\nGot the screenshot from the [GME Timeline](https://gmetimeline.com/) If you dont know the site, please check it out. its an incredible summary by date of all things related GME, I use it to keep me up to date with this new information and DD around.\n\n[First conversation regarding the 1.5% number](https://preview.redd.it/n0e50pukvg271.png?width=501&format=png&auto=webp&s=3890044abf807dd727de85d95b8d0495649e4dee)\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit 5: Alright have been in contact with the original poster of the screens (*u/jd94jd*)*\n\n*He can Confirm the following, He had this chat-convo with etoro last Friday (****28th of May, 2021****)He is speaking with Etoro as you are reading this to confirm that Etoro indeed has 20 Million customers/clients (*[*20M clients are on Etoro*](https://imgur.com/a/s5QJoie)*)*\n\n*Also to Clarify this once and for all. the 1.5% is the amount of* ***SHAREHOLDERS***. *that Means 1.5% of the total count of all GME* ***INVESTORS***\\*, Etoro does clarify this in their conversation with\\* u/jd94jd *as can be seen here* [*https://imgur.com/a/X2S6NMt*](https://imgur.com/a/X2S6NMt)\n\n*Also the question on how the calculated the 6.71% has been asked to verify and clarify this.* u/jd94jd *is awaiting their answer on this matter. The request has been escalated and he is waiting for the response by mail, The moment it comes in we will share this with you.*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit6:* u/jd94jd *has been an absolute trooper, he has provided me with an excerpt of his conversation with Etoro* [*which can be seen here*](https://smallpdf.com/pdf-reader?job=1622483718788)*. you can see that the etoro support agent can not reveal to much but* u/jd94jd *is all over him like some sort of rabid ape trying to use the correct syntax to get some answers.*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit10: Me and u/Silver-Reserve-3764 have been in contact with u/jd94jd and he provided us with the [following conversation](https://imgur.com/a/77rsmZy) he has with eToro, about TSLA and how they come up with number of owners of TSLA on their platform, and what that number represents.you look at this and form your own conclusions... but it seems to me that if they say that this works for TSLA then it works the same for GME\n\nSo if you follow the linke you will see the following:\n\n**Question:** *Ok, so would it be ok to run through a quick example?*\n\n*For example, if you had 10 million registered accounts, and the sentiment said \"10% of our investors invest in this stock\" that would mean 1 million people invest in the stock?*\n\n**Answer:**  *Yes you're Correct, is there anything else i can help you with?*\n\n**Question:** *Are you 100% sure? sorry about all the questions, it is just very important*\n\n**Answer:** *Yes I'm definitely sure*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nSo Gamestop themselves provided Etoro with that 1.5% data,\n\nAlong with the knowledge that 6.71% of Etoros userbase has GME.\n\n&#x200B;\n\n[https://preview.redd.it/ksbd4yfkwg271.png?width=283&format=png&auto=webp&s=de99df2f930e57711e0c04e685a08364ddd19bb3](https://preview.redd.it/ksbd4yfkwg271.png?width=283&format=png&auto=webp&s=de99df2f930e57711e0c04e685a08364ddd19bb3)\n\nMaff time\n\nEtoro has around 20M clients\n\n6.71% of 20M = 1.34M GME investors on Etoro (1.342.000 in total)\n\n1.34M = 1.5% of all GME holders which means there are 89M GME investors. (89.466.666 in total)\n\nSo there are more investors of GME then there are Shares out there.\n\nEdit14: Maybe 89M investors looks incredible huge and hard to fathom, but if we take a look at he world population: 7.9B people. if we substract the percentage that is under 18 ( 29.3% ) we get 5.585B people. ([source)](https://en.wikipedia.org/wiki/Demographics_of_the_world)\n\n89M possible shareholders / 5.585B people able to buy stock \\* 100 to get a percentage = 1.59% of the world population would be a shareholder.\n\nSo on a world scale the number 89M isnt that large.\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit12: I want to clear something up here, the main counter argument I receive is that 6.71% of 20M must be wrong because eToro only has only 1.2M funded accounts, if that is true then eToro blatantly lies about there active user base. (source:[https://comparebrokers.co/etoro-review/)Also](https://comparebrokers.co/etoro-review/)Also) when opening a Trading account on eToro, you must make an deposit of $200 doesnt this mean that in fact all of those accounts have Funds.So what does the term \"Funded accounts\" mean anyway,\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit13: according to the following [article](https://www.tradingsitereviews.com/best-funded-accounts/) a funded account means the following:\n\n***\"What Is a Funded Account -*** *Many companies are ready to provide traders with fully funded trading accounts. Not every trader has sufficient funds to start trading on exchanges. Companies are looking for traders that already have their own winning strategies and can use different trading tools to make a stable profit. As a rule, day traders must go through an assessment phase. In order to get a funded account and the right to use it for trading on exchanges, traders usually need to prove that they can trade successfully either using simulated accounts or by attending trading courses. After completing an evaluation phase, a trader may start earning from day one and obtain his share of the total profit.*\n\n*Funded accounts are divided into several types according to the choice of assets being traded.\"*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit9: I see a LOT of suggestions that the real active number of eToro users with GME is around the 96.660 holders(*[Confirmation](https://www.reddit.com/r/Superstonk/comments/npmaym/some_accurate_data_straight_from_etoro_api_calls/)*).*\n\n*If 96.660 are 1.5% of the total number of hodlers, then we have total of 6.4M shareholders.if 6.4M is correct, then we with an 12 shares on average would give us more then the number of issued shares.*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*EDIT: if we take our 89M Gme holders and apply the average of 14.5 Shares per holder (provided from* [*Nordnet data*](https://www.reddit.com/r/Superstonk/comments/nnngl6/update_dd_i_did_the_math_latest_nordnet_and/)*) we have a minimum of 1.29B shares. this is pure assumption. if we take an absolute conservative number of 2 we still have 178M shares, which is also batshit insane.*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*EDIT2: Added link to GME timeline*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit3: alright I see a lot of \"etoro allows fractional shares\" lets put those numbers to work. it has been stated that the real float is around 21M these are the shares that are not held by insiders or institutions. That means if we divide the 21M with the 89M holders we still own the float even if the average is 0.23 share per holder..*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit4: please even after this post, it is still important to exercise your right to* ***vote. (Buy the dip, Hodl, VOTE)***\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit5: See above in post*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\n*Edit6: posted some correct exact values as people where starting to complain that the title is missleading as it isnt over 89M (Surprise Apes.. it is.. I was just lazy and rounded down to get some handy whole numbers)*\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit7: I am trying to answer as much of your questions as possible (in the comments and in DMs) I also received a shitload of shill questions, troll actions and some threats... so we must be on something good here! But for now I am trying to enjoy some free time that I have left. Most questions are answered in the post. If I receive some new information I will update this asap. Thnx for all the awards and Upvotes, I will see you all on the moon.\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit8: changed some Grammar and words, because for some reason my english is terrible.\n\n\\--------------------------------------------------------------------------------------------------------------------------------------------\n\nEdit9: added the suggested number of GME holders on eToro (still awaiting confirmation) (96.660)\n\n&#x200B;",
    "title": "Etoro got their 1.5% of all GME holder straight from the Gamestop There are over 89 Million Diamond handed Apes out there.",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/Superstonk/comments/np4wwu/etoro_got_their_15_of_all_gme_holder_straight/"
}