{
    "author": "Soulsauce042689",
    "created_utc": 1622492283.0,
    "distinguished": null,
    "edited": 1622763631.0,
    "id": "npcczs",
    "text_only": true,
    "flair_id": "4c901ca2-b1b1-11eb-83d0-0ed719c76173",
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_npcczs",
    "num_comments": 1156,
    "permalink": "/r/Superstonk/comments/npcczs/etoro_misinformation_etoro_does_not_have_13m/",
    "score": 14807,
    "selftext": "I'm afraid to post this right now RIP my karma, but eToro does not have 1.3M shareholders.\n\nI don't think this is a FUD campaign, but the sub will be sorely disappointed when the flaw in calculations is revealed. As such it misinformation should be treated as FUD. \n\neToro's metrics are based on **funded accounts** not all registered users. It makes sense if you don't have money in the account you can't hold GME.\n\n\nEDIT: source https://marketing.etorostatic.com/cache1/pdf/eToro-Investor-Presentation.pdf\n\nEDIT: We may have gave the PDF source the ol' Reddit hug ☠️ screenshots and verification floating around in comments.\n\nEDIT: Chat with a rep confirms that these metrics are using active and funded accounts https://imgur.com/a/QDij2Wo (I am not the primary source for this screenshot.)\n\n--\n\n\n6.5% of eToro Users hold GME\n\n\nOn 2021-01-31 1.2M of 20M eToro users had funded accounts.\n\n\nWe can assume that the 25M registered users is accurate, and the same ratio. Gives us the ~96,000 GME apes on eToro.\n\nEDIT: some more coroborating evidence here stating 96,600 shareholders if anyone can verify  https://www.reddit.com/r/Superstonk/comments/npc9n7/when_you_purchase_gme_on_etoro_it_states_that/?utm_medium=android_app&utm_source=share\n\n\nIf eToro has 1.5% of all shareholders then 96,000 / 0.015 gives us **6.4M total share holders worldwide.**\n\n\n**We still own the float at 10+ shares average per** 🦍\n\n\n--\n\nWe need to be sure to not spread information that over hypes our community. Newer apes my be disheartened by finding that the estimate is an order of magnitude off. That's a significant mistake that must be stymied at the outset. \n\n\n\nLet's make sure we encourage fact checking and avoid all of the verifiably false information.\n\n\n\nThis kind of misinformation is easily invalidated by way of giving a little more effort to the calculations.\n\n\nI'm all for letting us get hyped, but let's get hyped over real news and real numbers. Like the fact that GME shareholders could easily be 6.4M worldwide and given some estimates hold and average of 14 shares per account. Which means we are almost certainly over the float with retail alone - nevermind, institutional diamond hands.\n\n\nFunny metric is that if there are 6.4M shareholders then at 10 each that's already 100% of the float at 14 per account that's come from some brokers that puts us back at 140% 🤣\n\n\n-- \n\n\nLook at all the top posts right now:\n\nhttps://www.reddit.com/r/Superstonk/comments/np4wwu/etoro_got_their_15_of_all_gme_holder_straight/\n\nhttps://www.reddit.com/r/Superstonk/comments/np7vfd/etoro_leaking_that_they_have_134_million_gamestop/\n\nhttps://www.reddit.com/r/Superstonk/comments/npani2/some_calculations_using_the_etoro_numbers/\n\n\nEDIT: added a bunch of stuff to get to the 2000 char count for DD\n\nEDIT: ~~some disagreement on the definition of funded account, getting to the bottom of it.~~\n\nEDIT: eToro does not offer a Funded Account program - they are talking about accounts with funds. The verbiage is vague - at the end of the day the math checks out. As such the DD in this post is validated.",
    "title": "🚨eToro misinformation! eToro does not have 1.3M share holders! We still own the float!",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/npcczs/etoro_misinformation_etoro_does_not_have_13m/"
}