{
    "author": "edwinbarnesc",
    "created_utc": 1627373216.0,
    "distinguished": null,
    "edited": 1627411545.0,
    "id": "osikst",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_osikst",
    "num_comments": 490,
    "permalink": "/r/GMEJungle/comments/osikst/wolves_in_ape_clothing/",
    "score": 1066,
    "selftext": "I was going to hold off from posting this but after a discussion with another ape, felt it was necessary to share what I've found. Here goes.\n\nShoutout and credits where due, in no order: u/mybustersword, u/ShibaShitShow, and others.\n\nTo fully understand where this is going, it requires a little bit of context beginning with the Sup3rstonks Mod drama last week, which can be found here: [https://www.reddit.com/r/GME/comments/omnvgm/false\\_prophets/](https://www.reddit.com/r/GME/comments/omnvgm/false_prophets/)\n\n# TL;dr Sup3rstonk (SS) Mod drama:\n\n\\- RedChessQueen99 (RCQ) staged a coup from r/GME with several users (named below, including u/Sufficient-Bowler741) and triggered the first migration to SS then began exerting control, witchcraft, and almost achieved runic glory before an untimely removal.\n\n\\- Hey\\_Maddie is a blackwater mercenary and deep cover shill operative that infiltrated SS and was promoted to Mod status by SS Admin RCQ and approved by SS Mod Rensole (Renshill) despite other SS Mods voicing concern, especially Pinkcatsonacid\n\n\\- Shortly after Hey\\_Maddie's promotion all sorts of fuckery began: Satori (the AI bot that patrols SS and approves users) began auto-approving people with low karma to no karma; even allowing a shill account named Apefest to promote Apecon on SS only to backfire and get shutdown by the community\n\n\\- David/Dave Lauer appears on the scene, buys some shares and says he has \"skin in the game\" but offers no DD nor confirms the thesis with his vast Insider experience from working at Citadel (to the fanboys who says he's under intense scrutiny, have you heard of Peter Hann? You can support the movement and avoid legal). Next, Dave begins pushing his startup project to the ape community, asks for \"investment\" funding in amounts of $25,000 to $100. Community shuts it down, saying too soon and better after MOASS. Dave backs down for now...\n\n\\- Meme Queen Pinkcatsonacid is banned and removed as SS Mod then replaced with Buttfarm69 (keep this name in mind)\n\n\\- [u/3for100Specials](https://www.reddit.com/user/3for100Specials/) exposes the entire fiaso and thus begins the GMEJungle migration, SS mods leaving/replaced, and resignation of several mods only for several to return shortly after as if nothing ever happened..\n\n*Now to the present.*\n\n# Even with new SS mods, the fuckery continues but low-key and away from public eyes (high-level shilling begins):\n\n\\- Any posts about why quality DD isn't available gets instantly removed by SS Mods\n\n\\- New quality posts get suppressed or down voted to shit (e.g. same authors making the same posts across multiple GME subs and getting traction, but on SS it doesn't rise up -- multiple occurrences for multiple authors (screenshots below)\n\n\\- Low karma users continue to be approved on SS, meanwhile many Day 1 SS users still unable to post/comment.\n\n\\- Satori has been infiltrated or is being modified by someone. Why allow low karma to post? More Shill Agents to downvote good content while upvoting their posts that fit their agenda, refer to Cointel operative tactics: [https://www.reddit.com/r/Superstonk/comments/mwi2qj/because\\_i\\_cannot\\_stress\\_this\\_enough\\_i\\_am/](https://www.reddit.com/r/Superstonk/comments/mwi2qj/because_i_cannot_stress_this_enough_i_am/)\n\n\\- David Lauer's startup project resurfaces, but this time, multiple shill accounts are pushing for it to gain traction and coincidentally the fundraising ends 7/27 and trying to get that ape money.\n\n# Now for screenshots:\n\nGallery:  [https://imgur.com/gallery/X3u5pgz](https://imgur.com/gallery/X3u5pgz)\n\n&#x200B;\n\n[Part 1, the smoking gun](https://preview.redd.it/dk0r2dq8ppd71.png?width=1584&format=png&auto=webp&s=1d6dd6302f77bcef231423613521b9027a6f3a49)\n\n&#x200B;\n\n[ Part 2, the shills ](https://preview.redd.it/rogq1qwzipd71.png?width=1510&format=png&auto=webp&s=b97af46b83186ba1cd639f4af65ff315be8b12b7)\n\n&#x200B;\n\n[ Part 3, quality DD disappears \\(suppression begins\\) ](https://preview.redd.it/pes4u201jpd71.png?width=1322&format=png&auto=webp&s=3daa2e8112bb8d21abe6ce33d3eb995596f24b86)\n\n&#x200B;\n\n[ Part 4, asking for ape money ](https://preview.redd.it/cpjgipx1jpd71.png?width=1508&format=png&auto=webp&s=1ce6a6c35942eba4bd28f120b00201743fee6518)\n\n# Final Words\n\nI honestly don't give a shit what DD writers do and if they want to earn money for their work then great. Props to them because they put in time, effort, and intensive research for little to no monetary reward. If you want to get paid, then go do it because nobody is here trying to stop you from making a living nor should this post be misconstrued as that.\n\nRegarding Dave and Stefanie's twitter battle, it set things in motion which led me to sharing this.\n\nThe hint: it was his ego, or specifically his arrogance that pissed me off.\n\nThe fact that he was so quick to dismiss someone, while claiming high ground as the de facto dark pool expert (refer to \"Authority Fallacy\") and telling everyone dark pools cannot be manipulated. Meanwhile, the entire ape community was witnessing crazy dark pool activity (#DarkPoolAbuse) reaching up to 80-90% last week and nobody could explain it.. well that was the final straw and time to call bullshit.\n\nFurthermore, I do not care what David Lauer u/dlauer does with his startup project. In fact, when I first read about it, I was for it (who doesn't want a level playing field against wallstreet?) but now that I have seen the level of fuckery, shilling, and manipulative bullshit.. well, not a chance in hell. Man, you could have just waited until post-MOASS and I would have gladly forked over $25k to help create something, but fuck it that's on you. David may or may not have any direct connection to any of these shill artists except for directly recruiting an ex-SS Mod into his company as COO but the timing and events, well, I'll let you decide.\n\nThere are other great services out there that give away so much and contribute towards the ape movement which makes me question Dave's paywall service.\n\nI refer a lot of family, friends, and people who trust me to these boards and I will never stand for blatant manipulation, lies, and fuckery.\n\nFuck hedgies, fuck shills, and fuck anyone that tries to mess with apes especially those that want to profit and prey on good people.\n\n# To the fanboys, ya'll can suck it.\n\nAdditional reading:\n\n[u/ShibaShitShow theory and NDAs](https://www.reddit.com/r/GMEJungle/comments/oq69mi/big_datamonetizationshady_ndas_and_the/?utm_medium=android_app&utm_source=share)\n\n[Moon's discovery of Mod deception](https://www.reddit.com/r/Superstonk/comments/ombmj8/i_smell_bullshit/?utm_medium=android_app&utm_source=share)",
    "title": "Wolves in Ape Clothing",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/GMEJungle/comments/osikst/wolves_in_ape_clothing/"
}