{
    "author": "Region-Formal",
    "created_utc": 1620229701.0,
    "distinguished": null,
    "edited": 1620236996.0,
    "id": "n5j2gp",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n5j2gp",
    "num_comments": 172,
    "permalink": "/r/Superstonk/comments/n5j2gp/worried_the_rich_and_powerful_never_lose_so/",
    "score": 3105,
    "selftext": "Think again! History is absolutely *littered* with stories of the \"great\" making monumental errors of judgment. Sometimes leading to them suffering enormous opportunity costs, but often times leading to their complete downfall.\n\nDon't believe me? Need some examples as *inspiration* for another day of hodling? Well, here is a list I have made of ten such examples through the ages (I am sure there are countless more). Note that the last one is an ongoing historical event...\n \n\n**1184 BC:**  According to the legend Priam, King of the Trojans - despite receiving advice not to - choosing to accept a giant, commemorative, wooden horse inside the city walls as a gift from the retreating Greeks. *Outcome = The hollow horse held Odysseus and his men, who opened the city gates at night and allowed the Greek army to enter and sack Troy to the ground, burying it under the earth until its eventual discovery and excavation in the 19th century.*\n\n**50 AD:**  The Greco-Egyptian mathematician Hero of Alexandria's invention of a basic steam engine, being treated mainly as a curiosity in the Roman Empire and not put to any real, practical use. *Outcome = The world had to wait another 17 centuries for the English to start the steam powered Industrial Revolution and begin our modern age.*\n\n**1219:**  Content with his conquest of China, Mongol Emperor Genghis Khan sending an envoy to the Persian Khwarezmid Empire's Shah Muhammad II with the message: \"I am master of the lands of the rising sun while you rule those of the setting sun. Let us conclude a firm treaty of friendship and peace”...only to be sent back the envoy's head in a sack, as a grisly and emphatic rejection of the proposal. *Outcome = An enraged Genghis invading and killing 15 million Persians as revenge, and from there setting up a platform to capture most of the Eurasian landmass.*\n\n**1405:**  The Chinese Ming Emperor Yongle sending Admiral Zheng He's huge fleet to most of the known world, but choosing to make these expeditions for mainly economic and commercial objectives, rather than gaining territorial control. *Outcome = Within 150 years, the Western Europeans had instead captured most of these lands as colonies, and relegated China from being the preeminent global power to half a millennia of decline.*\n\n**1520:**  Aztec Emperor Moctezuma II allowing Conquistador Hernán Cortés and his troops in as guests to his capital, Tenochtitlán. *Outcome = The Spanish took Moctezuma II hostage, eventually leading to his overthrow and death, triggering a series of events and devastating pandemics that eventually led to their conquest of most of the Americas.*\n\n**1664:**  The Dutch selling Manhattan to the English for only $1143 in curent money. *Outcome = England renamed \"New Amsterdam\" as \"New York\", took control of most of the Eastern Seaboard from the Netherlands, and today Manhattan Island's real estate alone is valued at $1.9 trillion - higher than Canada's GDP (the country with the 9th largest GDP in the world).*\n\n**1876:**  Western Union boss William Orton, the largest telegram and communications company of its day, turning down Alexander Graham Bell's offer to sell them his patent for the telephone. *Outcome = As Orton did not see potential for the invention, Bell decided to set up his own business, which became so enormously successful that it had to be split into the \"Baby Bells\": today's AT&T, Qwest, Verizon and Alcatel-Lucent that still dominate the American telecommunications industry.*\n\n**1942:**  Adolf Hitler choosing to turn the Wehrmacht's 6th Army towards Stalingrad, instead of more strategically important locations in their attempted conquest of the Soviet Union, so that he could score a \"symbolic\" victory over Stalin. *Outcome = Within six months, by the following February, the Germans and their allies had lost a million men in the frozen rubble of Stalingrad, and the course of WWII was completely reversed towards their eventual, crushing defeat.*\n\n**1962:**  The London based record label Decca's head, Mike Smith, rejecting the chance to sign up The Beatles after a 15-track audition with the feedback: \"guitar groups are on the way out\" and \"The Beatles have no future in show business\". *Outcome = The Beatles signed up with the EMI subsidiary Parlophone instead, selling 600 million records and eventually becoming (and still) the most successful musical artists of all time.*\n\n**2021:**  Ken Griffin (Citadel), Gabe Plotkin (Melvin), Jeff Yass (Susquehanna), Douglas Cifu (Virtu), Steve Cohen (Point72) and other hedge fund bosses choosing not to close their GameStop short positions in January for three figures per share. *Outcome = A bunch of retarded Apes - most of whom still don't even know what \"DD\" actually stands for - called into action and eventually helping to destroy said hedge funds, becoming fabulously wealthy themselves in the process, changing how financial markets operate, instigating social and environmental activities that change the world for the better, as well as taking space exploration to new limits.*\n\n**TL;DR: History has many examples of (apparently) \"great\" men making huge errors of judgement, which cost them dearly. Usually caused by arrogance, over-confidence, superiority complexes and a lack of imagination. Apes are living in and creating the next great example of this. HODL AND MAKE HISTORY.**",
    "title": "Worried the rich and powerful never lose, so doubting the MOASS will ever happen?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n5j2gp/worried_the_rich_and_powerful_never_lose_so/"
}