{
    "author": "OverwatchShake",
    "created_utc": 1627546413.0,
    "distinguished": null,
    "edited": 1627556828.0,
    "id": "otta8a",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_otta8a",
    "num_comments": 221,
    "permalink": "/r/Superstonk/comments/otta8a/it_would_be_wise_to_get_the_word_out_on_those_put/",
    "score": 6587,
    "selftext": "Hello, fam. Older ape here. I am not one to make posts. I religiously stick to comments unless I feel I have something useful to add. And those put contracts in Brazil feel like a big deal to me.\n\n\nNow, I'm not a numbers guy. Even when I played poker five workdays I relied on instinct and guesstimates more than exact math. I've done alright by it, but apologies if this is not hard material.\n\n\nWhat do we know:\n\n\n1) Shorts have been kicking the can delaying closing their shorts in the hope of retail losing interest.\n\n\n2) There's been a lot of new regulations that *theoretically* make it harder to kick the can.\n\n\n3) Put contracts for 100 million shares of GME appear on a Bloomberg Terminal for Constancia Investimentos and Kapitalo Investimentos, filed in MARCH.\n\n\nNow, I don't pretend to know WHY these put contracts are in Brazilian institutions. I'm sure any ape could speculate and come to the same candidate answers -- liability in case moass, extradition, kicking the can but with even more crime, you name it.  It's fuckery, what flavor, your guess is as good as mine but fuckery all the same. I suspect that when the moass is said and done these companies will be linked to the known shorts CITADEL, POINT 72, MELVIN CAPITAL and SUSQUOHANNA. And regulatory agencies will say they didn't know.\n\n\nSo let's get the word out. Because something about this FEELS desperate to me. Like they had to have those puts and they didn't have any convenient place to put it and shoved 'em in Brazillian shell companies or something similar.\n\n\nWe don't even need to know the reason. If word gets out, this info makes the rounds, the hivemind of the internet will figure it the fuck out. It almost always does. Furthermore, people like a mystery. It will get them involved and invested emotionally and maybe after that financially. \n\n\nAnd the SEC will never have the luxury of saying they didn't know or didn't look at it.\n\n\nThanks for making it this far. My brain is smooth but my heart is in the right place, and I felt like sharing.\n\n\nPower to the players, the wrinklies, and cheers to some deep fucking value.\n\n**EDIT 1)** https://www.reddit.com/r/Superstonk/comments/otszbz/this_compliance_officer_previously_worked_at/\n\nThanks to u/broccaaa for pointing us to Ivan Padilha and his past at ENRON.\n\n\nhttps://www.reddit.com/r/Superstonk/comments/otqvmh/constancia_investimentos_ltda_kapitalo/\n\nThanks to u/El_Patron_1911 for these connections.\n\nhttps://i.redd.it/1cv0jl3464e71.png\n\nThanks to everyone's favorite Pomeranian u/Criand for this thorough explanation. This pupper has more wrinkles than the old dudes running Wall Street.",
    "title": "It would be wise to get the WORD OUT on those put contracts in Brazil.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/otta8a/it_would_be_wise_to_get_the_word_out_on_those_put/"
}