{
    "author": "pinkcatsonacid",
    "created_utc": 1621087001.0,
    "distinguished": "moderator",
    "edited": 1621276213.0,
    "id": "nczgbc",
    "text_only": true,
    "flair_id": "02d4a642-a071-11eb-bf5d-0e4876509fbb",
    "flair_text": "AMA 🏆",
    "name": "t3_nczgbc",
    "num_comments": 364,
    "permalink": "/r/Superstonk/comments/nczgbc/official_ama_wes_christian_with_special_guest/",
    "score": 5339,
    "selftext": "&#x200B;\n\nThis is the official AMA (Ask Me Anything) post for **Wes Christian**, who will be joining special guest host Dave Lauer- [u/d](https://www.reddit.com/u/jsmar18/)lauer- on [Superstonk Live](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA) for a one-on-one discussion, with questions influenced by and taken directly from this post.\n\n**Please make comments on this post directly, as we will be referencing this exclusively to form the outline of questions for the AMA.**\n\n# Please visit the [Superstonk Youtube Channel](https://youtu.be/2rJujnpKiqM) and subscribe and enable notifications so that you are prepared for the [live stream on May 18, 2021 @ 4:30 p.m.](https://youtu.be/2rJujnpKiqM)eastern.\n\nDon't forget to like the video for more exposure! 👍\n\n\\---\n\n&#x200B;\n\n[Wes Christian](https://preview.redd.it/zw5a517hs6z61.png?width=170&format=png&auto=webp&s=569504eb49246cae1e7b869684ae36057ce46963)\n\n# [Tuesday at 4:30 pm eastern we have Attorney Wes Christian](http://www.csj-law.com/attorneys/jchristian.html)!!\n\n# His primary focus in the last 11 years has been suing Wall Street for fraud.\n\n&#x200B;\n\nWes Christian is a Texas attorney with [an accent as big as his list of accomplishments](http://www.csj-law.com/attorneys/jchristian.html)! Once again I'm going to [shamelessly plug the old documentary Wall Street Conspiracy](https://youtu.be/Kpyhnmd-ZbU), where I first learned of Wes Christian along with all of the other OGs we've been talking to. And a fun fact... our former AMA guest and very favorite resident wrinkly brain, u/dlauer has served as an expert witness for Wes multiple times in the fight against naked short selling. They go way back...\n\n# Which is why we're having u/Dlauer cohost* this AMA with his old pal Wes!! We are literally assembling the dream team here!! 🚀🚀🚀🚀🚀🚀\n\n**\\*the AMA will be curated and hosted by** u/Jsmar18 \n\n&#x200B;\n\n**This AMA Post will remain active until the live stream begins, at which point this post will be LOCKED.** Please note that our AMA guests have limited time, and cannot possibly answer all questions, so we encourage you to put some effort into your questions so that they can be upvoted by your fellow apes for visibility.\n\n\\---\n\n**YOUTUBE INFO**\n\nPlease note... **This channel is not monetized, nor will it ever be** (screenshot this and hold us accountable), and is strictly for education and discussion as it relates to [r/Superstonk](https://www.reddit.com/r/Superstonk/) topics and the interests of the community. The idea was approved by the mod team, and the channel was created and is administered by [u/redchessqueen99](https://www.reddit.com/u/redchessqueen99/). The stream itself will be handled through a third party service with many live-editing features (omitted for security's sake) that allows a stream through Youtube.\n\nFinally, we made the choice to create this platform because AMA guests seem to prefer the live stream method, since they don't always have a reliable platform to stream from. This allows us to offer them a choice of platform, and also a means of discussion with our members LIVE, that ultimately will cater to the interests of [r/Superstonk](https://www.reddit.com/r/Superstonk/) and this community of diamond handed apes.",
    "title": "OFFICIAL AMA- Wes Christian with Special Guest Host Dave Lauer- Tuesday, May 18, 2021 @ 4:30 p.m. Eastern",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nczgbc/official_ama_wes_christian_with_special_guest/"
}