{
    "author": "thatskindaneat",
    "created_utc": 1626459324.0,
    "distinguished": null,
    "edited": 1626468861.0,
    "id": "olmlqt",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_olmlqt",
    "num_comments": 146,
    "permalink": "/r/Superstonk/comments/olmlqt/because_theres_a_bunch_of_dumb_shit_on_the_sub/",
    "score": 3793,
    "selftext": "[Link to the episode](https://youtu.be/9RbL8lTsITY) \n\n[UK Link](https://youtu.be/Sf-EObgGgaY) \n\nFor those who are intrigued by the macro trends in our markets/monetary policy this is an absolute must watch. \n\nI heard about the episode on Monday from one post and haven’t seen much since, which surprises me given how much bias it confirms. \n\nIn short, it lays out everything we’ve been saying about a market crash. The focus is on the Fed policy of QE and lending since 2008 and whether it was good or bad. It’s overwhelmingly seen as bad but, interestingly enough, both arguments agree that the end result is that we’re currently fucked. \n\nIt references GME (DFV shoutouts) but doesn’t necessarily say that it’s good or bad, it simply states that our markets are dangerously susceptible. It confirms that borrowers are over leveraged and all the money is just funneling to investments of the top 1% and provides significant risk because Wall Street is essentially black mailing the economy. Do what they want or they’ll freak out and crash the economy… so that’s exactly what the Fed does.\n\nMultiple billionaires, Nobel Prize economist, ex Fed,SEC, Finance heads, etc. are interviewed and they all agree with the macro trends we’ve been discussing here. The bias confirmation is delicious. \n\nI don’t know if it’s intentional or shills or FUD or whatever, and I don’t really care, but there’s a common thread in the sub that folks feel ostracized from talking about GME in real life. I know that’s the case for me, and people who don’t understand the stock market or economic policy can’t grasp what I’m trying to say so it’s difficult to make a coherent argument. I think that’s pretty natural, we’re talking about many enormous threads in this sub and it’s next to impossible to tie together if you aren’t following closely. We don’t have the benefit of traditionally reliable sources to give to friends and fam because financial media is a Wall Street talk piece and multi page story’s on policy aren’t going to get any clicks from reliable media. \n\nTHIS IS THE EPISODE TO SHOW YOUR FRIENDS/FAMILY TO VALIDATE WHAT WE’VE BEEN SAYING. I don’t want to hear MSM blah about Frontline, it’s as credible of a source as there is and they tell this story fairly. I’ve talked to my wife about the economy as I’ve positioned our investments but she doesn’t care enough to know all the detail of it, she trusts me. I had her watch this episode just so she could understand and it clicked for her. \n\nThere’s power in this episode well beyond Superstonk that can help our friends and family educate themselves on a possibility most of us believe is inevitable. It brings nothing but credibility to our argument and further Jack’s my tits that GME is a black swan event driven by free money and risk aversion leading SHF’s to dig a gargantuan hole that they can’t get out of. They’re so fuk’d.\n\nEdit: fixed link, words.",
    "title": "Because there’s a bunch of dumb shit on the sub today, let’s highlight something that deserves every ape’s attention that hasn’t been talked about enough - the Frontline episode on the Fed was incredible.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/olmlqt/because_theres_a_bunch_of_dumb_shit_on_the_sub/"
}