{
    "author": "David_moneybags",
    "created_utc": 1626462923.0,
    "distinguished": null,
    "edited": 1626489347.0,
    "id": "olnujb",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_olnujb",
    "num_comments": 187,
    "permalink": "/r/Superstonk/comments/olnujb/removing_madie_as_moderator_will_put_apes_at_ease/",
    "score": 950,
    "selftext": "\nCan the Mods Make an argument with why she’s essential to the sub or remove her. Keeping her without some kind of statement to the sub other then “we voted her in” seems like a majority of the mods could be compromised. \n\nMost of us like Pink….\n\nAnyway REGARDLESS Buy, Hodl, buckleup![\n\nEdit 1: I’m not sure if we’ll get an answer from our Mod team. Something I’ve observed is that  POWER CORRUPTS. Few get a hold of it and willingly let it go, rather they want more and more. I don’t get a good feeling from the way this has been handled. Pink unanimously getting silenced honestly is a bad look. Other mods are keeping silent in fear of also getting the axe? If all it takes to compromise Red is some nudes then Kenny G is going to have an easy time spreading FUD when he really needs to. I’m for free speech on this sub as long as it’s not spreading FUD which she wasn’t.  I personally want to hear what she has to say and if you do as well she can be found running https://www.reddit.com/r/GMEJungle/ \nI’d like to see trust in the mod team restored and another large migration prevented. We have a lot of good stuff here on R/Superstonks.\nI’ve been dealing with a lot of house selling stuff today and haven’t had a chance to respond to everyone. Just got under contract so hopefully will be dumping 30k+ into some more of the one true play. Can’t stop, won’t stop, GameStop.\n\nEdit 2: is their a downvote tracker I can add to this? I’m surprised at the amount of people on this Sub in favor of a shill Mod.",
    "title": "Removing Madie as moderator will put apes at ease.",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/Superstonk/comments/olnujb/removing_madie_as_moderator_will_put_apes_at_ease/"
}