{
    "author": "m0m",
    "created_utc": 1624227729.0,
    "distinguished": null,
    "edited": 1624229670.0,
    "id": "o4glqb",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o4glqb",
    "num_comments": 242,
    "permalink": "/r/Superstonk/comments/o4glqb/wall_street_is_counting_on_people_not_truly/",
    "score": 6163,
    "selftext": "I know for the wonderful quant apes and number apes this is basic crayon 101.So, while I am in no way a number ape, I want to share with other non-number apes a practical sense of how extremely far apart million, billion, and trillion are from each other.\n\nI think it very important that Apes understand how vast the difference is between million, billion, and trillion in order to recognize possible Number FUD and make informed decisions.  \n\nSome have argued that our floors are ridiculous and impossible. *(Number FUD)* \n\nI hope to demonstrate that the scale of the numbers that Wall Street works with and has acquired -vs- Main Street - the difference between the two are not even on the same planet so to speak.  **A million or so dollars is but a wee drop in the oceans of trillions.** \n\n*When writing this I discovered that large numbers have different names in \"long scale\" and \"short scale\".* *I am using the \"short scale\" names for this discussion.* \n\nA million use to be part of the massive number club - but now it is a housing price. \n\nHowever, and most importantly, a billion and a trillion are such massive numbers, that most people don't realize just how significant the difference is between all three numbers - other than a comma or two and some extra zeros. \n\nUnits of time can make it easier understand on a personal level how massively the numbers increase rather than gradually.\n\n# 01 Thought experiment to visualize $100 thousand as a starting point to compare one million, one billion, and one trillion:\n\n**“If you saved $100k a year with no taxes, no spending, and no interest - it would take you:** \n\n* 10 years to become a millionaire, \n* 10,000 years to reach billionaire status, \n* 10,000,000 (yep million) years to reach trillionaire status.”  *Fun tidbit - Jeff Bezos is expected to become the world’s first trillionaire in 6 years.*\n\n**The Math with lots of zeros:**\n\n* 10 years multiplied $100,000 per year = $1,000,000 (one million dollars).\n* 10 thousand years multiplied by $100,000 per year = $1,000,000,000 (one billion dollars)\n* 10 million years multiplied by $100,000 per year = $1,000,000,000,000 (one trillion dollars)\n\n# 02 Visualization with 1 second of time as a starting point to compare one million, one billion, and one trillion:\n\n* 60 seconds = 1 minute\n* One Hundred seconds = 1.67 minutes \\[100/60sec\\]\n* One Thousand seconds = 16.67 minutes \\[1,000/60sec\\]\n* One Million seconds = **11.57 DAYS** \\[1,000,000/60sec/60min/24 hours\\]\n* One Billion seconds = **31.71 YEARS** \\[1,000,000,000/60sec/60min/24hours/365 days\\]\n* One Trillion seconds = **317.10 CENTURIES** *(31,709.79 years)* \\[1,000,000,000,000/60sec/60min/24hours/365 days/100years\\]\n\n# 03 Thought visualization of a house price (no other fees inc.) as a starting point to compare one million, one billion, and one trillion:\n\n* A million ($1,000,000) - you could buy ten $100k homes and is one thousand more than one thousand. 10^(6)\n* A billion ($1,000,000,000) - you could buy one thousand $1Mil homes and is one thousand times more than a million. 10^(9)\n* A trillion ($1,000,000,000,000) - you could buy one million $1Mil homes and is one thousand times more than one billion. 10^(12)\n\n# 04 Stack 'em up. For those who think in visual terms of distance rather than quantity.\n\n[I heard you like green crayons](https://preview.redd.it/wj0y6wqquh671.jpg?width=576&format=pjpg&auto=webp&s=5ff758e113453c6b1492becd53cb142f6fb56c35)\n\nIf $1million in **$100** dollar bills stacks up to 40 inches (3.3 feet), and $1billion is 40,000 inches, $1trillion in $100 dollar bills is 40,000,000 inches high, which is 631 miles.\n\n**TL:DR** $Magnitude of 7 Floor is not a meme\n\nedit: The whole point of this was to demonstrate why you need to HODL and not get number fudded. And I forgot my damn tag line.  \n\n\nStay Shiny!  \nStay Hard!\n\nBuy Hodl, Chill",
    "title": "Wall Street is counting on people not truly comprehending the difference between million, billion, and trillion.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4glqb/wall_street_is_counting_on_people_not_truly/"
}