{
    "author": "Jizumonkey",
    "created_utc": 1624217784.0,
    "distinguished": null,
    "edited": false,
    "id": "o4d80x",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o4d80x",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/o4d80x/why_does_inflation_need_to_be_around_2_you_need/",
    "score": 1053,
    "selftext": "What does inflation mean to you?  The price of goods going up?  The 'value' of money declining over time?  It could be both these things but many years ago I saw a video on YouTube somewhat clickbaity titled ' The Most IMPORTANT Video You'll Ever See'; actually, it wasn't actually far wrong.\n\n[https://www.youtube.com/watch?v=F-QA2rkpBSY&list=PL580F6DB7401908BE](https://www.youtube.com/watch?v=F-QA2rkpBSY&list=PL580F6DB7401908BE)\n\nWhile there have been more modern attempts to explain the Rule of 72, this 4:3 VHS wonder has since been my favourite.   So what is it?  **Put simply, a way of knowing how long something would take, at a given percentage increase, to double in price, or equally how long it would take for your money to be worth half as much**, and worse yet, virtually nobody on the street understands the power of exponentials (percentage rises rather than linear rises). \n\nBasically the Rule is: you take 72, divide it by whatever percentage increase you're looking at, and then you have your doubling period.  If you want to learn more, Google mofo.  [https://en.wikipedia.org/wiki/Rule\\_of\\_72](https://en.wikipedia.org/wiki/Rule_of_72)\n\nLet's just get on with some examples of this amazing trick!\n\n&#x200B;\n\nEXAMPLE 1)  My bank pays a measly 1% interest per annum.  How long would it take to double my savings purely on interest if I left it completely alone?  72/1 = 72 years.  Not a great return!\n\n&#x200B;\n\nEXAMPLE 2) The population of my town is 100,000 and the city planners say that population growth is around 5% a year, which the councillors are happy with.  How long before my town doubles in population size?  72/5= 14.4 years.\n\nExamples like this are what scare the shit out of me - population increases at rates that people just do not understand the danger of!!  Ask someone if they thought 5% growth is a lot and they'd probably say no.  Ask them if they want their town to have twice as many people, twice as much traffic, twice as many schools, twice as many amenities needed, etc. in FOURTEEN YEARS and most would consider that downright scary.\n\n&#x200B;\n\nEXAMPLE 3)  The price of a loaf of bread is £1 but I've been feeling the effects of inflation lately and believe it to be no less than 7%; much higher than the official figures!  The shop also seems to be raising prices every month...  How long at this rate before it doubles in price?  72/7 = 10 months.  On a low cost purchase like this, many won't notice but low earners surely will.  *Note: the 'period' here is months not years, simply because I rigged the question to be something other than years to fit a slightly different example in :)*\n\n&#x200B;\n\nI hope by now you get the picture.  Exponential rises (where you add percentages) are DANGEROUS.  So back to my original question: why does the bank / government aim to keep inflation at around 2% per annum?\n\nWell, my theory is that this is long enough to not feel a danger.  I'm sure you've all read the great DD's recently on the creation of money, and how debt is necessary to keep us enslaved?  Well 2% is easily hide able; it's quiet, reasonable, it even makes sense over time!  72/2=36.  With 2% inflation, things double in price every 36 years; that's a generation.  Does that sound reasonable?  It does to me!\n\nMy parents could say \"I remember when milk was 20p a pint\"! and 20-30 years later (give or take), nobody bats an eyelid that it's now 40p a pint.  \n\n&#x200B;\n\n**But what about when we hit genuinely dangerous levels.  More to the point, what are dangerous levels?**\n\n&#x200B;\n\nWell, we now know that at 7% PA, we're looking at goods doubling in price roughly every ten years, or the money you earn to be worth half as much when spending.  Ask yourself: am I likely to earn twice as much in that time to keep up with inflation?  Very unlikely if you have a regular job!  Does 7% therefore seem reasonable or unreasonable?  \n\nNow imagine the utter carnage that will be wrought with double digit inflation...\n\n&#x200B;\n\nEXAMPLE 4) Isn't it great that house prices keep going up - I'm going to be rich!!  At 20% growth per year, how long before that house you bought for £250,000 is going to be worth half a million?  72/20=3.5.  THREE AND A HALF FUCKING YEARS.  Maybe great if you're a home owner, utterly soul destroying if you're young and looking to get on the ladder.  A bubble that cannot continue.\n\n&#x200B;\n\nSo I hope you all now have a better appreciation of how potentially dangerous rises of anything above a few percent, can actually be!  Your future investments should aim to beat inflation no matter what or the nett result is that inflation eroded your stock pile.  (which is why many call quantitative easing as stealth theft)  If you've started planning what to do with tendies, this needs to be your primary aim.",
    "title": "Why does inflation need to be around 2%? You need - The Rule of 72.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4d80x/why_does_inflation_need_to_be_around_2_you_need/"
}