{
    "author": "jennysonson",
    "created_utc": 1618522802.0,
    "distinguished": null,
    "edited": false,
    "id": "mrosto",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mrosto",
    "num_comments": 150,
    "permalink": "/r/Superstonk/comments/mrosto/wake_up_max_pain_isnt_your_friend_shf_benefits/",
    "score": 1216,
    "selftext": "Mostly credit to u/catch_0x16 for pointing this out in the daily discussion. Kudos to him for having the balls that I didn’t have to mention about this. \n\nI was going to make a post regarding Max Pain last week but decided not to since everyone was so stuck on believing the long whales were behind it. Anyways what he says in his comment is quote: \n\n“I see a lot of confusion about max pain. For me it's quite obvious. Citadel are a Market Maker. They are selling the calls to gullible parties and making bank off the premiums. They are then using the darkpool-buy routing to manipulate the price down to keep it within max pain\n\nMax pain isn't the work of long whales, it's the work of Citadel Securities so that they can basically print money by selling call contracts that they know will never come ITM. They are going to keep doing this until someone changes the rules, or some huge catalyst (like Black Rock recalling all of their loaned shares) forces a buy-in.”\n\nTldr; MMs like Citadel are manipulating stock price to reach Max Pain to benefit off of premiums and not have to deliver shares. \n\n\n\nThis is why I’ve been skeptical of max pain since the beginning, everyones been pushing the concept that long whales are using it to bleed out the SHFs so their contracts are worthless but that honestly makes very little sense in the long run right now. IV is very low after almost a month of flat trading, it’s really a very opportunistic time for longs to drive the gamma squeeze. HOWEVER you cant just gamma squeeze off of options chains, you have to run the stock price up to compliment the options contracts and they work hand in hand going up. \n\nBut what if youre a MM thats making bank selling all these contracts every week and YOU (citadel) controls the order flow of buys/sells of about 40-60% of the US brokers. Lets say average volume of OI options of calls+puts are anywhere around 50k total per week, and avg cost is $5 if you were to calculate all the OTM OI volume when you reach max pain, that means the sellers of the puts/call premiums roughly ran away with $25million in premium for the week! (P.s these numbers are just made up for the example here). So here we have Citadel Kenny here who can control the stock price and keep selling option premiums to make money and fund his borrowing costs on shorting the stock and wait till someone forces him to cover (aka Papa Cohen with recalls or the SEC finally doing their job). \n\nNeed more numbers to explain why Citadel wants Max Pain? At the Height of the IV during the late feb/early march run to $350, premiums avg costs for even the $800 strikes on weeklies went for anywhere from $20-30 PER contract, you be freaking drooling if youre a options seller cause that premium is freaken insane $$. Dont get me started on the $300-400 strikes that were going for $60-80 per contract during those weeks of the run up. That meant anyone that sold calls/puts during the month of march made $$$ at “max pains” they probably ran off with $200-300MILLION in options premiums possibly weekly between the OTM options that didnt make it. \n\nFor Example (numbers are not directly reflective of what actually is but just to show the point) : \n\n50000 OI contracts x 100 shares x $30 avg price per contract = $150million in premiums \n\nThese guys dont hold their option contracts for long, they buy calls/puts, move the share price and then sell off possibly within the same day or two and profit off the volatility in price movements. \n\n\nYou apes must be fking tired right now, but bare with me a little longer: \n\nNeed more reasons why I believe Max Pain is what the SHFs want? We all know back in Jan. Melvin was the main publicly known shorters of GME. They eventually got bailed out by Citadel Ken Griffon for $2 billion. Now another known shorter that is in on trying to put down GME and also helped bail out Melvin in Jan was Point72, whose owner Steve Cohen was the boss of Plotkin when he was working under him before starting Melvin Capital. \n\n“Yeah yeah we know this so what?” - okay so this Steve Cohen guy is a ruthless hedgie known to use ruthless tactics to bleed out options traders and basically control the price however he wants while making bank on selling premiums to them.\nHow does he do that? He creates huge sell and buy walls that drive prices up and down to counter the opposite movement, as a result the price remains FLAT. Sounds family? Big buy walls and sell walls, trading flat, max pain?? Now this Steve Cohen ( the bad cohen) is buddies with Kenny Griffon, so why not get him in on this strategy and make bank on premiums while everyone thinks youre just bleeding from the shorting costs? \n\nSo what do we so?\n\nJust HODL 💎💎🙌🏻🙌🏻. \nEventually we will have a catalyst to run the price up and hit gamma squeezes. But we need the long whales to figure out how to beat the exchange and FTD manipulation or any catalysts like\n1. Share recalls\n2. SEC doing their job \n3. DTCC margin calling those bichtes\n4. Sheer volume (in the triple digits) of retail buying\n5. CEO?? Papa?\n\nTldr: Max Pain is probably Shorts bleeding out option holders and benefitting off selling as Citadel is a big MM. Max pain means driving IV down and keeping share price from gamma squeezing. We have the DD already, the squeeze is coming, don’t worry about Max Pain and the options chains, too complicated for Apes. Just HODL and wait for Papa Cohen to make Gamestop a 100billion dollar company 🚀🚀🚀🙌🏻🙌🏻💎💎",
    "title": "Wake Up - Max Pain isn’t your friend. SHF benefits from MP more than the LongWhales at this point.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/mrosto/wake_up_max_pain_isnt_your_friend_shf_benefits/"
}