{
    "author": "Criand",
    "created_utc": 1624268164.0,
    "distinguished": null,
    "edited": 1624342754.0,
    "id": "o4rfnu",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o4rfnu",
    "num_comments": 1275,
    "permalink": "/r/Superstonk/comments/o4rfnu/the_fed_is_pinned_into_a_corner_from_the_2008/",
    "score": 22924,
    "selftext": "&#x200B;\n\n# 0. Preface\n\nI am not a financial advisor. I do not provide financial advice. Many thoughts here are my opinion, and others can be speculative.\n\nI'm personally happy to see that there is a shift from GME DD to macro-economics DD. Because it provides a much wider insight into how the market is behaving, and how GME would **NOT** be the cause of a market crash. Everything has been a pressure cooker over the past decade, ready to burst, and the new DD provides insight on when things might go down.\n\nThe new DD also diverges from the expectations of things to shoot up in price every week, where everyone is watching T+21/T+35/Net Capital cycles. It gives a general \"MOASS will most likely occur when everything falls due to liquidation of defaulting Banks / Hedge Funds / Financial Institutions\".\n\nIt gives me peace of mind, because I do not watch for specific dates around GME to cause the surge. I watch the economy at the macro scale to understand when things could blow.\n\n**And to any skeptics - yes, it is possible that GME could never blow up. Do I think it will blow up? Sure I  do. But I encourage YOU to read this post, disregarding GME, and to instead understand what is going on with the economy on the macro scale.**\n\n**Even if the GME play is wrong in your eyes, it is good to understand how the economy could crash harder than it did in 2008. I don't care if you don't believe in GME. I care about you, and don't want YOU to be hurt.**\n\n[Me IRL - Maybe - Sometime](https://preview.redd.it/pscahu4lxk671.png?width=727&format=png&auto=webp&s=2e5ee31eaef0413023a8cc4be07087210081554c)\n\n# 1. Before We Begin: An Overview of Repo And Reverse Repo\n\nRepo and Reverse Repo might be a bit confusing. You probably saw on this subreddit or in news that the reverse repo market has been blowing up, and it's a bit concerning.\n\nIt's not too complicated if you just imagine it between two entities: the Federal Reserve and Banks.\n\nFor both Repo and Reverse Repo, it is an agreement between two parties for one of them to sell some security for a price, and they agree to buy that security back at a later date at a higher price based on some interest rate (usually). This is called a \"Repurchase Agreement\", where \"Repo\" is a standard \"Repurchase Agreement\" and the \"Reverse Repo\" is a \"Reverse Repurchase Agreement\", the inverse of a \"Repo\".\n\nThe length of these Repurchase Agreements can be various lengths. Such as overnight, one month, three month, etc.. But what we're seeing is **short-term** **overnight Reverse Repos**. The parties swap, and then the next trading day they swap back. **It is not a permanent extraction of the underlying security. It is an overnight swap. A permanent extraction comes from Quantitative Easing or Quantitative Tightening, both of which I will discuss later.**\n\n* **Repo (Repurchase Agreement)** \\- This is where the bank swaps collateral (such as US Treasuries) for cash. This is used when the banks have too much collateral and not enough cash, or when the banks want to generate profit off of giving loans to other parties in the repo market.\n* **Reverse Repo (Reverse Repurchase Agreement)** \\- This is where the bank swaps cash (liquidity) for collateral (such as US Treasuries). This is used when the banks have too much cash (liquidity) and not enough collateral. The main reason behind this behavior is to pump balance sheets for the night.\n\nBelow is a diagram I made which might make this more clear. It is between the Fed (left) and Banks (right):\n\n**Edit: I have a typo here. QT and QE should be flipped in the diagram. QT is permanent extraction of liquidity. QE is permanent extraction of collateral.**\n\n[Repo and QT Versus Reverse Repo and QE](https://preview.redd.it/ukum83cf2k671.png?width=1920&format=png&auto=webp&s=99d4c612df82013aed06ff2b22621500a80071cf)\n\n&#x200B;\n\n# 2. Quantitative Easing Can-Kick of 2008, Slowly Draining Collateral From The Market\n\nNote: If you want an overview of what led to the 2008 crash, check out [my previous post](https://www.reddit.com/r/Superstonk/comments/o0scoy/the_bigger_short_how_2008_is_repeating_at_a_much/) which has a summary of the documentary \"Inside Job (2010)\". It also describes where we're probably headed based on SLR, the DTC, ICC, OCC, NSCC rules, and mortgage default protections expiring June 30th, 2021.\n\nZoom back in time to 2008. The economy took a massive dump due to Wall Street's abuse of derivatives and leverage. They created a bunch of toxic CDOs mostly consisting of [subprime Mortgages](https://www.investopedia.com/terms/s/subprimeloan.asp) to create an economic apocalyptic scenario around Mortgage Backed Securities (MBS). Everything was overleveraged and was a massive balloon of bets based on the performance of the MBS's.\n\nCurrently, there's evidence of Wall Street doing the same abuse of toxic CDO's but this time with Commercial Mortgage-Backed Securities (CMBS). \\[See above linked post for this detail\\]\n\nThe economy was hurting pretty bad from the 2008 crash, and it was going to continue going into a complete death spiral until the Federal Reserve (Fed) introduced Quantitative Easing (QE):\n\n>The Fed announced QE1 on November 25, 2008. Fed Chairman Ben Bernanke announced an aggressive attack on the financial crisis of 2008. **The Fed began buying $500 billion in mortgage-backed securities and $100 billion in other debt**. QE supported the housing market that the subprime mortgage crisis had devastated. - [Source](https://www.thebalance.com/what-is-qe1-3305530)\n\nIf you're still scratching your head on what QE is, here's the Wikipedia overview definition, as well as (hopefully) a more simplified definition.\n\n[Quantitative Easing](https://en.wikipedia.org/wiki/Quantitative_easing) (QE) -  is a monetary policy whereby a central bank purchases at scale government bonds or other financial assets in order to inject money into the economy to expand economic activity.\n\n* This is what the Fed will do to extract collateral (including US Treasuries) from the economy in order to push in liquidity. The Fed started doing this in 2008 to extract toxic collateral from the market and encourage economic growth because it allowed more cash flow in the economy.\n* This pulls out collateral from the economy, and pushes cash (liquidity) in.\n* **It was a ticking timebomb ever since it started, because it extracts collateral from the market, slowly creating a collateral shortage issue.**\n\nCheck out the effects of QE on the Dow Jones Industrial Average ($DJI):\n\n[DJI Before And After Quantitative Easing Begins](https://preview.redd.it/cktjwttu8k671.png?width=1528&format=png&auto=webp&s=4e23f2e54e6204d8c56323d7e6bc8772c1a02535)\n\nIt was helping the economy reverse the death spiral, and it has been pumping the economy ever since the introduction of QE. The problem is, of course, that collateral would continue to be sucked out of the market through the mechanics of QE.\n\n**And QE can't continue forever**, because collateral is a fundamental part of the repo market which allows cash to flow in the economy. When you don't have collateral, you can't post the collateral in the market for cash from banks, and thus the flow of cash basically shuts down. You cannot perform a normal repo transaction between a Bank / Hedge Fund / Financial Institution.\n\nThe Fed tried to stop QE after a while. Instead of pulling collateral out of the economy, they needed to try to push collateral back into the economy. In order to stop QE, they tried what was, in essence, the \"reverse\" of QE called Quantitative Tightening (QT).\n\n[Quantitative Tightening](https://en.wikipedia.org/wiki/Quantitative_tightening) (QT) -  (or quantitative hardening) is a contractionary monetary policy applied by a central bank to decrease the amount of liquidity within the economy. The policy is the **reverse of** **quantitative easing** **(QE)**, aimed to increase money supply in order to \"stimulate\" the economy.\n\n* This is what the Fed will do to extract liquidity from the economy in order to push in collateral. It is used to attempt to reverse the effects of QE, to try to regain balance in the economy.\n* This pulls out cash (liquidity) from the economy, and pushes collateral in.\n* **The Fed attempted QT in 2018, but it proved to have very bad consequences on the economy. So, they went back to QE in 2019, continuing to can-kick the effects of the 2008 crash.**\n\nThis is a chart showing the Fed's \"Total Assets\", where collateral is an asset for the Fed. So when collateral was extracted from the economy through QE, it went onto their \"Assets\" side of their balance sheet.  When collateral was pushed back into the economy through QT, it was extracted from their \"Assets\" side of their balance sheet.\n\n1. At the start of QE in 2008, there is a surge of assets due to the buying up of MBS's and treasuries.\n2. Around 2018 the assets began to decline because the Fed attempted QT by pushing collateral back into the economy and sucking liquidity out.\n3. Around September 2019 the assets began to increase again because the Fed went back to QE after realizing the negative effects it was having on the economy due to causing a liquidity shortage.\n\nSo... what happened in September of 2019? **Why did QT fail after a decade of QE**?\n\n[https:\\/\\/www.federalreserve.gov\\/monetarypolicy\\/bst\\_recenttrends.htm](https://preview.redd.it/x6pfomz2ck671.png?width=893&format=png&auto=webp&s=1c667c5cc3dbc94de50944208f107aac1dd72d73)\n\n# \n\n# 3. Quantitative Easing Cannot Be Reversed. The Can-Kick Continues Until The Economy Crashes\n\nDespite pumping in a bunch of liquidity into the market through QE, the economy was **still lacking liquidity**. When the Fed started to reverse QE through QT, the liquidity in the market tightened and thus the negative effects on the economy began to surface in September of 2019.\n\n[https:\\/\\/blog.pimco.com\\/en\\/2019\\/09\\/repo-rate-spike-a-tail-of-low-liquidity](https://preview.redd.it/9sd32gdxdk671.png?width=630&format=png&auto=webp&s=0ee9d749419bc2b6c0a84682f6f9b0b886ceca93)\n\n**Less than a year after starting QT**, a liquidity crisis emerged on September 15th, 2019, when the repo rate spiked up severely. This was a clash of events surrounding the lower liquidity issue.\n\n>Banks’ “reporting” dates are known inflection points in the short-term funding markets and typically fall at the end of the month, quarter, and of course the year. **But periodically, the 15th of the month is also a pressure point**. Such was the case this past Monday when a short-term funding rate that had been hovering around 2.21% soared as high as 10%.  \n>  \n>The funding market succumbed to a trifecta of pressures:\n\n1. Payments on corporate taxes were due on 15 September, leading to high redemptions of more than $35 billion in money market funds.\n2. Cash balances increased by an additional $83 billion in the U.S. Treasury general account, which reduces excess reserves and simultaneously acts to reduce the aggregate supply of overnight liquidity available in funding markets.\n3. Dealers needed an additional $20 billion in funding to finance the settlement of recent scheduled U.S. Treasury issuance.\n\n>...  \n>  \n>...  \n>  \n>On September 15, **as so many institutions needed funding**, **repo rates climbed well above the fed funds upper-end target at the time of 2.25% to briefly touch 5%.** **The following day, cash repo markets traded as high as 10% for those looking to finance agency mortgage positions overnight**. **Later that morning, the Federal Reserve Bank of New York acknowledged the pressures and conducted its first Open Market Operation (OMO) in more than a decade to add reserves to the funding markets that were clearly in need of the liquidity**. Subsequently, after its meeting Wednesday, the Federal Open Market Committee (FOMC) announced a cut in the interest on excess reserves (IOER) of 0.30% – five basis points more than its cut in the fed funds rate – providing some relief to the upper bound of money-market yields.  - [Source](https://blog.pimco.com/en/2019/09/repo-rate-spike-a-tail-of-low-liquidity)\n\nDue to the reduced liquidity from QT, because it sucks out liquidity and pushes in collateral, the markets hit a critical point where there was too much cash that was needed and not enough to supply those who needed the cash. There was huge amounts of strain on the economy.\n\nThis was most likely due to continued large leverage + derivatives abuse stemming from what led to the 2000-2007 Housing Market Bubble. The Fed realized that QT could not continue because of the liquidity shortage that was arising. **They had to stop QT and continue QE in order to continue to pull out collateral and pump in liquidity. And thus, the collateral shortage time bomb continued ticking.**\n\nBelow is the figure of when the repo rate shot up to \\~10% within a day. This was awful, because it was much more expensive for loans to go out. The repo market would have shut down from nobody wanting to spend 10% on a repurchase agreement to get cash for the day. How would ANYONE get 10% return **overnight** to pay for these loans? The flow of cash was about to halt.\n\n[https:\\/\\/www.federalreserve.gov\\/econres\\/notes\\/feds-notes\\/what-happened-in-money-markets-in-september-2019-20200227.htm](https://preview.redd.it/86p3getwwj671.png?width=771&format=png&auto=webp&s=2a503c9055d655f80557da8bf46744c205f60011)\n\n# \n\n# 4. COVID Initiated A Liquidity Crisis In The Banks, Which Now Fights With The Collateral Shortage\n\nQE continued on until 2020, when suddenly, COVID came in. Nobody expected it.\n\nAnd boy, **oh boy**, did COVID wreak havoc on the economy and the financial world. While the Fed was slowly approaching a collateral crisis through QE, COVID exacerbated the issue due to the sudden impact it had on liquidity. COVID increased liquidity, and when you have a sudden surge of liquidity, you need to balance it with collateral. The economic balance was tipping as of March of 2020.\n\nThis does not even take into account the effects of many people losing their jobs, being unable to pay rent/mortgages, and other issues that arose from COVID. Those all apply to another ticking time bomb: the CMBS issue, equivalent to the MBS bubble of 2000-2007, which I discussed in my other post.\n\nThe COVID pandemic caused a surge of money being printed from stimulus packages in the US. When you print a bunch of money into the economy on a whim, you risk driving inflation of the currency itself. What does inflation encourage? Less spending from companies, due to the higher price. This leads to less loaning of cash in the repo market, and banks obtaining an ever-surplus of cash.\n\nCOVID caused a sudden surge of trillions of dollars worth that the economy couldn't handle naturally. Compare the treasury balance versus the deposits over time, and the surge that occurred in 2020 in response to the pandemic. The COVID stimulus bills pumped in a **massive** amount of money into the economy at the risk of inflation. And we're already seeing the effects of inflation occur on the [supply chain](https://www.businessinsider.com/why-supply-shortages-economy-inventory-chips-lumber-cars-toilet-paper-2021-5):\n\n[https:\\/\\/www.federalreserve.gov\\/monetarypolicy\\/bst\\_recenttrends.htm](https://preview.redd.it/amwahlvykk671.png?width=877&format=png&auto=webp&s=1e343c265451a1b2d6754a4d04971bb445e58f43)\n\nStimulus checks were sent out to retail. Companies were bailed out. Unemployment increased, resulting in more unemployment benefits going out due to the relief bills. More money printed. More money deposited at banks.\n\nThere was a ton of cash (liquidity) being pumped into the economy over the past year from March 2020 to June 2021. Because of this, due to inflation and an excess of cash, banks began to get a surplus of cash deposited. People had more cash. They didn't need to spend money on rent/mortages. Companies didn't want to spend more due to fears of inflation. So, bank deposits went up.\n\n**The main problem with this is that the cash deposited with the banks became a liability on their balance sheets. When you have a surplus of liabilities on your balance sheet, you need to 'balance' it out with assets, such as US Treasuries.**\n\nThe banks were now in trouble because they had way, way too many deposits. They were at risk of defaulting due to their SLR requirements. Here is a figure showing how deposits (liabilities) of banks increased over time. It mushroomed during the COVID pandemic:\n\n[https:\\/\\/www.ft.com\\/content\\/a5e165f7-a524-4b5b-9939-de689b6a1687](https://preview.redd.it/6dm07sa3oj671.png?width=891&format=png&auto=webp&s=9acce6ceb03841c64828198eefff21eb06b1e310)\n\nTo combat this issue, the Fed decided to introduce a relief program for banks regarding SLR because of the massive increase of liquidity due to the uppercut that COVID created on the financial world.\n\n>The supplementary leverage ratio (**SLR**) is the US implementation of the Basel III Tier 1 leverage ratio, **with which banks calculate the amount of common equity capital they must hold relative to their total leverage exposure**. Large US banks must hold 3%. Top-tier bank holding companies must also hold an extra 2% buffer, for a total of 5%. The SLR, which does not distinguish between assets based on risk, is conceived as a backstop to risk-weighted capital requirements. - [Source](https://www.risk.net/definition/supplementary-leverage-ratio-slr)\n\nIn more of a simplified summary, SLR is a requirement of total equity that a bank must hold compared to their total leverage exposure. If they are exposed to leverage, they need to hold enough capital for that position otherwise they are at risk of defaulting. In this case, they only need to hold a measly 3%-5%, dependent on how large of a bank they are. Just like in 2008 - these banks can have massive leverage and SLR is to \"help protect the economy\" from them abusing leverage.\n\nBut hey, the Fed put in place some protections for the year to help these banks since they were obviously overleveraged to begin with. These protections expired on March 31st, 2021.\n\n[https:\\/\\/www.fool.com\\/investing\\/2021\\/03\\/29\\/the-fed-is-ending-one-of-its-pandemic-relief-progr\\/](https://preview.redd.it/14pa4yngtj671.png?width=1433&format=png&auto=webp&s=534726bcf83b0bf40ede7b196191d66c29094d6e)\n\n>**The Fed's relief program last year allowed banks to exclude U.S. Treasuries and central bank reserves from the SLR calculation**. The relief program was a response to the many non-banking institutions selling Treasuries to raise cash, and coincided with other measures, including the $2.2 trillion CARES Act, which resulted in even more Treasuries being sold into the market. - [Source](https://www.fool.com/investing/2021/03/29/the-fed-is-ending-one-of-its-pandemic-relief-progr/)\n\n**Right after the expiration of the protection plans of SLR, the Reverse Repo market began to blow up because the banks had way too much liquidity and not enough treasuries on their balance sheets.**\n\nThe argument that the banks were \"parking their money at the Fed\" was a reasonable explanation at first. Though, with 0% ROI from the RRP at the time, the banks would literally get no return on their investments. So for that argument, all of their other investments would have had to yield negative in order for RRP to be more enticing. Does this make sense to you that they'd use 0% RRP to be an 'investment'?\n\nThe fact that the RRP began to ramp up and then explode after the SLR protections lifted makes this look like a collateral shortage issue. And of course, with QE occurring over the past decade, makes it more likely, because collateral was sucked out of the economy and onto the Fed's balance sheet over the years.\n\n**That was of course questionable on whether it was a liquidity or collateral issue, until, the RRP rate dropped negative in March of 2021, as well as in April of 2021.**\n\n&#x200B;\n\n# 5. Reverse Repo Rate Flips Negative; Warnings Of Collateral Shortage\n\nThink about it quite simply in a supply/demand factor and the reverse repo when the RRP rate dropped negative.\n\nYou are a bank. You want to get Collateral from the Fed to balance your sheets. The Fed says they'll give you a small amount of interest for borrowing their collateral overnight. But now, imagine that the supply of collateral is too low and demand is too high. The Fed will no longer want to pay you for borrowing its collateral so it will shift the interest rate down. If demand really outweighs supply, then the Fed would then want cash from YOU in order for YOU to borrow the collateral.\n\n[https:\\/\\/www.reuters.com\\/article\\/us-usa-bonds-repo-explainer\\/explainer-u-s-repo-market-flirts-with-negative-rates-as-fed-seeks-to-absorb-excess-cash-idUSKBN2C32AI](https://preview.redd.it/eysh9mx9ok671.png?width=961&format=png&auto=webp&s=4d9d1695922b01651eae06c6bcc2753ad0f5b789)\n\nThis was just one of the warning signs that a collateral issue was arising. The RRP rates were already at 0%, so the only way for them to move was either up or down. An increase in treasury demand could shift it down, into the negatives, which it did.\n\n&#x200B;\n\n# 6. The Fed Is Fudging The Numbers And Hiding A Collateral Shortage\n\nThe drop in RRP interest rates to the negative **came after** the Fed increased the total borrowing amount of counterparties in the RRP from $30 Billion to $80 Billion.\n\n[https:\\/\\/finadium.com\\/fed-increases-rrp-limits-from-30-billion-to-80-billion-to-ensure-supply-at-near-0-rates\\/](https://preview.redd.it/by2ftlpopk671.png?width=1028&format=png&auto=webp&s=747f50e2fb63aabaedb6e9e947aa117f6c75f91b)\n\nWhy did they do this? Think of it again as a supply versus demand issue. For simple math, imagine the Fed has 50 members.\n\n* At a limit of $30 Billion per member, that is a total of $30B \\* 50 = $1.5 Trillion that can be borrowed.\n* At a limit of $80 Billion per member, that is a total of $80B \\* 50 = $4 Trillion that can be borrowed.\n\nWhat is this doing? Why did the Fed increase the limit?\n\n**It's artificially inflating the total \"supply\" of treasuries that can be borrowed by counterparties in the RRP. It is attempting to keep the interest rate positive because there is so much demand for collateral and not enough supply in the markets and on the Fed's balance sheet. The RRP was already at 0%, there was nowhere for it to go besides negative, which as you know implies a shortage of collateral and a red flag for the financial world.**\n\nNot only did they artificially inflate the total supply to combat the demand by increasing the total borrow amount, **the Fed decided to not affect the assets side of its balance sheet during these RRP transactions**. **This effectively leaves the supply of treasuries on the Fed's balance sheet the same.** This is another method to can-kick to avoid interest rates going negative and flashing a collateral issue.\n\n>When the Desk conducts RRP open market operations, it sells securities held in the System Open Market Account (SOMA) to eligible RRP counterparties, with an agreement to buy the assets back on the RRP’s specified maturity date. **This leaves the SOMA portfolio the same size**, as securities sold temporarily under repurchase agreements continue to be shown as assets held by the SOMA in accordance with generally accepted accounting principles, but the transaction shifts some of the liabilities on the Federal Reserve’s balance sheet from deposits held by depository institutions (also known as bank reserves) to reverse repos while the trade is outstanding. - [Source](https://www.newyorkfed.org/markets/rrp_faq/rrp-faq-archive/rrp-faq-200715)\n\nWe can see this visually from the Fed's balance sheet that they're not affecting their assets during the RRP. They're allowing counterparties to borrow treasuries **WITHOUT** affecting the supply - desperately trying to get away from the rising demand for treasuries and avoid treasury yields from snapping down (and likewise the price of treasuries up):\n\n[https:\\/\\/www.federalreserve.gov\\/monetarypolicy\\/bst\\_recenttrends.htm](https://preview.redd.it/evxua80crk671.png?width=893&format=png&auto=webp&s=6a925b05e7a460b252457923ca97c730c511da6b)\n\n**On top of this, the Fed showed their hand ONCE AGAIN of fudging the numbers on June 16th when they bumped up the RRP rate to 0.05%. The short-term treasury yields briefly went BELOW the RRP interest amount of 0.05% on June 17th when the new RRP ROI was in effect.**\n\n**This is a BAD sign because now overnight RRP had a higher return than 2-month and 3-month treasury bonds.**\n\n**The Fed is fudging the numbers trying to hide the treasury bond shortage.**\n\nThe Fed cannot keep this up. They're trying to keep the T-bill yield curve propped up despite the treasury shortage. They're not affecting their balance sheet, and they also artificially increased the amount of treasuries in their \"supply\" by increasing the counterparty borrow limit from $30 Billion to $80 Billion.\n\n[https:\\/\\/alhambrapartners.com\\/2021\\/06\\/17\\/the-fomc-accidentally-exposes-itself-reverse-repo-style\\/](https://preview.redd.it/sp52qka5tj671.png?width=858&format=png&auto=webp&s=69d7ec8971035a7939f7bed116f7c923215019d6)\n\n[https:\\/\\/www.treasury.gov\\/resource-center\\/data-chart-center\\/interest-rates\\/Pages\\/TextView.aspx?data=yield](https://preview.redd.it/1f64o77tsk671.png?width=972&format=png&auto=webp&s=48e83c02895066c4e300c5a8adf3d3a065a6b016)\n\nThe Fed is also planning on increasing interest rates. This starts to scare the economy, which is most likely why we're now seeing the dump of the stock market over the past few days and the dump leading into the week of June 21st. This is **bad for the markets** because it means it's going to cost more for the economy to function (e.g. what happened in 2019 when Repo Rates spiked to 10%). Companies have to spend more to hire, produce, etc. **It costs the economy more to function.**\n\n**The Fed is pinned between a collateral issue from QE sucking out collateral, and a liquidity issue and COVID pumping in too much liquidity for the banks to handle.**\n\n[https:\\/\\/www.cnbc.com\\/2021\\/06\\/16\\/fed-holds-rates-steady-but-raises-inflation-expectations-sharply-and-makes-no-mention-of-taper.html](https://preview.redd.it/uhhhzguotk671.png?width=1202&format=png&auto=webp&s=cab32cef615311320c6cf27461fa7fb18b0fc7af)\n\n[https:\\/\\/www.bbc.com\\/news\\/business-57090421](https://preview.redd.it/p0v9ij2b0k671.png?width=1013&format=png&auto=webp&s=bf8f525bfc55e8f1287e921bbaaa408c5c27a253)\n\n# \n\n# 7. Quarter Ends Explode The Reverse Repo. The Next Quarter End Is June 30th, 2021.\n\nThis is not a date to look forward to for GME potentially rising. This is a date of \"Holy shit. **The RRP could explode to the point where treasury supply vs demand is unable to take it any more**\".\n\nAbout 3-4 days prior to quarter ends, the RRP explodes up in the amount of collateral that is borrowed from the Fed. This is because of the underlying plumbing of the financial markets, identified in Section 3 above, causes additional strain on the financial markets. The banks need more collateral to prop up their balance sheets for the night of the quarter-ends.\n\nThe RRP borrowed amount can shoot up almost **2-4x the current levels.** The amount of RRP at the moment is $747 Billion. **The RRP could explode 2-4x the amount it is at upon June 25th, 2021**. What if it's $1 Trillion by then due to the massive amount of collateral needed by the banks? More?\n\n**Can the Fed handle it?**\n\n**Can they still prop the yield curve up?**\n\n**Will the short-term treasuries dip below the RRP amount once more due to this shortage and flash red flags to the world of financial instability in the US?**\n\n[https:\\/\\/www.reddit.com\\/r\\/Superstonk\\/comments\\/nylihz\\/previous\\_rrp\\_behavior\\_on\\_quarter\\_ends\\_massive\\/](https://preview.redd.it/63daa1s8gk671.png?width=1277&format=png&auto=webp&s=d04d4a6b577152d26d6f7ea6e0c31f05f7ce80dc)\n\nIf the US Treasury yield curve snaps down from this instability and the Fed no longer able to prop up the yield curve, then it can drive treasury prices up.\n\nIf /u/atobitt's \"[Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\" is true and they're actually shorting treasuries, then that can lead to banks defaulting due to the price of treasuries shooting up. When they default, they'll be forced to buy up all the treasuries that they've shorted into the market.\n\n**And it is very possible that they are shorting treasuries.**\n\nWhen performing RRP of 0%, the repo market was most likely shut down due to nobody needing cash loaned out. The banks only profitable move was to perform the RRP with the Fed and then **short** treasuries into the market, **rehypothecating** the treasuries to other parties. This would have also helped prop up the market by artificially increasing the supply of treasuries (collateral) in the market.\n\nIf it's true, and they have truly been performing the \"Everything Short\", then it could initiate a Global Financial Crisis equivalent to The Great Depression.\n\nDo I want that to happen? **No**. But is there a chance? **Yes, there is**.\n\nIs GME going to squeeze? Is the DD just false hopium? I don't think it's just hopium. I believe in the DD.\n\nBut some users might think otherwise and not believe in GME or the DD. Hello users outside of /r/superstonk! If you're reading this, check out the DD on the subreddit!\n\nEven if there's a **slight** chance of a GME squeeze in **your** eyes, and all of these signs are pointing to a market crash...\n\n[Why not give it a shot](https://www.youtube.com/watch?v=l4nSHsbFe-o)?",
    "title": "The Fed is pinned into a corner from the 2008 can-kick utilizing QE, and the economic effects of COVID. They are stuck battling a collateral crisis AND a liquidity crisis. The Fed is currently fudging the numbers of treasuries to hide a collateral shortage and to try to prop the economy up.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4rfnu/the_fed_is_pinned_into_a_corner_from_the_2008/"
}