{
    "author": "_Badtothebone_",
    "created_utc": 1624273457.0,
    "distinguished": null,
    "edited": false,
    "id": "o4slo3",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o4slo3",
    "num_comments": 177,
    "permalink": "/r/Superstonk/comments/o4slo3/the_obv_does_not_lie_the_chart_overlay_shows_the/",
    "score": 5745,
    "selftext": "Yo Yo Yo waddup Apes!, Boner here...again, Coming at you with yet another OBV update post. Lets dive right into it shall we?🚀\n\n&#x200B;\n\n[HODL THE LINE](https://preview.redd.it/we26nphx9h671.jpg?width=828&format=pjpg&auto=webp&s=d562f5b6c646597d7a94a0174ac13a610a273da1)\n\nSo after many many requests I have made the post everyones been asking to see... \n\nHere is an overlay of the OBV and the GME chart!\n\nLet's take a gander at it and talk about what we're seeing!\n\n&#x200B;\n\n[180 day chart for GME\\/ 180 day OBV overlay](https://preview.redd.it/yutnkl2bah671.jpg?width=828&format=pjpg&auto=webp&s=25ef9bebbc2952ea3f2321a3ec1f3b7124cbc623)\n\nWhat you have laid your eyes on is the 180 day chart for GME,  The purple line you're looking at is the 180 day OBV (On balance volume) line. Now as you can see here the price of GME has fluctuated up and down drastically... or has it? Well from what the OBV tells me is that the price in theory should not have gone down at all.... according to the OBV the price has only gone up because of positive buying volume and or stayed stagnant sideways due to Diamond Hands. This tells us no one is selling and the Apes are HODLing their shares with there rock solid diamond hands. The hedge funds are manipulating the price to break lower on our chart; (more on this later). On the hedge funds charts the price of GME could be exponentially higher than what we see. Obviously this is speculation but something fishy is going on here.... \n\n&#x200B;\n\n\"How could hedge funds keep the price of GME down if there is mostly positive buying volume?\"\n\n&#x200B;\n\n[Vlad the stock impaler](https://preview.redd.it/52ig8y1nbh671.jpg?width=828&format=pjpg&auto=webp&s=700db55a05898ee4e8d69ca1f0d253481e7d0a3d)\n\nAs I have said in my previous post...\n\nThats because there is actually buying pressure outweighing the selling pressure or coming damn near close to being even! \n\n\\-There are many great DDs out there explaining how hedgies use ETFs to short gamestop. In my opinion I believe the OBV is indicating that YOU, the Diamond Handed apes are HODLING your shares and buying more that the OBV is staying up do to holding and buying pressure, and it proves that the price is indeed WRONG! \n\nHedgies are shorting gamestop through ETFs/ Dark Pools to artificially deflate the price, this keeps the price of GME down temporarily until they stop, once they stop shorting ETFs, GME begins uptrending because of buying pressure. Therebare no more shares available to short in Gamestop so they resort to shorting ETFs like Xrt which is a big one. this does not effect the volume on GME because the hedgies are shorting ETFs, not GME directly, therefore the price of GME deflates but the OBV is showing otherwise. This is only a temporary fix for the hedgies. They are FUK either way.\n\nThis leads me to believe the price is 100% WRONG! Hedgies are trying to get Apes to paper hand and sell. And Apes are proving that it takes nothing to HOLD, and costs them everything to kick the can down the road.\n\nIf you would like to learn more about the OBV and how it works please feel free to visit my original post\n\n[https://www.reddit.com/r/Superstonk/comments/o0fxnk/obv\\_does\\_not\\_lie\\_gme\\_at\\_217\\_obv\\_still\\_rising\\_the/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/o0fxnk/obv_does_not_lie_gme_at_217_obv_still_rising_the/?utm_source=share&utm_medium=web2x&context=3)\n\nI hope this helps any questions you may have!\n\nThank you all for taking the time to read and hope it helped!\n\n&#x200B;\n\n[Remember DIAMOND F\\*CKING HANDS](https://preview.redd.it/56bcsq9tch671.jpg?width=828&format=pjpg&auto=webp&s=1d990b8238e9f29d3416ed57b121de54281d8205)\n\n📈As for me, I like the stock📈\n\n🐻Hedies R Fuk🐻\n\n🚀🦍See you on the moon Apes 🦍 🚀\n\n\\-Boner out✌️\n\n(If i missed something or if anyone has info to add please leave it in the comments or DM me and i can add it)  \n\n❌Obligatory: \\*not financial advice\\*❌",
    "title": "THE OBV DOES NOT LIE. The Chart Overlay Shows📈. The Price is Wrong.💎🙌HODL!🚀",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4slo3/the_obv_does_not_lie_the_chart_overlay_shows_the/"
}