{
    "author": "too_techie",
    "created_utc": 1626914618.0,
    "distinguished": null,
    "edited": 1626914773.0,
    "id": "op318i",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_op318i",
    "num_comments": 564,
    "permalink": "/r/Superstonk/comments/op318i/i_believe_change_is_coming_to_the_sec_very_soon/",
    "score": 7585,
    "selftext": "So let's talk about the SEC and enforcement or lack thereof this year.  The Director of Enforcement hand picked by Gary Gensler when he took over was a lawyer named Alex Oh.  After only 4 DAYS ON THE JOB she abruptly resigned and left the SEC.  She cited complications from her past...but the unsubstantiated rumor was that someone big on Wall St had something on her and was leaning on her.\n\nIt's important to point out here that the job of Director of Enforcement has been a cancer to investors.  It has been a longstanding tradition that every 4 years the position would be awarded to a popular Wall Street defense lawyer.  (Gary Gensler's first choice Alex Oh, had spent over 20 years as a Wall Street defense attorney.....so...yeah.)  These are the people who make millions of dollars in a practice DEFENDING the very scum who have been manipulating our beloved stock, getting them out of trouble and evading justice/perpetuating our fucked up broken financial system.\n\nAs a result, these entrenched attorney-client relationships create MASSIVE conflicts of interest, but have always been ignored and result in sweetheart deals, insignificant fines and slaps on the wrist for the real bad guys on Wall Street.  That ends now.\n\nFor the first time, a SEC Director has appointed a real reputable badass prosecutor actually suited to do the job without any conflicts of interest.\n\nIn only 5 days, the Attorney General of NJ, Gurbir Grewal (just resigned 5 days ago to accept this position) takes over as Director of the Enforcement Division at the SEC.  As the AG he was a badass and tough on crime.  Prior to that he was the Chief of the Economic Crimes Unit at the U.S. Attorney's office.  While in this role he concentrated on fighting white collar crime.  This isn't a guy who has been defending scumbags.  He has been prosecuting them.\n\nGrewal is a first generation American and was born and bred in New Jersey.  His hard working parents immigrated from India and Grewal is a Sikh.  He proudly wears a turban of the Sikh's faith called a dastār.  This symbolizes his devotion and commitment to his God and his honor/integrity.  This isn't a man who can be bought.  I typically am a pretty cynical, possibly even paranoid guy when it comes to Wall Street and the Government, but I am truly cautiously optimistic that we will see real change soon.\n\nTL/DR: New Director of Enforcement Gurbir Grewal takes over in 5 days.  Hedgies r fukt.This Sikh fucks.\n\n^(Disclaimer: No wrongdoing by Alex Oh is being alleged in this post.  I am impugning her chosen specialization and the previous conduct of those performing such a function as no concrete proof of wrongdoing is known to me personally as of the time of the posting.)",
    "title": "I believe change is coming to the SEC very soon",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/op318i/i_believe_change_is_coming_to_the_sec_very_soon/"
}