{
    "author": "Meticulous-",
    "created_utc": 1628091213.0,
    "distinguished": null,
    "edited": false,
    "id": "oxv73q",
    "text_only": true,
    "flair_text": "Resource 🔬",
    "name": "t3_oxv73q",
    "num_comments": 30,
    "permalink": "/r/GMEJungle/comments/oxv73q/the_wikapedia_website_is_live_a_resource_that/",
    "score": 572,
    "selftext": "# 0. TLDR\n\nI created a [website](https://verymeticulous.github.io/wikAPEdia/) for [wikAPEdia](https://github.com/verymeticulous/wikAPEdia) \\- an archive of GME DD, relevant information, resources, and more. **The website is currently in beta and I am looking for feedback and suggestions on how to improve this resource.**\n\n# 1. Overview\n\nI have been compiling, organizing, and archiving relevant GME content in Github since early 2021.\n\nThanks to you brilliant apes, I have been able to start creating common themes and compilations of due diligence for easier accessibility like [Deep Fucking Due Diligence](https://www.reddit.com/r/GMEJungle/comments/oo4lxz/deep_fucking_due_diligence_compilation_of/), [Resources](https://www.reddit.com/r/DeepFuckingValue/comments/oeu3gi/deep_fucking_resources_compilation_of_tools/), [Wealth Management](https://www.reddit.com/r/DDintoGME/comments/occ8j7/wealth_management_dd_compilation/), and now this website.\n\n**Note**\n\n>*For new and curious apes that stumble upon wikAPEdia*, I encourage you to read the content from the linked source at the top of each file. *This resource would not have been able to be created if it weren't for the many intelligent apes who have worked tirelessly to create and share their learnings.* ***They deserve your upvote!***\n\n# 2. What can I find on the website?\n\n## [Must Read/Serious DD](https://verymeticulous.github.io/wikAPEdia/)\n\nConstantly updated table of some of the most critical due diligence published by wrinkly-brained apes.\n\n## [Resources, Sites, and Tools](https://verymeticulous.github.io/wikAPEdia/resources.html)\n\nList of websites and tools to help you learn about the GME-saga or research due diligence.\n\n## [Wealth Management DD](https://verymeticulous.github.io/wikAPEdia/wealth-management.html)\n\nLearn how best to manage your tendies pre, during, and post MOASS.\n\n## [Regulations, What They Do, and Where to Find Them](https://verymeticulous.github.io/wikAPEdia/regulations.html)\n\nA singular place to find all regulations created by the DTCC, NSCC, etc. that are relevant to the GME-saga.\n\n## [Know Your Enemies](https://verymeticulous.github.io/wikAPEdia/know-your-enemies.html)\n\nAn in-progress series that dives deep into the major players and institutions involved in the GME-saga.\n\n## [Glossary of Common Terms and Acronyms](https://verymeticulous.github.io/wikAPEdia/glossary.html)\n\nDictionary of commonly used phrases, terms, and acronyms used in the GME-related subs.\n\n#  3. How to Help\n\nI am looking for feedback and suggestions on how to make the Github repository and the website more useful resources. Whether it's adding content, new features, or user-interface improvements, please DM me!\n\n**Disclaimer:** This is not financial advise, nor am I a financial advisor. I just like to organize things.",
    "title": "The wikAPEdia Website is Live! A Resource that Organizes and Compiles Due Diligence in One Spot!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oxv73q/the_wikapedia_website_is_live_a_resource_that/"
}