{
    "author": "HandshakeInMyPants",
    "created_utc": 1625423698.0,
    "distinguished": null,
    "edited": 1625436711.0,
    "id": "odqa38",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_odqa38",
    "num_comments": 136,
    "permalink": "/r/Superstonk/comments/odqa38/a_warning_regarding_741_and_gda_there_are_bad/",
    "score": 2033,
    "selftext": "I'm concerned about the speculation around 7:41. Sure this has lead to us learning about some interesting rules on the books re: liquidation, and we've found an interesting NFT company- that is *now claiming* that they aim to serve esports. \n\nMy point?\nThis is all speculation and what-ifs based off a Twitter timestamp. NOTHING MORE.\n\nBut our long titties are completely jacked, and we are using them to probe EVERY rabbit hole without considering that sometimes predators use these burrows to ambush unsuspecting prey.\n\nSo if we follow our confirmation bias to a party that is completely unrelated to both GME or Citadel, that thinks they may be able to take advantage of our titties, why would you ever expect them to not release some unofficial, vague bullshit on Twitter that is designed to mislead apes into thinking they are going to merge and become GMEs NFT branch?\n\nIf Ryan Cohen has a company in mind let ***him say it.*** Clearly and out loud.\n\nThe only hype we have to spare is for GME and RC. There is zero room here for hyping ANY other companies without rock solid confirmation that there's something in the works.\n\n\n**Edit:**\n\nQuestions that should be asked\n\nHow long has the GDA capital website been registered? And to whom?\n\nWhen did the \"Ape-friendly\" statement about wealth transfer show up on their site?\n\nWhen did they start pandering to Apes with pictures of the moon?\n\n^ Were these before or after our \"apes\" found their website?\n\nHow long have they been in the business of facilitating Esports?\n\nWhat do we know about Michael Gord and his connections?\n\nTo me without a ROCK-titty-jacking-solid unencrypted official announcement from RC about a real connection, this obvious pandering to Ape interests should be regarded with EXTREME SUSPICION.\n\nIn science we create a hypothesis and then we do our DAMNDEST to DISPROVE it. If it still floats after we've tried to poke a bunch of holes in it, only THEN do we start calling it a theory.\n\nSo let's use our jacked titties to poke some holes!\n\nI suspect whatever the answers are to these questions, they will deserve their own post- I look forward to seeing what the community can find!",
    "title": "A warning regarding 7:41 and GDA; there are bad actors out there unrelated to GME that will absolutely pander to Ape theories, and confirmation bias. We don't dance for ANYBODY except the direct unencrypted communication from Ryan Cohen.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/odqa38/a_warning_regarding_741_and_gda_there_are_bad/"
}