{
    "author": "The-Bodhii",
    "created_utc": 1625431093.0,
    "distinguished": null,
    "edited": 1625528316.0,
    "id": "odsjri",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_odsjri",
    "num_comments": 385,
    "permalink": "/r/Superstonk/comments/odsjri/excon_ape_here_i_have_some_shit_to_say/",
    "score": 3399,
    "selftext": "First and foremost, Happy 4th of July 🇺🇸 \n\nEdit2: **Happy Independence Day**\n\nOn this great day in this wonderful country that I love, I have been doing some thinking. I have been on this ride since January 28th. Literally bought in at the top. $469 a share. \nI’ve held through it all. Average down at $40 and have averaged back up. I hodl many more* shares now. \n\nNot once have I even considered selling. Not once. Not for a second. I have had 100% conviction since the first shares I bought. I read the DD. I stayed up for 72 hours straight when I discovered GME and everything surrounding it. I was in no matter what. \n\nNow here I am, 5 or so months later, and still holding and buying more when I can. These shorts don’t know who they are fucking with. I can wait motherfuckers. Oh, I can wait. I spent 3 1/2 years in prison. Yup. In California of all places. I waited 41 months just to breath free and fresh air. I can sit on the toilet for months if I have to. You know what I ate everyday that whole time? Top Ramen. Spreads (if you know you know). I scrubbed pots and pans in a fucking prison kitchen for $0.50 a day. I waited over 3 years to give my mom a hug (greatest lady on Earth. I love you, Mom 💜). \n\nI saved every penny in there. I got out of prison almost 4 years ago. I got a good job. I have changed my life in every way. Prison changed me. I am lucky. \n\nAnd then along came GameStop and all you crazy mf’s. When I got out of prison I thought I was going home. Not until I found my true family did I realize I found a true home. With all of you and with GameStop. This isn’t just a company anymore. It’s a family. It’s an idea. It’s a miracle in so many ways. This is what living is about. Making a difference! Fighting wholeheartedly in something you believe in. I believe in all of you and I know y’all believe in me and that makes me one proud idiot. \n\nThe shorts fucked with the wrong one this time. \n🎮 Power to the Players 🛑 \n\nViva La GameStop! See you on the moon Fam. I got your back. Always 🤝 \n\n\nLove, Dorvalis (aka Babushka)\n\n\n\nP.S. @ Kenny Boi Griffin: Fuck you. Let me catch you on the yard punk\n\nEdit: not sure what I missed but I see people commenting on the position statement in my post. I will remove it.* I don’t want to ruffle any feathers. I must have missed the memo.\n\nEdit3: thank you all so much for the support! This is exactly why I feel at home here and I love all you crazy apes! Also: thank you to the haters and critics, for reminding me that y’all still there ✌🏼",
    "title": "Ex-Con Ape here. I have some shit to say.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/odsjri/excon_ape_here_i_have_some_shit_to_say/"
}