{
    "author": "Skyman69420",
    "created_utc": 1621849346.0,
    "distinguished": null,
    "edited": 1621872064.0,
    "id": "nju2h0",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nju2h0",
    "num_comments": 271,
    "permalink": "/r/Superstonk/comments/nju2h0/its_been_said_a_million_times_but_i_will_say_it/",
    "score": 9784,
    "selftext": "GME is not a regular \"solid\" investment, a lot of apes have been following this for months and understand that this sittuation is bigger than you and me.\n\nIt's important to reiterate that investing in GME is not investing into a once in a life time opportunity for a short squeeze, it's a once in forever because when this blows up, we will never see anything like it again.\n\nThis is for all the new members who have joined Iver the weekend. The game plan is simple with GME, we buy the dips, we buy the peaks and we hold.\n\nWe don't get interested in the price because its wrong, we watch the price but we don't care about it until it hits $5000 (why such a low number like $5000?, because once GME hits $5000 then we will know everything we have read is correct and the MOASS will happen. $5000 is not the MOASS, $5000 is just the confirmation that it's coming)\n\nSo what happens when you hold past all the fuckery and the price reaches $5000? Not much, you continue to hold because we are just getting started. Apes are passionate about this cause and I trust every one of them and I believe they will not paper hand and sell for thousands. Again, GME is bigger than you and me.\n\nHow high will the price go? Fuck knows but I can assure you you will not lose money by investing in GME so.. Why not?\n\nUs apes like to set our floor at around $20 million per share (the floor is the minimum we sell at, the ceiling is unimaginably high). I hear you think \"$20million is abit ridiculous and childish, the price will never reach that high\", well, you could be wrong.\n\nIf/when GME hits a price of say €1500, then nothing can be done to stop of slow down the price jumping by 50% every hour for a week straight. It mightnt be a clean rise (as in we might see huge heights with huge dips, but we fucking hold).\n\nA lot of apes have the same mindset as me, its either all or nothing, we hold on for world changing money, not life changing money.\n\nLong story short, if your new here\n\nBUY, HOLD, VOTE (if you can)\n\n$20,000,000 is not a meme but you will need balls of steel to reach those heights.\n\nThis is gamestop.\n\nEdit: this is not financial advice....\n\nThis post is flared as opinion so everyone attacking needs to chill!\n\nAlso, everyone who's awarded and upvote, thanks so much! I did not expect that at all! ❤️",
    "title": "It's been said a million times but I will say it again. GME is for holding until the MOASS, not for making a quick profit and not for day trading.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nju2h0/its_been_said_a_million_times_but_i_will_say_it/"
}