{
    "author": "ShakeSensei",
    "created_utc": 1619607489.0,
    "distinguished": null,
    "edited": false,
    "id": "n0c82o",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_n0c82o",
    "num_comments": 529,
    "permalink": "/r/Superstonk/comments/n0c82o/gamestop_showed_their_true_colors/",
    "score": 8207,
    "selftext": "With the way they handled the share offering they showed their true colors and it is green crayons all the way baby. \n\nLet's recap what happened: \n\nGamestop announced an update to their previously announced share offering to be 3,5M shares with a maximum of 1B dollars. This equates to about 285 dollars per share. With this announcement they made EVERYBODY think they were going to sell at a price level at least close to 285 dollars, which turned out to be a giant head fake that everyone fell for. \n\nUsually a share offering is considered unfavorable (at least in the short term) for existing shareholders because it dilutes the share pool and drops the price. Especially in a heavily shorted stock like GME it allowes shorts to potentially cover at lower prices to diminish squeeze potential. The upside being that the company raises capital which in turn should translate to increased stock value over time. \n\nBUT nothing about GME is usual and RC knows (I would love to give him all the credit but I'm sure his team helped plenty with this play) that the stock price is being manipulated to stay in a certain price channel. The shorts are using high frequency trading algorithms to suppress the price and aren't covering so by leaking out the shares over time RC is using their HFT algorithms against them. The price doesn't drop because it's artificial, shorts aren't covering because they assume it's only their synthetic shares being algo traded leaving all of the 3,5M shares to be gobbled up by apes. \n\nAll of the upside of raising capital, none of the downsides of diluting the stock and allowing shorts to cover. Check mate. \n\nIt's truly a masterful play and it showed two things. \n\nIt showed GME is game. They showed that they are not just going to take it laying down to be messed around with by market manipulators like a play thing, they bite back. And I love it! \n\nIt also showed generosity, trust and commitment towards apes. They could have EASILY held out and sold for the full 1B if they wanted to but instead they chose a way that fully fuk the shorts and empowers the apes at the cost of leaving $450M! on the table. \n\nAll the tweets and subliminal messages showing support for apes was great and all but it was ultimatly just words. With this thing they put their money where their mouth is and gave up dollars to empower and support apes. That to me is the loudest a corporation can speak and it has me convinced without a shadow of a doubt that the entire Gamestop team is fully on the side if it's shareholders and in this battle with the apes. \n\nMy tits are permajacked and I can't wait to see what else Gamestop has in store for us going forward (pun intended).",
    "title": "Gamestop showed their true colors",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n0c82o/gamestop_showed_their_true_colors/"
}