{
    "author": "LaissezFaireMan",
    "created_utc": 1626505770.0,
    "distinguished": null,
    "edited": 1626653672.0,
    "id": "olzh0x",
    "text_only": true,
    "flair_text": null,
    "name": "t3_olzh0x",
    "num_comments": 8,
    "permalink": "/r/GMEJungle/comments/olzh0x/a_histrionic_history_series_the_history_of_the/",
    "score": 7,
    "selftext": "Hi there.\n\n&#x200B;\n\nSmooth-brained dipshit here. If you are like me (retarded), you probably don't have the full picture on exactly where we have come from, where we are, & where we are heading (hint: MOON). Fortunately for you, someone else smarter than me explained it to me (actually lots of people). Here is my best attempt to give you a digestible segment of GME history. To do so, we have to understand **how** the world we live in came to be.\n\nWhat follows is an imperfect attempt to explain the FTDs, tactics of SHFs, and a heavy dose of macro event analysis and speculation as to their future current. What has happened, who we are up against, **and what should be, IMHO, the true meaning and purpose of our movement will be treated on**. I am not an FA. You would not be in this sub if you believed that people could easily be trusted.\n\nLet me say this, trust **NO ONE**, not even dear OP to tell you where the bear shits in the woods. I am just one dumbass . No one owns this movement. No single person speaks for it. I understand history and econ *decently*. (Also, fuck Trotsky and Ken Griffin.)\n\nThis is a history summary. Not a soapbox where I tell you my beliefs (except as they relate to GME or scumbag government shit).\n\n[Part I \"Money For Nothing\"](https://www.reddit.com/r/GMEJungle/comments/olzh0x/a_histrionic_history_series_the_history_of_the/)  <---------- You are here\n\n[Part II \"Maestro\"](https://www.reddit.com/r/GMEJungle/comments/omfrrs/a_histrionic_history_series_the_history_of_the/)\n\nHowever, History, the story of those who change the world, is being written this very moment, by the very readers of these words. Just by removing GME shares from circulation, you have joined, whether you know it or not, the last shot left in the barrel against a **highly** imbalanced society. Don't fuck this up.\n\nBefore I make myself an ass by proving how little I understand, I would like to implore every reader to keep something in mind as you read this, as it had a massive impression on me recently when I encountered it. I will link the sauce in the comments, as I don't want this post removed for \"anarchist shenanigans (I identify with my own philosophy, not anarchism or any other ideology mentioned in this post (if you are curious about my beliefs, listen to *Written In Uncertainty's* video \"What happened to the Dwemer\", the BEST lorecast on TES, I deny reality as real, don't take shit I say seriously)\n\nhttps://preview.redd.it/c2657z4qjpb71.png?width=474&format=png&auto=webp&s=889036db43db4b4022f74eec91eb8a7a8e2e5719\n\nIn PM Bergman's introduction to *The Anarchist Cookbook*, he mentioned this while explaining anarchism as a philosophical postulate:\n\n\" as recently expressed more simply in a note left in a bank burned by Anarchists in West Berlin: “Make kaputt what makes you kaputt.”\n\nThe bank robbers from the heist in question did not rob that bank to get money.\n\n*They robbed the system of the means which it robs them (the people) of and by.*\n\nIn case any of you apes have not realized this yet, the system does not value you. It does not want you to succeed. Want to have the American Dream? Want a car? Debt. House? Debt. Money to pay for debt? College. Debt. It is even worse for non-US citizens, since their governments have effectively tied their ships to the US, even if Bretton Woods is dead.\n\n&#x200B;\n\n&#x200B;\n\n[i WoNdEr: Where is all the money going?](https://preview.redd.it/t2uskcavppb71.png?width=474&format=png&auto=webp&s=74c59ef4c7d498e90baca6a46ac34a285615dbed)\n\n“Twenty million Americans lost their job in the pandemic. At the same time, roughly 650 billionaires in America saw their net worth increase by more than $1 trillion . . . and they’re now worth more than $4 trillion.”\n\nJoe Biden April 28, 2021, in his [address to Congress](https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/04/29/remarks-by-president-biden-in-address-to-a-joint-session-of-congress/).\n\n&#x200B;\n\nhttps://preview.redd.it/v5jfeb25qpb71.png?width=856&format=png&auto=webp&s=f99716fd14a0b981f1e21acaed89d4c7a98baf29\n\nWe have seen some amazing DD. In fact, it is *so* numerous, that I am not going to link all the great DD I think you need to see in order to get an understanding, at a surface level, of the complicated events we have been witness to. I will, however, link the best DD delivers' profiles ([Criand, who did excellent research on options](https://www.reddit.com/user/Criand/posts/), [peruvian bull who does an excellent explanation of the Dollar and its status as a the WRC](https://www.reddit.com/r/Superstonk/comments/o4vzau/hyperinflation_is_coming_the_dollar_endgame_part/), and [atobitt](https://www.reddit.com/r/Superstonk/comments/nm83eb/a_house_of_cards_parts_i_ii_iii_in_pdf/?utm_source=share&utm_medium=web2x&context=3), an all-round badass at everything he touches. They should call him Midas, instead).\n\nNot to show my shoddycast fanboiness, but in order to get to the heart of the story, **you have to go back to the beginning.**\n\n**End of Preface**\n\n\\-0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0--0-\n\nPART I: Money For Nothing\n\n&#x200B;\n\nhttps://preview.redd.it/bf3z2eo1kpb71.png?width=474&format=png&auto=webp&s=1737be0ca8db8c01c84c06cd019a2722c76d9f0d\n\nOkay. The Federal Reserve is founded in 1914 as a replacement to the First Bank of the US, which Andrew Jackson famously gave a epithet to on his own gravestone: \"I Killed the Bank.\" US policymakers supposedly observe that in Europe, crises and flights on their financial and capital markets occur *less frequently* in countries with central banks. The effective purpose of a central bank is to issue currency *in the name of* a government. Fast forward.\n\nPretend you're Uncle Sam. The Federal Reserve (The Fed), more specifically. The year is 1945, and after the abject destruction unleashed on the world through the fury of World War Two, economies (to pay for the stupid war) the world over have inflated their currencies to the point of being unable to redeem their bank notes with gold. (In fact, from the outset of the War, the British engaged in a *highly* successful seizure of foreign exchange assets belonging to Germany).\n\n&#x200B;\n\n[Bretton Woods Resort, circa 1970](https://preview.redd.it/nzhm9nevkpb71.png?width=474&format=png&auto=webp&s=3dd426eaa88564be06697eb704b245e9e800065c)\n\nThe feeble economies of Europe, who have now for the second time required your aid to prevent the destruction of the Anglo-American hegemony over the globe, agree that they will base the value of their own currencies off the dollar. You, Uncle Sam, agree to (continue to) tie your currency, the Dollar, to gold. This means that if people desire to do so, they can bring 32 (later 35) dollars to a US Federal Reserve Bank, and receive an ounce of gold.\n\n&#x200B;\n\nhttps://preview.redd.it/on9nfb74kpb71.png?width=474&format=png&auto=webp&s=623a79bde058cb7ba0a733721ca92999e0c7548b\n\nCue the Cold War. The world is carved up into \"three\" groups:\n\nThe First World - The developed capitalist, Western states of the world who politically align with the United States, NATO, United Nations, IMF, and World Bank (America's global military, diplomatic, monetary, and investment vehicles of influence, disrespectfully respectively)\n\nThe Second World - The communism aspiring, socialist/anti-imperialist states of the world, who mostly model political and economic regimes after the Union of Soviet Socialist Republics (USSR) or the People's Republic of China (China \\[versus Taiwan\\]. It exercises its military alliance system through \"The Warsaw Pact,\" later referred to as \"The Eastern Bloc.\"\n\nThe Third World -  All undeveloped countries of the world, newly freed (mostly) from the collapse of imperialism (ruling over a polity other than your own) which was a result of two world wars. These are up for grabs between Uncle Sam and Uncle Stalin.\n\nCapitalism, in brief, is both the function of capital throughout economies as well as an ideology. It (usually) postulates the argument that private property and freedom are mutually inclusive.\n\n&#x200B;\n\nhttps://preview.redd.it/v3aq67l7kpb71.png?width=474&format=png&auto=webp&s=5c1acd40bba917f9c7e7509269b54f2d4f843ac0\n\nCommunism is the political section of a philosophy known \"dialectical materialism.\" It's basic postulation is that history, and therefore the progression of society, occurs in \"dialectical\" relations. The consequences of this theory of history in conjunction with the Marxist assertion that capitalism, as a stage of history, would be deposed by communism (eventually), made Communism a force *inherently antagonistic to the capitalist US*. Under Stalin, communism was fused with the power of the state (dictatorship of the proletariat \\[or in \"the name of,\" nominally.\\]) It typically views private property and freedom as being mutually *exclusive*. Some argue that Trotsky argued for *world revolution,* versus Stalin's \"socialism in one country.\" (Investigation of first-hand sources, such as actually reading the essay by Stalin \"Socialism in One Country,\" will show that Trostsky mischaracterized Stalin's arguments. He \\[Stalin\\] never argued for socialism in *only* one country. As a side note, if you liked Cold War history, read Kotkin's new bios on Stalin).\n\n&#x200B;\n\nhttps://preview.redd.it/gt8gofdz2qb71.png?width=474&format=png&auto=webp&s=6efdd2df1bf532e4587ccb53e64375b4a6e0672b\n\nYou, being the big-brained boy you are, decide to defend your newly found (after WWII) status as global hegemon and power broker. You develop a geopolitical strategy to halt the spread of Communism as well as increase your own power. So what do you do? Incentivize the world into joining you. Want access to the largest consumer economy in the world? Want the protection of the world's **biggest** brother?\n\nSo in return for political compliance, the US will protect you, invest in you, and allow you to cheaply finance US deficit spending.\n\nCUE THE GREAT INFLATION \"Guns & Butter\"\n\n&#x200B;\n\n[Guns](https://preview.redd.it/bhfxa4f2lpb71.png?width=474&format=png&auto=webp&s=f2f4ddf34398c8f70423f6eb02b578b21d4881bb)\n\n&#x200B;\n\n[Butter](https://preview.redd.it/wghz2tx5lpb71.png?width=474&format=png&auto=webp&s=3b438687e9d62b0491ecab864a1584ca9b704814)\n\nWhile America was busy investing huge amounts of money rebuilding the destroyed places of the world, things were great. The US was, increasingly, in possession of trade surpluses. It was further cementing its role as global hegemon, and leveraged access to its markets in exchange for (usually) political compliance to something the Americans can palate.\n\nThis, on paper, looked as though capitalism and America might actually be saving the world from something worse.... Communism. Countries organized themselves along the above battle-lines. In some places like Cuba and Vietnam, Americans set aside peace to fight the spread of Communism. In the former, it almost resulted in nuclear ash, and in the latter, America found her innocence, pride, and trust cleaved from the bosom of her idealistic people. In time, the Darkness the war unleashed on the world would reach her shores. But people carried on much as they had, believing that their way of life would not change.\n\nCue LBJ.\n\nThe decade of the 60's has begun its slow degeneration of trust American's held for the instruments of governance. The war in Vietnam, supposedly a struggle to halt the spread of communism (oh yeah, definitely does not interfere with the principle of self-determination), combined with the massive spending incurred from the Great Society Reforms, has led the US to massively increasing the amount of dollars circulating throughout the world economy.\n\nUnfortunately, when  there is more of something (decrease in scarcity, the axiomatic problem economics seeks to address) it is less valuable. Beginning famously (within the realm of state actors) with the French, government treasuries around the world began to exchange their dollars for gold (because Uncle Sam did not change the gold exchange ratio when he shat all over the Dollar). The French sent their **armed** navy to pick up the gold, just to make sure there were no... problems.\n\n&#x200B;\n\n[Tricky Dick](https://preview.redd.it/8ukjew2onpb71.png?width=474&format=png&auto=webp&s=00eaae55054180cb0631b2283b8977505d8c5366)\n\nIn April of 1971, after the US went from possessing 50% of world gold reserves to **12%**, US President Kissinger... I mean Nixon, suspended the convertibility of the US Dollar into gold. As years unfolded, the US figured it could create demand for its currency if the world's majority of oil was sold in US dollars (USD), as well as another method discussed below.\n\n&#x200B;\n\nhttps://preview.redd.it/jqw6jj8xnpb71.png?width=721&format=png&auto=webp&s=38649826d7b60d858c41506d2aa5addce64fbda8\n\nIn order to defend themselves, most currencies abandoned the dollar, and let the values of their currencies be determined relative to competition (on an open market called today FOREX \\[foreign exchange\\]). Given that **all** currency is only worth what people acknowledge it as being worth, personally, fiat currency (which has no assets you can redeem them for) is just as phony as asset-backed currencies. The major advantage, though, that the latter has over the former, is in the theoretical impossibility that inflation would exceed the supply  of the asset backing up the currency. America is proof that that is mostly bullshit.\n\nAnd so, the war against communism faded into the background, as America realized greater problems. At the same time Americans fulfilled a generational wish to end the war in Indochina (Vietnam), massive increases in prices of consumers good causes extreme domestic discontent. The dollar losing its asset backing in gold did **so** much damage to the US. It was clear, however there was no going back.\n\nIn Keynesian economics, there is something known as the Phillips Curve. It looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/94wrdbhaipb71.png?width=792&format=png&auto=webp&s=72ce6ff8ccaec098ffdac6448142a760b0a8d8ac\n\nIn case you're a dumbass (like me) and needed others to explain this to you, effectively what you are looking at is the **theoretical attitude** towards the relationship between inflation and unemployment that predominated central bank monetary policy worldwide for over three decades. The period of history we are entering effectively renders the above a curious artifact of the past. The above suggests that inflation and unemployment have a correlatively *inverse* relationship to one another. However, as we now know, correlation does **not** equal causation.\n\nUnfortunately, the experience of the 1970's would obliterate viewing the above as a \"law\" of economics. Going into the 1980's, unemployment and inflation both hit record highs. Americans saw their buying power diminish year after year, as all the while, Arthur Burns makes money printer go BBBBBRRRRRRRRRRRR!! Powell would cum if he could see Burns at work.\n\nLet's talk about Burns for a sec. Here is his mug.\n\n&#x200B;\n\nhttps://preview.redd.it/osa76j4jopb71.png?width=474&format=png&auto=webp&s=8866970d0f638477f5c78af613c89c0511584ec1\n\n[This man](https://en.wikipedia.org/wiki/Arthur_F._Burns) was the Chairman of the Fed for quite some time (1970-78, two terms). He resisted the \"hard\" duty of a good Fed chairman: controlling inflation. With imposing and intimidating statesman like LBJ and Nixon on the political scene at the time, it is not hard to see how the Fed was swept up in a larger expression of the growing centralization of power in the US government. Aside from some war powers that were revoked from the President ([War Powers Act](https://www.e-ir.info/2014/11/19/presidential-war-powers-in-vietnam/)). Despite chairing the Fed during the *most fiscally irresponsible period of US history* at that time, Burns did not control inflation.\n\n\\---------------------\n\nPAUSE:\n\nSo how exactly does the Fed affect the money supply? Isn't it as simple as just unplugging the fucking printer? Well... no. The Fed actually puts the currency it prints *into* the economy by *selling US Treasury Bonds*. What? Why does the Fed do that, I thought the Treasury did that. Well, it is true that the Treasury *issues* the bonds. But the Fed has **power**.\n\nThis power is called **monetary policy**. Monetary policy is when, through the raising and lowering of interest rates it controls, the Fed either contracts or expands, respectively, the amount of money in circulation, effectively \"setting the price\" of money itself. The Fed achieves this in several ways. The biggest, most notable method is through **Federal Open Market Operations (FOMO** lol\\*\\*)\\*\\*. The Fed, through the FOMO **buys** treasuries (and nowadays MBS and other shitty assets) from the market. (Foreign countries, retirement funds, and private investors frequently hold T-bonds because there is no other product on the globe that is easier to find a buyer or seller for).\n\n\\------------------------\n\nAfter 8 years of nervelessly raising and then immediately cutting rates, it was clear to everyone that Burns would **not act** against inflation.\n\nFortunately, [a peanut farmer](https://en.wikipedia.org/wiki/Jimmy_carter) would end up as POTUS and made what is arguably the best decision (certainly the farmer's best) of any US president in the given century. After **years** of having absolutely no discipline on the fiscal or monetary policies of the US, ONE MAN was called. ONE MAN answered that he would do whatever to defend the United States' currency's status as the world's reserve currency (the currency most often used to conduct international balance-of-payments).\n\nThis man... was Paul Volcker.\n\nhttps://preview.redd.it/7saig07aqpb71.png?width=474&format=png&auto=webp&s=817a3de1419fe48ad36513c22739b52fa43b2488\n\nPART II: The Final Salvo\n\nAfter it was a sure-thing that the USD would not be exchangeable for gold, the US rushed to justify its currency's existence. The US had a **hard** time making this argument: every year, the government increased its deficits, spent more, achieved less, and kept that printer going BBBBRRRR!\n\nAfter all, if currency is not good for any particular utility, what is it good for?\n\nWell, what if I told you how you could cheaply export to the largest, richest consumer market in the world, and *at the same time* make money off of loaning to the world's **safest creditor/debtor**: The United States Treasury. What if I explained **how** you can do this by 1. creating a currency and central bank. 2. Using that currency to buy US Treasury Bonds (increasing US Deficits). This gives **you** HARD currency to make purchases in the global economy, a means of defending your currency's value if it comes under attack in currency capital markets, and the endearment of the biggest kid on the block, Uncle Sam.\n\nAfter you, say Angola, have done steps 1 and 2, you say that\" America is right! Markets are cool.\" Americans are buying **your** shit that **your** people produced in **your** countries from your **materials**. \"What do you know, not only has the economy grown in real GDP terms, but so have standards of living and incomes. This is awesome! WIN-WIN All the way around,\" You think to yourself.\n\nOne day, you, the Federal Reserve chairman equivalent of Angola wake up. You put on your \"monkey \\[we should call them ape-suits **when** we win\\] suit,\" grab your coffee and smokes, and sit down to watch CNN on a quiet Sunday morning.\n\nSome bitch with fake tits appears on the screen talking about how the Angolan dollar is taking a shit. You rush to work and summon a meeting of the cronies. As it turns out, because the economy has grown, so have prices. Inflation. When you printed all that money to buy T-bonds from Uncle Sam (to lower the value of your currency, making it cheaper and easier for you to export your goods to consumerist-addicted soccer moms), you did not **buy enough** T-bonds relative to the amount of your own currency in the world. This is **exactly** what happened to the US when people wanted the gold instead of dollars. Now, the investors and foreign governments of the world are *selling your currency for USD.*\n\nMost of you apes are probably already aware that if *supply* for a product outpaces *demand*, then according to the Autist Retail Investor's Code of Hammurabi, **that ASSet's price will fall.**\n\nYou don't have enough dollars on hand to go out into the global market to buy your currency off the market to stabilize its price relative to other currencies. SO, what do you do? Just buy more US T-bonds, increasing the number of dollars you have.\n\nRemember, Central Banks cannot keep large amounts of their own currencies on hand, at the expense of foreign currencies, because you cannot use a currency (whose value is declining in real time) to buy the *same currency*. Your money is not really money if it can't be bought.\n\nIf you *don't* buy more US debt, which allows its indebted citizens to get debt to continue buying cheap consumer goods coming from your third-world economy, then you will turn into 1998 Asia. Asia, particularly Thailand, was unable to turn the tide on the run on their currencies, and yet most managed to still cause massive inflation. Indonesia and the Philippines inflated the most.\n\nIf you succeed (UK fighting fuckers like Soros), eventually you will buy US T-bonds, use those dollars to buy your currency off the market, and stabilize the situation. Unfortunately, this **guarantees** inflation, since you have to increase the money supply to buy T-bonds from the Fed. It also means prices for consumers in your country will rise, and if you are lucky (Japan) growth will stagnate.\n\nIf you are not lucky (Zimbabwe), you will have problems.\n\nThe end result of this process is the following:\n\n1 Demand for US dollars is created, since you can experience real economic gains by buying dollars from the Fed with your own bullshit currency (pretend you are still Angola).\n\n2 You modernize your country to a degree by maintaining the system of \"Imperialism with extra steps,\" before ultimately,\n\n3. Learning that the whole debt-driven process is designed to **enslave every world government, treasury, and citizens to US debt. <------------------------- YOU APE READ HERE**\n\nOkay, let's go back to that handsome, tall fucker Paul V.\n\n&#x200B;\n\nhttps://preview.redd.it/z3py5o5jxpb71.png?width=474&format=png&auto=webp&s=2135b99be7bd0236c15d0b821aeed09d12fe1aa8\n\nSo fast forward to 1980. This time around, you won't be Angola, you get to be the average US investor. You just heard that some no named loser at the Fed disappeared. Some tall fuck who fucks called Volcker *is the Fed* now. Rumor has it he is going to fight inflation. The rumors are, unbeknownst to you, very true.\n\nTaking interest rates on short term debt to ***higher than 20%,*** Volcker was successful in destroying inflation. Unfortunately, the commensurate rise in the cost of money put the economy into the worst recession since the Great Depression. For a decade now, Americans have lived with inflation and high unemployment coming and going.\n\nNow, Volcker has **exterminated** inflation by responsibly **doing his fucking job and raising rates.** Whether he possessed designs over remaining at the Fed, by the late 1980's, with inflation dead and unemployment decreasing, Volcker is expendable.\n\nA new man comes to the fore, a man with very different opinions on how capitalism works and should work.\n\n&#x200B;\n\nhttps://preview.redd.it/31eqnebwypb71.png?width=400&format=png&auto=webp&s=0b99b26ff5f770aab8be2af03c3d37b1c9ae0bc4\n\nCue Lovefool by the Cardigans.\n\nIn 1987, Alan Greenspan was made Chairman of the Federal Reserve. Nominated by Reagan and ultimately surviving three Republican and one Democrat presidents spanning an 18-year period.\n\nAlmost immediately [upon his confirmation](https://www.c-span.org/video/?150949-1/greenspan-confirmation-hearing), in which early days he expressed a **sharply** hawkish view on inflation that **completely disappeared,** the markets died.\n\n&#x200B;\n\nhttps://preview.redd.it/xswqfu6uzpb71.png?width=474&format=png&auto=webp&s=57f34478f4b3eb9438c587f261f2d4078597dfaa\n\nBetween portfolio insurance, corporate raiding, algo programs on computers that sell off entire asset portfolios **during declines in prices**, a shitstorm was out of the basket to be sure. See that scary long red line? That is one day. One day. Yeah, they called it Black Monday. The more the computers sold, the more computers sold. Traders **panicked**.\n\nSo what did our newly minted Chair Greenspan do?\n\nAfter the Great Depression and Great Inflation, the Fed understood that as a result of its inactions, major crises were caused or accentuated. Unlike after the Great Depression, the Fed would do what it took this time to keep credit unfrozen so that the real economy did not seize up for a lack of financing or a withdrawal of existing financing \\*\\*\\*. (Wrinkle-brained apes may like to study more about how when providing funding to corporations, different creditors can just **take their money back from you**. This is done by use of an ISDA clause. THIS right here is the exact reason Enron collapsed so suddenly. Investors (corrupt banks) literally withdrew money from the business).\n\nThe Fed lowered rates, especially the overnight lending rate, to provide cash to the economy after a whole fuck load of cash was wiped out instantly. The situation, after serious problems with Savings and Loan institutions which required a government secured bailout, stabilized.\n\nGreenspan, aside from a comment in a speech, would never do anything to seriously raise rates again. The \"Great Moderation\" had begun.\n\nNext section out soon. Hope you enjoyed. Sorry for my dry humor. Please PM or comment my typos and I will compulsively edit every one of them.\n\nEDITS: Grammar, spelling, organization of the preface for better flow",
    "title": "A Histrionic History Series: The History of the GME Saga",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/GMEJungle/comments/olzh0x/a_histrionic_history_series_the_history_of_the/"
}