{
    "author": "ghoztpepper",
    "created_utc": 1626545959.0,
    "distinguished": null,
    "edited": 1626629490.0,
    "id": "om9mqk",
    "text_only": true,
    "flair_text": null,
    "name": "t3_om9mqk",
    "num_comments": 76,
    "permalink": "/r/GMEJungle/comments/om9mqk/kelly_brennan_head_of_etf_at_shitadel_securities/",
    "score": 637,
    "selftext": "# Edit2: Thanks to some excellent research from u/taimpeng this has been debunked and is highly unlikely that this Kelly has any relation to John. His comment below:\n\n*\"I can confirm that Kelly Brennan from Citadel Securities is not the daughter of former CIA director John Brennan.*\n\n*According to Wikileak's dump of John O Brennan's security clearance documents, his daughter Kelly Brennan was born in 1988.*\n\n*Meanwhile, Citadel Security's Head of ETF Kelly Brennan was working at Goldman Sachs by 2005 after graduating UC Berkeley in 2000 (*[*Source 1*](https://fistulafoundation.org/team/kelly-brennan/) *and* [*Source 2*](https://theglasshammer.com/2013/10/voice-of-experience-kelly-brennan-managing-director-securities-division-goldman-sachs/)*):*\n\n>*Kelly earned a BA in Political Economies with a concentration in Molecular Cell Biology from the University of California, Berkeley, in 2000.*  \n>  \n>*In 2005, Brennan joined Goldman Sachs as an Associate in the Prime*  \n*Brokerage area on the Securities Lending desk. She was promoted to a*  \n*Vice President in 2006, and then to Managing Director in 2010.*\n\n*If they were the same person this would put her as graduating Berkeley at the age of 12 and reaching VP of Prime Brokerage at Goldman Sachs by the age of 18, which, although not impossible on its own, would've been noteworthy points brought up somewhere.\" -* u/taimpeng\n\n**Original Post (debunked):**\n\nSo I was doing a little digging into some Shitadel employees and came across this gem, Kelly Brennan. Kelly is the head of ETF and responsible for the firm's ETF trading business globally. She also formerly worked for both Goldman and Susquehanna.\n\n[https://www.citadelsecurities.com/leadership/kelly-brennan/](https://www.citadelsecurities.com/leadership/kelly-brennan/)\n\nWell I know the name Brennan, as in John Brennan. Former CIA director (2013-2017) who has had his name tied to countless scandals and controversial dealings such as Crossfire Hurricane, drone strikes and a number of others. Feel free to dig deeper into his past. I figured this was probably just a coincidence as Brennan is not some wildly unique name, but I put my tin foil hat on anyways. According to CNN themselves, Mr. Brennan has three children: Kyle, Jaclyn and Kelly! Wow! Probably just a coincidence right..?\n\n[https://www.cnn.com/2013/01/08/us/john-brennan---fast-facts/index.html](https://www.cnn.com/2013/01/08/us/john-brennan---fast-facts/index.html)\n\nWell I'm just a retarded ape and can't confirm anything 100% but I'll leave you with these photos. They look pretty damn related to me. I don't know what this all means, but if the head of ETF for Shitadel is the daughter of former Obama/Biden CIA Director, this could go even deeper than we already suspect.  Whatever the fuck that means, IDK. Just wanted to share in case anyone else more wrinkled than me had any insight or more skill with their research abilities, and wants to take a further look.\"\n\n&#x200B;\n\n[John and Kathy Brennan](https://preview.redd.it/y4yg7rw2etb71.png?width=550&format=png&auto=webp&s=5ded212c57629aaa7942ff056a7ce6c0695b1465)\n\n[Kelly Brennan](https://preview.redd.it/m510t3x3etb71.png?width=500&format=png&auto=webp&s=b87eabd947755e75c3776d9194596a6aa96d1a7d)\n\nEdit1: Thank you all for your comments, upvotes and awards! I’m still pretty new to the Reddit world and appreciate having a voice here on this sub. Despite everything going on, all I know is buy and hodl 💎 love all of you and wish you nothing but happiness and tendies! Stay Royal",
    "title": "Kelly Brennan, Head of ETF at Shitadel Securities - Daughter of former CIA Director John Brennan?",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GMEJungle/comments/om9mqk/kelly_brennan_head_of_etf_at_shitadel_securities/"
}