{
    "author": "missing_the_point_",
    "created_utc": 1626574317.0,
    "distinguished": null,
    "edited": 1626593617.0,
    "id": "omhlz6",
    "text_only": true,
    "flair_text": null,
    "name": "t3_omhlz6",
    "num_comments": 498,
    "permalink": "/r/GMEJungle/comments/omhlz6/my_posts_are_being_suppressed_in_superstonk_i/",
    "score": 1177,
    "selftext": "Here is proof that a friend can’t see my most recent post theorizing what is going on and predicting a massive price drop: https://imgur.com/a/HH4a3lE\n\nHere is the post in question: https://imgur.com/a/HH4a3lE\n\nHere’s the text, in case it gets deleted:\n\n**There will be a MASSIVE sell off on Monday**\n\nI believe this has been the master plan the entire time. SuperStonk was orchestrated by hedge funds from the beginning.\n\nAs the end comes closer, they have created absolute chaos. All of a sudden, this sub reveals itself as untrustworthy and corrupt, and we can’t trust anyone. Just as all those options expired. This is NOT a coincidence.\n\nThey have been buying up shares for 7 months, leading up to next week. On Monday and possibly leading further into next week, they’ll start selling off massive lots of shares.\n\nThey think people will assume it’s because of this drama and that the mods are/have been compromised and it’s not worth holding anymore.\n\nI don’t know why exactly other short squeezes have dipped extremely low before their launches (VW for example), but a massive sell off, in attempt to shake off paper hands makes sense.\n\nMods told us not to reveal our positions, but I don’t trust their strategies anymore. I’m an X,XXX holder who is not rich. I’m a day trader and have been a Redditor, who posts consistently on Reddit, for the past 9 years. I’m not scared to hodl through it all or even lose money. This is the ONLY WAY. Please feel free to check my post history or StockTwits to prove I’m not a shill.\n\nIf we are wrong, they wouldn’t be trying so hard to bring us down. MOASS is closer than we all think. All you have to do is ignore all the fuckery we are going through and may go through in the coming days.",
    "title": "My posts are being suppressed in SuperStonk. I posted a theory and it’s not showing up, with no explanation. I asked 4 friends to check and they don’t see it in my profile.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GMEJungle/comments/omhlz6/my_posts_are_being_suppressed_in_superstonk_i/"
}