{
    "author": "GanakaMoggallana",
    "created_utc": 1626531138.0,
    "distinguished": null,
    "edited": 1626571941.0,
    "id": "om5046",
    "text_only": true,
    "flair_text": null,
    "name": "t3_om5046",
    "num_comments": 422,
    "permalink": "/r/GMEJungle/comments/om5046/psa_for_this_sub_to_be_taken_seriously_we_need_to/",
    "score": 6375,
    "selftext": "ITT: Let’s brainstorm some ways to laser focus this sub on *attracting* industry professionals, since our previous home has become an embarrassment and will surely now repel them. This sub is blowing up in size very quickly, and I’m noticing a lot of content that is not relevant to the stock - this should be a refuge for those who want to *avoid* the drama. The users here probably all share a similar opinion of who is right/wrong and what the implications are, so no need to turn this into an echo chamber or negative circle jerk. We just like the stock!!!\n\nA few ideas:\n\n* Create some sort of democratized DD review system that will make the DD more transparent and reliable. Like a kind of peer review flow where DD can go from initial states of “Proposed” and “Under Peer Review” to conclusive states such as “Debunked”, “Speculative”, or “Confirmed“.\n* Take advantage of the recent LinkedIn phenomenon and maybe try to get an AMA with one or more of the prominent voices on there who spoke out against Citadel. It seemed that Pink had a relatively close relationship with Lucy Komisar, and I hope we can continue to get her input too.\n* Find creative ways to give this sub a more professional vibe, without spoiling the fun. Hate to say this, but the memes were taking over our previous home and it started to feel more like a playground than a think tank. Better to pursue quality over quantity when it comes to memes and shitposting.\n\nThat’s all I got; hope to see some interesting ideas below!\n\n&#x200B;\n\n**UPDATE**: Thank you to everyone for contributing to this thread, and thanks for the awards kind strangers! So many great ideas here, I’ll summarize a few things I noticed:\n\n* Something I didn’t expect - saw a number of comments saying something along the lines of the “the DD is done already.” This is a dangerous mentality - don’t get complacent. The SHF’s and prime brokers are *not* done fighting, and they will continue to find new methods of fuckery to try and get away with their crimes! We need to stay on their asses, and every time they develop some new trick or deception, we should see some DD here calling them out on it. **The DD isn’t done until we get our fookin’ TENDIES!!!**\n* Also something I didn’t expect - a lot of support for my third point about memes! Was kind of expecting to take some flak for that, but I was pleasantly surprised to see a lot of people agree wholeheartedly. Want to make it clear that I *love* good memes, and high quality memes really make this a fun community to be part of. **But when an excessive amount of low-effort memes start to overshadow/bury amazing DD like the Castle of Glass, it becomes a problem and leads to forum sliding.** Some good solutions are discussed below.\n* Excellent points raised about age/karma requirements and the effect Satori had on the sub. It’s a tricky issue that clearly eludes a simple solution, but I think it’s a serious debate that warrants its own thread and deep analysis by the community.\n* Just want to point out how civil the discussions here were! Thank you everyone for being respectful and offering thoughtful feedback - this is what our community is all about. **I love you filthy stinkin’ apes! OOK OOK ❤️🦍❤️**",
    "title": "PSA: For this sub to be taken seriously, we need to IMMEDIATELY focus on $GME with quality DD and market research. This can’t be seen as a soap box for negativity against other subs or users.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GMEJungle/comments/om5046/psa_for_this_sub_to_be_taken_seriously_we_need_to/"
}