{
    "author": "ClickClack24",
    "created_utc": 1626542910.0,
    "distinguished": null,
    "edited": 1626546849.0,
    "id": "om8nzy",
    "text_only": true,
    "flair_text": null,
    "name": "t3_om8nzy",
    "num_comments": 7,
    "permalink": "/r/GMEJungle/comments/om8nzy/will_the_real_apes_please_stand_up/",
    "score": 20,
    "selftext": "Will the real Apes please stand up.\n\n  \n\nLook  \n If you had  \n One shot at a MOASS  \n Or one opportunity  \n To seize everything from the billys  \n In one moment  \n Would you hold it  \n Or just paper hand it away?\n\nYo  \n Apes tits are sweaty, knees weak, diamond hands are heavy  \n There's Kennys on their sweaters already, DFV’s not a kitty.\n\nShorts nervous, but Apes are calm and ready  \n to drop DD bombs, but they keep forgettin\n\nwhat they shorted down, the whole Reddit goes so loud\n\nKenny opens his mouth, and the shorts just keep on coming out\n\nHe's chokin', how, Reddit's jokin' on him now\n\nThe money’s about to run out, times up, it’s over, blaow.  \n   \n \n\nDTC needs to snap back to reality, ope there goes GME  \n Ope, there goes RC, Kenny choked  \n He's so mad, but he won't give up that easy? No  \n He won't have it, he knows his whole back's to the world now\n\nIt don't matter, he's a dope, he knows that, and he’s about broke\n\nMarket so stagnant, he knows, when he goes back to this mansion home.\n\nNow back to the Citadel again, yo, Hedge Funds being so flanigan\n\nBetter try to capture this moment and hope the Apes paper hand\n\nYou better yolo yourself in the market, the moment  \n Apes you own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once \n\nYou better yolo yourself in the market, the moment  \n Apes own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once   \n You better hodl.\n\nApes souls are aching, through this red market that is gaping  \n This world is ours for the taking  \n Make us equal, as we move toward a Free Market in the making\n\nA life without u/JTH1 Elliot Waves Guy is borin', r/SuperStonk is close to  post mortem 500k deep shill infiltrating with a titty pic. On to r/GMEjungle It only grows easier, diamond hands keep formin  \n Apes grow, it's all over, MSM thinks they onto them  \n Coast to coast shows, Reddits right and Ryan Cohen now known as the Apefather\n\nUntraveled roads, u/Criand only knows, we’ve grown farther from January  \n We work and go home and never faulter.\n\nBut hold your shares cause the MOASS is near\n\nKeith Gill opened our eyes and led the way here with a magic 8 ball and drinking some beer\n\nThese other hedge funds don't want retail no mo', u/Buttfarm69 with dank memes maken fear\n\nThey bankrupted moms and pops stores, moved onto the next without a care\n\nSo the soap opera of GameStop is told and u/HomeDepotHank DD unfolds,  \n Da-da-dum, da-dum, da-da\n\nYou better yolo yourself in the market, the moment  \n Apes you own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once \n\nYou better yolo yourself in the market, the moment  \n Apes own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once   \n Buckle up and light the rocket.\n\nNo more games, Butt Banana Guy making bets for days\n\nWe about to tear the motherfuckin’ roof off this cage\n\nAt first we was playin’ but now the mood is changing\n\nRetail been chewed up as they tried to throw us off stage\n\nBut we keep on buyin and keep stepping into the next FTD cycle\n\nBest believe u/rick_of_spades paid the piper\n\nAll the pain inside from Harambre and Geoffry amplified inside\n\nFact that some Apes cant get by with their nine to five and cant\n\nProvide the right type of life for their ape family despite they try.\n\nIts no movie yet, but when there is we won’t forget u/DerGurkenraspler\n\nThe Diamantenhande Guy, this is our life and these times can be hard.\n\nSome days it feels even harder tryna feed and water this Reddit community seed, plus\n\nTeeter totter, caught up with between Knights of New and being just a hodlr.  \n Shill drama, weekend 3AM lights on, screaming FUD on us\nMod drama got us moving to another sub.    \n Gotten us to the point, ticker moving like a snail we’ve got\n\ngmefloor.com to formulate a moon shot\n\nSuccess is our only motherfuckin option, paper handing is not.\n\nApes, I love you, and we’re not going anywhere. We CAN grow old and wait in Kenny’s Parking lot.\n\nSo here We go, this is our shot\n\nDiamond hands, fail me not, this may be the only opportunity we got.  \n \n\nYou better yolo yourself in the market, the moment  \n Apes you own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once \n\nYou better yolo yourself in the market, the moment  \n Apes own it, you better never let it go  \n You only get one shot, do not miss your chance to orbit  \n This opportunity comes only once   \n You better hodl.\n\nYou can do anything you set your mind to, Apes.\n\n\n\n\nIts good to be here with you all, hope this makes someone laugh, it was a good way to buy some time today.\n\nEdit - fixed the Superstonk line, LOL",
    "title": "Will the Real Apes please stand up.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/GMEJungle/comments/om8nzy/will_the_real_apes_please_stand_up/"
}