{
    "author": "humanisthank",
    "created_utc": 1627418508.0,
    "distinguished": null,
    "edited": false,
    "id": "osurpl",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_osurpl",
    "num_comments": 218,
    "permalink": "/r/Superstonk/comments/osurpl/updated_nscc2021002_has_the_shf_against_the_ropes/",
    "score": 3107,
    "selftext": "This is an update to my previous post found [here](https://www.reddit.com/r/Superstonk/comments/ofiynb/nscc2021002_has_the_shf_against_the_ropes_the/). \n\n*Obligatory not financial advice disclaimer.*\n\n[Link to the official NSCC-2021-002 document.](https://www.federalregister.gov/documents/2021/06/24/2021-13413/self-regulatory-organizations-national-securities-clearing-corporation-notice-of-filing-of-partial)\n\nGreat summary by [u/criand](https://www.reddit.com/u/criand/): It turns monthly liquidity checks into 24/7 liquidity checks. If a members positions makes it so they don't have enough liquidity posted, Marge calls. If they don't post sufficient liquidity within ONE HOUR then they'll be snapped and their positions liquidated/they default.\n\n**Overview**\n\nOn 6/24/21 this rule went into effect. It's been a total of 22 trading days and is definitely showing a trend. Since that time we've seen a couple of different data points arise that indicate the rule is causing the SHFs to scramble.\n\n**Low Volume**\n\nAccording to [Yahoo Finance data](https://finance.yahoo.com/quote/GME/history?p=GME), we've had the top 10 lowest volume days since that time, setting yet another record today. Low volume is an indicator of low liquidity and likely the noose tightening. In the past when we've had weeks of sideways trading and low volume, it's inevitably lead to a breakout to the upside.\n\n**Lower Highs and Lower Lows**\n\nSince that time, we've started to see lower highs and lower lows. Opening that day we started a run-up to $227, but ultimate got knocked down to a low of $211 and closed at $212. Only one other day since then (6/28) did we have a run-up go past $220. We haven't previously been below $200 since 5/24 when we closed at $180.01. Since that time we've seen the price go all the way down to an intra-day low of $158.01 and haven't gone past $200 since 7/6. With that said, despite even lower volume, the momentum has been shifting higher with our biggest test of $200 on 7/21 reaching an intra-day high of $195.50.\n\n&#x200B;\n\nhttps://preview.redd.it/e0squxczetd71.png?width=1358&format=png&auto=webp&s=8e5c8c52be7751f49e53fa5649eba920f95b4448\n\n**Theory/Speculation**\n\nSince the implementation, the SHFs have been very diligent about price suppression. We're no stranger to them trying to lower the price, but I believe we are starting to reach an apex between liquidity and their short position. Everyday they bleed money from their position, but are stuck between a rock and a hard place. Either they use money (via fees to borrow more shares and other fuckery) to suppress the price lower than yesterday or they let it run higher and risk failing the liquidity check.\n\nI believe at this time, the cost to lower the price more than yesterday is less than the cost of their position increasing because of price. They may even know what price will trigger a failed liquidity, so spend the money to lower it further. For instance (completely arbitrary numbers), if the price today stays above $180 it'll cost them $10B and a failed liquidity, but to lower the price below that to say $178.54 (today's closing) it'll cost them $5B and another day. Eventually these numbers will converge as the cost to keep suppressing the price will outweigh the cost to let the price rise. In either scenario they'll be fuk and price goes boom.\n\nFrom my previous post I said the following:\n\n*Another aspect to this could be coordinated efforts to ensure smaller SHFs don't fail the margin call. We know $350 seems to be a big barrier and we always see a strong short attack when we get close. That may be the bigger SHFs (Shitadel, SUS, P72, etc) coordinating that. At this point, they may know the price that will fail smaller SHFs and work to ensure they don't fail their margin call. If they do, the price will rip due to closing out their position and put $350 in the rearview mirror, causing a domino effect.*\n\nSince then there's been some light shed via NSCC-2021-010, where we learned about SFTs. I'm unsure if my previous theory could be related in the bigger SHFs swapping positions in order to protect themselves, but it's an idea for a more wrinkled brain. More information on that can be found [here](https://www.reddit.com/r/Superstonk/comments/opruh2/new_dtcc_rule_filings_nscc2021803_nscc2021010/).\n\nI expect we'll continue to have record low volume days. All until the apex converges or a catalyst causes the price to jump and the house of cards to come falling down.\n\nBuy, Hodl, and Buckle up!",
    "title": "UPDATED | NSCC-2021-002 has the SHF against the ropes. The next run-up may trigger the MOASS.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/osurpl/updated_nscc2021002_has_the_shf_against_the_ropes/"
}