{
    "author": "Dekeiy",
    "created_utc": 1623376056.0,
    "distinguished": null,
    "edited": 1623377797.0,
    "id": "nx4dqc",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nx4dqc",
    "num_comments": 121,
    "permalink": "/r/Superstonk/comments/nx4dqc/what_you_need_to_know_about_the_russell_10003000/",
    "score": 838,
    "selftext": "Good evening fellow apes.\n\nSince there seem to be a lot of questions around the Russell 1k-3k Indexes lately, I decided to write up a short overview of what that Russell-thingy actually is and how it works. Keeping it short, simple, and to the point.\n\n# What are the Russel Indexes?\n\nRussell Indexes are baskets of the biggest 4000 companies in the US market ranked by market capitalization (= stock price \\* number of issued stock).\n\nThe Russell 1000 contains companies ranked #1 - #1000, Russell 2000 contains companies #1001 - #3000, and so on. There is also a Russell 3000 E ( = Extended) which holds all 4000 companies, as well as several more subsets.\n\nHere is an overview of the Russell Indexes:\n\n[Overview Russel Indexes](https://preview.redd.it/lccu8bxvgj471.png?width=1391&format=png&auto=webp&s=6feffc10f6496ddb112c2695766743d8cacc825c)\n\n[Description of Russel Indexes](https://preview.redd.it/0xolurlxgj471.png?width=1356&format=png&auto=webp&s=16a5ad3a886c4afda5ff3b4c389eaed18889a5b0)\n\n[Source](https://content.ftserussell.com/sites/default/files/support_document/FTSE%20Russell%20Product%20Guide%20Oct%202019%20Single.pdf)\n\nCompanies can be part of several indexes IF they overlap and fulfill the respective market cap requirements. For example, GME is part of the following Russell Indexes as of 2020:\n\n|Russell 1000|Russell 2000|Russell 3000|Russell Midcap|Russell Microcap|\n|:-|:-|:-|:-|:-|\n|*No*|*Yes*|*Yes*|*No*|*Yes*|\n\n[Source](https://www.ftserussell.com/resources/russell-reconstitution)\n\n# What is the Russell Index Reconstitution\n\nEvery year in May, the FTSE Russel looks at and ranks all eligible US publicly traded companies and rearranges their Indexes. Adding some companies and dumping others. This process is called **reconstitution**.\n\nThe cutoff day for this is called **rank day**. This year's rank day was **May 7th**.\n\nCompanies have to fulfill certain criteria ([Source](https://research.ftserussell.com/products/downloads/Russell-US-indexes.pdf)) on rank day to be considered at all. Such as:\n\n* Must be traded on CBOE, NYSE, NYSE American, NASDAQ or ARCA\n* Market Cap over $30M\n* Share price at or over $1\n* More than 5% of total shares must be available for trading\n* and some more technical stuff...\n\nThe 4000 biggest companies by market cap will be added to the Russell 3000E and from there distributed to the other indexes, if they meet their respective eligibility criteria. Companies that do not meet the membership criteria anymore will be deleted. *In with the new, out with the old.*\n\nThis year the Russell reconstitution will take place on **Friday, June 25th, after market close**.\n\nStarting with June 4th, every Friday leading up to 6/25 more information about index additions and deletions will be published. Up until June 25th, when the final rankings will be published after market close. The new Russel Indexes will take effect the next trading day, June 28th.\n\n**Reconstitution day is one of the most volatile trading days during the year, so buckle up.**\n\n# Requierements for Russell 1000\n\nThis year, to be eligible to enter the Russell 1000 a company would have to have more than $5.2B market cap on rank day ([Source](https://www.ftserussell.com/press/ftse-russell-begins-33rd-annual-russell-us-indexes-reconstitution)). GME had $11.97B on May 7th, **so it** ***should*** **be eligible.**\n\nHowever, the only information that we currently have is that **GME will be deleted from the Russell Microcap Index.**\n\nDoes this mean that it will be moved to the Russell 1000 for sure? No.\n\nWe simply have to wait for the preliminary Russell 1000 additions list, which will be published on one of the following Fridays. Or the Russell 2000 deletions list respectively.\n\nHowever, the Microcap Index deletion could imply that they are not using some \"fair-value $17$/share\" bullshit, but rather the actually reported market cap on that day. Making an addition to Russell 1000 very probable.\n\n# What happens when a security changes indexes?\n\nRussell Indexes are tracked by many, many Index ETFs. Which aim to replicate the chosen index as closely as possible. That means, if companies are added or deleted from let's say the Russell 2000, any ETF tracking the Russell 2000 will have to do the same. Meaning buying new shares, or *closing out* previous positions.\n\nResearch has shown ([Source](https://academic.oup.com/rfs/article/28/1/212/1680962?casa_token=jOso3m5z7TYAAAAA:t7cpUo7yixIZXhh6JWn0_buMxx7puzmYXAGoByvN-y05ydrraObooKx1r4ehFQvoPqJz9ohcQ1nqJQ)) that if a company enters at the low end of the Russell 1000, the price tends to drop since Russell Index ETFs weigh the number of shares they buy by the ranking of that company in the index. So the higher a company ranks, the more shares an index ETF buys.\n\n*But that's not how GME do.* Using GME's market cap of $15.8B as of closing today, GME is projected to land smack-dab in the middle at around #500-550. This is a really strong indicator, that there will be strong buying pressure on reconstitution day.\n\n# BUT WILL THE SHORTS NEED TO COVER???\n\nWell, frankly, I am not sure what happens to a synthetic short position if the underlying is removed from the ETF (btw if you want to read more about shorting through ETFs see this [post](https://www.reddit.com/r/GME/comments/lp37ll/short_selling_etfs_what_it_does_how_it_affects/)). Hedgies would possibly be forced to cover, only to reconcile everybody's books. But I wouldn't put it past them to be able to kick the can down the road again.\n\nBut what I DO know is that the buying pressure on that day will be significant and put some hedgies in boiling water.\n\n**TLDR:**\n\n* The Russell Indexes are baskets of the biggest companies traded in the US markets.\n* GME *should* be moved to the Russell 1000, according to their own rules.\n* ETFs tracking the Russell Indexes will have to rebalance and add or remove companies according to Russell additions and deletions.\n* Will SHFs be forced to cover their synthetic shorts? Possibly. But you all know the US market is as corrupt as they come, so be prepared for fuckery.\n* Reconciliation day has been historically a crazy volatile trading day and will lead to significant buying pressure upon GME's inclusion into the Russell 1000. Even more so, since GME will rank in the middle of the Russell 1000, like a beast.\n\n**NEXT STEPS:**\n\n* Wait for the preliminary Russell 2000 deletions or Russell 1000 additions list tomorrow or next Friday for confirmation.\n\nI hope this helps.\n\n&#x200B;\n\nEdit: Corrected reconstitution day. Thanks /u/Cultural-Ad678 for pointing it out.",
    "title": "What you need to know about the Russell 1000-3000 Indexes and Reconstitution Day.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nx4dqc/what_you_need_to_know_about_the_russell_10003000/"
}