{
    "author": "weeknddev",
    "created_utc": 1621042257.0,
    "distinguished": null,
    "edited": 1621044326.0,
    "id": "ncnz1l",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ncnz1l",
    "num_comments": 525,
    "permalink": "/r/Superstonk/comments/ncnz1l/where_in_the_world_is_srdtc2021005_we_were_told/",
    "score": 8192,
    "selftext": "Where in the world is ~~Carmen San Diego~~ SR-DTC-2021-005 otherwise known as \"stop counting your shares twice\" rule. We have passed record number of rules in the past month, and yet we have **still** not seen my (now second favorite to [SR-ICC-2021-007](https://www.sec.gov/rules/sro/icc/2021/34-91894.pdf)) rule come back in **any** form. It's gone, vamos, does not exist on the internet. **What the fucking** ***fuck***\\*\\*?\\*\\*\n\nThe contents cannot be found on the federal register: [Federal register with search applied](https://www.federalregister.gov/documents/search?conditions%5Bagencies%5D%5B%5D=securities-and-exchange-commission&conditions%5Bterm%5D=dtc-2021-005)\n\nThe file cannot be found on the DTCC rule filings:\n\n[Where in the world is DTC-005](https://preview.redd.it/06gy8vb3j6z61.png?width=904&format=png&auto=webp&s=722af39eb0b6ece1a6389c9f8da643864ac152ee)\n\nA smart ape copied it to the paste bin: [https://pastebin.com/adT3ZUZ0](https://pastebin.com/adT3ZUZ0) \\- I have a copy of the PDF on my machine. Let's review what the **Purpose** of this rule filing was to be.\n\nLet's review the **purpose** of the filing:\n\n&#x200B;\n\n>... The Securities remain credited to the Pledgor’s account until the Pledgee releases the Pledged Securities or makes a demand for the Pledged Securities, as discussed below. Rather, a notation is placed on the Account of the Pledgor that the Securities are Pledged to the Pledgee and the Securities remain in pledged status until the Pledgee instructs otherwise.\n\n**And enter king fucking kong:**\n\n>As described below, this bookkeeping method does not adversely impact the rights of the Pledgee in that the Pledgee maintains Control over the Pledged Securities and the Pledged Securities cannot be used by the Pledgee for any other transaction unless the Pledgee releases the Securities from the Pledged Status through an instruction to DTC.\n\n***Wut mean Bobby?***\n\n&#x200B;\n\n[A pledge, ie. collateral to buy your shit](https://preview.redd.it/lfz45upfm6z61.png?width=652&format=png&auto=webp&s=35fd91b20cf4386e8d49488ebba55f597ba559ca)\n\n\\- **Pledgee:**  A Pledgee may but not need be a Participant. A Pledgee is required by DTC to sign a Pledgee’s Agreement unless it is also a Participant. ***This is the person who selling shit.***\n\n\\- **Pledgor**: ***This the person who's trying to buy shit***\n\n&#x200B;\n\n**What are they changing?**\n\n&#x200B;\n\n[Collateral is NOT RELEASED TO THEIR GENERAL ACCOUNT](https://preview.redd.it/p0w14o31n6z61.png?width=1215&format=png&auto=webp&s=c6475cca0fe26894a980945580a2a3f97a247419)\n\nWhat else?\n\n[When you pledge your securities, they are NOT RELEASED BY THE DTC until they clear it.](https://preview.redd.it/erylgxvfn6z61.png?width=1283&format=png&auto=webp&s=a0b6faa0b2b6dbe8757a5256dce03dfbe3ed168a)\n\n**Break it down again**\n\n\\- When the pledgor puts money into the DTC, it get's credited to their account, just like your brokerage account\n\n\\- When the pledgor uses that to buy shit, they get the shit they bought credited to their account, and the the pledgee get's the collateral credited to their account\n\n\\- When the pledge is released by the Pledgee \\[***see below***\\]- i.e. settled - both of the particpants get there shit for real\n\n\\- Until the pledge is released you may **not** use these assets to do any other transactions\n\n&#x200B;\n\n[Only a Pledgee can release a pledge - only if the seller agrees](https://preview.redd.it/lajomoe3p6z61.png?width=1012&format=png&auto=webp&s=df5a089cdc94248945adac517e8ff4e356c73cb2)\n\n*Hard Pledge - sounds a lot like a Hard Locate.*\n\nFurthermore\n\n[The pledgor \\(borrower,buyer\\) is credited through the DTC but NOT released and the same for the pledgee.](https://preview.redd.it/anz6x6zfp6z61.png?width=1333&format=png&auto=webp&s=6fb096c9ea60b2790b3e33f214ea85ea4d973c8e)\n\nSo this is like when you make a trade on your brokerage and the brokerage removes the funds from your account, but you still can't use them until the other person says they're happy with what they got and vis versa. *Still with me?*\n\nWhy is the DTC so concerned with the pledgor / pledgee not moving their shit to their general account? **Because if you get the assets transferred to your general account where they don't have access to them, you can shuffle them off to your shell companies and shove them right back into the DTC or another exchange while you wait for your pledge to settle.** The DTC is effectively not releasing your assets to you **until they know they cannot be rehypothecated inside their system**.\n\n**Wut Bobby? WUT?**\n\nHow do you re-use assets to create failure-to-delivers? Easy, you make deal with a pledgee, you take their collateral and shuffle it out to an affiliate, and then do that process again and again until you get the leverage you need. 1, 2, 3, 10, 20 times leverage, so long as you can do these things quickly, you should be able to get participants to agree before the DTC comes to find \\[**LOCATE**\\] your outstanding balance. Or even better, if you could still use your general account, take that collateral/asset and put it through foreign markets and let them all play the locate game through 50 layers deep of rehypothecated asset chains. **WHO HAS THE SHARE?**\n\nSo you see, SR-DTC-2021-005 wasn't removed for formatting. It was removed because the DTC threatened to pull the fucking market apocalypse on the shorts - since they are the ones who would be rehypothecating assets through the DTC.\n\nIf you were the DTC, you would have wanted this, because of another holder of shares comes knocking on your door for those locates and you're about to fail-to-deliver, it's your ass. So in your deals you're going to be on the hook for whatever blow up happens. And if you don't have enough leverage on the bad actor, you are going to have a really bad time.\n\n&#x200B;\n\n**Speculation at the end**\n\nI suspect that this rule directly relates to Archegos, Goldman Sachs, Credit Suisse and Morgan Stanely. This bill was supposed to be effective April 1, very close to the $4.7 billion realized losses for Credit Suisse. I am guessing this rule and, an aggressive pledgee, spooked Goldman and Morgan Stanley to liquidate assets in order to satisfy the DTC locates, or they were going to go nuclear and liquidate their holdings. Credit Suisse didn't do it fast enough so they got fucked over.\n\n&#x200B;\n\n**Addressing the \"It's a technical change, it's nothing\"**\n\nI don't believe this anymore. After the month of DD that has come out on the sub, it's apparent to me that the global financial market is currently playing the shell game with phantom/rehypothecated/short-sold shares. Lucy, Atobitt, all the bigger brained apes are all coming back to this one problem - **WHERE ARE THE SHARES**. The DTC was about to hold them hostage, they were pulling the fucking nuclear option and hiding it in plain sight.\n\nTo quote:\n\n>As discussed below, the proposed rule change relates to a technical aspect of the operational processing of Pledge transactions ...\n\nand\n\n>... while enhancing clarity with respect to the book entries performed by DTC as they relate to pledge activity\n\nand\n\n>... would not impact the rights or obligations of a Participant or Pledgee\n\nThis means:\n\n\\- There is a technical change that will affect the way money moves within the DTC for our participants\n\n\\- It says exactly what you are not fucking allowed to do now\n\n\\- They should already be playing by these rules, so it ***should*** have no impact on their **rights or obligations**\n\n&#x200B;\n\n**BRING BACK SR-DTC-2021-005 AND BRING IT BACK TODAY.**\n\n&#x200B;\n\nEdit: Before the shills come, a screenshot for proof that this was indeed DTC-2021-005 and not NSCC or any other rule\n\n&#x200B;\n\nhttps://preview.redd.it/viukxaprv6z61.png?width=564&format=png&auto=webp&s=c7585bea221dc8d1fce654d520a0e1347be52cb4\n\n&#x200B;\n\n[Contacts](https://preview.redd.it/enmot9qiz6z61.png?width=519&format=png&auto=webp&s=665bfafaf5e3beccd9e13884e478649f68c38e5d)",
    "title": "Where in the world is SR-DTC-2021-005. We were told over 1 month ago it was taken down for formatting and would be replaced in no more than 2 weeks. Let's talk about it.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ncnz1l/where_in_the_world_is_srdtc2021005_we_were_told/"
}