{
    "author": "cspawn",
    "created_utc": 1623710947.0,
    "distinguished": null,
    "edited": 1623809343.0,
    "id": "nzz9i4",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nzz9i4",
    "num_comments": 165,
    "permalink": "/r/Superstonk/comments/nzz9i4/gamestop_sec_filings_in_611_i_think_i_can_show/",
    "score": 2783,
    "selftext": "***I'm seeing some conflicting numbers like here:\nhttps://reddit.com/r/Superstonk/comments/nx4nr3/ortex_data_reporting_7427m_outstanding_shares/\n\n***\nMods, if you feel this should be taken down, I'll gladly do it.\n***\n\nWhile I don't personally feel the explination makes any more sense than my speculation, I acknowledge that this is a personal theory that some people claim is based on debunked data.\n\nThe data I make this speculation on is all linked below.  Please read it carefully and make your own decisions.  This speculation relies on current reports from Ortex, which some feel is not trust worthy.  I visited Ortex myself and confirmed their currently listed data matches what I'm claiming.  None of the currently available-to-me data exactly matches and no one can point me towards any numbers that are accepted as accurate.\n\nEdit: there are conflicting numbers from multiple different sources.  My THEORY here depends on Ortex and guessing.  This theory contradicts other respected Apes and it's just a possibilty that I thought of.  I've included links to the information this theory contradicts and I'm absolutely not pushing this as anything more than my thoughts!\n\nI was looking at the GameStop SEC filings today and saw 3 new (as of the 11th) filings:\nhttps://news.gamestop.com/financial-information/sec-filings\n\nFirst:\nhttps://news.gamestop.com/node/18986/html\n\nSecond:\nhttps://news.gamestop.com/node/18991/html\n\nThird:\nhttps://news.gamestop.com/node/18996/html\n\nThese are called SEC Form 4's, and they show shares being restricted.  Read them carefully.  The first is George Sherman, the outgoing CEO.  It shows him getting 121,386 vested shares based on closing price on 6/9. With the following note:\n\nExplanation of Responses:1. The Reporting Person (George Sherman) did not sell any shares on the Transaction Date. Rather, shares were withheld by the Issuer on a vesting of restricted stock to cover applicable withholding taxes, with the number of shares withheld based on the 6/9/2021 closing pricing.\n\nWITHHELD\n \nBased on the Form 424B5 we know the float as of 6/1:\n\nhttps://gamestop.gcs-web.com/sec-filings/sec-filing/424b5/0001193125-21-186796\n\nSpecifically page S-4 it says:\nThe number of shares of our common stock to be outstanding immediately after this offering is based on 71,815,131 shares of our common stock outstanding as of June 1, 2021, including 2,435,881 shares of restricted common stock which are subject to forfeiture or our right of repurchase as of such date.\n\nSo total available float as of 6/1 = 71,815,131 - 2,435,881 = 69,379,250\n\nSecond is for new director James Grube and third is for Alain Attal.  These LOOK the same, being given 1,022 shares each, BUT there's a difference, look at the green writing on the bottom:\n\nExplanation of Responses :1. These represent restricted stock units vesting on the date of the next Annual Meeting of Stockholders of the Issuer, subject to accelerated vesting in certain circumstances\n\nSo let's restrict 2,044 shares as of 6/9 to hold for Grube & Attal:\n69,379,250 - 2,044 = 69,377,206\n\nNow 6/10 comes and we see a big drop and Ortex updates shares outstanding to 74.27mil\n\nSo let's add 5,000,000:\n69,377,206 + 5,000,000 = 74,377,206\n\nNow let's take out Mr Sherman's \"withheld shares\"\n\n74,377,206 -121,386 = 74,255,820\n\nThis is where I can't account for about 14,180 shares compared to the Ortex 74.27mil, but those might be hidden aways somewhere in other filing?\n\nPlease share thoughts/feedback!  \n\nEdit: we don't know for sure till GME announces it, but I'm feeling pretty tit-jacked right about now\n\n\nEdit 3: Buy, Hodl, Buckle up",
    "title": "GameStop SEC filings in 6/11, I think I can show all 5mil shares have been sold",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nzz9i4/gamestop_sec_filings_in_611_i_think_i_can_show/"
}