{
    "author": "Dismal-Jellyfish",
    "created_utc": 1626051208.0,
    "distinguished": null,
    "edited": 1626055742.0,
    "id": "oiglhm",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oiglhm",
    "num_comments": 81,
    "permalink": "/r/Superstonk/comments/oiglhm/inflation_alert_st_louis_fed_lead_economist_in/",
    "score": 2185,
    "selftext": "[Source](https://www.stlouisfed.org/on-the-economy/2021/may/housing-prices-surpass-bubble-peak-measure-value) 5/24/21\n\n[Price-to-rent has surpassed that of the last housing bubble peak. ](https://preview.redd.it/ou04wrrwfoa71.png?width=880&format=png&auto=webp&s=7db8f70f87ffb22f587b480862959c73ba61a8ac)\n\n# Some interesting excerpts from the report:\n\n>The nationwide house **price-to-rent ratio, a widely used measure of housing valuation that is analogous to the price-to-dividend ratio for the stock market, is at its highest level since at least 1975**, as shown in the figure. Rapid house price appreciation since last May, combined with a slowdown in rent growth, resulted in a surge in this ratio. **By February 2021, the national house price-to-rent ratio had surpassed the previous peak reached in January 2006; in March 2021, the ratio was 1% higher than its level at the peak of the housing bubble. This suggests the average house now sells for quite a bit more than its “fair value,”**\n\nThis report is from May. Remember, [we just covered](https://www.reddit.com/r/Superstonk/comments/ohy4mi/inflation_alert_rent_prices_are_spiking_as/) that rent prices are now also spiking.\n\nMeasuring House Prices …\n\n>There are many different house price indexes for the nation as a whole as well as for particular regions, states, counties and metropolitan areas.[3](https://www.stlouisfed.org/on-the-economy/2021/may/housing-prices-surpass-bubble-peak-measure-value#) There is no perfect house price index, so I constructed one for this article by combining two high-quality indexes: (1) the Federal Housing Finance Agency (FHFA) Purchase-Only House Price Index for the United States, and (2) the Freddie Mac House Price Index. The FHFA index is methodologically superior to many other indexes but it has a relatively short history of about 30 years. The Freddie Mac index is similar methodologically but draws from a smaller sample each month. Its primary advantage is a longer data history (about 46 years). More details on the indexes are in the [appendix](https://www.stlouisfed.org/on-the-economy/2021/may/housing-prices-surpass-bubble-peak-measure-value#appendix).\n\n… and Rents\n\n>I used the shelter component of the consumer price index for all urban consumers (CPI-U) to measure the imputed rent paid for owner-occupied housing. Owners’-equivalent rent of residences (OER), a subcomponent of the shelter index, is a closer match to what I want to measure, but its data history is not as long as that of the shelter index. As detailed in the appendix, the shelter and OER indexes produce nearly identical conclusions, so I used the longer data series.  \n>  \n>**With these data, we can calculate a ratio of house prices to rent; with the earlier assumptions, we can also point to a ratio indicative of fair value for housing. During the entire 46-year period shown in the earlier figure, the average value of the ratio is about 78. As of March, the nationwide house price index was about 30% higher than the estimate of fair value produced by this approach**.\n\nAlso\n\n>Will This Time Be Different?  \n>  \n>Are we experiencing another housing bubble? Should we expect housing to play an important role in the next downturn? **The risks facing households, the financial system and the economy appear less serious now than they were in 2006**. Most importantly, homeowners today have greater home equity and less mortgage debt, on average, than they did then. But the elevated level of the house price-to-rent ratio surely merits caution and further study.\n\nThe more we cover all of this data together, the more it seems the following is going to stop the stock market from growing in its tracks:\n\n* The end of the eviction moratorium\n* Requirements that mortgage/credit payments be resumed\n* End of extended unemployment benefits\n* Resumption of student loan repayments (thanks for the shout in the comments u/Delstragoy)\n* Federal debt limit battle which may result in less government stimulus (not to mention we are entering election season and both sides are going to want to point the finger at each other for blame on economy blowing up)\n* The Fed may be actually being serious about tapering QE\n* Upcoming bankruptcies of more firms\n* Regionalized labor disruptions due to Covid\n\nAdd that to the inflation monster that has been unleashed?\n\nhttps://i.redd.it/3znnehbbjoa71.gif\n\n[ Thanks for dropping by and taking a dive! Please let me know if you have any questions or areas to explore, happy to try and help! ](https://i.redd.it/yoe034rfjoa71.gif)",
    "title": "Inflation Alert! St. Louis Fed Lead Economist in Supervision Willaim Emmons reported price-to-rent ratio is at its highest level since at least 1975. As of March, the nationwide house price index was about 30% higher than the estimate of fair value.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oiglhm/inflation_alert_st_louis_fed_lead_economist_in/"
}