{
    "author": "PWNWTFBBQ",
    "created_utc": 1626034228.0,
    "distinguished": null,
    "edited": 1626113117.0,
    "id": "oibnz2",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oibnz2",
    "num_comments": 480,
    "permalink": "/r/Superstonk/comments/oibnz2/there_have_been_a_lot_of_dd_that_is_more_karma/",
    "score": 9519,
    "selftext": "# Linear Regression Girl who \"may have\" figured out the shorting algorithm here.\n\nI have seen an influx of posts saying they \"found the algo\" but haven't produced anything more than a graph with lines instead of performing statistical comparison on population to populations and within sample statistical comparison. This has led to a lot of misleading points. If you can't prove it with math and are just drawing lines, it is PURE observational bias.\n\n# Recent Shit Post\n\nI've noticed a recent influx of people stating the algo speaks to them and I wanted to address a few posts that uses bad math (actually, no math at all).\n\n# Using a linear scale for the entire history is not the best idea\n\nIn the past when the exponential floor was making SO MUCH SENSE, I also wanted to look into it. I started with changing from using total net days to just trading and [got this](https://www.reddit.com/r/Superstonk/comments/ny68t6/technical_analysis_from_an_enginerd_that_has_a/?utm_source=share&utm_medium=web2x&context=3). Observational bias would conclude how events affect the price. At this point, I think it's safe to events don't do that. Without more population comparisons, I came up with this chart.\n\nhttps://preview.redd.it/ynkc1ecs1na71.png?width=2591&format=png&auto=webp&s=00c541506403750a5652add7d4e0ba395900e774\n\nI continued to look into using typical rates of change and removing data from that. In this [post](https://www.reddit.com/r/Superstonk/comments/nzcg0j/simple_linear_regression_using_real_world_data/?utm_source=share&utm_medium=web2x&context=3), I figured the rates of change from one day to the next would be helpful. Again, another inaccurate assumption since I wanted to make the exponential floor work somehow and explain why it was deviating at the time. (This is a continuation of an idea that I believe to be incorrect.)\n\nhttps://preview.redd.it/thkt9ypv2na71.png?width=793&format=png&auto=webp&s=0b85ce6686ba22a2f46680d1b40ce32c559301c2\n\nCurrently, we are seeing this [post](https://www.reddit.com/r/Superstonk/comments/oi10y3/the_algorithm_it_speaks_to_me_it_says_400_this/?utm_source=share&utm_medium=web2x&context=3) which is using the same idea of applying a linear equation to the overall timeline. Like the exponential floor, it places a flat line but instead of the low, it is using the closing price. From my listed examples above even when I did use some sort of math to determine a line, the underlining assumption of having a single line to describe everything was incorrect.\n\nhttps://preview.redd.it/9y2u2lt53na71.png?width=960&format=png&auto=webp&s=4dc6b3657f229b8ab1e2e383666b2cb800db64e2\n\nThere are some really concerning things about this:\n\n# The most fucking important one!!\n\nWhen we post DD to SuperStonk, it is meant to be reviewed by peers. I know my limitations such as finance stuff so I like to have those people chime in. I also do it so anyone can tell me I'm wrong. I've already admitted and accept to that I have been wrong in the past. However, some people who post DD do not take kindly to their posts being challenged.\n\n&#x200B;\n\nhttps://preview.redd.it/mqkj2zkm3na71.png?width=869&format=png&auto=webp&s=575158abe514c240f4e3570a4f35d1aeb92c1202\n\nhttps://preview.redd.it/o9hcyi7r3na71.png?width=735&format=png&auto=webp&s=fccfdb8bcd68bc979281d757af82d60edc3eb27d\n\nhttps://preview.redd.it/d071cu6v3na71.png?width=844&format=png&auto=webp&s=df07948e0230d8f05a0e06fcd36972dd09589419\n\n# Overall Thoughts\n\nWe post DD for peer review. Sometimes, we are right and sometimes we are wrong. Despite if we like the response or not, it should be taken into consideration for the next series of DD. For any given DD, OP should be able to defend their argument or at least take it into account for the next series.\n\nJust because you like what you see, does not mean it is right. The term \"observational bias confirmed\" is meant to be used a satire and not the center point of any authentic DD.\n\nEdit / add-on: I am not saying to not do any TA. I am expressing if you are going to make a point, be prepared to have it backed by some fact based evidence as well as to be criticized by your fellow apes. It is not what the topic is. This is discussing how it is being presented and accepting how it may be reviewed.\n\n# Question everything.\n\nI believe the \"Possible DD\" and \"DD\" flair should be removed and replaced by \"Speculation\" until it has been successfully peer reviewed. Mods would then grant the \"Possible DD\" or \"DD\" flair for (potentially) accurate submissions and \"Debunked\" for incorrect ones.\n\n# Ape Level Situation\n\nLet's say you're watching the news, and in the news, this article is talking about a subject that you have vast knowledge on. You immediately know it's wrong and get pissed and annoyed. Then, what typically happens is you read the next article (which is about a topic you have little to knowledge about) and you immediately accept whatever it saying is truth despite how both of these articles came from the same newspaper. The newspaper here is r/SuperStonk and each article is a post.\n\nEdit: TL;DR: Ultimately DD doesn't matter. Some are accurate, however, a lot of it is wrong. Take DD as a \"fun\" flair. The only thing that matter is buy and hold.\n\nEdit 2: ape level situation\n\nEdit 3: better wording for easier understanding\n\nEdit 4: I wrote this post the way I did so I could show how I have been wrong in the past with some of my analysis. However, with each failed research, a new and better one has been created through the inputs of my fellow apes. It's ok to be wrong. Just learn from it.\n\nEdit: removed intro image because I misinterpreted it as satire. ",
    "title": "There have been a lot of DD that is more karma farming than actual anything of scientific, research, or mathematical basis.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oibnz2/there_have_been_a_lot_of_dd_that_is_more_karma/"
}