{
    "author": "Common_Compote",
    "created_utc": 1626551269.0,
    "distinguished": null,
    "edited": 1626605936.0,
    "id": "ombbfp",
    "text_only": true,
    "flair_text": "𝐑𝐞𝐯𝐢𝐞𝐰𝐞𝐝 𝐃𝐃 ✔️",
    "name": "t3_ombbfp",
    "num_comments": 97,
    "permalink": "/r/DDintoGME/comments/ombbfp/back_to_basics_why_gme_is_still_a_deep_fucking/",
    "score": 1075,
    "selftext": "Since January, anytime i see any FUD, there is always one thing that puts me back at ease, the fundamentals and the price of GME stock compared with other popular stocks on the market.\n\nI do have a background in finance, M&A, and valuation of private businesses, but what i am about to share below is very basic, so that everyone can understand it and check for themselves.\n\nFirst, some basic definitions for the smooth brains:\n\nP/E - Market cap / Earnings, used to measure how many years it will take for the company to make enough money to pay for the value of the company. Basically a ROI or break even point. The problem with this is that companies like amazon have reinvested their earnings back into the company, skewing this ratio in the process, or even having it negative.\n\nP/S - Market Cap / Revenue(sales), i think this ratio is more important for modern companies, as we can compare the overall size of the company compared to its combined stock price, without worrying about its “current” profit. For example, Spotify is is still not showing a profit after all these years, but at 8bill usd revenue, it would be quite easy for them to increase the price of the service by lets say 5% and have a profit of 400mill if they wanted to. I think it is safe to assume, that if a e-commerce company is well managed, it can turn between 10-20% profit fairly easily (especially with Ryan Cohen leading it).\n\nNow, with that out of the way, lets compare our favorite company with a few other popular and similar companies based on the P/S ratio. Note that this does not consider the yearly growth of the companies in question and inflation (currently at 5.4%), so i will calculate the ROI at the upper limit of 20% profit to make it simple.\n\nAmazon     \n1.8T (Market Cap)\n\n420B (Sales)\n\n4.9  (P/S ratio)\n\n24 years (ROI at a 20% profit)\n\nNewegg     \n11.2B         \n2.1B      \n5.3    \n26 years  (ROI at a 20% profit)\n\nTesla          \n620B         \n35B      \n17.3   \n86 years  (ROI at a 20% profit)\n\nChewy        \n32B           \n7.7B      \n4.2    \n21 years (ROI at a 20% profit)\n\nGamestop  \n12.6B         \n5.4B     \n2.3    \n11 years !!!!!  (ROI at a 20% profit)\n\nAs you can see, even without considering the 50% yearly growth potential of GameStop due to its digital transformation, which I am expecting, it is still a deep fucking value play when compared to the rest of the market, with between 2x-8x the ROI potential of the companies above.\n\nTldr: GME currently should be AT LEAST DOUBLE in price, only based on the basic fundamentals - EVEN WITHOUT THE MOASS!",
    "title": "Back to Basics! Why GME is still a Deep Fucking Value play at 170USD, based solely on the fundamentals!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/ombbfp/back_to_basics_why_gme_is_still_a_deep_fucking/"
}