{
    "author": "Cryptids4Sale",
    "created_utc": 1625774673.0,
    "distinguished": null,
    "edited": 1625775313.0,
    "id": "ogf8cy",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ogf8cy",
    "num_comments": 60,
    "permalink": "/r/Superstonk/comments/ogf8cy/pantheon_part_i_kenneth_griffin/",
    "score": 313,
    "selftext": "&#x200B;\n\n[It isn’t what you know; it’s how rich your friends are](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwallup.net%2Fwp-content%2Fuploads%2F2016%2F03%2F03%2F311093-classic_art-painting-history-greek_mythology-artwork.jpg&f=1&nofb=1)\n\n**NOTE:**   If this DD looks familiar, it’s because it is. This is a repost of a   prior DD I wrote, with a shiny new title. I won’t go into details here,   but [here](https://www.reddit.com/user/Cryptids4Sale/comments/ofzb1d/an_update_regarding_friends_in_high_places_7721/?utm_source=share&utm_medium=web2x&context=3)   is a link to a post on my personal account page where I clear it up.   Long story short, this is a do-over, AND, the start of what will be a   whole new series, but more on that later.\n\n# PANTHEON - PART I: KEN GRIFFIN\n\n**TA;DR**   \\- Kenneth Griffin is the CEO and Co-CIO of Citadel LLC, and it’s   underlying branches. From his start with Citadel in the 1990s to the   present, Griffin became one of the most recognizable faces in the world   of finance following a string of trading successes which left the   company the largest market maker on the New York Stock Exchange. Such a   reputation and such achievements are impossible without an extensive   network of connections. This new DD series, “PANTHEON,” will not only   track Griffin’s connections to Wall Street and beyond, but will dig into   the other major players in the field as well, to create a more  complete  picture of what apes are up against. Part I covers Griffin’s  Biography,  while Part II will cover his connections. Following parts  will be  planned, drafted, and released as time goes on. Stay tuned ;) [PART II](https://www.reddit.com/r/Superstonk/comments/ogfbrn/pantheon_part_ii_citadels_network/?utm_source=share&utm_medium=web2x&context=3)\n\n**Disclaimer:**   All the information presented here is sourced from publicly-accessible   sources. This post is not intended to be defamatory or accusatory in   nature. Any speculation on the part of the author is just that;   speculation, and not intended to be taken as fact. This is not financial   advice.\n\nIntroduction\n\nThere’s a saying in the business world about how people typically gain success: “It’s not *what* you know, it’s *who*   you know”. This of course means that, it’s generally more advantageous   to have connections to people than it is to have technical skills…  Which  spits in the face of merit, of course, but hey, I don’t make the  rules  here, I just write ‘em down in crayon. One may also argue,  actually,  that this is especially true when the connections you have  happen to be  fucking obscenely rich and powerful.\n\nJust ask Bill and Jeff… And, you know… their parents…\n\nDamn, I *wish*   they’d loan a couple bucks to a sad, glue-huffing, crayon-eating, sack   of shit like me too one day if this whole thing goes   tits-to-the-concrete somehow. Just like I wished back in 6th grade that   girls would want to mack with an overweight, bowl-cut-having-ass,   gap-toothed comic nerd. Or like I wished I could trust that fart back   during finals week of my sophomore year of college. Please, for fucks   sake, I just need one win.\n\n[please](https://preview.redd.it/1fbv4a5no1a71.jpg?width=612&format=pjpg&auto=webp&s=92be1aed6117c2cd41d8bc8497557ad71b45631c)\n\nBut anyway, that’s what this DD series is about: ~~shitting myself~~ tracking the connections between insanely wealthy/powerful people that have quite a bit to gain by *helping each other out.*   Obviously, if nothing official has come out about such connections, I   can’t claim anything definitively, but I think for now it suffices to  be  able to point out potential conflicts of interest, or places where   people are getting unfair kickbacks. Speculatively, of course.   Naturally, because of the sheer volume of information out there (fuckin’   oops, spoiler alert!), this series will need to be split up into   multiple parts, which will come out in their due time. For now, we’re   just focusing on our favorite; Mr. Mayo himself.\n\nHave   I teased you enough, apes? Ready to get to the juicy details? Well   saddle the fuck up, pardner, you’re in my godforsaken informational   rat-rodeo now, and as king-shit rhinestone rodeo clown of these parts,   I’m about to give the bull you’re squatted down on the mightiest slap on   the ham hocks ever hand-delivered on this side of the Mississippi.\n\n[YEEEEEEEEEEEEEE HAAAAAAAAAW](https://preview.redd.it/s1m95cdpo1a71.jpg?width=1120&format=pjpg&auto=webp&s=fc279c1a542c90e7af269fd68ae2a7618fcd38d2)\n\n# Beginnings: A Fistful of Grandma’s Money\n\nKenneth   Cordele Griffin was born on October 15th, 1968, in Daytona Beach,   Florida. (Yes, Florida man confirmed). His Grandmother, Genevieve   Huebsch Gratz, was the inheritor of an oil business, three farms, and a   seed company, which were founded by Griffin’s grandfather. More   accurately, founded by Griffin’s Grandfather, who borrowed money from   Genevieve’s mother to get a start (he would later end up in the fuel oil   distribution industry). After spending some time in both Texas and   Wisconsin, Ken returned to Boca Raton, Florida, to attend both middle   and high school (Boca Raton, of course translates directly to “Mouse   Mouth,” because fucking of course it does; what the fuck is wrong with   you, Florida?). In 1986, after writing applications to 13 different   universities, and intending to go to Princeton, Griffin ended up   attending Harvard to pursue a degree in Economics.\n\nDuring   his first year at Harvard, Griffin encountered a print article where  an  author expressed the opinion that the stock for the Home Shopping   Network was, at the time, overpriced. Griffin was convinced by the   argument, and so made his first trade. He purchased 2 puts on the   security, and turned a profit of a few thousand dollars after the price *did*   go down. First profit on shorts. You can’t fucking write this shit.   With a growing interest in stocks, Griffin convinced the university to   allow him to install a satellite dish on his dormitory building to   obtain real-time stock prices over the phone; this was allowed because   technically Griffin wasn’t running a business. (Fun fact: Griffin bought   a single dormitory to “avoid bothering” a room mate he may potentially   have had). Griffin has very proudly chronicled this tale many times to   highlight that he installed the satellite himself.\n\nIn   1987, Griffin took this interest a step further, asking Terrence J.   O’Connor of Merrill Lynch for advice on how to trade convertible bonds.   He would go on to open an account with $100,000 collected from his   grandmother, dentist (??? weird choice but go off I guess), and others.   Griffin launched his first fund the same year with $265,000, and, using   investment strategies that happened to thrive in a volatile market   environment, managed to turn a profit off of the notorious Black Monday   Crash. Again, you can’t write this. Griffin graduated in 1989.\n\nShortly   afterward, Ken began a working relationship with Frank Meyer of   Glenwood Capital; Impressed with Griffin’s record, Meyer gave Griffin a   cool $1 Milly to invest on behalf of the company (you know, to see how   he’d do). Griffin made returns of 70% in one year. In 1990, Griffin   founded Citadel with $4.6M in assets, some of which were contributed by   Meyer. In ‘91 and ‘92, Griffin made 34% and 41% returns, respectively.   In \\[this\\] interview with David Rubenstein, Griffin expresses that he  was  fortunate to grow up in a family of entrepreneurs that were willing  to  support his move to open an investing firm so early in his life.  Which  is so fucking unfair. When I told my parents that I wanted to be  an  Orangutan instead of growing up and getting a job, they just took me  to a  fucking therapist that kept saying I had “schizophrenic  delusions,” and  “blatant disrespect for public decency laws.” Fucking  whatever that  means. If Dr. Hughes was actually smart, he’d know that  apes don’t wear  clothes.\n\nCitadel  obviously  continued growing year by year, and by 2003, Griffin became  the youngest  “self-made” individual on the Forbes 400 list at 34 years  old.\n\n# Balls, Chains, Banks, Crashes\n\nThis   is where things start to get more interesting and complex. During the   previous period of growth, Griffin would marry (and then in 1996,   divorce) a “highschool sweetheart,” Katherine Weingartt. In 2002,   Griffin met Anne Dias-Griffin, who he would marry in July of 2003 and   have 3 children with. Anne herself had an impressive track record thus   far in the financial world; she is a graduate of Harvard, and had worked   with Goldman Sachs, Soros Fund Management, and Viking Global Investors   before starting the $55M firm Aragorn Global Management herself. What  an  absolutely LEGENDARY girl boss; it’d be inspirational if those  actions  didn’t almost certainly exploit a ton of people. And, well, Ken  was also  the lead investor. And he lost 20% of his investment… Oh no…  Well,  losing Ken’s money could be more or less of a legendary girl boss  move,  depending on how you look at it.\n\n[I swear I can't find more than a handful of images where her eyes don't look downright predatory](https://preview.redd.it/mikdjluto1a71.jpg?width=2048&format=pjpg&auto=webp&s=c4016ac67a1c088d09db2c8857a28fb615a54b59)\n\nAnd,   of course, Citadel didn’t stop there. In 2006, Amaranth Advisors, a   firm with $9B of funds under management saw a 65% loss on their   investments following a downturn in the natural gas market; Citadel and   JP Morgan swooped in and purchased their energy assets at a “steep   discount.”\n\nThen 2008 arrived, and   the financial sector delivered a mighty flick to the testicles (or  punch  in the boob, for the female apes in the audience) of the American   people and their wallets, homes, and retirement funds; everyone   collapsed, gasping for air, in tremendous pain, unable to trust anyone   again for years following. Citadel had grown from about 3 employees to   1,300 - 1,400 employees, and with AUM (assets under management) around   $25B. The crash, of course, occurred, due to the subprime mortgage   crisis, and Citadel was caught in the crossfire of it. At the time,   according to info from a 2006 SEC filing, Citadel was approximately   leveraged at a ratio in excess of 7.8 to 1 (earning the company a rating   by Standard and Poor’s rating service that was “just above junk,”   before Citadel quickly asked them to be removed.) Must be nice being   able to ask people for things. Like being able to ask Mom and Dad to   stop going to those appointments with Dr. Hughes, because what the fuck   is the point of going if he isn’t going to at least hear me out about   stretching my arms out and gluing hair to them to look more like an   Orangutan and... Fuck it, it’s not worth it.\n\nBear   Stearns, of course, collapsed, and though Citadel was listed as one of   the potential buyers for assets previously belonging to BS (see what I   did there?), they never purchased any. In fact, it was believed by   senior BS employees that Citadel was shorting the company into   bankruptcy (Stocks are like Star Wars; they rhyme, and become   progressively more monopolistic as time goes on), and so the two parties   never met to even discuss the possibility.\n\nCitadel   was also near collapse; as Ken has said many, many, times, they were   bleeding “hundreds of millions of dollars a week.” To the company’s   credit, they did make sacrifices and survived, but not without some   serious blows to the head, neck, and groinal region. The Kensington   Global Strategies Fund (now Citadel Securities? This is unclear) and   Citadel Wellington LLC (now Citadel LLC?) Fund, and the money charged   for investment performance, were Citadel’s primary means of income at   the time. Because both funds suffered such tremendous losses, Citadel   was unable to charge for their financial management services for these   funds until the funds returned to profitability once again in 2012.   After AIG was bailed out following the economic crash of 2008, Citadel   “indirectly received $200M in taxpayer money”. And here I am. Sitting   with my thumb in my ass, still waiting on a 3 figure tax return. Fuck.\n\nBetween   then and now, Citadel resumed growth, and is now estimated to have  $30B  AUM as of October, 2020. Oh, and Ken got divorced again in October  of  2015, after lots and lots of fights with his wife. It seems like it  was  really just an enormous mess; Anne got a lot of money ($22.5M) at  the  start of the marriage from prenups, then $1M each year after that,  and  50% of their Chicago penthouse, which Ken bought back for $11.5M in  the  divorce… Then there were fights about who could go to which  properties,  and arguments over spending too much child support money to  support her  “opulent” lifestyle, and really just all the other shit  rich divorcees  fight over.\n\nI get  it though. If I  could, I’d marry Ken to divorce him and take some  money, too. Then I  could pay Mom and Dad back for the visits to Dr.  Hughes, and then maybe  then they could stop fighting over money and  stay together...\n\nThen  GME  happened, but I presume if you’ve made it this far, you already   probably know plenty about that. That was a lot of reading, here’s a fun   picture to break up the text!\n\n[hehe funny monkey](https://preview.redd.it/pxr4zwozo1a71.jpg?width=474&format=pjpg&auto=webp&s=e433a60e9b050ed0f0365a5a68729819521d0176)\n\nThe   remainder of this post is much less linear; we’ll just be going over   some extraneous finance information, and then I’ll offer some of my   personal insights into Ken’s personality based on the hours of content   I’ve absorbed about him.\n\n# Payday: How Much did Ken Make, Even After the Crash?\n\n* 2009 - $900M\n* 2014 - $1.4B\n* 2016 - $600M\n* 2017 - $1.6B\n* 2018 - $870M\n* 2019 - $1.5B\n* 2020 - $1.8B\n\n# Political Beliefs\n\n* Self-Described “Reagan Republican”\n   * This   is actually kind of funny and ironic given how much Reagan agreed with   more liberal policies early on in his life; but that’s a tale for   another time.\n* Favors small government and low taxes\n* Some negative takes against “populist’ policies\n* “\\[the belief\\] that a larger government is what creates prosperity, that a larger government is what creates good \\[is wrong\\]”.\n\n# Spending Habits\n\nKen mostly spends an absurd amount of money on properties and art.\n\n**Properties**\n\n* Full floor apartment, NYC\n* Two apartments, top of the Faena House, Miami Beach, Florida\n* Oceanfront homes, Four Seasons Resort, Kona District, Hawaii\n* Two homes, Aspen, Colorado\n* Penthouse apartment at the No. 9 Walton, Chicago, Illinois (most expensive purchase in the city at the time)\n* Full floor penthouse, Waldorf Astoria private residences, Chicago, Illinois\n* “3 Carlton Gardens,” a mansion in London\n* Building a grand, waterfront estate in Palm Beach County, Florida as of 2020\n* 7-acre oceanfront compound, Southampton, New York (bought from Calvin Klein)\n* Several properties on Star Island (Doesn’t specifically mention in which state this is)\n* Collectively worth about $1B\n\n**Art**\n\n* Willem de Kooning’s “Interchange” ($300M)\n* Jackson Pollock’s “Number 17A” ($200M)\n* Paul Cezanne’s “Curtain, Jug and Fruit Bowl” ($60M)\n* Jasper Johns’ “False Start” ($80M)\n* Various others - collectively estimated to be worth \\~ $800M\n\n**Private Jets**\n\n* 2001 Bombardier Global Express ($9.5M)\n* 2012 Bombardier GLobal 6000 ($50M)\n\n**Philanthropy - Education**\n\n* Bill and Melinda Gates Foundation (Charter Schools)\n* Harvard University - $150M  (2014)\n* Obama Foundation - $1M (Oct. 2017)\n* University of Chicago Economics Department - $125M (Nov. 2017)\n* Field Museum of Natural History - $21.5M\n* Museum of Science and Industry (Chicago) - $125M (Oct. 2019)\n* Chicago Symphony Orchestra\n\n**Philanthropy - Poverty**\n\n* Chicago’s Center for Urban School Improvement\n* Lurie Children’s Hospital\n* Robin Hood Foundation (not related to the brokerage)\n\n**Philanthropy - Art**\n\n* Museum of Contemporary Art, Chicago - $10M ( Feb. 2015)\n* Art Institute of Chicago - $19M (July 2007)\n* Museum of Modern Art, New York - $40M (Dec. 2015)\n* Norton Museum of Art - $20M (Dec. 2018)\n\n**Philanthropy - Religion**\n\n* Fourth   Presbyterian Church of Chicago - $11.5M (2011) (Griffin was married at   this church, and is a member). New modern chapel building is called  the  “Gratz Center” after his grandparents.\n\n# Vibe Check - A Character Study\n\n[why are you running? why are you running?](https://preview.redd.it/o5fy8iz3p1a71.jpg?width=900&format=pjpg&auto=webp&s=185f093a062a3cb30ceddbaf2c68857c3e318a31)\n\nAfter   reading a lot about Ken and watching a lot of his talks (literally   hours, usually during the wee hours of the morning) I’ve put together   the following list of observations that may hopefully prove useful in   understanding at least a portion of Citadel’s actions during the GME   Saga\n\n* Ken   is obviously very well informed on markets, trading strategies,   macroeconomics, business leadership, and finance; but, he also seems to   gravitate towards technology trends and human psychology. Much of   Citadel’s business model is about leveraging technology and a   well-informed team to make the best trading decisions as quickly and as   efficiently as possible, specifically in ways that exploit typical  human  behavior\n* Ken   has a background in computer programming, further lending to the idea   that he himself is likely quite tech savvy even to this day; his   discussion of \\*\\*Internet Money Coins\\*\\* with CNBC lends further to the   idea that he continually studies emerging tech.\n* Definitely   a “numbers” guy in terms of thought processes, with a strategic way of   thinking; always looking for new avenues and evaluating strengths and   weaknesses of them before acting.\n* Citadel is seen by Ken as a “meritocracy”\n* Ken   notably pauses during speech to choose his words carefully; he knows  to  filter thoughts before putting them out into the world, especially  when  they’re recorded.\n* Ken   is strongly averse to portfolio managers going into “defense mode,”  and  prefers to be on the offense, growing, and confident.\n* Ken   very clearly learned a lot of lessons from 2008, and after frantic   growth following the crash, I imagine Citadel is even more of a force to   be reckoned with. That being said, is it possible that confidence   specifically from those lessons could prove fatal to the company?\n* He really just doesn’t blink a lot, does he? It’s kind of jarring.\n\nPart I Conclusion\n\nKen   is a really interesting case study. He’s someone that, on the surface,   can actually seem quite affable given how clearly knowledgeable and   experienced he is. He cracks a pretty fair amount of jokes during   interviews and is willing to self-deprecate to an extent, and in   interviews, he isn’t shy about how much he enjoys the arts and   supporting education. But, of course, one has to keep in mind: Citadel,   and by virtue of leading it, Ken, have made incredibly predatory moves   that have crushed businesses just to turn a quick profit. Even without   the connection information I have in the DD entry to follow, we’ve *seen*   some of these predatory actions unfold. They may just be slaps on the   wrist that ultimately don’t do much, but you don’t get slaps from the   fucking SEC and hounded by Senate Committees on camera because you’re   being a nice, pleasant person that does nothing but help. Hell, payment   for order flow on it’s own is plenty of reason to distrust Citadel, if   the average non-ape investor gave a shit about it.\n\nIt’s   an interesting divide between public and private personas, if nothing   else. How exactly did he end up there? I don’t know, I’m not a shrink,   and to be quite honest, I’m tired of reading and talking about him.   We’re here, and there’s no going back now.\n\nThank   you so much for reading, I hope you’ve enjoyed this post! Part II will   be released immediately following this release, so if you’re reading   this now, I would be willing to bet that Part II is also out there for   you to pick up and take a look at. Ah, what the heck, you’ve earned it; here’s the [link](https://www.reddit.com/user/Cryptids4Sale/comments/ogei7u/pantheon_part_ii_citadels_network/?utm_source=share&utm_medium=web2x&context=3)!\n\n[Thank you for supporting my dreams! \\(Fuck you, Mom and Dad\\)](https://preview.redd.it/nmerckc7p1a71.jpg?width=480&format=pjpg&auto=webp&s=c18e7d40c760a63c5bc00b15f539aaf01f218030)\n\nStay tuned for more PANTHEON!\n\nLinks to articles/videos used in research\n\n[https://en.wikipedia.org/wiki/Kenneth\\_C.\\_Griffin](https://en.wikipedia.org/wiki/Kenneth_C._Griffin)\n\n[https://en.wikipedia.org/wiki/Citadel\\_LLC](https://en.wikipedia.org/wiki/Citadel_LLC)\n\n[https://www.chicagomag.com/Chicago-Magazine/June-2011/The-File-on-Citadels-Ken-Griffin/](https://www.chicagomag.com/Chicago-Magazine/June-2011/The-File-on-Citadels-Ken-Griffin/)\n\n[https://www.cnbc.com/2020/03/06/photos-how-citadel-billionaire-ken-griffin-spends-his-fortune.html](https://www.cnbc.com/2020/03/06/photos-how-citadel-billionaire-ken-griffin-spends-his-fortune.html)\n\nCNBC Interview\n\n[https://www.youtube.com/watch?v=5KOT0\\_I4Fvw](https://www.youtube.com/watch?v=5KOT0_I4Fvw)\n\nDavid Rubenstein Interview\n\n[https://www.youtube.com/watch?v=\\_wRQIhtX0Wo](https://www.youtube.com/watch?v=_wRQIhtX0Wo)\n\nGoldman Sachs Interview\n\n[https://www.youtube.com/watch?v=bM2BZL54O6o](https://www.youtube.com/watch?v=bM2BZL54O6o)\n\nGeorgeTown University Speech\n\n[https://www.youtube.com/watch?v=yP79mQSlGbg](https://www.youtube.com/watch?v=yP79mQSlGbg)",
    "title": "PANTHEON - PART I: KENNETH GRIFFIN",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ogf8cy/pantheon_part_i_kenneth_griffin/"
}