{
    "author": "anonymous_agama",
    "created_utc": 1624815585.0,
    "distinguished": null,
    "edited": false,
    "id": "o91rxv",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o91rxv",
    "num_comments": 196,
    "permalink": "/r/Superstonk/comments/o91rxv/american_homebuyers_are_being_forced_to_buy/",
    "score": 974,
    "selftext": "Sharing this video of Krystal and Saagar giving an excellent criticism on this nonsense Bloomberg article that makes the argument that America SHOULD become a nation or renters. They also get into things like housing being the number one way to accumulate generational wealth, BlackRock buying up the housing market (apes know why)  and potential homebuyers either giving up or being forced to be overly competitive and pay insane prices for houses “as is” that, in some cases are coated in piss and shit.  \n\nDoesn’t matter what anyone’s political ideologies are, that’s unacceptable. We need more agency in this game. I’m lucky enough to have found a good, affordable house a few years ago but I’d be screwed trying to find one in the same area and same cost now.  I hold for those apes who will use their diamond hands to plant that seed money for their first home that they absolutely fucking deserve. \n\n\nHere’s this shitty Bloomberg article they criticize\nhttps://www.bloomberg.com/opinion/articles/2021-06-17/america-should-become-a-nation-of-renters\n(Paywall but I was able to open by using a different browser)\n\nHere’s the Breaking Points episode clip (full thing is about Housing)\nhttps://youtu.be/OIXkeYYum6k\n\nSorry if this breaks the no politics rule. I like that rule and will gladly take it down if so. It’s a political show but this clip isn’t about standard politics, just about how he middle class and poor are being squeezed out of the housing market. I just want to squeeze back. I just like the stonk. Not financial advice\n🦍🚀🌖",
    "title": "American homebuyers are being forced to buy literal shit homes for unbelievable prices and being told to like it.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o91rxv/american_homebuyers_are_being_forced_to_buy/"
}