{
    "author": "Dismal-Jellyfish",
    "created_utc": 1625776703.0,
    "distinguished": null,
    "edited": false,
    "id": "ogfwxn",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ogfwxn",
    "num_comments": 36,
    "permalink": "/r/Superstonk/comments/ogfwxn/tldr_power_to_the_players_is_real_and_apesgamers/",
    "score": 612,
    "selftext": "[Hello r\\/Superstonk, Jellyfish here! ](https://i.redd.it/p6o856kjt1a71.gif)\n\nBefore I get to the hype I have prepared for [r/Superstonk](https://www.reddit.com/r/Superstonk/), I want to take a moment to share my personal hype.\n\nThis community ROCKS! I know this is nothing new to anyone who has been here more than 5 minutes, but the shift and tone I have seen in crypt0 and E t h e r e u m is new.\n\nI know the community likes to go on about how it is a bunch of smoothed-brained Apes, but the critical thinking and engagement with the new crypto and E t h e r e u m information is truly humbling and inspiring.\n\nhttps://preview.redd.it/vpv3e9bpt1a71.jpg?width=1667&format=pjpg&auto=webp&s=9cdf55c3b19687e47a297f44c4762d0f12495229\n\nWhen I first started broaching the subject, the initial Ape response was skeptical to outright hostile towards these subjects. **I can’t express to you how happy this makes me!** (well outside some of the more personalized shill responses I received). Here I was, coming to [r/Superstonk](https://www.reddit.com/r/Superstonk/) claiming I have a silver bullet with regards to GameStop’s transformation and foray into an NFT marketplace and metaverse.\n\nRather than dogpiling in and hyping things out of proportion, the community dug its heels in and flexed the critical thinking skills that have been passed down and developed from working and learning from the brilliant minds of this sub: Queen Kong, Lucy Komisar, Wes Christian, u/dlauer, u/mcuban, u/atobitt, u/criand, etc.\n\nThe point is, Apes forced me and the other crypto writers to focus our message even further, but in return, Apes have upheld the other end of the bargain—you are interacting, engaging, and most importantly asking questions to challenge your understanding of the material in the comments and in personal messages.\n\n[I love the smell of crayons being snorted in the morning](https://i.redd.it/xvzeh78st1a71.gif)\n\n&#x200B;\n\nIt is seriously impressive the 180 degrees turn the sub has taken on crypto and e t h e r e u m and that's because Apes continue to do the work engaging with material to make use of and continually exercise their critical thinking wrinkles.\n\nWords cannot express how proud, humbled, motivated, and hyped for GameStop’s future this makes me feel. Unironically, it’s provided this Jellyfish with a *real* sense of pride and accomplishment for unlocking different wrinkles for people--none of the EA Bullshit...\n\nI'm proud of Apes and the [r/Superstonk](https://www.reddit.com/r/Superstonk/) community. For a collective of 'smooth brains,' I'm seeing more critical thinking applied by Apes on the subject of crypto and e t h e r e u m and what they mean for GameStop's future compared to the lack of critical thinking applied to the Fed's public comments on inflation (Imagine this, behind closed doors it is different! Working on a post for that)\n\n[And come on now, you know I can't talk about something without trying to inject something about inflation into it somehow, right?](https://reddit.com/link/ogfwxn/video/fux43ikvt1a71/player)\n\n[We now return to our regular scheduled hype post](https://i.redd.it/99g55lext1a71.gif)\n\n**Because of all this learning, I believe** [**r/Superstonk**](https://www.reddit.com/r/Superstonk/) **is waking up to the value proposition of NFTs/the metaverse and I believe this is where the true power to the player is.**\n\n[The smell is in the air](https://reddit.com/link/ogfwxn/video/1n84ehb0u1a71/player)\n\nUseful Background for this section:\n\n[https://www.reddit.com/r/Superstonk/comments/ofn57e/but\\_what\\_sort\\_of\\_games\\_will\\_be\\_in\\_the\\_nft\\_market/](https://www.reddit.com/r/Superstonk/comments/ofn57e/but_what_sort_of_games_will_be_in_the_nft_market/)\n\n[https://www.reddit.com/r/Superstonk/comments/ofndb0/a\\_crypto\\_dive\\_with\\_the\\_jellyfish\\_10\\_things\\_about/](https://www.reddit.com/r/Superstonk/comments/ofndb0/a_crypto_dive_with_the_jellyfish_10_things_about/)\n\nDo not underestimate the power of the players.\n\nhttps://preview.redd.it/m4iiy0n2u1a71.jpg?width=1080&format=pjpg&auto=webp&s=3914ce309b5f3b25f2dffa097b76e66a50cbfad2\n\nGoogle’s Stadia was supposed to revolutionize and be a \"gaming killer\" BUT having slightly better technology isn't good enough to win market share in an established ecosystem. It needs to be at least 10x better AND you still need to successfully take on entrenched competitors while trying to grow an ecosystem. It did not work (link removed to try and stop Automod from catching the post) because Google ( and anyone else mind you) doesn’t have what GameStop has—the players willing to **LEARN ABOUT AND USE** this platform and tell **EVERYONE** (in a non-brigading way of course) about it.\n\n[Hey Amazon, do your users get this hyped?](https://reddit.com/link/ogfwxn/video/vs2x9644u1a71/player)\n\nThinking back, nobody was ever really going to switch from the gaming industry standards with a thriving ecosystem to Google’s unproven but \"theoretically better\" ghost town of a product—at least without Google spending Netflix-level money on original content and engagement (I believe anyway).\n\nThis is a dynamic that sometimes gets lost by even the smartest developers (and you know Google had those!)—the tech, no matter how differentiating, means nothing without users. However, I have no doubts RC, **Jordan Holberg** eviljordan, Matt FinΞstonΞ | ufinestonematt, **j**@Cyberhorsey and the whole rest of the GameStop team understand this power dynamic and are preparing to appropriately wield it.\n\n**This is why I believe nft.gamestop.com is such a genius move and is going to bring in money hand over fist.**\n\nThe NFT and crypto gaming space is still in its infancy and that is the OPPORTUNITY HERE! There is no status quo\\\\consensus on how to do anything yet in the space or overly entrenched incumbents with a network effect to overcome—like Google with Stadia.\n\nGameStop, through its symbiotic relationship with Apes/gamers, will create these lucrative new markets.\n\nhttps://preview.redd.it/cnv7zryfu1a71.png?width=610&format=png&auto=webp&s=20e7d5aac8bae188e5ebc5a60e07629212cc2c6c\n\n&#x200B;\n\nI truly believe RC, **Jordan Holberg** eviljordan, Matt FinΞstonΞ | ufinestonematt, **j**@Cyberhorsey, etc. understand that **the blockchain technology isn’t the silver bullet that is going to transform this company, rather it's the ecosystem and community that will lead everyone to the promised land**\n\nI am sure the Mods could fill in more about engagement level (or I will if I can find the last post that was shared of [r/Superstonk](https://www.reddit.com/r/Superstonk/)’s engagement numbers), but I bring this sub up in the context and comparison to **the biggest revenue-generating app in crypto at the moment—NFT Gaming.**\n\nBefore going any further, I do not endorse Axie, think that you should purchase it, or do anything at all with it. Rather, my intent is to walk through the economics of this game.AGAIN, DO NOT BUY THIS, I DO NOT WANT YOU TO BUY THIS, I AM NOT RECOMMENDING ANYTHING ABOUT IT, THIS IS FOR LEARNING/EDUCATIONAL PURPOSES ONLY!!!!\n\nThe **‘play to earn’ model**, which rewards players for their contributions to the ecosystem appears to be a hit concept out of the gate, and I fully expect GameStop to embrace it.\n\nFor example, I suspect there will be a world soon where players can earn by:\n\nCompeting in PVP battles to win leaderboard prizes.\n\nCreating and selling NFTs in the marketplace.\n\nCollecting and speculating on rare NFTs—I imagine a limited edition Snazzy Bananya NFT could be like a Black Lotus in Magic: the Gathering?\n\nCompleting in-game ‘work’ I think this is how Roblox’s economies kind of work?, regardless, this work will earn coins that can be sold on exchanges (unless GameStop has something up their sleeves on the exchange front and we can just go through them?).\n\nAnd People are doing all of this already! Axie crossed 250,000 daily active players in June!\n\nhttps://preview.redd.it/kw072bahu1a71.png?width=1456&format=png&auto=webp&s=0b17ab4ce34de819eddb153daef35d8e041475de\n\n[They got nothing on r\\/Superstonk](https://preview.redd.it/dxj9fmgiu1a71.png?width=417&format=png&auto=webp&s=521f12e63ef3d691506fe3a1028f7911eed3f45b)\n\nOk Jellyfish, I get there are some people using it, but you know:\n\n[I got you fam, let’s look at June!](https://i.redd.it/ziawyt7qu1a71.gif)\n\nProtocol Revenue\n\nGaming is already the #1 revenue-generating application in the crypto industry, and this is before GameStop has even laced up the shoes on nft.gamestop.com! **$4.4 million (33%) of the $13.2 million in protocol revenues went to this one ‘simple game’ for the month.**\n\nThis is before you take into consideration what can happen with a robust secondary market for used games or any other protocol tricks they'll have up their sleeves.\n\n**GameStop is entering this space in its infancy and is coming in hot ready to throw down.** No precise revenue guesstimates, only up since they will literally be making the markets!!!\n\nWhen the rest of the business world sees the power of GameStop’s symbiotic relationship with its users being flexed and then hoovering up all the money in this new space, you can bet they will come knocking, so that they don’t end up being the next Google Stadia of the NFT space!\n\nI am looking at you: Hasbro, Mattel, Lego, Major League Baseball, Fox TV, McLaren, Porsche (Removed links to stories since I think it was catching the Automod?!?)\n\nDon't be foolish and try and stand this up yourself, come work with THE BEST @ GAMESTOP!!\n\nTL:DR - Power to the players is real and Apes/Gamers are the wildcards in GameStop turning the NFT Marketplace and metaverse into a money printing press.\n\n[Thanks for stopping by to take a dive with me! Please let me know if you have questions, requests for additional subject areas, or if something just isn't clicking for you and think I should explore further.](https://i.redd.it/fhoyu9tyu1a71.gif)",
    "title": "TL:DR - Power to the players is real and Apes/Gamers are the wildcards in GameStop turning the NFT Marketplace and metaverse into a money printing press.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ogfwxn/tldr_power_to_the_players_is_real_and_apesgamers/"
}