{
    "author": "Matador3364",
    "created_utc": 1627388942.0,
    "distinguished": null,
    "edited": 1627439138.0,
    "id": "oslvp5",
    "text_only": true,
    "flair_text": "Unreviewed 𝘋𝘋",
    "name": "t3_oslvp5",
    "num_comments": 156,
    "permalink": "/r/DDintoGME/comments/oslvp5/a_dd_on_how_shf_are_manipulating_the_art_and/",
    "score": 1332,
    "selftext": "**TL;DR**: You should read this.\n\n\nLinks to the previous parts of this Deep Dive are in the comments. Sources to back up my claims as well. \n\n\nAs we dive further into the interconnected manipulations of the art and stock markets by Kenneth Griffin and Steven Cohen, I want to start off with a story.\n\n\nIn 2014, the sale of a famed Modigliani painting triggered an international scandal. Sandy Heller said at a party that his hedge fund client, Steven Cohen, had sold Modigliani's \"Nude on a Blue Cushion\" to a mystery buyer in Europe for $93.5 million. This mystery buyer was Yves Bouvier, an entrepreneur in the business of transporting, storing, and trading art.\n\n\nOnce hearing that, Billionaire Russian fertilizer magnate Dmitry Rybolovlev became pretty upset about the issue. Why? Because Dmitry Rybolovlev, whose family trust broke New York City real estate records when it paid $88 million for a four-bedroom penthouse, stated that he bought the painting for $118 million.\n\n\nThe issue comes to light when we insert this statement into the mix. \"Mr. Cohen consigned this work in 2012 to a dealer for resale and did not know the identity of the ultimate purchaser. Mr. Cohen has never done business with Mr. Bouvier,\" said Steven Cohen's spokesman Mark Herr.\n\n\nTo better clarify what that means, Steven Cohen sold the Modigliani painting and Dmitry Rybolovlev ultimately bought it. Yves Bouvier, who was caught in the middle of the trade, claims that Steven Cohen sold the painting to him outright, giving him the right to sell it for a higher price. Meanwhile, Steven Cohen later claims Yves Bouvier was only a broker for the deal between him and the ultimate buyer Dmitry Rybolovlev, and did not have that right. \n\n\nDmitry Rybolovlev filed a criminal complaint against Yves Bouvier. Yves Bouvier was arrested on charges of defrauding Dmitry Rybolovlev with the Modigliani sale, in addition to another painting titled \"Salvator Mundi\".\n\n\n\"This is absurd. ... You want to send me to the Gulag,\" was quoted by Yves Bouvier, in reference to the others involved, after posting an $11 million dollar bail. \n\n\nDmitry Rybolovlev paid Yves Bouvier $127.5 million for \"Salvator Mundi.\" This painting had been claimed to be one of Leonardo da Vinci's famous lost portraits of Christ. \n\n\nHowever, later published reports said a group of owners, led by Robert Simon, sold the painting for $80 million. Again, placing Yves Bouvier in the middle of a dispute over whether he was the owner or broker of the deal, and if he had the rights to raise the price. Both paintings were used in the same criminal charges against Yves Bouvier.\n\n\nTo be completely honest, I can't be sure what actually went down, though in my limited opinion, Yves Bouvier got fucked. Remember, he was a competing art trader in a competitive market, just like Steven Cohen.\n\n\nAnyways, the great thing about internet rabbit holes, is that they just keep going deeper. Once you think you've found the end of a scandal, it just opens up to 5 more.  \n\n\nIn 2017, \"Salvator Mundi\" sold for $450 million at auction at Christie's in New York, breaking the record for the most expensive artwork ever sold at a public auction. Officially, the buyer was Prince Bader bin Abdullah bin Mohammed bin Farhan al-Saud, a little-known member of the Saudi royal family with no history as an art collector.\n\n\nIn 2019, it had been speculated that the Saudi Crown Prince refused to lend the \"Salvator Mundi\" to the Louvre because the museum disputed its authenticity. Reportedly, the Saudi Prince didn't want the museum to reveal the belief that only a small part of the painting was actually done by Leonardo's hand.\n\n\nThe Saudis ultimately withheld the painting, and the Louvre withheld its evaluation, which caused a storm of doubt about the work.\n\n\nLet's fast forward to April 12, 2021. That was 3 months ago as of writing this post.  \n\n\n“In general, the museum world, and the specialist art historians and curators in it, never really had any doubts about the painting’s authenticity,” said Robert Simon \"It is, of course, unfortunate that the painting was pulled from the Louvre exhibition, but that does not reflect poorly on the painting, in fact, it probably just adds to the painting’s celebrity and allure, and will only generate more interest in it when it is eventually shown, wherever and whenever that might be.\"\n\n\nOh, by the way, Robert Simon played a key role in the discovery of the work after it miraculously happened to turn up at an estate sale in 2005.\n\n\nThere is a point to this story, and it returns back to being relevant to GME, but first let's hear this quote.\n\n\n“The scientific evidence was that Leonardo da Vinci only made a contribution to the painting. There was no doubt,” says a senior French government official who goes by the code name Jacques in the french documentary series \"The Savior for Sale.\" \"At stake was our credibility, the credibility of France, of the Louvre,” Jacques said in regards to not placing the work next to the Mona Lisa in 2019 as an authentic credited da Vinci painting. “My position, which I communicated to the highest level, was that the Saudis’ conditions were unreasonable and that exhibiting it on their terms would have been laundering a work at $450 million.”\n\n\nYeah, you can make of that what you will.\n\n\nBy the way, did you catch where this record breaking painting was auctioned at? For those of you who read Part 3, you will understand the importance of that.\n\n\nOkay, so, let's tie this little story back to the GameStop saga, and then take back off from there. \n\n\nThe day after the sale of the $450 million dollar \"Salvator Mundi,\" Veteran Cultural Journalist Lee Rosenbaum wrote  \"I have reason to believe that Kenneth Griffin, the Chicago hedge fund mogul, may have bankrolled yesterday’s Leonardo purchase.\"\n\n\nLee Rosebaum wasn't the only one to speculate that at the time. A CNBC article by Robert Franks stated only one possible buyer’s name \"There has been some speculation that the buyer was hedge-fund billionaire Ken Griffin, … Griffin wouldn’t comment but sources in the art world say he was not the buyer of the da Vinci.\" \n\n\nAs an aside, and this is just between me and the media, start using accountable fucking sources you piece of shit journalist. How is anyone supposed to trust unnamed sources? If Christie's keeps buyer information confidential, and the purchaser was an unknown first time art buyer, who in the art world would have known who bought it and that it wasn't Kenneth Griffin? And why would Kenneth Griffin decline to comment? It sure sounds a lot like making shit up to cover up true facts.\n\n\nSorry guys. I just needed to get that off my chest.\n\n\nEspecially considering this update on Lee Rosenbaum's article: \"UPDATE: After I posted this, Frank’s post was expanded to suggest two other possible American buyers: Alice Walton and Jeff Bezos. (Why not Bill Gates and Paul Allen, while we’re at it?)\"\n\n\nLee Rosebaum even went so far as to ask Kenneth Griffins' close adviser, and Chicago of Art Institute's Director, James Rondaeu, to clarify if Kenneth Griffin had not purchased the artwork. She wanted her article to be factual. The official response was that he was not going to comment. Lee Rosenbaum wrote \"If I was wrong, why wouldn’t he just say so?\"\n\n\nThis might be a good time to mention that the record breaking $450 million disputed da Vinci work \"Salvator Mundi\" was a heavily damaged and distorted painting. Reported, of this painting, by the New York Times: “this Jesus, far from saving the world, might struggle to save himself a seat on a crosstown bus.”\n\n\nAyoo, didn't see that one coming did you? \n\n\nHey FBI, we still gonna keep pretending this isn't money laundering? I mean, as a video gamer, I can handle needing a big imagination and suspension of disbelief to carry me through a story, but I think ignoring the reality of this one is kind of a stretch. Sheesh.\n\n\nAnyways, let's switch gears now. \n\n\nIn Part 3, I presented evidence of fraud by Kenneth Griffin and Steven Cohen in the art world. In addition, I laid out my speculation on Steven Cohen's plan to take over the physical video game industry, which I also believe is being supported by Kenneth Griffin, among others (I'm looking at you Gabe Plotkin, you fucking stupid fuck). Part of that speculation was that we would continue to see insanely priced video games to fabricate a sense of strong demand in the collectors market. \n\n\nI posted that DD on July 24th, 2021 at 8:00am in the morning. \n\n\nShortly after, a commenter pointed this link out to me. (Thank you by the way).\n\n\nhttps://www.theverge.com/2021/7/24/22587929/super-mario-64-heritage-auctions-most-expensive-wata-games\n\n\nNotice the time and date of the article. July 24th, 2021 at 9:00am. Talk about some quick turn around on my confirmation bias.\n\n\nBreaking this article down, the thing that stood out the most to me is this written portion: \"the partnership between Wata and Heritage makes it safer for people to have confidence that the game they’re bidding on is of the quality that’s advertised. “You’re not just buying it from shadyguy123 on eBay, you know you’re buying from Heritage Auctions.”\n\n\nBy the way shadyguy123, I would 100% rather trust you than the appraisers at Wata Games, which is owned by Steven Cohen (for those who have not read Part 3).\n\n\nBut what about Heritage Auctions? My thesis was that Steven Cohen was spiking prices to drive the following inflated sales through auctions that he owns, or has close personal relationships with the owner.\n\n\nThe person who bought the million-dollar Super Mario 64 hasn’t come forward publicly, so it’s unclear exactly why they dropped such a huge amount of money on the one game. But Valarie McLeckie, consignment director of video games at Heritage Auctions, said that those who have been buying ultra-rare games are driven by nostalgia. “The types of people who are buying these games are seeking mint-condition examples of the games they played as a kid.\"\n\n\nValarie McLeckie, you poor sweet summer child, the people who are buying these games aren't nostalgic, they're criminals using them for money laundering. There ain't nobody who grew up playing Super Mario 64 who has the money to drop a million dollars on a copy of it. Quit the bullshit, quit the act. I'm going to repeat that last part, quit the act. \n\n\nInsert the moment that will flood my inbox with messages trying to call me out for being Alex Jones:\n\n\nValerie McLeckie, consignment director of video games at Heritage Auctions, responsible for the million dollar sale of Super Mario 64, is a shill.\n\n\nObligatory moment to pump the breaks. I don't draw conclusions without evidence, going forward with that accusation would just be speculation. Is she actually a shill? Fuck if I know. I will lay out her background before moving on and let you decide.\n\n\nStated on her public LinkedIn page, prior to being the Director of Video Game Consignments at Heritage Auctions, she was a client manager for 2 years for an online marketing company specializing in paid search & media, creative services, SEO, earned social, content marketing, feed management, paid social, facebook advertising, display advertising, strategy, google analytics consulting, and digital intelligence. \n\n\nPrior to that she was a full time student studying a bachelor of fine arts in theatre.\n\n\nI can't make this shit up.\n\n\nI, personally, do not know how someone with no prior video game appraisal, sales, or related experience could become the leading authority on video game resales, and also land the biggest video game resale of the entire history of history. But hey, maybe she honestly did just work really hard at something she was passionate about and got caught up in the middle of something way bigger than she even realizes. I honestly don't know.\n\n\nI do know that googling her name comes up with an insane amount of articles with clickbait titles of Heritage Auctions' high selling video games, with her just giving off talking points about how nostalgic us millennials are over video games. I don't have them all sourced, because there's seriously an insane amount of them. Many are not even written in english, showing this narrative is being pushed globally.\n\n\nThese articles all have paid advertisements leading back to Heritage Auctions too, by the way.\n\n\nBut let's not focus on her. Let's get to the nitty gritty and see who actually owns Heritage Auctions. \n\n\nBut first! Another tangent. (I can't help myself, I see a hole and I jump).\n\n\nHeritage Auctions has some interesting complaints on their BBB website:\n\n\n\"When I bought my item, it stated it was pre-certified by PSA/DNA. I contacted PSA/DNA and they stated the item was never fully authenticated. I bought a Jackie Robinson signed check through Heritage Auctions. In the description, it stated that the signed check was pre-certified by PSA/DNA. One would think that if something is pre-certified, it would come with a letter of authenticity. How can you pre-certify a signature when it has never been fully authenticated? I contacted PSA/DNA and now I have to send the item to their location, in order to get it fully authenticated. It is going to cost me over $150 dollars. When I bought the Jackie Robinson signed check, I was under the impression that it was already authenticated. Once again, how can you pre-certify something, if it has never been fully researched for authenticity? I would of never bought the item knowing that I would have to re-box it and send it to PSA/DNA for full authentication. Now I am out another $150 dollars. Thank you\"\n\n\nI'd like to also point out that Heritage Auction has a 1 star rating on BBB. Seems appropriate for the auction house that just sold the most expensive video game, ever. \n\n\nIn addition, there is a complaint about Led Zeppelin signatures being reverse unauthenticated by multiple appraisers after Heritage Auctions sold them as authenticated, online bids being \"won\" by multiple people for the same items, then those, and other, items not being shipped out after final purchase, and bids being placed and then later removed, resulting in items being sold to other bidders for lower prices.\n\n\nSweet Salvator Mundi, do you see the parallel patterns of selling unauthenticated items listed as authenticated, the failure to deliver items, and the manipulation of bid purchases in the art, collectable, and stock market trades? Boy, oh boy, oh boy.\n\n\nPSA/DNA, which is mentioned in the complaint above, is the world's largest third-party authentication company, the industry leader in card grading, as well as autograph and memorabilia authentication. It is also owned by Steven Cohen, through his acquisition of Collectors Universe, by the way. (Part 3 explains this acquisition).\n\n\nSo, back to the owners of Heritage Auctions.\n\n\nSteve Ivy and Jim Halperin co-founded Heritage Auctions in 1976 in Dallas, Texas. Steve Ivy gets a pass in this DD for now, but I see you Steve. I do.\n\n\nJim Halperin, on the other hand, well he's something else. At 13 years old, he took out ads in magazines looking for people who would pay to join his nonexistent sales network. Postal inspectors caught wind of this, and in exchange for dropping the charges, he had to return $100,000 in ill-gotten cash. They sure do start young don't they?\n\n\nI want to point out that Jim Halperin, without a doubt, is extremely intelligent. He was accepted to Harvard University at the age of 16. He later dropped out to focus on the coin trading business full time.\n\n\nIt is important to remember, that despite all of the memes protraying them as otherwise, the people who are on the other side of this saga are not stupid. They are the leading brains of their generations. They've been in this game longer than you or I have, and they will do everything they can to win it. That is why I can not stress enough, it's not going to be straight brain power that wins this for you or I, it's going to be compassion and love. \n\n\nThese people might be smart and wealthy, but they have no empathy, they will throw each other aside the second they are personally threatened and exposed. \n\n\nApe no fight ape, always remember that. That has to stand true in our subreddits as much as, if not more, it does in real life.\n\n\nIn 1985, Jim Halperin authored a book on how to grade U.S. coins, creatively named \"How to Grade U.S. Coins\", upon which the grading standards of the two leading third-party grading services PCGS and NGC were ultimately based. \n\n\nThough not listed as a team member, and I can't find the direct link on their website, I did find a link through a back door channel to a page where his expertise in certifications is strangely featured on the Wata Games website domain. I think they forgot to take it down after a website rebranding, is my guess? I'm not really sure what to make of it. \n\n\nRegardless, the link ends in team/3, which makes me believe he was there at the conception of Wata Games, considering link 1 and 2 are it's founder, Deniz Kahn, and chief advisor, Mark Haspel.\n\n\nThere's no way Jim Halperin was not a part of Wata Games from the start, at the very least in a consulting capacity. Why else would he have a bio on their domain?\n\n\nOh, and there is also this. The page states that Jim Halperin first met Mark Haspel when Mark Haspel came to visit the Heritage Auction offices soon after Heritage Auctions entered the comic book market.\n\n\nAt the urging of Jim Halperin, Heritage Auctions began expanding its business model to include collectibles beyond numismatics (coins, for us smooth brains) by first including auctions of comic books in 2001. \n\n\nWata Games launched in 2018 as primarily a video game grading and certification company, when video games were “not even on the map.”\n\n\nSo Jim Halperin knew Mark Haspel for at least 17 years before Wata's conception.\n\n\nNow, we're all video gamers. Most of us here anyways. So let's fucking talk about some games.\n\n\nSpecifically the February 2019 Super Mario Bros. cartridge that first broke over $100,000.\n\n\n(I want to quickly point out that the highest sold video game on the publicly traded website eBay, prior to this frenzy, was in 2017 for $30,000. At the time, that deal in itself seemed outrageous).\n\n\nSo who actually bought the infamous first Super Mario Bros game that set off this trading game craze?\n\n\nThe first $100,000 game was jointly bought by three buyers: Jim Halperin, the founder and co-chairman of Heritage Auctions, coin dealer and game collector Rich Lecce, and video game store owner Zac Gieg.\n\n\nYeah, take time to process that. The person who bought the first hyped video game sale was the same person who owned the auction house that auctioned it off. If you are reading this and still think I'm just being a conspiracy theorist, nothing else I am going to say will ever change your mind.\n\n\nBut who owned it first and sold it?\n\n\n\"While there’s certainly a bit of a publicity element to the sale, Deniz Khan said the deal was legitimate. Besides being the service that authenticated the game, Wata had no part of the transaction. The seller, a collector who has occasionally advised Wata in a volunteer capacity, was not actively looking to sell the Super Mario Bros. He asked to not be named in this story, citing concerns for his privacy.\"\n\n\n\"The guy who was selling it has always said that he would never accept less than six figures for this item, for years now,” Deniz Khan said. “There have been interested buyers I know, outside of this group, who have made him very significant, solid five-figure offers on it. Over $50,000. But it was just never rich enough for him.”\n\n\nI would place a rick of spades level bet that that seller was Steven Cohen, Kenneth Griffin, or someone else extremely close to them. \n\n\nRegardless, that person was an advisor to Wata Games, admitted by the founder of Wata Games himself. \n\n\nSo let's break down everything we just learned.\n\n\nAn advisor to Wata Games, sold a record breaking game, that was appraised by Wata Games, to a consulting figure of Wata Games, who also auctioned and bought that record breaking game through his own Heritage Auctions.\n\n\nFucking A.\n\n\nAll I can even do right now is laugh.\n\n\nWhat in the literal fuck.\n\n\nSo who was the seller? There has to be records of it, FBI, we've talked about this. Either do your job, or put me on the payroll, so I can do it for you. \n\n\nThere's no pushing this under the rug now, the absurdity of all this is clear, I just fucking laid it all out. Straight up 100% corruption and fraud, that is also being marketed worldwide as an authentic demand for collectable video games.\n\n\nThis next line is a direct copy and paste from Wata's website. Despite what their website claims, it's not about their competitors, it is about us. \n\n\n\"Us > Them. (hint: it’s almost unfair)\"\n\n\nRead that again until you understand that they are openly mocking us about using insider trading in the markets. \n\n\nI'm going to repeat that. They are openly fucking mocking us about using insider trading in the markets.\n\n\nHas it hit you yet?\n\n\nSo, this becomes a turning point in the saga. \n\n\nThe final act, if you will, for those of you, like Valerie, who appreciate the fine art of theatre.\n\n\nRetail investors are up against some of the smartest mathematical brains out there. Those brains have created some of the most complex algorithms in existence to manipulate the markets we deserve to freely participate in. They use those algorithms to hoard a vast amount of wealth, much like dragons, in the stories of old, guarding their gold in a cave.\n\n\nBut here's a thing about you, that I know, that they don't.\n\n\nYou are fucking Dragonborn. \n\n\nThey might have been accepted into colleges at 16, but you were the Kanto region's reigning champion before the age of 6.\n\n\nThere is not an algorithm you haven't beat yet.\n\n\nThey might think they know the markets, but they've never had to navigate the auctions of Ironforge, or deal with the banks of RuneScape.\n\n\nYou have defeated Ganondorf in every timeline he has ever shown his face.\n\n\nAnd now he's showing his face in ours.\n\n\nThere is going to come a time when the seriousness of this situation hits you. I'm already past that point, I have been for some time. There is more going on than I could ever put in these DD's. What it all is, I don't know. \n\n\nBut it is.\n\n\nI was scared at first, when it all hit me, but not anymore.\n\n\nThey turned this class warfare into a game, and I'm playing alongside the best gamers I know.\n\n\nAt this point, I don't see the merit of continuing down these rabbit holes. There's enough fuckery already proven that if the government is going to get involved, they are going to get involved. \n\n\nIf they don't, then it's up to you and I to secure our own futures. A future built on the foundation that all humans are the same, as much as they are different. A future where wealth, whether that be measured in money or art, isn't something to hoard, but something to be shared.\n\n\nIt's going to get uglier before it gets better. Again, I can not put emphasis on this enough, apes do not fight apes. Apes help each other up the tree, they do not push them down.\n\n\nThe question then that comes next is, what now? \n\n\nI think it is important that the information in this posts be spread with those outside of our subreddits, and into those in our personal lives. \n\n\nThe markets are not safe places to be participating in.\n\n\nThere are people out there who have been planning and acting on ways to steal your money, money that they force you to buy the necessities of life with, for years. Not once have they stopped to consider the moral implications of their actions on others.\n\n\nThis isn't a matter of being republican or democrat, black or white, or any other label they want to throw at us to wedge in a divide. This is not a political or social issue, this is a human one.\n\n\nIt is important to realize that Kenneth Griffin and Steven Cohen are just some of the Goombas in our way. There will be Koopas after them. \n\n\nAnd then the bridge.\n\n\nMoving forward, it would be beneficial to get your own personal life game plan ready. Whatever that might look like for you. \n\n\nAs for me, right now, I like the cards I have in my hands. \n\n\nSo, I've decided.\n\nI'm going to hold em.",
    "title": "A DD on how SHF are manipulating the art and collectable markets, a history of fuckery, insider trading exposed, and a final hoorah before the storm. PART 4. The final chapter.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/DDintoGME/comments/oslvp5/a_dd_on_how_shf_are_manipulating_the_art_and/"
}