{
    "author": "RichHodler",
    "created_utc": 1617078218.0,
    "distinguished": null,
    "edited": 1617081684.0,
    "id": "mg7six",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mg7six",
    "num_comments": 615,
    "permalink": "/r/GME/comments/mg7six/either_gme_will_be_the_catalyst_for_a_market/",
    "score": 8682,
    "selftext": "It feels like everyone on Wallstreet is getting ready for something big. The [NSCC filing today](https://www.reddit.com/r/GME/comments/mg4o2q/nscc_filing_today_this_is_actually_insane/) and new DTCC rules, the liquidation Archegos, and multi-billion dollar loss of Nomura, etc.\n\nThey're getting ready for something much bigger than the MOASS. There is a high possibility that the MOASS will trigger a market crash like what was seen in 2008. Shitadel is a huge HF and when they and others get margin called, Wallstreet loses some of their biggest market makers. It's like when Lehman went out of business, but Citadel in this case. Everyone is covering their ass for when the inevitable comes, but they need time to do that. They have access to Bloomberg terminals too, and they all know the negative beta is -23, and I guarantee you their senior partners are having meetings about this right now.\n\nSo my theory: the whales are keeping a lid on GME to buy time to prepare. If it blows now, people over-leveraged in unrelated areas go tits up (like Archegos), and FEDs come in and people start playing blame games, blah blah blah. If it's 2008 and you knew Lehman was going bankrupt next month, wouldn't you buy time to cover your ass too? **They're buying time** to move their positions, and for NSCC to file their new rules, (not to mention, Kenny G knows this, and tried to put the blame on retail in his latest interview).\n\nSomething is coming. Either GME will be the catalyst for a market crash, or a market crash will be the catalyst for GME.\n\n&#x200B;\n\nThank you for listening to the ramblings of a smooth-brained ape. I marked this as a discussion because I would love to hear your arguments and ideas. I am open to being wrong so please say something.\n\n&#x200B;\n\nEDIT: to clarify that Nomura was not liquidated",
    "title": "Either GME will be the catalyst for a market crash, or a market crash will be the catalyst for GME. And Wallstreet knows this.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mg7six/either_gme_will_be_the_catalyst_for_a_market/"
}