{
    "author": "AndyLee168",
    "created_utc": 1616998098.0,
    "distinguished": null,
    "edited": 1617066482.0,
    "id": "mfj0rc",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mfj0rc",
    "num_comments": 84,
    "permalink": "/r/GME/comments/mfj0rc/gme_2021_annual_shareholder_meeting_agm_recalling/",
    "score": 754,
    "selftext": "https://youtu.be/MhAjmM9CED0\n\nDisclaimer: the above is definitely not financial advice.\n\nDoes ape Andy think recalling shares at the last three trading days of March/2021, will trigger squeeze? NO!\n\nWhy? Retailers investors does not hold as many shares of GME as institutions.\n\nThen why is ape Andy recalling his shares of GME?\nBecause ape Andy wants to give the shorty HF less ammo to thwart the GME launch!\n\nSo that when HF long decides on launch date(no one knows), shorty HF gets intel on launch date, then hurries to ammo depot and say hey I need to borrow shares!\n\nDepot( your broker ) replies, “sorry mate!” very few ammo left.  Cause some apes recalled shares a few weeks back at the end of March! \n\nShorty HF: why did they recall so early, back then no announcements! \n\nDepot guy: dunno! \n\nSo once again, please apes, no need to do the same as ape Andy. I am only telling apes why ape Andy is doing it. Recall shares a little early. Just to make life a little harder for HF who short GME.\n\nApe Andy is on the side of the apes who love GME stonks! Also ape Andy is on the side of the HF going long on GME!\n\n\nhttps://youtu.be/l_dr2yx2hHg\n\nRecall shares:\napes gonna have to do it sometimes in April anyways. \nApes don’t have to do as ape Andy! Ape Andy only speaking for himself and explaining why Ape Andy is recalling GME shares a little tiny bit earlier!\n\n\nMight as well earlier. Mar/29,30,31. All apes has to do is call broker. Broker will get borrower of share to return shares.\n\nAnd see how this works on timing at end of March last 3 trading days, when HF do profit/loss in books for performance.( Jan pop was on last few trading days of Jan. Feb micro pop was on last few trading days)\n\nand when FED tighten leash on big banks( big banks begged for Supplementary Leverage Ratio SLR extension, FED said no. Ends Mar/2021) \n\nwhich is when big banks(such as Goldman Sachs &amp;amp;amp;amp;amp; Morgan Stanley) tighten money on HF with high leverages!\n\nGME Annual Shareholder Meeting (AGM) + Recalling the shares / IMPORTANT INFO\n\nGME Annual Shareholder meeting (AGM) + Recalling the shares\n\nHistory of Gamestop hosting its General Shareholders meeting: . June 10, 2017 June 26, 2018 June 10, 2019 June 2, 2020\n\nSEC law states that company can announce a share recall before the Annual General Meeting by 60 days.\n\nIf Gamestop is hosting their AGM on June 10, 2021 They are allowed to announce a share recall on April 11, 2021 (Which is a sunday, so it will most likely be announced on Monday, April 12, 2021)\n\nWhat a coincidence, the legend DFV has 500 Calls that expire that week (Friday, April 16)!!!!\n\nThat glorious DFV... timing his call after the April 10 earliest date of share recalls....\n\nWhat about the shares recall? When they announce a share recall, they give you a deadline to register\n\nLast year, they recalled the shares on April 10, and the deadline for registry was April 20\n\nIt is necessary to recall the shares prior to the meeting  in order to vote. That means if the total ownership of gamestop exceeds the number of shares existed, the shorters MUST close their positions before the registery deadline!\n\nApril 12 might not be the day they announce the GameStop SHARES RECALL. But IT WILL HAPPEN in April. It MUST happen in order to have the annual general shareholder meeting.\n\nNo predictions of squeeze on certain dates, Ape Andy just making a point on share recall on april based on the history of data. \n\nHuge news are brought up during the annual shareholders meeting and apes of GME get to participate and vote on important changes (E.g. : Change of CEO ?!?) \n\nSee apes of GME all at the diamond hands meeting 💎🖐🏼 Please copy and repost to spread the word and make this post more visible.\n\nAgain: \nall apes holding GME shares must call broker to recall shares, \n\nbrokers ask why? \nApes say ape want to vote in upcoming AGM. \n\nBroker say date of AGM not yet announced.\n\nApes pls say: \nby shareholders rights, by SEC regulations, by law in any state, holder of shares CAN RECALL SHARES AT ANY TIME THAT SHAREHOLDERS PLEASES\n\nPsss... many brokers think apes don’t know the rules and regulations. So they just say company didn’t announce date of shareholders AGM(annual general meeting), trying to fool apes into thinking, “duh, if company hasn’t yet announced date, so apes cannot recall shares!”  \n\n\nAll that said, what if :\n\nhttps://youtu.be/JO_GrLY9NLU\n\nAnd if apes do this at this timing:\n\nhttps://youtu.be/SjW2VMbFm8g\n\nAnd why is the last three trading days of the month significant?\n\nhttps://youtu.be/D2suoCWK_Tw\n\nWhat if the strike was a preemptive one when opponent is least prepared:\n\nhttps://youtu.be/zSFxC7SseCw \n\n\nAnd elsewhere it is happening to other shorty HF already:\n\nhttps://www.reddit.com/r/WallStreetbetsELITE/comments/mfk54k/commence_pileon/?utm_source=share&amp;amp;amp;amp;amp;utm_medium=ios_app&amp;amp;amp;amp;amp;utm_name=iossmf  \n\n\nDomino effect also starting :\n\nhttps://www.google.com.tw/amp/s/www.nytimes.com/2021/03/29/business/dealbook/credit-suisse-nomura-archegos.amp.html\n\nMore on margin calls for other shorty HF where SEC\nalready stepping in:\n\nhttps://finance.yahoo.com/amphtml/news/wall-street-banks-summoned-regulators-234600682.html\n\n\n\n\n\nRecent posts about recall shares of GME \n\nhttps://www.reddit.com/r/GME/comments/mbrgfo/apes_must_not_forget_that_have_to_recall_shares/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf\n\n\nhttps://www.reddit.com/r/GME/comments/m6sr9n/in_what_scenario_would_gamestop_have_to_recall/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf\n\n\nhttps://www.reddit.com/r/GME/comments/maw379/wow_it_doesnt_even_matter_because_april_12th_they/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf\n\nhttps://www.reddit.com/r/GME/comments/mbfvsa/ryan_cohen_pls_recall_shares/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf\n\n\nhttps://www.reddit.com/r/GME/comments/me90ue/there_will_likely_be_a_high_enough_share_recall/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf. \n\n\n\nAgain Disclaimer: the above is definitely not financial advice.",
    "title": "GME 2021 Annual Shareholder Meeting (AGM) + Recalling the shares / IMPORTANT INFO: MUST call ur broker to recall the shares prior to meeting to vote. So... if total ownership of GME shares exceeds number of shares existing, BORROWER OF GME SHARES MUST RETURN SHARES before the registery deadline!",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mfj0rc/gme_2021_annual_shareholder_meeting_agm_recalling/"
}