{
    "author": "UltraInstinctShaggy",
    "created_utc": 1616995905.0,
    "distinguished": null,
    "edited": 1617021391.0,
    "id": "mfijlr",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mfijlr",
    "num_comments": 52,
    "permalink": "/r/GME/comments/mfijlr/psa_update_your_fcking_passwords_and_take_your/",
    "score": 1319,
    "selftext": "*Not financial advice, but it is security advice\n*Mainly for the boomer apes, but important for all. \n\nI don’t think this aspect is getting enough attention, but I think it’s important. \n\nSince most of us, aren’t conducting trades by calling up our brokers, I think it goes without saying that your brokerage account username and password are the only things preventing someone else from accessing your shares. The boom in online trading resulted in a parallel boom of hacking on those very same online brokerages. Some brokerages have extra protection measures that will protect you in case someone has tried logging into your account like 2F authentication, which I recommend using, but DO NOT RELY ON THIS. You have to take your security in to your own hands. YOU WILL be responsible for the money you lose, YOUR BROKERAGE WILL NOT reimburse you if your money is wired elsewhere, and the FDIC DOES NOT cover you. With that being said here are a couple of tips:\n\n-Do not use the same password for anything. Data breaches happen frequently and I know most of you boomers use the same password for everything. Do not compromise yourself and leave yourself vulnerable this way.\n\n-Make LONG passwords, or better yet use the strong passwords generated by Google or Apple. Write them down or use a password manager.\n\n-Enable 2 factor authentication\n\n-Beware of any link that you click. Don’t fall pray to any PHISHING links. Do not enter any personal information on any website that you are not familiar with. And tell that Nigerian prince pen pal who wants to send you $1 million to fuck off.\n\n- Edit: This comment also has a helpful tip for securing your tendies on fidelity https://www.reddit.com/r/GME/comments/mfijlr/psa_update_your_fcking_passwords_and_take_your/gsohtbo/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf&amp;amp;amp;context=3\n\nDon’t get stripped of your hard earned tendies $$$\n\nhttps://www.bloomberg.com/news/articles/2020-10-13/brokerage-account-hack-what-to-do-if-money-in-robinhood-other-apps-is-stolen\n\nTLDR: update your passwords to something long and strong (that’s what she said)\n\n🚀🚀🚀🚀💎🙌",
    "title": "PSA: UPDATE YOUR F*CKING PASSWORDS AND TAKE YOUR BROKERAGE ACCOUNT SECURITY SERIOUSLY",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mfijlr/psa_update_your_fcking_passwords_and_take_your/"
}