{
    "author": "rensole",
    "created_utc": 1615545787.0,
    "distinguished": null,
    "edited": 1615551306.0,
    "id": "m3f1h6",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_m3f1h6",
    "num_comments": 1334,
    "permalink": "/r/GME/comments/m3f1h6/synopsis_for_03122021_what_we_need_to_know_before/",
    "score": 9350,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nSeriously I can't be the only one smelling that!?\n\n\\*insert flashy intro card\\*\n\n&#x200B;\n\nhttps://preview.redd.it/xb6ezrh4tkm61.png?width=680&format=png&auto=webp&s=3b4dc0f6c48ce4ffd59df0dc54a565384cc6aadc\n\nNone of this is financial advice, Serious grade A retard here.\n\n# GME is up 441% since 2/24\n\nSo because I've been seeing a lot of shill posts yesterday and have not used the delete button this hard since mom found my \"Homework\" folder.\n\nLets look at some basic facts.\n\nDid the dip change anything? are we still on?\n\nGuys nothing changed, we had a dip we have had red days since the 27/18th of January and we had it for weeks. One dip doesn't change anything in my book.\n\nlook at the 24th of feb, this is less than 2 weeks ago and we went from 40 to 250, this is still up A LOT!\n\nSo guys chill the fuck out, I get it, this is exciting and scary at the same time but we are still going up, but don't expect stocks to be all green every day. we can and will have red days.\n\nFor example if this go's up 10k and closes on 9.2k it will be a red day, does that mean it was all for nothing? no it means the stocks have reacted to something.\n\nSo step away from the emotions you may have when looking at this and take a step back, look at the bigger picture and take a breather.\n\nBecause I've seen a lot of negativity on the subs since yesterday, which is to be expected.\n\nRed day forecast is shilly, in the low 90 degrees and slightly overcast.\n\nAs much as we would love to see it, we're not gonna see gains of 30-40% every day. It's costing the hedgies millions each day in short interest, all we've gotta do to keep fucking them is to keep getting the sweet dip and holding.\n\n&#x200B;\n\nhttps://preview.redd.it/jwaf3m16tkm61.png?width=1569&format=png&auto=webp&s=d0a4773abec2759b9969679346a8d61c50d617c1\n\ngraph of 2021, compared to where we where, this still looks great to me.\n\n&#x200B;\n\nhttps://preview.redd.it/4vxn7hx6tkm61.png?width=960&format=png&auto=webp&s=024b0817fd54f0949670f079ddc5c03bddbc1a70\n\nSee something familiar?\n\nThis is why I keep spouting on about \"everyone should educate themselves\" the more you know the less panic you will face.\n\nall thanks go's to [u/atrivell](https://www.reddit.com/u/atrivell/) for posting it [here](https://www.reddit.com/r/GME/comments/m2wjp8/gme_is_doing_what_its_been_doing_all_week_i_am/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nso if you look at the MACD ( **moving average convergence**/**divergence**, is a trading indicator used in technical analysis of stock prices)\n\nas he stated:\n\n    We've seen this action that's happening today A LOT,  \n    we just haven't had people who bought at $348.50 complaining before.  \n    Support lines are trending up, FASTER than last week,  \n    and we have seen this buy and sell off many times in the past  \n    few days when everyone was a diamond hands beast.  \n    this is a simple analysis of the chart and not financial advice. \n\nso what does that tell us?\n\nThe support going up faster is a good indicator that you'll get a more upwards trend.\n\nThe faster that go's the higher it can go, but wtf do I know?\n\neven Yahoo is posting about this\n\n[https://finance.yahoo.com/news/we-should-see-the-gme-short-squeeze-continuing-s-3-partners-174542296.html](https://finance.yahoo.com/news/we-should-see-the-gme-short-squeeze-continuing-s-3-partners-174542296.html)\n\nthe most important take away is at the end:\n\n    “This has not been a profitable trading week for GME short sellers,  \n    after being down -$1.36 billion on Monday and Tuesday,” Dusaniwsky said.  \n    “[Wednesday’s] +7% price move added another -$202 million in additional  \n    mark-to-market losses.”  \n    All in, GameStop shorts have now lost $6.8 billion year-to-date, \n    Dusaniwsky said. \n\n&#x200B;\n\nhttps://preview.redd.it/s3zy3nb8tkm61.png?width=640&format=png&auto=webp&s=b3e9e50f0849f1a2c2007e31078db398b5b78363\n\n# Ok which one of you smooth brains did this? I love it.\n\nAdendum: I think it's funny if it's a one off thing, don't keep doing this stuff because the HF can and will try to pull \"deformation\" or \"slander\" on us. so refrain from doing it\n\n&#x200B;\n\nhttps://preview.redd.it/3mn9tmz9tkm61.png?width=640&format=png&auto=webp&s=1b128b770ce590972a92defd686e501f1264c912\n\n# I have such a stimmy right now...\n\n&#x200B;\n\nhttps://preview.redd.it/kbu24kwatkm61.png?width=1080&format=png&auto=webp&s=1396ca9983ff50197df4dd0298522becf50767ad\n\nOk so people where talking about this yesterday so I thought I'd include it.\n\nThe stimulus checks will be hitting from this weekend on, just imagine what this could do, imagine what the fuck is going to happen if thousands of apes yolo their stimmy in GME... fuck guys we wouldn't need a catalyst we'd be our own haha.\n\nBut again not investment advice, Just saying this would be the funniest shit I'd see in my life if this happened\n\nThere is a letter to the board.\n\nOk so yesterday I was in a stream and this got brought to my attention : [https://www.stockholdersrights.com/](https://www.stockholdersrights.com/)\n\nTheir main interest is to present this on monday to the board of GME, this to do an audit of shareholders, meaning checking the shares, checking everything that's going on with the shares and to make sure the synthetic/naked shares are tracked down so something can be done against it.\n\nSo please I ask everyone to quickly sign it and make sure the board get's this on monday\n\n&#x200B;\n\nhttps://preview.redd.it/n3azj8bctkm61.png?width=640&format=png&auto=webp&s=927162656da22fec76c3628efad516b708500883\n\nNot sure who originally posted this but thank you!\n\nThis is exactly why you'll see red days before this is implemented.\n\nRemember everything happens for a reason, red days, people spreading FUD or disinformation. we have seen this for weeks, no one folded then, no one has folded now.\n\nagain trust your fellow apes and see where this ends up.\n\nAnd just to make sure because I've seen some other people saying \"Oh BuT ReNs0Le DoEsNt BeLiEve in X aMoUnt\" trust me that's the fastest way to get banned from this sub.\n\nI believe this can hit 100,000.00 a share, you can call me an idiot for believing, you can call me a moron for having high hopes, but NEVER try to tell me or other people what they \"really\" believe\"\n\n# Tweety birb\n\n&#x200B;\n\nhttps://preview.redd.it/rnutpfedtkm61.png?width=546&format=png&auto=webp&s=9817b03d2974ee8aae83f64cc1ef39aaf9546f6f\n\nNice old meme right? notice something?\n\nCup and FUCKING handle.\n\nAgain I believe that DFV RC and GME are trying to convey messages in some way shape or form. we have found a deeper meaning behind every tweet (granted it's all conjecture until proven otherwise, none of these are facts just opinions).\n\n&#x200B;\n\nhttps://preview.redd.it/kso99aeetkm61.png?width=546&format=png&auto=webp&s=41e2895e729e48a605f91e5a303e02b479fd9b84\n\nSeriously does no one smell that?\n\nPapa Cohen if you're reading this... call me maybe? <3\n\nNah but in all seriousness this tweet can be taken in several ways.\n\nHe was poisoned like Gme was with the shorts, now he's squeezing so damn hard this guy is about to shoot off of the toilet.\n\nthese two scenes play together as far as I know (again correct me if I'm wrong)\n\n[https://www.youtube.com/watch?v=b7l6jg4Hlog&ab\\_channel=FantasticCousins](https://www.youtube.com/watch?v=b7l6jg4Hlog&ab_channel=FantasticCousins)\n\nthen this scene happens\n\n[https://www.youtube.com/watch?v=-f\\_DPrSEOEo&ab\\_channel=805Bruin](https://www.youtube.com/watch?v=-f_DPrSEOEo&ab_channel=805Bruin)\n\nSomeone is shitting themselves while someone else is excited that we're landing on the moon.\n\nDFV also tweeted\n\n&#x200B;\n\nhttps://preview.redd.it/nd9x9mjftkm61.png?width=546&format=png&auto=webp&s=ba579a1c7445138eeb33e460db40993cce9e8f09\n\nNotice the cat is not in a bag but a box, kitty is waiting and when ready he'll pounce.\n\n&#x200B;\n\nhttps://preview.redd.it/y716efngtkm61.png?width=640&format=png&auto=webp&s=cc9adfdba8cd34520743f5d8e953a0866cebae6a\n\nAgain the best advice I can give you retarded apes is when you go into this to be logical, don't let your emotions rule you, rule your emotions.\n\nAlso if you worry if this will go up or not, look at the fundamentals of the company, look how they turned around their company, look at who got brought in.\n\nI personally think if the company is sub 1000 USD it is undervalued, again you can disagree but show me proof.\n\nAnd remember none of this is financial advice, just a retards opinion.\n\n&#x200B;\n\nhttps://preview.redd.it/zuqdtanhtkm61.png?width=400&format=png&auto=webp&s=ec305d20e78382844698c521079d63e3f2da874c\n\nif I forgot something let me know and I'll add it in here.\n\nAlso for those interested I will be appearing on Momoney's stream somewhere today.\n\nBackups: [https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://gmebackup.tumblr.com/](https://gmebackup.tumblr.com/)",
    "title": "Synopsis for 03-12-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/m3f1h6/synopsis_for_03122021_what_we_need_to_know_before/"
}