{
    "author": "AreteTurk",
    "created_utc": 1615507768.0,
    "distinguished": null,
    "edited": 1615510318.0,
    "id": "m34lqg",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m34lqg",
    "num_comments": 170,
    "permalink": "/r/GME/comments/m34lqg/can_we_finally_agree_to_put_the_ssr_list_hype_to/",
    "score": 1656,
    "selftext": "For the last two days I have been literally enraged with the false hype of “SSR means to the moon Thursday”. I’ve replied commented and provided facts to all posts I read the last 24 hours about this being a huge positive event. Choruses of Yaayy were all over this subreddit. It was also mentioned numerous times as a key objective to the mysterious long whale strategy, that was going to set off a gamma squeeze today and tomorrow. Posts were theorizing these savior whales worked even on the side of shorts yesterday just to get GME on SSR for today’s blastoff. I’m bullish on GME and have been since we got in heavy for us in early January. So don’t call me a shill. \n\nI am on a mission to call out falsehoods misstatements and wild ass guess theories made to sound like fact or guaranteed with promised dates and blastoffs. I’ll express my opinion and make sure you know that’s all it is. I’m shocked at how many people have made folk heroes here because of theories that missed completely using excuses like “I didn’t expect short volume to be 16 million ...”- when anyone familiar enough with short volume new it was a guarantee. And then theories that have false facts all over and opinions wordsmithed to sound like fact. I call it out as a genre of realistic fiction. A Tom Clancy novel. A few facts ... a lot of imagination and a couple flat out close to real fiction claims to make it seem even better. \n\nTwisted theories overweighted to identify some white night / big whale on our side. Buying 100s of million dollars of deep ITM calls to force a squeeze - even brought up the counter thought it might be shorts covering. Immediately discounted with no real thought of other reasons that now have come to light as the real probability and truth. \n\nI’ve been sworn at just for calling out dudes who hyped the SSR list. Nicely pointing out facts that it’s irrelevant look at history the last 60 days. Go look at charts for early February GME was on the short list the first few days of February and crashed from $325 to $53. Go look. Then I get sworn at and capped letters WHATS UR PROBLEM.   I tell em false theories false claims that don’t come true demoralize 🦍 especially when the OP sounds good or everyone is saying it - it must be true. \n\nToday we were on SSR and look worst down trend beating all week. Cant short today hollers and hoots. FINRA short volume today was 6,318,428 out of FINRA volume of 11,413,025. 56.8% OH YEAH SSR MADE A DIFFERENCE TODAY YAY! 🚀🚀  wake up  it was 57.2% yesterday. \n\nI could go on forever. Here is my reason for shouting down shill like promises. \n\n—- It’s destructive to the two things we got in this for. Buying and Holding. —-\n\nSome of us have taken the roller coaster beating and come out the other side. We learned to be thick skinned patient and as unemotional and price detached as possible. \n\nSSR list is irrelevant. 👎👎👎\n\n\nOne more piece. Monitoring adherence to shorting only on upticks is the responsibility of the broker. \n1) A not to be named broker is now a rescuer/partner to the notorious short seller front man we all have come to appreciate as well as his lonely printer for printing more synthetic shares.\n2) computer trading both sides of the bid ask creates a simple uptick transaction followed by big shorts. Watch the order books look for the 4 digit prices in small quantities preceding price drops. \n\nWe all need to stop looking for the single event that causes a blast off. It will take more than a SSR list inclusion. \n\nTLDR: I propose suspensions and bans for rah rahing false claims about SSR as a major blast off event. Let’s stop the shill like behavior. Intentional or unintentional.\n\nEDIT: Took out please upvote in TLDR Hope it’s visible by organic interest. Sorry",
    "title": "CAN WE Finally Agree to put the SSR list Hype to rest please.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/m34lqg/can_we_finally_agree_to_put_the_ssr_list_hype_to/"
}