{
    "author": "kohatian35106",
    "created_utc": 1615492377.0,
    "distinguished": null,
    "edited": 1615511322.0,
    "id": "m2z4zf",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m2z4zf",
    "num_comments": 433,
    "permalink": "/r/GME/comments/m2z4zf/please_spread/",
    "score": 4172,
    "selftext": "The following message came in on a discord \n\nExtremely Important\n\n@everyone I've been made aware of some really shady shit going on and as usual it's our duty to try and protect the apes. \n\nAs of about 10 minutes ago I pulled our livechat down on the subreddit, it's being spammed with all sorts of content that is in serious violation of Reddit's rules (Extreme racism, LGBTQ hate, gore mentions..etc.). I am hearing whispers from other subs and content creators that there is malicious actions being taken against both the AMC and GME Ape community and it looks to be coordinated. We were hit the same time as the other subreddits started reporting it.\n\nThis is in addition to multiple reports now of people impersonating influencers such as Trey Trades or Matt Kohrs and saying to convince Apes to sell or spend money elsewhere.\n\nPlease stay safe, double check ANYTHING you hear and do not believe it blindly.\n\nOur mod team are all unpaid volunteers from our founder Sagan all the way down to the Discord Moderators. We will never advocate you do or don't do something nor will we ask you for money. If we ever do ask for donations for something like Discord bot costs it will be announced here and not via DM's. \n\nThank you and stay safe. I will provide updates as they become available.\n\nEdit: the above mentioned message was shared by screen name zodiac on AMC discord.\n\nEdit: the following is the link of a screenshot of the orignal message in amc discord. I wasnt in the discord when all this happened so i do not have the screenshot of the violations \n\nhttp://imgur.com/a/iZFBJCq\n\nEdit; some of the apes here thought i was spreading misinformation so i took a picture of the amc discord conversation that proves the above message. \n\nhttp://imgur.com/a/p8qH2Am",
    "title": "Please spread",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/m2z4zf/please_spread/"
}