{
    "author": "3for100Specials",
    "created_utc": 1623433702.0,
    "distinguished": null,
    "edited": 1623547326.0,
    "id": "nxlw8v",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nxlw8v",
    "num_comments": 189,
    "permalink": "/r/Superstonk/comments/nxlw8v/a_dd_drop_from_last_weekend_which_predicted_and/",
    "score": 3620,
    "selftext": "This DD post was dropped over the last weekend by a Reddit user who has since deleted his account, shortly after dropping this thermonuclear of analysis on HOW the shares have been suppressed and WHERE they are most likely located.\n\nHis username was u/leavemeanon, and in his post he claims that everything he is about to say is based on JUST 6 months of his own DD he has done and gathered, having no prior experience with market trading whatsoever.\n\nWhen asking myself why in the world, would someone go this far into a DD analysis and yet delete their account shortly after, along with calling themselves 'u/LeaveMeAnon', I only find myself concluding one thing,\n\nThis. is. what. this. guy. does. He might as well be an unofficial whistle-blower who wanted no traces back to him, bc the info contained in his DD is PRECISELY what is occurring right now.\n\nOnce you read through it, I guarantee you will come to the same conclusion I did. There is absolutely NO way someone can deduce what he has, backed with logical data and evidence-based links, to this extent and say they learned it all over the course of a few months.\n\nIt is by far one of the best breakdowns I've seen, and the two topics discussed in detail are EXACTLY those which were used this week to short the stock down.\n\nETFs and Married-Puts.\n\nIt's a 3 part breakdown but you will want to get through the entire thing if you start, I'm genuinely surprised how under-the-radar this DD has flown. Mainly considering it has accurately described, and in a sense, predicted the movements we've seen this week.\n\nDon't believe me though, take a look for yourself and come to your own conclusion. Something the anon poster himself will also ask of you to do, based on his evidence.\n\nHere it is,\n\n[https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip\\_uleavemeanon\\_where\\_are\\_the\\_shares\\_part\\_1/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/?utm_medium=android_app&utm_source=share)\n\n**EDIT 1:** Alright one of the finest damn smooth-brains in the comments section just brought my attention to some unbelievable information, until I saw it for myself..See his comment and the associated picture from my own digging into it!\n\n&#x200B;\n\n[https:\\/\\/nft.gamestop.com\\/](https://preview.redd.it/gpad0nakxq471.jpg?width=852&format=pjpg&auto=webp&s=ac84dfb9f05dea98633bea1083429c2355a503e8)\n\n&#x200B;\n\n[https:\\/\\/etherscan.io\\/address\\/0x13374200c29C757FDCc72F15Da98fb94f286d71e#code](https://preview.redd.it/9pk4m8nrxq471.jpg?width=912&format=pjpg&auto=webp&s=3a81154224da79fc74091644e403b5c204247982)\n\nMy tits have left the building. u/m40air You are the smoothest damn wrinkle I've had the pleasure of speaking to in a LONG time. Well fkn done lad!\n\n&#x200B;\n\n**EDIT 2:**  Well squeeze my nips and call me Kenny. There's more...\n\nhttps://preview.redd.it/vvluk4mx5r471.jpg?width=832&format=pjpg&auto=webp&s=19ac68d97c31abfbabd963facd602aca572483b0\n\n&#x200B;\n\n[https:\\/\\/nft.gamestop.com\\/](https://preview.redd.it/846wo2na6r471.jpg?width=786&format=pjpg&auto=webp&s=7201e3c0dd352949ed4c920c9c81d9d1938c810c)\n\nI'm just going to leave these here..I do not believe in coincidences, BUT I will also not make immediate assumptions as to the connection these pics hold. Nonethefknless.....this is certainly hard to ignore. Come to your own conclusions, comment your insight onto the matter, and decide for yourself, what the above could possibly mean.  u/sanchonumerouno thank you for your insight fellow ape.\n\nEither way, I know what I'll be jacking tonight....(🚀Y🚀)\n\n**Edit 3**: The following is a discussion I had with one of the apes who brought the above to my attention, upon being provided his go-ahead, I would like to share some additional insight he provided. It is **critical that any ape who reads the following discussion** ***takes it as speculation and nothing else until proven otherwise.*** That being said, **this ape makes a fascinating connection** that certainly did not cross my mind. So without further ado, we leave you guys to ponder upon the following,\n\nhttps://preview.redd.it/bi74z93ear471.jpg?width=838&format=pjpg&auto=webp&s=868cc4971c0d00a4a4e503ded36907a239ad6e0b\n\n**Edit 4:** You guys are truly something else..something special..**smoothingly special.** It would seem another fine wrinkle-brain below has additional insight into **another connection that may be related to 'Game On Anon' and** u/leavemeanon\\*\\*'s DD I originally made this post about.\\*\\*\n\nu/Relatable_Yak Well done lad, well done indeed.\n\n[https:\\/\\/twitter.com\\/accel\\_capital\\/status\\/1379930517613682690](https://preview.redd.it/c7a843qjlr471.png?width=752&format=png&auto=webp&s=f0702cd2e8f08e3ab21873f559e15825d5825930)\n\nThe second link provided by the ape above directs you to this page.....\n\n[https:\\/\\/acceleratedcapital.substack.com\\/p\\/the-metaverse-index-](https://preview.redd.it/gnn5puuamr471.png?width=672&format=png&auto=webp&s=641829639c4c17ab9b8c5935d31ba2e488f5d0d5)\n\nHere's a further breakdown of **what you're looking at....**\n\n[https:\\/\\/acceleratedcapital.substack.com\\/p\\/the-metaverse-index-](https://preview.redd.it/0danmh5fmr471.png?width=1500&format=png&auto=webp&s=e23c25841b5422fa6032715edd24a72324772e83)\n\nand now, the last part which seriously caught my attention\\*\\*, understands that you are entering the\\*\\* \\*\\*\\*smooth-brain speculation zone. I am making some of these connections as I go, relative to what I have seen and read about in the past. This info is still NOVEL and should be considered as such..\\*\\*\\*here it is,\n\n&#x200B;\n\n[https:\\/\\/acceleratedcapital.substack.com\\/p\\/the-metaverse-index-](https://preview.redd.it/aeaihoplnr471.png?width=508&format=png&auto=webp&s=2cb02274c34635bae4847b14b5ddcb63c3c330b4)\n\nNow I highlighted the 4th bullet point here b/c the first thing I recalled upon seeing that statement, was the issuing of ***another company's first coin, which was done in the not too distant past...***\n\n**I** could be wrong...but I recall this ***same company also issued this first coin on Etherium and is currently run by a chair..***\n\n&#x200B;\n\n**Edit 5:** This is somewhat getting out of hand on my end, so if my ***speculations*** **are** reaching a bit here...take them only as they are until unless you see fit otherwise, as **grains of salt.** But I am coming to you once more...**with another ape's input into a tangible connection to 'Game on Anon'**\n\n\\*\\*(\\*\\*I am quite literally adding these edits as I review the comments on my post, this is about as **smooth-brained of a DD I would possibly ever find myself forming, as it initially was meant as a discussion but is forming into something far more smooth, so please, bear with me on this journey)**\n\nHere we go, the next commenting ape's addition to the build-up,\n\n***\"Is this in reference to this guy’s username? It’s cool but I think I’m missing a step in the ladder that makes this mind-blowing. Could you spell it out for this smooth-brained ape?***\n\n***Edit: Maybe I answered my own question here for anyone wondering:***\n\n[https://www.reddit.com/r/Superstonk/comments/noytar/tinfoil\\_hat\\_why\\_the\\_game\\_on\\_anon/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/noytar/tinfoil_hat_why_the_game_on_anon/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\"\n\nu/Relatable_Yak coming through once again, this time possibly from an unbeknownst angle!\n\nBefore providing the next piece of insight into all of this, shoutout to the OP of the link posted located by our fellow smooth brain above. [u/fraxybobo](https://www.reddit.com/user/fraxybobo/), I think you were onto something **big...welcome to the smooth-brain convention👩‍🦽🚀**\n\n[https:\\/\\/www.reddit.com\\/r\\/Superstonk\\/comments\\/noytar\\/tinfoil\\_hat\\_why\\_the\\_game\\_on\\_anon\\/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://preview.redd.it/dqngl13wsr471.png?width=842&format=png&auto=webp&s=b42eacf17240b4d54fa41ca9e248eeaf4d985645)\n\nAnd here are my findings from continuing down this trail........\\*\\*this next part is fkn mind-boggling.....\\*\\*I looked up the game on steam and read its description to see what u/fraxybobo's post was referring to in regard to the game called \\*\\*Leave Me Anon.....\\*\\*see for yourself..\n\n[https:\\/\\/store.steampowered.com\\/app\\/1349860\\/Anon\\_Hacker\\/](https://preview.redd.it/xv5knh4dsr471.png?width=816&format=png&auto=webp&s=d08cf78769844f24f822896d550ad68f9d3016f1)\n\n**Edit 6:** This is my last update for this post. I may create a separate DD to clarify this connection instead of throwing something together based on edits alone. I have been doing extensive research into the question as to **how the user's name 'leavemeanon' and 'game on anon' may relate.** I believe I have come to my closest connection. In one of my responses to another post, I stated the following: \n\n&#x200B;\n\nhttps://preview.redd.it/4kha5rlypx471.png?width=332&format=png&auto=webp&s=7ce8c791f0a63115251e2381fb8ff20992f818b9\n\n&#x200B;\n\nI am also 1/3 Certifed reteard so absolutely none of this is financial advice. I still walk upstairs on all fours..and breathe through my mouth...**You have the links, and all that I have seen. The remainder as to what this all could mean is up to each and every one of you to conclude!**\n\nThat being said, it might be a smart idea to ***buckle tf up*** 🚀🚀🚀🚀🚀",
    "title": "A DD drop from last weekend which predicted and described in depth BOTH the usage of ETFs and Married-Put action that occurred this week. Why is no one talking about this???",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxlw8v/a_dd_drop_from_last_weekend_which_predicted_and/"
}