{
    "author": "Squashua1982",
    "created_utc": 1623431014.0,
    "distinguished": null,
    "edited": 1623439464.0,
    "id": "nxkuvw",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nxkuvw",
    "num_comments": 828,
    "permalink": "/r/Superstonk/comments/nxkuvw/clarification_of_when_gamestop_will_issue_a_press/",
    "score": 17863,
    "selftext": "Hey there! This comes straight from the 424B5 Form! Here is the link for reference. \n\nhttps://gamestop.gcs-web.com/sec-filings/sec-filing/424b5/0001193125-21-186796\n\nWe will not receive any update about the completion of the ATM offering today. The earliest an announcement could be made is Monday. This is based off of T+2 settlement. Also, based on past press releases, this will not happen until after market close on any given day. \n\nhttps://i.imgur.com/tuz8Nhh.jpg\n\nGameStop is updated before the market opens every day on how many shares were sold the previous day. Which also points to any announcement of the completion of the offering happening after market close. \n\nhttps://i.imgur.com/sr8Undy.jpg\n\n$255.39 is not the max sell price. This was the average share price on June 4th and they used it for calculating the fee projections of this offering. \n\n$1,276,950,000 is not the maximum amount of funds GameStop can raise from this offering. Again, they used this for calculating the fee projections of this offering. This was understandably confusing because the last offering had a maximum amount allowable to raise. \n\nhttps://i.imgur.com/5cljjEg.jpg\n\nAs of June 1st 2021 Outstanding Shares numbered 71,815,131 shares. If I am reading this correctly, that number includes 2,435,881 restricted shares.\n\nhttps://i.imgur.com/dPp6A21.jpg\n\nEdit 1: If GameStop sells all 5 million shares then the new Outstanding Shares will be 76,815,131. Thanks to /u/Cspawn for the image!\n\nhttps://i.imgur.com/Dvnq05P.jpg\n\nBTW the restricted shares is why MarketWatch and Ortex Outstanding Shares differ. \n\nOrtex is adding the restricted shares to the 71,815,131 number which brings them to 74,251,012. \n\nhttps://i.imgur.com/0EX7jDx.jpg\n\nMarketWatch is including the restricted shares in the 71,815,131. \n\nhttps://i.imgur.com/9VCvtvS.jpg\n\nMarketWatch and Ortex updated their Outstanding Shares numbers based on the 424B5 form and not because they saw new shares enter the market. This makes sense, because if they could do that then they would account for all the synthetic shares on the market as well….\n\nEdit 2: thank you to /u/Dclaw504 for finding this info! The 10-Q release specifically says that restricted shares are included in the number of outstanding shares!! \n\nhttps://i.imgur.com/7dowX8b.jpg\n\nHers is the link to the 10-Q released June 9th 2021. the info on restricted shares os located on page 13. \n\nhttps://gamestop.gcs-web.com/sec-filings/sec-filing/10-q/0001326380-21-000066\n\nI hope this helps clarify some things!",
    "title": "Clarification of when GameStop will issue a press release stating the ATM Offering is complete, sale price max, maximum offering, update on outstanding shares, the reason why MarketWatch and Ortex differ, and other Form 424B5 goodies with highlighted pictures!",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxkuvw/clarification_of_when_gamestop_will_issue_a_press/"
}