{
    "author": "Leenixus",
    "created_utc": 1623419177.0,
    "distinguished": null,
    "edited": false,
    "id": "nxgcu5",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nxgcu5",
    "num_comments": 273,
    "permalink": "/r/Superstonk/comments/nxgcu5/i_taut_i_taw_a_married_put_i_did_i_did_see/",
    "score": 4598,
    "selftext": "&#x200B;\n\n* **June 10 Option Flow Data:** [https://pastebin.com/mhme02mt](https://pastebin.com/mhme02mt)\n* **Source:** BlackBoxStocks.\n\nI just want to say, i hope that slightly more wrinkled apes than me can take a look at this data and give their opinion on what we're seeing here. I'm pretty sure this is Married Puts / Synthetic Creation. \n\nI'm 99% convinced this is what's going on here, but i'd feel better if a wrinklier ape could corroborate what i'm seeing here.\n\nhttps://preview.redd.it/62n1kbz14n471.jpg?width=638&format=pjpg&auto=webp&s=01a700be2c7332ecc10a2c4806cfb4141b1177d9\n\n# Their telegraphed punch\n\nYesterday June 10 they telegraphed their moves as clear as day when they performed the 2 trades marked in red. Basically they did these 2 huge trades as clear as day for everyone to see. My [https://en.wikipedia.org/wiki/Jacques\\_Tits](https://en.wikipedia.org/wiki/Jacques_Tits)\n\nHere's their 2 large moves. We're going to anal-yze them further below.\n\n[\\( ͡o ͜ʖ ͡o\\)](https://preview.redd.it/2mzmc506tm471.png?width=1617&format=png&auto=webp&s=6a55b98516da3b035a83b5940b31413a89cd6097)\n\n&#x200B;\n\n# Let's Zoom In\n\nLet's check those 2 trade spikes for 3000 contracts on the PUT & Call Sides. Looks suspiciously a lot like married puts and/or creation of synthetics.\n\n[\\( ͡o ͜ʖ ͡o\\)](https://preview.redd.it/ouvjh8f8um471.png?width=1616&format=png&auto=webp&s=bd8facc0b3da83d5bc3c5044dfe0c919794d3783)\n\n&#x200B;\n\n# Let's Anal-yze\n\n* **Days to Expiry:** 1 Day (To keep contract costs low)\n* **First Trade Timeframe:** 12:32:22 at a spot price of $242.95\n* **Second Trade TimeFrame:** 12:46:11  at a spot price of $237.52\n\n&#x200B;\n\n[\\( ͡o ͜ʖ ͡o\\)](https://preview.redd.it/rbnljgjlum471.png?width=1616&format=png&auto=webp&s=3de11a1510cbb84779aa8ccaef19611585daaa3b)\n\n[\\( ͡o ͜ʖ ͡o\\)](https://preview.redd.it/oqpaeh65vm471.png?width=2349&format=png&auto=webp&s=3bbd5fbf06b919d1a98044e0741900f2e4f7c9d9)\n\nLOOK AT THIS SHIT. CLEAR AS FUCKING DAY. ( ͡o ͜ʖ ͡o)\n\n&#x200B;\n\n&#x200B;\n\n# GME Minute Chart - Orders Execution Point\n\n[\\( ͡o ͜ʖ ͡o\\)](https://preview.redd.it/x65y33uoxm471.png?width=2106&format=png&auto=webp&s=498a029ebbbbb3d1cb12f982fddf4899d12f43d1)\n\nBut wait. The price of GME was already dropping before they even did those orders. Why? ( ͡o ͜ʖ ͡o)\n\n&#x200B;\n\n&#x200B;\n\n# Max Pain - Intra-Day and Intra-Week\n\nRegular Max Pain on websites like swaggystonk is calculated using the Open Interest on options at the end of each day. It averages 5 days worth of Open Interest and gives you literally an average. It's a useless metric in my opinion.\n\nI went and took each day's open interest data and already showed in my previous DD that it's an accurate measure of GME's daily price movement.\n\nRight here i'm going even deeper, into intra-hour(Intra-Day really) Max Pain and this... it explains the downwards price movement as well...\n\n&#x200B;\n\n**June 10 - Hourly Max Pain**\n\n[Sorry for the sloppy graph, but i wanted to get this shit out as soon as possible. Some other ape can visualize it better for you. ](https://preview.redd.it/1kku2s6a1n471.png?width=1616&format=png&auto=webp&s=38531b2f0f164a21ab3f69ac5501ac4463060584)\n\nThe gist of it is that above you're seeing the max pain price based on option open interest for EACH HOUR in the DAY. The Max Pain range here as you see matches almost perfectly yesterday's trading prices.\n\nAlso here's another graph showing the Hourly Max Pain for the 9'th... and to be honest when i saw this i shat my pants and realized why they hedgies shat their pants too... you'll see... and it explains their desperation in doing illegal shit like married puts...\n\n&#x200B;\n\n&#x200B;\n\n**June 9 - Hourly Max Pain**\n\nhttps://preview.redd.it/kwf6aoku1n471.png?width=1618&format=png&auto=webp&s=b23d6162218e3b562d4dbff21e4df20dea78ba3a\n\nYeah you're reading that right. Intra-Day HOURLY Max Pain 2 days ago was $333-$446. If i was a hedgie, i'd be shitting my pants too.\n\n&#x200B;\n\n&#x200B;\n\n# Conclusion\n\nI haven't got a system to calculate intra-day hourly Max Pain on the fly, but i think i'm gonna build one. I think i've discovered a market dynamic that they're aware of but we aren't (weren't).\n\nI think they've used Options to manipulate GME's price down in order to perform their can kicking and to save up a bit of cash on premiums. (Remember coke rat crummer's lessons on how to manipulate the price of something in order to buy in at a sweeter price).\n\nSo yeah, apparently the shares they're borrowing are not being used to actually traditionally short... I strongly believe they are using them to as many covered calls as possible (Perhaps even all of them fully covered) and to do this Married Put / Synthetic shit...\n\nBut if you're borrowing shares to do this shit with... you're just can kicking... If only there was a rule out there to fix all this... (Oh there was but it's sorta kinda almost maybe gone)\n\n&#x200B;\n\n**Please**\n\nI truly hope a wrinkly option ape can take the data i attached and use it better. I also have the full option data for the past 2 months for the ENTIRE market in a 90 Mbyte file. Ask me in a PM and i shall provide.\n\n  \n**Pretty please**\n\nI have conflicting information on whether married puts are legal or illegal. So far i'm leaning towards the side of illegality. If someone wrinkly can confirm this for me, i'll submit FINRA, SEC and FBI tip, but i need to be sure before i do so.\n\n&#x200B;\n\n[Random SR-DTC-2021-005 Shitpost](https://preview.redd.it/v3nhyt593n471.jpg?width=640&format=pjpg&auto=webp&s=0b8b0552b2dce52344b2e0dce09af24ba705bdd8)\n\nTagging u/buttfarm69 for posterity.\n\nAlso, my [Jacques\\_Tits](https://en.wikipedia.org/wiki/Jacques_Tits)\n\n( ͡o ͜ʖ ͡o) (Related, it's my face throughout finding what i found and writing this post)\n\n^(I'm gonna sit back and relax for a while because this has my brain revving beyond the red-line thinking how i might have figured out the borrow rate manipulation as well as a bunch of other shit that i might literally be able to prove... I'll be checking my phone here and there but i expect to be out of action for the day after this shit..........)",
    "title": "I taut i taw a married put... i did, i did see married puts...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxgcu5/i_taut_i_taw_a_married_put_i_did_i_did_see/"
}