{
    "author": "Dismal-Jellyfish",
    "created_utc": 1623470013.0,
    "distinguished": null,
    "edited": 1623470451.0,
    "id": "nxxwqt",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nxxwqt",
    "num_comments": 570,
    "permalink": "/r/Superstonk/comments/nxxwqt/tldr_i_believe_inflation_is_the_match_that_has/",
    "score": 7888,
    "selftext": "Good evening r/Superstonk, neighborhood jellyfish here! I would like to revisit the [CPI report](https://www.reddit.com/r/Superstonk/comments/nwodvj/the_consumer_price_index_climbed_06_from_the/) from yesterday while considering Reverse Repos. One thing that happened after the 5% number came out was that junk-bond yields fell to new record lows.\n\nTwo bonds I would like to share with you all are:\n\n[ICE BofA Single-B US High Yield Index Effective Yield @ 4.47&#37; -.53&#37; adjusted for inflation \\(Highly Speculative\\)](https://preview.redd.it/16ggnizq5r471.png?width=1472&format=png&auto=webp&s=2044efbec4edfd718975f23cbb46c5c57e488f21)\n\n[ICE BofA CCC & Lower US High Yield Index Effective Yield @ 6.83&#37; 1.83&#37; adjusted for inflation \\(“extremely speculative” to “default is imminent with little prospect for recovery”\\)](https://preview.redd.it/vzymxppt5r471.png?width=2917&format=png&auto=webp&s=98bb6f76625ee211c7c99a8f4b4c70ddcc65635f)\n\nBefore we go any further, let’s do some quick level setting on bonds and their risk descriptions:\n\n[How the Credit Rating Agencies Classify Corporate Bonds and Loans by Credit Risk, or the Risk of Default.](https://preview.redd.it/rehqd3r06r471.png?width=1329&format=png&auto=webp&s=e0feef1958f5dc822e8374073ebe411d5c378373)\n\n&#x200B;\n\n[Jenga!](https://reddit.com/link/nxxwqt/video/dr1zy3dv7r471/player)\n\nOk, so back on topic, [inflation came in at 5% yesterday](https://www.reddit.com/r/Superstonk/comments/nwodvj/the_consumer_price_index_climbed_06_from_the/). Single-B yields drop to 4.47% and CCC & lower hit 6.83%.\n\nHowever, after adjusting for inflation, these bonds are yielding -.53% on the Single-B and 1.83% on CCC & lower.\n\nCan we let that sink in for a moment? To get any sort of positive yield an investor must expose themselves to bonds rated **“extremely speculative” to “default is imminent with little prospect for recovery”.** If they invest in the Single-B ‘**Highly Speculative’** they lose principal capital to inflation!\n\nStopping here for a moment, **I believe this to be a primary driver to the Reverse Repo market exploding**—because remember, counterparties can give the Fed as much cash as they aren’t able to place for 0%, while ‘investing’ in something ‘AAA’ related.\n\nHowever, the money for these institutions have to place is continuing to grow at a good clip because:\n\n· Yellen is still drawing down the packed General Account Mnuchin stockpiled for her—she wants it at [$500 billion by the end of June](https://home.treasury.gov/news/press-releases/jy0011) (\\~ $174 billion more to go)\n\n· local governments are getting Covid money [($350 billion included in the American Rescue Plan)](https://www.erienewsnow.com/story/44076717/local-governments-sift-through-treasurys-interim-guidance-on-spending-covid-aid)\n\n· Central-bank asset purchases that continue chugging along [($120 billion per month)](https://www.wsj.com/articles/central-bank-will-begin-reducing-bond-purchases-well-before-raising-interest-rates-powell-says-11618421656)\n\nIn theory, all of this (\\~$644 billion) could end up in Reverse Repo. Add that to what they are already sheltering ($547 billion) and we could see the Reverse Repo market hit **$1.191 trillion**.\n\n# Ok Jellyfish, but what does this hypothetical reverse repo number have anything to do with CPI, and how the heck does it tie to GME?\n\nFirst, even before all of this talk of inflation, the buying power of the dollar has gone down over time.\n\n&#x200B;\n\n[It goes down, down... ](https://preview.redd.it/u1sromf58r471.png?width=2340&format=png&auto=webp&s=6f640c25b1be662e4077aea3d2a30889cab41095)\n\n&#x200B;\n\nNext, remember those ICE BofA CCC & Lower rated bonds we looked at up top? Those are the only bonds available for US corporate bonds whose **average yield is above the rate of inflation**.\n\nEverything else currently has negative real yields, where the purchasing power of capital (remember this has already been taking a hit the last 50 years) is **further obliterated by inflation**, to the point these yields are just too low to effectively compensate for the loss of purchasing power, especially for the wildly risky assets and substantial risk that would have to be purchased to earn said yield.\n\nLet’s imagine for a moment that inflation ***only*** holds at 5% for the rest of the year (ha!) and comes back down to that 2ish% the Fed is PROMISING will happen. Whoever makes this investment is still ***down in real terms since bonds purchased at today’s rates (unless you are okay with investments only in “extremely speculative” to “default is imminent with little prospect for recovery” assets) because yields are below that of inflation***.\n\nViewed through this lens, one can say the Reverse Repo markets are being used as intended and not abused. But now inflation has been unleashed, **and a permanent loss in purchasing power** is in store for anyone who is buying bonds that aren’t ***“extremely speculative” to “default is imminent with little prospect for recovery”. Everything else is getting a haircut from the current rate of inflation, and this isn’t coming back.***\n\nThis brings me back to how this **could** tie to GME and **begins the ‘speculation’ parts of this post**.\n\nOk, we have established that the counterparties in the reverse repo market still have \\~$644 billion or more coming their way that will have to be placed somewhere.\n\nRemember, they can’t just sit on this cash as the dollar is losing buying power (as we have seen above), the cash would get eaten by inflation, and it is a liability for them—since they must pay interest on client cash.\n\nSo I believe it is safe to assume that most (if not all) of the incoming cash will continue to make its way to the overnight Reverse Repo market. But what about cash that had been deployed to bonds on the balance sheet that are now getting its lunch eaten by inflation (as we established above with the adjusted for inflation rates)?\n\nOn April 7, [The Wallstreet Journal](https://www.wsj.com/articles/mall-owner-explores-debt-restructuring-for-new-yorks-largest-shopping-center-11617830147) reported that Destiny USA’s owner, Pyramid Management Group, hired representation to look into restructuring the mall’s debt, which includes Commercial Mortgage-Backed Securities (CMBS) and municipal securities known as PILOTs (Payments In-Lieu of Property Taxes). I don’t know much about PILOTs but I only bring it up because the PILOT debt is senior to the larger of Destiny USA’s two CMBS.\n\nThese two debt issues represent a total of roughly $716 million in outstanding principal ($286 Million in PILOT and $430 million in CMBS).\n\nHowever, appraisers lowered the mall’s valuation to just $203 million. That is not even enough to even cover the $286 million in PILOT bonds (which would get paid first!), leaving CMBS investors holding the bag. Consequently, their bonds have been [downgraded (from BB to B)](https://www.syracuse.com/business/2021/03/destiny-usas-junk-bond-ratings-just-got-junkier.html).\n\nNow let's imagine you are an institution that has: made a bunch of these CMBS moves in commercial property that is not going to recover because of the pandemic.\n\nPreviously, these bonds *had* been able to be used as collateral for staving off margin calls or for whatever other fucking around they might happen to be doing.\n\nTwo things are now occurring. First, the new rules say this junk can’t be used anymore as collateral. Second, inflation is coming and eating that sweet profit the bonds offer so any refinancing sees you losing more money on the bet.\n\nRecall, the yield from interest payments is supposed to compensate for the loss of purchasing power, *and* also for the level of risk of default they are taking on by investing. But as we saw above, rates suck, the risk is through the roof, and evaluations/ratings of debt are all kinds of out of whack to [fraudulent](https://www.sec.gov/litigation/litreleases/2021/lr25030.htm).\n\n&#x200B;\n\n[I hope she comes back for the sequel! ](https://preview.redd.it/ok2xksrd9r471.png?width=960&format=png&auto=webp&s=c6ab96684ac56cf1010235939aafd5e02b87781e)\n\nOK, so to try and wrap this up (I hope):\n\n· Cash is going to continue to pour in that needs to be placed.\n\n· Inflation is going to make it impossible to earn positive rates on assets after being adjusted for inflation on anything but ***“extremely speculative” to “default is imminent with little prospect for recovery”*** risks.\n\n· Cash can be stashed with the Fed @ 0% currently--although there are rumblings of having to taper support.\n\n· Previous collateral (zombie CMBS as example) is considered junk and may be losing value due to being mistakenly rated/valued to begin, with yield rates, which had been used to secure the balance sheet now also being eaten by inflation.\n\n· Their cash can’t be used as collateral because it is a liability, and even if used, will suffer a loss of value from inflation.\n\nOpinion: Because of inflation, the shorts are going to drown in their cash. There is no place for it to go to earn a positive yield greater than what inflation will eat, or should be acceptable for the level of risk of default.\n\nWith nowhere to park this cash to generate positive yields and while having to contend with balance sheets that are having assets eaten away, participants will continue to use the Reverse Repo to buy time until:\n\n1. Being down in real terms because of inflation is something that cannot be made back up to service the debt and will weigh on balance sheets as they try to protect from margin calls.\n2. Their existing collateral on the balance sheet can get re-rated lower, re-appraised lower, or just eaten by inflation to the point even what they are borrowing in treasuries can’t meet the requirements to hold off a margin call.\n3. They hit the 80 billion Reverse Repo limit because of nowhere else to place cash, are tapped out on treasuries, and no longer able to post acceptable collateral to meet their margin requirements.\n\nTL:DR – I believe inflation is the match that has been lit that will light the fuse of our rocket.\n\n&#x200B;\n\n[Tik Tock and I hope I didn't screw this up too badly!  ](https://i.redd.it/zfeirmk1ar471.gif)",
    "title": "TL:DR – I believe inflation is the match that has been lit that will light the fuse of our rocket.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxxwqt/tldr_i_believe_inflation_is_the_match_that_has/"
}