{
    "author": "lucidfer",
    "created_utc": 1618349726.0,
    "distinguished": null,
    "edited": 1618350039.0,
    "id": "mqc5gh",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_mqc5gh",
    "num_comments": 319,
    "permalink": "/r/Superstonk/comments/mqc5gh/gamestop_was_previously_restricted_from_issuing/",
    "score": 5835,
    "selftext": "creddit goes to ~~/u/samsens for [discovering this](https://www.reddit.com/r/Superstonk/comments/mqaxlh/holy_shit/).~~ [DOMO for highlighting and twattering this.](https://twitter.com/DOMOCAPITAL/status/1382064324248735744?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet)\n\n___\n\nAs most apes already know [today Gamestop announced they are paying off there 2023 corperate bonds nearly two years early.](https://news.gamestop.com/news-releases/news-release-details/gamestop-announces-voluntary-early-redemption-senior-notes-0) Now why would they want to do that when all that liquidity could be put towards reshaping the company?\n\nWell, according to previous quarterly-filing in 10-Qs to the SEC, the 2023 \"10-year\" Bonds Gamestop took out restricted the company from doing a number of things that are vital to reshaping Gamestop into an e-commerse business, and stops potential catalysts for a squeeze.\n\n[Here's a direct quote from Q2 2020 10-Q filing :](https://news.gamestop.com/node/18221/)\n\n> The indenture governing our 2023 Senior Notes and our revolving credit facility restrict our current and future operations, particularly our ability to respond to changes or to take certain actions or take advantage of certain business opportunities.\n\n>The indenture governing our 2023 Senior Notes and our revolving credit facility contain a number of restrictive covenants that impose significant operating and financial restrictions on us and our subsidiaries and may limit our ability to engage in acts that may be in our long-term best interest, including\nrestrictions on our ability to:\n\n>- incur, assume or permit to exist additional indebtedness or guaranty certain obligations;\n- **declare dividends**, make payments or redeem or repurchase capital stock or make distributions in respect of capital stock;\n- prepay, redeem or purchase certain indebtedness;\n- issue certain preferred stock or similar equity securities;\n- **make loans and certain investments**;\n- **sell assets**;\n- incur liens;\n- engage in transactions **with affiliates**;\n- enter into agreements restricting our subsidiaries’ ability to pay dividends;\n- **engage in mergers, acquisitions and other business combinations.**\n\n###TA;DL: Gamestop just unlocked new business abilities. Bullish AF.",
    "title": "Gamestop was previously restricted from issuing dividends and acquisitions by the 2023 bonds, which they just paid off.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mqc5gh/gamestop_was_previously_restricted_from_issuing/"
}