{
    "author": "CGabz113",
    "created_utc": 1627700473.0,
    "distinguished": null,
    "edited": 1627747922.0,
    "id": "ouzjib",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ouzjib",
    "num_comments": 379,
    "permalink": "/r/Superstonk/comments/ouzjib/congress_taking_over_a_month_long_vacation_right/",
    "score": 3815,
    "selftext": "As infrastructure vote is delayed, Reverse Repo hits 1T, and residential plan NOT EXTENDED, leaving millions of Americans at risk of losing their homes… \nI’ve seen posts and comments about the topic and I want to clear up that it is every year that congress takes about a month off in August.\n\n“Right now, the U.S. House is planning to adjourn for a monthlong summer recess on July 30, with the U.S. Senate planning to do the same a week or so later. But a lot needs to happen before members of Congress can escape Washington for their home states (where they will do the fundraising and campaigning necessary to keep their jobs in D.C.).”\n\nThis quote came from [here](https://www.google.com/amp/s/nymag.com/intelligencer/amp/article/guide-congresss-summer-schedule-infrastructure.html)\n.\nI personally think this article has the perspective of a shill, screams FUD, and that last line in that quote.. “where they will do the fundraising and campaigning necessary to keep their jobs in D.C.”\n….. that’s a crock of shit. They’re supposed to, but they aren’t.\n.\n\nHere is a post about how much they actually get done historically through this yearly August vacation 😂 \n\n[The history of August adjournments](https://www.washingtonpost.com/politics/2021/06/24/its-once-again-time-congress-start-posturing-about-not-taking-month-off/)\n\nOnly written about a month ago, I’m not sure how great the sources are and don’t vouch for them. \n\nBasically the article is saying how historically they don’t get anything done at all \n\n*insert Ryan googly eyes pic* \n\nThey are scared to share their schedules with anyone, hmm, I wonder why..\nThese crooks have allegedly been asked to cancel this vacation, especially last year through the pandemic, and they declined. They consider it necessary 🤡\n\nThis vacation is crazy timing isn’t it?\nMillions of Americans possibly defaulting on mortgages, that can’t be good for the mortgage backed securities can they?\nI’m jacked beyond belief for so many reasons.- *The DD was right* is getting easier to say. \nI am sickened by this whole thing and the extent these banks and hedge funds are taking it. People are out of jobs and soon a place to live and it is sad to see. I will be so happy to help provide for my family and friends in need through this all. Be proud to be in your position and see this coming through the help of this community! Thank you apes for constant info!\nWe’re almost there apes🦧 \n\nPlease correct me if I missed anything or was dead wrong on anything. I’m just as retarded as the next guy.. 🦍💪🏽 together 🚀 🌙 💎 🙌🏽 \n\nTLDR: Congress just went on their yearly August vacation, right as shit is hitting the fan in the US. Obviously buy and hodl. GME to the moon\nThis is not financial advice, my brain is smooth\n\nEdit: format- mobile problems\nEdit2: comment reads “OP please change your links, they are AMP: “Google and the publisher that made the AMP page may each collect data about you. Any data that publishers collect when you visit their AMP page is the same data they would collect when you visit their original website. Publishers can use cookies to link your activity on their pages in the Viewer to your activity on their website outside the Viewer. To unlink your activity, you can delete your publisher and Google cookies. Learn how to clear your cache and cookies.”\nJust be aware of the links and try to protect yourself on the internet!",
    "title": "Congress taking over a month long vacation…. right now. The DD was right 🤷🏽‍♂️",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ouzjib/congress_taking_over_a_month_long_vacation_right/"
}