{
    "author": "Parsnip",
    "created_utc": 1626674101.0,
    "distinguished": null,
    "edited": 1626681603.0,
    "id": "on7zuy",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_on7zuy",
    "num_comments": 398,
    "permalink": "/r/Superstonk/comments/on7zuy/diamantenhände_german_market_is_open/",
    "score": 3372,
    "selftext": "Guten Tag to all of you Great Apes across the world! 👋🦍\n\nThis past week has been among the most challenging weeks for Apes in recent months, perhaps since The Sneeze. After several weeks of steady price declines (on low volume and despite good news) we faced a much hyped week - with both Bastille Day Hype and the enormous July 16th options expiry date. We knew to expect fuckery. We knew they'd do everything they could to break us.\n\nThey probably thought they succeeded.\n\nThey did not succeed. The DD is solid - they cannot change the fundamental truths that GME is shorted so deeply, the company is so strong, and that there is no alternative but an epic short squeeze when their short positions are closed. Those who HODL shares through all of this FUD pressure are exactly the Apes who will withstand the pressure to sell on the way up. The harder it is to HODL now, the easier it will be to HODL all the way to the other side of the MOASS.\n\nAnd Apes are HODLing. Did you see the 7-to-1 Buy/Sell ratio last week? And the all-time-high short volume ratio? Nobody is selling; instead, Apes are buying the dip. The OBV indicator, while imperfect, shows the same. The shorts' only option is to dig their hole deeper to survive another day, but eventually they'll hit bedrock.\n\nAnd when they do, Apes will be there, still HODLing, ready to make them pay dearly for *everything* they have done.\n\nAs the German markets lead us into a brand-new week in the GME saga, let's take a moment to slow down, breathe, and appreciate the worldwide movement that has formed around this stock. I know that I, for one, could use a fresh dose of Canadian Roll Call and New Zealand Kia Ora. Let's get some of that Swedish fika and Danish coffee. East Coast \"this thread is my sign to say goodnight\" and West Coast hype. Apes all around the world love this stock, love this community, and no amount of manipulation, be it market manipulation or psychological manipulation, is going to change that.\n\nToday is Monday, July 19th and you know what that means! Join apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟩 120 minutes in: **$169.95 / 143,96 €**  *(volume: 677)*\r\n- ⬜ 115 minutes in: $169.35 / 143,45 €  *(volume: 655)*\r\n- ⬜ 110 minutes in: $169.35 / 143,45 €  *(volume: 627)*\r\n- 🟩 105 minutes in: $169.35 / 143,45 €  *(volume: 627)*\r\n- 🟩 100 minutes in: $169.14 / 143,28 €  *(volume: 610)*\r\n- 🟥 95 minutes in: $168.89 / 143,06 €  *(volume: 609)*\r\n- 🟥 90 minutes in: $168.99 / 143,15 €  *(volume: 598)*\r\n- ⬜ 85 minutes in: $169.30 / 143,41 €  *(volume: 588)*\r\n- ⬜ 80 minutes in: $169.30 / 143,41 €  *(volume: 550)*\r\n- 🟩 75 minutes in: $169.30 / 143,41 €  *(volume: 520)*\r\n- 🟩 70 minutes in: $169.26 / 143,38 €  *(volume: 513)*\r\n- 🟩 65 minutes in: $169.08 / 143,22 €  *(volume: 293)*\r\n- ⬜ 60 minutes in: $169.07 / 143,21 €  *(volume: 293)*\r\n- 🟩 55 minutes in: $169.07 / 143,21 €  *(volume: 288)*\r\n- 🟩 50 minutes in: $168.26 / 142,53 €  *(volume: 279)*\r\n- 🟥 45 minutes in: $168.21 / 142,49 €  *(volume: 175)*\r\n- ⬜ 40 minutes in: $168.26 / 142,53 €  *(volume: 155)*\r\n- ⬜ 35 minutes in: $168.26 / 142,53 €  *(volume: 142)*\r\n- ⬜ 30 minutes in: $168.26 / 142,53 €  *(volume: 142)*\r\n- ⬜ 25 minutes in: $168.26 / 142,53 €  *(volume: 140)*\r\n- ⬜ 20 minutes in: $168.26 / 142,53 €  *(volume: 135)*\r\n- ⬜ 15 minutes in: $168.26 / 142,53 €  *(volume: 135)*\r\n- ⬜ 10 minutes in: $168.26 / 142,53 €  *(volume: 128)*\r\n- ⬜ 5 minutes in: $168.26 / 142,53 €  *(volume: 128)*\r\n- 🟥 0 minutes in: $168.26 / 142,53 €  *(volume: 0)*\r\n- 🟩 US close price: $169.04 / 143,19 €   *($168.00 / 142,31 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.18053998. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler, following their sudden disappearance after Memorial Day. I also am worried, as I had tried to make contact many times and never received a direct response. Three weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the curator of the series. I've been serving as host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/on7zuy/diamantenhände_german_market_is_open/"
}