{
    "author": "Csmbird",
    "created_utc": 1627834080.0,
    "distinguished": null,
    "edited": false,
    "id": "ovuvmx",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ovuvmx",
    "num_comments": 109,
    "permalink": "/r/Superstonk/comments/ovuvmx/credit_card_asset_backed_securities_and_student/",
    "score": 1409,
    "selftext": " \n\n# Have you heard of Credit Card Asset Backed Securities? Or Student Loan Asset Backed Securities?\n\n**TLDR; After shooting the shit with other Apes about how I wouldn’t be surprised if they were somehow backing securities based on people working, I dug and found that there are also CCABS and SLABS. For one particular SLABS alone 59% of people aren't paying back on their student loans.**\n\nWith the ending of the moratorium we will likely see the failing of a variety of different backed securities.\n\n*Prerequisite:*\n\n*Go read my other DDs as they go into some detail about different securities like Rental/Aviation/Commercial Mortgage/Auto.* \n\n&#x200B;\n\nDuring the past year people have been buying up used and new cars like no one’s business. Interestingly people were have been able to avoid eviction.\n\nNot only have people renting been able to avoid eviction, but so have those who “own” their home and have a mortgage. Consider the fact that those renting may be renting from someone who owns their home yet is paying a mortgage. We will see this effect Rental Backed Securities and Mortgage Backed Securities because the renters will get evicted and people who own the homes could be “evicted” by the banks/foreclosed on from not paying their mortgage. \n\nFurther more consider the fact that this does not just effect those renting a residential property, but also businesses who are renting a commercial property. Businesses who couldn’t pay staff, let alone pay rent. \n\n&#x200B;\n\n# Credit Card Backed Securities\n\n[FDIC: Credit Card Securitization Manual](https://www.fdic.gov/regulations/examinations/credit_card_securitization/ch2.html)\n\n&#x200B;\n\nhttps://preview.redd.it/cpbb7cosrre71.png?width=1741&format=png&auto=webp&s=e0e44aae6333a451f264b64e2183d0f12266b013\n\nFrom what I've read it seems that credit card companies utilize CCABS to fund credit limits. Which is very fucking interesting given how limits have been lowered by all credit corporations. \n\nOne can determine based on data of events that credit card limits are being lowered (I’ve experienced this firsthand without notice). Why would they need to be lowered if there was liquidity? If CCABS essentially help the flow of credit. \n\n>“Credit card securitizations differ from other ABS since the underlying credit card receivables have a relatively short life, typically eight to ten months, supporting the outstanding certificates, which typically have three, five, or ten year maturities. As a result of this maturity mismatch, each series issued out of the master trust is structured to have a [**revolving period**](https://www.fdic.gov/regulations/examinations/credit_card_securitization/glossary.html#gloss50) and a [**controlled amortization period**](https://www.fdic.gov/regulations/examinations/credit_card_securitization/glossary.html#gloss18) or [**controlled accumulation period**](https://www.fdic.gov/regulations/examinations/credit_card_securitization/glossary.html#gloss17). During the revolving period, the cardholders make monthly principal and interest payments to the servicer. The servicer deposits the payments into two separate collections accounts, one for principal and one for finance charges. The trust expenses are paid, including interest payments on the investors' certificates, from the finance charge account. New receivables generated by the designated accounts are purchased from the originating institution/seller with funds from the principal account.”  \n>  \n> \"During the revolving period, the cardholders make monthly principal and interest payments to the servicer. The servicer deposits the payments into two separate collections accounts, one for principal and one for finance charges. The trust expenses are paid, including interest payments on the investors' certificates, from the finance charge account. New receivables generated by the designated accounts are purchased from the originating institution/seller with funds from the principal account.  The revolving period is for a predetermined period of time that is established at the time the series (often referred to as the \"deal\") is structured. Following the revolving period, there is a controlled amortization or accumulation period. During the controlled amortization period, the principal collections are used to pay down the outstanding principal amount of the investor certificates. During controlled accumulation, the principal payments collected are deposited into a trust account and reinvested in short-term investments. These short-term investments become the collateral for the outstanding investor certificates and increase as principal payments are received from the cardholders until the investments equal the amount of the outstanding investor certificates in the maturing series. The investments mature at the same time allowing the trustee to make a bullet payment to all the investment certificate holders. Most credit card ABS are structured using controlled accumulation and bullet payments.\" \n\nWell we see why here. Essentially it’s a revolving door. So rather than having the securities having a longer life in comparison to other asset backed securities, these only last a few months. \n\nIn addition to these other backed securities we have...\n\n&#x200B;\n\n# Student Loan Backed Securities\n\n[Student Loan Asset-Backed Securities: Safe or Subprime? (investopedia.com)](https://www.investopedia.com/articles/investing/081815/student-loan-assetbacked-securities-safe-or-subprime.asp)\n\n&#x200B;\n\n“Unlike private lenders, the federal government doesn’t check credit records for student loan borrowers. This leads to many borrowers who aren't worthy of credit qualifying for loans and then being saddled with debt indefinitely with little hope of paying it back. This harkens back to the sub-prime housing loans that inflated the housing bubble. Investors should be wary of how much longer these aggressive student loan lending strategies can be sustained.”\n\nThis is wonderful. Due to student loans being given regardless of credit, one can’t really say whether or not they will be able to pay it back. How does a ranking system accurately rate these bundled securities?\n\nLet’s look into the Student Loan ABS that [DoucheBank](https://www.salliemae.com/assets/investors/asset-backed-securities/2021-C/DistRpt21-C_20210715.pdf) and Sallie Mae have created together. \n\n&#x200B;\n\nhttps://preview.redd.it/n00e6lxfsre71.png?width=1296&format=png&auto=webp&s=1db628c9b8613f420b6e856a6743096abbf55465\n\n&#x200B;\n\nhttps://preview.redd.it/4jqt2bngsre71.png?width=1127&format=png&auto=webp&s=6690f018b7334fd4b31f14689da98993dea3ea45\n\nIt’s important to note a few things. If you are in school then you are not paying on your student loans. If you are having your loans deferred (usually because you’re in school but not taking out student loans) you are not paying. If you are in a “grace period” you are not paying. If you are delinquent then you are obviously not paying (haha). And if you are in forbearance then: You. Are. Not. Paying. \n\nIf I subtract the dollar value of those current on their student loan payments (214,066,876.27) from the total principal outstanding for this student loan securitization (525,333,317.44), I have $311,266,441 that are not being repaid upon. \n\nFrom a percentage perspective alone this means that for this securitization alone 59.25% of folks are NOT paying on their loan.\n\nHow do you think this will effect the backed securities?\n\n# Combine this knowledge with the knowledge of the CCABS, MBS, RBS, CMBS, AviationBS, AutoBS. \n\n# IT’S ALOT OF FUCKING BS.",
    "title": "🐱‍🏍👀🤦‍♀️Credit Card Asset Backed Securities and Student Loan Asset Backed Securities. 🤦‍♀️👀🐱‍🏍 It ain't just Rental Backed Securities....",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovuvmx/credit_card_asset_backed_securities_and_student/"
}