{
    "author": "jaykles",
    "created_utc": 1627128247.0,
    "distinguished": null,
    "edited": 1627138298.0,
    "id": "oqop7w",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oqop7w",
    "num_comments": 82,
    "permalink": "/r/Superstonk/comments/oqop7w/heres_some_information_on_how_volume_usually/",
    "score": 1955,
    "selftext": "**NOT ADVICE. Just sharing some information I stumbled across**\n\nHi everyone! \n\nI saw Chris Pratt looking embarrassed and being too afraid to ask why all the apes love the lowest of low volume. A lot of answers on the thread were confusing and only partially right. For example, one said \"It means no one's selling!\" one said, \"No one's buying!\" and one said, \"Obviously it's both...\" \n\nObviously they are all kind of right, the last guy is the most right, but all of them are sort of missing the bigger picture. No one cares how many shares are traded as long as the stonk 🚀🌕\n\nThe question is not why do apes love low volume, the question is what does low volume have to do with the price going up. \n\nHere is an article from the elder sub about what volume means for stock price movement. Take this information with a grain of salt. As with all assumptions about the stock market, you have to also assume a free and unhindered market for that stock (ROFLMAYO)\n\nRegardless, I still refer to this because it makes watching the ticker more fun. It's full of juicy tidbits like:\n\n\"Falling volume means that a trend is likely to reverse, whether price is going up or down, it applies to both\"\n\nAnd \n\n\"As a rule of thumb, if todays volume is higher than yesterday’s, it means that a trend is likely to continue\"\n\nAnd\n\n\"The true bottom of a stock occurs on low volume and is always retested at low volume. If it stays the same then this is a great buying opportunity\"\n\nThat last one. I absolutely love that last one.\n\nAll credit to u/tonymontanaisnice for the awesome post that made my brain feel a little more wrinkly.\n\nHave a great weekend everybody, and have a safe trip to the MOASS party!\n\n💎👐🦍🚀🌕\n\n🦍🤯🌎\n\nThat's what my first attempt looked like but then my link to \"the elder sub\" got bounced so here's the post almost in it's entirety. Check out u/tonymontanaisnice for the original and part 2!\n\nVolume\n\n-A trend that moves on steady volume means that its likely to continue aka price is rising or price is lowering\n\n-Falling volume means that a trend is likely to reverse, whether price is going up or down, it applies to both\n\n-A burst of extremely high volume means that its trend is likely to reverse. Usually when the stock reaches its peak or when all of a sudden it crashes, keep your eye on the volume\n\n-If there is Low volume and the price stays the same, it usually means thats this is the new normal price. People are unfazed by slight price changes here, this is the new normal\n\n-A second price breakout after one just occured is usually marked by yet another high volume spike. It usually means losers are heading for the exit because theyve been bag holding and cant take the pain anymore or bulls are jumping back in\n\n-a price breakout in low volume means that its fake, the price will recoil\n\n-rising volume during a rally(after a stock crashed)means that even though the bagholders are leaving, new losers are coming in\n\n-When volume shrinks during a rally, it means that bulls arent as eager to keep buying at these high prices. Fuel is being removed from this ship. A reversal is imminent\n\n-When volume dries up during a decline, it usually means a reversal. That is the bears are no longer shorting and the intelligent bulls who got out a long time ago are ready to pounce yet again\n\n-As a rule of thumb, if todays volume is higher than yesterday’s, it means that a trend is likely to continue\n\n-Volume is relative, what is high for ibm may be low for apple. What is low for apple may be high for ibm\n\n-As a rule of thumb, high volume is 25% higher than the avg volume of the past 2 weeks and low volume is 25% lower than the avg volume of the past 2 week\n\n-High volume confirms new trends. If prices rise to a new peak, and volume reaches a new high, then prices are likely to retest, that is go below the peak and come back to the peak to see if it can exceed it or go back down.\n\n-If a stock falls to a new low, and volume reaches a new high then that bottom will also retest- that is go up and come back down to that bottom to see if it goes even lower or stays there\n\n-the true bottom of a stock occurs on low volume and is always retested at low volume. If it stays the same then this is a great buying opportunity\n\n-if volume shrinks during an upwards or downwards trend then that trend is ripe for a reversal\n\n-When a stock reaches a new peak than it was yesterday, but the volume is lower today than yesterday- this is a great shorting opportunity, that is: Now is the time to sell or time to buy puts\n\nThis does not work on a downwards trend as a stock can keep going down even with low volume. It takes buying to move a stock up, but a stock can go down on its own weight\n\n-Watch volume during a reaction against the upward trend(aka panic selling). If the dip continues but volume shrinks, it means bulls are no longer running or selling pressure is spent. When the explosion of selling volume dries up, then it means that the upwards trend will resume. This presents a good buying opportunity or to buy calls\n\n-Many downtrends are punctuated(occurs at intervals) by rallies(price goes up momentarily)which begin on heavy volume. These shake out weak bears which causes volume to shrink and gives a signal to sell short~ this means that short sellers are now sure that the stock will crater because no more rallies\n\nEdit\n\nOh the post is called \"volume the final frontier and why it'll help you make money\". If that counts as sharing please let me know I'll remove it.\n\nHow could I forget the y\n\nTL;DR Buy and HODL 🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "Here's some information on how volume USUALLY effects stock.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqop7w/heres_some_information_on_how_volume_usually/"
}