{
    "author": "WickedStonks",
    "created_utc": 1622384300.0,
    "distinguished": null,
    "edited": 1622415559.0,
    "id": "noc4sc",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_noc4sc",
    "num_comments": 1693,
    "permalink": "/r/Superstonk/comments/noc4sc/if_the_squeeze_was_worth_only_1000_a_share_or/",
    "score": 16438,
    "selftext": "Dear Reddit world, as a new front page post, I need to call your attention to something. You could make some real change in this world. Please read... \n\n\nhttps://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf\n\nFollow u/Atobitt to learn more\n\n\n\nThink about it. Countless times to have covered, ended this, and moved on. They know what they did, they expect to now make double, even quadruple off their bet, that we are too stupid to pull this off.  They don’t plan to cover, but they will be forced to. IF we HOLD.\n\n\nFor them it’s their ego, their livelihood\n\nFor us it’s our futures, and the future of a better market for all. \n\nDo not fucking sell, until it’s EIGHT figures or more. For fucks sake. It’s pretty simple.\n\nEdit: IDGAF what a shill has to say. It’s obvious with you presence, we are on the right path. This is G M (fucking) E, and we know we are headed the right way, when we keep encountering shitty little trolls along the way.  \n\n\nIf you need something to read, someone to follow who you can trust, here’s some DD\n\nhttps://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf\n\nFollow u/Atobitt to learn more",
    "title": "If the squeeze was worth only $1,000 a share, or 5,000 a share or even 10k a share.. You know the hedgies would have just covered by now...",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/noc4sc/if_the_squeeze_was_worth_only_1000_a_share_or/"
}