{
    "author": "collectorkabbash",
    "created_utc": 1622389599.0,
    "distinguished": null,
    "edited": false,
    "id": "nodwdw",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nodwdw",
    "num_comments": 289,
    "permalink": "/r/Superstonk/comments/nodwdw/why_gme_is_worth_600_without_the_squeeze/",
    "score": 5307,
    "selftext": "Ryan Cohen built Chewy into a 40 Billion Dollar E-commerce business from Zero and he will do the same with GameStop... but this time it will be easier. Why? Because... \n\n1. GameStop is not at Zero, GameStop is already established. \n2. GameStop is already producing more top line revenue than Chewy.\n3. GameStop has an existing customer base of millions today.\n4. GameStop has an army of loyal retail investors.\n5. GameStop has the national spotlight and has a STRONG existing Brand.\n6. GameStop is targeting a much larger Gaming and Technology Total Addressable Market. \n7. GameStop has more established and proven talent now than Chewy had. Ryan Cohen and others are stronger and more knowledgeable today than they were at the start with Chewy. \n8. GameStop now with Ryan Cohen's team has an existing e-commerce business playbook that they know works. \n9. Way less debt than Chewy, ZERO DEBT. And the ability to raise money easily. \n10. Perfectly timed moment to perform a turnaround with the new console cycle. \n\nPepper in a new CEO, NFTs and Crypto... I don't understand how this isn't getting to the market cap of Chewy, at a minimum?\n\nThe only part of the Bear Thesis that made any sense was that GameStop wouldn't make it through the pandemic and would go Bankrupt because of their debt. Well that Thesis is obviously completely false now that the pandemic is coming to an end and GameStop paid off their long term debts completely. \n\nI'm writing this as a reminder because Bears keep saying GameStop cannot be turned around. It can and it will. And it will be \"easy\" because of the reasons listed above. \n\nThe short Squeeze is important, don't get me wrong. The squeeze will happen as the Market Cap continues its march to 40 Billion and beyond. But isn't that just icing on the cake at this price?! This stock should be $600+ a share if this was valued properly at $40 Billion Market Cap based on expected future earnings and past performance by this team, imo. \n\nI don't think it's unfair to compare Chewy to GameStop for valuation. If you do this comparison then GameStop appears very underpriced. GameStop should probably be valued at more than 40 Billion and worth more than Chewy for the above listed reasons. Ryan and team will tighten the existing operations, revenues will increase and profits will flow to the bottom line pushing earnings above Chewy Levels, in my opinion. \n\nAlso, I believe this is what u/deepfuckingvalue saw too but very early on because he is a badass. This is why I would bet he sees opportunity at anything under $600 a share, without the squeeze and would continue to tell congress he would buy. If you watch his videos it was not focused on the Short Squeeze. It was focused on GameStops SURVIVAL and TURNAROUND story. \n\nThe squeeze is real, don't call this piece FUD please because it's not and that's not the intention. I think the stock price is going well beyond $600 with the squeeze. But if we take the squeeze away for a moment and take a step back, anything under $600 is a deal and a no brainer buy in my opinion. Add the short squeeze and.... 🚀🚀🚀🚀🚀\n\nI am Buying confidently at this price and I bet DFV would be too! 📈🚀\n\nHope this serves as a reminder to where GME is and to keep those 💎👐s strong.",
    "title": "Why $GME is worth $600+ without the squeeze.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nodwdw/why_gme_is_worth_600_without_the_squeeze/"
}