{
    "author": "Mostalaine",
    "created_utc": 1615119178.0,
    "distinguished": null,
    "edited": 1615153306.0,
    "id": "lzpi40",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_lzpi40",
    "num_comments": 1092,
    "permalink": "/r/GME/comments/lzpi40/beware_new_shill_strategy_spreading_they_push_the/",
    "score": 8923,
    "selftext": "I’VE NOTICED THIS WEEKEND massive shill accounts and shill posts pushing the “we” agenda.\n\nThey want to gather “evidence” that the reddit retailers are manipulating the stock together, when in reality people are invested because people LIKE THE STOCK, BASED ON THE FUNDAMENTALS! PERIOD.\n\nDOWNVOTE all these kind of posts and REPORT them. Don’t give them fuel with comments and upvotes. There’s no “WE” in investment. \n\nEvery day they try new strategies, including gathering your personal info, positions, etc. Downvote and report these shill posts.\n\nEDIT:\n[The agenda is real. This is what I mean](https://www.reddit.com/r/GME/comments/lzzi1m/we_need_to_stop_worrying_about_collaboration/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nEdit 2:\nAbove post links to a[forbes article from Feb 4 ](https://www.forbes.com/sites/brucebrumberg/2021/02/04/reddit-and-gamestop-lessons-former-sec-enforcement-chief-explains-stock-manipulation-and-how-to-avoid-trouble/?sh=3bbdfce28590)  telling people it’s perfectly safe to manipulate markets together at specific times. How convenient.\n\nEdit 3:\nThis isn’t about anyone getting convicted, it’s about them having a scapegoat. Especially at the congress hearings, where they would blame retailers for grouping up to move and manipulate the stock, which isn’t and never been the case!! This is about not giving them ANYTHING to blame for their greedy retarded ass betting more money in a casino than they can afford.",
    "title": "BEWARE!!!! NEW SHILL STRATEGY SPREADING: they push the “we” agenda",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/lzpi40/beware_new_shill_strategy_spreading_they_push_the/"
}