{
    "author": "JustBeingPunny",
    "created_utc": 1618927986.0,
    "distinguished": null,
    "edited": 1619004702.0,
    "id": "mur8bz",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mur8bz",
    "num_comments": 822,
    "permalink": "/r/Superstonk/comments/mur8bz/srdtc2021004_the_dtcc_and_jp_morgan_theyre/",
    "score": 12533,
    "selftext": "**Edits at the bottom**\n\n&#x200B;\n\nI know what you're thinking. What the hell is a netting account and why does this matter?\n\n&#x200B;\n\n**WELL.**\n\n&#x200B;\n\nMy wonderful apes let me feed you with some information. As always, I know nothing and may be putting 2+2 together to make banana. Please critique and help me fill in the gaps, my knowledge on this started approximately 10 minutes ago.\n\n&#x200B;\n\n# The background\n\n&#x200B;\n\nhttps://preview.redd.it/9jbqiv21ybu61.png?width=818&format=png&auto=webp&s=bfb10ccc8c15acef2db91dcb37da4aee8761a26a\n\nSo yesterday JP Morgan was approved for three more netting services accounts. You might be wondering, *why is this important?*\n\nWell lets explain the purpose of **Netting.**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Netting\n\n&#x200B;\n\n*Netting is a method of reducing risks in financial contracts by combining or aggregating multiple financial obligations to arrive at a net obligation amount. Netting is used to reduce settlement, credit, and other financial risks between two or more parties.* \n\n&#x200B;\n\nAs I will explain, netting has various purposes depending upon its' use. In trading it's described as offsetting losses in one position with gains in another. For example;\n\n&#x200B;\n\n* I'm short 60 bananas\n* I'm long 100 bananas\n* My net position is long 40 bananas\n\n&#x200B;\n\n**Easy right?**\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Netting some failing whales\n\n&#x200B;\n\nWell it also has other purposes.\n\nNetting is also used when a company files for bankruptcy, whereby the parties tend to net the balances owed to each other. This is also called a set-off clause or set-off law. In other words, a company doing business with a defaulting company may offset any money they owe the defaulting company with money that’s owed them. The remainder represents the total amount owed by them or to them, which can be used in bankruptcy proceedings.\n\n[Netting Definition (investopedia.com)](https://www.investopedia.com/terms/n/netting.asp)\n\n&#x200B;\n\nThere are various types of netting are available;\n\n&#x200B;\n\n* Close out\n* Settlement\n* Netting by novation\n* Multilateral\n\n&#x200B;\n\n&#x200B;\n\nThe one that is the most interesting? **Multilateral.**\n\n&#x200B;\n\nMultilateral netting is netting that involves more than two parties. In this case, a clearinghouse or central exchange is often used. Multilateral netting can also occur within one company with multiple subsidiaries. If the subs owe payments to each other for various amounts, they can each send their payments to a central corporate entity or netting center. The main office would net the invoices and the various currencies from the subsidiaries and make the net payment to the parties that are owed. Multilateral netting involves pooling the funds from two or more parties so that a more simplified invoicing and payment process can be achieved.\n\n&#x200B;\n\nNow I know what you're thinking, '*one company with multiple subsidiaries'.* I may be wrong but there would be no requirement to register with an account with the DTCC in such a way if it was all internal.\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# What does this mean!?\n\nWell remember this lovely rule?  SR-DTC-2021-004  and this wonderful DD?\n\n[Why We're STILL Trading Sideways and Why We Haven't Launched](https://www.reddit.com/r/Superstonk/comments/mu9xed/why_were_still_trading_sideways_and_why_we_havent/)\n\n&#x200B;\n\nI quote -\n\n**\"DTC may, in extreme circumstances, borrow net credits from Participants secured by collateral of the defaulting Participant\"**\n\nAgain I quote [u/c-digs/](https://www.reddit.com/user/c-digs/)\n\n&#x200B;\n\nWhat if:\n\n1. You are a non-defaulting member\n2. And You **know** that there are going to be member defaults\n3. And you **know** that that there will be an auction for their assets at a market discount\n\nHow would **you** prepare for this? Perhaps you'd want to have cash on hand to meet liquidity requirements and emerge from any collapse flush with assets? How might you go about this?\n\n&#x200B;\n\n**Well I think opening 3 new netting accounts would be perfect to prepare for this situation.**\n\nHowever, these don't come into effect until 05/03/2021. So make of that what you will.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**TL;DR - J.P Morgan opened three additional netting accounts with the DTCC on 04/19/2021. These generally have many different purposes although it I don't believe its' coincidental regarding the rule changes, increase in liquidity and ever impending doom of other DTCC members. This looks to be the groundwork to have means to profit off of the defaulting, over exposed members.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Edits start with the newest at the top\n\n&#x200B;\n\n# Edit 4 -\n\nWhat a wonderful comment by u/Themeloncalling\n\nI feel that there is need for some counter-DD here. The Netting account is addressed to the Mortgage Backed Securities department. You know, the good folks responsible for the financial collapse, who like another MBS, are good at chopping things up and bringing them elsewhere. I believe the shitstorm here with netting accounts and the weekend meetings has to do with commercial mortgage backed securities (CMBS) having their books cooked. This article detailing overstating of CMBS income is a widespread problem:\n\n[https://theintercept.com/2021/04/20/wall-street-cmbs-dollar-general-ladder-capital/](https://theintercept.com/2021/04/20/wall-street-cmbs-dollar-general-ladder-capital/)\n\nThe graph shown by the university researchers shows that the incomes of the leaseholders are 25% to 50% overstated, and delinquency rates are spiking at the same rate or worse compared to 2008 among CMBS - can you spot the banks that just issued record amounts of bonds this week in the first chart? A netting account would be necessary because the delinquencies are skyrocketing with covid support and SLR ending on March 31, 2021. I believe there is rampant shorting of the Treasury Bonds, and since the SLR now requires disclosure of Bonds again (which are heavily shorted), the banks now need to issue bonds to cover their bad bets and the overstated income of their mortgage owners - the netting account is where you settle your bad bets and pick up the pieces.\n\nTo further reinforce this point, the Infinity Q hedge fund was liquidated because they overstated their NAV value by at least 30%:\n\n[https://www.reuters.com/business/finance/exclusive-new-yorks-infinity-q-winds-down-hedge-fund-valuation-issues-spread-2021-04-19/](https://www.reuters.com/business/finance/exclusive-new-yorks-infinity-q-winds-down-hedge-fund-valuation-issues-spread-2021-04-19/)\n\nThe emergency appointment and meetings on the weekend would make sense given that there will be a lot of bagholders from the CMBS fallout that will begin to rear its head in May. The firewalls will be put in place to ensure one firm's toxic pile of CMBS does not become a systemic problem.\n\nSince we do need to tie GME into this somewhere, I believe the biggest impact will be ~~reduced~~   increased margin requirements for hedgies. As liquidity dries up, banks will reduce the amount they lend out on margin, forcing hedgies to close short positions. If they are already upside down on a short, let's say one where an $8 short position now owes over $145 a share, there's no way out except liquidation - a margin call that sets off all the dominoes. The catalyst for a margin call may not be anything to do with GME at all, it may be another cancer like CMBS that reduces the amount of margin available for hedgies. In any case, buy and hodl.\n\n# \n\n# _____________________________________________________\n\n# EDIT 3 - Oh I'm sorry. I've been corrected. IT'S NOW SEVENTEEN. u/patthetuck\n\n&#x200B;\n\nhttps://preview.redd.it/31yr8yywjcu61.png?width=814&format=png&auto=webp&s=f2e5be82960621386f594d828713201ef9e79460\n\n&#x200B;\n\nEdit 2 - What a wonderful comment. u/Longjumping_College\n\n&#x200B;\n\n[Here's DTCC's page](https://www.dtcc.com/clearing-services/ficc-mbsd/msbd-netting) on *netting and settlement services.*\n\n[~~This kinda freaked me out~~](https://www.dtcc.com/charts/previous-12-months-volume-for-mbs) ~~when I saw it on that page as a essentials document to check....~~\n\n*~~$103 trillion~~* ~~in mortgage backed securities..~~.\n\n&#x200B;\n\nThe page?\n\n&#x200B;\n\n[Crayon go brr](https://preview.redd.it/kvnjndf3ecu61.png?width=884&format=png&auto=webp&s=897fdea90adcd04bde204fd93f22051c0f74622e)\n\n&#x200B;\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nEdit - Oh yeah, BOFA added one too. Also CitiBank. Wonder what these accounts are used for...\n\n&#x200B;\n\nhttps://preview.redd.it/kgtgknbhacu61.png?width=813&format=png&auto=webp&s=917b354a4476b27e3e6294fa2fe99e0fcb2b6946\n\n&#x200B;\n\nhttps://preview.redd.it/cv0u1ynracu61.png?width=810&format=png&auto=webp&s=69894769014fd39bc81538700206c151949f5af3\n\n&#x200B;",
    "title": "SR-DTC-2021-004, The DTCC and J.P Morgan. They're getting ready for defaults and bankruptcies, they've just opened THREE additional netting accounts.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mur8bz/srdtc2021004_the_dtcc_and_jp_morgan_theyre/"
}