{
    "author": "Stonkinator3000",
    "created_utc": 1628456233.0,
    "distinguished": null,
    "edited": 1628456487.0,
    "id": "p0mtmt",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_p0mtmt",
    "num_comments": 715,
    "permalink": "/r/Superstonk/comments/p0mtmt/one_reason_i_know_other_apes_have_added_huge_to/",
    "score": 6297,
    "selftext": "The guys who set out to catalog the various cognitive biases used themselves as the essential data points. They believed that as long as they weren’t insane then the way they saw and reacted to the world should be similar to the way everybody else did too because we all share the same evolutionary hardware.\n\nSo when I think about my own journey since January, when I think about the rage that all the corruption and manipulation by the shfs has engendered in me, when I think about the due diligence showing GME to be a tech turnaround play for the ages, I can confidently assume that all the other apes out there have reacted similarly to those stimuli.\n\nIt’s not just about everybody writing that they’ve been buying more shares the whole time. That’s one data point to take into consideration. But just as important for me is that I know I’ve been buying a ton more the whole time and I know through cognitive psychology that everybody else is enraged by what’s happened like I am and excited about the turnaround like I am, and thus I can confidently infer that those stimuli have caused the same behavior in them as it has in me, to compulsively buy shares of GME without ever selling a single share.",
    "title": "One reason I know other apes have added huge to their positions since Jan is because I have. Cognitive psych says our brains are all structured similarly and thus we all share the same cognitive biases.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/p0mtmt/one_reason_i_know_other_apes_have_added_huge_to/"
}