{
    "author": "dodecaphonicism",
    "created_utc": 1619543035.0,
    "distinguished": null,
    "edited": 1619553880.0,
    "id": "mzt5sm",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_mzt5sm",
    "num_comments": 444,
    "permalink": "/r/Superstonk/comments/mzt5sm/attorneys_and_you_a_guide_to_the_newly_rich/",
    "score": 3886,
    "selftext": "**THIS POST IS FOR ENTERTAINMENT PURPOSES ONLY NOT LEGAL ADVICE; NO ATTORNEY-CLIENT PRIVILEGE IS CREATED BY THIS COMMUNICATION; THIS IS DEFINITELY NOT FINANCIAL ADVICE, I BLEND MY CRAYONS WITH MY MORNING SHAKE TO REALLY GIVE IT THAT NICE CRAYON-Y FLAVOR.**\n\n**FINAL EDIT** *Hi all, work is whipping up, so I gotta run. Thanks for all of your questions and I'll be lurking in the shadows if you need to come find me. BYE!! (104 PM PDT)*\n\n**Quick edit (1139 AM PDT)**: I'll be going to lunch at 12:30 PDT to take off my pants for the last 30 minutes of the market so my boner doesn't rip my zipper, so if you have questions and they're not getting answered I will do my very very best to get to them once the market has closed and I've eaten my lunch.\n\n\nA few edits: \n\n* This is for US Based Apes only. I am sorry, CA/UK/EU/Beyond apes, my magic is limited to this country. :(\n\n* **BEWARE**: IF YOU LIVE IN **LOUISIANA** as your laws are basically based on France's old Civil Code and may not conform to ANYTHING resembling the rest of the union. DEFINITELY seek professional counsel **IN LOUISIANA** or **BARRED IN LOUISIANA** for help.\n\nHello all. I am a fully licensed attorney in two states (**happy to provide proof to mods upon request**!) and I wanted to drop my .02 and give you a little (not legal) advice on behalf of someone who works with lawyers all day and every day.\n\n* *You're about to be rich - protect everything you have.* \n\nSo here we are at the brink of a totally new era of financial stability for a lot of people. How many of you have a minimum insurance policy on your car/apartment/home? Show of hands? Okay, put them down. That's a lot of you. The first thing you need to do is immediately protect your property to the fullest extent possible as someone with a high net-worth is basically a giant bullseye for dicks who will sue you for anything and everything simply because they know that you are \"the deep pocket\" as we say in the law. Personally, I carry a $250,000/$500,000 policy on my vehicle with a $1M Personal Liability Umbrella for about $131/mo. YMMV based on zip codes, your credit, and what you drive but whatever it is, is it worse than getting hit with a shitty frivolous lawsuit because you bumped them at 3 mph and they have a fuckton of crooked doctors who will swear to anything as long as they get cut. **Trust me. I know. I fight these people on a DAILY BASIS**. There are policies available for every conceivable situation and some brokers may not have what you need. **Do your DD or see a licensed professional for help**. For instance, that new Lambo you're gonna buy? Most insurers won't touch it and if you're under 25, best of luck. There are specialty insurance companies who serve that area. **HOWEVER** there are also a LOT of shady insurance agencies who will happily take your premium and then smile while they write you the minimum policy limits you bought because you weren't paying attention. *cough*TheGeneral*cough*\n\n* *All Attorneys are NOT the Same*\n\nWould you go to a barber to have your oil changed? FUCK NO. Then why would you go to an attorney who doesn't do what you want them to do. I used to be what is called a \"General Practictoner\" because that is what my father did before me for 30+ years. I got out of that game and focused (notice I didn't say specialized...more on that later) on a small area of practice and carved out my niche because no one wants a Jack of All Trades anymore in 2021. In the case of Tax and other Financially related areas of practice, you want someone who focused on these areas and these areas **almost solely**. By the time you finish reading this sentence, the tax law has changed and those attorneys who do that kind of thing have received an email alert from WestLaw telling them that the law changed and to make note of it. See, it just changed again.\n\n* *Your Friends (and you) are Not Good with Money*\n\nI'm sorry to be the bearer of bad news, but they're not and you're not. Talk to your accountant and your attorney about money; talk about boobs/dongs with your friends. An attorney who deals in trusts and estates can help you set up whatever kinds of trusts are available in your state. They vary from state to state by statute, so don't try to copy-paste something you find online. Also, for the love of everything holy, do not **AND I CANNOT STRESS THIS ENOUGH,** do not try to create your own trusts unless you know what the fuck you're doing. You may think you're saving some money by copying something you see online but if you set the thing up wrong, you could end up double or even triple taxing yourself and really doing some irreversible damage. You're an adult with adult money now. Go see a professional. DIY is for home projects not the protection of potentially *multi-generationally* held assets.\n\n* *Get Recommendations From an Accredited Organization*\n\nFinding a lawyer should not be done by \"letting your fingers do the walking\" - holy shit, I'm so old that I remember what that actually means - instead you should get recommendations from the State Bar Association if you have one or a local City/County association. If you live in a Metropolis, there is one there. 100% sure of that. If you're from more rural surroundings, call your State Bar. They have lists of lawyers who have agreed to be on the list and usually have agreed to a certain number of conditions including, but not limited to - maintaining Malpractice Insurance in states where it is not compulsory and/or a statement no disciplinary actions (public and/or private) in any state. However, no matter what you do, research that firm/person. They may not have a public/private discipline record but they might be enormous assholes. Sometimes you want that, but sometimes you really don't. You want to mesh with this person - not like socially or anything - but in a sense that you would not cringe anytime they call or when you need to call them. As for \"specialization\" (see, I came back for it) some states do NOT allow an attorney to say that they \"specialize\" in an area of practice unless they are accredited by a smaller sub-bar association who deals with that kind of accreditation. Do your DD.\n\n* *Tax Haven States*\n\nA fun little loophole rich people like to do is create corporations in tax free states like Montana or Oregon and then have that corporation own the property. Why? Because you may not have to pay tax on huge purchases because you don't own them, the corporation in Montana owns it. Ever wonder why SOOO MANY supercars in the US have Montana plates? Well, now you know. No one in their right mind wants to purchase a $350,000 car and then have to cough up **another $35,000 in TAX**. DEFINITELY TALK TO A PROFESSIONAL ABOUT THIS ONE. The loopholes are closing slowly and if you don't want to end up with your nuts/labia caught in the loop when it tightens, you better have some help.\n\n* *Parting Thoughts*\n\nSo, that's all I can think of while I procrastinate and eat some snacks while I watch Kenny and the Gang gasp for air as the water rises around them. I am at work until 5 PM PDT so, I may not be EXTREMELY responsive but I will endeavor to answer as many questions or concerns as I can. **Glory in the Highest to DFV and RC. May they bless and protect our Crayon and Tendie Sandos forever and ever. Amen.**",
    "title": "Attorneys and You: A Guide to the Newly Rich",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mzt5sm/attorneys_and_you_a_guide_to_the_newly_rich/"
}