{
    "author": "Horror_Veterinar",
    "created_utc": 1628125649.0,
    "distinguished": null,
    "edited": 1628126526.0,
    "id": "oy6u4z",
    "text_only": true,
    "flair_text": "🚨 Debunked 🚨",
    "name": "t3_oy6u4z",
    "num_comments": 125,
    "permalink": "/r/Superstonk/comments/oy6u4z/come_meet_your_reverse_repo_counterparties/",
    "score": 718,
    "selftext": "Hello, and welcome to the party!\n\n..or should I say..\n\nCOUNTER-PARTY!\n\nTEEHEE RIFFLE-DEE BEKKED!\n\nAnyways...\n\nMy tits hurt, and I'm a little surprised by the findings, but then again, not really!\n\nLETS BEGIN YA?\n\n&#x200B;\n\n[This is a graph of EVERY MM FUND with exposure to the Newyork Federal Reserve RRP facility. \\(remember, for the Money Market Funds, they would be on the REPO side\\)](https://preview.redd.it/yx1fygpeyff71.png?width=1175&format=png&auto=webp&s=4a6e8c28218816fa13eeeb931debe9ba32da1055)\n\n&#x200B;\n\n[IDK wtf happened between late 2013 and early Jan 18, but it's MICROSCOPIC compared to today.](https://preview.redd.it/b5tht3kxlff71.png?width=1217&format=png&auto=webp&s=20bc91774216fcb79eaeb947eba500c7ef86a6ff)\n\nThis website is fantastic, and I've verified the data is accurate by cross-referencing Fidelity's website holdings report for the 06/03/2021 time period, which looks like:\n\n[This is the holdings report for 06\\/30 for SPAXX Fidelity . As you can see, they participated in the Fed Reserve Bank of New York.](https://preview.redd.it/dt7xyso9mff71.png?width=1128&format=png&auto=webp&s=7069d63bf96f346ca4cc1277b138c4e7a978fc27)\n\nHOWEVER, this is where it gets interesting.\n\nUpon looking further into the data, it's apparently clear:\n\n&#x200B;\n\n*COUNTERPARTIES ARE NOT VANGUARD, BLACKROCK, FIDELITY, STATE STREET, ETC...*\n\n**COUNTERPARTIES ARE EACH INDIVIDUAL MONEY MARKET FUND THAT USES THE REPO FACILITY!**\n\nTake a look:\n\n&#x200B;\n\n[This was my own personal data entry. Total between these three for 06\\/30\\/21: $455,819,634,437](https://preview.redd.it/uv0ai02pmff71.png?width=1575&format=png&auto=webp&s=c474fd90d60d1f8f8f7c6e4626491b7222687fdc)\n\nI cross-referenced the above data with [https://www.financialresearch.gov/money-market-funds/us-mmfs-repos-with-the-federal-reserve/](https://www.financialresearch.gov/money-market-funds/us-mmfs-repos-with-the-federal-reserve/) and I determined it was accurate and safe to use from that point on. (saved butt loads of time) heh..butt..\n\n***LOOK HOW FUCKING MUCH FIDELITY IS USING THE RRP AS OPPOSED TO THE REST OF THE PARTICIPANTS.***\n\n&#x200B;\n\nFidelity alone accounts for 11 counterparties, and has dominated everyone. Blackrock and JP Morgan ***combined*** are just shy of half that of Fidelity's dollar amount, and have only a combined 9 participating \"counterparties.\"\n\nMy hypothesis, as per usual..\n\n***SHARE MOTHER F\\*CKING LENDING!!!***\n\nPossibly due to the massive inflow of traffic?\n\nWhat about Vanguard?\n\n&#x200B;\n\n[Only 3 funds.](https://preview.redd.it/n6s0576rnff71.png?width=349&format=png&auto=webp&s=7df0037ae12a391c99ffbea512c7c7c42069adae)\n\n■ Vanguard Market Liquidity Fund  : *$14.3 BILLION*\n\n■ Vanguard Federal Money Market Fund: *$9.8 BILLION*\n\n■ Vanguard Cash Reserves Federal Money Market Fund *$5 BILLION*\n\n*VANGUARD TOTAL:* ***$29.1 BILLION, 3 counterparties***\n\n**\\[to speed things up, I'm just going to give the aggregated total for the remainder:\\]**\n\n&#x200B;\n\n[GOLDMAN SACHS, MARCH-JUNE. \\(this loophole only works once per month on the last day of the month\\) $57 BILLION](https://preview.redd.it/c5do6v38pff71.png?width=281&format=png&auto=webp&s=5a9a38d8b0420de216cfb4b49bdffb692124c962)\n\n***You'll notice a familiar trend with this subset of data. Look at FEB*** *FEB, WUT DOING!?*\n\n&#x200B;\n\nhttps://preview.redd.it/x7vcl3fjqff71.png?width=898&format=png&auto=webp&s=072994980e72eb6b02bc148184e2be03e67af6c8\n\nLMFAO, SO YOU'RE TELLING ME, THIS SHIT HAD NO DEMAND IN FEB.. AND BECAUSE APES HELD, ALL OF A SUDDEN, REPO GOES TITS TO THE SKY, AND THERE'S NO END IN SIGHT?\n\nLADIES AND GENTLEMEN, THIS IS WHY WE HOLD.\n\nI find it hard to believe that this market magically and mysteriously goes absolutely crazy after a bogus hearing where they tried to paint DFV as the manipulator.\n\nI really think based off of this data that they never expected us to make it through Feb. They bet on us all selling, calling the squeeze squoze, until DFV blew everyone's mind on TV when he basically testified under oath that, and I'll never forget, \"I like the stock. I'm as bullish as I've ever been on a potential turnaround for GameStop.\"\n\nThis jacks my little tits so nice!\n\nNot sure what to make of this, as most of us are in Fidelity, and they clearly have the most exposure to the RRP program.\n\nWUT DOING?\n\nHere's the rest of the counterparties exposed to RRP:\n\nJP Morgan\n\nLegg MasonFranklin TempletonT. Rowe PriceInvescoDWS InvestmentsBank of AmericaDimensionalHSBCAllianceBernsteinPrudentialColumbiaPNC InvestmentsWilmington Funds\n\nGoldman SachsNorthern Trust FundsFederatedMorgan StanleyDreyfusState StreetVanguardSchwabWells FargoFirst AmericanUBS\n\nPublic Financial Manag...\n\nMount Vernon\n\nAmerican Funds\n\n[Adding it all up, I'm still missing like 100 Billion? Interest at 0.05 would be 41.6 Billion based on the 860 billion this adds up to.](https://preview.redd.it/ohtku61btff71.png?width=495&format=png&auto=webp&s=4cacd5feba1904fa297f5691b05d1700cac4824c)\n\n&#x200B;\n\nWHERE REST OF MONEY YO?\n\nI think we're missing something...\n\nAND here's the totals for that day:\n\nIf you add up the difference, the interest made them about 1T.\n\n&#x200B;\n\n[https:\\/\\/www.financialresearch.gov\\/money-market-funds\\/us-mmfs-repos-with-the-federal-reserve\\/](https://preview.redd.it/xrrerijwtff71.png?width=775&format=png&auto=webp&s=83b45af3b4d79b7a08c124e8efab244d268c128b)\n\n&#x200B;\n\n[RRP info from that day. 90 counterparties with 991.939](https://preview.redd.it/nq9ass4ztff71.png?width=1008&format=png&auto=webp&s=0974ba22826ae5707a75b8c93a7c913150f44e2f)\n\nTL;DR\n\nIDK, shit is whack. and it's because of US based on what I just saw.\n\nFound like 90% of the counterparties for the RRP market. All I haven't done yet is count the individual counterparties included in this data set. Based on data, APES holding in FEB is a direct cause of the demand for the RRP market likely due to share lending. I'm tired holy shit.\n\nI believe this website may be missing ONE MMF series...\n\n&#x200B;\n\n***MMO SERIES TRUST***\n\n&#x200B;\n\nThat's where I look next.\n\n&#x200B;\n\n\"nOt fINanCiAL aDviCe\"",
    "title": "Come Meet Your Reverse Repo Counterparties! Fidelity is the biggest player! [DATA AS OF 06/30/2021] The day we saw nearly $1T for the first time! FIDELITY, WUT DOING?",
    "upvote_ratio": 0.69,
    "url": "https://www.reddit.com/r/Superstonk/comments/oy6u4z/come_meet_your_reverse_repo_counterparties/"
}