{
    "author": "yugeballz",
    "created_utc": 1627226997.0,
    "distinguished": null,
    "edited": false,
    "id": "ordmfd",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ordmfd",
    "num_comments": 58,
    "permalink": "/r/Superstonk/comments/ordmfd/patents_held_by_ken_c_griffin/",
    "score": 1061,
    "selftext": "So you already know your boy Kenny was a jack of all trades (making things appear out of thin air, expert at hide-n-seek, etc.).  Did you know he was also an inventor? He has filed several patents, a few which have actually been granted. \n\nIf you go to Google Patents you can type of the following to read what is filed:\n\nPublication Numbers:  20020138387,  20060069636,  20090313179,  20110238594 \n\nGranted Patents: 7587347,  7603309,  7958039,  7987128,  8214283 \n\n# The two that are most interesting:\n\n**Patent number:** 8214283 \n\n**Title:** Computer implemented and/or assisted methods and systems for providing rapid execution of, for example, listed options contracts using toxicity and/or profit analyzers\n\n**Abstract:**  \"Methods and systems are provided which enable options broker-dealers to execute a listed options contract trade order while simultaneously eliminating (or at least reducing) exposure to the negative consequences associated with toxic (or likely toxic) trades in the options market. By using toxicity and/or profit analyzers, for example, to detect, track and respond to the level of toxic (or likely toxic) orders present in an option contract order flow, a broker dealer can reduce the level of risk inherent in serving as a counter-party in listed options transactions, and inherent in offering a rapid execution guarantee. Various alternative embodiments are also disclosed.\"\n\n\\*note: the ones previously filed with the same name seem to just be earlier iterations of this one\n\n **Publication number:** 20020138387 \n\n**Title:** Method and apparatus for maintaining a uniform net asset value per share or unit\n\n**Abstract:** \"A method for maintaining a uniform asset value per share and complete fungibility among all shares in investment funds while providing for differential fees and credits, as well as any other factors which may be differentially applicable to different investors, separately in respect of each investor. The method also permits accounting for a single investor's shares to be classified into different categories in respect of such factors as redemption rights or fees due, while maintaining a complete fungibility among such shares so that it is not necessary to identify any particular shares as belonging to any specific category.\"\n\n\\*note: this one is abandoned meaning inactive but you can see their ideas on this subject matter\n\n**So what does all this mean?** I don't know.  \n\n**Why post then Yugeballz?** I haven't seen it mentioned before.\n\n**Wut do?** If you have a few wrinkles, take a look. Maybe you'll see something I don't. There's pretty pictures and everything. \n\nHow find: Type \"Google Patents\" in your search bar. Type in those numbers and they are there.",
    "title": "Patents held by Ken C. Griffin",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ordmfd/patents_held_by_ken_c_griffin/"
}