{
    "author": "salsa_sauce",
    "created_utc": 1624966039.0,
    "distinguished": null,
    "edited": 1624977316.0,
    "id": "oa6cei",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oa6cei",
    "num_comments": 1065,
    "permalink": "/r/Superstonk/comments/oa6cei/psa_for_trading212_apes_heres_what_you_need_to_do/",
    "score": 10185,
    "selftext": "If you haven’t already seen, as of this morning, T212 are forcing customers with a General Investment account (but not ISAs) to agree to their shares being lent out.\n\n**To be clear, as I’m seeing a lot of misinformation in the comments:** this ONLY applies to general investment accounts, which did not previously have their shares lent out. T212 are already known to automatically lend shares on *margin* accounts, but this only applies to “normal” share accounts with them.\n\nHere’s what I would consider doing:\n\n1.\tNever give these crooks another penny of your money\n2.\tDo **not** agree to have your shares lent out. If you don’t agree by July 13th, T212 say you will only be able to close or reduce positions.\n3.\t**Continue to hold your existing shares with T212.** Do **not** try and transfer, due to T212 restrictions you’ll have to sell your shares and buy them back at market rate, which means you could incur a loss, and hedge funds could potentially buy back your shares to cover positions.\n4.\t**Open an account at another broker**, but to be clear, do **not** transfer. Just use this new brokerage account for future purchases. This way, you keep your existing shares held at T212, and as long as you haven't agreed to the terms changes, they will not be lent out.\n5.\tIf you’re a U.K. ape, and **haven’t already opened a shares ISA this financial year**, open an ISA account with your chosen provider. This way your gains are tax-free, and crucially, **shares cannot be lent out from ISAs**.\n6.\t**Continue to buy through your new broker**. Only return to T212 to close your positions when MOASS takes off (or keep your shares there for the Infinity Pool)\n\nMany T212 users seem to be in the U.K., for those people I would recommend Interactive Investor (no known restrictions), or Freetrade (max $25k per order, but they have suggested this will change). I personally wouldn’t recommend  Hargreaves Lansdown, as they don’t offer limit orders without calling them up. *Do your own research, these recommendations are just my personal experience*.\n\nThis isn’t financial advice. Good luck!",
    "title": "🚨 PSA for Trading212 apes: Here’s what you need to do next…",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/oa6cei/psa_for_trading212_apes_heres_what_you_need_to_do/"
}