{
    "author": "RocketTraveler",
    "created_utc": 1625011154.0,
    "distinguished": null,
    "edited": 1625020242.0,
    "id": "oaku66",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oaku66",
    "num_comments": 72,
    "permalink": "/r/Superstonk/comments/oaku66/technical_analysis_its_all_lining_up_week_of_628/",
    "score": 1069,
    "selftext": "Fellow HODLers,\n\nCheck below for a quick TA snapshot to see where we may be headed this week!\n\n# Preface\n\nFor those who believe TA is invalid on GME and other SHF-manipulated stocks, I respect your opinion.\n\nMy opinion? TA is not the holy grail by any means, but it is still valid on GME.\n\nWhy? Because TA relies heavily on human patterns and emotions as they relate to stock prices. GME is no exception. There are still support and resistance levels like everything else.\n\nYes there is **no denying** GME is heavily manipulated, but that doesn’t change the larger philosophy TA is based on.\n\nRemember, TA is not a crystal ball but it does offer a glimpse into the **most likely** outcome.\n\nThink of TA like predicting the weather.  Weather forecasters are often correct in their predictions but not always.  We can infer patterns in chaotic systems (like the stock market) and often be correct in our predictions; however, it does not always work out to be the case.\n\n**Setting expectations: There is no guarantee we will see a move up in the next 1-2 weeks, but lots of technical indicators appear to be pointing that direction!  Regardless, I believe long-term the only direction is up.**\n\nWe all want the same thing.  GME go BRRRRRRRRR.\n\nWith that out of the way, here are some indicators on where we might be headed through next week!\n\n# Bull Pennant\n\n* We have formed a very nice bull pennant with Monday and today's price action.  The pole of the pennant is very strong (formed by the Russell rebalancing)\n* The pole was formed from **$198.50 to $224.25**\n* We had a nice dip from the top of pole to consolidate at the base of the pennant **($209).**  Notice the wedge pattern we are producing... (thanks for the observation /u/ChristineWhy)\n* Bull pennants on their own are not strong enough evidence to support a move upwards, but combined with the other factors below I am leaning in that direction\n\nIf we hold the **$209** level tomorrow, we have a higher chance of a breakout\n\n[Classic bull pennant with a great formation](https://preview.redd.it/ozp0e49xja871.png?width=1222&format=png&auto=webp&s=b3bd338efb85f0813a036563af09f76d4c040daf)\n\n# Bullish Divergence\n\n* On the hourly timeframe we are now showing a regular bullish divergence within the RSI.  This happens when the price action goes lower, but the RSI increases during the same time period (counting from the low points of the charts)\n* This shows that the downward/sideways trend of the past few weeks is weakening/reversing.  Would love to see this propagate to the larger timeframes (4 hr, Daily)\n\n[Regular Bullish Divergence showing on the hourly chart](https://preview.redd.it/kh41npolka871.png?width=1269&format=png&auto=webp&s=3f1b5d0dd9e8a6de37ea55bc31194a702b41309b)\n\n# Cup & Handle\n\n* As most of you have probably seen, we are in the midst of a **GIANT** cup and handle formation.  GME has been forming this since early March\n* This pattern more often than not indicates price momentum breakouts upwards past the previous top of the cup.  If a breakout does occur, it **always** happens from the handle.  Handles typically last anywhere from 1-4 weeks.  **We are currently in Week 3 of our handle**\n* If the bull pennant mentioned earlier has a breakout, it could be all that we need to break out of the upper resistance line of the handle.  This is would begin our momentum upwards\n* We have banged our head against the resistance line of the handle more than we have bounced off of the support line (check images below).  This tells me that GME wants out of this channel!\n* Minimum breakout price target off of GME's cup and handle puts us at $560 before we continue upwards.  Look what happened to movie stock after it broke the cup and handle... it launched over 500%!\n\n&#x200B;\n\n[Large-Scale Cup and Handle View](https://preview.redd.it/uo6rb8f7la871.png?width=1018&format=png&auto=webp&s=abd4b76f730eeb79e67fd857825caf71fd79a15e)\n\n&#x200B;\n\n[Handle - Support and Resistance.  If we bust above the top white line - we should see a massive move upwards](https://preview.redd.it/zo8ineldla871.png?width=1082&format=png&auto=webp&s=6e0cfdac19a57b5bae9ac6c114c88ad272f64d1a)\n\n# Gaps\n\n* Gaps are \"holes\" in the candlestick chart that result from a strong movement that happened too quickly, either up or down\n* Gaps like to be filled.  Holes created on the way up are filled on the way back down, and vice versa\n* GME historically has filled **every single gap** in its chart, and it doesn't like to wait around to do so.  Currently we have a gap sitting up around $290 waiting for us to come back up and fill.  This lines up very well with the previously mentioned TA factors...\n\n&#x200B;\n\n[Beautiful gap at $290 to fill!](https://preview.redd.it/7hfrka7ula871.png?width=1360&format=png&auto=webp&s=55d3a3f2e7894ebe59448348316f31fdb1c3fe60)\n\n# TLDR;\n\nLong term we are going upwards.  No denying that.  Higher lows and higher floors combined with increased momentum over the past 6 months = extremely bullish\n\nShort term, multiple TA indicators are flashing signs of a potential violent move upwards in the next week or two.\n\nTA is not the holy grail and it is not a guarantee the indicators will play out as we are predicting.  Let's see what happens!\n\n*I am not a financial advisor and this is not financial advice.*",
    "title": "Technical Analysis: It's all Lining Up - Week of 6/28",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oaku66/technical_analysis_its_all_lining_up_week_of_628/"
}