{
    "author": "lnsip9reg",
    "created_utc": 1623823287.0,
    "distinguished": null,
    "edited": 1623823581.0,
    "id": "o0y1l2",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_o0y1l2",
    "num_comments": 28,
    "permalink": "/r/Superstonk/comments/o0y1l2/waited_half_my_life_for_you_guys/",
    "score": 516,
    "selftext": "I'm a nobody. I chose to be a nobody. And I am glad to see so many fellow Apes and Ants and Europoors and others who chose to not take the blood money.\n\nPer u/Criand 's recommendation I am watching 'Inside Job', and it takes me back to a previous life. I come from a rags to riches back to rags family, my parents made some good money by luckily having a deli on Pearl Street back in the 1980's. But later they would lose it all and then some.\n\nOne of my earliest memories watching cable news was of 1987's Black Friday unfold. Later on I was only a kid watching the S&L crisis and Mexican crisis on television in the mid-90's. By high-school I watched my family lose even more in the IMF Crisis in Korea, (we had moved back then), and also watched unfold Longterm Capital Management and the Russian Crisis happen.\n\nI studied hard, had a good story, and got into Harvard and studied Economics to figure out WTAF happened. I didn't get good answers, but I did have Larry Summers in my senior year teach Labor Economics, and somewhere along the line I lost the dollar bill he signed. Also 9/11 and the DotCom crash happened during these years.\n\nSo interned at JPMorgan's FIG (Financial Institutions and Govt) investment banking group, but hated it. So when I started the year afterwards, I found a relatively unknown group called Credit Portfolio Research. We were on the public side of the Chinese Wall, there to make the SEC regulators happy that JPMorgan was trading its CDS books with publicly available information only. We were a cost-center. I cannot comment as to how JPMorgan actually traded its book as I wasn't privy to that, I think it was one of the largest books on Wall Street.\n\nAnyway personality wise I didn't fit Wall Street. The money was tempting, I was smart enough and hard working enough to keep going, but I left. Partly because I had gone down the rabbit hole of Austrian Economics and websites like themessthatgreenspanmade. I just hated the fact that all these Excel models and PowerPoint presentations meant jack.\n\nIn 2005 I sent mass emails to friends and family warning of a housing crash. I wasn't even close to the creation of these MBS CDOs, but there was enough information out there for me to realize something was wrong, and some of these internet Cassandras back in the day were speaking the truth. But people didn't listen then as they don't listen now, and they look at you as if you're crazy if you send these mass emails. I don't send out mass emails anymore.\n\nI had always thought of being a medical doctor, but the long path and watching mom die of cancer in high-school always made me hesitant. Also I didn't want to be part of a beauracracy. I passed the written test for the US State Dept, but skipped out on the interview. I didn't want to get a history PhD and work at a university. I didn't want to work at a hospital either. So I chose dentistry, and I enjoy the craft and autonomy.\n\nBy the 2nd year of dental school in 2008, I watched relatively insulated as the Great Recession hit. I am very sorry the younger Apes had to go through what I did a decade prior, watching parents lose everything, eviction, etc.. I am sorry there wasn't much for me to do back then either. I feared a crisis coming, and was on a multi-year plan to switch career paths to get away from what I thought was going to be a bigger crash in 2008.\n\nI graduated dental school, and watched the EuroCrisis happen on the news, with Greece, etc.. But somehow the banks and govts patched things together. And somehow the can kept getting kicked down the road, and I kept getting older. I had to live my life, had to start investing my savings, stop being so cautious waiting for the next shoe to drop. After all listening to ZeroHedge and Peter Schiff wasn't making me any money.\n\nThen I came across WSBs, and it was a fun time. Watching irrationality beat the HFT algorithms was a laugh. Then the pandemic happened, money printer go brrrr, investments did well, and then DFV and GME happened, now I'm at SuperStonk. And so here we are.\n\nI am a nobody. I have tried to build up my own savings to invest to grow and become rich. It takes along time when you start with nothing. Watching my parents lose money at the hands of others, I refused to stay in WallStreet and be a part of the leverage buyout and destruction worshipping culture, that they dubbed a necessary good. That stupid \"Greed is Good\" mantra. \n\nIf you read this far, thanks. I'm a nobody who got a front row seat in watching these external events shape my life. I still hope to become stupid rich, and it will be without blood on my hands. I won't steal from a father or mother, who has kids that depend on them.\n\nEdit- Fixed some autocorrects",
    "title": "Waited half my life for you guys",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/o0y1l2/waited_half_my_life_for_you_guys/"
}