{
    "author": "gfountyyc",
    "created_utc": 1628102324.0,
    "distinguished": null,
    "edited": 1628167086.0,
    "id": "oxz8kg",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oxz8kg",
    "num_comments": 1105,
    "permalink": "/r/Superstonk/comments/oxz8kg/bank_of_america_is_short_gme_and_is_positioned/",
    "score": 15737,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/y2z6f02p0df71.jpg?width=1024&format=pjpg&auto=webp&s=f2b789b14af01d3f751becbfbcfc1d13728ada54\n\nHello again my ape friends. So wow, did not expect yesterday's post to get as much attention. I apologize for the reposting as the original argument was debunked. I have added some facts, some new relevant information and what I originally posted for transparency, I want to remind everyone it is important to continuously fact-check each other to make sure our information is accurate to maintain the credibility of this subreddit! Not financial advice, and I am not a financial advisor.\n\n**Thesis**: **~~Bank of America (BAC) has begun their resolution plan for if they require bankruptcy~~**  **Bank of America is short GME and is positioned for if they need to proceed with a bankruptcy resolution; being a shareholder of BAC during such an event would cause larger than normal losses.**\n\n**What we already know:**\n\n1. **BofA is the Prime Broker for the hedge funds with the worst positions and will be responsible for closing said positions if they cannot close** (96% of clearing for Citadel, and 1 of 2 PB for Susquehanna)\n2. **BofA has/had a significant Put position to potentially reset FTDs** (17 Million via Fintel)\n3. **No Bank or Hedgefund has/had more GME containing ETFs than BofA**. (70+ Million shares, These can be used for shorting)\n4. **BofA's head of client equity solutions left to join Citadel after the Jan squeeze**.\n5. **\\~20% of BofA's locations have not reopened since last March**\n6. **BofA issued a $15 billion dollar bond in April to raise cash**\n\n**What is new:**\n\nhttps://preview.redd.it/zyimovemicf71.png?width=521&format=png&auto=webp&s=fe6eedb11df323c789e452cb1b7034a471bcbf70\n\nOn August 2nd, BofA released [this prospectus](https://investor.bankofamerica.com/regulatory-and-other-filings/all-sec-filings/content/0001193125-21-232682/0001193125-21-232682.pdf). Under this submission with the SEC, they have the right to raise up to $123 Billion dollars worth of debt, warrants, contracts, and different stock. If you think that this is a big number it's because it is. (Their market cap is currently 320 Billion, 38% of their value)\n\nNow the timing of this is not by accident. On July 1st over 300 changes were implemented to the Title 12 US Code on Banking including the Net Stable Funding Ratio (NSFR). The rule is intended to support lending to households & businesses during normal and adverse economic conditions. It is also complementary to the LCR (Liquidity Coverage Ratio) rules, which focus on short-term liquidity risks. On July 16th, each member of the FDIC was required to open their books and submit a filing of their NSFR on their liquidity, if they are short on the regulatory guidelines, and a plan of action to rectify any such shortcoming.\n\n>§249.110   NSFR shortfall: Supervisory framework.  \n>  \n>(a) *Notification requirements.* A Board-regulated institution must notify the Board no later than 10 business days, or such other period as the Board may otherwise require by written notice, following the date that any event has occurred that would cause or has caused the Board-regulated institution's net stable funding ratio to be less than 1.0 as required under §249.100.  \n>  \n>(b) *Liquidity Plan.* (1) A Board-regulated institution must within 10 business days, or such other period as the Board may otherwise require by written notice, provide to the Board a plan for achieving a net stable funding ratio equal to or greater than 1.0 as required under §249.100 if:  \n>  \n>(i) The Board-regulated institution has or should have provided notice, pursuant to §249.110(a), that the Board-regulated institution's net stable funding ratio is, or will become, less than 1.0 as required under §249.100;  \n>  \n>(ii) The Board-regulated institution's reports or disclosures to the Board indicate that the Board-regulated institution's net stable funding ratio is less than 1.0 as required under §249.100; or  \n>  \n>(iii) The Board notifies the Board-regulated institution in writing that a plan is required and provides a reason for requiring such a plan.  \n>  \n>(2) The plan must include, as applicable:  \n>  \n>(i) An assessment of the Board-regulated institution's liquidity profile;  \n>  \n>(ii) The actions the Board-regulated institution has taken and will take to achieve a net stable funding ratio equal to or greater than 1.0 as required under §249.100, including:  \n>  \n>(A) A plan for adjusting the Board-regulated institution's liquidity profile;  \n>  \n>(B) A plan for remediating any operational or management issues that contributed to noncompliance with subpart K of this part; and  \n>  \n>(iii) An estimated time frame for achieving full compliance with §249.100.  \n>  \n>(3) The Board-regulated institution must report to the Board at least monthly, or such other frequency as required by the Board, on progress to achieve full compliance with §249.100.  \n>  \n>(c) *Supervisory and enforcement actions.* The Board may, at its discretion, take additional supervisory or enforcement actions to address noncompliance with the minimum net stable funding ratio and other requirements of subparts K through N of this part (see also §249.2(c)).\n\nNow banks don't behave like this for no reason, and it was very eerie the lack of any coverage of something of this magnitude (anyone remember the negative coverage that GME & the theater company got when they raised cash). I believe Bank of America stating it wishes to raise $123 Billion isn't something it wants to do. More likely than not they are being forced to raise that amount to adhere to compliance with these new rules and to maintain enough liquidity for short-term risk.\n\n&#x200B;\n\n**Evidence from their last Q-10** \n\n[page 51 of 10-Q released July 30th](https://preview.redd.it/s30s5ko77df71.png?width=1151&format=png&auto=webp&s=4aa9c09f13eca9cc5f71848c72a95d1be01bc950)\n\nIn their latest [quarterly report](https://investor.bankofamerica.com/regulatory-and-other-filings/quarterly-reports/content/0000070858-21-000084/0000070858-21-000084.pdf), the net change in their trading and derivative assets/liabilities shows that in the first 6 months of 2021 that they are a net loss of over $58 Billion in cash compared to the prior year. This may not be all due to meme stocks but given the other evidence, I believe there is a significant portion.\n\n**(EDIT thanks** [**u/dg\\_713**](https://www.reddit.com/u/dg_713/)**) It would appear that I have an error in my accounting! So just because its a large negative # does not technically mean it is a loss due to indirect accounting. You can see his counter DD in the link below. I'll be the first to admit accounting isn't in my wheelhouse!**\n\n[**https://www.reddit.com/r/Superstonk/comments/oycn59/re\\_bank\\_of\\_americas\\_potenial\\_bankruptcy\\_the\\_58/**](https://www.reddit.com/r/Superstonk/comments/oycn59/re_bank_of_americas_potenial_bankruptcy_the_58/)**)**\n\n&#x200B;\n\n[page 81 of 10-Q released July 30th](https://preview.redd.it/n7li2dcvadf71.png?width=1123&format=png&auto=webp&s=83173032aafd91ca48b1c6c8b998e13f990b3c45)\n\nAs you can see in their securities sold under agreement to repurchase that the amount of securities that were sold and have not been purchased back greater than 90 days has ballooned over last year (almost doubled). One could argue that these might be the \"Meme stocks\" that have grown significantly in value, to which BofA has been sitting on these paper losses. This would also line up with our timeline of Q1 shorting. Currently, over $44 billion in shares need to be repurchased to which are older than 90 days.\n\n&#x200B;\n\n**My debunked argument from yesterday post for transparency** (still has valuable information)\n\nAccording to the Federal Deposit Insurance Corporation (FDIC) regulations are in place globally that require large financial institutions or their regulators to develop resolution plans, also known as “living wills.” In the U.S., these plans are required by Title I of the Dodd-Frank Wall Street Reform and Consumer Protection Act and are intended to reduce the economic impacts of a large financial institution’s failure on the economy and avert widespread destabilization of the global financial system. As part of their risk management, the FDIC requires each bank to maintain contingency plans describing resolution strategy under the U.S. Bankruptcy Code in the event of material financial distress or failure. (Link below is BAC's plan)\n\n[https://www.fdic.gov/regulations/reform/resplans/plans/boa-165-2107.pdf](https://www.fdic.gov/regulations/reform/resplans/plans/boa-165-2107.pdf)\n\n**Bank of America's FDIC Bankruptcy Contingency Plan**\n\nAs per their contingency plans, their filings states that as part of their strategy they are to consolidate their subsidiaries under a single umbrella outside of the Bank of America parent. Under this procedure, it is possible to file for bankruptcy for just Bank of America (BAC) rather than each branch of their business.\n\nhttps://preview.redd.it/sq0ocxcsgcf71.png?width=840&format=png&auto=webp&s=2e81d6cde63aa64123b508d99ba7bfa8f4307df7\n\nUnder their contingency guidelines, the organization would create a new \"point of entry\" called \"NewCo\" which would support their subsidiaries, while the parent BAC undergoes bankruptcy proceedings.\n\nhttps://preview.redd.it/p3dbyvbvgcf71.png?width=825&format=png&auto=webp&s=257b1c74057a91cb26ccbaaed9af908020af856d\n\nUnder this structure, BAC would send its Cash and Assets to a new holding company (above titled NB holdings).\n\n**The Smoking Gun/New Evidence (Debunked) (Edit for clarity:** This was the portion that was debunked. Originally I thought this was the first prospectus to mention they have entered into the holding agreement. As it turns out its been in a few now\\*\\*)\\*\\*\n\nNow what I found in the prospectus that was filed yesterday... (link below)\n\n[https://investor.bankofamerica.com/regulatory-and-other-filings/all-sec-filings/content/0001193125-21-232682/0001193125-21-232682.pdf](https://investor.bankofamerica.com/regulatory-and-other-filings/all-sec-filings/content/0001193125-21-232682/0001193125-21-232682.pdf)\n\n&#x200B;\n\n[Now I originally posted this earlier believing that this was new verbiage but I was debunked. The verbiage that they have entered an agreement with a separate holding company has been on their prospectus's for a while now. ](https://preview.redd.it/7cmui3vrudf71.png?width=1018&format=png&auto=webp&s=a9f1633111275d41cdf54440076e392878893641)\n\nWhat we can take away is they are already structured according to their contingency plan for if they need to resolve a bankruptcy to their parent company. What we also learned is that if you are a shareholder of BofA their current plan would have you taking significantly larger losses than if they did a traditional bankruptcy.\n\n**Conclusion:**\n\n* In BofA's bankruptcy plan it states that prior to engaging in bankruptcy that they would transfer their assets, and cash into a new holdings company as per its contingency plan. As per their outline, they have already moved to the planned holdings company.\n* BofA may have been forced by regulators to significantly increase their liquidity as part of their short-term risk mitigation.\n* BofA has shown that it is sitting on a debt of $44 Billion of securities that are older than 90 days. This timeline fits with the price action of GME and other meme stocks in quarter 1.\n* In the event of a financial crisis, their current resolution plan states that holding BAC stock may result in more damages to the shareholder than if they did a traditional bankruptcy.\n\n&#x200B;\n\nAs I stated before I reserve the right to be wrong, and just wish to constructively contribute to this community.\n\nCheers!\n\n&#x200B;\n\n&#x200B;\n\n**Additional info/prior DDs:** If you would like I have been on the Bank of America train for several months now for their role in the Gamestop Saga. If you would like to check out my previous DD's that go over that connection please check out.\n\n[The Complete Bank of America Gamestop DD](https://www.reddit.com/r/Superstonk/comments/nsioql/the_complete_bank_of_america_gamestop_dd/)\n\nand\n\n[The Bank of America and Gamestop DD update. Swimming in Puts, ETFs, and the new NSFR rules](https://www.reddit.com/r/Superstonk/comments/onrzz9/the_bank_of_america_and_gamestop_dd_update/)",
    "title": "Bank of America Is Short GME And Is Positioned For A Potential Bankruptcy (semi debunked post from last night)",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oxz8kg/bank_of_america_is_short_gme_and_is_positioned/"
}