{
    "author": "mattro380",
    "created_utc": 1628135359.0,
    "distinguished": null,
    "edited": 1628137498.0,
    "id": "oy9ilv",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oy9ilv",
    "num_comments": 84,
    "permalink": "/r/Superstonk/comments/oy9ilv/gme_and_the_nft_that_could_rock_the_boat/",
    "score": 942,
    "selftext": "Hello. This is my first Possible DD into how an NFT being launched after the London Hark Fork on August 5th is the play GME HOLDers have been waiting for. \n\nBut I really wanted a more in depth of how an NFT works and how it could be used with GME. \n\nFull disclosure, smooth brain with both limited experience in investing and crypto (I'm already seeing your eye rolling, and I accept that)\n\nSo please, point out anything and everything I may get wrong. \n\nSo, lets begin. We all know the story, GME... shorted to all hell, via SHF with seemingly unlimited resources and lack of a soul and common decency. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWhat do you do when you want to get rid of shorts? Offer a dividend. RKT did it, more importantly Overstock did it, but with a twist, they offered crypto, which initially worked but the DTCC found a loop hole. \n\nNow this post from [u/ravenouskit](https://www.reddit.com/user/ravenouskit/)  [What Happens if GameStop issues an NFT dividend?](https://www.reddit.com/r/Superstonk/comments/opdh2k/lets_try_again_shall_we_see_if_mods_want_to/) now this post cites u/tatonkamen156 breaksdown what would possibly happen. \n\nI want to go over, how the NFT may be used in the manner u/tatonkamen156 states. \n\nSo, N-F-T, NON-FUNGIBLE TOKENS, long story short NFTs are tokens that are unique and cannot be replicated. We've seen it used in art, but it as applications that extend to gaming and DEFI. \n\nFinematics on YouTube has a great, and short explainer on this [What are NFTs all about](https://www.youtube.com/watch?v=Xdkkux6OxfM)\n\nBut in essence NFTs can be used to link say... a piece of digital art, music, within games (we'll get back into that one) and also securities (stonks).\n\nBasically you attach an NFT to say a stock, that stock is now unique as a result of that NFT. It cannot be copied, split, or just made out of thin air (synthetics).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nHow would you do this? Via a dividend, now dividends can be cash, stock, property, scrip, or liquidating.\n\nWe're going to focus on PROPERTY.  ERC721 (NFT standard for unique tokens on Ethereum) and related standards enables frictionless, secure trading of digital assets to occur anywhere in the world. \n\n[https://www.forbes.com/sites/nataliakarayaneva/2021/04/08/nfts-work-for-digital-art-they-also-work-perfectly-for-real-estate/?sh=4f0f4fa443f3](https://www.forbes.com/sites/nataliakarayaneva/2021/04/08/nfts-work-for-digital-art-they-also-work-perfectly-for-real-estate/?sh=4f0f4fa443f3) \n\nA Physical Asset NFT is **a unique digital token** that denotes the right to take physical custody of an object, or in this case, a security.. like a physical share of a stock. Or in this case, PROPERTY. \n\nHow this related to GME? Well, say you have all of your authorized shares floating around AND hundreds of millions of synthetics, you attach a unique Physical Asset NFT to each stock in the form of a dividend. This will force the SHF to account for ALL their synthetics shorts and close. \n\nHow does this affect GME? As u/tatonkamen156 pointed out, a unique physical asset to a stock has no way to be naked shorted. As SHF cannot create their own NFTs to attach to their synthetics shares. Like how they circumvented Overstock crypto dividend by giving cash.  \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEtherscan shows that a single transaction was made 71 days ago (Tuesday March 25th) so this goes to show that GME's plan has been going on for some time. \n\n[https://etherscan.io/tx/0x89df343d7e245d42a09de2c790c8c471a0956f32b55631a53a15268c56a74c2d](https://etherscan.io/tx/0x89df343d7e245d42a09de2c790c8c471a0956f32b55631a53a15268c56a74c2d)\n\nThen we have the release of [https://nft.gamestop.com/](https://nft.gamestop.com/)\n\nWhile vague, it alludes to the power of gamers, creators, and collectors. We have seen what NFT can do for digital art and games, i.e. see the Finematics [What are NFTs all about](https://www.youtube.com/watch?v=Xdkkux6OxfM) to the end to see how many ways NFTs can be used, especially in e-commerce and gaming, which just HAPPENS to be right up GameStops Rally \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nBut the real stake (theory) here is assigning a NFT as a dividend to each GME stock. All of which can be verified by the ether block chain. So if there is a float of 55mil shares, then those 55mil share can be identified via the NFT and on the Ether block chain. \n\nAlmost defeats to the point of the newly implemented: CATS\n\nConsolidated Audit Trail\n\n[https://www.catnmsplan.com/](https://www.catnmsplan.com/)\n\n\"The Consolidated Audit Trail tracks orders throughout their life cycle and identifies the broker-dealers handling them, thus allowing regulators to efficiently track activity in Eligible Securities throughout the U.S. markets.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n[https://etherscan.io/token/0x13374200c29c757fdcc72f15da98fb94f286d71e](https://etherscan.io/token/0x13374200c29c757fdcc72f15da98fb94f286d71e)\n\nHere you can see a \"Max Total Supply\" (could mean the number of NFTs to equate to number of float? who knows, smooth brain over here) \n\nWith the upcoming London Hard Fork (Ethereum upgrade), the fact that the GameStop NFT team has been at work on this for a majority of the year, the upcoming London Hard Fork set for tomorrow before market open, which will update Ether to the new standard and protocols. \n\nSeems like a prime opportunity to announce NFTs for GME. NFTs for stocks, NFTs used in games, NFTs to be used in digital collectables. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI will leave this Tweet from [@EthereumMemes](https://twitter.com/EthereumMemes/status/1422264182976696323?s=20)\n\n[GME + NFT Dividend + Blockchain](https://preview.redd.it/guh6k0vmngf71.jpg?width=640&format=pjpg&auto=webp&s=9a564a4e6a4b50861350a362b191e1cafcb3753c)\n\nTL;DR NFTs can be used as a dividend (classified as property/asset, not a security). Attaching this NFT to each of the issued shares by GameStop would clearly identify which shares are legit and which shares are synthetic as FUCK and have to be closed. So MOASS.\n\nEdit: just my smooth brain opinion on the subject",
    "title": "GME and the NFT that could rock the boat",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oy9ilv/gme_and_the_nft_that_could_rock_the_boat/"
}