{
    "author": "Sh0w3n",
    "created_utc": 1622042603.0,
    "distinguished": null,
    "edited": 1622043369.0,
    "id": "nljmgp",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nljmgp",
    "num_comments": 111,
    "permalink": "/r/Superstonk/comments/nljmgp/hello_the_big_short_hello_michael_burry_over_21/",
    "score": 1088,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/myqj5zm8hh171.png?width=1214&format=png&auto=webp&s=31e612335e5ea21fd67cb711fb922a87e823e326\n\n**In the** [hearing that is going on right now with all of the CEOs](https://www.banking.senate.gov/hearings/annual-oversight-of-wall-street-firms)**of the major banks, it was pointed out that over 2.1 million mortgages are seriously delinquent, meaning they are behind more than 90 days.**\n\n[To compare this to 2008](https://www.federalreserve.gov/pubs/feds/2008/200859/200859pap.pdf):\n\n>The mortgage market began suffering serious problems in mid-2005. According to data from the Mortgage Bankers Association, the share of mortgage loans that were “seriously delinquent” (90 days or more past due or in the process of foreclosure) averaged 1.7 percent from 1979 to 2006, with a low of about 0.7 percent (in 1979) and a high of about 2.4 percent (in 2002). **But by the second quarter of 2008, the share of seriously delinquent mortgages had surged to 4.5 percent. These delinquencies foreshadowed a sharp rise in foreclosures: roughly 1.2 million foreclosures were started in the first half of 2008, an increase of 79 percent from the 650,000 in the first half of 2007** (Federal Reserve estimates based on data from the Mortgage Bankers Association). No precise national data exist on what share of foreclosures that start are actually completed, but anecdotal evidence suggests that historically the proportion has been somewhat less than half.\n\nLook at the numbers. We are fucked.\n\nHopefully someone can get a screen cap of the statement. It was one of the first 3 senators who pointed this out.\n\nMy personal opinion: is goes hand in hand with the growing numbers in reverse repos. The banks need collateral since the mortgages are about to go belly up, hence being worthless.\n\nMore than 8.2 million homeowners are behind: [https://www.usda.gov/media/press-releases/2021/02/16/biden-administration-announces-another-foreclosure-moratorium-and](https://www.usda.gov/media/press-releases/2021/02/16/biden-administration-announces-another-foreclosure-moratorium-and)\n\n 2.1 of them behind more than 90 days.\n\n**TLDR: 2008 reloaded. The housing market is about to blow up.**",
    "title": "Hello The Big Short, Hello Michael Burry: Over 2.1 million mortgages are ''seriously delinquent'' ( > 90 days) - Foreclosure Moratorium and Mortgage Forbearance Deadline ends June 30 - BOOM",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nljmgp/hello_the_big_short_hello_michael_burry_over_21/"
}