{
    "author": "His_story_teacher",
    "created_utc": 1628451025.0,
    "distinguished": null,
    "edited": false,
    "id": "p0l6zk",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_p0l6zk",
    "num_comments": 84,
    "permalink": "/r/Superstonk/comments/p0l6zk/i_read_an_article_about_how_the_gme_moass_is_a/",
    "score": 712,
    "selftext": "I read this article on yahoo finance that is encouraging the readers to sell due to the conspiracy theory's behind the future of GME. The author points them as farfetched but the DD provided by this sub have made me a sure investor in GME.   [https://finance.yahoo.com/news/gamestop-investors-lives-much-easier-195026616.html](https://finance.yahoo.com/news/gamestop-investors-lives-much-easier-195026616.html)\n\nIt all read like straight FUD towards the shareholders, but one part of the article stood up to me.  When the \"journalist\" disclosed that he or others in the field of journalism like himself have ever never taken money from hedge funds.  I did a simple search of hedge funds and newspapers and found this article about hedge funds buying up newspapers and how it hurts the communities. [https://prospect.org/economy/why-hedge-funds-shouldnt-own-the-news/](https://prospect.org/economy/why-hedge-funds-shouldnt-own-the-news/)\n\nThe first article pissed me off due to the objective being sell GME and buy blue chip like the hedge funds. The second one gave me more confirmation on the market irregularities.  Most of us on this sub known that they have been going on for some time but now more people are understanding it, not rationalize it as a conspiracy theory.  \n\nThey can invest in FUD, I will invest in the one and only superstonk, GME.  Hold and buy if you can, not financial advice.",
    "title": "I read an article about how the GME MOASS is a conspiracy theory, so I did so digging.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/p0l6zk/i_read_an_article_about_how_the_gme_moass_is_a/"
}