{
    "author": "JessasaurusJames",
    "created_utc": 1623120018.0,
    "distinguished": null,
    "edited": 1623200870.0,
    "id": "nuud15",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nuud15",
    "num_comments": 181,
    "permalink": "/r/Superstonk/comments/nuud15/gods_of_the_sun_part_12_manipulating_the_meme/",
    "score": 848,
    "selftext": "[GOTS, part 1.1](https://www.reddit.com/r/Superstonk/comments/nud0so/gods_of_the_sun_part_11_manipulating_the_meme/?utm_source=share&utm_medium=web2x&context=3)\n\nGOTS, part 1.2\n\n[GOTS, part 1.3](https://www.reddit.com/r/Superstonk/comments/nv333e/gods_of_the_sun_part_13_manipulating_the_meme/?utm_medium=android_app&utm_source=share)\n\nHey apes.\n\ntldr: part 1.1 of this series introduced the market media manipulation of the meme stock narrative to paint retail investors and GameStop in a negative light, the possibility that RC's Sears tweet points directly at predatory vulture funds, and a big finance play to coordinate a massive meme stock pump and dump that crushes retail and gives the SEC an excuse to regulate Wall Street's retail investment competition, a scheme that centers around AMC and it's CEO, Adam Aron.  Part 1.2 dives deeper into vulture funds and specifically focuses on **Apollo Global Management, a vulture fund founded by Leon Black, the Apollo founding CEO who stepped down as CEO and from the board for paying Jeffrey Epstein $158 million dollars.** Why is that relevant to our favorite stock? Apollo Global tried to orchestrate a leveraged buyout of GameStop in 2019. It also attempted a leveraged buyout of AMC in December 2020. **And Adam Aron? He's been with Leon Black and Apollo for 30 years and was an Apollo Global vulture fund Senior Partner when Apollo sold AMC to Chinese vulture fund, Wanda Group.**\n\n**This post also sets the stage for an exploration of why a company's senior note debt is as important to future company projections as its ability to control the dilution of its shares when attempting to maintain shareholder value. This discussion aims to shed light on the importance of RC paying off GameStop's outstanding senior note debt,** though market media has attempted to thoroughly obscure how important that event was in the meme stock narrative, and why.\n\nAnd thanks to everyone who took the time to read GOTS 1.1 and leave comments and point deeper down rabbit trails. Please continue. Apes together strong.\n\nLet's go. \n\n**ENTER APOLLO GLOBAL MANAGEMENT**\n\nApollo Global Management is a predatory vulture fund that has a long history with AMC. Here's an article that paints a clear picture of [Apollo entering the AMC bankruptcy sweepstakes written by Mark Hake for investorplace.com](https://investorplace.com/2021/01/cash-infusion-amc-stock-fighting-chance/) before price action in January; here’s a big chunk of Hake’s article:\n\n>One more piece of news to factor in is that The Wall Street Journal reported on Jan. 6 that **AMC was trying to leverage the assets of its U.K. Odeon cinema group.** The article said AMC was seeking 300 million GBP (about $408 million before expenses) in **new credit facilities from Apollo Global Management** (NYSE:APO).\n\n>**Typically in these kinds of deals, the private equity funds providing the capital have horrendous fees, large amounts of warrants and odious covenants, collateral, hurdles and maintenance ratios.** On top of that **AMC will have to prove to its investment committee they can produce enough cash flow to cover their interest charges and stay out of bankruptcy. In fact, I have seen situations where the hedge fund / private equity fund provided the debt capital to a struggling but valuable company even when it knew the company couldn’t handle the debt. It fully expected bankruptcy.**\n\n>But **being the most recent capital provider it can supersede other debt investors.** It can obtain the rights to the collateral. **Either that or it knew it would have a controlling stake in the company simply from a large amount of debt provided.**\n\n>**I can envision a situation like this where Apollo Capital wants to be the biggest stick at the bankruptcy table. To get there, it has to provide the most recent pre-bankruptcy capital.**\n\nIn other words, Apollo Global Management would like to saddle AMC with debt that gets portrayed as capital in order to take profit from the company going bankrupt, which is still expected, the epitome of the parasitic corporate raider ethos. Only this time they’re able to milk retail investors they can rug pull at any time with share dilution they portray positively in the media. Again, encumber the company, distress the company into a survival struggle or capitalize on a naturally occurring survival struggle, pump the price as high as you can, take as much money as you can, let the bear raiders circle, then crush the price into the profit windows of the short hedges while you bankrupt the company. Easy. \n\nTo reiterate the points above, Apollo Global [tried to buy AMC in December 2020 through a leveraged buyout](https://nypost.com/2020/12/11/apollo-circling-amc-as-chain-scrambles-to-stay-afloat-sources/); from the article:\n\n>AMC Entertainment is being circled by a trio of investment firms including Apollo Global Management as the movie-theater chain scrambles to stay afloat amid the pandemic, The Post has learned.\n\n>**Apollo, which along with Canyon Capital Advisors and Davidson Kempner Capital Management are holders of AMC’s first-lien debt, are urging the company to file for Chapter 11 bankruptcy** and have offered $1 billion in debtor-in-possession financing, according to sources close to the situation.\n\nBeing circled by predatory vultures...\n\nApollo Global [also tried to perform a leveraged buyout of Gamestop in 2019](https://www.wsj.com/articles/gamestop-and-the-art-of-the-non-deal-11548779069); from the article:\n\n>GameStop said Tuesday that it has ended its efforts to find a buyer. In its filing, **the video game retail chain blamed the decision on “lack of available financing on terms that would be commercially acceptable to a prospective acquirer.”** The Wall Street Journal had previously reported the company was talking with private-equity firms Sycamore Partners and **Apollo Global Management LLC** about a potential deal.\n\n>Put another way: Financial backers weren’t exactly lining up to take on a retailer whose core business—selling new and used game disks—is slowly vanishing thanks to the rise of digital downloads. \n\nSomething fascinating to me has been looking at how the media drove sentiment about GameStop at this time when vulture funds were seeking to enter it into a bankruptcy path, a time we know also coincides with bear raiders like Melvin already shorting GameStop into the abyss. For instance, let's look at [the article titled “GameStop ends search for a buyer, shares plunge](https://www.wsj.com/articles/gamestop-ends-search-for-a-buyer-shares-plunge-11548771564?mod=searchresults&page=1&pos=1) again. Just focus on the title. What’s the connotation? GameStop needed a buyer and failing to find one caused a massive stock price fall. But what’s the reality? GameStop sidestepped a leveraged buyout with likely horrendous terms that would have massively hampered the company’s effort to move forward. How do we know that? GameStop’s statement also recorded in the article: \n\n>“GameStop’s Board has now terminated efforts to pursue a sale of the company due to the lack of available financing on terms that would be commercially acceptable to a prospective acquirer,” the company said.\n\nIn other words, GameStop avoided financing on terms acceptable to a vulture fund buyer, those terms realistically a guaranteed bankruptcy bid while predatory short hedges were already coordinating a GameStop bankruptcy yolo and hammering GameStop through their media channels. And how did GameStop avoid this fate? It’s also in the article. The sale of Spring Mobile. However, this cash influx gets framed as a company problem by referring the sudden cash influx back into the need for a buyer; to this aim, the author writes:\n\n>As part of its strategic review, GameStop reached a deal in November to sell its Spring Mobile business to Prime Communications LP. The sale of nearly 1,300 wireless phone stores closed earlier this month, netting GameStop roughly $735 million in cash.\n\n>The company said Tuesday it is still determining how best to use the proceeds, including reducing debt, buying back stock or reinvesting in the business.\n\n>**Without a sale, GameStop’s future remains uncertain** as its options range from becoming more active in esports, competitive video game contests, to focusing on how it can diversify revenue at its existing stores.\n\nHere’s [another article from this time period that really drives the point home that GameStop was on the brink of failure](https://www.wsj.com/articles/as-videogame-market-shifts-gamestop-struggles-to-boost-sales-11546561467?mod=article_inline), a definitive manipulation of investor sentiment. The article asserts:\n\n>“GameStop has become irrelevant in the video game market,” said Mike Hickey, an analyst at BenchMark, in a research note.\n\nAnd:\n\n>“Their strength is in their loyal customer,” Mr. Sebastian said. “They are in a challenging spot, but they have, for now, retained the vast majority of their customers. That window is not going to be open forever.”\n\nTo step into GameStop bullish mode for a moment, it sure seems like we’ve overcome the reasons to be a GameStop bear. I also hope it’s starting to work through you how coordinated the manipulation of the stock market has become because a few bad people developed a profit model that considers driving companies toward bankruptcy good risk management. Just remember this statement: *\"I can envision a situation like this where Apollo Capital wants to be the biggest stick at the bankruptcy table. To get there, it has to provide the most recent pre-bankruptcy capital.\"* I also hope you’re realizing that debt notes are important to a company’s future, just like the potential use of its shares to raise capital.\n\nAnd I said the “bad people” word… but surely Apollo Global aren’t bad people, right?\n\nWrong.\n\nBeets, bears, Battlestar Galactica. \n\nWe’re about to get really dirty together.\n\nSo [here’s RC dunk tweeting on Jim Cramer to get you through it](https://twitter.com/ryancohen/status/1336775515101949963?s=20).\n\nOr just [take in this beautiful shitpost by u/cui-ui](https://www.reddit.com/r/Superstonk/comments/nrkjle/rc_tweet_easter_egg/?utm_source=share&utm_medium=web2x&context=3) and buy more GameStop and hold it for your innocence every day and [ev](https://www.reddit.com/r/Superstonk/comments/na3akt/all_the_confirmation_bias_i_need_right_here_in/?utm_source=share&utm_medium=web2x&context=3)ery night if you like the stock. \n\nSorry apes. Sometimes shit gets dark.\n\n**LEON BLACK, JEFFERY EPSTEIN, AND ADAM ARON**\n\nLeon Black is the co-founder of Apollo Global Management. Just [listen to this horseshit on Bloomberg YouTube in a video titled “Why Leon Black is the Most Feared Man in Private Equity”](https://www.youtube.com/watch?v=E8lMILoFVYk) now that we know what a vulture fund is and how it functions. The reporters skirt the application of the word “ruthless” to Apollo and Leon, then refer to “the magic of Apollo” referencing an insurance scheme. Someone please look into the insurance scheme the reporters talk about that BlackStone and Carlyle Group are also hawking, keeping in mind that Carlyle Group is the vulture fund that spawned Jerome Powell for us. And [here’s the article about Leon Black from Bloomberg that led to the Bloomberg YouTube discussion titled “Nobody Makes Money Like Apollo’s Ruthless Founder, Leon Black”](https://www.bloomberg.com/news/features/2020-01-16/nobody-makes-money-like-apollo-s-ruthless-founder-leon-black).\n\nThe man is a financial predator and “predator” seems like a theme that runs through other facets of his life. For instance, Leon Black got removed as Apollo’s CEO in early 2021 for his deep ties to Jeffrey Epstein, though he still remained on the board until March; this [Financial Times article titled “Why Did Leon Black Pay $158m to Jeffery Epstein”](https://www.ft.com/content/23448802-3ee8-4c3c-bb46-fc02e304f3ed) gets right into it:\n\n>Mr Black is one of the most successful financiers of his generation, co-founder of Apollo Global Management, a group that ranks among the most powerful on Wall Street. Yet **the billionaire attributes a sizeable part of his family wealth to Epstein, estimating that as much as $2bn in benefits can be traced back to the late paedophile’s financial acumen.** By comparison, Forbes magazine estimated Mr Black was worth $7.7bn at the time of Epstein’s 2019 suicide. \n\n>On Monday, lawyers for Apollo pointed to that professional relationship to explain why its founder had paid $158m to Epstein over a five-year period ending in 2017 during which the disgraced businessman served as Mr Black’s high-priced adviser on issues ranging from audits by the tax authorities, management of his yacht and private plane and a dispute over the ownership of a sculpture by Pablo Picasso. \n\n>**Over two decades, Mr Black confided in Epstein regarding personal matters, leaned on him as an “architect” of, and “strict taskmaster” for, the private office that managed his investments. The men socialised or held meetings at Epstein’s Caribbean island** and his other properties in New York, Paris, Florida and New Mexico.\n\nHmm. They went to an island together. I wonder why? But then their relationship deteriorated. And how did it deteriorate? Here’s the characterization that sounds decidedly like being caught up in a honey trap:\n\n>As their relationship deteriorated, **Epstein was not above invoking his friendship with Black in an attempt to extract more money. According to the report by Apollo’s lawyers, he did so “by referencing personal matters that Black had shared with Epstein in confidence”.** Their report added: “There is no evidence that those matters had any relationship to any of Epstein’s criminal activity or to any of Black’s payments to Epstein.”\n\nBut surely I’m just drawing conclusions, right? Nothing to see here, right? It was just business, right?\n\nI don’t think so, and here’s why.\n\nAn interesting coincidence happened this week while AMC started to pump. What was it? Leon Black reentered the news cycle. Here’s [a Miami Herald investigation into allegations Leon Black sexually assaulted (I'm using that language because the other 'r' word is banned on posts) a woman and paid her hush money while trying to intimidate her into silence](https://www.miamiherald.com/news/business/article251827913.html) that got released [June 1st](https://twitter.com/TheRoaringKitty/status/1399727581369409539?s=20); here’s the intro to the article:\n\n>A New York woman has filed a defamation lawsuit against Leon Black, alleging that the hedge fund titan sexually assaulted, harassed and intimidated her, then paid her hundreds of thousands of dollars in hush money for more than a decade to keep her from going public.\n\n>Guzel Ganieva, a former model who went on to earn a business degree from Columbia and attended law school, **claims that Black, former CEO of Apollo Global Management, was a “predator” who “forced sadistic sexual acts on her without her consent,” then demanded she sign a non-disclosure agreement, telling her he would “destroy her” if she ever told anyone about his conduct,** according to the suit.\n\n>Black, 69, stepped down as Apollo’s chairman and CEO in January, amid revelations that he paid sex trafficker Jeffrey Epstein more than $150 million for financial advice.\n\nThat’s as much as I’ll quote from the Miami Herald article at this point. I encourage you to read the article though, but with a SERIOUS TRIGGER WARNING before you do. It gets pretty graphic with what Leon Black is accused of doing to Guzel. It also helps us pivot back into what it looks like when a media company tries to control a narrative. How? Because [Verizon just **sold their media business including Yahoo and AOL to Apollo Global** for $5 billion](https://www.cnbc.com/2021/05/03/verizon-sells-yahoo-and-aol-businesses-to-apollo-for-5-billion.html) as reported by the May 3rd article I linked, and we can check out the historical record of how Yahoo has covered Leon Black to see if there’s been a change of tone since the ownership transition.\n\nThe first indication of a FUD campaign on Yahoo is [this article titled “Woman accuses Leon Black of defamation, violent behavior”](https://www.cnbc.com/2021/05/03/verizon-sells-yahoo-and-aol-businesses-to-apollo-for-5-billion.html). To start, no. He’s accused of the 'r' ward and years of intimidation, and you can see the extra effort to steer around the ‘r’ word when the article author phrases an 'r' word allegation as “subjecting her to sexual violence.” And let’s just break down this Apollo media characterization of Guzel and Leon together:\n\n>The complaint said Black subjected Ganieva over several years to numerous instances of unwanted sexual conduct. It referred twice to his alleged \"sexual assaults and r-pes\" of her, and specifically described one alleged ['r' word] from 2014. \n\n>\"Ms. Ganieva's allegations of harassment and other inappropriate behavior are categorically untrue,\" a spokesman for Black said in a statement. \"Mr. Black emphatically denies each and every spurious allegation put forth in this lawsuit and looks forward to disproving them in court.\" \n\n>The spokesman also said Black made \"substantial monetary payments\" to Ganieva based on her threats to go public about their relationship. He did not specify a dollar amount. \n\n>Ganieva said in her complaint that she received unspecified \"regular payments\" from Black for 5-1/2 years after she signed a nondisclosure agreement in October 2015. \n\n>She said Black moved to silence her for his alleged misconduct by coercing her into signing the agreement, **in exchange for forgiving $960,000 of loans he had made and which she could not repay.**\n\nHow this reads to me is Leon used his leveraged buyout vulture capital experience to bend a victim to his will. Why? We know that Guzel is a “former model who went on to earn a business degree from Columbia and attended law school” from the Miami Herald article. However, this Yahoo article deliberately frames her as “a Russian native now in her late 30s” after contrasting Leon and Guzel’s perspectives of the allegations. What I detect is a subtle/not-so-subtle narrative building device that appeals to the idea that Leon is the victim getting coerced, the psychological hook being that mention of Guzel’s complaint (that has to be mentioned because it’s public) that includes “sexual assaults and r---s” is immediately followed by the suggestion statement that \"Ms. Ganieva's allegations of harassment and other inappropriate behavior are categorically untrue.” That hook is couched as a quote that also doubles as an appeal to authority. The appeal to authority functions through a subsequent reference to courtroom action to defend Leon Black from what’s presented to look like an extortion attempt. Again, it reads, “Mr. Black emphatically denies each and every spurious allegation put forth in this lawsuit and looks forward to disproving them in court.” But again, Guzel is characterized as just a Russian woman who is making untrue allegations to extort money rather than an immigrant lawyer who is making allegations that will be heard in court.\n\nReaching? No. How do you know? Here’s a *before Apollo purchased Verizon* and an *after Verizon purchased Verizon* comparison of Yahoo’s coverage of Black and Epstein to hammer the media FUD point home. In January, before the Apollo buyout, Yahoo reported Black’s Epstein relationship as follows:\n\n**Black provided support for Epstein’s lavish lifestyle over a five-year period that ended in 2017 — long after Epstein pleaded guilty in Florida to a prostitution charge involving a teenage girl**, the review found, according to The New York Times. That report noted that Black — who will step down by the end of July — viewed Epstein as a “confirmed bachelor with eclectic tastes.”\n\nHowever, in the article about Guzel’s allegation of r-pe and coercion after Apollo bought out Verizon, Yahoo characterizes Black’s Epstein relationship as follows:\n\n>Black, 69, stepped down this year as Apollo's chief executive and chairman, after an independent review conducted by the Dechert law firm said he had paid the disgraced financier Jeffrey Epstein $158 million for tax and estate planning. \n\n>The Dechert report found Black was not involved with Epstein's criminal activities. Black said at the time he deeply regretted his involvement with Epstein. \n\nDraw your own conclusions. Here’s a March news cycle [that characterizes the media probe into Black’s Epstein relationship as a ‘relentless’ difficulty](https://ca.style.yahoo.com/leon-black-leaves-apollo-executive-112205510.html) for the billionaire Apollo founder. And there’s a wrinkle that I hope blows your mind. This article [from the BCC in the ‘relentless’ March cycle talks about Black stepping down from the board of Apollo](https://www.bbc.com/news/business-56487833); first the characterization of Black’s plight for being scrutinized for paying over $150 million to a known pedophile who he spent time on islands with:\n\n>\"The last weeks and months have been deeply trying for me and my family,\" 69-year-old Mr Black wrote in [a letter to the Apollo board](https://www.sec.gov/Archives/edgar/data/0001411494/000119312521088432/d114836dex992.htm) explaining his plans to speed up his departure. \n\n>\"The relentless public attention and media scrutiny concerning my relationship with Jeffrey Epstein - even though the exhaustive Dechert Report concluded there was no evidence of wrongdoing on my part - have taken a toll on my health and have caused me to wish to take some time away from the public spotlight that comes with my daily involvement with this great public company.\"\n\nSecond, the BBC provides a mind blowing regulatory capture nugget. Who’s replacing Leon Black as Apollo Global’s executive chairman? This guy:\n\n>Mr Black said he also no longer planned to remain as executive chairman of the company's board. He will be replaced by **former SEC Commissioner Jay Clayton.**\n\nI actually just read that part myself. I’m having dark humor giggles while I write that feel pretty close to tears. An ex-SEC Commissioner became Apollo’s executive chairman because the founding CEO and executive chairman is a central figure in the Epstein scandal. \n\nSo let's just ask the real question: how does this all relate to [retail investor’s Silverback, Adam Aron, our AMC hero](https://nypost.com/2021/02/07/how-amc-staved-off-bankruptcy-before-reddit-rally/)? \n\n**Adam Aron is Leon Black’s protege.**\n\nWith a long history at Apollo Global.\n\nSeriously.\n\nHere’s a Forbes article from 1998 describing how Leon Black and Adam Aron [destroyed small business culture in Vail, Colorado after performing a leveraged buyout of Vail Resorts and weaponizing it against the community](https://www.forbes.com/forbes/1998/1019/6209070a.html?sh=6e4a5c9d2a78). We’ll get into this article later in this series.\n\nThe point I’m getting at: Adam Aron’s history shows a decided disregard for apes.\n\nI’m actually angry watching these motherfuckers get predatory with our memes while attempting to set us up for a regulatory fucking with them.\n\nIt also makes me wonder [what Jeffrey DFV was referring to with this tweet](https://twitter.com/TheRoaringKitty/status/1400522985375780872?s=20), especially considering [what a “Jeffrey” is](https://www.urbandictionary.com/define.php?term=the%20ingredients%20in%20a%20jeffrey) in Get Him to the Greek.\n\nThere’s also a curiosity in the data about Adam Aron and AMC. This [article titled “AMC’s stock price is detached from reality and its CEO loves it”](https://qz.com/2010310/amc-entertainments-stock-is-growing-again-thanks-to-reddit/) showed up in search engines as “AMC Entertainment’s stock is growing again thanks to Reddit” while hitting news tube websites with the on article title in the search engines. And what’s the curiosity? It could mean nothing, but it’s written by Adam Epstein. \n\nThe article brands Aron a “meme lord.” He’s not. But the article does show him co-opting memes. For instance, making the donation to a gorilla rescue, something Reddit pushed in February with GameStop; from Epstein’s article:\n\n>“Just go on Twitter, just go on Reddit, just go on YouTube, read what these people write. They love AMC… I love the idea that we have a compassionate, committed, enthusiastic shareholder base,” Aron added. Aron donated $50,000 to the Dian Fossey Gorilla Fund, a charity that protects endangered gorillas—a sum AMC matched, he said.\n\nBut is all this meme lording for the benefit of retail investors? After all, Adam Epstein writes:\n\n>Retail investors on Reddit continue to pump up the stock price of the movie theater chain, and now Aron is publicly declaring his allegiance to those millions of shareholders. “They own AMC,” Aron said on an earnings call last week. “We work for them. I work for them.”\n\nNo. I don’t think so. Why? Because debt equity and because the article concludes with an important piece of information; Epstein writes:\n\n>**The apes have helped — AMC’s surging stock price allowed Silver Lake Partners, a private equity firm to which AMC is indebted, to convert $700 million in corporate bonds into AMC stock.** But it’s unclear how much more they can materially impact AMC’s finances. The best way for the apes to support AMC and their “Silverback” leader might be to actually go see a movie in a theater.\n\nAnd who is this Silver Lake Partners that apes helped along with AMC?\n\nA vulture fund.\n\nHere’s [an article about Silver Lake raiding Expedia with Leon Black guided Apollo from July, 2020](https://skift.com/2020/07/07/expedia-to-deliver-early-payday-to-private-equity-investors/); from the article:\n\n>Private equity firms Apollo Global Management and Silver Lake Partners rode to Expedia Group’s liquidity rescue in April with a deal to provide $3.2 billion in financing. As its bookings rebounded somewhat, Expedia was looking Tuesday to pay off these firms early, and refinance the debt at a significantly lower interest rate.\n\nAnd:\n\n>If all the pieces fall into place — if Expedia finds takers for its senior notes — then it could pay off the private equity firms, and save a bundle in dividend payments. Apollo and Silver Lake would retain their Expedia warrants, which entitled them to each purchase 4.2 million shares of common stock at $72 per share. If the two companies exercised those warrants, their stakes wouldn’t result in any kind of game-changing ownership. Expedia shares Tuesday were trading mid-day at around $84.\n\nWow, eh?\n\nGet your popcorn, apes.\n\n*Part 1.3 dives into the difference in RC and Silverback's approach to company capital. We also take a look at a fascinating wrinkle in GameStop's senior note debt that RC settled. As well, we explore the difference in company outlooks because of the way Silverback is planning to utilize the capital raise from At the MC's share dilution that he promised retail investors he wouldn't go forward with.*\n\n[GOTS, part 1.1](https://www.reddit.com/r/Superstonk/comments/nud0so/gods_of_the_sun_part_11_manipulating_the_meme/?utm_source=share&utm_medium=web2x&context=3)\n\nGOTS, part 1.2\n\n[GOTS, part 1.3](https://www.reddit.com/r/Superstonk/comments/nv333e/gods_of_the_sun_part_13_manipulating_the_meme/?utm_medium=android_app&utm_source=share)",
    "title": "GODS OF THE SUN, part 1.2 - Manipulating the meme stock narrative, RC’s “Sears” tweet, Vulture Funds, Apollo Global Management, who Adam Aron really is, Epstein, Goldman Sachs, and the TOTAL ECLIPSE of the SUN. (Wow, eh?)",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nuud15/gods_of_the_sun_part_12_manipulating_the_meme/"
}