{
    "author": "ThatOneGuyOscar",
    "created_utc": 1621010293.0,
    "distinguished": null,
    "edited": false,
    "id": "nccwzr",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nccwzr",
    "num_comments": 97,
    "permalink": "/r/Superstonk/comments/nccwzr/be_careful_with_the_media_they_are_100_aware_we/",
    "score": 2369,
    "selftext": "TLDR: Fight your war and do not distract others from theirs. But remember our enemies enemies are our friends.\n\nFirst and foremost I need to reiterate I am balls deep in GME. 99% to 1% AMC\n\nSorry AMC peeps, even though I believe you guys will squeeze.\n\nThis is no longer about a squeeze and this whole subs knows it. GME has turned into a revolution.\n\nAlso this is all pure speculation based off the patterns I've seen over the past few months.\n\nThis by all mean should not be taken as financial advise. I just found out how to use the internet today. \n\nWith that aside\n\nThe media is trying to divide us. We don't trust the media for shit. When we see something that confirms our bias we get suspicious and they know this know. \n\nThe rich keep us divided thru the media. This is reverse psychology. By pushing us the AMC squeeze they want us to distrust them. They want people to paperhand out of AMC into GME and VICE VERSA.\n\nTHEY WANT TO CREATE FUTURE PAPERHANDS.\n\nIf you believe in AMC stick to AMC hold on to it do not paperhand even if the rocket takes off first\n\nIf you believe in GME stick to GME hold on to it do not paperhand even if the rocket takes off first\n\nI truly believe AMC will squeeze but it won't be as big and that is fine there is nothing wrong with that.\n\nGME is the revolution the MOASS and its what I believe in\n\nWhat ever you are in it for its up to you but stick to your beliefs. \n\nI will not paperhand out of GME into AMC.\n\nand AMC people shouldn't either. It defeats the whole purpose and you will ruin it for others. \n\nJust hold to your beliefs and the DD you've read. \n\nAlso I think its best we all stay in our own community\n\nGME is the r/Superstonk that is all you will find here\n\nAMC belongs in r/AMCSTOCKS\n\nBut we need to stop bashing each other. That is what they want.\n\nApe no fight ape\n\nApe no distract ape from their fight\n\nsorry about my grammar or mistakes",
    "title": "Be careful with the Media. They are 100% aware we don't trust them.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nccwzr/be_careful_with_the_media_they_are_100_aware_we/"
}