{
    "author": "Parsnip",
    "created_utc": 1624859701.0,
    "distinguished": null,
    "edited": 1624867202.0,
    "id": "o9e4b2",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o9e4b2",
    "num_comments": 519,
    "permalink": "/r/Superstonk/comments/o9e4b2/diamantenhände_german_market_is_open/",
    "score": 4523,
    "selftext": "Hello Great Apes of the world! 👋\n\nRaise your Diamantenhände to the sky as the markets awaken to GME in the Russell 1000! Numerous DD posts indicate that this could be a very interesting week in the markets, with a quarter end, record levels of reverse-repo participation, and the GME Prospectus hinting at several possible ways to ignite the MOASS. The German market opens 2 hours before the US pre-market; maybe we'll get a preview of things to come? Join apes around the world to watch low-frequency updates from a single German exchange as we prepare for the US pre-market to open!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟩 120 minutes in: **$207.51 / 173,85 €**\r\n- 🟩 115 minutes in: $207.03 / 173,45 €\r\n- 🟩 110 minutes in: $206.38 / 172,90 €\r\n- 🟥 105 minutes in: $206.29 / 172,82 €\r\n- 🟥 100 minutes in: $206.35 / 172,88 €\r\n- 🟥 95 minutes in: $206.79 / 173,25 €\r\n- 🟩 90 minutes in: $207.39 / 173,75 €\r\n- ⬜ 85 minutes in: $207.30 / 173,68 €\r\n- 🟩 80 minutes in: $207.30 / 173,68 €\r\n- 🟥 75 minutes in: $207.24 / 173,62 €\r\n- ⬜ 70 minutes in: $207.30 / 173,68 €\r\n- 🟥 65 minutes in: $207.30 / 173,68 €\r\n- ⬜ 60 minutes in: $207.48 / 173,82 €\r\n- 🟩 55 minutes in: $207.48 / 173,82 €\r\n- 🟥 50 minutes in: $207.36 / 173,72 €\r\n- ⬜ 45 minutes in: $207.42 / 173,78 €\r\n- 🟩 40 minutes in: $207.42 / 173,78 €\r\n- 🟩 35 minutes in: $207.39 / 173,75 €\r\n- 🟥 30 minutes in: $207.30 / 173,68 €\r\n- 🟥 25 minutes in: $207.36 / 173,72 €\r\n- ⬜ 20 minutes in: $207.90 / 174,18 €\r\n- 🟥 15 minutes in: $207.90 / 174,18 €\r\n- 🟥 10 minutes in: $208.05 / 174,30 €\r\n- 🟥 5 minutes in: $208.11 / 174,35 €\r\n- 🟩 0 minutes in: $211.84 / 177,47 €\r\n- 🟥 US close price: $209.51 / 175,53 €   *($208.00 / 174,26 € after-hours)*\r\n\n\n***\nFAQ: To generate this data, I'm capturing current prices in Euros at https://www.ls-tc.de/de/aktie/gamestop-aktie and converting to USD. Today's EUR -> USD conversion ratio is 1.19360942. I created a simple C# application that assists me in scraping this data and updates the post automatically.\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Over the weekend, DerGurkenraspler appears to have deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9e4b2/diamantenhände_german_market_is_open/"
}