{
    "author": "peruvian_bull",
    "created_utc": 1627147702.0,
    "distinguished": null,
    "edited": false,
    "id": "oqud1p",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_oqud1p",
    "num_comments": 56,
    "permalink": "/r/Superstonk/comments/oqud1p/reuters_yellen_warns_congress_of_unthinkable_us/",
    "score": 584,
    "selftext": "Link to article: [https://www.reuters.com/article/us-usa-treasury-yellen/yellen-warns-congress-of-unthinkable-u-s-default-risk-without-debt-limit-hike-idUSKCN2DZ2ET](https://www.reuters.com/article/us-usa-treasury-yellen/yellen-warns-congress-of-unthinkable-u-s-default-risk-without-debt-limit-hike-idUSKCN2DZ2ET)\n\n&#x200B;\n\nI have copied the text below if you don't want to give views to MSM sites:\n\n\\--------------------------------------------------------------------------------------------------------------------------------\n\nWASHINGTON  (Reuters) -U.S. Treasury Secretary Janet Yellen on Wednesday warned  Congress that the United States risks a debt default and a new financial  crisis as soon as the August recess if lawmakers fail to act quickly to  suspend or raise the federal borrowing limit.\n\n&#x200B;\n\n[Treasury Secretary Yellen](https://preview.redd.it/k8lkbvdu27d71.png?width=829&format=png&auto=webp&s=b74d1d4dcb1115d4144224eb2e551979d8f3ecc8)\n\n&#x200B;\n\nIn testimony to a Senate Appropriations subcommittee, Yellen said **defaulting on U.S.  debt obligations would be “unthinkable” and “would have absolutely  catastrophic economic consequences.”**\n\nYellen said that to avoid uncertainty for financial markets, Congress should  pass new debt limit legislation - allowing the Treasury to continue  borrowing - before the latest suspension expires on July 31.\n\n**An unprecedented default on U.S. government debt obligations “would  precipitate a financial crisis, it would threaten the jobs and savings  of Americans at a time when we’re still recovering from the COVID  pandemic,” Yellen said.**\n\n“I would plead with Congress to simply protect the full faith and credit  of the United States by acting to raise or suspend the debt limit as  soon as possible.”\n\nThe Treasury in the past has been able to stave off potential default for  several months by employing extraordinary cash-flow management measures  such as suspending contributions to government employee pension funds.\n\n&#x200B;\n\nAsked how long these measures could last to allow the government to continue  borrowing, Yellen said it was difficult to estimate that because  spending on COVID-19 relief programs has added more uncertainty to  Treasury’s payment flows.\n\n**“We  can’t tolerate any chance of defaulting on the government debt, and  there is a lot of uncertainty. It’s possible that we could reach that  point while Congress is out in August, and I would really urge prompt  action on raising the limit or suspending it,” Yellen said.**\n\nAccording  to Senate and House of Representatives legislative calendars, the  August recess will run from Aug. 9 to Sept. 10 in the Senate [here](https://www.senate.gov/legislative/2021_schedule.htm) and July 30 to Sept. 19 in the House [here](https://www.majorityleader.gov/sites/democraticwhip.house.gov/files/2021CALENDAR-REVISED2.pdf), with committee work scheduled on several days in early September.\n\nIf  the debt limit prevents Treasury from new borrowing, the government  would have to rely only tax receipts to pay obligations, eventually  making it impossible to make some debt repayments.\n\n(article Continues)\n\n=================================================================================\n\nWhat's going to happen? Looks like the most likely option is that Congress will hike the debt ceiling soon- but this will only push us further down the road of endless government borrowing. If they don't, the federal government will be unable to fund thousands of government programs, facing another nationwide federal shutdown similar to 2013.",
    "title": "REUTERS: Yellen Warns Congress of \"unthinkable\" US default risk without debt limit hike",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqud1p/reuters_yellen_warns_congress_of_unthinkable_us/"
}