{
    "author": "w1ndylion",
    "created_utc": 1625333830.0,
    "distinguished": null,
    "edited": 1625353999.0,
    "id": "od2liw",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_od2liw",
    "num_comments": 159,
    "permalink": "/r/Superstonk/comments/od2liw/how_the_sec_neutered_overstocks_2019_crypto/",
    "score": 1583,
    "selftext": "**Edit:** So it would appear there's more to the story! Hooo baby. I'll leave it to u/Minuteman_Capital to explain fully [in their recent post,](https://www.reddit.com/r/Superstonk/comments/o6si8c/how_overstocks_squeeze_was_a_twopart_squiz_court/) but to summarize:\n\nthe massive 17x run-up in price beginning around April 2020 was likely due to the crypto dividend record date having been pushed ahead from its originally planned September 23, 2019. While we're still ascertaining what Overstock's exact short interest was at the time, it was likely far, far less than GMEs current SI. Pull up the OSTK chart and look at that epic volatility following April 2020.\n\nIn terms of legal precedent for the issuance of a crypto dividend: The Overstock crypto dividend faced a class action lawsuit from short sellers that was [dismissed by a Utah judge in September 2020](https://ecf.utd.uscourts.gov/doc1/18315114807) (pacer link). This case [has been reopened](https://ecf.utd.uscourts.gov/doc1/18315209043) as of January 2021 on what appears to be a technicality that will likely not lead anywhere, but we'll have to see.\n\nIn any case, while what follows below is true to the best of my knowledge, and tells the first part of the tale of how the SEC tried to look out for it's own (Wall Street short sellers) instead of protecting a manipulated e-commerce company, check out Minuteman's post for a follow-up of what happened after the initial Septemeber 2019 \"squeeze\" fizzled out.\n\n&#x200B;\n\n**Begin Post**\n\nI'm seeing a lot of hopium building on the possibility of a crypto dividend being announced either tomorrow, July 4th, or July 14th (Gamecoin launch and Bastille day). However, there may be cause to temper excitement if such a thing happens, please read.\n\nOn September 13, 2019, two days prior to the September 15th Overstock crypto dividend record date, prime brokers like JP Morgan and Goldman Sachs began informing their Overstock-shorting clients the SEC had informed these brokers it would protect their decision to \"accept cash equivalent value\" in lieu of the crypto dividend, thus allowing short sellers to not have to close their open short positions. The share price of Overstock which had begun rising parabolically in early September, ahead of the coming record date, precipitously fell as word of this got around:\n\n&#x200B;\n\n[SEC Cock Block](https://preview.redd.it/l8rxew10i0971.png?width=1965&format=png&auto=webp&s=c5abf943c6dc1d6879e1e0da6a845faa4529c183)\n\nPatrick Byrne, the former CEO of Overstock, elaborates on these events in his [September 18, 2019 blog post.](https://www.deepcapture.com/2019/09/the-deep-state-cries-bazoomba/) A NY Post article published on September 17, 2019 serves as the other principle source for the information in this post. Available [here.](https://nypost.com/2019/09/17/ex-overstock-ceo-planned-crypto-dividend-to-thwart-short-sellers/)\n\nIf I have taken away some of your hopium, here are two reasons you should have a little of it back regarding a possible crypto dividend:\n\n1. The SEC in 2019 was acting under a different administration. Gary Gensler (currently in his 11th week) and Gurbir Grewel (1st week) will have a chance to demonstrate to us that some decisions do not require extensive job orientation, but rather the fulfilling of a simple role: Protecting investors; maintaining fair, orderly, and efficient markets; and facilitating capital formation. **This is what the American people pay them to do.** Let the markets work themselves out, then we can all finally move on to more fun things, like drafting new horse-racing regulations. When retail investors play by the rules and beat Wall Street at it's own game, retail investors are allowed their winnings. Period.\n2. Overstock did not have a massive, activist shareholder body like we have in ourselves with Gamestop. We have already seen that behaviors change proportionately according to how many eyes are watching. And we will certainly be watching.\n\nI think most of us have reached a zen state where we realize we ARE the catalyst. Many of us grew up playing the first computers. We understand gaming and gaming culture. We have been immersed in it since we learned to walk. We see the incredible opportunity Gamestop is capitalizing on even as it plays (not unlike a gamer) with it's cards close to its chest. We endure the constant stream of FUD. We take note much of it comes from older generations who couldn't tell us the first thing about setting up their own email let alone guilds, CPU cooling, Python, grinding, hacking toasters, what it feels like to camp all night in line for the release of a sequel to their favorite game, or to grow up adrift in nations bereft of leaders with integrity, under perennial gray skies of economic crisis.\n\nWhat does it mean to have the largest, most motivated, passionately educated, compassionate, skeptical, tech savvy, adaptable, creative, and diverse shareholder body in history? It means we are in unprecedented times. And as such how can we expect the conclusion to this saga to be anything other than also unprecedented?\n\nBuckle up.\n\n💎🙌",
    "title": "How the SEC neutered Overstock's 2019 Crypto Dividend (and why Gamestop is different)",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/od2liw/how_the_sec_neutered_overstocks_2019_crypto/"
}