{
    "author": "Hemoglobin_trotter",
    "created_utc": 1614884350.0,
    "distinguished": null,
    "edited": 1615048663.0,
    "id": "lxs9ka",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lxs9ka",
    "num_comments": 189,
    "permalink": "/r/GME/comments/lxs9ka/conditions_are_primed_to_trigger_a_gamma_squeeze/",
    "score": 1106,
    "selftext": "Conditions are primed for the [ultimate test of diamond vs. paperhands](https://www.reddit.com/r/GME/comments/lxafn1/the_real_diamond_hand_test_will_be_when_this/).\n\n*This Gamma Squeeze could, on its own, rival the VW '08 MOASS! Imagine a Gamma Squeeze of the same magnitude as the VW Short Squeeze of '08 triggering and being the starting point for the most massive Short Squeeze that will ever occur!*\n\n*************************************\n\nOptional background reading: My comparison of GME to VW using conservative numbers. \n\n[Warning: written after watching The Big Short](https://www.reddit.com/r/GME/comments/ltoe73/comparing_rough_gme_numbers_to_vw_08_numbers_why/)\n\n**********************************\n\n*GME: Gamma Volume* \n\n[Delta Hedging](https://www.investopedia.com/terms/d/deltahedging.asp) will soon begin calling for the coverage of naked calls sold at the $120 strike price. (Example of delta in edits).\n\nThis is likely to trigger an insane amount of call covering purchase volume, as detailed here: [Yahoo Finance Option Chain](https://finance.yahoo.com/quote/GME/options/). \n\nThe earlier in the trading week that this process begins, the better. If price climbs into the $130s today or early tomorrow, the process will be hastened. \n\nAdditionally, [any deep ITM calls that are not completely hedged will seriously consider hedging on Friday, 3/5](https://www.reddit.com/r/GME/comments/lx5kgk/100mm_of_deep_itm_gme_calls_have_been_purchased/), and will likely need to start covering if the price continues to climb after being triggered along the $120-$150 chain. \n\nIncluding all unexpired calls, there is an astronomical amount of call volume [all the way up to $800](https://finance.yahoo.com/quote/GME/options?p=GME HYPERLINK \"https://finance.yahoo.com/quote/GME/options?p=GME&date=1616112000\"& HYPERLINK \"https://finance.yahoo.com/quote/GME/options?p=GME&date=1616112000\"date=1616112000). A Gamma Squeeze triggering option chains up to $800 will send it well past $800.\n\n[There is a timebomb sitting at $250!](https://twitter.com/QuantData/status/1365403475266441219)\n\n[6M shares purchased today, 3/4, caused a 10%-15% spike!](https://www.reddit.com/r/GME/comments/lxtetm/that_1015_rise_came_from_only_6_million_shares_of)\n\n********************************\n\nOptional background reading: VW Short Squeeze. Find an article and compare to the numbers below.\n\n*****************************\n\n*GME: Short Numbers*\n\n[Start with the Endgame DD](https://www.reddit.com/r/GME/comments/ltua0n/endgame_dd_how_last_weeks_actions_all_come/). Endgame suggests up to 400% SI, my previous and much less precise estimate used 180% SI.\n\ntl,dr: \n\n> First, we have to take a look at the basis of the current situation.\n\n> AS OF THE 23RD OF FEBRUARY, THE SHORT INTEREST WAS CALCULATED TO BE AT LEAST 430 %. THAT NUMBER BECOMES MUCH MUCH HIGHER IF WE TAKE THE SHORT ACTIVITY FROM 25TH AND 24TH INTO ACCOUNT!\n\n​Note that these numbers exclude activity from 2/24 onward:\n\n> 23rdFeb Calculation:\n\n> Insider Ownership: 23,704,787\n\n> Institutions: 151,000,000\n\n> Funds: 40,000,000\n\n> Retail: 38,595,000\n\n> Total Owned: 253,299,787\n\n> Total Outstanding: 69,746,960\n\n> Percentage of ownership to outstanding: 363.17%\n\n> Estimated Synthetic Shares: 183,552,827\n\n> FINRA Short % of Float: 78.46%\n\n> Finviz Float: 50,650,000\n\n> Reported Shares Shorted: 35,538,624\n\n> Total Estimated Short (Synthetic + Reported)\n\n> 219,091,451\n\n> Percentage of Shorts to the Float: 432.56%\n\n*******************\n\nKeep in mind, this starts after the Gamma Squeeze:\n\nIssued Shares: 70m\n\nFree Float: 50m\n\nShort Interest: 180%-400+%\n\nFree Float Repurchases per 100% of SI: 1.4 (70m/50m)\n\nFloat Repurchases to Cover Shorts by SI%: 2.52 float repurchases at 180% SI, *5.6 float repurchases at 400% SI!*\n\n**Apes diamond handing for dear life effectively reduces the free float, increasing the number of times shares must be repurchased before the diamond hands get in line for their 7-figure bananas!**\n\n*********************\n\nThis is \"name your price\" type of infinite upwards price pressure. Don't sell yourself short.\n\nI plan to start paperhanding around $690,420, no earlier. Ride or die.\n\n************\n\nEdit1: Format and missing link added. GME @ $121\n\n***************\n\n*March 4th Launch Report:*\n\n* ROCKETS ARE RUMBLIN AT 2:28 EST\n\n* (2:33 EST) $144! ARE YOU EXCITED?\n\n* (2:52 EST) If this thing settles around $130, the naked calls and shorts will be in serious doo-doo.\n\n* (3:30 EST) GREAT DAY FOR GME! $140 again!\n\n* Market Close: 💎🙌🦍🚀🚀🚀🚀\n\n*****************\n\n**Even if MMs delta+gamma hedge in real time, they are up a creek:**\n\n*Ex. $135 calls for next friday, 3/12, are at .58-.59 delta. Do you think it would be smart to enter that position with 59 shares covered as the call seller? It spells trouble, and shorts have been scrambling to push the price downward to avoid this exact situation.*\n\n> Q: So by this metric, they would need to get 40% of the max amount of shares that they would need to hedge with? Assuming they already have the 59-61%?\n\n> A: Yes, exactly. Let's call that the delta spread; the difference from delta at sale (assuming they followed it), to 1.00 delta, a full hedge. [Edit: gamma, the rate of change of delta, may accelerate hedging requirements during high volatility]\n\n> The delta spread grows as the strike price grows, and as the time of expiration is pushed into the future. An $800 call in November 2021 had a delta of .03 when I checked the prices early last week. *A DELTA SPREAD OF .97.* This is the highest delta spread you could expect, but Apes bought a lot of these types of contracts.\n\n**********\n\nLast 3/4 Edit: (cleaner format and takeaways):\n\n*LOL at the thought of GME being on the SSR Monday. Time will tell.*\n\nHedgies are appearing in front of Congress and that's maybe their 3rd worst problem. #1 problem is Apes wearing slippers and sitting on toilets and the Whales! #2 is Margin Maintenance! Tax man will get a big fat slice of Apes' banana stash. Economy gets extra bananas.\n\nTo my friends considering selling a share to cover costs, I have said: why give some short seller a discount on his price for gambling with the future of a good company like GME just because he's first in line to buy? Fuck that guy!! $100k is at least an 80% discount, imo.\n\nMy worst-case scenario is owning shares of a company that I believe is worth more than it currently trades at (~$130). Oh no. I'm terrified. \n\nHype material: [Money glitch activated](https://www.reddit.com/r/GME/comments/lw0aju/remember_that_100kshare_is_a_bargain)\n\n****************\n\nEdit:\n\n3/5 (9:53 EST) \"Too soon to tell\" MKT open reaction: \n\n* Betting an SSR-level drop is out of the picture today\n\n* Insane price movement on MINISCULE volume! \n\n* Scales tilting in ape favor\n\n(10:36 EST): Knocking on $150!! This spells trouble!\n\n(10:56 EST): Pushing that down to $130s must have really hurt!\n\n(Mkt Close): Thar she blo.... Oh. No volume to speak of today. A suspiciously frustrating slow trickle from both sides. \n\nA victory for the GME longs nonetheless, it *nearly* surpassed $150, and was never pushed below $135. +4% on the day! +32% on the week! +114% on the month!! This stock is outperforming the market, and that's great!\n\n\nEither way, the bleeding continues for the shorts. Long whales have their own positions to consider as well; too big of a market dip is not necessarily in their best interest. We'll hear more about how GME is over, and how treasury bond yields and inflation are causing market-wide sell-offs. Next week may be a repeat of this week at this rate, but that could put GME into the $150 range. If the shorts manage to drive the price back down then they buy some time but will also continue to bleed and dig deeper.\n\nIf you're reading this on the weekend, go outside and forget about the market for a day!",
    "title": "Conditions are Primed to Trigger a Gamma Squeeze that Rivals the VW MOASS of '08 on its Own.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lxs9ka/conditions_are_primed_to_trigger_a_gamma_squeeze/"
}