{
    "author": "SnooMaps6681",
    "created_utc": 1614877467.0,
    "distinguished": null,
    "edited": 1614878688.0,
    "id": "lxphd4",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_lxphd4",
    "num_comments": 99,
    "permalink": "/r/GME/comments/lxphd4/dfv_tweet_dd_willy_wonka_and_what_that_means_for/",
    "score": 868,
    "selftext": "[https://www.youtube.com/watch?v=XB401RfGMlM](https://www.youtube.com/watch?v=XB401RfGMlM)\n\n\\^ The Scene above is from Willy Wonka & The Chocolate Factory, this is when Willy and the Kids go on a boat ride through the Tunnel. Willy recites the following poem:\n\n>\"There's no earthly way of knowing  \nWhich direction we are going  \nThere's no knowing where we're rowing  \nOr which way the river's flowing  \n  \n>  \n>Is it raining, is it snowing?  \nIs a hurricane a-blowing?  \n  \n>  \n>Not a speck of light is showing  \nSo the danger must be growing  \nAre the fires of Hell a-glowing?  \nIs the grisly Reaper mowing?  \n  \n>  \n>Yes! The danger must be growing  \nFor the rowers keep on rowing  \nAnd they're certainly not showing  \nAny signs that they are slowing\"\n\nThe boat ride is obviously terrifying - a scary and bumpy ride (something we've all have felt at some point with GME) but us diamond handed apes have made it this far, and if we make it through the tunnel, we will be rewarded at the end like Charlie.\n\nAgain, I'm sure many of us have stated a million times before that this journey won't be easy. Like most things in life - nothing worth having is easy and it never will be. But if we are able to stay mentally strong, trust in DFV, and keep holding and buying the dips - we're making it to the end where we will ultimately be rewarded.\n\nAlso, just want to add that I found the following interpretation of this scene, which states:\n\n[quora.com/Why-did-they-try-to-make-the-tunnel-scene-scary-in-Gene-Wilder-Willy-Wonka-and-the-chocolate-factory-scene](https://quora.com/Why-did-they-try-to-make-the-tunnel-scene-scary-in-Gene-Wilder-Willy-Wonka-and-the-chocolate-factory-scene)\n\n**\"The tunnel is meant to scare off the cowards but also serve as a warning- the Factory is just as much a dangerous place as it is a wonderland, as you’ll note it’s after the tunnel scene that we start seeing children getting bumped off.**\n\n**If they weren’t brave enough to get through the tunnel, they had no place in his factory. But also he had to be sure they weren’t just foolhardy and reckless and possessed actual courage, so the remaining rooms after the tunnel and some of their scares were there to also to test their determination and find out if they were just too greedy/selfish/immature to overlook the danger.**\n\n**Charlie won because not only did he keep going to the end, he also engaged in reckless behavior but took responsibility for it, whereas every other child went out of their way to endanger themselves (and Charlie did too, albeit at his Grandpa’s prodding) and showed no guilt or shame until it came time for consequences. Whereas Charlie not only cleverly and intelligently escaped the initial consequences (the spinning, deadly fans were not placed above a room with fizzy lifting drinks because of Non-OSHA compliance, but intentionally!) but when directly and verbally admonished for his actions, not only accepts the punishment, also fairly returns the everlasting gobstopper - Charlie is such an unselfish, fair minded person he can stomach letting go of the Chocolate Factory AND promised riches and wealth if he were to give it to Wonka’s competitors, something that would crush any other child in his position as a poor child supporting an entire extended family on his back.**\n\n**The Factory tour was meant to filter out children by not only their flaws, but also their fears- and what greater, hard to swallow fear is there to discover that after all you’ve been through, you still didn’t win? The tunnel was an early taste of what was to come.\"**\n\nTDLR: \\*\\*\\* Diamond handed apes are going to the MFin' moon with DFV (Willy Wonka) -- just gotta keep being mentally strong and enjoy this scary, crazy wild ass ride!! \\*\\*\\*\n\nEDIT: Also very important to note that \"After that ride they are at the ever lasting gobstopper room. They’re offered to give one to the enemy for 10k. Charlie held out and *WINS THE GRAND PRIZE* - (@drjohnazoidberg69)... KEEPIN HOLDIN YOUR GOLDEN TICKET APES!",
    "title": "DFV Tweet DD - Willy Wonka and What That Means for Us Apes #DIAMONDHANDS #WEGOINTOTHEMOON",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lxphd4/dfv_tweet_dd_willy_wonka_and_what_that_means_for/"
}