{
    "author": "Sladerade",
    "created_utc": 1623322205.0,
    "distinguished": null,
    "edited": 1623366311.0,
    "id": "nwklbg",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nwklbg",
    "num_comments": 217,
    "permalink": "/r/Superstonk/comments/nwklbg/looks_like_gamestop_is_cooperating_with_an_sec/",
    "score": 6802,
    "selftext": "**EDIT: Fixed the link to the Apex Merger Document. Sorry guys!**\n\n(Had to make a new post due to formatting issues and needing to add info.)\n\nBear with me please, this is my first post in here, and I’m no expert. Just a lurker like many of you, who like the stock. 🦍💎🤲\n\n[6/9/2021](https://eresearch.fidelity.com/eresearch/evaluate/news/basicNewsStory.jhtml?symbols=GME&amp;storyid=202106091804RTRSNEWSCOMBINED_FWN2NR13C_1&amp;provider=RTRSNEWS&amp;product=COMBINED&amp;sb=1)- *“May 26th, 2021 GameStop received request from SEC for voluntary documents and information regarding SEC investigation..into trading activity in securities and securities in other companies..GameStop intends to cooperate fully with SEC staff.”*\n\nThis was included when the earnings were disclosed yesterday.  \n\nAlso, disclosed with the [Apex and Norther Star merger document](https://www.sec.gov/Archives/edgar/data/0001834518/000119312521183297/d121216ds4a.htm) released June 4th, was that there is an active lawsuit against apex and about 30 other companies.\n\n**Lawsuit info is on page 186. Part of it reads:** *“Plaintiffs allege that Apex, along with over 30 other brokerages, trading firms and/or clearing firms, including Morgan Stanley, ETrade, Interactive Brokers, Charles Schwab, Robinhood, Barclays, Citadel and DTCC engaged in a coordinated conspiracy in violation of anti-trust laws to prevent retail customers from operating and trading freely in a conspiracy to allow certain of the other defendants, primarily hedge funds, to stop losing money on short sale positions in GameStop, AMC and certain other securities”*\n\nI’m sure the lawsuit isn’t surprising, but still, thought this was all informative, and it might help some other apes with more wrinkles with future DD. \n\nCredit to u/Jackbauer13579 for bringing the info revealed in the Apex merger document to my attention. \n\n**TLDR:** GameStop released info about SEC investigation. Possibly connected with lawsuit revealed in Apex / Northern Star merger document.",
    "title": "Looks like GameStop is cooperating with an SEC investigation, possibly related to a lawsuit against Apex and 30 something other firms.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nwklbg/looks_like_gamestop_is_cooperating_with_an_sec/"
}