{
    "author": "CheezusRiced06",
    "created_utc": 1627614856.0,
    "distinguished": null,
    "edited": false,
    "id": "ouckbu",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ouckbu",
    "num_comments": 117,
    "permalink": "/r/Superstonk/comments/ouckbu/just_visited_my_local_gamestop_the_new_employee/",
    "score": 2467,
    "selftext": "this straight up happened about an hour ago and am still scratching my head wondering if what I witnessed was legit.\n\nI walked into my local GameStop to inquire about PS5s and browse their merchandise - the following conversation occurs\n\nMe: hey, do ya'll happen to have any PS5's?\n\nGameStop: sorry bro, we do not - I'd recommend ordering on Mondays or Wednesdays at [Gamestop.com](https://Gamestop.com) to pick up in store... but I've been working here 11 years and *I* haven't gotten one, so, yeah... it's *that* hard\n\nM: Ah well I'll have to keep an eye out. Do you happen to have any GameStop shirts?\n\nGS: You mean game related shirts or just straight up \"GameStop\" shirts *\\*gesturing at chest\\**\n\nM: straight up GameStop\n\nGS: *squints at me* why?\n\nM: *side eye puppet* No... particular... reason\n\n(note: I don't really discuss being a shareholder but I think it's safe to say he was on to me at this point)\n\nGS: (smiling now) You want the one with a rocket on it?\n\nM: (after doing a mental double take) ...rocket?\n\nGS: Yes sirrrrr, to the moon! Just got dropped off today!\n\n**AND THEN HE SHOWS ME**\n\na plain, black T-shirt with a white \"Game\" and a red \"Stop\"\n\nand there on the bottom left side of the shirt, on the hem at the left thigh - was a tiny red tag with a single  🚀  on it. This was not a \"look at me I'm rocket GameStop now!!!\", this was subtle af.\n\n*continuing*\n\nM: Oh my god I don't believe it\n\nGS: as I said to the moon brother\n\nM: These are going to be for sale?!?\n\nGS: No actually, these are supposed to be **only for employees.**\n\n**----------**\n\nThe rest was basically shooting the shit. I'm sure this reads decently like an r/thatHappened type yarn, but I know what I saw and I'm here to ask anyone if they have seen anything similar - and if not, to request confirmation that this is legitimate.\n\nI don't believe these are being rolled out quite yet, as the employee (who I'm now guessing was the GM) said they were dropped off today. I didn't want to ask about pictures in case it was something that was not supposed to be evidenced by photo just yet. \n\nMy personal simulation has been confirmed, this shit has been real af since January, but it *definitely* just got real in a totally different, totally sack of diamonds to the chest type way.\n\nBullish AF.\n\nAny confirmation stories?\n\nfor reference I'm in TX, so pretty close to HQ\n\nalso, 10/10 experience with the staff at the store, well informed and exceptionally friendly throughout the entire exchange!",
    "title": "Just visited my local GameStop... the new employee shirts have 🚀 on them",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ouckbu/just_visited_my_local_gamestop_the_new_employee/"
}