{
    "author": "jabulanijonny",
    "created_utc": 1614125210.0,
    "distinguished": null,
    "edited": 1614130265.0,
    "id": "lqxhxb",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion",
    "name": "t3_lqxhxb",
    "num_comments": 90,
    "permalink": "/r/GME/comments/lqxhxb/is_citadels_hedge_fund_a_harmless_35_billion/",
    "score": 860,
    "selftext": "Literally my 2nd post, cause I’m a lurker. Forgive if I didn’t do it right.  Seriously, it blocked on the word “ki11”?  \n\nEdit 2:  y’all, this isn’t my article, please see the credited author below. I found it interesting; hope you do as well.  Edit 1 is at the bottom. \n\nTLDR: Citadel should not be trusted, even under oath. \n\n\nWall Street on Parade:\nBy Pam Martens and Russ Martens: February 23, 2021 ~\n\nAt the end of last Thursday’s 4-hour long hearing on the forces behind the wild trading in shares of New York Stock Exchange-listed GameStop, Congressman Jesus (Chuy) Garcia of Illinois asked Citadel hedge fund billionaire Ken Griffin how much money was managed by his hedge fund. Griffin replied: “We manage approximately $35 billion dollars of assets.”\n\nGarcia than suggested that Citadel was systemically important. Since this might be construed to mean that Citadel should be under heightened regulatory oversight, Griffin quickly responded with this: “I believe that our hedge fund would not be in the category as systemically important. With $30-some billion of equity it is simply not at the scale or magnitude of a JPMorgan, Bank of America, Wells Fargo.”\n\nTo make a proper assessment as to whether Citadel is a little minnow swimming peacefully with the Dolphins or a predatory killer shark regularly looking for a fresh ki11, it’s important to pay attention to what happened between Griffin’s first response and his second response. In the first response, Griffin said Citadel managed “$35 billion dollars of assets.” In the second response, he changed that to “$30-some billion of equity.”\n\nAccording to the Form ADV that Griffin’s hedge fund, Citadel Advisors LLC, filed on January 15, 2021 with the Securities and Exchange Commission, his hedge fund is managing not $35 billion but $235 billion – to be very specific, $234,679,962,503.\n\nIn a 2011 SEC final rule announcement, hedge funds were required to report “regulatory assets under management,” which includes not just the “equity” investors held in the hedge fund but the additional assets the hedge fund had purchased with borrowed funds – known as buying on margin. Hedge funds were also required to report assets held on behalf of foreign investors. Since hedge funds manage all of the assets they hold, and Congressman Garcia was clearly attempting to assess the size of Citadel’s systemic footprint in U.S. financial markets, it would have behooved Griffin to explain that the gross amount of assets his hedge fund was managing was actually 6.7 times the figure he had provided, that is, $235 billion not $35 billion. (Not to put too fine a point on it, but Griffin was put under oath, along with all other witnesses, at the opening of this hearing.)\n\nCitadel’s hedge fund consists of a series of sub-funds that have varying investment strategies and asset classes including stocks, bonds and commodities. A Citadel hedge fund brochure that is also on file with the SEC explains how leverage is piled on: “The sub-funds generally invest on a highly leveraged basis, and the Funds may leverage their investments in the underlying sub-funds.”\n\nAccording to Citadel’s Form ADV, a majority of its sub-funds that hold the largest amount of gross assets are organized in the Cayman Islands, a jurisdiction prized for its secrecy. Those include: Citadel Multi-Strategy Equities Master Fund Ltd. with $59 billion in gross assets; Citadel Equity Fund Ltd. with $25.7 billion in gross assets; Citadel Kensington Global Strategies Fund Ltd. with $17.3 billion in gross assets; and Citadel Quantitative Strategies Master Fund Ltd. with $8.3 billion in gross assets.\n\nThe SEC’s Form ADV asks the question: “What is the approximate amount of your total regulatory assets under management attributable to clients who are non-United States persons?” Citadel answers that more than $170 billion or 72 percent of its $234.6 billion of gross assets under management are foreign owned.\n\nIt’s difficult to assess what that actually means. Citadel’s hedge fund does indicate in its SEC filings that it has multiple foreign offices, so it could be managing assets for wealthy foreign individuals. But since it views its sub-funds as its clients and many are located in the Cayman Islands, that $170 billion could simply mean offshore sub-funds.\n\nIn addition to Citadel’s sprawling footprint in assets under management by its hedge fund, it is the largest market maker when it comes to retail trading in U.S. markets. According to Griffin’s opening statement at the hearing, Citadel Securities, the market-making arm of Citadel, “executes more trades on behalf of retail investors than any other firm.” Congressman Garcia asked if that represented 40 percent of all retail orders and Griffin didn’t dispute that figure.\n\nCitadel Securities has captured that retail trading market by generous payments for order flow to at least nine online brokers. (See our report: Citadel Is Paying for Order Flow from Nine OnLine Brokerage Firms – Not Just Robinhood.) There is growing concern among lawmakers that Citadel Securities’ motivation in paying for this order flow is to be able to trade against unsophisticated retail traders, known as “dumb money” on Wall Street, in order to unfairly enhance its own bottom line.\n\nThe disciplinary history of Citadel Securities, unfortunately, aligns with that thesis.\n\nOn June 25, 2014, Citadel Securities was fined a total of $800,000 by its various regulators for serious trading misconduct. Citadel paid the fines in the typical manner, without admitting or denying the charges. The New York Stock Exchange alleged that the following had occurred:\n\n“The firm sent multiple, periodic bursts of order messages, at 10,000 orders per second, to the exchanges. This excessive messaging activity, which involved hundreds of thousands of orders for more than 19 million shares, occurred two to three times per day.”\n\nIn addition, according to the York Stock Exchange, Citadel “erroneously sold short, on a proprietary basis, 2.75 million shares of an entity causing the share price of the entity to fall by 77 percent during an eleven-minute period.” In another instance, according to the New York Stock Exchange, Citadel’s trading resulted in “an immediate increase in the price of the security of 132 percent.”\n\nOn January 9, 2014, the New York Stock Exchange charged Citadel Securities LLC with engaging in wash sales 502,243 times using its computer algorithms. A wash sale is where the buyer and the seller are the same entity and no change in beneficial ownership occurs. (Wash sales are illegal because they can manipulate stock prices up or down.) Citadel Securities paid a $115,000 fine for these 502,243 violations and walked away. That’s less than 23 cents per violation.\n\nOn January 13, 2017 the SEC settled a case against Citadel Securities for $22.6 million in fines and disgorgements, alleging the following had occurred:\n\n“…two algorithms used by Citadel Securities did not internalize retail orders at the best price observed nor sought to obtain the best price in the marketplace. These algorithms were triggered when they identified differences in the best prices on market feeds, comparing the SIP feeds to the direct feeds from exchanges. One strategy, known as FastFill, immediately internalized an order at a price that was not the best price for the order that Citadel Securities observed.  The other strategy, known as SmartProvide, routed an order to the market that was not priced to obtain immediately the best price that Citadel Securities observed.”\n\nMore recently, on July 16, 2020, Citadel Securities agreed to a $700,000 fine by Wall Street’s self-regulator, FINRA, for executing customer orders at prices worse than it traded for its own account. Citadel Securities was allowed to neither admit nor deny the charges. The activities occurred over a period of years.\n\nOn November 13, 2020, FINRA fined Citadel Securities $180,000 for failing to mark 6.5 million equity trades as short sales. Citadel did not admit or deny the allegations but paid the fine. The activity occurred between September 14, 2015 and July 21, 2016, according to FINRA.\n\nCitadel Securities previously owned a Dark Pool called Apogee. In 2014 Wall Street On Parade became curious when we could not find basic information about this Dark Pool. We filed a Freedom of Information Act request with the SEC. We received a written response from the SEC telling us “we have determined to withhold records responsive to your request….” Less than a year later, Reuters reported that Citadel was shuttering Apogee.\n\nCitadel’s hedge fund filings with the SEC also indicate that some of the largest banks on Wall Street, such as JPMorgan Chase, Goldman Sachs, and Citigroup, are its prime brokers – meaning that it is highly likely that they and other globally systemic banks are providing margin loans that have helped Citadel Advisors leverage its equity from $35 billion to $235 billion.\n\nCongresswoman Maxine Waters, Chair of the House Financial Services Committee, has promised to hold two more hearings on the structure of Wall Street trading: one hearing with experts from various disciplines and one hearing with federal regulators.\n\nBefore those hearings occur, it will be critically important for members of this Committee to have a far better understanding of precisely how hedge funds, high frequency traders, Dark Pools, and federally-insured banks backed by taxpayers are interacting with the highly fragmented and non-transparent U.S. trading markets.\n\nEdit 1: are we still supposed to post positions?  I saw where we’re not. Just suffice to say I have been in GME since Sept. primarily in calls, now mostly stock. Over 1050 shares under $30, April and Nov calls at $20, $30 & $40 strikes. I was looking at $1.4MM gain at the top. Didn’t sell. Holding.",
    "title": "Is Citadel’s Hedge Fund a Harmless $35 Billion Minnow or a $235 Billion Ki11er Shark?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lqxhxb/is_citadels_hedge_fund_a_harmless_35_billion/"
}