{
    "author": "squirrel_of_fortune",
    "created_utc": 1622292183.0,
    "distinguished": null,
    "edited": false,
    "id": "nnmpiy",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nnmpiy",
    "num_comments": 106,
    "permalink": "/r/Superstonk/comments/nnmpiy/game_theory_and_socialevolutional_psychology/",
    "score": 1197,
    "selftext": "I'm a scientist and this is a brain dump of what I've read in scientific articles and books.\n\nThere's papers in game theory (that I cannot be bothered to find, sorry is Saturday and I'm still in my PJs) which have found that there are always some that cheat. \n\nPaperhanders=freeriders=cheats\n\nPart one: game theory and freeriders\n\nIt's advantageous for some people to cheat, but if everyone cheats the system breaks down (see 2008 crash and the current naked short selling crisis!), And there's work in evolutionary biology suggesting that a certain percentage will cheat. There have been freeriders since we were bacteria!\n\nNow this is why in game theory, a group of humans will take the less advantageous position for them purely to punish cheaters. See also the concept of fair play, being sporting, not being an arsehole, and rules for behavior in every major religion, etc\n\nPaper hands will rise on our work and paperhand out some of their shares to cover their bet, which is cheating, and we can't punish their behaviour cos we don't know who they are. (And if we could punish them we'd now be guilty of collusion, there's DD about that).\n\n But humans often behave how they behave even when there isn't a mechanism to catch them, largely cos the cognitive load of checking for such a mechanism is too high (in non psychology terms, we're too lazy to check how we might get caught that it's often easier to obey the rules). So most people won't paperhand. We'd feel we were letting the community down, and we've spent our lives in communities where we don't let them down as we don't want to be known as the arsehole.\n\nBut by paperhanding, they reduce their risk, but also their potential profit. If you've only bet what you can afford to lose and you're commited to this bet, then you don't need to reduce your risk.\n\nAnyway, there will be paperhanders because some humans will always do it (perhaps because of selection pressures), but most Humans won't do it. \n\nA minorty are freeriders? Always have been. Earth 🌎 astronaut gun.\n\nAddendum: our actions make evolutionary psychology sense, we're punishing the cheaters, the hedge funds doing the naked short selling that is cheating, and it makes socialogical sense as if we don't punish the cheaters, the system collapses and we're all hurt. This is why we're confusing the hedges we are literally following a different evolutionary strategy to them!\n\nPart 2: Nash equilibrium (Google it or watch A Beautiful Mind).\n\nOk a Nash equilibrium is where a group takes the less than optimum option for themselves for the group to get the optimum option. \n\nI.e. if you paperhand some shares on the way up, you reduce your risk and can still make out on the backs of others (freerider!)\nBut if everyone does it, no squeeze.\n\nBut if we all go for a Nash equilibrium, we all take the risk on the way up, we all make out better.\n\nJohn Nash won the Nobel prize in economics for this.\n\nSo yeh, a Nash equilibrium is what we want.\n\nPart 3: combining part 2 and 3\n\nThe optimum for the group is a Nash equilibrium. But there have been freeriders since time immemorial. But if the majority go for a Nash Equilibrium \nLiterally  💎 ✋\nEven if there are freeloaders (paper ✋)\nIt will squeeze. (Not necessarily as much as it could, but nothing in life is perfect)\n\nWhy? Cos human progress has not been completely retarded by freeloaders before, and we have socialogical and psychological training in how to deal with this.\nPush the community,\nLiterally APES TOGETHER STRONG\nPush the Nash Equilibrium solution\nAppeal to greed by explaining selling on the way down\nPush the description of hedges as cheaters\n\nBecause I'm too lazy to find said research, I'm going to pick a number out of my arse and say I'm expecting 10% paperhanding. (You could get 20%if you like Pareto stats).\n\nNB. Don't be offended, Humans are 'lazy' cognitively cos it's costs a lot of energy to run our big brains and there's only so many bananas, so we look for shortcuts. Without that, we'd never have invented the wheel or computer programming.\n\nSome papers\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC137873/\nhttps://royalsocietypublishing.org/doi/10.1098/rsif.2016.0967\nGoogle Nash equilibrium, game theory+free riders\n\nEdit: TLDR: \nThere will always be a small percentage of cheaters, but they won't stop the squeeze because it's a small percentage and the freeloaders haven't managed to retaed human progress completely thus far. Pushing the community naritive is the best way to stop potential fomoing in paperhanders. But I've been to lazy to find all the articles for you. soz.\n\nTLDR of the tldr\n 💎✋+ Apes together strong = 🚀🚀🚀🚀🌚\n\n(Sorry for bad writing am on my phone and have fat fingers)",
    "title": "Game theory and social/evolutional psychology reasons why the MOASS won't be stopped by paperhanders",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nnmpiy/game_theory_and_socialevolutional_psychology/"
}