{
    "author": "Alert_Piano341",
    "created_utc": 1622290731.0,
    "distinguished": null,
    "edited": 1622309351.0,
    "id": "nnmb4c",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nnmb4c",
    "num_comments": 1157,
    "permalink": "/r/Superstonk/comments/nnmb4c/tombstone_tweet_confirms_reverse_merger_reposted/",
    "score": 13875,
    "selftext": "&#x200B;\n\n[RC TOMBSTONE TWEET](https://preview.redd.it/a5aarkz9v1271.png?width=400&format=png&auto=webp&s=b066fbf4ef1a4432597d4f7b16cc8a76c66fcadb)\n\n\"A tombstone is a written advertisement that gives investors basic details about an upcoming public offering.\"\n\nEDIT #1 THANKS FOR ALL THE UPVOTES! I didn't expect this to blowup as I was just reposting it in light of the tweet. This is my theory based on facts. Also a great timeline of rc involvement with GME. Gamestop future is very bright in the near term and future.  Not financial advice.\n\nReposting Merger DD\n\n**What's RC plan, does he have a plan?**\n\n&#x200B;\n\n[Reverse Merger](https://preview.redd.it/e3snbmofv1271.png?width=1264&format=png&auto=webp&s=919faa2369537a443fc935d3c012f6a33d6c1d78)\n\n&#x200B;\n\nHere is what I think Ryan Cohens plan is\n\nOk I have heard allot of talk about stock splits, reverse splits, dividends or crypto dividends ect on how RC can shake the shorts.\n\nNone of those really go the whole way. Reverse split is out of the question as the stock is not liquid enough, and there is legal questions surrounding the crypto dividend. [OVERSTOCK](https://www.coindesk.com/after-lawsuits-and-delays-overstock-hands-shareholders-digital-dividend)\n\nAlso none of these moves benefit Ryan Cohen and GameStop at the same time. They may hurt the shorts or help retail investors but none of the options help Gamestop and RC at the sametime.\n\nI have [Posted](https://www.reddit.com/r/Superstonk/comments/mwy324/can_ryan_cohen_increase_his_ownership_to_199/) and others have thought about RC buying more GameStop, after reviewing the filings **he can buy up to 20% of the company at any point.** This whole time I have been waiting for him to buy, and thinking that he is waiting for volume to dry up, or to save his ammo to protect the stock if the price starts to fall.\n\nbut there is a serious flaw in that thinking......it doesn't help Gamestop.\n\nI lay out the timeline of RC and GameStop below more in-depth below, but at this point RC has control of the board and the chairmanship, he doesn't need to buy anymore stock the way normal people do.\n\nGameStop, with the help of RC and his marry band of Apes has erased its long term debt (minus leases) and raised 555m (a nice down payment on the transformation)\n\nRyan Cohen wants to own more of GME, most owner/CEO own over 20% of the companies they run.\n\nHe is totally invested in the GameStop turnaround, the best thing he can do is a **Reverse Merger.**\n\nHe capitalizes RC ventures with allot of money (500m, 750m, 1.5b) he can even bring in other private investors.\n\nRC Ventures and GME merge, they create a Holding Company that they both merge into. The holding company is renamed Gamestop and eventually trades as GME under a **new CUSIP#**\n\n**How does it help Ryan Cohen**\\- He gets ownership of whatever % of the stock at the agreed upon merger price (it would be the same amount as if he bought on the open market)\n\nH**ow does it help Gamestop**\\- they actually get the **CAPITAL,** if Ryan buys on the open market they don't get the money they sold that stock when they issued it. this way Ryan gets to infuse the company with much needed cash and increase his ownership stake at the same time.\n\nYou are probable asking\n\nHOW DOES IT HELP APE - Did you gloss over the part about the CUSIP#...here read this\n\n[Example 1](https://groovevc.wordpress.com/2017/04/12/is-this-the-beginning-of-a-remarkable-short-squeeze/) or [https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/](https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/)\n\n\" Changing the stock cusip number results in each share with the old cusip number having to be exchanged for a share with the new cusip number, which causes each short position to have to prove the borrow. Naked short positions would be unable to comply and those positions could have to be covered by purchasing shares with the new cusip on the open market. \"\n\nNow the reverse split or the reverse merger has been tried before and it does squeeze the stock price a bit, but then it goes right back down. Typically this is because it is done on Penny Stocks and the shorts can simply cover as its not that expensive or there is not as many Naked shorts as people think.\n\nbut what if there is a ton of **NAKED SHORTS,** then those **SHORTS ARE FUCKED.** If they sold a bunch of shares naked and kept doing it without ever thinking they would need to be returned they would be foreced to buy a TON of GME under the new CUSIP #\n\n**ADDITION More research and DD need to be done on how a merger or reverse merger affects users on ETTORO**\nhttps://www.etoro.com/posts/0__entry__19ed9016-5e15-4642-be20-64b8dc9bb89f\nAdding alpha merger info from Etoro.  My take is not to worry if you are on Etoro, there would be a minimum 30 day period from the announcement of a merger to an actual merger, probably more. So the stock would squeeze during that period not after. Also any merger would cause a change in cusip number.\n\nRemember Citadel Securities is the DMM for GME right now if they change their cusip number they can change DMM OR CHANGE EXCHANGES.\n\n&#x200B;\n\n[SHortsplan was never to cover](https://preview.redd.it/wf27b5zmv1271.png?width=1027&format=png&auto=webp&s=7d5deba3ced045bc5fc1f253eff80fcbded6c947)\n\nI have been writing a DD where I believe that Citadel and SUS has been stashing their Naked options sales or Naked short sales in [Sold not yet purchased liabilities](https://www.reddit.com/r/DDintoGME/comments/n6mj3h/knight_capital_groupthe_precursor_to_citadel_part/) which are Ballooning.  Citadel has no clothes describes the naked shorting done by Citadel securities the best.\n\nOh and GME has done this before when the merged with EB games\n\n[Gamestop EBgaming Merger](https://news.gamestop.com/node/11616/html)\n\nThey created a new Holding company like a laid out above\n\nMore Fuel for the Fire-\n\n**Ryan Cohen changed lawyers** (DFV pointed it out in his tweets)\n\nnew lawyer.....rising start in Mergers and Acquisitions\n\n[https://profiles.superlawyers.com/new-york-metro/new-york/lawyer/ryan-p-nebel/c6896fb3-ede6-4eca-8bbe-40b0dc317589.html](https://profiles.superlawyers.com/new-york-metro/new-york/lawyer/ryan-p-nebel/c6896fb3-ede6-4eca-8bbe-40b0dc317589.html)\n\nHe also has a team of lawyers but Ryans on the Filings now . [NEW TEAM](https://www.globallegalchronicle.com/gamestops-agreement-with-ryan-cohen-for-the-board-of-directors/)\n\n**Ryan Cohen has the Assets**\\-\n\nHe sold CHewy for Billions....he bought two stocks Apple and Wells Fargo (we don't know the ratio but articles point to it being heave on apple)\n\nDo you like apples?\n\n&#x200B;\n\n[RC ownes 6.2 Million Shares of APPLE](https://preview.redd.it/e8odbhlsv1271.png?width=853&format=png&auto=webp&s=06a3cc0a60e8194e09a9447b0ded0a4341407c5e)\n\n**Tinfoil Hat time-**\n\nApple has been acting weird since mid February.\n\n[Apple bought back 19B in March](https://www.barrons.com/articles/tech-giants-have-ramped-up-stock-buybacks-apple-is-the-champ-51619780412), the stock didnt pop up until they crushed earnings and annouced that they are going to buy back 90B more....and its dipping again.\n\nI have been thinking it is Funds selling out to cash out or to cover your position. Probably covering the position as apple it is safe haven stock.\n\nbut what if it was someone ready to go .....all in on GME\n\nyeah crazy theory\n\n&#x200B;\n\nhttps://preview.redd.it/xt08lsjvv1271.png?width=1072&format=png&auto=webp&s=d8276c1f6fa1cb5bad92332610c7f69da848d1ee\n\n&#x200B;\n\nhttps://preview.redd.it/8iif6rzwv1271.png?width=782&format=png&auto=webp&s=c1cae8e7524d542837656f5a8f76f4eacf79deb6\n\n**Lets Recap what Ryan has done to Date**\\-\n\n\\-Ryan Cohen Started purchasing Gamestop on 8/13/2020\n\n\\-Registers and Incorporates **RC Ventures LLC** on 8/28/2020\n\n\\-Files [first 13D](https://sec.report/Document/0001013594-20-000670/) on 8/28 signifying that he owns more than 5%\n\n\\-Buys more GME and then on 11/16/2020 rights a [letter to the board](https://sec.report/Document/0001013594-20-000821/rc13da3-111620.pdf) (This really the only DD I need)\n\nhe points out in the letter Game stop is failing and squandering a Golden opportunity\n\n&#x200B;\n\n[He knows they were short](https://preview.redd.it/scab9wkzv1271.png?width=660&format=png&auto=webp&s=b9f725728fae915bb9d29290f488615df253e175)\n\n&#x200B;\n\n[Would not be bought off with board seets](https://preview.redd.it/qmplk5s0w1271.png?width=721&format=png&auto=webp&s=e4d30c5d9af4543323226b880565cd030b227e99)\n\n\\- On 12-21-2020 RC aquires more [GME](https://sec.report/Document/0001193805-20-001571/) he now owns 12.9%, [DFV](https://twitter.com/TheRoaringKitty/status/1341074590534152192) eagle eyes it a notes Ryan switched attorneys, thanks DFV you look at everything\n\n\\- GME and RC file a [13D/A](https://sec.report/Document/0001193805-21-000031/) that they have come to agreement that the board will expand from 10-13 seats, and Alan Attal, Ryan Cohen and Jim Grube will be added to the board. At the share holders meeting it will go back to 9 members. [Agreement](https://sec.report/Document/0001193805-21-000031/#e620202_ex99-1.htm) (please read)\n\n&#x200B;\n\nhttps://preview.redd.it/qonwquv3w1271.png?width=1624&format=png&auto=webp&s=9b08866cd3b1bfe64c052ede6c671fb57b8d2371\n\nthe standstill provision last until 120 days after the annual meeting (unless they amend or terminate it)\n\n&#x200B;\n\nhttps://preview.redd.it/p8cj95x6w1271.png?width=1649&format=png&auto=webp&s=96036d237f1a27eb901611291970f7073b8551e4\n\nStandstill period for stock ownership, and it changes the definition of an interested stockholder from 15% to 20%. it notes that an interested stockholder would be restricted on any business combination for 3 years after they reach 20% (changed from 15%)\n\n&#x200B;\n\n[He is approved to buy 20&#37; of the stock to date...but has not](https://preview.redd.it/o06xtk8bw1271.png?width=1643&format=png&auto=webp&s=12d6681ed5eed7e199bd3aba19cd9e3e24e2f683)\n\n\\-James Bell Resigns 2/23\n\n\\-GME hires new COO from amazon 3/23 (they also hired a series of C-suite executives to lead the transformation)\n\n\\-Gme 4/5/2021 updates their [ATM offering](https://sec.report/Document/0001193125-21-105564/) reduce shares from being offered and increased the target price and the press thought it was Bad??? (side note in late 2019, GME bought back over 30,000,000 shares!!! so they bought back 30,000,000 shares in 2019 for 150 million, and sold 3.5 million shares in 2021 for 555million)\n\n\\-GME 4/8/2021 announces Ryan Cohen will be director of the board on 6/9 and that the board will be 6 members (Ryan has 4 of the 6 seats) OK **He wrote a letter on November 11/16 and 6 months later he is the chairman of the board and has board control.**\n\n\\-Gme 4/13/21 Announces Voluntary Early Redemption of Senior note (cool they will be debt free) lets check out the note\n\n&#x200B;\n\n[He can now do the merger](https://preview.redd.it/7b1quvhiw1271.png?width=1547&format=png&auto=webp&s=c343b164761359be5620c78033880031bcee9252)\n\nGME 4/19/21- Announces CEO succession plan ( I don't think it matters if its Ryan or not, Ryan is steering the ship another person would just bring in added brain power and experience)\n\nGME 4/26/21- Gme Complete At the market equity offering program (21 days) Sells 3,500,000 shares for $551,000,000\n\nGME 4/30/21 Retired the debt and announced the opening of a new [Fulfillment](https://news.gamestop.com/news-releases/news-release-details/gamestop-expands-fulfillment-network-new-facility-york) center\n\nRyan Cohen buys in August, wrights a letter in November and in less than 6 months he has\n\n\\-erased long term debt (outside of leases)\n\n\\-raised over 500million dollars\n\n\\-Remade upper management\n\n\\-Started the process of opening a fulfillment center for the east coast\n\n\\-Added NFT and Blockchain to the Pipeline\n\nOrginal Post on reverse merger( POsted 3 weeks ago)\n\n[https://www.reddit.com/r/Superstonk/comments/n7bv2h/ryan\\_cohens\\_kill\\_shotthe\\_reverse\\_merger/](https://www.reddit.com/r/Superstonk/comments/n7bv2h/ryan_cohens_kill_shotthe_reverse_merger/)",
    "title": "Tombstone Tweet Confirms Reverse Merger? Reposted Reverse Merger DD",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nnmb4c/tombstone_tweet_confirms_reverse_merger_reposted/"
}