{
    "author": "anonfthehfs",
    "created_utc": 1621608534.0,
    "distinguished": null,
    "edited": 1621628679.0,
    "id": "nhub0p",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nhub0p",
    "num_comments": 1447,
    "permalink": "/r/Superstonk/comments/nhub0p/gamestop_gme_is_the_worst_kept_secret_on_wall/",
    "score": 19909,
    "selftext": "# \n\nhttps://preview.redd.it/uvemtuigzh071.jpg?width=602&format=pjpg&auto=webp&s=ee715ba75723759d9cc8179e80a30e2d5d010051\n\n# \n\n# Apes,\n\nJust thought I'd share what I have been suspecting all along.   GameStop has become a huge problem!!  Not a tiny little annoying problem, no no.  This is becoming a thorn in the side of the biggest players on the market.  The higher ups thought retail would just tuck their tails between their legs after they coordinated a stoppage back in Jan.  Dumb money would just take their licks and go back to life as usual.\n\n&#x200B;\n\n**Guess what Apes, you fucked up their plan.  They were praying all this would just go away and it would be business as usual.  Fuck people.  They have been literally rewriting the fucking RULES because they can't ignore this problem anymore!  The system is getting exposed.  Short selling has been going on for years and nobody really cared.   A little slight manipulation.  Everyone does it.  That's just how the industry works.....everyone just cheats a little and if you get caught, they slap a fine on you.  Business as usual.**\n\n&#x200B;\n\n&#x200B;\n\nI spoke with some people across multiple industries just friendly catching up type shit since I know what they do.   All them said, \"You know I can't talk about that\" and I respect that.  Every single one of them when I asked, are you at least aware the GameStop situation, every SINGLE one just said a version of, \"yeah what a fucking mess\".  **EDIT:  Mods if you want to contact me, I'm happy to speak to you.  I'm taking out the part of the user to reported me because I wouldn't give up my friends names to a rabid pack of HFs lurkers, SEC lurkers, and rabid Apes.  His comment is still up but I'll not Dox him even though it's a dick move on his part.**\n\n**Edit 2:  I just wrote** u/redchessqueen99 **since we have spoken before and she can let me know what she would like from me.**\n\n**Edit 3:  For anyone asking, they didn't give me anything.  They literally can't talk about this stuff with people.  All I got was a lot of we can't talk about that but what a shit show.  SEC-  If you are reading this, I would argue if you ask any single person in the world who understands a tiny bit about stocks; they know something is off with GameStop.  Doesn't matter which side of the aisle, whether you are a bear or a bull on GME.....everyone knows something funky is going on with GameStop.  Maybe you guys should be looking at some Market Makers instead of retail.**\n\n&#x200B;\n\n&#x200B;\n\nPicture this.  There is a watertight sealed room with a couple different pipes of water going into it.  A couple people fighting over control levers.  Let's say DTCC is on a HUGE pipe.  You have multiple Short Hedge Funds (SHF) controlling a ton of levers.  Then you have another couple of major institutional players on a couple more levers.  Everyone is having this water fight over control of this room and the water level keeps rising each an everyday.  As the water level rises the stakes go up.  You don't want to drown in this room.  Something has to give.  Enter Apes.   Apes are the slow sprinkler system overhead that has been running the whole time.  In the beginning it was just a nuisance but it just keeps coming raising the water level slowly.  The DTCC has been trying to figure out a way to get control of these SHF's levers so they get out of the room with minimum damages to themselves.  The shorts got greedy and somehow chained their leg to their lever.   They would rather drown everyone than lose.  The Apes will just continue raining down raising the water level until someone releases the floodgate to Tendytown.  Apes can't control the movement of water but they can keep buying which raises the water level.\n\n&#x200B;\n\n&#x200B;\n\nThe DTCC is just trying to protect their own asses and has been for months.  They know the problem and are actively letting SHF's (Short Hedge Funds) operate in survival mode so they can get their rules double, triple, quadrupled checked to make sure they will protect themselves/existing members against having to payout the fraud which they allowed.  There are no shares of GameStop to be had anymore, they are all in the hands of Apes by now.  Apes just keep raising that water level each week.  **There are literally millions more shares just on the options market than exist in the float, then if you start calculating all the OTM options, along with the institutional ownership and just guess the Apes shares........this is a fucking nightmare to them.**\n\n&#x200B;\n\n&#x200B;\n\nThey popped the ball we were playing with right when we were going to get rich in Jan.    It was going to blow up the entire system.  It was all a rigged game and we exploited a weak point in it.  So they turned off the game because they aren't allowed to lose money.  We are, that is how they stay rich.  The bleed off the world because financial stuff is overly complicated on purpose so people don't pay attention to it themselves.  I know I didn't for years.   I just quietly dumped money into a 401k and Roth.  Millions of regular Americans do the same thing.  We give these Banks, Institutions, etc access to our hard earned money then they 8x leverage themselves with our money in hopes they make fat bonuses in the short term.  If it doesn't work out.  They will just blow everything up and get a bail out.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**So they NEED to figure out a way to quietly get out of this but the problem is too many eyes are on it now.  The world is paying attention.  The longer this goes, the more attention time people have to research and look for information.  They are going to see the shady shit the DTCC and SEC let slide all the time.   They are going to ask for answers.  They are going to learn to vote out the politicians who back this system.  They are going to start electing ones who will stand up for the little guys.  They are going to bring more regulation the longer this goes.**\n\n&#x200B;\n\n&#x200B;\n\n# TLDR:  The longer this plays out the more we learn about this corrupt system.   Naked short selling is the worst kept secret on Wall Street and everyone knows what is going on.  The longer they keep kicking the can down the road, the more attention this is going to bring and people are starting to get informed.  They are starting to lose the ability to control the narrative through the media.\n\n&#x200B;\n\n&#x200B;\n\nSee ya on the moon Apes!!\n\n# 🚀                                                                                             🚀\n\nhttps://preview.redd.it/upoxpmo2lh071.png?width=120&format=png&auto=webp&s=3a1d076afda5cb0a4bc82e21963513c897dc103a",
    "title": "GameStop (GME) is the worst kept secret on Wall Street with blatant market manipulation in plain sight. I've been asking around to my banking/industry friends. EVERYONE knows this is a fucking mess. The DTCC, SEC, FINRA, HF's, Institutions, Banks, and slowly the public is learning the truth!!!!",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhub0p/gamestop_gme_is_the_worst_kept_secret_on_wall/"
}