{
    "author": "WeaselStink",
    "created_utc": 1621648146.0,
    "distinguished": null,
    "edited": 1621767635.0,
    "id": "ni83i9",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ni83i9",
    "num_comments": 367,
    "permalink": "/r/Superstonk/comments/ni83i9/moass_is_now_too_big_to_fail_many_bananas/",
    "score": 4474,
    "selftext": "**People all over the WORLD have made the MOASS too big to fail.**\n\nThink about it, we have 300k diamond handed apes from everywhere just in SuperStonk. You got more over in /r/GME, retards from /r/wallstreetbets and it's many derivatives, /r/finance (whatever they go by), more from /r/stocks, /r/options and even /r/gme_meltdown. This is just on Reddit and I know I missed a bunch.\n\nLet's look outward. /BIZ/NESSMEN over on 4chan, Ants from Korea, Wallaby's in Australia (I made that up). Who knows where or how many other platforms there are that are carry the same diamond hand philosophy? That share that oh so sweet bias confirming DD?\n\nIf this were a US only problem, much greater levels of fuckery could potentially happen. But it's not....\n\n\n**At least one foreign government has already included references to what's happening in annual financial reports:**\n\nhttps://www.ecb.europa.eu/pub/financial-stability/fsr/html/ecb.fsr202105~757f727fe4.en.html#toc19\n\nI did not find that, it was posted yesterday and forgot who OP was. OP also posted a US financial report that contained references as well. ~~Sorry I don't remember your name, but awesome job!~~ Credit: /u/StrifeLover\n\nI'm sure there are even more to be found, but not everyone is interested in digging through foreign government's annual financial reports looking for mentions. Mass media damn sure isn't going broadcast any real coverage of how fucked the market is right now.\n\nIf news like that got out on even one media outlet, it would cause a cascading panic selloff and launch the MOASS and likely end in economic tragedy.\n\n**Wen fuckery?**\n\nThere are multiple avenues of fuckery that could be taken, some we can't even imagine. The douchecanoes on wall street have made careers out of screwing over the retail investor, and built firms doing just that.\n\nOne group of them got so good at it, they are now a bonafide market maker and control over 40% of retail trades. Gotta love PFOF (Fuck you very much, Bernie Madoff).\n\nI firmly believe that there are no real shares left. The only shares that are being sold have already been rehypothecated, and continue to be. Do I have proof? Fuck no. Only people inside the system know for sure. All the DD posted here seems to point to it though.\n\nRight now, all eyes are on the shorts. Rules and changes in policy written and passed in record time. Updated haircut procedures. Huge changes to collateral requirements. Surprise liquidity tests.... The powers that be know it's coming and they're getting ready.\n\nThe shorts are just going to keep at it until it's impossible to kick the can down the road any further. You technically haven't lost if you break the entire game. When they go down, they want to take everything with them.\n\nThe fuckery is happening now, and it's aimed everywhere.\n\n**How many banana?**\n\nAll of them. You know why?\n\nThe longs on wall street want it to happen too. Think about it.\n\nNot that many bananas are going to be leaving wall street. Shuffled around, yes. But still there.\n\nThat money is going to be in the hands of your brokers before it ever gets anywhere close to your bank account. Even then, how much did you plan to reinvest after the MOASS? Were you going to buy the dip afterward? Hello DOMO.\n\nAfter a while, it'll start getting transferred to the banks. Then the banks will be flush with cash once again, and this time not from a printer that kept going Brrr. Good news is good.\n\nUncle Sam will get his 40% cut, and he is going to need every single bit of it. I would not be at all surprised if the IRS issued special early file requirements for apes that ended up over a certain amount of bananas.\n\nI really hope they do, I'd be happy to cut that check. I'll hand deliver it in my lambo if they want.\n\nBunch of apes that have been broke all their lives will be going out and spending bananas. Charities will thrive and Local business will love it too.\n\nIt's actually an economic rescue plan.\n\n**The Fate of the Shorts....**\n\nOne angle I haven't seen presented too often is just how bad Citadel, Susquehanna and all the others on the short side of things have fucked up. The rules for every participant on wall street are going to change because they got too greedy.\n\nIt's not just going to put those shorting firms out of business, there will be individual players that get blacklisted from the market entirely. The long Wall Street titans aren't going to take very kindly to the shorts due to it ruining the easy money game for everyone that ever played it.\n\nThey could have ended this shit in January, instead they will end up getting liquidated and absorbed. Then a nice big spanking by the now fewer and bigger players that will continue to remain on Wall Street.\n\n**Who ends up in jail?**\n\nProsecution wise, man that's anyone's call. This is a bit different than 2008, all the big the players were in on that crash. Bank wise, they might all be on this one too. I dunno.\n\nThis time though, there is an identifiable section of wall street that participated. There is an actual group that a finger can be pointed at. People are still pissed about 2008, and some of them ended up in congress.\n\nThere could be some actual incarceration this time. But I'm not gonna hold my breath.\n\n**TLDR.** \n\nBuy, HODL, vote. Diamond Hands are world wide. Fuckery is now. Win all the bananas. Shorts gon' get spanked and hopefully incarcerated.",
    "title": "MOASS is now too big to fail. Many bananas.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ni83i9/moass_is_now_too_big_to_fail_many_bananas/"
}