{
    "author": "midwestmiller",
    "created_utc": 1621612979.0,
    "distinguished": null,
    "edited": false,
    "id": "nhw1qq",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nhw1qq",
    "num_comments": 516,
    "permalink": "/r/Superstonk/comments/nhw1qq/the_only_reason_the_dtcc_and_co_are_making_rule/",
    "score": 8021,
    "selftext": "1929 market crash, 1987 Black Monday, 2001 dotcom bubble and 2008 housing market crash. (Speculation here but another housing crash is most likely going to happen once people can start getting evicted for not paying when the covid eviction restrictions expire.)\n\nWallstreet hasn't changed, when there is another crash, there will be a bailout (again), high ranking CEOs will get fat bonuses (again) and no one will go to jail (again). And really, who can blame them? The SEC hands out trivial fines that are essentially bribes. Wallstreet is happy, SEC is happy, the Fed, in general, is happy and the tax payers get pushed further into a serf class. It was all good in the hood until apes got involved. Now, those high ranking CEOs might actually have to answer to someone as all that money is going to people that aren't in the club and will be used to help people instead of hoarded away.\n\nI've seen a small amount of people say that POTUS and his administration are with us. They aren't, they don't give one solitary fuck about any of us. Actions speak a hell of a lot louder than words. We're up to, what, 6 trillion in \"covid relief\"? Where's that money going?  Not out to the people racking up debt in these trying times. They could give everyone in the US roughly $20,000 with what they've spent. I know I (and millions of families) could've used that to get some medical bills, car loans and credit cards paid off to cut down on some of my monthly bills.\n\nIf you want more proof, the DTCC is putting in all these rules to ultimately do what? To make sure the Fed isn't the one holding the bag and can retain some amount of power. No one knows more than the government that money is power. The last thing they want are hundreds of thousands if not millions of people being able to have the means to go do whatever the fuck they want while telling those in power to go fuck themselves sideways. No one actually wants this to happen as it completely upends and destroys the power structure in place.\n\nThe only time you will see meaningful action on something is when the pain of consequence is greater than the pain of change. There must be waaaay more going on behind the scenes for the DTCC to be acting with a swiftness like it is. To quote Neil Patrick Harris \"It's afraid!\"\n\nThis is the one chance to actually get some accountability for this mess they've made and I'm holding until someone goes to jail for this shit show.\n\nPower to the players. Profits to the people",
    "title": "The only reason the DTCC and co. are making rule changes is because apes are getting profits this time.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhw1qq/the_only_reason_the_dtcc_and_co_are_making_rule/"
}