{
    "author": "DredgenWard",
    "created_utc": 1622847052.0,
    "distinguished": null,
    "edited": 1622864946.0,
    "id": "nshp4y",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nshp4y",
    "num_comments": 140,
    "permalink": "/r/Superstonk/comments/nshp4y/the_eddie_murphy_rule_a_gary_gensler_doddfrank/",
    "score": 1178,
    "selftext": "I have been pretty neck deep in researching the history of the stock market, computing, and a series of other rabbit holes of learning that all stem from GameStop.\n\nI've tried to post earlier drafts of this a few times but have been slaughtered by the automod filter due to some of the topics so it's been a bit tough trying to post this.\n\nIn my researching government documents and re-watching the matrix , I believe I found a little Dodd-Frank legal Oopies the Shorting hedge funds seem to have violated in their shenanigans and goings on in the global economy.\n\n&#x200B;\n\nI haven’t heard anyone talking about so I figured I would make a post as it feels like it deserves one by itself.\n\n[Me after reading Dodd-Frank Section 746](https://i.redd.it/zvwa34bqfb371.gif)\n\nThis is Dodd-Frank, it was good for Retail.\n\n[https://www.govinfo.gov/content/pkg/PLAW-111publ203/pdf/PLAW-111publ203.pdf](https://www.govinfo.gov/content/pkg/PLAW-111publ203/pdf/PLAW-111publ203.pdf)\n\n&#x200B;\n\nGary Gensler, SEC Chair extraordinaire, had a role in pushing through Dodd-Frank into law, and more specifically something called the Eddie Murphy Rule.\n\nSection 746 in the Dodd-Frank Act to be even more specific.\n\n&#x200B;\n\nNow you're probably thinking what the fuck does Eddie Murphy, Gary Gensler, The Fed, Citadel Securities, and GameStop have to do with each other?\n\nThe answer... is the Eddie Murphy film Trading Places.\n\n&#x200B;\n\nhttps://preview.redd.it/gck4q7mfvb371.jpg?width=338&format=pjpg&auto=webp&s=a2743812ba1366e5fe7afefd706355864844f129\n\nhttps://preview.redd.it/5nwe2bhvfb371.png?width=733&format=png&auto=webp&s=3d1e481eda053330887ef88f09ff7d7aa887f061\n\nLet's see how another source covered the Dodd-Frank addition at the time...see if we can gleam ~~Bezos's~~ opinion on it via what wsj has to say...\n\n(Honestly I was thinking about that send my regards puppet masters tweet Elon made a while back and Mixed up Bezos with Rupert Murdoch...\n\n> The Wall Street Journal is controlled by **Rupert Murdoch** via Dow Jones Publications, which in turn is owned by **Murdoch's** News Corp. It published its first issue on July 8, 1889, under original publishers Charles Dow, Charles Bergstresser, and Edward Jones. \n\n&#x200B;\n\nhttps://preview.redd.it/i15z0vy5gb371.png?width=720&format=png&auto=webp&s=45b1a9cc012abcb4338013b9cb9d4f4254481701\n\nThat's a super weird way to end an article about a legitimate concern...I legit am also concerned about children creating grown adult women to bang in the burbs so yeah regulates that too wsj. wtf.\n\nHow about we take a moment to instead look at the actual Eddie Murphy Rule itself and see if we can see what would upset the WSJ and Bezos so much...\n\n# Dodd-Frank Sec. 746. INSIDER TRADING\n\n>Section 4c(a) of the Commodity Exchange Act (7 U.S.C. 6c(a)) is amended by adding at the end the following:  \n>  \n>‘‘(3) CONTRACT OF SALE.—**It shall be unlawful for any employee or agent of any department or agency of the Federal Government who, by virtue of the employment or position of the employee or agent, acquires information that may affect or tend to affect the price of any commodity in interstate commerce, or for future delivery, or any swap, and which information has not been disseminated by the department or agency of the Federal Government holding or creating the information in a manner which makes it generally available to the trading public, or disclosed in a criminal, civil, or  administrative hearing, or in a congressional, administrative, or Government Accountability Office report, hearing, audit, or investigation, to use the information in his personal capacity and for personal gain to enter into, or offer to enter into—**  \n>  \n>‘‘(A) a **contract of sale of a commodity for future delivery** (or option on such a contract);  \n>  \n>‘‘(B) **an option** (other than an option executed or traded on a national securities exchange registered pursuant to section 6(a) of the Securities Exchange Act of 1934 (15 U.S.C. 78f(a)); or  \n>  \n>‘‘(C) **a swap**\n\n&#x200B;\n\nInsider Trading specifically commodities based the acquisition of information from the Government that is not publicly known and may impact the price of said commodities.\n\n&#x200B;\n\n>(4) NONPUBLIC INFORMATION.—  \n>  \n>‘‘(A) IMPARTING OF NONPUBLIC INFORMATION.—It shall be unlawful for any employee or agent of any department or agency of the Federal Government who, by virtue of the employment or position of the employee or agent, acquires information that may affect or tend to affect the price of any commodity in interstate commerce, or for future delivery, or any swap, and which information has not been disseminated by the department or agency of the Federal Government holding or creating the information in a manner which makes it generally available to the trading public, or disclosed in a criminal, civil, or administrative hearing, or in a congressional, administrative, or Government Accountability Office report, hearing, audit, or investigation, to impart the information in his personal capacity and for personal gain with intent to assist another person, directly or indirectly, to use the information to enter into, or offer to enter into—  \n>  \n>‘‘(i) a contract of sale of a commodity for future delivery (or option on such a contract);  \n>  \n>‘‘(ii) an option (other than an option executed or traded on a national securities exchange registered pursuant to section 6(a) of the Securities Exchange Act of 1934 (15 U.S.C. 78f(a)); or  \n>  \n>‘‘(iii) a swap.\n\n&#x200B;\n\nHmmm....insider trading based upon government info not known to the public...and they can't skirt this by giving the info to another party to trade on their behalf as well.\n\n&#x200B;\n\n>‘‘(B) KNOWING USE.—It shall be unlawful for any person who receives information imparted by any employee or agent of any department or agency of the Federal Government as described in subparagraph (A) to knowingly use such information to enter into, or offer to enter into—  \n>  \n>‘‘(i) a contract of sale of a commodity for future delivery (or option on such a contract);  \n>  \n>‘‘(ii) an option (other than an option executed or traded on a national securities exchange registered pursuant to section 6(a) of the Securities Exchange Act of 1934 (15 U.S.C. 78f(a)); or  \n>  \n>‘‘(iii) a swap.  \n>  \n>‘‘(C) THEFT OF NONPUBLIC INFORMATION.—It shall be unlawful for any person to steal, convert, or misappropriate, by any means whatsoever, information held or created by any department or agency of the Federal Government that may affect or tend to affect the price of any commodity in interstate commerce, or for future delivery, or any swap, where such person knows, or acts in reckless disregard of the fact, that such information has not been disseminated by the department or agency of the Federal Government  holding or creating the information in a manner which makes it generally available to the trading public, or disclosed in a criminal, civil, or administrative hearing, or in a congressional, administrative, or Government Accountability Office report, hearing, audit, or investigation, and to use such information, or to impart such information with the intent to assist another person, directly or indirectly, to use such information to enter into, or offer to enter into—  \n>  \n>‘‘(i) a contract of sale of a commodity for future delivery (or option on such a contract);  \n>  \n>‘‘(ii) an option (other than an option executed or traded on a national securities exchange registered pursuant to section 6(a) of the Securities Exchange Act of 1934 (15 U.S.C. 78f(a)); or  \n>  \n>‘‘(iii) a swap, provided, however, that nothing in this subparagraph shall preclude a person that has provided information concerning, or generated by, the person, its operations or activities, to any employee or agent of any department or agency of the Federal Government, voluntarily or as required by law, from using such information to enter into, or offer to enter into, a contract of sale, option, or swap described in clauses (i), (ii), or (iii).’’.\n\nSo here we have a sweeping list of Dodd-Frank essentially outlining all the ways the scheme worked in the movie Trading Places.\n\nWell here's were I'm a bit perplexed. At the end it seems to say while we have made all this shit illegal with this provision to Dodd-Frank there's still nothing to prevent anyone from actually doing any of this in actuality.\n\n# So where does Shitadel fit into this all?\n\n&#x200B;\n\n[ https:\\/\\/www.ft.com\\/content\\/47912e56-ab4b-11e6-ba7d-76378e4fef24 ](https://preview.redd.it/k1a3yktwgb371.png?width=731&format=png&auto=webp&s=37514cfd4a6af3a07d751db42dd4243343fceedc)\n\n&#x200B;\n\nI know you're asking now if only there was some kind of weird shift in Citadel Securities years ago that seems to imply that the shorting of the bond market was tied to insider information from the Fed regarding the market post 2008...\n\nNow why does this even matter. This is a GameStop subreddit, and we're talking commodities here, get this bond shit out of here you're probably thinking.\n\nI believe this is a missing puzzle piece to what House of Cards, The Everything Short, and other amazing DD from Apes have uncovered thus far.\n\n&#x200B;\n\nhttps://preview.redd.it/qtscl92ahb371.png?width=1180&format=png&auto=webp&s=e20287406aedcc961ceae935ea97906c53e13eda\n\nEarly in December of 2020 Citadel Securities then announces it's rolling out a new product for the bond market that it tied to the yield on 10-year notes.\n\nThis smaller exchange is retail focused, but there is absolutely nothing about it that limits it to Retail or smaller accounts...\n\n&#x200B;\n\nhttps://preview.redd.it/q7pbktobhb371.png?width=647&format=png&auto=webp&s=59a7ca18556f4da431d9384a02cf79a93ad31a05\n\nThis is the first time a future's been launched in yield versus price terms...it's cheaper for average people to enter...It explodes in the start of the Pandemic...anonymous buying and selling...sells computerization and removal of regulatory standards as a selling aspect...they consider it to be a betting site...\n\nLet me take one little guess what kind of small exchanges we're talking about here.\n\nLet's see a name for something that rips off the retail investor...\n\n&#x200B;\n\nhttps://preview.redd.it/dpxu158dhb371.png?width=819&format=png&auto=webp&s=65d3663908a8be8e2d96bc2bf2579dc7e31c5742\n\nNot be be that guy, but Robinhood is that actually accurate?\n\nbecause I will argue that they are involved in the manipulation of their market due exploiting the legal gray area of selling it on their app. You don't own wallets on there. Therefore the customer is not technically a true owner with the ability to sell or buy gatekept by Robinhood. More on that later.\n\nWithout even going into what I'm about to lay out, by having a majority of the wall street facing investing market monopolized they have both the means and ability to manipulate the futures will go because of it.\n\nTheir position in the pandemic also gave them prior knowledge of stimulus which like the rest of the financial system I'm sure you're notices the article about how you could have made more money by dumping your checks into chasing a dog would have made you less than what buying more GME would have.\n\nWhat's the CTFC advisory you're pointing to you're probably wondering, and why Robinhood as anything to do with GME when we're talking about securities.\n\nWell...\n\n&#x200B;\n\nhttps://preview.redd.it/y485n73jrb371.png?width=661&format=png&auto=webp&s=fd56c116a05e1e8ed6914dc09bcac55750186605\n\nFurthmore, here's a public statement from the SEC speaking directly on this matter.\n\nhttps://preview.redd.it/q7kpd0saub371.png?width=597&format=png&auto=webp&s=2b182cdf3b11a45894667de2c91f8ed4daa6ae0f\n\nHey Robinhood, Dodd-Frank's Eddie Murphy Rule says commodities futures markets do fall under regulations. Just because you package them as a securities product doesn't mean they are.\n\nHey Shitadel, I'd wager when it comes to options contacts you'd be the ones shitting those out.\n\nI found this nice little explanation of the caveats of Robinhood's system.\n\n&#x200B;\n\nhttps://preview.redd.it/rzg7p7ckrb371.png?width=771&format=png&auto=webp&s=07fc6a90e463eba57229ad015fe70906fa0bad18\n\nNo shit they lie and violate their own fine print. It took one click to the CTFC link below it to find an instance of it.\n\nSo here's where Citadel's little small bond exchange comes in handy and becomes curious on its growth and the timing of the pandemic as the starting point.\n\nSo first off let's begin with some TIPS\n\n# Treasury Inflation-Protected Securities.\n\nWhat Are Treasury Inflation-Protected Securities (T.I.P.S.)?\n\n>Treasury inflation-protected securities (T.I.P.S.) are a type of Treasury security issued by the U.S. government. TIPS are indexed to inflation in order to protect investors from a decline in the purchasing power of their money. As inflation rises, TIPS adjust in price to maintain its real value.\n\nHere's were it starts getting fun.\n\n>T.I.P.S. are issued with **maturities of five, 10, and 30 years** and are considered a low-risk investment because the U.S. government backs them. At maturity, TIPs return the adjusted principal or the original principal, whichever is greater. **T.I.P.S. can be purchased directly from the government through the Treasury-direct system**, in $100 increments with a minimum investment of $100, and are available with 5-, 10-, and 30-year maturities. **Some investors prefer to get T.I.P.S. through** a T.I.P.S. mutual fund or **exchange-traded fund (ETF)**. Purchasing T.I.P.S. directly, however, allows investors to avoid the management fees associated with mutual funds.\n\nSO T.I.P.S. are another for of Treasury Bond you can get government direct, and you can also acquire them via ETFs and Mutual Funds.\n\nI wonder what stock is dealing with a slew of ETF's being shorted. This is where I need smarter apes to assist me. If shorting those ETF's is leading to a reaction in the underlying TIPS then we should have seen some glitches in the matrix so to speak.\n\nLet's continue...\n\nI was hit with the question of can you find any correlations between the bond market and Robinhood, and found something pretty interesting. Someone else noticed a T.I.P.S. correlation that saved me the time of locating the data. (Apes to help verify would be appreciated)\n\n&#x200B;\n\nhttps://preview.redd.it/ilxswfnlrb371.png?width=625&format=png&auto=webp&s=c0b26e28848604e88f0c0360638b8df958cfbe98\n\nSo it does really well when Treasury Bond Interest Yield rate is high but are dropping. It does poorly when Interest rates are low and rising. When Interest peaks, discount mode kicks in and now it suddenly begins to do worse driving investors to see value in jumping to one or the other.\n\nThere seems to be a predatory nature to these controlled supply and demand if you ask me as Citadel and Hedge Funds monopolize both markets with the Bank buddies.\n\nHere's a fun graph of the two plotted against each other.\n\n&#x200B;\n\nhttps://preview.redd.it/0765pp5qrb371.png?width=640&format=png&auto=webp&s=c1a8cbc4f8dfcba258b6c774a738a01e0c4b82b3\n\nWonder what happened in January...oh yeah...GameStop.\n\n&#x200B;\n\nhttps://preview.redd.it/jnaht17rrb371.png?width=610&format=png&auto=webp&s=7f3757004732aaa51b8c0f41ee5f34a176c79963\n\nThis bit of an article tickled me. Bank of America is literally the fucking source here.\n\nBanks use it for payments. They're who is disagreeing with J Powell here. The CTFC classifies it as a Commodity for the exact same reason.\n\nNormal People use USD because the IRS doesn't let you pay taxes with it yet. Buying normal shit creates a hassle and normal people don't have time for that shit when filing taxes are annoying enough. You'd convert to USD first then buy shit and most exchanges people buy on don't let you use it anywhere else.\n\nThe part to notice is J Powell doesn't think of it as money, because it's not and he runs the Fed so he should know.\n\nIt's a commodity in the eyes of the SEC according to the CFTC. (edited the word to please the automod you all know the word I mean)\n\n>The CFTC has designated biconnect as a commodity.  Fraud and manipulation involving bicon nect traded in interstate commerce are appropriately within the purview of the CFTC, as is the regulation of commodity futures tied directly to biconnect.  That said, **products linked to the value of underlying digital assets, including biconnect and other biconnectcurrencies, may be structured as securities products subject to registration under the Securities Act of 1933 or the Investment Company Act of 1940.**  \n>  \n>[https://www.sec.gov/news/public-statement/statement-clayton-2017-12-11](https://www.sec.gov/news/public-statement/statement-clayton-2017-12-11)\n\nShit I mean it's also a securities product sometimes...dang it. Going to need some help with sorting this out. Let's see...Oh yeah.\n\n# What's the DoJ been up to...\n\nLet's check in with them shall we...oh...they already unveiled their Enforcement Framework...\n\n&#x200B;\n\nhttps://preview.redd.it/bsrpgvjsrb371.png?width=662&format=png&auto=webp&s=597db7949ec4a6584504b83ce6d8ef244103d42e\n\nWhat's some more recent news...or IRS and DoJ are looking for fraud in exchanges....\n\n[https://www.coindesk.com/doj-irs-investigating-crypto-exchange-binance-report](https://www.coindesk.com/doj-irs-investigating-crypto-exchange-binance-report)\n\nweird.... exchange getting looked at...what's the BSA again?\n\n>The **Bank Secrecy Act** (BSA) is U.S. **legislation** aimed toward preventing criminals from using financial institutions to hide or launder money. The law requires financial institutions to provide documentation to regulators whenever their clients deal with **suspicious cash transactions involving sums over $10,000.**\n\n10k huh?\n\n&#x200B;\n\nhttps://preview.redd.it/v1jhnbntrb371.png?width=803&format=png&auto=webp&s=19b9ad28eeda301c39ba39dbb678794fb854a416\n\nWell tickled me fucked Ken...that's $10,000...on the surface it seem to be the DoJ is finally applying the same regulatory standards of the BSA onto the markets where...Banks own a majority of it...\n\nNo wonder it's been fucked.\n\n&#x200B;\n\nWhile Citadel is already profiting off of insider information on the Bond Market...The pandemic hits, and they receive insider information before hand that they global economy will tank...\n\nKenny comes up with this brilliant idea he got from the movie Trading Places...\n\nKenny and his buddies will Short anything Brick and Mortar based off of insider knowledge that the Pandemic will impact the future of the market and use control of the securities and commodities markets to juggle liquidity to syphon even more of the relief money out of the hands of the American People via a gamified app that eliminates most of the information indicating risks and limits user's ability to perform certain actions in the market, aka shorting.\n\nThey eventually decide to go all in on a gaming retailer called GameStop once they've ammased what they feel is a healthy chunk of the demographic in their app who would invest in the ticker.\n\nUsing the liquidity from their first scam to fund the second scam and drive GME to the ground along with the entire fucking market.\n\nThey can control Treasury bond interest yields through this fucked up system it would appear and strangle the market to drive investors where they want them to be unknowingly via naked shorting. I believe this may be what connects the whole shitstorm together.\n\n&#x200B;\n\nhttps://preview.redd.it/csurecxurb371.png?width=321&format=png&auto=webp&s=e7744aff19a8cfd848f89a83fa43bb454662e214\n\n>He added that the “significant credibility” offered by becoming a primary dealer was also attractive as the company continues to expand. **Primary dealer status is often said to be integral to trade with some of the largest central banks and asset managers around the world**. **The rule changes published by the New York Fed on November 9 include a reduction in the minimum net regulatory capital broker-dealers are required to hold, down from $150m to $50m.**\n\nSo Ken walks up and says...\n\n&#x200B;\n\nhttps://preview.redd.it/j03djeg4sb371.png?width=500&format=png&auto=webp&s=cd4908557e50b2d88c738c012f70456a7ec2e915\n\nhttps://preview.redd.it/se6z5lw4sb371.png?width=618&format=png&auto=webp&s=7e4b66573acaecf654770d2e404320d9190b2ed3\n\n&#x200B;\n\n>‘‘(A) a **contract of sale of a commodity for future delivery** (or option on such a contract);\n\nYikes Kenny...deep fucking yikes.\n\n&#x200B;\n\n*Cue Beverly Hills Cop theme.*\n\n*Laughs in Eddie Murphy.*\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**TL;DR:** Before Gary Gensler left during the last crash in 2008 that he helped us get back on our feet from, he successfully managed to get a provision added to the Dodd-Frank Act that made the same type of Futures Commodities Markets via insider information and market manipulation illegal.\n\nThe Eddie Murphy Rule also states that despite it being illegal, there currently isn't other laws in place to prevent them from entering into this enormous fuck up in the first place.\n\nRobinhood's risk disclosure doesn't accurately represent the truth of regulatory authority over an exchange they market as a securities exchange. The lack of wallets and actual customer ownership implies that customers on their platform do not actually have any true influence over the market.\n\nThat influence is controlled by Robinhood who ultimately has ownership over what to do with the  commodities being traded themselves. PFOF I would posit is straight up illegal for a commodity with this set up as Robinhood always has full control over the entire actual market on the platform since again, there are no wallets so no actual customer ownership of the underlying commodities.\n\nI argue that there is absolutely no difference between that and a typical commodities futures market so the regulations and laws set forth in Dodd-Frank, Section 746 INSIDER TRADING more well known as the Eddie Murphy Rule.\n\nKnowledge of prior economic events and using that information to Short stocks and drive their investors into other areas of the market monopolized by Citadel Securities and Robinhood where pump and dumps are used as cheap ways to lure younger generations into the markets and onto their platform more specifically.\n\nI believe this was method for luring younger less knowledgeable investors into the market (gamers) who are knows to be riskier investors and more willing to \"take a bet\" and are small whales of a sort willing to dump loads of cash into digital assets (in game purchases)\n\nI legitimately do not believe they had any fucking clue that gaming culture has evolved to regularly include the gamification of information sharing to efficiently leverage community numbers of those interested in a topic to pool their resources in an open forum to learn and improve from one another until the desired result is found.\n\nVault of Glass releasing for the first time in Destiny is one example where limited information was provided by the Developers (reporting source) and the community as a whole had to come together and share information to solve the puzzles or be stuck until they worked it out themselves. A choose your own level of learning and engagement situation just like we now have with GME.\n\nThis backfired beautifully on them.\n\nThe current push by the DoJ and the Fed to clamp down and aggressively peruse fraud and bad actors with new regulations such as the $10k transfers requiring taxes akin to the Banking Secrecy Act requires of cash assets to better track them and how they're used is a sign that the end is near.\n\nThe lights are turning on, and the DoJ is looking upon the shit show it's revealed.\n\nIf this is how they're powering any part of the scheme then I would argue that it opens up the path for investigators to have a way in to legally start looking and work from there out via the Eddie Murphy Rule's loophole that never prevented anyone from actually engaging in futures manipulation let alone at this scale.\n\nI think this shit storm is bigger than a lot of people believe so it makes sense that it required time to even begin sorting out before we can launch, and I haven't even gotten into the automated mortgage origination via one of the biggest lenders in the country aspect of this whole scheme and how that fits in.\n\nHODL.\n\nEdit: removed a duplicated sentence.\n\nThanks for all the support! I think I may have to try and write up a few follow ups this weekend after the response.\n\nI'll try to answer all the questions I can best I can as well. I have way more sources and information  since I raccoon links and quotes so I can usually try and expand further as needed and provide additional sources I used to lead me there.\n\nEdit 2: I references Jeff Bezos thinking I linked a Po article. That was uncalled for Jeff, and I'm sorry. I've updated to clarify. \n\nTurns out Rupert Murdoch owns it the WSJ.",
    "title": "The Eddie Murphy Rule: A Gary Gensler Dodd-Frank Provision that has Kenny G of Citadel Shittin'",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nshp4y/the_eddie_murphy_rule_a_gary_gensler_doddfrank/"
}