{
    "author": "atobitt",
    "created_utc": 1620854994.0,
    "distinguished": "moderator",
    "edited": 1620862495.0,
    "id": "nazyz3",
    "text_only": true,
    "flair_text": "🚀 Moderator 🚀",
    "name": "t3_nazyz3",
    "num_comments": 1841,
    "permalink": "/r/Superstonk/comments/nazyz3/shorts_must_cover/",
    "score": 26641,
    "selftext": "EDIT: To those of you coming from r/all, this is the video we're referring to. Its important. \n\nhttps://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA\n\n**Ok. Before the FUD gets out of hand.**\n\nIt was my fault for not directly asking if the short position in **GameStop** must be covered. \n\nHis answer was in response to the **HISTORY of shorts not having to cover.** This only happens when short sellers are able to drive the target company into the ground. I believe his full answer addressed this fact. This was MY fault for misguiding the question.  \n\nObviously, he talked for a very long time about the number of phantom shares that are circulating within the market. He also stated that GameStop is a prime example of this. \n\nPhantom shares resulted from hyper-shorting with the intent of driving GameStop into the ground. When retail investors refused to sell through the onslaught of market manipulation, it reversed the game in our favor. \n\nThere is a very high chance, as he stated, that the shareholder vote will reflect the presence of continuous short selling (naked & otherwise) because the problem is SO LARGE that even the \"back-office\" guys can't sort it out. \n\nHe also explained that the SEC has been turning a blind eye to these situations because they are RARELY over 100%. If we are correct, it will be much harder for them to sweep this under the rug. Finally, his outlook on the SEC's current leadership, especially Gary Gensler, is positive. \n\nThe perfect storm has arrived, **so please don't let a misguided question spoil the confirmation bias in that AMA!!**",
    "title": "Shorts MUST cover!",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/nazyz3/shorts_must_cover/"
}