{
    "author": "jsutajguauga",
    "created_utc": 1625507006.0,
    "distinguished": null,
    "edited": 1625577331.0,
    "id": "oecchp",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oecchp",
    "num_comments": 409,
    "permalink": "/r/Superstonk/comments/oecchp/dissecting_the_latest_fud_campaign_moass_will_not/",
    "score": 4200,
    "selftext": "In the last two days or so, I have noticed a sudden uptick in anti-MOASS sentiment. I wanted to take a little time to go through this latest FUD campaign. You probably saw different variations attached to low effort, stale memes like:\n\n&#x200B;\n\n>\"*MOASS is not a guarantee anymore you guys!!1!\"!!\"*\n\nMOASS is inevitable.\n\n&#x200B;\n\n>\"*If MOASS doesn't happen, GameStop is still a good long term investment you guys!1!\"!!!!\"*\n\nMOASS will happen AND Gamestop is a good long term investment.\n\n&#x200B;\n\n>\"*Ryan Cohen is leading us on!!11\"! How come there was no AnNNOunCemEnT on July 4th?!!?12?\"*\n\nRyan \"judge us by our actions, not words\" Cohen? get outta here...\n\n&#x200B;\n\n>*\"When I tell people about MOASS people tell me I'm crazyyyyy!!\"1!\"2 But I trust in the tweets of Cohen hHAhahHA!!1!\"* (as if there isn't a MOUNTAIN of verifiable DD)\n\nThe tweets are BULLISH, don't get me wrong, but its the DD that you should trust.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nSo lets put down a Timeline which will also function as a table of content:\n\n1. **Leadup Hype to July 4th**\n2. **\"Disappointment\" about no Announcement**\n3. **Aftermath and near full activation of shills**\n\n# 1. Leadup Hype to July 4th\n\n**Any further mention of \"we\" is used so I don't have to write a sentence to describe this subreddit, it got tiering after a while so here is the disclaimer <3**\n\nSo at this point I'm convinced that the Hype about the dividend was hijacked and amplified with very questionable theories and weird conviction of the validity of those theories.\n\nThey were setting up another emotional Pump and Dump. We have seen those countless times but this time they had a prepared menu of shit that they wanted to shove down our throats.\n\nOne of those things was to break our unshakable bond we have with Ryan \"Big Poppa\" Cohen.\n\nThey wanted us to believe that the July announcement was a forgone conclusion and \"THerE iS NO OtHerR OptIoN JusT loOk At HiS TWeeTS!1!! And GaMeStOp EMpLoyEe CONFIRMED IT\".\n\nThe Employee never mentioned a date, he just speculated about an incoming announcement.\n\nNot gonna lie, I was hyped, but not only because of the announcement. The thing is I'm ALWAYS hype and NEVER disappointed because I'm invested in the BEST COMPANY IN THE FUCKING WORLD.\n\nSo after they hyped the living SHIT out of this date which started with \"hey the 4th is a holiday so they will probably announce it july 1st or 2nd\" after nothing notable happened the distrust was slowly seeded in \"ohh yeah its CALENDAR DAYS its fine guuuysss on the 4th SURELY he has an announcement\"\n\nSo what happend after july 4th and there was no announcement? The stage was set and the shit was slowly cooking in the background.\n\n# 2. \"Disappointment\" about no Announcement\n\nRyan Cohen tweeted and beside that nothing notable happened. After I observed for a bit, I realized that Ryan was trying to reel us back in and at least acknowledge the narrative, so we aren't let down too much (which is impossible because we are invested in the BEST COMPANY IN THE FUCKING WORLD). After that rather uneventful July 4th the shills started creeping up again and the FUD kicked into next gear. We saw \"disappointed apes\" pop up suddenly and question if Ryans other tweets were \"just a ruse too, because look nothing happened here and we were PrOMisEd an announcement!1!1!!\". I also saw an uptick in general skepticism in almost every DD and data point we aggregated here at our beloved Superstonk. (\"WhAt ElsE waS I WroNg AbOUT?!?!\")\n\nIn the meantime we saw some weird shit go down in another corner of reddit and one thing caught my eye. After the \"joke\" was cleared up there was a sentence which said something to the effect of:\n\n*\"As we enter the second half of 2021, let this be a reminder to always read everything with a skeptical mind and to seek out as many different viewpoints as possible before jumping to conclusions. Be especially careful of confirmation bias and echo chambers.\"*\n\nHMMMMM sounds like someone wants people to be less trusting, and go to different places to get a different perspective. Was this subtle brigading bait? Or just a try to get more traffic to subreddits shills have more control over? Or maybe create a state of confusion so the july 4th will be harder to navigate because of all the stuff going on? When people encounter novel situations, they tend to be more careful and this was probably a try to create further confusion, or it was just a really shitty attempt at a joke haha good one guys so clever.\n\n# 3. Aftermath and near full activation of shills\n\nWhich brings us to today. Shills are in full swing and they come in different flavors.\n\n**The low level rude shill:**\n\nThis is the shill you are supposed to find, so you feel like a clever ape who has his guard up! You found them all right?! They want to give you a false sense of security, so you think you catched them all.\n\n**The suddenly concerned and distrusting shill:**\n\nThose are the \"MOASS is not guaranteed anymore guys! Look how many catalysts we had and nOtHiNg HaPpeNnD\", \"Ryan Cohen cant be trusted anymore!\", \"The DD is flawed guys! else we would have squoze already!!\", \"If Moass doesn't happen at least we have the long term growth potential of gamestop, RigHT gUyS?!\"\n\nThey will try to make people second guess the DD, they will try to make people second guess Ryan Cohens intentions. They want to make you \"Be especially careful of confirmation bias and echo chambers\".\n\n**The bait and switch shill:**\n\nThey will first lure you in with kind of good vibes and than slowly but surely link you to different subreddits with FUD, I've seen some people linking other subreddits WHICH IS BRIGADING AND IS STRICTLY AGAINST THE RULES.\n\nSome will try to make it seem that you can only invest in GME for one reason, either MOASS or Long-term (look up black or white fallacy). But I have multiple reasons and GameStop's fundamentals and MOASS complement each other which makes GME the best investment in our lifetime (in my humble opinion). This company with this Leadership is redefining what it means to run a company. It doesn't matter why you bought in or why you are holding, we all want to see GameStop succeed and shills do not want GameStop to succeed, that's the dividing line.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe list goes on some of these shills are just relentless because its their job to be that way. They will not stop spouting their bullshit, but at the end when you ask them for evidence or any coherent argument they will just deflect or call you stupid or link to another subreddit.\n\nI also noticed that it probably takes some time to organize those campaigns and sometimes when we throw them a curveball, they will most of the time just go ahead with it anyways. The anti-Ryan sentiment was one such thing. They really thought they could break this bond... silly shills.\n\nThey are SCARED, its obvious and everything they have left is playing with emotions. The DD is rock solid, the math was quintuple checked from every angle.\n\n**SHORTS. DID. NOT. COVER.**\n\n**MOASS. IS. INEVITABLE.**\n\nTrust your conviction, read the DD again if you want a refresher (I read the TL;DR because I don't last that long and PornHub just doesn't do it for me anymore).\n\nI just wanted to do this writeup to bring some clarity to the situation and because I cant sit still while my home is being attacked. So in that spirit, see you on the other side, I appreciate every single one of you <3\n\n# Power to the Players\n\n&#x200B;\n\nEDIT: Just wanted to emphasize the point some people make here. GameStop is an asymmetric bet with virtually no downside. Why? Because the fundamentals are so fucking good, that if you have a long time horizon this stock will 100% print money guaranteed. So there is next to NO RISK to buying and holding. I mentioned in the post that the MOASS is inevitable BECAUSE the fundamentals are so strong. Else there would be an expiry date to holding but with GME THERE IS NONE. Compare that with other stocks, which are shorted too, but just don't hold a candle to GameStop's fundamentals. GameStop is making a miracle turnaround, because of Ryan Cohens leadership. NO OTHER STOCK HAS THAT TURNAROUND STORY, ONLY GME. The reason the other stocks are shorted still apply. But GameStop is a completely different company from a year ago.\n\nWe cant lose, its impossible. This is not over I know, but they CANNOT WIN as long as we buy and hold which is infinitely easier when the fundamentals are as strong as GameStop's. The shills can talk shit all they want. But we all know these guys at least own a share, they all do. They just cant say it out loud, because they will get fired. The shorts only have a naked king, we have 6 pawns storming the board and about to become queens. Just keep pushing those pawns to victory baby!\n\n&#x200B;\n\n&#x200B;\n\nEDIT2: First thanks for the support and awards, I just woke up and I am glad that what I wrote resonated with so many people <3 second, after seeing the diamond handed comments, I'm in awe about all of you apes totally unfazed by the fud. To the newer apes who maybe needed a little encouragement, just watch what absolute beasts you have standing with you. Maybe I got caught up a bit too much in this FUD myself. You guys absolutely ROCK, If I wasn't ZEN enough you guys helped me reach it now. Its an honor to be surrounded by people like you. TO ALPHA CENTAURI AND BEYOND!",
    "title": "Dissecting the latest FUD campaign: \"MoAsS wiLL nOt HapPEn aNY MoaAARrrRR\"",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/oecchp/dissecting_the_latest_fud_campaign_moass_will_not/"
}