{
    "author": "Gambion",
    "created_utc": 1625475397.0,
    "distinguished": null,
    "edited": 1625500652.0,
    "id": "oe3806",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oe3806",
    "num_comments": 506,
    "permalink": "/r/Superstonk/comments/oe3806/im_baffled_at_the_people_who_dont_believe_in_the/",
    "score": 4820,
    "selftext": ">GameStop was going out of business and we have proof the stock was naked shorted with Finra stating a figure ~230%. It’s obvious that big institutions tried to maximize profits by betting, with A LOT of over leveraging, that GameStop would go bankrupt. \n\n>During the Jan-Feb run up we had mass collusion amongst clearing houses and brokerages cutting off buying with conflicting testimonies as to why; one live on air from Thomas Petterfy saying if GME went above $1,000 it would become a contagion event. \n\n>Almost exactly when the reported short interest dropped we had extremely sus options chain activity with an extreme amount of way OTM puts and ITM calls; a specific type of behavior that could be deployed to successfully hide short interest. \n\n>We’ve had quite a substantial amount of DTCC and NSCC regulatory filings passed in such a relatively short amount of time. \n\n>We’ve had mainstream media relentlessly post extremely biased and negative rhetoric in the face of very positive news for GameStop Corp. \n\n>There’s been heavy acceleration in collateral types with almost daily records in reverse repurchase agreements and massive sell offs in crypto.\n\n>Various ETFs that contain GME were heavily shorted along with the entire Russell 2000. \n\n>Glitches upon glitches upon glitches unique to GME. \n\nThese are just the examples I can think of off the top of my head. To me, it’s quite clear that large institutions who were and still are short on GME didn’t cover. It’s obvious because if they did, the cascade effect would have caused a contagion event as postulated by multiple sources and that hasn’t happened. From a game theoretical standpoint, the incentive for shorts in a massively losing position is to never cover and prolong the process so as to evade either losing big or complete liquidation. So why would you think that the ~230% short interest was successfully covered? \n\nKeep in mind, this isn’t even factoring in other macro-economical hypotheses of market wide problems which affect GME indirectly or all the evidence of buying pressure being suppressed. I mean for Christ sake, the president of the NYSE admitted that dark pools exclude ~70% of all investors and fucks with price discovery by breaking the relationship between supply and demand. Idk man, something something, if it quacks like a duck..",
    "title": "I’m baffled at the people who don’t believe in the short squeeze thesis when it’s such an Occam’s Razor",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oe3806/im_baffled_at_the_people_who_dont_believe_in_the/"
}