{
    "author": "Matador3364",
    "created_utc": 1627131411.0,
    "distinguished": null,
    "edited": 1627318713.0,
    "id": "oqpiha",
    "text_only": true,
    "flair_text": "Unreviewed 𝘋𝘋",
    "name": "t3_oqpiha",
    "num_comments": 185,
    "permalink": "/r/DDintoGME/comments/oqpiha/a_dd_on_how_shf_are_manipulating_the_art_world_a/",
    "score": 1568,
    "selftext": "\n\nEdit: Since I have been asked:\n\nDD: Deep Dive (also known as Due Diligence in the legal and professional world).\n\nSHF: Shorting Hedge Funds, in particular Citadel (Kenneth Griffin) and Point72 (Steven Cohen). These are hedge funds who place bets and profit on a company's bankruptcy through the derivative side of the stock market.\n\nGME: GameStop.\n\nNFT: Google it.\n\nI'm about to drop some bombs, and this is going to be a long read with factual claims and evidence to support it. There will also be some of my own exposition to set the scene. I promise it all connects back to Kenneth Griffin, Steven Cohen, and Gamestop in the end though. \n\nEdit: I want to add this at the top so everyone sees it first. Please do not side rail this conversation to point fingers at the deep state, Illuminati, new world order, cabal, or any other conspriacy group that you think may or may not exist. Whatever truth might lie in those conspriacy theories has been tainted so badly that the mere mention of them turns off the attention of the vast majority of the world, and whoever may or may not be trying to run the show behind the curtains will use you talking about them to completely ruin any credibility you have.\n\nAlso, please stop messaging me trying to get me to join your cause or investigation group. I'm a lone fucking wolf who looks at the world through my own eyes, and I don't want to be a part of any one else's agenda. If you want to keep digging into your own theories, I'm 100% in support of that, but please leave me out of it. \n\n**TL;DR**: Kenneth Griffin and Steven Cohen have a long history of manipulation outside of the stock market, and Steven Cohen has been planning on taking over the physical video game trading and collectible industry for years. They, like most if not all billionaires, are lying pieces of shit who bring no real value to the world. Buy and hold, and love your loved ones. \n\nSources to back up my claims for both Part 1 and Part 3 are in the comments below.\n\nPart 1: https://www.reddit.com/r/DDintoGME/comments/opc8le/a_dd_on_how_shfs_are_manipulating_the_art_market/?utm_medium=android_app&utm_source=share\n\nIn Part 2 of this DD, I tied Kenneth Griffin and Steven Cohen to some seriously nefarious power players in the world. Most of the post relied on a fair bit of conspiracy theory level speculation to carry itself, and that is not something I want to perpetuate. I am going to refrain from continuing down that path in this post, and have removed the non-GME related portions of Part 2 (What is left of Part 2 can now be found on Part 1).\n\n\nThat being said, I did connect some dots between the wealthy elite, many who have been in the spotlight for very negative reasons. These people were not only Americans, but also global people of power. At this time I think it would do more harm than good to say who those dots are, and honestly, I don’t think it matters. They are all the same in my book. All I can warn is that, please, do not attend any public group gatherings to celebrate or protest \"our cause\" (there is no we). There is a history of similar events turning out badly, and attending those events will only help an agenda that isn't yours.\n\n\n\nThere might be another time and place to discuss my own speculation on how everything is connected, but without having the ability to gather real solid tangible evidence, all that speculation will be is just that, speculation. I don’t personally jump to conclusions just because people have connections with each other. The only conclusion I have to share is that that level of speculation isn't a good look for GME subs right now. So I'm going to stick strictly to discussing the evidence I have of fraud being perpetuated in the art world by Kenneth Griffin and Steven Cohen as much as I can for right now. This, I believe, will show a clear pattern of manipulation helping to prove they are doing the same in the stock market.\n\nBut first, let's brush up on some economics.\n\n\nI had some troubles getting accurate data for the most current 2020 tax year, so I substituted at times using 2019 examples. Due to the Covid-19 pandemic, I would imagine some of these numbers are slightly different than what is occuring in the real world right now. In the bigger picture though, it doesn’t matter. It’s the overall discrepancy of incomes that matters, and we’ll get to that. \n\n\n\nTo start off, let’s look at the median (not the average) earnings of Americans:\n\n\n\n$19.33 was the median wage per hour in the US in 2019.\n\n\nThe median personal income in the US in 2019 was $35,977.\n\n\nThe median household income in the US in 2019 was $68,703.\n\n\n\nJust a refresher, unlike the average (which is the sum of a set of numbers divided by the total amount of numbers in that set), the median is actually the exact middle point of a data set of numbers, which means exactly half of Americans made less than those numbers above.\n\n\n\nThere were 34 million people below the poverty line in the US in 2019. There were 328.2 million U.S. residents in 2019, which means 9.2% of all people living in America were living below the poverty line. The projected overall poverty rate of 2021 is 13.7%, meaning that, right now, about 1 in 7 Americans live below the poverty line. \n\n\n\nThis does not take into consideration that the threshold that dictates the poverty line, and other government poverty statistics, does not reflect the economic reality of America today. The calculation doesn’t take into account housing, transportation, child care, or medical costs. It doesn’t consider geographical differences, even though costs of living vary significantly across the country. And it doesn’t align with the real life experiences of millions of Americans, especially given that 43 percent of people can’t afford to pay for basic necessities, 40 percent would struggle to find $400 in an emergency, and almost one-third of respondents to a recent poll said that they or a family member did not have enough money to buy food at some point in the past year.\n\n\n\nAmericans also pay state and local taxes that are particularly regressive, meaning they capture a larger share of income from low and middle income families than from wealthy families. For example, state and local sales taxes are particularly regressive because poor families often must spend all their income buying necessities while wealthy families can save most of their income, shielding it from sales taxes.\n\n\n\nSome other taxes we pay include the federal personal income tax, corporate income tax, and estate tax. And the additional federal taxes we must pay for Social Security tax does not apply to investment incomes that most very wealthy families have, and it only applies to the first $137,700 of earnings a worker receives.\n\n\n\nIn 2020, the share of all taxes paid by the richest 1% of Americans was about 20%. Or, at least that’s what it looks like on paper. The U.S. does not split out different income groups within the richest 1%. If we did, we might find that effective tax rates are surprisingly low for the ultra rich given that much of their income is capital gains and stock dividends, which are taxed at lower rates. \n\n\n\nResearch by Emmanuel Saez and Gabriel Zucman finds that the very richest 400 taxpayers in the United States pay a lower effective tax rate than other groups. Saez and Zucman estimated that in 2019, the wealthiest 0.1% households would pay 3.2% of their net worth in taxes while the bottom 99 percent of households ranked by wealth would pay 7.2% of their net worth in taxes. In other words, when defining effective tax rates as taxes paid as a share of wealth, they find that the U.S. tax system is actually very regressive and actively hurts the lower classes. \n\n\n\nOkay, so all of that was to say that the bottom 99% of American’s pay over double in tax rates what the top 0.1% pay. Except, that’s not even true. Remember, charitable donations are tax write offs. There are limits to how much you can deduct, but the limits are not very much. Only if you contribute more than 20% of your adjusted gross income to charity is it necessary to be concerned about donation limits. The deduction is limited to 60% of your contribution base. If you give an amount in excess of the limitation to charity in one year, the excess is carried over for the next five years.\n\n\n\nIf you think I’m about to next claim that Kenneth Griffin and Steven Cohen donate to charitable causes to write off of their taxes, you would be wrong. That’s not what I think. At least not for the case of Kenneth Griffin. Why don’t I think that?\n\n\n\nI’ll answer that, but first I want to ask another question. Why does it cost $357 per single user annually to receive a list of philanthropists and their donation history from InsidePhilanthropy.com? I don’t have an answer for that, that’s a legitimate question.\n\n\n\nAnyways.\n\n\n\nSteven Cohen has given $715 million to charitable causes throughout his life. Kenneth Griffin has donated $1 billion in his lifetime, including more than $300 million to nonprofits in Chicago. Seems like a lot, right? Well, let’s take a look at those amounts compared to their net worth and yearly income.\n\n\n\nKenneth Griffin: \n\nNet worth: $16,100,000,000 ($16.1 Billion)\n\nPercent of net worth spent on donations: 6.2%\n\nEstimated 2019 household income: $1,500,000,000 ($1.5 Billion)\n\n\n\nSteven Cohen:\n\nNet worth: $16,000,000,000 ($16 Billion)\n\nPercent of net worth spent on donations: 4.5%\n\nEstimated 2019 household income: $1,300,000,000 ($1.3 Billion)\n\n\nI want to quickly point out that both of their net worth is still a drop in the bucket compared to those wealthier than them. Also, take a look at the median income for Americans again, and remember exactly half of Americans make less than those amounts. \n\n\nWith the information I have available to me, it’s impossible for me to figure out what percentages of income per year they donated in total compared to that years income, and see if it's under the tax deduction limit. However, I think by simply looking at their net worth vs. percent of net worth spent on donations, and considering the 5 year carry over of donations exceeding the yearly limit, I think it’s pretty safe to speculate that, yeah, these guys aren’t paying very many tax dollars, if any at all. But, again, I’m not claiming Kenneth Griffin is using his donations just for the purpose of tax write offs.\n\n\n\nWhat I am claiming is that Kenneth Griffin is illegally using his donation tax write-offs to evade taxes on personal and business expenses, including marketing his name as a brand, and real estate that is used to increase the value of his own personal art collections. How? Well let’s take a look at what his largest donations are used for:\n\n\n\nOctober 2006: Kenneth Griffin and then-wife Anne Dias Griffin donate $19 million toward construction of the Art Institute’s Modern Wing. The building’s central hall is named the Kenneth and Anne Griffin Court.\n\n\n\nFebruary 2014: Kenneth Griffin makes the largest donation, $150 million, that his alma mater, Harvard University, has received. The money is earmarked principally for Griffin scholarship recipients and a new Griffin Leadership Challenge Fund for Financial Aid. It also establishes a Griffin Professorship of Business Administration. \n\n\n\nFebruary 2015: Kenneth Griffin donates $10 million to the Museum of Contemporary Art Chicago to create the Griffin Galleries of Contemporary Art.\n\n\n\nDecember 2015: Kenneth Griffin donates $40 million to New York City’s Museum of Modern Art, where he is on the board. The museum agrees to name its East Wing the Kenneth C. Griffin Building.\n\n\n\nAugust 2017: Kenneth Griffin gives $16.5 million to the Field Museum, which establishes the Griffin Dinosaur Experience at the museum. The new catchall name for the museum’s dinosaur offerings includes its most popular permanent exhibit, named the Griffin Halls of Evolving Planet.\n\n\n\nNovember 2017: Kenneth Griffin donates $125 million to the University of Chicago to support the widely influential Department of Economics. Although not an alumnus, he is a trustee at the university. The school, which already has a Kenneth C. Griffin Distinguished Service Professor in Economics, establishes the Kenneth C. Griffin Applied Economics Research Incubator.\n\n\n\nOctober 2019: Kenneth Griffin donates $125 million to the Museum of Science and Industry, which will rename itself the Kenneth C. Griffin Museum of Science and Industry.\n\n\n\nJune 2021: A $10 million gift from the founder of the Citadel hedge fund will create the exhibit called The Kenneth C. Griffin Exploring the Planets Gallery.\n\n\n\nDo you see the pattern? \n\n\nKenneth Griffin isn’t donating charitably to museum's, he’s purchasing the naming rights to real estate within those museums. That’s not a charitable cause, and it's not a tax deductible purchase. \n\n\n\nThe first argument I already hear is that a lot of people have things named after them after donating money. At first glance, there isn’t anything seemingly wrong with it. The difference here is that Kenneth Griffin is specifically targeting museums and highly esteemed schools.\n\nHe is paying colleges to name economic departments after him to perpetuate that he is somehow some economic genius deserving of that praise. This in turn boost his financial firm's recognition in the industry.\n\n\n Something to understand about art sales is that the price of art is very subjective. I would argue more than anything else, what drives the price of art (other than money laundering) is prestige. And it doesn’t have to be the prestige of the artist that created the art, an art piece can absolutely rise in price simply because of the prestige of it’s previous owner. And what is more prestigious than a man who’s name is written all over America’s art museum's?\n\n\n\nI’m going to take a real quick tangent here. There’s another very infamous person in recent history who was notorious for empowering himself and his brand by plastering his name all over real estate projects, those project’s didn’t even have to be successful to garner him power, all he had to do was get his name out there. I’m not going to say his name, because I don’t want anymore fuel for the fire of being called a conspiracy theorist, but I would bet you already know who I am talking about. So if you’re thinking no harm can come from just having something named after someone, please think about it again.  \n\n\n\nIf you read Part 1, you might remember how Kenneth Griffin privately purchased Jean-Michel Basquiat’s \"Boy and Dog in a Johnnypump\" for $100 million. That art piece is currently hanging in the Kenneth and Anne Griffin Court at the Chicago Art Institute. \n\n\n\nPlease take a moment and think about how much more that piece will go for next time it is in an art auction, just because Kenneth Griffin, the Kenneth Griffin, the namesake of the Kenneth and Anne Griffin Court, the Griffin Galleries of Contemporary Art, the Museum of Modern Art’s Kenneth C. Griffin Building, the Griffin Halls of Evolving Planet, the Kenneth C. Griffin Museum of Science and Industry, and the Kenneth C. Griffin Exploring the Planets Gallery are all named after. \n\n\n\nAnd what did he do to get all of those places named after him? It wasn’t merit, it was fucking money. Money that was tax deductible at that. Jean-Michel Basquiat doesn’t have claim to the reason that price of artwork is valuable anymore, Kenneth Griffin does, and it fucking makes me sick.\n\n\n\nKenneth Griffin is also a member of multiple museum boards. This allows him to make decisions on what is shown at these museums, and I believe he uses his donations to buy his way to these board seats. \n\n\n\nHow is this all tied to GameStop? The short answer is Steven Cohen. A long time business associate and fellow art collector of Kenneth Griffin. Kenneth Griffin and Steven Cohen both donated to the New York Museum of Modern Art in 2015, along with two other people, collectively paying 50% of the 400 Million dollars raised that year. \n\n\n\nAs much as I tried, I couldn’t really peg Steven Cohen with the same sort of manipulative tactics as Kenneth Griffin though. I wanted to, but the evidence just isn’t there. Maybe because his donation records aren’t as public as Kenneth Griffins, and instead mostly listed behind paywalls, but from what I could find, it seemingly looks like Steven Cohen donates to actual beneficial causes, such as healthcare, schools, and veterans aid. If that's the case, then those tax write-offs are legitimately being used the way they should be. \n\n\n\nHowever, in my previous posts I mentioned that Steven Cohen is unlike other art collectors in that he routinely buys and sells, rather than the tried and true method of buying and holding as a long term value play.\n\n\n\nLet's talk about some of those deals.\n\n\n\nMay 2013: Steven Cohen spent $155 million on Picasso painting, \"Le Reve,\" buying it privately from casino giant Steve Wynn. At the time, this was the highest price ever paid for an artwork by an American collector. If you read Part 1, you will remember this was less than 2 weeks after Steven Cohen's SAC $1.8 billion Settlement with the SEC for insider trading, and that this art piece had previously been accidently majorly damaged by Steve Wynn.\n\n\n\nNov 2013: An Andy Warhol work depicting a gruesome car crash sold for $105.4 million at auction, a record amount for the pop artist' artwork. The sale was made Wednesday evening at a Sotheby’s auction of contemporary art in New York. Among other items for sale were six pieces owned by Steven Cohen, which sold for a total of about $77 million. Those sales came less than 24 hours after Francis Bacon’s “Three Studies of Lucian Freud” became the most expensive artwork ever sold at auction when it went for $142.4m at Christie’s on Tuesday. \n\n\n\nMay 2015: While world media was abuzz with the world-record breaking sale of Picasso’s \"Les femmes d’Alger\" for $179 million at Christie’s, another anonymous buyer took home the most expensive statue ever auctioned, Steven Cohen secretly bought Alberto Giacometti’s masterpiece statue \"Man Pointing\" for $141.3 million.\n\n\n\nMay 2017: Steve Cohen was the seller of Jean-Michel Basquiat's \"La Hara\" painting at Christie’s for just under $35 million, compared with the estimated sell price of $22 million to $28 million. The painting was last auctioned in 1989 for $341,000. The next day, Jean-Michel Basquiat's \"Untitled\" became the most expensive American painting sold at an auction. It was purchased by Japanese billionaire Yusaku Maezawa for $110.5 million after a ten-minute bidding war at Sotheby’s.\n\n\n\nJune 2017: Steve Cohen purchased a Roy Lichtenstein painting for $165 million. The painting, called \"Masterpiece,\" is believed to be among the 10 most expensive ever sold.\n\n\n\nMay 2019: A three-foot tall, shiny, stainless steel rabbit sold for $91.1 million at Christie's this month. \"Rabbit\" by Jeff Koons now holds the record for the highest price paid at auction for a living artist. While the buyer was art dealer, former Goldman Sachs executive, and father of the current Treasury Secretary, Robert Mnuchin, it's since been reported that he purchased it on behalf of hedge fund billionaire Steven Cohen.\n\n\n\nHave you noticed another pattern yet? \n\n\nSteven Cohen, Christie's, and Sotheby's are all involved in selling and buying art work at record levels, well over their pre-estimated prices, which leads to other artworks by the same artist drastically increasing in price shortly after. The auctions then get a slice of this price increase when those other pieces are sold through these auctions. \n\n\n\nBefore we dive deeper into Steven Cohen, let's learn more about Christie's and Sotheby's. They are two of the largest art auctions in the world. \n\n\n\nChristie's is owned by Francois Pinault. In 2005, Jasper Johns’s \"The White Target\" was sold by Francois Pinault for $25 million to Steve Cohen, and in 2 years it doubled in value. In 2016, Steven Cohen sold an Andy Warhol portrait of Mao Zedong for more than $47 million, or nearly three times the $17 million he paid for it in 2006, and 40 times its last public auction price, which was in 1996. Steven Cohen bought this particular Mao painting in a private transaction from Francois Pinault, the billionaire owner of Christie's.\n\n\n\nSteven Cohen's investment firm Point72 was previously long on Patrick Drahi's telecom company, until 2017 when the majority of every investment firm holding shares sold almost simultaneously, tanking it's share price. How is that relevant?\n\n\nSotheby’s was a public owned company up until Patrick Drahl offered straight cash to buy it. \n\n\nHowever, a consortium of New York-based art-collecting figures were also contending for ownership, each to chip in a little more than a billion to top Drahi’s bid. The Post names Citadel founder Kenneth Griffin, hedge fund maestro Steven Cohen, and private equity kingpin Henry Kravis as potential members of that very elite group. During the same transitional time period 4 of Sotheby's shareholders filed lawsuits against Sotheby's, stating the information Sotheby’s filed to the Securities and Exchange Commission about its projected cash flow and other aspects of its finances is inadequate. \n\n\nI would suggest looking into all of the long history of the differences between estimated appraisal prices vs. actual sold prices of the arts sold in either auction, if you are truly interested how blatantly they spiked the prices of certain artists, many of who Steven Cohen “discovered”.\n\n\n\nSteven Cohen has a proven pattern of being involved in art and collectors items being sold far higher than the appraised price. He also has a history of proven, and litigated, insider trading regarding the stock market. Yet, he is still allowed to run one of the largest investment firms, 1 of only 2 which bailed out Melvin Capital after Melvin lost a substantial portion of their assets after betting on GameStop's failure during the pandemic. The other being, of course, Kenneth Griffin’s.\n\n\n\nSteven Cohen's history of rising prices to increase future art sales reminded me of the story I heard, just the other day, about a copy of the game Super Mario 64 being sold for a million dollars. Then I remembered a similar Super Mario Bros game being sold for an outrageous price last year.\n\n\n\nFeb 2019: A sealed copy of Super Mario Bros. for the NES has sold for $100,150, setting a new record for the video game-collecting market and perhaps ushering in a new era for the valuation of gaming rarities. Wata Games gave the unopened box a 9.4 rating on its ten-point rating scale and gave the sticker seal its highest rating of A++. Stating it was the only known copy of arguably the most important game in Nintendo history. It’s rumored that there is one more out there, but they haven't seen proof of it yet. This game may be the condition census of all sticker sealed NES games known to exist.\n\n\nI personally speculate that, within the next year or two, we are going to see that “rumored copy” come to light, and probably sell for 10 to 20 times as much as this one.\n\n\n\nThat Super Mario Bros sell was about 1 year before GameStop's run from 20 dollars a share to 500 dollars a share, all in less than a month. A month before that it was down to only 4 dollars a share. Had DeepFuckingValue not done his YOLO investment into GameStop, Ryan Cohen not purchased his major shareholder status, and had not millions of us morons on the internet individually chose to do the same after them, GameStop would have undoubtedly been illegally short sold on the stock market to bankruptcy by now, and we would have all thought it was closed down just because of the Covid-19 pandemic. \n\n\n\nSince then, us redditors have collectively done probably years worth of research man hours on stock market technical analysis, market manipulation tactics, shareholder rights, digital currency, NFTs, and digital collectables. I want to write more about everything we've uncovered over these past 7 months, but I just don't have the time or brain bandwidth to do so right now. If you haven't read all of the research, I would implore you to at least seek out your own due diligence on what has occured. \n\n\n\nSpeaking of NFTs, 8 of the top 10 NFT art sales as of March 2021 have been bumped from the list by higher selling NFTs. An NFT artwork by Beeple sold for an unbelievable $69 Million in March 2021. This made Beeple the third most expensive living artist to sell at auction. Where were these NFTs sold? If you guessed Christie’s, you would be right. The event marks the auction house's first-ever NFT sale.\n\nIf you don't know who else has been working on creating their own NFT blockchain network to protect the integrity of NFT sells and collectables, and would be a direct threat to the manipulation Steven Cohen has been trying to pull, I'll give you a hint. It's GameStop.\n\nI want to point out that at this point, I 100% truly believe GameStop is still around only because retail investors refuse to sell. All of the times the media portrayed redditors as the enemy, all of the false news campaigns about shorts covering, all of the suspected paid actors and spam bots in our subreddits, all of the suspected moderators we thought were bought out, all of the other suspected fake meme stocks that were pumped and dumped by hedge funds and then blamed on us, it's all fucking true. I'll fully admit it, I’ve had my own doubts while going through all of this. But not anymore. Looking at the manipulation that happens in every sector Kenneth Griffin and Steven Cohen are a part of paints a clear pattern of the illegal actions and total disregard for regulatory rules that is repeated over and over. \n\n\n\nEver wonder why baseball and pokemon cards were so insanely high lately?\n\n\n\nJuly 2, 2021: An investment group led by the mega-collector and Mets owner Steve Cohen is buying Goldin Auctions, the leading auction house for sports collectibles. The acquisition by Collectors Holdings, which Steven Cohen owns with fellow collector Dan Sundheim and healthcare entrepreneur Nat Turner, comes as the market for baseball cards and other sports memorabilia has grown red hot.\n\n\n\nJuly 14, 2021: Wata Games, the company that graded the recent record-breaking copies of The Legend of Zelda and Super Mario 64, has been acquired by Collectors Universe, which grades coins, trading cards, and other collectibles and memorabilia. The purchase signals video games’ growing prominence in the world of collectibles, which has seen significant interest recently due to the skyrocketing value of things like Pokémon cards. “Collectibles across categories, including trading cards and sports memorabilia, are now firmly considered an alternative investment class by both hobbyists and investors,” said Nat Turner, executive chair of Collectors Universe, in a press release. “With those categories seeing a stratospheric rise recently, we’ve identified video games as the next area primed for similar expansion. We’re partnering with Wata because they are the experts in video game grading and there’s simply no other way to recreate the amazing and trusted company they have built.”\n\n\nI would like to point out that Collectors Holdings, which bought Goldin Auctions, and Collectors Universe, which bought Wata, are two different companies. \n\n\nIn December 2020, an investment group led by collector Nat Turner, D1 Partners and Cohen Private Ventures offered $700 million to acquire the Collector's Universe. Ultimately, the deal was increased to $92/share equating to an $853 million acquisition price.\n\n\n\nDid you catch how Cohen Private Ventures was part of the investment group that bought Collectors Universe out in December of 2020?\n\n\n\nCohen Private Ventures invests long-term capital, primarily in direct private investments and other opportunistic transactions, on behalf of Steven Cohen.\n\n\n\nThat's right, Steven Cohen bought Wata Games on July 14, 2021. 11 days ago as of me writing this post. \n\n\nIf anyone who has ever actually been involved through business acquisitions like I have, you know these things can take years. There's so much market research, business evaluations, legal paperwork, planning, meetings. It's not something that happens over night. Now consider that Steven Cohen has acquisitioned at least 3 in the past 8 months, 2 being within the last few weeks. \n\n\n\nCollector's Universe - December 2020\n\n\nGoldin Auction - July 2, 2021\n\n\nWata Games - July 14, 2021\n\n\n\nAlso, don’t forget the Hollywood agency management and production firm Steven Cohen had part in creating and has a major investment in from Part 2 (Now Part 1).\n\nRange Media Partners - September of 2020\n\n\n\nI think there is without a doubt that Steven Cohen has been planning on entering into the video game collectors market for years, all while illegally producing counterfeit shares to dilute GameStop's share price, forcing them onto the verge of bankruptcy for easier market entry for himself. My speculation is that he was planning on using this entertainment firm to pump out movies and tv shows that will showcase and promote pop culture items and artworks, which he will then highly appraise and sell through his auctions. \n\n\nBut GameStop never went bankrupt, because retail investors bought and held its stock. Retail investors didn’t let Steven Cohen dictate what the price of something should be, which he has always been able to control before. \n\n\nHad GameStop shut down, Wata Games, the self proclaimed leading expert in vintage and collectable video game grading and appraisals, could say that beat up old copy of Sonic you wanted to trade in was worth $1, and then turn around and appraise it for $100, $1,000, or $10,000 before it is sold. When you consider they just appraised and had sold Super Mario 64 for $1,000,000,000, the sky really is the limit, because Steven Cohen, and his connections that need money laundered, have the wealth to prop up any sell they want. \n\n\nIf you think Steven Cohen isn't going to enter the new video game market at some point, I think you should reconsider your thoughts. He's smart enough to know how to plan ahead 5, 10, 20 years from now. He also absolutely knows video gamers are collectors. If given the choice between a $50 downloadable game, and a $500 super special limited collectors physical copy addition, there are gamers out there who will buy the physical copy just for the prestige of having it alone. He also wants to be in control, and I totally see him on a path of bankrolling new video game titles, specifically to push the agenda to create these new collector physical games.\n\n\nThat's why GameStop is an issue for him. It's an established video game trading company who is a direct threat to the credibility of Wata Games appraisals. If Wata Games is saying a physical game is worth $500, and GameStop is saying it's worth $20, he might be able to get someone wealthy to buy the $500, but he's not going to get the typical retailer too. Consider the patterns of how Steven Cohen operates. He goes in, facilitates a fugazi ultra high sell, and then profits off of the increased sells price from related items that follow the assumption of that fugazi sell actually being worth that much. This isn't something he's going to do in the future with video games, it's something he's already been in the process of doing with the help of Wata Games' absurdly high appraisal amounts already. \n\n\nLet all of that just sink in for a moment. It can be brushed aside as just speculation, but it makes a lot of sense to me.\n\n\nI can't even count how many times I have heard GameStop was a dying company, not just from the media, but from people in my real life trusting the media as well. The number one reason reported why it was closing was because hedge fund managers stated physical game copies were declining in sales and predicted to be a thing of the past. Except, for us, the actual video game players, we always knew that wasn't true. How many collectors edition video games have you bought in the past, just for the sake of collecting them? How many times have you gone into GameStop because they are the only major video game retailer of physical games, and related collectibles, that aren't part of a department store? I challenge you to name one other major video game retailer other than GameStop that buys, sells, and trades retro video games and consoles not just online, but in brick-and-mortar stores as well. They are the cornerstone of the video game trading and collecting market.\n\n\nIt's funny, we used to complain about GameStop only giving us a couple bucks for our Super Mario Bros games, and then turning around and selling it for a few bucks more, because that's what they would say market value was. Now, GameStop, both with game trading, and market trading, is the last line of defense to truly keep things at market value, before those who are ultra wealthy just completely make up any made up price for everything. \n\nRemember how GameStop was on the verge of bankruptcy and trading at 4 dollars a share in December of 2020? GameStop now has zero debt, and over $1 billion of unearmarked capital to use at their disposal. It is one of the most booming retail stores in existence today. All because retail investors, the people who actually shop there, know that company's true worth and continue to buy and hold their shares. \n\n\nArt is by its very nature subjective. What a painting means to you might mean something entirely different to me. Same for a song, a book, a baseball card from another era, a food dish made by a loved one, a physical place or moment in time, even a video game. Art is as much a feeling as it is a tangible thing you can see or hear. \n\n\n\nThere are artists out there, me being one of them, who would put out the argument that art isn't something you can even necessarily produce. Instead it is something that is born into this world by merely flowing through you. Art is something that shouldn't be a prize to be collected just because it costs a lot of money. That's the fucking anti-thesis of art. Art is something that is meant to be shared.\n\n\n\nArt is as much an experience to create as it is an experience to enjoy it having been created. The feeling of art is the reason you care more about the crudely drawn dinosaur hanging from a magnet on the refrigerator than you do about the decorative printed paintings at Hobby Lobby. \n\n\n\nBecause of this personal subjectivity, however, it makes it really hard to put an actual price tag on an art piece. It is impossible to realistically say what a piece of art is worth, because art's monetary value is vastly different to every single person who experiences it.\n\n\n\nThis, however, leaves the buying and selling of art very vulnerable to manipulation, particularly appraisal and sell price rising for the sake of the seller and the agency that facilitates the trade. \n\n\n\nKenneth Griffin and Steven Cohen want to tell you exactly how much that thing that is special to you is worth. They are already doing it for GME shares, they have been forcing their way to do it to tangible items as well. \n\n\n\nCommodities like food and clothing are priced based upon quantifiable factors, such as cost to produce, transport, and market. External factors such as supply and demand also play a large role in the pricing of these items. \n\n\n\nEven business shares, which themselves have a degree of subjectivity to them, have quantifiable reasons why they are at the prices they are at, and when they are at them. Underlying business fundamentals, industry sector growth predictions, technical analysis, quarterly earnings reports, and supply and demand all play a part in the pricing of stocks.\n\n\n If someone likes a stock, they buy it and hold it. If someone doesn't like a stock, they sell it and move on. This is the way the free hand of the market should work to ensure the share price accurately reflects the evaluation of the business it represents. \n\n\nUnfortunately, the derivative market, as has been proven time and time again, has completely dismantled the way the stock market should work. Leaving share prices wide open to external manipulation by those who can afford to do it.\n\n\n\nBut this write up isn't just about exposing stock market manipulation, it's about exposing the manipulation done in the art market by the same players blatantly manipulating the GameStop stock price. I am letting everyone know how big of frauds they really are.\n\n\n\nI'm fully aware of the risk I am taking by exposing these people for what they are. I have chosen to not keep this hidden though, I will live or die on this hill. Why? Because the choices these hedge fund managers have made, along with the choices of other wealthy elites, have devastated our lives, our families, our neighborhoods, our dreams, our passions, and our futures.\n\n\n\nThey have fostered a world where honesty, trust, and integrity are viewed as weaknesses to exploit. They have indiscriminately taken everything we've ever held dear in our hearts, and wrung it out for every penny they could squeeze for themselves. They have destroyed our environment, our sense of community, our ability to truly connect with each other and the universe at large. So this is it. I could have never imagined I'd put my life on the line because of GameStop, but if that's the last vessel of hope where shared experiences of enjoying art, true art, lies, then it will prophetically be where the game stops for me. Because it's my fucking hill, and I hold the shares to prove it. \n\n\n\nNo matter how all of this plays out, I'm proud of everyone who has held on for this long, especially those who could have sold for profit multiple times over, and those so far in the red they are terrified if they will ever recover. I'm proud of the support you have all shown to each other while involved in this saga, time and time again. I'm proud of your courage against uncertainty, and the trust in conviction of your beliefs. I'm proud of the faith you have placed on others during all of this, despite no promises ever being made between us, and all of the differences we don't share. This stock is worth liking. The journey it has taken us on together, as self acting individuals, and the ways it has made us grow, is one of the most beautiful forms of art I have ever seen. \n\n\n\nTo the hedgies who r fuk, you have a lot of egg on your face. It is crystal clear for everyone to see that despite all the wealth you might have, you have absolutely no appreciation or understanding of art. It’s just another thing for you to exploit. And that makes you so utterly, unarguably, and disgustingly unsophisticated.\n\n\n\nTo the SEC, DTCC, FINRA, IRS, FBI, and any other government regulatory agency, do your fucking job, or fuck off and give me yours. Look at the amount of info I found that shows a pattern of criminality, and intent and motive to commit those crimes, just in a matter of days by just searching through the resources available to me. You have wiretapping, search warrants, and the authority of the entire fucking United States Government at your disposal. Either start acting with professional integrity and protect the citizens of this country, or prepare to lose absolutely all credibility in the eyes of the public and world at large. Every day of inaction people in this country suffer and die, while they could otherwise be thriving, and in the end that is on you. \n\nTo Ryan Cohen, and the rest of the leadership at GameStop, millions of people have put a lot of faith in you to do the right thing and protect the free market. That includes me. There can only be one winner in the battle of the two Cohen's, so please don't let us down. Do what would make your father proud.\n\nTo all the apes, I'll be either seeing you on the moon, or in Valhalla. If something happens to me, just remember DFV and RC aren't the heroes of this story. \n\n\nYou are.\n\n\n\n💎✊🚀✊💎\n\n\nPower to the Players.\n\nThis is not political.",
    "title": "A DD on how SHF are manipulating the art world, a lesson on income inequality, how this relates to GME, including how Steven Cohen has been planning to enter into the physical video game trading and related collectable market for years. PART 3",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/oqpiha/a_dd_on_how_shf_are_manipulating_the_art_world_a/"
}