{
    "author": "kzgatsby",
    "created_utc": 1616147619.0,
    "distinguished": null,
    "edited": 1616147774.0,
    "id": "m8dteq",
    "text_only": true,
    "flair_id": "67db277a-6e3d-11eb-91b6-0e101d88f509",
    "flair_text": "Hedge Fund Tears",
    "name": "t3_m8dteq",
    "num_comments": 112,
    "permalink": "/r/GME/comments/m8dteq/after_finding_out_how_my_parents_lost_their/",
    "score": 2957,
    "selftext": "&#x200B;\n\n[See this girl in the painting? Every time I look at this painting, I cried, My tears would fall like a river and I would cry my heart out. I cried because growing up, this was me. Do you see what's around me? This was my world, everything was shattered and broken, everything disappeared right in front of me, my home, my family, my friends, and my parents' business and their marriage. Do you see how fragile she is? That was me who starved on Maruchan Ramen, Campell soup, and free school lunch. Everything we have was auctioned and we had nothing left. My parents tried to aggressively save every penny they could to pay rent and utilities. I did not have a regular meal until my dad and my mom finally found a restaurant job. Do you see that Teddy's Bear? That was all that I have as a kid; my preowned GameCube from GameStop that my dad saved up enough money and bought for me. Do you see those wounds on her? Growing up, that was what I have to suffer moving to a new environment. I got bullied, beaten, grouped, discriminated against in my neighborhood and my school. Do you see her eyes? Those were my eyes when I watched my dad collapsed and hospitalized in front of me, getting transported to an ambulance due to him overworking 12 hours and walking miles to work every day. And my mom, crying, written an 8-page letter begging the hospital to reduce the medical bill because we had no money. Do you see her expression? Those were my expression when my parents filed for divorce. I held onto my tears but deep down inside I am crying and am completely broken. Growing up, I had no love, no nurture from parents, and no family. Those eyes and expression, were my anger, my sorrows, my hatred, my grievances, my grudges even till today. All because of your FUCKING GREED. My childhood was destroyed all because of your DIRTY, SELFISH, LYING, NASTY, CHEATING, MANIPULATIVE FUCKING GREED. All my life, I struggled and had it rough all my life, I have worked and fought so fucking hard all my life to try to get back what my parents and I have lost. Guess what? The day has finally come. Your Karma is here and your end time is near.](https://preview.redd.it/g3zw55o8qxn61.jpg?width=668&format=pjpg&auto=webp&s=e8de851e27040ce6c51709edd3b3f075213e767a)\n\n&#x200B;\n\n&#x200B;\n\n[\\\\\"What goes around comes around, what goes up, must come down, everything in the dark must come to light, and you will reap what you sow.\\\\\" Next time \\(If there's ever a next time\\) that you hedge fucks attempt to execute the same bullshit again for your own greed and personal gain, think twice and remember that there was a \\\\\"Fearless Girl\\\\\" on Wall Street that you all once shorted, and destroyed her childhood. She will be watching. Circumstances can change at any time, so don't devalue or hurt anyone in this life. You may be powerful today, but time and karma, are more powerful than you.                       💎 🙌 🦍 🌕 🚀](https://preview.redd.it/3dbcfmba8yn61.jpg?width=1600&format=pjpg&auto=webp&s=7ac5ce47c72bec2e87f69bc8868643e3d7d4d1f9)",
    "title": "After finding out how my parents lost their business and our home during the 07-08 financial crisis, I am unloading my entire portfolio today to BUY GME. YES, NOW IT IS FUCKING PERSONAL. My portfolio will be nothing else but 100% GME. AND HEY CITADEL, MELVIN, POINT72 AND SHILLS, HERE'S MY MESSAGE.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m8dteq/after_finding_out_how_my_parents_lost_their/"
}