{
    "author": "Rugby97",
    "created_utc": 1618733839.0,
    "distinguished": null,
    "edited": 1618885794.0,
    "id": "mt8syk",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_mt8syk",
    "num_comments": 342,
    "permalink": "/r/Superstonk/comments/mt8syk/attention_rbc_citadel_misinformation/",
    "score": 7020,
    "selftext": "Edit1: This has gotten more traction than I anticipated. Thanks for all the awards, I do this for the sub so that everybody can stay in line and not get carried away. I plan on doing an occasional \"DD POLICE\" Episode going forward, where I'll recap and face fuck any dd I can prove wrong or support ones I can further verify. Feel free to inbox me things you're sus about or want confirmed.\n\n&#x200B;\n\nEdit 2: In light of some people sending my some more info, I will be doing some more research on this post & updating it accordingly in the case I find any of this is misleading or incorrect. Thanks for holding my accountable as well! We need this!\n\n&#x200B;\n\nEdit 3: Updates Part 3 to include 3.1 which is the counter-counter DD. We all need to be held accountable, including myself. Big thank you to u/SmithEchoes ! Always do your own dd guys.\n\n&#x200B;\n\nEdit 4: $RY Opened at $94.61 as predicted today (4/19). Take off your tinfoil hats\n\n&#x200B;\n\n&#x200B;\n\nSup you stupid cucks\n\n&#x200B;\n\n[It's TIME TO STOP with misinformation & date expectations](https://preview.redd.it/x8n3l0b2pyt61.png?width=1920&format=png&auto=webp&s=96c4773149cb216db53f699a6f7e37f833c11fce)\n\nYet again I've been summoned from my shitty fucking sleep schedule to save you from some more misinfo.\n\n&#x200B;\n\n# PART 1 - TLDR SINCE IT'S LATE AND YALL NEED SLEEP\n\nGoing to make this very fucking clear for those in the back or that are too lazy to do their own DD (which must be a lot of people considering this shit keeps happening)\n\n1. **RBC (Royal Bank of Canada) DOES NOT HAVE CLEAR TIES TO CITADEL**\n2. **RBC IS NOT SUDDENLY WORTH 66% LESS**\n\n&#x200B;\n\n# PART 2 - THE VIDEO CIRCULATING GME/SS SUBS\n\n*This crock of shit:*  [$AMC $GME RBC -64% WHAT ARE THEY HIDING? - YouTube](https://www.youtube.com/watch?v=smZmQrTP9kI&ab_channel=CharlieandtheVids) is particularly disheartening, because the creator (who I'm sure has good intentions) blatantly misinforms the audience. Yes, RBC stock did **TRADE** momentarily at $33.75, but then immediately was traded at it's regular price of \\~$94.71\n\n&#x200B;\n\n[At roughly 1800 EDT we say $RY trade 896 shares @ $33.75 \\(total value: \\~$30k\\)](https://preview.redd.it/q81oa7g5pyt61.png?width=660&format=png&auto=webp&s=1823830e886c4280f0e5bfe34971accc0cc67c49)\n\n\"The Royal Bank of Canada has direct ties with Citadel, this is very easily verified, you can look it up yourself.\"^((0:40 in video))\n\nWell, **I did.** The (2nd) LARGEST institutional owner of RBC is JP Morgan @ LESS THAN 0.335%. The first? ~~Citadel~~ The Canada Pension Plan Investment Board @ 0.46%\n\n[RY Institutional Owners and 13F Filers (Royal Bank of Canada) ](https://www.marketbeat.com/stocks/NYSE/RY/institutional-ownership/)\n\n[Citadel Advisors Llc ownership in RY / Royal Bank of Canada - 13F, 13D, 13G Filings - Fintel.io](https://fintel.io/so/us/ry/citadel-advisors-llc)\n\nIt is strange that MarketWatch halts information of RY after hours at 1708, however you can even look at the NASDAQ website which shows you ALL after hours trades, and see that after hours had around \\~170k volume, all of which were traded at \\~94$ with the exception of **ONLY 896 shares TRADED AT 33.75**  [(RY) Latest After Hours Trades | Nasdaq](https://www.nasdaq.com/market-activity/stocks/ry/after-hours-trades)\n\n***Only 0.5% of after hours 4/16 $RY volume was traded at $33.75 instead of \\~$94***\n\nOh, btw, in the comments the poster referred to this article as evidence of Citadel having connections to RBC:  [Hedge Funds Have Never Been This Bullish On Royal Bank of Canada (RY) - Insider Monkey](https://www.insidermonkey.com/blog/hedge-funds-have-never-been-this-bullish-on-royal-bank-of-canada-ry-819314/)\n\n\"Among these funds, [**Citadel Investment Group**](https://www.insidermonkey.com/hedge-fund/citadel+investment+group/44/) held the most valuable stake in Royal Bank of Canada (NYSE:RY), which was worth $83.8 million at the end of the third quarter. \" ^(Quote from article)\n\n1. This is from March 2020, the market has changed VASTLY since then\n2. As of  2/19/2021, JPMorgan Chase & Co. own $391M in shares of RY (nearly 20x that of Citadel now)\n3. Citadels position is down 47.77% from what it was in 2020. They currently have 284,484 shares @ a value of \\~$23M (0.04% of RBC)\n\n&#x200B;\n\n[chill the fuck out](https://preview.redd.it/jq7gi978pyt61.png?width=1275&format=png&auto=webp&s=93933c0e1fcf0932dfc48d4bdad48a1df3028d7c)\n\n&#x200B;\n\n[disclaimer: he \\(probably?\\) didn't say this](https://preview.redd.it/jsvxrpn9pyt61.png?width=1280&format=png&auto=webp&s=51d42d56d8ed975a0c92fe66c7d1b0158fb039b5)\n\n&#x200B;\n\n# PART 3 - WHY DID 896 $RY SHARES TRADE AT $33.75 THEN?\n\nIF ONLY WE HAD SOME KIND OF RELIABLE DOCUMENT, THAT WAS PUBLIC, AND GIVEN TO US WEEKS IN ADV-  [Royal Bank Of Canada Prospectus 424B2 (sec.report)](https://sec.report/Document/0001140361-21-011078/) ^(oh wow, you smooth brain motherfuckers)\n\n\"Trigger Price and Coupon , Barrier: ***$33.75***, which is 60% of the Initial Stock Price.\" ^(Taken from link)\n\n*Q: So what the fuck am I looking at?:* **A: \" Royal Bank of Canada is offering Auto-Callable Contingent Coupon Barrier Notes (the “Notes”) linked to the common stock (the “Reference Stock”) of Toll Brothers, Inc. (the “Reference Stock Issuer”). The Notes are our senior unsecured obligations, will pay a quarterly Contingent Coupon at the rate and under the circumstances specified below, and will have the terms described in the documents described above, as supplemented or modified by this pricing supplement. \"**\n\n*Pls wrinkle boy, smooth brain much. Need simp answer.*\n\nBasically, RBC is just doing business as usual. Everyone is on the egde of their seat with **4 major banks selling off $47 BILLION in assets** ^((BofA: $15B, JPM: $13B, GS: 10.5B, MS: 8.5B)) so this is getting way more traction than it normally would. Everyone is digging very fucking deep & hard to find connections that aren't there in order to scream Armageddon & watch the universe fucking implode on Monday. RBC will open @ \\~$94 Monday as per usual, and if it doesn't, well, this post is far from the first thing you need to start worrying about.\n\n**WHAT IS WIERD** is that Citadel just closed out \\~30k in options on Toll Brothers Inc. early. hmmm\n\n# PART 3.1 - THE COUNTER-COUNTER DD\n\nCheck out this comment from u/SmithEchoes:\n\n\"So.. if the trade date was March 29, 2021, next coupon barrier date not until the next quarter, and a call date no earlier then September 29, 2021, how exactly is the trigger price of 33.75 activated on April 16, 2021?\n\nThe problem here is this is a 424B2 filing, which is a newly opened prospectus filing. Since it is newly opened, it can’t for the above mentioned reasons be the cause of the 33.75 AH price. Next we have initial stock price, which is for Toll Brothers, Inc (TOL), which on 3/29/21 (trade date) ranged from 55.96 to 59.52. 56.25 lines up pretty well with the VWAP ending normal trading hours, and maintains a conservative price in the benefit to the bank.\n\nSo in real conclusions to the conclusions here, a random “Auto-Callable Contingent Coupon Barrier Notes” form 242B2 with a trigger price of 33.75 for TOL stock does not relate to a random after hours RY stock price.\"\n\n**I, like most of you, are also learning most of all this financial jumbo over the past few months. So, lets do our own DD again. Time to dive deeper into Auto-Callable Notes & Prospectus Filings.**\n\n&#x200B;\n\n[TLCR: Prospectus Filings are just a financial document to disclose or describe trades.](https://preview.redd.it/91k4caiysyt61.png?width=483&format=png&auto=webp&s=ed696ce9a98d4b99eff0333cf74ed738e696ccc3)\n\n&#x200B;\n\n[Taken from the RBC Prospectus Filing](https://preview.redd.it/rgg92ts6vyt61.png?width=698&format=png&auto=webp&s=8ea608c7becd330eef9e38a0c2eeede7615b7104)\n\n&#x200B;\n\n[qwik mafs](https://preview.redd.it/qbbmes8ruyt61.png?width=653&format=png&auto=webp&s=cdf9137939bbbcc1fd8b08055f46e3713b9206bd)\n\nOkay. So the numbers line up with my 3.0 explanation for apes. But what about Callable Fixed Rate Notes? Well, here's an explanation from RBC themselves:  [Callable Fixed Rate Notes](https://www.rbccm.com/assets/rbccm/docs/expertise/fixed-income/us/rbc-callable-fixed-rate-notes-fact-sheet.pdf) (TLCR: They are call options)\n\n*Q: What do we know about call options?* \" **A: For most profitable covered call positions, it is best to let them ride until expiration.** (in this case that would be until AT LEAST September 2021. However, There is nothing in the RBC Prospectus filing that states they can not be closed our PRIOR to that. Which is what Citadel did) **But in certain circumstances it may make sense to close out the trades early to manage risk or free up capital for new opportunities. Always pay attention to transaction costs, and use a limit order when closing out your option contracts. \"**\n\nWait. A. Mother. Fucking. Second.\n\n***\"...it may make sense to close out the trades early to manage risk or free up capital for new opportunities...\"***\n\nWell, I think we just stumbled upon something that was in front of our eyes the whole time.\n\n***Citadel is likely closing out as many positions as it can in order to liquify assets so it has more cash in hand.***\n\nAnd if they're willing to liquify a meager \\~30k in options, it looks like MAY BE\\* liquifying basically fucking everything they have that isn't critical to their operations. (MY OPINION, PURE SPECULATION)\n\n&#x200B;\n\nPart 3.1 TLDR: 3.0 Still stands, also Shitadel looks like it's 300% fuk\n\n&#x200B;\n\n# PART 4 - CONCLUSION\n\nSomething big is happening, but RBC is fine as far as we can tell with the information on hand.\n\nExpect another post from me within a few days tackling another bullshit lazy dd.\n\n**This kind of misinformation is FUD** **AND NEEDS TO BE DESTROYED**, as explained in another post I made here:  [Blackrock & 4D Chess](https://www.reddit.com/r/Superstonk/comments/msez57/blackrock_4d_chess/)\n\n*Q: Why is it FUD?* **A: Because people start rallying behind the idea that monday we're going to see big banks like RBC start to crumble and trigger the MOASS etc etc.** Inevitably this does not happen and people are let down. Guess what? The MOASS will fucking happen when it happens.\n\n&#x200B;\n\n[Sit back, relax. You waited xx years for this moment you can wait a few more days\\/weeks\\/months. Stop setting expectations for this Monday, or 4\\/20 or ANY day. The longer this goes on the more shorts CuckFunds put out there and the harder we blow the fucking ozone into oblivion on our way to 🌙](https://preview.redd.it/be7ys9ibpyt61.png?width=1920&format=png&auto=webp&s=b07ba514283e279bb2fc1ccd2c23e05687ccf597)\n\n&#x200B;\n\nHave a great Sunday! -Rugby\n\n🐵🍌💎🙌🚀🌙\n\n\\-----------------------------------------\n\nDATES=FUD [Blackrock & 4D Chess](https://www.reddit.com/r/Superstonk/comments/msez57/blackrock_4d_chess/)\n\nDD POLICE ep.1 [SEC Rule 15c3-3](https://www.reddit.com/r/Superstonk/comments/mtl77t/dd_police_ep_1_sec_rule_15c33/)",
    "title": "ATTENTION 🐵: RBC, CITADEL, MISINFORMATION",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mt8syk/attention_rbc_citadel_misinformation/"
}