{
    "author": "TheRob941",
    "created_utc": 1625006729.0,
    "distinguished": null,
    "edited": 1625454381.0,
    "id": "oajg67",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_oajg67",
    "num_comments": 292,
    "permalink": "/r/Superstonk/comments/oajg67/629_list_of_trading_platforms_that_will_not_allow/",
    "score": 640,
    "selftext": "**TL:DR - Regardless of this list, you need to double check with your broker. The settings/options may have these setting but in some cases you *may* need to call in order to opt out of share lending. Please make sure you check and double check.**\n\nThese are confirmed brokers/platforms as of today (7/2) that have confirmed they will not be offering share lending. Whether you are on a margin account or cash account, you still need to double check to opt IN or OUT. Also, remember to check your settings/options for the ability to turn *OFF* margin and switch to a cash account. This can help in a lot of cases. Please help add to this list as we go.\n\nThese will be added by those that have verified by phone, chat or email. If there is contradictory information, please post so we can rectify it immediately. Thank you all for helping.\n\n\n\nAJ Bell You invest (UK)\n\nAlly (Opt in)\n\nAvanza (Sweden - opt out)\n\nAvenue Securities (Brasil)\n\nCashApp\n\nCharles Schwab\n\nCIBC Investors Edge (Canada must have cash account)\n\nDegiro (will not lend US shares, GameStop GS2C EU needs Custody Account)\n\nDeutsche Bank (Germany)\n\nDriveWealth\n\neToro (does not lend shares BUT said if they choose to, you *cannot* opt out)\n\neTrade (must opt IN)\n\nFidelity (must have $0 balance in margin account)\n\nFreeTrade (UK - off by default can opt in)\n\nGBM+ (Mexico)\n\nGerman Bank Comdirekt\n\nHargreaves Lansdown (UK)\n\nIBKR (on for new accounts, manually opt out)\n\nInteractive Brokers (off by default, can opt in)\n\nNordNet (Doesn't lend International shares)\n\nPublic (opt out)\n\nQuestTrade Canada\n\nRBC Direct Investing (Canada must have cash account)\n\nRevolut (Uses DriveWealth as 3rd party but no lending)\n\nSaxo\n\nScotiabank iTrade\n\nSoFi (USA Margin account on by default, can turn off by chat or calling)\n\nStake (Australia, NZ, UK, Brazil)\n\nTastyWorks\n\nTD Waterhouse (Canada)\n\nTD/TDA (Turn off margin)\n\nTradeUp (opt out)\n\nVanguard\n\nWealthSimple (Canada verified)\n\nWeBull (option in settings to opt out, must opt in)\n\n\n\n--------------------------------------------------------------------------------------\n\nEdit: Added reminder to turn off margin in settings/options. Also reminder let's have verified info by phone, email or chat so we're accurate for everyone to benefit from.\n\nEdit 2: Alphabetized the list. Sorry for being lazy.\n\nEdit 3: Blown away by the downvotes. If I worked for a HF, guess I wouldn't want people knowing who doesn't share lend either. 🦍🍌\n\nEdit 4: eToro said they will not participate in share lending but if they decide later on, there is no way to opt out.",
    "title": "6/29 - List of trading platforms that will not allow share lending. Will be updated as we go.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oajg67/629_list_of_trading_platforms_that_will_not_allow/"
}