{
    "author": "kaoscurrent",
    "created_utc": 1624960045.0,
    "distinguished": null,
    "edited": 1625010789.0,
    "id": "oa514d",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oa514d",
    "num_comments": 206,
    "permalink": "/r/Superstonk/comments/oa514d/someone_correct_me_if_im_wrong_isnt_today_629_t35/",
    "score": 2520,
    "selftext": "So according to a few posts I've seen today, the last FTD buy-in date was 5/25. I remember during the last FTD cycle some of the wrinkle brains concluded that T+21 (trading days) isn't actually a thing. Instead, the major jumps have been on T+35 (calendar days).\n\nIt seems like everyone accepted this as accurate last month but this week we all forgot and everyone's been hyping up T+21 again. While it's possible that we haven't seen movement because the hedgies are delaying covering as long as possible, what if we were just expecting something to happen on the wrong date?\n\nI get why we like T+21 (It's the highest number I can count up to when naked!), but I remember reading some seriously good DD on why T+35 is actually where it's at.\n\nSo I pulled out my calendar and my abacus tonight, and guess what! After some serious counting, I've concluded that today 6/29 is T+35 from the last jump on 5/25! Woo! \n\nTA;DR - Buy, Hodl & Buckle Up! We may see some fun upward movement today! \n\nIf not, there's always tomorrow! 🚀🚀🚀\n\nEdit: Welp. Just sideways movement today guys. So I guess my premise was wrong even though my counting was right. \n\nThanks to everyone who awarded (anonymous all-seeing eye!) and commented on my post though. I still think this is something worth getting to the bottom of and there was some great discussion in the comments.\n\nu/Challenge_The_DM pointed out that the run-up earlier this month may have been caused by shorts covering their FTD's early in order to throw us off. They now know that we know and don't want us catching on to their sneaky ways. If this is the case, that would reset the T+35 cycle and would put the forced covering date around 7/14! Vive la révolution!\n\nA few users were confused about T+35 and whether it's trade days or calendar days. Thanks to u/ScrotyMcBoogrballs for pointing out this line from the SEC's website on FTD's:\n\nhttps://www.sec.gov/investor/pubs/regsho.htm\n\n\"Rule 204 provides an extended period of time to close out certain failures to deliver. Specifically, if a failure to deliver position results from the sale of a security that a person is deemed to own and that such person intends to deliver as soon as all restrictions on delivery have been removed, the firm has up to 35 calendar days following the trade date to close out the failure to deliver position by purchasing securities of like kind and quantity.\"\n\nJuneteenth, weekends or other holidays wouldn't affect the 35 calendar day count.\n\nMost importantly, I think, u/DoubleSunday307 pointed out something crucial. If we use all our limbs and orifices, we can all count up to 35 while naked! Win!\n\nLastly, I didn't mean this post as FUD or to imply that the MOASS was going to start today. It's simply fun to try to stay one step ahead of the hedgies and try to get a glimpse of what lies behind the curtain. \n\nLet's go!\n\nEdit 2: Our very own T+35 guy, u/dentisttft commented and noted that there weren't very many FTD's that needed to be covered today. He said there are actually some FTD's that have to be covered on Thursday so we may see some upward movement then.",
    "title": "Someone correct me if I'm wrong: Isn't today 6/29 T+35 from the last FTD buy-in?",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oa514d/someone_correct_me_if_im_wrong_isnt_today_629_t35/"
}