{
    "author": "FeliciusFlamel",
    "created_utc": 1618617103.0,
    "distinguished": null,
    "edited": 1618617274.0,
    "id": "msfngy",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_msfngy",
    "num_comments": 4,
    "permalink": "/r/Superstonk/comments/msfngy/dfvkeith_gill_youre_already_an_legend/",
    "score": 18,
    "selftext": "Dear Keith, \nyou inspired so so many apes all around the world, not only to make some money... no.\n\nOnly because of you I learned more about the stock in my entire life than I could've ever imagine.\nAbout the good and the bad, how to make money and how preserve it.\n\nHow to stand your ground, to hold when times calls for it and to know when the fight is done.\nI learned about people and their lives, their struggles and hopes. \n\nWe all become friends, even a family.\n\nI don't know when we'll go to the moon but my gut tells me it's pretty soon, I think I won't be able to but another share before the MOASS.\n\nI feel like Frodo and Sam at the end of the story, exhausted and relieved. I'm completely zen.\nFor all that's worth, DFV, RC, Gamestop and apes you all made this journey the best I've had so far.\n\nI am more than grateful being a part of this and I hope we'll change the future and make it brighter as we could've imagine.\n\nIt feels like the end now tho the MOASS isn't here but it's not apes. This is only the beginning of something so extraordinarily wholesome that I'm excited like a five year old who can buy what he wants in Toys'R'us.\n\nI'm proud of you Keith for what that's worth to you, you changed my life and that of most of the people here, probably you've changed the course of history man.\n\nKeep your head high, your tits jacked and your hands diamond. \n\nAlright I'm crying now so that's it for today.\n\nI love you all❤",
    "title": "DFV-Keith Gill, you're already an legend",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/msfngy/dfvkeith_gill_youre_already_an_legend/"
}