{
    "author": "Starwarsandbacon",
    "created_utc": 1623726217.0,
    "distinguished": null,
    "edited": false,
    "id": "o044za",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o044za",
    "num_comments": 85,
    "permalink": "/r/Superstonk/comments/o044za/everybody_at_the_top_in_the_financial_world_is_at/",
    "score": 1670,
    "selftext": "I read u/possibly6 (Elliot Wave Guy) update from today and the SPY puts being Citadel's largest position, along with all the others holding those same puts, got me thinking.\n\nThey obviously see the coming crash, to think they haven't seen it coming far longer than us, is criminal self-deception. They are preparing to make as much money on the way down as they possibly can.\n\nOn the way down in a collapse they created. They are going to make even more money after they cause the market to implode. Let that sink in.\n\nEven if they didn't do anything that lead to the collapse (hardly likely), they stood by and did nothing while the rest of the industry went right ahead and fucked main st and ruined lives, again. When you stand by and let illegal things happen when you are in a position of responsibility, you are just as complicit in the crime being committed as the actual perpetrator of the crime. More so if your job is to stop said illegal activity and you knowingly let it continue. (Looking at you SEC and Finra)\n\nFUCK\n\nTHESE\n\nFUCKING\n\nFUCKS\n\nEVERY\n\nFUCKING\n\nLAST\n\nFUCKING\n\nFUCK\n\nTo any employee inside one of these firms that could actually blow the whistle on these guys, be the hero humanity needs. Gather all that damning evidence and release it onto the internet before you go into hiding.",
    "title": "Everybody at the top in the financial world is, at the very least, guilty of allowing the coming financial crash to happen.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o044za/everybody_at_the_top_in_the_financial_world_is_at/"
}