{
    "author": "Wallstreet_Owes_Me",
    "created_utc": 1628013782.0,
    "distinguished": null,
    "edited": false,
    "id": "ox93kt",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ox93kt",
    "num_comments": 28,
    "permalink": "/r/Superstonk/comments/ox93kt/citadels_connection_with_cboe_global_markets_and/",
    "score": 514,
    "selftext": "Hi Apes, \n\nI hope you all find this useful and as interesting as I do. I wanted to share with you what I have found that shows Citadel’s Connection with CBOE Global Markets and its CEO, Ed Tilly. How the two may be working together to cause the artificial price drop we are currently seeing with GME through the Dark Pool’s and multiple CBOE exchanges.\n\nLets start with CBOE. **Cboe Global Markets** is an American company that owns the [Chicago Board Options Exchange](https://en.m.wikipedia.org/wiki/Chicago_Board_Options_Exchange) and the stock exchange operator [BATS Global Markets](https://en.m.wikipedia.org/wiki/BATS_Global_Markets). On March 1, 2017, CBOE Holdings Inc. acquired Bats for $3.4 billion.﻿ This makes it part of the second-largest U.S. equities exchange in the world. In addition to operating at a major player in European and forex markets, the CBOE is the second-largest U.S. options market by volume.\n\nSide Note: **Bats Global Markets** is a global stock exchange operator based in Lenexa, Kansas, with additional offices in **London, New York, Chicago, and Singapore**. Guess who else has offices located in these ares? Thats right, **Citadel** has Offices located in **London, New York, Chicago, and Singapore.** \n\n*Cboe and Citadel Headquarters are both located in Chicago, Illinois*. As a matter of fact, according to Google Maps, they are 8 minutes apart from each other...IF YOU WALK!!! Wonder how many time Ed and Kenny have had lunch together to discuss \"business\". \n\nCboe Global Markets owns and operates four options exchanges: Cboe Options Exchange, Cboe C2 Options Exchange, Cboe BZX Options Exchange, and Cboe EDGX Options Exchange; seven equities exchanges: **Cboe BZX Exchange**, **Cboe BYX Exchange**, **Cboe EDGX Exchange**, **Cboe EDGA Exchange**, Cboe BXE Exchange, Cboe CXE Exchange, and Cboe DXE Exchange; one futures exchange: Cboe Futures Exchange; and one foreign exchange marketplace: Cboe FX.\n\nNow lets take a look at GME volume by exchange from yesterday, 8/2/2021. In first place was **ATS exchanges (Dark Pools) with 46.31% (1,164,915 shares).** In second comes **Cboe EDGX with 15.38% (378,139 shares)**. Fifth, we have **Cboe BZX with 3.38% (84,908 shares)**. And to finish it off we have **Cboe EDGA with 0.96% (23,707 shares)** and **Cboe BYX with 0.53% (13,032 shares)**. The total volume in Cboe, including the Dark Pools, was a whopping **66.56% (1,664,701 shares).** After subtracting that volume from the total volume of the day it leaves us with **33.44% (851,074 shares)** traded on other large lit exchanges such as the NASDAQ and NYSE. This has been this way many times recently. I cannot see how this isn't some kind of collaboration. Could I be very wrong? Absolutely. Probably not though. \n\n[https:\\/\\/chartexchange.com\\/symbol\\/nyse-gme\\/stats\\/](https://preview.redd.it/7xs9jzbxc6f71.jpg?width=1284&format=pjpg&auto=webp&s=376662b4c34cac7aa9180b3d01224213e88ea689)\n\nNow lets look at Cboes CEO, Ed Tilly, and his relationship with Citadel and Kenny.\n\n**Citadel featured Ed Tilly and \"his accomplishments\" on their webpage.**\n\n[Ed Tilly on Citadel's Webpage](https://preview.redd.it/zoqfpqlsg6f71.jpg?width=1284&format=pjpg&auto=webp&s=54bc11f4de6f3ecb2522e1e4ce8dc35cb7dcaf10)\n\n**Oh, and he was on their Twitter page.**\n\n[Ed Tilly on Citadel's Twitter Page](https://preview.redd.it/400a16yzi6f71.png?width=1378&format=png&auto=webp&s=85c29182afd2e0c5aa6f4e557bfd49496d8c411d)\n\n**And guess who was selected many years ago as one of Cboe's Designated Primary Market Makers (DMM)?** Here is a list of Securities, Security names, and DMM that are listed with Cboe [if you are interested.](https://www.cboe.com/us/equities/listings/trade_on_cboe/lmm/securities/)  Needless to say Virtu Americas LLP. shows up a lot on there also. \n\n[Citadel Selected as DMM for Cboe Futures.](https://preview.redd.it/167hgyq7i6f71.jpg?width=1284&format=pjpg&auto=webp&s=43dfd851f69bb802ef184cd7da5303ea66c7e2c2)\n\nWe all know how Citadel and Virtu Americas have traded more OTC GME shares than anyone else over the past 6-8 months. Also, we know GG has his eyes on them...RIIIIGHT!\n\nhttps://preview.redd.it/0xv97gisk6f71.jpg?width=1284&format=pjpg&auto=webp&s=6b67769f191971fb6778786669d70af0d3b2a531\n\n**This is January's OTC Data from FINRA. We see who are the top two players in the game and its been like this. Its not new.** \n\n[FINRA OTC January Data](https://preview.redd.it/o29s6fz2l6f71.png?width=1137&format=png&auto=webp&s=5add73d7adb6fc0a94c0ec8eaa7cc427c0c8d8dc)\n\nReal quick before you go, lets look at the **ATS (Dark Pool) Trading for GME on the weekly chart using the DIX (60) Dark Pool Indicator**. Notice if you will the green bars at the bottom and how they have shot up since the January run up. Thats the dark pool trades compared to the pre-run-up red bars before January. Yea, its not normal. \n\n[GME Dark Pool Indicator](https://preview.redd.it/e1203we2m6f71.png?width=2556&format=png&auto=webp&s=423288d92c3c58e8d3478c56c7fff81ec64df434)\n\nIs it possible that I am digging and looking for something that isn't really there. Sure. And if I am I am positive I will get called out in the comments. But that's ok. Its how I learn. I could add a lot more to this post but I wanted to show the basics. And If I am wrong it is going to take a whole lot to convince me otherwise.\n\n**TL;DR: Citadel’s Connection with CBOE Global Markets and its CEO, Ed Tilly. The two may be working together to cause the artificial price drop we are currently seeing with GME through the Dark Pool’s and multiple CBOE exchanges. Also, the ATS (dark pool) trading has been off the hook since January's run-up.** \n\n\\*\\*This is NOT financial advice. I don't even really know what I am talking about\\*\\*",
    "title": "Citadel’s Connection with CBOE Global Markets and its CEO, Ed Tilly. How the two may be working together to cause the artificial price drop we are currently seeing with GME through the Dark Pool’s and multiple CBOE exchanges.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ox93kt/citadels_connection_with_cboe_global_markets_and/"
}