{
    "author": "SneakySub",
    "created_utc": 1621923540.0,
    "distinguished": null,
    "edited": 1621936166.0,
    "id": "nkiuzr",
    "text_only": true,
    "flair_text": "💭 Opinion 💭",
    "name": "t3_nkiuzr",
    "num_comments": 439,
    "permalink": "/r/GME/comments/nkiuzr/potential_reason_for_the_180_wall_and_what_kenny/",
    "score": 2541,
    "selftext": "So I am a financial analyst, but this is definitely not financial advice. I know that the most commonly accepted theory for the 180 wall is that we have some juicy margin calls behind it. But what if the goal is much much simpler than that.\n\n\n\n\nKenny G's aim is to survive and to do this in the long term he needs to be able to consistently buy at as lower price as possible. As we have been seeing over the past weeks small amounts of volume are causing relatively significant increases in price. So its clear that liquidity is drying up. So to be able to cover Kenny boy needs liquidity to increase otherwise any attempt to cover triggers the MOASS. So how can they increase liquidity well there is only one way to, make people want to sell their stock, now we all know there is plenty of FUD going around so what else can they do? Well they create a price wall of course. This is to encourage every diamond handed ape to slowly start to day trade after all if it was any other stock would you not day trade if you knew it had a certain price limit? Price goes above you sell under you buy. By making this limit it encourages people to sell when it's passed and buy when it's low. With this Kenny is hoping to create a limit that he doesn't have to short to hold because day traders will do it for him. This also ties in with all the XX Vs xxx apes that we have been seeing, the idea is to make you think XX isn't enough so how can you get more.... well day trade....\n\n\n\n\n\nAs always buy hold💎🙌\n\n\nTADR:\n\n\n\nDay trade bad.\n\n\n\nBuy hold💎🙌\n\n\nEdit1: To be clear don't want to separate apes into X XX etc, trying to explain the danger in doing it.  Apes together strong!!",
    "title": "Potential reason for the 180 wall and what Kenny is up to now.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GME/comments/nkiuzr/potential_reason_for_the_180_wall_and_what_kenny/"
}