{
    "author": "moonski",
    "created_utc": 1625155245.0,
    "distinguished": null,
    "edited": 1625155719.0,
    "id": "obouqn",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_obouqn",
    "num_comments": 99,
    "permalink": "/r/Superstonk/comments/obouqn/ape_101_how_to_make_212s_life_a_misery_get_them/",
    "score": 1452,
    "selftext": "So this post is on the front page about 212 not facilitating transfers: https://reddit.com/r/Superstonk/comments/obk7qj/update_on_t212_share_tranfers/\n\nSo wut do?\n\nIf you’re in the uk there is one thing. It’s called the financial ombudsman service (FOS). It’s great. Banks don’t like it because it gives customers power. Banks will just straight up pay customers, depending on complaint, to avoid dealing with the ombudsman service procedure. \n\nNow when do banks ever willingly given out money? \n\nIt’s because complaints procedures in finance are regulated. You **have** to deal with them. You have to have a formal complaints procedure. You have to respond to the Financial Ombudsman. You cannot ignore this. This is why banks and the like always try to just deal with complaints ASAP and rather pay out directly than have to bother doing the whole complaints thing. \n\nThe only caveat here is you can only goto the FOS after you have complained to the financial service, and they have responded to your complaint but you aren’t satisfied. You can’t go directly to them in the first instance. \n\nSo What UK apes need to do is all formally complain to 212 about refusing share transfers after a change in policy made them want to leave the platform. \n\n212 will eventually respond, likely saying “soz no can do”. But That’s good though. It means you can goto the ombudsman. \n\nGoto the FOS & They’ll start an investigation. It takes time but they do it.  They’ll really start an investigation if they get numerous similar complaints… \n\n**So** \n\nDo this. \n\nComplain to 212 using this email - **info@trading212.com**\n\nMake sure you include the following:\n\n complaint sent by the client shall include:\n\n-\tthe client’s name and surname;\n-\tthe client’s username;\n-\tthe date on which the issue arose;\n-\tthe affected transaction numbers, if applicable; and\n-\ta clear and logical description of the issue.\n\nEvery 212 user should do this. \n\nWhen they respond and say no, goto the Ombudsman and fill out their form. \n\nIdeally they fix their shit, but if they don’t then every 212 user goes to the UK FOS, it will cause a shit show for their compliance team & forces them to, you know, let people transfer their own fucking assets. \n\nThis is the way. It may take time, but it will annoy the fuck out of them & will lead to them changing this policy, one way or another. \n\n*Source worked in uk banking.*",
    "title": "Ape 101 - How to make 212s life a misery & get them to allow transfers using UK regulation.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/obouqn/ape_101_how_to_make_212s_life_a_misery_get_them/"
}