{
    "author": "Parsnip",
    "created_utc": 1625118900.0,
    "distinguished": null,
    "edited": 1625126404.0,
    "id": "obfeoo",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_obfeoo",
    "num_comments": 322,
    "permalink": "/r/Superstonk/comments/obfeoo/diamantenhände_german_market_is_open/",
    "score": 3313,
    "selftext": "Guten Tag to all of you Great Apes across the world! 👋🦍\n\nAnother sideways day on ridiculously low volume! Our Diamantenhände didn't falter, but I'm sure the number 210 is going to be remembered until at least Friday. Reverse-repos set another new record - $991b! And last, but certainly not least, RC tweeting sparked a sudden and intense interest in bricklaying and masonry. Bullish! Let's see where the German markets take us on this first day of July! Join apes around the world to watch low-frequency updates from a single German exchange as we prepare for the US pre-market to open!\n\n###🧱🚀 Buckle Up! 🚀🧱\n***\n\n\r\n- 🟩 120 minutes in: **$213.80 / 179,53 €**\r\n- ⬜ 115 minutes in: $213.71 / 179,45 €\r\n- 🟥 110 minutes in: $213.71 / 179,45 €\r\n- 🟩 105 minutes in: $214.09 / 179,78 €\r\n- ⬜ 100 minutes in: $213.94 / 179,65 €\r\n- 🟥 95 minutes in: $213.94 / 179,65 €\r\n- 🟥 90 minutes in: $214.03 / 179,72 €\r\n- 🟩 85 minutes in: $214.30 / 179,95 €\r\n- 🟩 80 minutes in: $213.94 / 179,65 €\r\n- 🟩 75 minutes in: $212.52 / 178,45 €\r\n- 🟥 70 minutes in: $207.93 / 174,60 €\r\n- 🟥 65 minutes in: $212.22 / 178,20 €\r\n- 🟥 60 minutes in: $214.66 / 180,25 €\r\n- 🟩 55 minutes in: $214.72 / 180,30 €\r\n- ⬜ 50 minutes in: $214.69 / 180,28 €\r\n- ⬜ 45 minutes in: $214.69 / 180,28 €\r\n- ⬜ 40 minutes in: $214.69 / 180,28 €\r\n- 🟥 35 minutes in: $214.69 / 180,28 €\r\n- ⬜ 30 minutes in: $214.96 / 180,50 €\r\n- 🟥 25 minutes in: $214.96 / 180,50 €\r\n- 🟥 20 minutes in: $215.37 / 180,85 €\r\n- ⬜ 15 minutes in: $215.64 / 181,07 €\r\n- ⬜ 10 minutes in: $215.64 / 181,07 €\r\n- 🟥 5 minutes in: $215.64 / 181,07 €\r\n- 🟩 0 minutes in: $215.70 / 181,12 €\r\n- 🟩 US close price: $214.14 / 179,81 €   *($214.15 / 179,82 € after-hours)*\r\n\n\n***\nFAQ: To generate this data, I'm capturing current prices in Euros at https://www.ls-tc.de/de/aktie/gamestop-aktie and converting to USD. Today's EUR -> USD conversion ratio is 1.19089584. I created a simple C# application that assists me in scraping this data and updates the post automatically.\n\nToday I continue testing of an alternate method of fetching data, using quote data from Yahoo Finance APIs to calculate an average of 7 German exchanges and volume. Those results will be posted in the comment section.\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Last weekend, DerGurkenraspler appears to have deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/obfeoo/diamantenhände_german_market_is_open/"
}