{
    "author": "RocketTraveler",
    "created_utc": 1625168227.0,
    "distinguished": null,
    "edited": 1625168773.0,
    "id": "obteg7",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_obteg7",
    "num_comments": 292,
    "permalink": "/r/Superstonk/comments/obteg7/gme_the_powder_keg_ready_to_explode/",
    "score": 4678,
    "selftext": "Hey all,\n\nGME is a massive powder keg about to explode.  Curious?  Read on to find out more...\n\nA very reliable technical indicator created by Rocky Outcrop is flashing a rare signal that cannot be ignored.\n\n**Full credit goes to Rocky Outcrop and Trade Spotting for creating this custom DMI indicator and sharing it with the masses.**\n\n# TLDR\n\n* The Directional Movement Index (DMI) started flashing a powder keg signal on June 29th.  This signal has only flashed three other times in all of 2021\n* The ignition source of the signal (the ADX line) is at it's fourth lowest point **since 2018**.  The lower the ADX goes, the more certain we can be of a near-future run-up\n* When the powder keg explodes, expect volatility and momentum to **skyrocket**\n\n# DMI\n\nThe Directional Movement Index (or DMI for short) is a technical indicator made up of three components:\n\n* **DI+**: This shows the current momentum of positive price movement.  This is shown in **YELLOW** on my charts below\n* **DI-**: This shows the current momentum of negative price movement.  This is shown in **PINK** on my charts below\n* **ADX** (Average Directional Index):  This shows the *strength* of the current price movement.  This is shown in **BLUE** on my charts below (crossover points denoted in orange)\n\n**The powder keg signal:** When the DI+ and DI- lines converge (come together) **AND** the ADX line is simultaneously at a low point, the powder keg is lit.  This is denoted by a **gray background highlight** on the charts below\n\nWithout further ado, here are the charts:\n\n# Current Price Action\n\n[Current Price Action.  DMI Power Keg lit as of June 29th](https://preview.redd.it/lklugrdlhn871.png?width=1032&format=png&auto=webp&s=4678d387e3ac1f692432e9117266407ce291cd1c)\n\nAbove shows our current price action over the last 6 weeks.  As we have been consolidating from June 9th, the DI+ and DI- lines have converged and the ADX is at an extreme low.  Notice the powder keg signal flashing (light grey box) as of June 29th.\n\n# Historical Price Action\n\n[Historical Price Action.  Multiple Signals Flashing over 2021](https://preview.redd.it/tsvvhn7mln871.png?width=1098&format=png&auto=webp&s=c88a922bbf50331713f897de4995ba44ac13a078)\n\nThis is only the **4th time this entire year** the DMI powder keg has been lit\n\n* The first signal was flashed at the end of February roughly 1 week before our huge run-up from $40 to $350\n* The second and third signals were flashed together roughly 2 weeks before our May run-up from $140 to $350\n* The fourth signal just started flashing on June 29th.  This would indicate a huge move up in the next 1-2 weeks.  Run-up to commence from $200 to ???\n\n# Bonus Chart\n\n[Historical ADX Data](https://preview.redd.it/m19pl7zxjn871.png?width=1538&format=png&auto=webp&s=56a9d0a9096ea3b1dd860b035d812d0c5455a879)\n\nBonus chart!\n\nThe ADX is the fuse that ultimately ignites everything as it shows the current momentum has stalled and volatility is ready to pick back up again.\n\nSince **2018** the ADX has only ever been this low **THREE OTHER TIMES**.  The most recent low point is happening right now!  Historically speaking, GME is in a situation where it is ready to explode any day.\n\n# Footnote\n\nFor those who believe TA is invalid on GME and other SHF-manipulated stocks, I respect your opinion.\n\nMy opinion? TA is not the holy grail by any means, but it is still valid on GME.\n\nWhy? Because TA relies heavily on human patterns and emotions as they relate to stock prices. GME is no exception. There are still support and resistance levels like everything else.\n\nYes there is **no denying** GME is heavily manipulated, but that doesn’t change the larger philosophy TA is based on.\n\nRemember, TA is not a crystal ball but it does offer a glimpse into the **most likely** outcome.\n\nTo each his/her own.\n\n***I am not a financial advisor and this is not financial advice***",
    "title": "GME: The Powder Keg Ready to Explode",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/obteg7/gme_the_powder_keg_ready_to_explode/"
}