{
    "author": "No1Important_4real",
    "created_utc": 1625161500.0,
    "distinguished": null,
    "edited": 1625162288.0,
    "id": "obr28i",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_obr28i",
    "num_comments": 92,
    "permalink": "/r/Superstonk/comments/obr28i/si_for_june_calculated_including_dark_pools_13_to/",
    "score": 910,
    "selftext": "**TLDR**; A super conservative estimate we should be well over 250% SI total and our SI grew by at least 13% last month\n\n&#x200B;\n\nI have gone through on every exchange and extracted their daily volume reports and compiled it, including dark pool. I wasn't able to get reports for any of the NASDAQ exchanges, the MIAX Pearl, LTSE, MEMX, or IEX. Despite that I was able to verify 80% of all the daily volume and find which shares in that volume were short.\n\nI then averaged their daily short to long ratio and every exchange averaged, for the month, a ratio between 50% and 75% short (more shorts than longs) except the NYSE Darkpool which had a 43% ratio. Conservatively, based on that information, we can assume all the other exchanges are at least 30% short on their average volume.\n\nIf I had access to NASDAQ daily info, I would be able to verify another \\~15% or so of the daily volume, with another \\~5% in the IEX. If anyone has access to that data, please DM me.\n\n&#x200B;\n\nhttps://preview.redd.it/iu55ztpgvm871.png?width=815&format=png&auto=webp&s=776fc02e0b1e8c75b55c38c4694a5ede9be180e1\n\nTotal shorts is a total count of all short positions confirmed by the exchanges I could access\n\nTotal Volume is the reported daily volume by Bloomberg\n\nMinimum Shorts is the difference between Total Volume and Total Shorts. This number is the absolute minimum. It assumes that every long trade was a closing of a short position.\n\nVolume Seen expresses the amount of volume I audited against the total volume. A Volume Seen of 79% means I was able to verify the short ratio on 79% of all the trades that day.\n\nUnseen Vol is the number of trades in a day I could not verify if they were short or long.\n\n30% Short is an estimation if the Unseen Vol was 30% short, what the total number of shorts would be in that day.\n\nSpec Shorts is related to speculative number of short positions they created or closed on a given day.\n\nFinally, Running is a running total for the month.\n\n&#x200B;\n\nI wanted to get this out there for other people to view and consider. I find three interesting take-aways\n\n1. While 30% is an overly conservative estimation on the unseen volume, it still shows an increasing SI. If the number is 50% (still conservative) the monthly SI becomes +40%, or 23M shares. If it's 75%, the SI becomes +74% or 42.74M shares.\n2. Minimum Shorts, Spec Shorts, and the numbers I just talked about for 50% and 75% on the unseen volume, all of those calculations assume that every long trade closes a short. That will not be the case, making the real SI even higher.\n3. It's also of important note, June has been a very low volume month, and therefore low number of shorts generated. The months before June would of created MANY more short positions. Just for fun, if you measured the total volume of this month to the growth of the SI (13%), you'd get 1% growth per 14M volume. Extrapolate that back to March and you get +82% SI. If Junes SI growth was 40% (more realistic), it would be +254% SI growth from March.",
    "title": "SI for June calculated, including Dark Pools: +13% to total SI in one month",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/obr28i/si_for_june_calculated_including_dark_pools_13_to/"
}