{
    "author": "ItsAllJustASickGame",
    "created_utc": 1621990495.0,
    "distinguished": null,
    "edited": 1622024973.0,
    "id": "nl4jqk",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nl4jqk",
    "num_comments": 510,
    "permalink": "/r/Superstonk/comments/nl4jqk/ive_been_in_the_game_industry_for_over_10_years/",
    "score": 10318,
    "selftext": "This is going to make the fundamentals of Gamestop incredible. I would buy every, single, game, ever, on their platform if I could resell it when I was done.\n\nOne thing that must be done is some of the cut of the used game sale MUST go to the developer. If GameStop hoards all the second hand sale, I will be immensely disappointed and that would be the old GameStop coming out. This is something our industry HATED GameStop for originally when hard copy sales were the primary form of sales.\n\nThe digital games marketplace has been a boon to developers because they can't be resold. If you want to decimate the indie games industry, don't give them a cut of second hand sales. Yes. You can argue that good games will always do well, but indie games are extremely risky. I knew someone who spent 4 years on a game only for it to sell well enough for her to make poverty wages when amortized. It was a good game, too. Just niche. Now imagine if resales ate into her profits and GameStop got all of them. That would be essentially hiring slave labor for GameStop to turn a buck. It's not right.\n\nI'm sure RC has thought of this, but as a game dev who hated the old GameStop, I feel like I need to say this, just in case.\n\nBuy. Hodl. Vote. I'm soooo jacked on today's price movement. Looking forward to tomorrow, Apes!\n\nEdit: the game is called Calico. Go nuts.\n\nEdit2: I see a lot of used car anti-gme sentiment. Houses and cars are not the same as video games. Cars are an actual asset. Do you let the government amortize expenses on your video games? Stop comparing the two.\n\nArt is all going this way. I didn't see any of you complain when art NFTs came out and gave the art owners 10% of all resales of their art. Video games are art too. As is music. All this will go this way. Get on board or go full boomer.\n\nEdit3: We as devs are opting into this system. If we don't get a cut, we don't have to sell our game on there. Some devs may do it anyway, but I can't think of any good reason someone would sell their game on a platform that cannibalizes its own sales.",
    "title": "I've been in the game industry for over 10 years and a gamer for a lot longer than that. I've been a Steam loyalist since OG Half Life. A second hand digital games market will turn me into a GameStop digital games loyalist overnight. See ya later, Steam. I HAVE ONE REQUEST RYAN!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nl4jqk/ive_been_in_the_game_industry_for_over_10_years/"
}