{
    "author": "peruvian_bull",
    "created_utc": 1627570495.0,
    "distinguished": null,
    "edited": 1627574927.0,
    "id": "otz1kh",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_otz1kh",
    "num_comments": 145,
    "permalink": "/r/Superstonk/comments/otz1kh/evergrande_is_nearing_bankruptcy_chinese_stock/",
    "score": 2840,
    "selftext": "The Evergrande Group is China's second-largest property developer by sales. making it the 152nd largest group in the world by revenue, according to the 2020 Fortune Global 500 List. **The Chinese real estate market has been on a tear for the last few decades, being valued at some measures up to** [**$52 Trillion**](https://www.wsj.com/articles/china-property-real-estate-boom-covid-pandemic-bubble-11594908517). [Lenders, deeply intertwined with the CCP](https://www.businessinsider.com/chinas-real-estate-bubble-is-going-to-bring-down-the-entire-world-2016-8), have blown past lending standards and started authorizing bad loans for developers, even for projects completely underwater, creating a housing bubble that supersedes even the 2008 financial crisis.\n\n&#x200B;\n\nhttps://preview.redd.it/ezfkbn4u06e71.jpg?width=960&format=pjpg&auto=webp&s=70e57a0f58df1a15b99b415324dd9b77daaeaeb9\n\n&#x200B;\n\nhttps://preview.redd.it/pcws5h5v06e71.png?width=849&format=png&auto=webp&s=f33c7b7afd65798dc83a2bcd4bcb31800f43bc19\n\n&#x200B;\n\nDevelopers took on massive amounts of debt to build “ghost cities”- [entire metropolises that remain uninhabited.](https://www.abc.net.au/news/2018-06-27/china-ghost-cities-show-growth-driven-by-debt/9912186) The Chinese government, desperate to continue the massive industrial growth the country has experienced over the last 30 years, pushed the developers to undertake these projects. Now, these projects stand to make near zero revenue, and the firms that funded them look to the developers to repay their debts.\n\n&#x200B;\n\nhttps://preview.redd.it/6nkusl3w06e71.png?width=617&format=png&auto=webp&s=59a03f932d51a6cff46d3a2d458f3843a8dd56f1\n\n&#x200B;\n\nEvergrande’s shares, trading under ticker EGRNF, are now down over 60% in the last 6 months alone. Sofia Horta e Costa explains:\n\n“ The collapse in the valuation of the shares is a problem for a heavily indebted company with narrowing options for raising funds. It’s not just its own shares: subsidiary Evergrande Property Services has lost about $17 billion in value since its February high, while Evergrande New Energy Vehicle is down more than $60 billion in the period. Evergrande controls more than 60% of both firms. The value of Hengten Networks -- a Hong Kong-listed internet services provider in which Evergrande has a 38% stake -- has dropped about $15 billion.\n\n&#x200B;\n\nhttps://preview.redd.it/b88h60cx06e71.png?width=732&format=png&auto=webp&s=38342351ab8827c9161e6a04c255c3bde79a3ce5\n\n&#x200B;\n\nT**he company’s access to freely available cash is also shrinking.** After the shares plunged 16% on Monday following the freezing of a bank deposit, a city in Hunan province halted sales at two of the company’s residential projects, alleging the developer didn’t properly handle funds. The suspension will last until Oct. 13 and Evergrande can’t use funds currently deposited in supervised bank accounts, according to a statement.”\n\nA writer from ZeroHedge continues: “Some of its affiliates missed payments earlier this year, and **Caixin said authorities are probing Evergrande founder Hui Ka Yan's relationship with Shengjing Bank.** Evergrande holds a 36% stake in the bank, and Caixin said the bank lent up to $20 billion to Evergrande via direct and indirect channels.\n\nThe reason why the company has been hammered is simple: as a result of Beijing's strict deleveraging demands targeting the housing developer sector (hoping to prevent a housing bubble), Evergrande's cash has been shrinking fast, and it's getting worse by the day as the company has entered a classical liquidity run (amid ongoing confusion whether Beijing will bail out the company in a worst case scenario).\n\n&#x200B;\n\nhttps://preview.redd.it/n22e8q9y06e71.jpg?width=1223&format=pjpg&auto=webp&s=0798ba6ea52612dc255b34b66f126b3c09c73f27\n\n&#x200B;\n\nThings went from bad to worse last Wednesday, **when four of Hong Kong's top banks - HSBC Holdings Plc, Bank of China’s Hong Kong unit, Standard Chartered and Bank of East Asia - stopped providing mortgages to buyers of China Evergrande Group’s unfinished residential properties in Hong Kong,** the latest sign of dwindling confidence in the developer’s financial strength.\n\nThe mortgage halt “**could be a fresh sign banks are protecting themselves as they’re increasingly worried about Evergrande**,” Bloomberg Intelligence analysts Daniel Fan and William Hau wrote in a note on Wednesday. The development may push Evergrande toward more “radical action,” such as selling a stake in itself to a state-owned Chinese company or pursuing more wide-ranging asset sales, the analysts wrote.\n\nAs Bloomberg notes, the unusual move by the four Hong Kong mortgage lenders to act in unison underscores how dramatically perceptions of Evergrande have deteriorated in recent weeks. And it's not just the company's stock that is getting hammered: the company’s 2025 dollar note sank by about 6 cents on Wednesday to 49 cents on the dollar, an all time low, and suggesting investors are bracing for a potential default absent a Beijing bailout of course.\n\n&#x200B;\n\nhttps://preview.redd.it/lxsisnez06e71.jpg?width=990&format=pjpg&auto=webp&s=794d63f8455de12e3e7f947e33a6f548da446cff\n\n&#x200B;\n\n**An uncontrolled default by Evergrande - one where Beijing does not step in - would likely catastrophic repercussions for China’s financial system,** eroding confidence in other highly leveraged property companies, shadow lenders and potentially even some banks, which is why Beijing will never allow it. Still, the status quo is unlikely to persist  - officials from China’s top financial regulator told Evergrande founder Hui Ka Yan at the end of June that he should solve his company’s debt problems as quickly as possible, emphasizing the need to avoid major economic shocks.”\n\nOn Tuesday, the [Chinese stock market saw its worst two day plunge](https://www.bbc.com/news/business-57979857) since the 2008 financial crisis. The largest Chinese Stock ETF, iShares MSCI China ETF, trading under ticker MCHI, is on pace for it’s worst month in over a decade as the fund tumbled over 13%. [This was exacerbated by a continuing tech crackdown by the CCP. ](https://www.cnn.com/2021/07/27/investing/tencent-meituan-chinese-tech-stocks-intl-hnk/index.html)\n\n&#x200B;\n\nhttps://preview.redd.it/k60i4uy016e71.png?width=734&format=png&auto=webp&s=157c47413001ebf1285934bdee488f75021eb5a6\n\nChinese High Yield Bonds (Junk Bonds) have [also spiked higher](https://finance.yahoo.com/news/chinese-developer-woes-weighing-asia-041232843.html), reaching their highest levels in a year, [signaling growing investor concern about defaults.](https://www.wsj.com/articles/chinese-junk-bonds-flash-warning-signs-11624267802) (Remember, bond yields move inverse to prices, so higher yield=lower price).\n\n&#x200B;\n\nhttps://preview.redd.it/jje8805216e71.jpg?width=1200&format=pjpg&auto=webp&s=dca242bdac1f9fdc8a72c5f3023df9b2ec10f9ee\n\n&#x200B;\n\nhttps://preview.redd.it/bd13qcj9e6e71.jpg?width=1296&format=pjpg&auto=webp&s=a4e3c61a76d5facfc1c181cda142de83c0494fcf\n\nThe Chinese Government has been aware of the development of this housing bubble for years now, and they are watching it [extremely closely](https://www.bloomberg.com/news/articles/2021-03-02/china-worried-about-bubbles-in-property-foreign-markets). China’s top banking regulator said he’s “very worried” about risks emerging from bubbles in global financial markets and the nation’s property sector, sparking fresh concerns about further tightening in the world’s second-biggest economy.",
    "title": "Evergrande is nearing bankruptcy; Chinese stock and bond markets tumble",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/otz1kh/evergrande_is_nearing_bankruptcy_chinese_stock/"
}