{
    "author": "im___always___right",
    "created_utc": 1620073975.0,
    "distinguished": null,
    "edited": 1620098332.0,
    "id": "n46jd9",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n46jd9",
    "num_comments": 908,
    "permalink": "/r/Superstonk/comments/n46jd9/korean_ant_here_why_we_stand_with_you/",
    "score": 9168,
    "selftext": "Hello Apes!\n\nI'm a Korean \"ant\" here, and I am quadrupling down today since I got my insurance check today haha.\n\n&#x200B;\n\nI'm sure you're wondering the influx of korean \"ants\" (apes) who come in support of GME Apes. but WHY? you may ask.\n\n&#x200B;\n\n&#x200B;\n\n[But why?](https://preview.redd.it/acpectmlo0x61.jpg?width=500&format=pjpg&auto=webp&s=2360e0d9542b6f840172ce1f8d1f69ea64ec84fc)\n\n&#x200B;\n\n&#x200B;\n\nBecause this is our last stand. I will give you some context so you understand, we didn't just come out of nowhere. We are very, very much like you Apes in America (or Europe + Africa + Aussie).\n\n&#x200B;\n\n# Corruption\n\nThe corruption is definitely not solely one person's fault; its just that EVERYBODY IS  CORRUPT.\n\n&#x200B;\n\n[He is moonlighting as a pain in the a\\*\\*.](https://preview.redd.it/dkj17l6oo0x61.jpg?width=700&format=pjpg&auto=webp&s=cd230651fd3c2749efe7f4458cfb779d80a4a5fb)\n\n&#x200B;\n\nAs you may or may not know, we impeached our president back in 2016 and got a new one. And his name is Moon Jae In. He started off with an approval rating of 80%. As of yesterday it is 26%, Why? because he was ALSO corrupt.\n\n&#x200B;\n\n&#x200B;\n\n[Korean Hedgie!](https://preview.redd.it/6v4lueito0x61.jpg?width=500&format=pjpg&auto=webp&s=671887ce6b9de24b7f13b4c881b9039f4eec0d14)\n\n&#x200B;\n\nIn 2019, Lime Asset Management, YES A KOREAN HEDGE FUND, was found to be doing stupid and illegal things. They basically (allegedly) used their investor's money to feed themselves and their friends while the fund itself ran dry. It's liquidity dried up and some division exploded, recording a net -100%.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/uryycc8yo0x61.jpg?width=498&format=pjpg&auto=webp&s=96c509455b75c9c553ccaac5b7cd5d7f23233245\n\nFinancial crime is not uncommon in the modern world. However, the administration and the ruling party was reported by journalists (using legalese) to be heavily involved in this fund. They tried to cover it up which backfired against them. Most people were still okay with this because our expectation of the politicians were so low.\n\n&#x200B;\n\n[Don't send your kids to good colleges! Cuz I have to send mine!](https://preview.redd.it/mrj8lkewo0x61.jpg?width=650&format=pjpg&auto=webp&s=2a67bb6cbeff60f00e4ed0762089ee3766722751)\n\nLater that year, it was reported that Moon's most trusted man for the job as Minister of Law and Justice, **Cho Kuk**, was involved in shi\\*y and illegal things regarding his son and daughter's entry to college. This was an outrage because Moon and Cho were the ones advocating \"Colleges shouldn't matter in life\" but in fact it did matter enough for them to lie and cheat, allegedly.\n\n&#x200B;\n\n&#x200B;\n\nAND In 2021, Korea Land and Housing Corp (**LH**). which is an official government branch, was caught in a scandal where the employees **bought the land before they announced it for development**. They also planted TREES so they could be compensated for \"environmental damages\". Not only were they corrupt, they were destroying the environment!\n\n&#x200B;\n\n[Land and Housing? More like Lies and Hubris](https://preview.redd.it/zbeiibt2p0x61.jpg?width=1024&format=pjpg&auto=webp&s=705b837da2f69d05a0278275d233487e39018fa8)\n\nWhy were we mad this time? A studio in Seoul cost $ 340,000 in 2016. Our average salary was $ 30,000. If an Ant saved EVERYTHING we made, they could pay off a studio in 10 years. But you know what's funny? Housing price doubled during this administration. Now a studio is averaging $ 600,000. While the salary is the same. So just like Xenon's Paradox, the Ants would never be able to pay of any mortgage. and need I remind you this is STILL FOR A STUDIO. No sh\\*t we are sensitive about housing prices.\n\n&#x200B;\n\naaaaaaaaaaaaaaaaand funny enough, these guys were caught doing the same thing **Sh\\*tadel** was doing when they were exposed.\n\n&#x200B;\n\n[A government building lit all through the night? They must be really dedicated](https://preview.redd.it/xqp124a0p0x61.jpg?width=652&format=pjpg&auto=webp&s=f628591b83b380a61b43bad001300268ccca9112)\n\nDedicated public servants who are totally not guilty, working diligently through the night\n\nNow, we were mad.\n\n&#x200B;\n\n# \n\n&#x200B;\n\n# Oppression\n\n**A) The expendable Males**\n\nYou might know, young Korean males have to go to the military for 18 months. What does this have to do with anything? Well would you be surprised if I told you:\n\n1: Average soldier's pay was $100 per month (no, not per day) until 2018\n\n2: Smartphones were not allowed until 2019\n\n3: \"Fuck you for your service\" No respect, no compensation for the people who served.\n\n&#x200B;\n\n[Imagine loosing your legs on duty and the government refuses to pay your medical bills](https://preview.redd.it/sq9ifp05p0x61.jpg?width=628&format=pjpg&auto=webp&s=e60d5b3efbbc06e55266fac2c1c311068347fa07)\n\n&#x200B;\n\nThey don't have enough money to pay the soldiers because the big stars and stripes embezzle most of the funds.\n\n&#x200B;\n\n**B) Sexual Conservatism disguised as Feminism**\n\nThis one pretty much explains itself.\n\n&#x200B;\n\n[Teaches \\\\\"Sex=Marriage\\\\\", Biological Reproduction only, and made porn ILLEGAL because it \\\\\"might hurt women\\\\\".  So kids learn VPN first and then go to bad websites. \\\\\"Educators\\\\\" are actually pushing bad behavior.](https://preview.redd.it/idl8s3p3q0x61.jpg?width=1280&format=pjpg&auto=webp&s=850d1ab1c143b8c68fd049ebaf9eef7e2d06c952)\n\n&#x200B;\n\n&#x200B;\n\n**C) \"There's plenty of people who can replace you\"**\n\nThe term **\"Kondae\"** usually refers to Boomers in 40\\~50s (who lived through the 1980s when Korea had a 20% growth rate) who lecture teens and 20-y-os what to do. They were wined and dined by big corporates right out of college, paid off their cheap mortgages in just couple years, and bought Samsung shares when it was a couple Schrutebucks. They became our politicians and big names.\n\n&#x200B;\n\nThese people were now telling us\n\n\"Why can't you just work hard, and be successful?\"\n\n\"Don't invest, put it in your savings account!\"\n\n\"Don't buy internet coins. Focus on real assets!\"\n\n&#x200B;\n\n[This bhad baby said \\\\\"Adults need to teach youngsters what is and is not a good investment.\\\\\" And someone legit made a Token out of this statement and sold it for $2000.](https://preview.redd.it/pmg3pel7p0x61.jpg?width=640&format=pjpg&auto=webp&s=9fcf0fd7f23818d79e336fc7e4bbb851b1e66db6)\n\n&#x200B;\n\n&#x200B;\n\n# A House Divided\n\nThanks to the corruption, hatred, and competition(+housing prices), young people do not want to date each other, let alone get married and have kids.\n\nIn order for a population to be stable you need a birth rate of 2, meaning 2 babies to replace 2 parents.\n\nKorea recorded a whopping 0.84, 198th out of 198 countries surveyed.\n\n&#x200B;\n\n[We will disappear as a race, in Year 2200. A \\\\\"Korean\\\\\" simply will not exist.](https://preview.redd.it/i5iuxb6bp0x61.jpg?width=862&format=pjpg&auto=webp&s=916df6d9026d2c04bf59eef3da6d801bd1cf9dd7)\n\n&#x200B;\n\nSo Korea is a stage-4 cancer patient. Waiting for its death.\n\n&#x200B;\n\n# Conclusion\n\nUs, \"Ants\", grow up watching the corruption, hating and being hated by everybody. In adulthood we endure slave labor, and get degraded and lectured by the Boomers telling us how to be a good little tax payer. And after Covid, we couldn't even emigrate, because we would face overwhelming hate crimes against asians.\n\nYou see, GME is about fighting corruption and stupidity and illegal sh\\*t. Koreans are tired of corruption stupidity and illegal shi\\*s. We are finally pushed to the edge and this is our last stand.\n\nWe say we are apes, and ants, but we are humans aren't we?\n\nWe deserve to be happy.\n\nWe will fight till our six diamond legs fall apart, because this is the endgame for us. We are already ready to die; we are fighting for some dignity before death.\n\n&#x200B;\n\n&#x200B;\n\n**TL DR:**\n\n**Corruption, Conflicts, Oppression**\n\n**Ant want happy like Ape want happy.**\n\n&#x200B;\n\nPS.\n\n**Let's focus more on GME, TENDIES and $ 69,420,000.** I promise to buy you all a drink in Gangnam when this is all over.\n\n&#x200B;\n\nEdit:\n\nThank you so much for reading. It is not easy to care about other countries thousands of miles away, but I forgot this was r/Superstonk. You guys are the hope.\n\nI got so depressed writing this because this is the first time I have actually gathered and put into words how wrong things are in my country. I do not want Korea to be another Hong Kong. If you ask me what I will do with my tendies, I'm not gonna spend it all on lambo... I am going to use it to influence my district politicians to actually care about Human Rights issues. Make them work for the people, instead of stealing tax-payer's hard earned money through insider-trading and outright embezzlement (I also forgot to mention the Korean stock market is such an muddy market; no transparency!)\n\nSomeone was asking for proof I'm actually Korean... lmao so I'll say \\[ 왤긁렇겠 못믿늕겂냪? \\] which only a REAL KOREAN would understand... it wouldn't show up on translation because it is encrypted. YES WE HAVE AN ENCRYPTED WAY OF WRITING.\n\n&#x200B;\n\n&#x200B;\n\n\\++ Why the name \"ants\"?\n\n&#x200B;\n\nKoreans love Aesop's fables, and we often describe ourselves as ants, who are so little and mean nothing to the world, but does all the work he/she can until she dies. We were never in charge, not knowing why we work this hard. It was used as a self-deprecating term.\n\n&#x200B;\n\n[Pre-MOASS](https://preview.redd.it/wsyes75dp0x61.jpg?width=800&format=pjpg&auto=webp&s=4ce861ee9da0916fd4e95ce756eb8b0fe9375076)\n\n[Post-MOASS](https://preview.redd.it/kws80p5dp0x61.jpg?width=250&format=pjpg&auto=webp&s=5208cdebbe470839a4b86980f7b16aa00f5ef9af)\n\nBut we would like to embrace that identity, and become the King of our personal ant Hills.\n\n&#x200B;\n\nEDIT EDIT: Please stop giving me awards! I absolutely do not deserve it! This isn't DD, I was just talking about how we feel. It is really nothing special!!!\n\n&#x200B;\n\nps. ps.\n\nThank you all for the support. I'm tearing up knowing how many kind people there are in the world. I love you all. GME to the MOON!",
    "title": "Korean \"Ant\" here! Why we stand with you.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n46jd9/korean_ant_here_why_we_stand_with_you/"
}