{
    "author": "AlexanderHood",
    "created_utc": 1620781567.0,
    "distinguished": null,
    "edited": 1620792907.0,
    "id": "nacqtm",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nacqtm",
    "num_comments": 104,
    "permalink": "/r/Superstonk/comments/nacqtm/may_update_on_the_marriedput_forensic_analysis/",
    "score": 1182,
    "selftext": "About a month ago I did an analysis for the real short interest (SI) for GME using what know about the legal Married Put mechanism for creating naked shorts.\n\nI wanted to revisit what we know for sure about the mechanism for how the FTD's are hidden, the latest put option open interest and why the new DTC rule about double-borrow shares was implemented. Yes, I know some people don't think these remnants don't mean what we think they mean, but maybe they do.\n\n**TLDR** Married Puts continue to be used to create naked shorts. Short Interest is at least 152% and increasing by over 100,000 shares per week.\n\n**Assumptions**\n\n1. Citadel and friends are using the Married Put method of hiding FTD's.\n\n2. Any Put at a strike of $20 or less is an irrational option play no sane person would make.\n\n3. These apprently irrational puts are in fact part of a rational mechanism for hiding a FTD.\n\n4. The current outstanding number of irrational puts is correlated to the number of FTD's resulting from naked shorts.\n\n\nWhat does irrational mean? Betting GME will drop below $1 by the end of the year is bonkers.\n\n\n**Let's math!**\n\nGME Shares outstanding: 70.77M\n\nGME Float: 47.75M\n\nIrrational Puts from now until Jan 2023:\n\nOption Expiry | Open Interest Apr 18 | Open Interest May 11\n:--|:--|:--\nApr 16 | 7,067 | 0\nApr 30 | 6,124 | 0\nMay 14 | 135 | 683\nMay 21 | 3,648 | 3,990\nMay 28 | 150 | 412\nJun 4 | 0 | 64\nJun 11 | 0 | 11\nJun 18 | 0 | 1,046\nJun 25 | 0 | 13\nJul 16 | 299,922 | 303,927\nOct 15 | 14,736\t| 19,223\nNov 19 | 22,760\t| 22,601\nJan 21, 2022| 220,355 | 224,653\nJan 20, 2023 | 43,984 | 46,136\nTotal puts | 619, 458 | 622,769\n \nShares short from Married Put remnants on April 18th: 61.9M\n\nShares short from Married Put remnants on May 11th: 62.2M\n\n**Ok, what is this?**\n\nThe number of naked short shares implied by Married Put remnants has increased by 331,100 shares in the last three weeks.\n\n* Over 13k of irrational puts that expired worthless in the last three weeks but the total number of Irrational Puts continues to increase. Not only are they are continuing to utilize this method of shorting, but they are increasing in number as well by apx 100k per week.\n\n* Ortex has 'exchange reported' Short Interest at 22.2%, or 10.6M shares.\n\n* Combing the calculated naked short interest of 62.2M with the official short interest, we get 72.8M shares short or *152.5% SI*.\n\n* On May 21st we have another 3,648 of irrational puts expiring, we'll see if they get 'rolled' over as well.\n\n* The next BIG batch of Irrational Puts is set to expire in just 8 weeks, July 16th, over 300,000 or nearly HALF of them our there in fact. If we see a fresh batch of about 300,000 puts get created that day for an Op Ex six months in the future, I'll be on the phone to the SEC telling them they need to end this little charade. But do they need to get rolled? No. If apes keep buying, they need to short that number of shares, whatever the cost and by any means.\n\n**Discussion**\n\nCould the Short Interest be higher than this? ABSOLUTELY. This calculation does NOT include short shares created directly using legal Market Maker provisions and have not yet been covered by that Market Maker. This calculation does NOT include legal short shares created using the re-borrowing method. This calculation does not include shares shorted via the ETF's. (62 [ETF's](https://www.etf.com/stock/GME) hold 10.5M GME shares.) This calculation does not include any other means of shorting.\n\nThe new DTCC rule SR-DTC-2021-005 would prohibit the re-borrowing of a borrowed share. Will that rule apply the NSCC Share Borrow Program as well? Let's hope so. They pulled the draft of this but I'm hoping to see it make a return soon. (See links below for more detail on 005.)\n\nOnce the new DTCC rule prohibiting the re-borrowing of borrowed shares kicks in we should expect the borrowing costs to spike like crazy. It is the end, effectively, and will trigger squeezes everywhere. They pulled the first draft, probably becasuse the timing isn't right. Anxiously awaiting the re-release of 005 and the implementation timing. Aren't we all!\n\n**Disposing of the Evidence**\n\nWhen these expire, they're gone. Wiped off the books. Of course they are, these puts are worthless after all. Never intended to be exercised.\n\n~~HELP! If anyone has the options data from Jan 15th and Mar 16th, would like to see how many more of these puts expired on those dates. i.e. How much were they using this before GME went all baby-squeeze January 28th?~~ Edit: Got the data, stay tuned! Thanks to Full_Option_6067 for the info! There are more shorts!\n\nThe advantage of picking options expiries with each quarter is that you get super-cost efficient strikes at like $0.50 but the big disadvantage is that the open interest SITS out there for months on end, waiting for some smooth-brained apes to figure out what it means.\n\nWhen are they going to end the Married-Put shanannigans? Who knows.\n\n**Total Conjecture**\n\nWhy was 005 delayed? Officially, for \"reformatting\". Tin-foil hat time: After posting it they found out this loophole for legally naked shorting stocks is in widespread use by every Hedgie and on hundreds of other distressed stocks. It's not just AMC and GME. If they nerf it we could be looking at a crack-up boom in the market and dozens of bankrupt hedges. Why a crack-up boom?? I'll give you a few million reasons: [Because every FTD is a naked short](https://wherearetheshares.com).\n\n**The Great Halvening**\n\n[Never forget this happened](https://www.reddit.com/user/RubinoffButtChug69/comments/lfdcv1/fintel_changed_their_short_volume_data_after_my/?context=3)\n\nI saw the Great Halvening happen with my own eyes, so I've just been multiplying all their SI numbers by 2 to figure out the in-adjusted SI. Where they hid the rest of the original '140%' short of GameStop ... remains a mystery.\n\n**Sources**\n\n[Original Post on Married Puts](https://www.reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/)\n\n[DTC-005 Original Doc](https://zenodo.org/record/4718936/files/005%20-%20SEC%20SR-DTC-2021-005-2%20-%20submission%20of%20rule%20finding.pdf?download=1)\n\n[DTC-005 Analysis](https://www.reddit.com/r/GME/comments/mi8mo9/legal_interpretation_of_the_proposed_srdtc2021005/)\n\n[Share Borrowing Program](https://smithonstocks.com/part-7-illegal-naked-shorting-dtcc-continuous-net-settlement-and-stock-borrowing-programs-have-loopholes-that-facilitate-illegal-naked-shorting/)\n\n[Yahoo Finance](https://finance.yahoo.com/quote/GME/key-statistics?p=GME)\n\n[Stonk Tracker](https://gme.crazyawesomecompany.com)\n\n**Edit:** As requested 🚀🚀🚀",
    "title": "May Update on the Married-Put Forensic Analysis",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nacqtm/may_update_on_the_marriedput_forensic_analysis/"
}