{
    "author": "Bye_Triangle",
    "created_utc": 1621013782.0,
    "distinguished": null,
    "edited": 1621013925.0,
    "id": "nce9kq",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nce9kq",
    "num_comments": 50,
    "permalink": "/r/Superstonk/comments/nce9kq/carl_hagberg_ama_transcriptsummary_12/",
    "score": 2047,
    "selftext": "&#x200B;\n\n[\\\\\"... And another one\\\\\" ](https://preview.redd.it/wmd6r8zx94z61.jpg?width=1432&format=pjpg&auto=webp&s=e40eb88b7cf9525252cefa4e8d270225bc00e807)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Hello Apes!** We are back to bring you another transcript/summary!\n\nSince these take a gargantuan amount of work, and there are two AMA’s this week I chose to focus on just one AMA to provide a transcript for. Given the incoming proxy vote and the importance of everyone being informed about our rights with regards to this matter, I felt that Carl Hagberg’s AMA was more pressing.\n\nThat being said, **Lucy Komisar is an absolute SUPERSTAR**, and I do not want to suggest that her AMA isn’t going to be a bombshell. Komisar has an absolutely amazing background. Furthermore, she is one of the only journalists actually understanding and covering our story well, [see this article](https://prospect.org/power/gamestop-mess-exposes-the-naked-short-selling-scam/).\n\n**With that out of the way…**\n\n**Carl Hagberg, you are awesome!** I wish we had more time so you could have expanded more on some of your topics! This was an incredible AMA.  There are so many moments in here that just get me so **HYPED.** This AMA was eye-opening in so many ways. Though, I believe the most important message to take from this, is that **we are the catalyst…**\n\nThat’s right Apes, you and me… and the friends we have made along the way.\n\nWe are about to catalyze the collapse of this entire charade. For once the short sellers aren’t going to be able to get away without repercussions… The only way out was for GameStop to go bust… and we all know that ain’t happenin’. In this AMA Carl explains that the vote count is hugely important here. This is how we truly *Stop* this *Game.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**INTRODUCTIONS**\n\n* Ato\n   * Hello, hello, hello. Welcome to our third live-streamed, Superstock AMA,\n   * We are so excited, I am excited-- Well, I'm stoked. I know, he's probably very excited as well let me tell you about it.\n   * We have Carl Hagberg, who was referred to multiple times through Dr.T’s book, joining us here today.\n   * I pulled this from one of his comment letters to the SEC in 2018.\n      * Carl has nearly 50 years of hands-on experience as a manager of transfer agency, proxy distribution, tabulation, solicitation, and proxy adjudication services. He has also served as an Inspector of Elections at literally hundreds and hundreds of shareholder meetings, including hundreds of proxy contests and numerous other situations. Many of these situations resulted in differences of less than 1% between approvals & disapprovals.\n      * Over the past 25 years, Carl has built and managed a team that now consists of approximately 40 expert Inspectors of Elections who, collectively, have acted at well over 20,000 shareholder meetings\n   * So we are talking to **Dr.T’s number one, go-to guy when it comes to shareholder rights and corporate governance.**\n   * so he has agreed to take time out of the day and talk with us about all of his experience, as much as we can cram into a 40-minute session. and explain how this is going on today and we'll talk about some examples for that.\n   * So let's bring Carl on and give him some time to kind of speak to his own credentials. Car, How are you doing today?\n* Carl\n   * I'm doing great! Greetings everyone!\n   * I'm happy to be here and I, as I told u/Atobitt, I don't recall anyone ever describing me as a **retail shareholder rights advocate,** but you know what, I guess I've been advocating for retail investors for 60+ years and I'm still trying to do it.\n   * I'm a great believer in the power of individual investors. I have to say I'm a pretty good example of someone who's been successful at investing his own money and so, I wish more and more people would pay attention to us so maybe we can get that going.\n* Ato\n   * I think we're kind of preaching the same song there, that's what we're aiming to do.\n   * I believe very much in this movement. Just the fact that we've been able to kind of start documenting this stuff for the past five, six months and then and then put it together into a community that is eager to get more information, has been incredible. I can't remember the last time somebody was interested this much in something finance-related or audit-related. It's unreal.\n\n**TL:DR 🦍 Summary:**\n\n* **Ato and Carl share greetings, Carl explains the sheer length of time he has supported retail investor's rights, especially given he too is a retail investor.**\n* **Carl has an astonishing amount of time in this field, starting when he was just 16 years old, Carl has over 60 years of experience.**\n* **Carl now mainly focuses on managing a team of about 40 Inspectors of Election.**\n* **This is Dr.T’s Go-To guy when it comes to matters relating to corporate elections, and shareholder's rights.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**ROBBER BARONS**\n\n* Ato\n   * So, you are very much appreciated, we appreciate you coming here and giving your background on that.\n   * So, if you want to go ahead and take just a couple of minutes to talk about what are some of the biggest problems that you're seeing right now, or throughout your career? Kind of, walk through the timeline of where this all started.\n* Carl\n   * That'd be great. I think we follow along in my career and my experience in shareholder voting and shareholders being denied votes or being somehow done out of their voting rights. The whole story of *short selling*, and of *naked short selling* and how that can deprive people of their whole investment.\n   * I'll kind of take you along on my experiences along the way. So let me start way back in the beginning, **I started in this industry, when I was 16** I was a college dropout.\n   * I eventually got my master's and my BA, but all paid for by my employer, which was nice, but at the time, I was too young for college so off I went to the stock transfer department of Manufacturers Trust Company.\n   * it was before they merged even with the Hanover bank, and we were a transfer agent, and we were Trust Company, and so **I was in a unit that was in charge of keeping the books were publicly traded companies both their stocks and their bonds,**\n   * and in those days, virtually all of the major transfer agents were trust companies, and there was a reason behind that. There have been a lot of scandalous and ruinous things that had been done when companies were left to keep their own books. Okay? And so, the first rule of being in a trust division was the customer came first and, and we owed our duty, first and foremost, to our customers who were public companies and their stockholders, but the second rule was the debits and the credits, always had to be equal,\n   * In the *bad* old days, about half of the 20th century. When we had the **robber barons, when they needed some extra money, they would print up some new stock certificates and sell them into the market,** but instead of putting the money into the companies, they would keep it for themselves, which is why they would call them Robber Barons.\n   * But then, the SEC was formed and said *we have to stop doing this, we have to make sure that the debits equal the credits* unless you made a public offering and told people what you were selling and how much you wanted to get for it, and then made sure that the money was plowed back into the enterprise itself.\n   * So that's what we did is it as a Trust Company. In those days, as well,  70% of all shares in US companies were owned by individual investors, (editor’s note: WOW) - most of them were rich by the way.\n\nhttps://preview.redd.it/4j0a959ya4z61.jpg?width=577&format=pjpg&auto=webp&s=253691359446b7d16a52480317c160d9645bf869\n\n**TL:DR 🦍 Summary:**\n\n* **Carl explains that he was a ‘college dropout’ but worked his way towards a masters’ degree paid for by his employers.**\n* **Too young for college, Carl made his way to the Manufacturer’s Trust Company, where he excelled with his knowledge of long division.**\n* **Carl states at that time, most companies that dealt with stocks and bonds were ‘trust companies’ i.e. a specific company that acts as a fiduciary, trustee or agent of trusts and agencies.**\n* **This was the case owing to companies doing…** ***questionable*** **things with their own books when left to do it themselves.**\n* **Carl lays out two rules for Trust Companies:**\n   * **1. Customers and stockholders come first.**\n   * **2. Debits and Credits** ***MUST*** **be equal.**\n* **Why? In the time of the ‘Robber Barons’, “.*****..when they needed some extra money, they would print up some new stock certificates and sell them into the market***“ **Sounds like naked-short sellers are just the new Robber Barons**\n* **Finally, a trust company's purpose was to ensure money gained from issued shares was put back into the company, and at that time, retail owned** ***70%*** **of stocks.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**THE PAPERWORK CRISIS - A BIG MESS**\n\n* Carl\n   * It wasn't like a mass democracy. But suddenly, share ownership got democratized.\n   * Somewhere in about the late 50s, early 60s Merrill Lynch had a big campaign “*own your share in America*”.\n   * Millions and millions of people took up this idea, and started to buy shares in American companies and started to do very well because, as we know, when there are lots of eager buyers *that makes prices go up*, so everyone started to do quite well.\n   * And then, around 1958 or 59. We had what was called the **Paperwork Crisis**.\n   * The stock exchanges had to shut down early, they closed every Wednesday when normally they would have been open. *They couldn't keep up with all the paperwork*, in those days there were no computers. They didn't even have handheld calculators until about the late 70s\n   * So anyway, we were working around the clock mandatory overtime working Saturday Sundays to try to keep up with the paperwork and a number of brokerage firms failed because they couldn't balance their books and they couldn't keep track of the money that they couldn't collect money that was due them.\n   * ***So it was a big mess***.\n   * So in the next little phase of my career, **I was present at the birth of the Depository Trust Company**. I had been sort of seconded over by my company to what was called BASIC, the Banking and Securities Industry Committee.\n   * Walter Wriston was there, chairman of JPMorgan Chase, and the Bankers Trust and of the stock exchanges, because they realized, if they couldn't get control of this paperwork mess, the Fed would take them over the way they run the market for Treasury securities\n   * So, they are pulled out of a very profitable business, they said we've got to straighten this thing out.\n   * So, five other colleagues and I, realized that we were the ‘leg’ men, who would go and take surveys and talk to people and try to work on solutions and then write position papers and argue them out.\n   * The banks and brokers, basically hated each other and they didn't really want to do business with each other, but they had to. So that was that.\n   * Pretty quickly-- Within a matter of two years, the paperwork crisis got solved, the volumes were still high. By having a securities depository, and computers (which were brand new). They enabled people to cope with all of this paperwork and substitute bookkeeping, you know accounting entries for paper. And so it was quite a success.\n\n**TL:DR 🦍 Summary:**\n\n* **At some point, share ownership became democratized (i.e. made accessible) to everyone, likely pushed by Merryl Lynch campaigns, and stonks went up with the increase in volume.**\n* **Problem? Paperwork crisis. Put simply, shares were traded by paper and the stock exchanges literally could** ***not keep up***\\*\\*. They didn’t even have handheld calculators, much less computers, so brokerage firms failed\\*\\* ***en masse***\\*\\*. As Carl puts it? It was a big mess.\\*\\*\n* **In order to solve the ‘paper crisis’, Carl and ‘leg men’ like him went out, took surveys, and tried to find solutions.**\n* **The above together with the advent of computing, and the birth of the securities depository, resolved the crisis within 2 years. (Thanks Carl!)**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**THE GOOD, THE BAD, AND THE UGLY**\n\n* Carl\n   * Throughout that whole time, I had always been involved in shareholder meetings, I started going when I was 16 or 17.\n   * It was because I knew long division, since all they had were those mechanical handheld calculators that weighed about 80 pounds, and you know, made *a lot* of noise, interrupting the meeting. But, since I could do long division they let me come, so I've been going to shareholder meetings since I was a kid. You see the good, bad, and the ugly. **One of my greatest lessons was when you saw a management that was really really good.** ***Consider investing***\\*\\*.\\*\\*\n   * When you see management, the CEO was a stinker, that he wasn't nice to his staff, that the staff didn't really like him... (and believe me, I saw plenty) If you have *that* stock, sell it quickly, but anyway let's keep going.\n* Ato\n   * Yeah, that's a really good point, the number of people that are able to own shares and have influence over a company through this shareholder, into the lending of shares and buying of shares.... The prevalence of that speaks volumes to our situation, so getting that direct experience is awesome.\n* Carl\n   * **There had always been some short-sellers as long as I can remember that had been short-sellers, and most of them were opportunists, you know, and they were literally vulture capitalists. They would move in on companies that were sort of weak and then try to drive them down to zero.**\n   * You know, so they could sell while there was still some life in them, and then buy them back… or not even have to buy them back.\n\n**TL:DR 🦍 Summary:**\n\n* **Through this wealth of experience, Carl saw the good, bad, and the ugly in boardrooms, and learned to invest where he saw good.**\n* **Carl clarifies the issue of short-sellers, or** ***vulture capitalists*** **is an issue long faced in the industry.**\n* Carl\n   * So, there was only some of this, but it was never a major thing until sometime in the 90s\n   * Shortly after, I left the bank, Chemical Bank, and so I stayed there a year. I then deployed my tin parachute to go off on my own.\n   * I started a business where I consulted with companies mainly about their retail ownership programs because it costs a lot of money to have retail holders, in those days especially, everything was paper-based.\n   * Then I published a newsletter, where I would try to sniff out problems within the industry that needed that work, and I still do. Then, I started my inspector of election business, but back then it was on a small scale.\n   * Now, it's a lot bigger, because as we've discovered there’s a lot of Hanky Panky going on out there!\n   * Okay, so that's what I did. About that very same time, I started getting calls from clients from colleagues from other transfer agents saying\n      * There's something radically wrong here. We had our shareholder meeting, and we have a million shares outstanding, and we got votes of a million and a half shares\\*\\*. What is going on?\\*\\*\n   * Well, what indeed?\n   * It was because of short selling, you don't even have to have naked short selling.\n   * I'll try to explain in very simple terms how this actually happens, that you have a meeting, and there are 50% more votes than there are shares outstanding, and if you subtract the ones that are held by the management and by long term mutual funds. It's really more like three times the number of shares that are held by real people!\n* Ato\n   * The float.\n* Carl\n   * Yup, the float, That's right.\n   * So we were trying to get to the bottom of this, and we were trying to figure out,\n      * ***Well, how do you stop this?*** , but more important for the given meeting,\n      * ***How do you reconcile this?***\n   * Well, the fact of the matter is, even when you're not ‘naked’ when you borrow the shares and say okay I've set some shares aside, the Lender He keeps his vote, he's still the owner, okay? He's only lent them.\n   * It’s like if I lent you a shovel, I'm still the owner.\n   * and... I still get my voting rights. Meanwhile, if a short-seller actually *sells*… Well, the law of economics says that you cannot have a seller, without a buyer.\n   * So, the short seller sells, then the buyer also gets ownership too! On another set of books.\n   * And so what has happened-- well,  you say, *Alright, I'm going to repay you the loan.* Where you now have to go into the market to buy the shares and close the deal... You've got, what are known as, Phantom Shares.\n   * So, when you have an excess of sellers, as we've seen in GameStop stock, and, you have a finite universe of buyers, the **debits don't equal the credits anymore**. Okay.\n   * **Sometimes the votes are two-and-a-half or three times than the shares that are officially outstanding.**\n   * **This is a** ***very bad thing***.\n\n**TL:DR 🦍 Summary:**\n\n* **Carl explains when he was a young boy (not in Bulgaria) he had been a part of shareholder meetings and can spot a good and bad CEO.**\n* **Carl goes on to explain that the issue of short selling has been going on for years and years, such that even good companies having even a 'bad year' could be shorted out of existence.**\n* **Carl then used his position and experience to create his own company and many clients were then asking, how is it possible 150% of my shares have voted?**\n* **How? Short selling and** ***naked*** **short selling.**\n* **Carl explains that even in non ‘naked’ short-selling situations, both the lender and buyer have voting rights, which leads to an increase above the total percentage of stockholders voting in an AGM.**\n* **When the sellers vastly outweigh the buyers, you have people trading in ‘phantom shares’ such that the sellers and buyers** ***do not match*** **the total stock, or float as we all well know.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**INFINITE LIQUIDITY CHEAT CODE**\n\n* Carl\n   * Sometimes (and people are doing this quite often) they're doing this with malice and forethought. They're looking to drive the company down to zero. Or they can short sell at $50 And they drive the price down to $1 or $2.\n   * When you have unfettered securities lending, okay, and people can just keep lending to you and you can keep doing more deals and sending more shares to buyers, you've diluted the voting power and you've diluted the apparent liquidity for the stock,\n   * **Because what you have is infinite liquidity. You can just keep borrowing more, and you can borrow against what you borrowed.**\n* Ato\n   * I just want to, kind of, drill that home. That is the ***exact*** thing we are seeing right now.\n   * The situation where the attempt (and what we'll talk about this in a little bit) is, for an institution, to short sell a company into oblivion and trigger this criticism or unfavorable position amongst retail owners, to then *abandon* their position, take the loss to where these eventually get completely closed out. So, they don't have that obligation as they do now, where you have so many shareholders that are still holding through all these time periods it's just drying up the volume and the liquidity that is being traded daily right now.\n* Carl\n   * Right. And so around that time when this was so *clearly* out of control-- I have to hand it to the then CEO of overstock.com. That's how I met Dr. T and how I met West Christian\\*\\*(who will be on next week if I am not mistaken(Editor's Note: He’s not mistaken))\\*\\* who's a prominent, highly successful lawyer, in this field.\n   * We were all outraged and it's like wait a minute, how can this possibly be going on. And by the way, there's another element here too, is the short seller-- sometimes they actually have this belief that the company is just a bag of feathers, you know what I mean?\n   * But sometimes, they just exercise their First Amendment rights and spread rumors, and then when you see the stock prices go down, the rumors seem to be **true**, and people act as if they are true and that's how stocks get to **zero**.\n   * So, Overstock and Wes really were... I don't know what the right thing is... (editor’s note: *pathfinders*) let's just say it was an important inflection point to say, *this can't go on here, this is just not right, it's not just it's not legal, it's not ethical,*\n\n**TL:DR 🦍 Summary:**\n\n* **Unfettered securities lending is a very problematic thing. A system such as this allows for what can essentially be described as “Infinite Liquidity” meaning they can just** ***borrow again, and again, what was already borrowed before***\\*\\*.\\*\\*\n* **Further to the last point, these problematic securities lending practices lead to dilution of not only the value of the securities in question but also their voting power as well.**\n* **Ato reflects that borrowing against borrowing (read: hypothecation) is exactly what is going on with GME right now.**\n* **Carl agrees and goes on to state the then CEO of Overstock and Wes Christian led the way in exposing this behavior.**\n* **Carl then goes on to state that sometimes short-sellers** ***genuinely believe*** **a company will go bust, but other times, rumors would spread which, taken together with a fall in stock price, would** ***seem true***\\*\\*, even if it wasn’t.\\*\\*\n* **Carl, Ato and the mods agree such behavior is unethical and illegal.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SUPPLY AND DEMAND, OUT THE WINDOW**\n\n* Carl\n   * I personally knew many companies that folded, not just because their share price dropped. but when it dropped they couldn't borrow any money, and then they could certainly couldn't sell any more stock and their credit rating was ruined,\n   * Before you know it, **good businesses literally have to fold**, they just went bankrupt. They couldn't fund their businesses anymore.\n   * **So, the SEC started to pay a little bit of attention. But I must tell you, this is back in 2000, in the early 2000s mid-2000s, and from that time till now, they have a terrible, terrible, terrible record here.**\n   * So, they did pass a regulation, Reg SHO, and it actually put a bandaid over things, then the market started to simmer down... a little bit anyway. I think mainly for other reasons, but they put this band-aid over, and it kind of quieted down for a bit.\n   * Okay, then lo and behold, came the financial crash of 2008/ 2009, when we saw short-sellers *again*, reaping **tremendous** profits. And then guess what! There *were* instances where many of these firms were destined for failure, but they were being pushed down the drain, twice as fast by everyone giving up on them and selling, and selling short.\n   * So the SEC kind of woke up again, and said, Oh, maybe we need to look again, I have this little thing, it'll take only a minute to read it. They published this big thing here, and it was a **Report of the Office of Inspector General of the Office of Audit of the SEC,** And so here is what that here's what it said in the middle *and they made 11 recommendations* by the way. So, toward the middle it says:\n      * *As we have stated on several prior occasions, (which is an understatement). We are concerned about the negative effect that failures to deliver may have on markets and shareholders. In addition, issuers and investors have repeatedly expressed concerns about failures to deliver in connection with manipulative,” Naked” short selling. To the extent that fails to deliver might be part of manipulative Naked short selling, which could be used as a tool to drive down a company's stock price such fails to deliver may undermine the confidence of investors,*\n   * **which by the way, the understatement of the year,**\n      * *unwanted reputational damage caused by fails-to-deliver might have an adverse impact on the securities price.*\n   * Oh? Don't you read the newspapers? (/s)\n   * Well, anyway so that's what they put out. So then they included 11 recommendations for the SEC to consider. Basically, it was to try to detect things early, get complaints early they were mainly ignoring them, and then follow up on the complaints.\n   * **Well, lo and behold, after all of this, only one of the 11 recommendations was adopted.**\n   * Almost all over the next few years, almost all of the temporary regulations they had put into effect around the time of financial crisis (‘08), they’d all lapsed too.\n   * And Dr.T, who saw this with her own eyes, she saw the effect that was happening in the business world was businesses were adopting new audit standards and they called them *Risk Based Standards*, and it was you judge the risk by the dollar amounts, that's outstanding.\n   * Well that's not really a bad idea… except… as Dr.T said, when the stocks keep falling, falling, falling, they're like problem 1 million on your list of problems.\n   * you decide which problems need attention by the size of the outstanding share value, and so they weren't cutting the mustard and no one was paying any attention.\n   * So, we went along... until the latest round that we're seeing now, where GameStop stock (and there were probably three or four other companies), where people were selling shares, and they were what I call Phantom Shares outstanding, and Phantom votes.\n   * *Except*... those, those phantom votes work really well, that is, if you were lucky enough to get your vote cast. So, that continued along until pretty recently-- actually, through until the present.\n   * **So let's see, what's wrong with naked short selling?** I hope I kind of made this clear, **they create an economic dislocation**, *to put it kindly*. and they basically by providing unlimited liquidity, **they basically take the most** **basic law of supply and demand, and they throw it out the window**\n   * because now suddenly supply of shares is unlimited, and demand is kind of sketchy… *especially* if you're spreading rumors that might be kind of sketchy too. (Editor’s note: Sound Familiar?)\n   * So, that is the biggest problem with this, and the Phantom shares themselves.\n   * Everyone kind of knows, y’know? You go to the supermarket, you don't have to count the carrots in the apples to know what's in demand and what's not and what looks like a good product and what doesn’t.  But, when you have this many more shares floating out there, it distorts the market.\n   * The other thing is… Well… this is basically it; until the trade is settled by delivering the security so that that can be canceled so that the debits equal the credits, you're going to have this continue.\n\n**TL:DR 🦍 Summary:**\n\n* **Carl explains that the issues raised here were noticed by the SEC and have been for some time,** ***except they have a terrible track record of doing anything about it***\\*\\*.\\*\\*\n* **Not even** ***their own report,*** **which detailed actionable steps** ***from their Office of Audit*** **was followed and put into practice. Oh, except 1 of** ***11***\\*\\*.\\*\\*\n* **What’s worse is that temporary regulations, like bandaids on a leaky pipe, fell off and nothing concrete was ever put in place to prevent this from happening.**\n* **Further, these issues and problems never truly saw the light of day as the** ***investigations were based on dollar values***\\*\\*. What does short selling do?\\*\\* ***Decreases the price and therefore, so decreases the chances of investigation and notice***\\*\\*.\\*\\*\n* **Allowing naked short selling throws the laws of supply and demand out the window.**\n* **The only way Carl sees the problem can be resolved is to have debits and credits equal to one another, or this will just keep continuing.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# [Part 2](https://www.reddit.com/r/Superstonk/comments/nceapj/carl_hagberg_ama_transcriptsummary_22/)",
    "title": "🚨 Carl Hagberg AMA Transcript/Summary (1/2) 🚨",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nce9kq/carl_hagberg_ama_transcriptsummary_12/"
}