{
    "author": "missing_the_point_",
    "created_utc": 1627987760.0,
    "distinguished": null,
    "edited": 1627994145.0,
    "id": "ox0wnm",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ox0wnm",
    "num_comments": 406,
    "permalink": "/r/Superstonk/comments/ox0wnm/if_youre_having_any_doubts_that_well_reach_the/",
    "score": 4217,
    "selftext": "First of all, let's just be clear - Short squeezes aren't for your family, friends, coworker, etc. to believe. They happen all the time, every day.\n\nThere have been plenty of occasions where a short squeeze has driven a price up to a ridiculously high peak, with short interest not even close to what GamesStop's is. One in particular, off the top of my head, was DGAZF, which squeezed in August 2020. It ran from $400 to 25,000+ with only 45% short interest.\n\nAnyway, I know this is mostly common knowledge, but ***really*** wrap your head around this...\n\nGameStop is *literally* affecting the entire global economy. The largest dips in the Dow/s&amp;amp;p/NASDAQ have all correlated with the price of one this one, single stock. \n\nLet it sink in, how insane that is and what it means for the potential reach of MOASS.\n\nFor the past 8 months, it's felt like the market has basically revolved around GameStop. I know others have had the same experience - No other stock on my watch list has acted normally since the first spike in January. \n\nFor example, there have been so many periods where everything on my watch list was red, for days (probably hedge funds selling off securities), and I could always count on GME to shoot up after the perceived sell-off period. Another typical pattern I noticed was that GameStop and the rest of my watch list had the exact opposite performance, quite often. Either GME was green and the rest were red or the rest were green and GME was red.\n\nI just hope the new traders understand how significant GameStop's impact on the market really is, because none of this is normal, in any way. I've never experienced anything like it.\n\nTL;DR: The stock is literally affecting the entire global economy. That should give you all the confidence in the world that we have the potential to launch higher than we can dream.\n\nEdit: Not sure why everyone is telling me the market was going to crash anyway. I know that. I'm pointing out how much potential the squeeze has, because GameStop alone has been able to affect major indexes, on multiple occassions. And that's pretty insane.\n\nEdit 2: I wouldn't bother getting into any arguments in the comment section. I think the new shill/bot tactic is to spam posts with rude comments. Most below don't even really make sense.",
    "title": "If you're having any doubts that we'll reach the (current) floor of $40 million, consider this.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/ox0wnm/if_youre_having_any_doubts_that_well_reach_the/"
}