{
    "author": "okaytrader",
    "created_utc": 1625741906.0,
    "distinguished": null,
    "edited": false,
    "id": "og4utl",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_og4utl",
    "num_comments": 5,
    "permalink": "/r/Superstonk/comments/og4utl/a_family_of_diamond_hands_antifud_fuck_you/",
    "score": 34,
    "selftext": " \n\nHey folks!\n\nHere is some anti-FUD non-financial advice!\n\nI bought my first share in January and have bought many many more since then. My floor was $694.20 back then and it's hilarious to think about that now.\n\nOn February 24th I finally convinced my dad to buy some. I had a BIG feeling it was about to pop and he had to buy. He waited... the price went from \\~$40 to $90, I burst into his room and asked if he bought yet - he hadn't.... But then immediately bought at that price. Then he bought more the next day... and the next day...\n\nFast forward, the DD has been laid out and my dad and I are 100% in GME. Then, my SUPER (money) conservative mom decides she wants to jump on. She bought a share, a week later we are surprised to learn she bought seven more shares, and now months later she is a SOLID XX holder.\n\nThen my younger siblings decide they too want to retire early. They buy in. One of my brothers silently cashed out his entire savings and went all-in. The kid doesn't even have a job...\n\nThe point is... This \"family is telling me sell\" FUD is just that, FUD.\n\nI'm in a unique position where all my family members can read and think logically and they are HUGE fans of the stock and the store. The DD has been on point and clear. GME is the only safe asset to hold right now and my entire family knows it.\n\nThey don't text me when the price dumps, they buy more.\n\n\\- 💎🙌 🦍",
    "title": "A Family of Diamond Hands (Anti-Fud, Fuck You Kenneth C*nt Griffin)",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/Superstonk/comments/og4utl/a_family_of_diamond_hands_antifud_fuck_you/"
}