{
    "author": "trashboy_69",
    "created_utc": 1624679301.0,
    "distinguished": null,
    "edited": 1624703467.0,
    "id": "o836fb",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o836fb",
    "num_comments": 285,
    "permalink": "/r/Superstonk/comments/o836fb/the_new_fud_is_making_you_feel_like_your_fellow/",
    "score": 2009,
    "selftext": "Did you notice, that with the immense growth of the sub, the knowledge level sharply declined?  \n \nMy theory is that instead of lame FUD spreading oneliners, a lot of sleeper shills are now among us.  \n \nPosting wrong info knowingly, (asking basic questions), downvoting corrections of misinformation and hyping stuff, that is already debunked. \n \nThe new FUD, imo, isnt in your face “SeLL” “sHoRts R cOvErEd”, but rather making subtle statements, that make an informed investor question the integrity of the whole sub. \n \nEDT: happy some of you agree. Some late examples: upvoting the hell out of the “corrected” exponential floor, downvoting people pointing out russell 2000-1000 adds sell pressure (historically in most cases) and/or that etfs that track russell wont buy shares in AH (would be ludicrous with the spread of ask bid in AH and the amounts those etfs need to trade), but in most cases monday at market, platant goal post moving (t+21 affected by juneteenth lol) \n \nThe last one is a great example. For me, having no noticeable spike on t+21 is not as bad as seeing people try to rationalize the fuck out of why there wasnt..  \n\nSame with the expo floor. So what it broke? If sum 90% die at a drug trial, u dont go “well if they wouldnt have died, the drug would be 100%effective”\n \n*Easy to hype up date - suppress the anticipated- and then move goalposts. \nYou FUD the gullible (nothings happening) and the knowledgeable (Wait, moving the model to fit the chart? Thats delusional, wait a sec... what else is?!)*\n \nNice sideeffect for the shills, this kind of FUD is untraceable by Satori.\n \nEdt2: my impression of this sub was deteriorating fast, everyone who came to my post with their input, really helped not feeling lost here, thanks guys, happy im not alone in feelin this way! Been holdin since December and ofc i will continue, i will however be takin this sub more lightly, and not engage in trying to put things right, cuz apparently, the real ones, you guys, know exactly whats what anyway 😍\n\n \n💜",
    "title": "The new FUD is making you feel like your fellow holders are dumb",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o836fb/the_new_fud_is_making_you_feel_like_your_fellow/"
}