{
    "author": "battorusobaku",
    "created_utc": 1617621338.0,
    "distinguished": null,
    "edited": 1617623011.0,
    "id": "mki8hp",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mki8hp",
    "num_comments": 54,
    "permalink": "/r/GME/comments/mki8hp/regarding_the_35m_gme_common_stock_offering/",
    "score": 832,
    "selftext": "Everyone has seen the news that GME is offering 3,5m in new common stock to raise capital. \n\n[https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-market-equity-offering-program](https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-market-equity-offering-program)\n\nWhat does this really mean? Gamestop has **THE OPTION TO SELL** 3,5m shares, NOT that it will be selling the shares right now! Gamestop has had the option to sell up to $100m in share since last year already and this is only an expansion on that. They have filed the needed paperwork with the SEC and they have **THE OPTION TO SELL** in the near future.  \n\n\n**Is this bullish?**  \\- In the grand scheme, with all the DD we have and our understanding that there is well over 300% SI so 3,500,000 shares is a drop in the bucket. \n\n# This doesn’t affect the MOASS at all! \n\n**IF** Gamestop decides to use this option to sell the new shares and raises approximately 525 000 000 dollars ( 3,5m sold at $150, just an estimate) it basically doubles its cash on hand and they guarantee themselves to never go bankrupt again. This will also allow them to accelerate their transformation into the beast of an ecommerce company they are going to be. This will be the end of the endgame that the short hedge funds were hoping for. No more possible way for them to have a 100% victory.\n\nThis is basically Gamestop trying to capitalize on the price right now, because it will be impossible to sell ATM when it squeezes after and who knows what the price post squeeze will be. In the eyes of the institutional investors, the fundamentals might not be there yet and won’t justifiy the price. We all know Gamestop is heading in a great direction.\n\n# Gamestop Preliminary Sales Results\n\n>GameStop Announces Preliminary Sales Results for the First Nine Weeks of Fiscal 2021 Reflecting an Approximately 11% Increase Compared to the Prior Year Period  \n>\t\n>Sales for the five-week March 2021 period increased approximately 18% from prior year\n\n[https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-preliminary-sales-results-first-nine-weeks](https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-preliminary-sales-results-first-nine-weeks)\n\nThis is bullish as fuck. We did it apes, Gamestop is transforming right in front of our eyes and the ecommerce sales are coming in. With all the free marketing Gamestop has received in the last months and the super loyal userbase it has around it now, GME is now a great value play and also in a great short squeeze position.\n\n**tl;dr:**\n\nOffering 3,5m shares right now is a drop in the bucket for the MOASS and doesn’t affect it at all. The strategy is the same, Buy and Hold! 🚀💎🤲\n\nGME has the option to sell shares, not that they will sell. And even if they do sell, nothing changes for us. This offering will help them tremendously and basically will cement them to not go bankrupt and remove the short hedge funds endgame goal completely!\n\n**Edit1:** Gamestop has released both these news at the same time, the sales increase is a really good news already.\n\nAlso max pain for this week is $190 so don't worry and buy the dip!",
    "title": "Regarding the 3.5m GME Common Stock offering - bullish! 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mki8hp/regarding_the_35m_gme_common_stock_offering/"
}