{
    "author": "LiveNDiiirect",
    "created_utc": 1626180634.0,
    "distinguished": null,
    "edited": false,
    "id": "ojewv5",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_ojewv5",
    "num_comments": 33,
    "permalink": "/r/Superstonk/comments/ojewv5/my_favorite_quality_about_this_community_isnt_the/",
    "score": 1165,
    "selftext": "Time and time again I am astounded at the level of critical peer review here. Headlines that get many of us excited are often disproven, or at least handed a heavy grain of salt in the comment section. While some of that may be mistaken as FUD, oftentimes what I see is generally very solid critique. What this shows me, personally, is that when there is legitimately positive news and substantive quantitative research shared here, WE KNOW that what we see is genuinely a reason to get excited about GME.\n\nIn my few years trading stocks and my decade spent on Reddit, I cannot think of a single other community focused solely on one challenging thing (especially making money investing, double especially for subreddits focused solely on investing in a single security) that goes so far to dispel “good news” if, upon further, critical inspection, the substance of the news/research actually points to being sweet nothings at best, and misleading or downright false at worst.\n\nI know there’s a running joke here about how we’ve all gotten a “college degree” in finance from the University of r/SuperStonk, but as a graduate student with 2 master’s degrees, I seriously want to commend everyone here for upholding a culture of consistency and accuracy over blind faith and hype. The level of peer review truly is top tier as far as internet communities go.\n\nOur time is coming Apes! Buy and hold fellas, for Valhalla we come!",
    "title": "My favorite quality about this community isn’t the memes, the diamond hands, the camaraderie. No, my favorite part of this sub is the dedication to critically review each and every piece of information shared in order to seek the truth, even if it doesn’t necessarily help our narrative.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojewv5/my_favorite_quality_about_this_community_isnt_the/"
}