{
    "author": "MrMoon1111",
    "created_utc": 1620797640.0,
    "distinguished": null,
    "edited": 1620797971.0,
    "id": "nahddy",
    "text_only": true,
    "flair_id": "4c901ca2-b1b1-11eb-83d0-0ed719c76173",
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_nahddy",
    "num_comments": 415,
    "permalink": "/r/Superstonk/comments/nahddy/interactive_brokers_amended_standard_client/",
    "score": 2204,
    "selftext": "I saw a post by [u/scwizard](https://www.reddit.com/user/scwizard/) about this SCA not long ago and thought if this a fresh Amendment (which it seems to be) to the Standard Client Agreement it needs apes attention asap, especially apes using IB!\n\nEDIT: Agreement was posted on 4/16 so many apes are likely already aware\n\n* link to the full written amended agreement [https://gdcdyn.interactivebrokers.com/Universal/servlet/Registration\\_v2.formSampleView?formdb=3203](https://gdcdyn.interactivebrokers.com/Universal/servlet/Registration_v2.formSampleView?formdb=3203)\n\n&#x200B;\n\nAfter reading this it's clear to me that Interactive Brokers is sending a clear signal and my interpretation - please transfer the fuck out of our platform immediately or give us complete anatomy over your portfolio and zero liability\n\n&#x200B;\n\n\"For IB LLC accounts opened prior to April 16, 2021, the Amended IB LLC Agreement will be effective as of June 11, 2021.  Continuing to maintain an IBKR account after June 11, 2021 shall constitute acceptance of the Amended IB LLC Client Agreement.\\*\n\n&#x200B;\n\nThis new standard client agreement for IB clients basically de-risks IB and would allow them to stop a client use of services at anytime with for any length of time, without prior notice. WADAFUk?\n\nhttps://preview.redd.it/sa9dgxrq9my61.png?width=714&format=png&auto=webp&s=8a1aea5e0a6778478d105208dc80c26dc3a69c53\n\nI'll just highlight a couple WADAFUKs from this small piece linked below\n\n\\- Exchanges, Markets and Dealers apply there own filters and limits which may cause clients orders to be delayed in submission and execution!!! WADAFUK?\n\n\\- Filters may result in cancelled/rejected orders WADAFUK?\n\n\\- IBKR may cap the price/size of the clients orders before they are submitted to the exchange WADAFAK?\n\n&#x200B;\n\n\\- Here is a good one - IB reserves the RIGHT in it's sole discretion without notice to put order limits on any client order and will not be liable for any effect of filters or order limits implemented by them or by an exchange, market or dealers..! DA-FAK!!!!?\n\n&#x200B;\n\nhttps://preview.redd.it/ayhr6qybemy61.png?width=711&format=png&auto=webp&s=a2521443c7f3b203909478d6893255b8796f77da\n\nHere a small part incase your tired as fuck and skim it - IBKR has the right to liquidate options or rights position prior to expiration, lapse some or all of the options (i.e., instruct that they not be exercised), even if in-the-money at expiration. Client shall have no claim for any damages/lost profits resulting from IB\n\nhttps://preview.redd.it/lzpzvsoggmy61.png?width=745&format=png&auto=webp&s=9e82e4d892a35a97c07fe0b07527538a627535f0\n\nThere is a lotttt more juice in this amended agreement and I highly suggest you read it in full🚀🌚🔜\n\n[https://gdcdyn.interactivebrokers.com/Universal/servlet/Registration\\_v2.formSampleView?formdb=3203](https://gdcdyn.interactivebrokers.com/Universal/servlet/Registration_v2.formSampleView?formdb=3203)",
    "title": "Interactive brokers amended Standard Client Agreement!!! Effective June 11th. They are removing their liability and imposing EXTREMELY scary terms. This is damage control and preparation of impending market volatility - NEEDS EYES AND WRINKLE🧠GLOIDS",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/Superstonk/comments/nahddy/interactive_brokers_amended_standard_client/"
}