{
    "author": "PM_ME_YOUR_ZeU",
    "created_utc": 1616517197.0,
    "distinguished": null,
    "edited": 1616530808.0,
    "id": "mbiocm",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mbiocm",
    "num_comments": 283,
    "permalink": "/r/GME/comments/mbiocm/it_isnt_just_gme_the_entire_stock_market_has_been/",
    "score": 5509,
    "selftext": "The United States uses a financial \"legacy system\". When things shifted to a digital platform this legacy system couldn't keep up and started falling behind at least 3 days and is most likely backed up.\n\nFor those who don't know what Failures to Deliver (FTDs) are please [watch this video first](https://www.youtube.com/watch?v=I0WXg5T3cBE) for a very basic understanding of what is going on.\n\n# SEC FTD data\n\nThe SEC reports FTD data bi-monthly on their [website](https://www.sec.gov/data/foiadocsfailsdatahtm). This cannot be the complete data as redditors are figuring out that they are in the pockets off Wall Street.\n\nThinking about these FTDs and how they work I was wondering if there was a loophole somewhere here since the DTCC is the one accepting the money and issuing stock at T-3.\n\n# Analyzing the parsed data\n\nApologizes in advanced. There wasn't time to make a beautiful graph with Python but these EXCEL screenshots should do. This data isn't 100% as there are missing price values.\n\nThis [first screen shot](https://i.imgur.com/YdWR23g.png) is the first reporting for the first 8 trading days of February 2021.\n\n* Total of FTD shares on Feb 12, 2021: 520,025,767\n* Total USD lost/missing on Feb 12, 2021: $2,935,128,904.75\n* Total FTDs lost for the first 8 trading days of Feb 2021: 3,343,420,578\n* Total USD lost: $29,185,691,803,84\n\nWow.\n\nLet's look at the total for the month of Feb when the two data files are added together:\n\n[Total February 2021 FTDs](https://i.imgur.com/wcLKjGG.png)\n\nIn the month of February of 2021 during the 3 day delay between payment received and issue of share 3.3 billion shares went missing for a grand total of $29.1 billion dollars.\n\nNow the idea is if FTDs don't go above the 1-2% of float it is okay to happen.\n\nReally? Is it?\n\n[SHOPIFY is bled $146 million in February 2021.](https://i.imgur.com/ZOWFAll.png)\n\n[Hey, Nokia, have some fake shares!](https://i.imgur.com/mYfSqIq.png)\n\n[Deutsche Bank FTDs](https://i.imgur.com/jsLMAMx.png)\n\n# So where is this money going? Those FTDs don't just disappear in a trash can when they fail do they?\n\nIn 2019 [Richard Evans did a lecture on naked shorting and FTDs](https://www.youtube.com/watch?v=ncq35zrFCAg) in ETFs that is on YouTube. This is university level and very dense so come prepared to this video.\n\nRichard Evans explains that:\n\n* ETFs can be purchased in bundles of say 50k\n* Those ETFs can be \"unpackaged\" like a box\n* Now they have 50k shares of each company\n* They can be sold on the open market to retail investors\n* Or do what is called a naked short and borrow shares to short a stock based on the fact that it is know somewhere down the road shares in the ETF will FTD and become available to buy again.\n\nThis can successfully be done because the DTCC is continuously selling everyone fake shares.\n\nBasically:\n\n* Stock dealers/brokers send a retail investor's money to the DTCC\n* DTCC issues synthetic shares to the customer with a T-3 promise to deliver it.\n* FTDs occur because it is part of the legacy system.\n* Customer keeps fake shares that they can instantly start trading with while waiting for T-3\n* FTDs are never covered so those initial shares end up always being fake\n* DTCC takes these FTDs and they are added back into the market by shorting\n* ETFs that FTD are unpackaged as Richard Evans explains\n* THOSE \"unpackaged\" ETF shares eventually FTD over time\n* INFINITE LOOP\n\n# When in doubt zoom out\n\nIn 2009 Talis Putnins wrote an article about [Naked short sales and FTDs](https://www.researchgate.net/publication/228260887_Naked_Short_Sales_and_Fails_to_Deliver_An_Overview_of_Clearing_and_Settlement_Procedures_for_Stock_Trades_in_the_US).\n\nIt included [this graph of FTDs](https://i.imgur.com/a6I0yOM.png) leading up to the 2008 market crash. This is monthly reporting (green O and red X).\n\nFor the month of July 2008 there were 320,000,000 FTDs\n\nGo back to the data I showed:\n\n[February 1, 2021: 520,025,767 FTDs](https://i.imgur.com/rIvg5JU.png)\n\n[February 2, 2021: 233,964,946 FTDs](https://i.imgur.com/m89nCnR.png)\n\n[February 3, 2021: 238,301,130 FTDs](https://i.imgur.com/ci0mw0X.png)\n\n**It appears the system is failing at an astronomical rate DAILY**\n\nThis infinite loop of naked shorting cannot stop. Once it does the entire stock market erupts.\n\n**TL;DR:**\n\n**DTCC issues fake shares to everyone and keeps the money. These FTDs can be used to naked short the market. ETFs that FTD can be \"unpackaged\" and suddenly 50k ETF shares turns into 50k shares of each company that is in that ETF. Then either dumped on the open market or used to short it.**\n\n**In theory this could allow Wall Street to export USD inflation by issuing fake shares or DTCC money to international companies/governments using the T-3 legacy system.**\n\n**Given that the system is backed up AT LEAST 3 days it is completely overloaded and primed to explode unravelling what could be decades of manipulation.**\n\n**One insane catalyst could blow up the system.**\n\n&#x200B;\n\nEDIT: Some are asking for more validation. The person who discovered the 2008 market crash, watch The Big Short, Michael Burry has been tweeting about this problem and has recently deleted all his tweets.\n\n[https://i.imgur.com/cYWsJWZ.png](https://i.imgur.com/cYWsJWZ.png)\n\n[https://i.imgur.com/hG4Bcyz.png](https://i.imgur.com/hG4Bcyz.png)\n\nI haven't gone through them all but he is continuously hinting at backlogged financial systems and inflation.",
    "title": "It isn't just GME! The entire stock market has been manipulated for decades through FTDs and it is about to explode",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbiocm/it_isnt_just_gme_the_entire_stock_market_has_been/"
}