{
    "author": "WardenElite",
    "created_utc": 1616506094.0,
    "distinguished": null,
    "edited": 1617469179.0,
    "id": "mbepx2",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mbepx2",
    "num_comments": 714,
    "permalink": "/r/GME/comments/mbepx2/live_charting_for_3232021_predicting_the_days/",
    "score": 9034,
    "selftext": "&#x200B;\n\nThis is not financial nor investment advice. These are ideas and opinions for information purposes only.\n\n*This post will read bottom to top. It's easier for people to refresh the page and see edits at the top*\n\n# I will livestream every Monday 9:15 AM EST, and do regular Reddit posts every day, even during streams. Last stream I was just adjusting so didn't do a post during that stream.\n\n**If you want to support me, check my Reddit profile bio. I appreciate you guys!**\n\n**Historical support and resistance levels for reference today:**\n\n152.5, 172, 183.5, 184.5, 187.5, 190.5, 192, 195, 197.5, 200, 209, 211.5, 214.5, 218, 226, 230, 234, 243, 250, 253, 256.5\n\n172 diagonal support (see 26:31 in my livestream video)\n\n**Edit 39 5:55PM:**\n\nThe media will spread FUD. They will short attack this.\n\n**There is nothing wrong with the earnings.** It's only a bit disappointing for apes who were expecting rocket fuel from earnings.\n\nExpect some wild swings tomorrow. Cya then.\n\n**Edit 38 5:50PM:**\n\n>The timing and amount of sales under the ATM Program would depend on, among other factors, our capital needs and alternative sources and costs of capital available to us, market perceptions about us, and the then current trading price of our Class A Common Stock\n\nI like how CNBC doesn't mention this part of the ATM Program on the 10K. A) They won't sell anytime soon, this will destroy market perceptions. B) They have a ton of cash on hand.\n\nDon't worry about them selling shares anytime soon folks.\n\n**Edit 37 5:38PM:**\n\nCNBC FUD article came out about how GameStop may sell stock to fund transformation: [https://www.cnbc.com/2021/03/23/gamestop-shares-rise-on-e-commerce-sales-jump-new-coo.html](https://www.cnbc.com/2021/03/23/gamestop-shares-rise-on-e-commerce-sales-jump-new-coo.html)\n\nlol. Did they read their Balance Sheet?\n\n**GameStop has 508.5m cash. Doesn't seem like they will sell. (edit: removed all caps, I'm now checking their filings about S/E)**\n\n&#x200B;\n\n**Edit 36 5:35PM:**\n\n**On Monday's stream, I will also go over the financial statements** and make it all easy to understand.\n\n**Edit 35 5:27PM:**\n\n# I'm gonna hold.\n\n# The earnings call was good. Low volume right now in selling. Around 50k a minute. (There is not really much panic selling at all by reading the volume)\n\nYes I know, this call did not add rocket fuel to the rocket.\n\nIn my opinion, from the earnings call and reading their 10K, **there is nothing fundamentally wrong with the company.** This was a reasonable earnings call.\n\n**Edit 34 5:26PM:**\n\nDue to a lack of guidance, the stock, as I have warned, will be shorted. Testing the 152.5 support.\n\nhttps://preview.redd.it/gza0prziiuo61.png?width=2133&format=png&auto=webp&s=130e4702664873b3972d2a4d172a7137c33bc50d\n\n**Edit 33 5:24PM:**\n\nI think generally this is good. They are transitioning from brick and mortar to e-Commerce. Though I think people were expecting a miracle or something, but again like I said, Q4 was expected to be affected. Forward looking expectations look good.\n\n**Edit 32 5:20PM:**\n\nThe statement of operations\n\n&#x200B;\n\nhttps://preview.redd.it/foujsyqthuo61.png?width=779&format=png&auto=webp&s=9d41e1422ceb4b9789a3732499dc20fd134489b6\n\nReducing net loss. Lots of administrative expenses reduced likely due to store closures. This is **good.**\n\n**Edit 31 5:15PM:**\n\nIn laymen's terms, COVID has reduced current assets, but liabilities have decreased at the same time. This is perfectly normal and a good forward looking sign.\n\n**Edit 31 5:14PM:**\n\nThe balance sheet.\n\nhttps://preview.redd.it/m5zdarn2huo61.png?width=803&format=png&auto=webp&s=b956c7226238b93c7b11959bb49c6f95a927e3d7\n\nI see really GOOD things happening. As expected, COVID reduced **inventories and net receivables,** but, at the same time, **long term debt has been decreased and lease liabilities have also decreased. This is evidence of a continued shift towards an online business model.**\n\n**Edit 30 5:13PM:**\n\n>The COVID-19 pandemic could potentially cause material disruptions or delays in our supply chains that develop, manufacture and distribute new consoles and other products we sell. Such disruptions could result in lower levels of sales of next generation consoles as well as the accompanying video games and other products we sell, which could have a material adverse impact on our financial results.\n\nAgain, nothing too surprising.\n\nI'm looking for forward looking figures now to see how the future will look.\n\n**Edit 29 5:07PM:**\n\nCOVID impacting sales from stores. Narrow EPS miss. Nothing alarming so far. Still reading through reports. [https://news.gamestop.com/static-files/55a92a3e-144e-4d2b-8ee6-930db9045593](https://news.gamestop.com/static-files/55a92a3e-144e-4d2b-8ee6-930db9045593)\n\nThe 10K is useful here to skim through.\n\n**Edit 28 5:00PM:**\n\nLet the earnings call begin!\n\n**Edit 27 4:00PM:**\n\nClosing around 181. Even power hour volume was pretty low. This earnings call is going to be really important. I won't be streaming the call since I prefer to concentrate on the financials. I will keep updating this doc with any large green or red flags I notice. See you all at earnings! 5PM EST  [https://viavid.webcasts.com/starthere.jsp?ei=1424794&tp\\_key=d5ec83cadf](https://viavid.webcasts.com/starthere.jsp?ei=1424794&tp_key=d5ec83cadf)\n\n**Edit 26 3:56PM:**\n\nVolatility going up during power hour. Some pretty moderate swings before close.\n\nhttps://preview.redd.it/ccynckh92uo61.png?width=2137&format=png&auto=webp&s=6197656e8bbae0e2da15858a0f738a04064a0d58\n\n**Edit 25 3:48PM:**\n\n# Forgot to put underscores in B_T_C so the post got autoremoved haha.\n\n**Edit 24 3:40PM:**\n\n**It is my belief that shorts on GME are \"pair trading\" by going long on B\\_T\\_C when GME is down, and going short on B\\_T\\_C when GME is up.** They are able to counteract the movements of GME by doing the opposite trade on B\\_T\\_C. I will delve much deeper into this next Monday during my stream.\n\nhttps://preview.redd.it/00j4u4wnzto61.png?width=637&format=png&auto=webp&s=504e4b86fbd386c891b42087a1727f71116354fe\n\n**Edit 23 3:33PM:**\n\nThe VIX is a volatility index. When the VIX goes up, it usually means funds are selling off and obtaining cash to short or to put into something else like bonds, mutual funds, commodities, or... GME.\n\n**Edit 22 3:27PM:**\n\nB\\_T\\_C ready to fall, VIX ready to spike. The start of another moon expedition for GME?\n\nhttps://preview.redd.it/9b6h5f25xto61.png?width=2141&format=png&auto=webp&s=dc40435b5adec2ba1591e6f744f2afbe285ec9dc\n\n**Edit 21 3:07PM:**\n\nSome folks wondering what my Kofi link is. [https://ko-fi.com/wardenelite](https://ko-fi.com/wardenelite) (It's on my profile but not loading for some people)\n\n**Edit 20 3:00PM:**\n\nRemember, the entire market is down.\n\n&#x200B;\n\nhttps://preview.redd.it/6iyeqthdsto61.png?width=283&format=png&auto=webp&s=de6e4fa6cef1decf46ef30669a5516a79c7a698e\n\n**Edit 19 2:53PM:**\n\nGetting slowly sucked into Gargantua before we get slingshotted to the moon.\n\n**Edit 18 2:38PM:**\n\nLots of put volume for Mar 26 weekly. Interesting. 250, 260, 300 strikes. Someone is trying to keep this stock down.\n\n&#x200B;\n\n[data courtesy of optionsonar.com](https://preview.redd.it/4vt2whvfoto61.png?width=2496&format=png&auto=webp&s=988f20a2275ceb2eb0caf9ca6f1937f5d847be07)\n\n**Edit 17 2:34PM:**\n\nCouple dips. Couple peaks. All just white noise. Volume too low for anything interesting to happen. Possible bounce at 184.5.\n\n**Edit 16 1:33PM:**\n\nFor those that want to see all the nearby lines I drew. The blue lines aren't exact, but they are roughly around the numbers I listed above:\n\nhttps://preview.redd.it/eyt3g97tcto61.png?width=2138&format=png&auto=webp&s=24354ea4f74f346d60a10bdbd43c715dde37aab8\n\n**Edit 15 1:24PM:**\n\nAnd yes I'll be editing this post throughout earnings.\n\n**Edit 14 1:22PM:**\n\nThere are two types of good earnings. Those that are priced-in, and those that blow the stock out of the stratosphere.\n\n**Edit 13 1:19PM:**\n\nSome minor volume coming in. Making a move to the 192 resistance and reversing a bit. **Forgot to add 192 to the list of resistances, added that now.**\n\n**Edit 12 12:38PM:**\n\n# IMPORTANT ANNOUNCEMENT: WHAT TO EXPECT FOR EARNINGS\n\nIf long term projections are good: doesn't matter if Q4 was bad: HOLD. **They will short attack and dump the price to induce fear. Ignore it. They will use the media to spread FUD. IGNORE.**\n\nhttps://preview.redd.it/zuwmicyo3to61.png?width=2093&format=png&auto=webp&s=78f1aa8e807c9498eb6c0ed53c8870249c2f71f1\n\nI don't believe earnings can go badly, **but hey, no one is always right.** No one is like Cassandra.\n\n**Edit 11 12:21PM:**\n\nNothing too interesting happening. Might have to wait for power hour. Will update this if anything crazy happens.\n\n**Edit 10 12:03PM:**\n\nSmall bounce on 184.5 (**new support added**).\n\n**Edit 9 11:45AM:**\n\nThe tail of this pattern is slightly sagging.\n\nhttps://preview.redd.it/7og88ujguso61.png?width=2144&format=png&auto=webp&s=b227f721d9649b48729fa62a5d65a7a08f7e3c74\n\n**Edit 8 11:35AM:**\n\n**Anatomy of a low volume day (almost no humans or institutions). My personal speculation based on observations.**\n\nThese kinds of ultra low volume days are **rare.** Patterns are easier to predict because LFTs (low frequency trading) and HFTs are more predictable when they establish the trend for the entire day. Let me illustrate.\n\nhttps://preview.redd.it/busvlvftsso61.png?width=2093&format=png&auto=webp&s=c6835213377d13d08eb989ca60f1fa89f76847b6\n\nFirst low frequency trading algos will selloff according to their swing trading strategy. Especially if the premarket is in the green due to the principle of mean reversion. This creates a downward trend that all the HFTs pick up on. This results in price breaking through a couple support levels.\n\nThe HFTs eventually cover and buy the dip. This creates a consolidation. However after that, the buy demand is low and eventually the stock hugs the floor for a while. Eventually HFTs begin buying more, again by the concept of mean reversion, and the price returns to near VWAP. The price usually sags and consolidates at the end if no volume picks up.\n\n**Edit 7 11:22AM:**\n\nSeems to be reversing earlier. **New support and resistance lines created. 190.5. 187.5.**\n\n**Edit 6 11:09AM:**\n\nWoops realized my chart was too zoomed in for the 9:40am prediction. My bad! The drawing should be shifted down 1 support level.\n\nhttps://preview.redd.it/zana15rfnso61.png?width=2138&format=png&auto=webp&s=c7a04a1abbe975b4f1e548867ea17d5af661d10a\n\n**Edit 5 11:03AM:**\n\nTrading a bit below the 172 diagonal. I think it's normal because of the low volume, as well as the broader market in the red.\n\nhttps://preview.redd.it/3i8swt9ylso61.png?width=2139&format=png&auto=webp&s=ffaf83d449f4e60f1bfe49961998d6021cbeea19\n\n**Edit 5 10:19AM:**\n\nStill following the prediction so far, gonna let it play out and see where it diverges.\n\n**Edit 4 9:40AM:**\n\nSuper rough prediction.\n\nhttps://preview.redd.it/f90dno167so61.png?width=2143&format=png&auto=webp&s=e39b71ca7d580b704c4cf46420168d3912f54b4a\n\n**Edit 3 9:36AM:**\n\nVolume super super low. Around 250k 1st minute candle. I think today will be pretty boring until earnings comes around.\n\n**Edit 2 9:32AM:**\n\nhttps://preview.redd.it/0n7car8v5so61.png?width=2139&format=png&auto=webp&s=4ad4c8e40962409fd1be2f4a072508a994b39469\n\n**Edit 1 9:31AM:**\n\nRally bounce confirmed :D\n\n# Begin Reading Here\n\nhttps://preview.redd.it/k8wxbatq3so61.png?width=1200&format=png&auto=webp&s=786ad124c5c826aeee424bfad13fe0d4e6ac2f16\n\nGoooooooooooooood morning my fellow apes!\n\nYou smell that? What is that?\n\nThat's right. Customer experience.\n\nFrank Hamlin resigned from GameStop, the second executive departure. I think is a great sign of change. Ryan is really transforming the entire company and bringing in his guys to do their magic, and kicking out the old guys.\n\nWell anyways, I got some midterms to deal with today, so my updates will be a bit rough today. Sorry all!\n\n# Premarket Analysis\n\nhttps://preview.redd.it/khhexge05so61.png?width=2139&format=png&auto=webp&s=6cefafb134914c58dc623575deaae209632bfa0c",
    "title": "Live Charting for 3/23/2021, predicting the day's price action in (rough) detail with Warden. Midterms edition.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mbepx2/live_charting_for_3232021_predicting_the_days/"
}