{
    "author": "ancient_wis",
    "created_utc": 1616537852.0,
    "distinguished": null,
    "edited": 1616538395.0,
    "id": "mbqdgv",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mbqdgv",
    "num_comments": 2399,
    "permalink": "/r/GME/comments/mbqdgv/official_gamestop_sec_filing_short_squeeze_may/",
    "score": 28113,
    "selftext": "in case you missed it apes\n\nPage 15 [https://www.sec.gov/Archives/edgar/data/0001326380/000132638021000032/gme-20210130.htm](https://www.sec.gov/Archives/edgar/data/0001326380/000132638021000032/gme-20210130.htm)\n\n***A “short squeeze” due to a sudden increase in demand for shares of our Class A Common Stock that largely exceeds supply has led to, and may continue to lead to, extreme price volatility in shares of our Class A Common Stock.***\n\nInvestors may purchase shares of our Class A Common Stock to hedge existing exposure or to speculate on the price of our Class A Common Stock. Speculation on the price of our Class A Common Stock may involve long and short exposures. **To the extent aggregate short exposure exceeds the number of shares of our Class A Common Stock available for purchase on the open market**, **investors with short exposure may have to pay a premium to repurchase shares of our Class A Common Stock for delivery to lenders of our Class A Common Stock.** Those repurchases may in turn, dramatically increase the price of shares of our Class A Common Stock until additional shares of our Class A Common Stock are available for trading or borrowing. This is often referred to as a “short squeeze.”\n\n&#x200B;\n\nEDIT - KEY TAKEAWAYS FOR ME.\n\n They recognise that\n\n \\- shorting is over 100% of float\n\n \\- It is continuing\n\n \\- Shorts should expect to return to lenders - potentially paving way for a catalyst regarding shareholding meeting, voting, special dividend or other intervention forcing return to lenders",
    "title": "OFFICIAL GAMESTOP SEC FILING ... SHORT SQUEEZE... MAY CONTINUE and ... to the extent aggregate short exposure EXCEEDS the number of shares available... investors WITH short exposure \"MAY HAVE TO PAY A PREMIUM\"",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GME/comments/mbqdgv/official_gamestop_sec_filing_short_squeeze_may/"
}