{
    "author": "itempleton",
    "created_utc": 1616519173.0,
    "distinguished": null,
    "edited": 1616519380.0,
    "id": "mbjf51",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mbjf51",
    "num_comments": 155,
    "permalink": "/r/GME/comments/mbjf51/sec_50000000_whistleblower_reward/",
    "score": 6321,
    "selftext": "Originally posted on r/amcstock \\- reposting for everyone here:\n\nIf you are getting paid to post FUD or are a hedge insider with detailed knowledge of the manipulation that is clearly going on - you could make bank and save your reputation (not to mention your future career options and earning potential) at the same time. As an example - the SEC recently paid $50,000,000 to a whistleblower who \"provided detailed, firsthand observations of misconduct by a company.\"\n\n[https://markets.businessinsider.com/news/stocks/sec-record-millions-whistleblower-award-program-total-payment-amount-payout-2020-6-1029282473?op=1](https://markets.businessinsider.com/news/stocks/sec-record-millions-whistleblower-award-program-total-payment-amount-payout-2020-6-1029282473?op=1)\n\nThere are a ton of federal protections for whistleblowers and there is an entire legal industry out there to help whistleblowers facilitate their claims:\n\n[https://www.whistleblowers.gov/](https://www.whistleblowers.gov/)\n\nWhile the SEC may be crooked - the DOJ and other federal offices will be involved in serious claims and the SEC will be forced to behave (or you will see job terminations and SEC insiders going to jail - which would be great). Regarding SEC claims - rewards are typically equal to 10% to 30% of the funds the SEC or CFTC collects based on your information, provided more than $1 million is collected (this case would easily blow previous records out of the water and the reward could be astronomical).\n\nOne of my law school professors was a former U.S. Attorney at the Department of Justice and wrote one of the leading treatises on whistleblowing. There are a lot of resources out there like this:\n\n[https://www.amazon.com/Whistleblowing-Rewards-Reporting-Against-Government/dp/1940011159](https://www.amazon.com/Whistleblowing-Rewards-Reporting-Against-Government/dp/1940011159)\n\nIf someone out there has a serious claim - they should contact an attorney who specializes in guiding whistleblowers through the process. They'll work with you on a contingency fee basis and will know the precise people at each federal office to speak to (obviously half of a successful strategy is knowing the right political strings to pull):\n\n[https://www.howtoreportfraud.com/about-us/](https://www.howtoreportfraud.com/about-us/)\n\n[https://www.bramnickcreed.com/practice-areas/federal-whistleblower-protection-lawyer/](https://www.bramnickcreed.com/practice-areas/federal-whistleblower-protection-lawyer/)\n\n[https://kkc.com/whistleblower-services/sec-whistleblower-attorney/](https://kkc.com/whistleblower-services/sec-whistleblower-attorney/)\n\n[https://kkc.com/our-whistleblower-law-firm/our-whistleblower-lawyers/stephen-m-kohn/](https://kkc.com/our-whistleblower-law-firm/our-whistleblower-lawyers/stephen-m-kohn/)\n\n(there are a lot more out there - just google \"federal whistleblower attorney\")\n\nIn closing - there is a lot of negativity on here about taking things to the authorities. Here is the thing though - while there is certainly corruption at all levels of government - there are good guys in government too. Every single year cases like this are resolved in a manner in which justice is served and a whistleblower ends up as the hero of the story. Obviously no outcomes are guaranteed - but if you're an insider sitting on this information - ask yourself who you want to be when the music stops. Hint - if you don't come forward Michael Lewis is coming for your ass anyways.",
    "title": "SEC $50,000,000 Whistleblower Reward",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbjf51/sec_50000000_whistleblower_reward/"
}