{
    "author": "Cuttingwater_",
    "created_utc": 1616556454.0,
    "distinguished": null,
    "edited": 1616595174.0,
    "id": "mbwf03",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mbwf03",
    "num_comments": 152,
    "permalink": "/r/GME/comments/mbwf03/the_27_price_drop_in_after_hours_only_brought/",
    "score": 6811,
    "selftext": "Hello my fellow Apes 🦍🦍🦍,\n\nIn case any of you were actually wondering if the price drop in after hours was real, FEAR NOT, it was done with EXTREMELY LOW VOLUMES, so much so that it barely moved the VWAP.\n\n\\---------- **BOILERPLATE:**\n\nI still know nothing, I can't do math good. PLEASE don't listen to me! Obligatory 🚀🚀🚀\n\n**TLDR: The $27 (15%) price drop in after hours only brought the VWAP down by $3 (2%). This clearly shows that the price was lowered with very low volumes and not indicative of the average price the stock has been trading at . 💎✋🚀🚀🚀**\n\n\\----------\n\nNote: **VWAP 'resets' each day, therefore you would see it drop from after hours to pre-market but this isn't because of some HUGE increase in volume, it's just set up to see average trends within the day.**\n\n[For those that don't know, here is what Volume Weighted Average Price (VWAP) is all about](https://www.investopedia.com/terms/v/vwap.asp#:~:text=The%20volume%20weighted%20average%20price%20(VWAP)%20is%20a%20trading%20benchmark,and%20value%20of%20a%20security)\n\nEssentially it is  the average price that a stock has been traded at throughout the day, based on both volume and price. This means that if a price changes with very little volume (comparatively), then it will have little effect on the VWAP.\n\nA great example of how the VWAP shows what a stock is actually trading at, take a look at the VWAP (purple line) from March 10 when there was that huge short attack. As you can see, the VWAP barely registered it since the volumes were quite low at the very low prices.\n\n&#x200B;\n\nhttps://preview.redd.it/qymzm5ze9wo61.png?width=1264&format=png&auto=webp&s=f4d3d386394602cf83352cfd552dd88f1bacf0cf\n\nNow let's take a look at today's after hours (colored in blue). You can the VWAP is WAY above the current price line and barely registers the drop in price. This is because the volumes are comparatively so low during AH that it has a minimal effect.\n\n&#x200B;\n\nhttps://preview.redd.it/cr4icdh39wo61.png?width=1181&format=png&auto=webp&s=659a20138599dacc1f8fc049c2f02d79d1122507\n\nDuring after hours, the **price dropped $27 dollars**, but it only dropped the **VWAP $3** and it is still trending up in the **$180s.** Shorts are clearly trying to make it seem like there is disappointment in the earnings call, giving MSM all the ammo they need to write negative articles. Too bad apes can't read.\n\nPs, If you have a free TradingView account, it is not using direct NYSE data, it is using something called CBOE BZX and your data will not look like mine. You need to have a pro account and pay $2 for the direct NYSE data feed, which I do 😃\n\n[CBOE BZX Data - trading view](https://www.tradingview.com/?solution=43000473924)\n\nNote: Today was a very low volume day \\~9million with a very high volume after hours >2 million and it STILL didn't bring down the VWAP very much.\n\n&#x200B;\n\nhttps://preview.redd.it/ivnmyfbwhzo61.png?width=864&format=png&auto=webp&s=889918afe04b5eab37f1d375d0a7ba9601b27583",
    "title": "The $27 price drop in after hours only brought down the Volume Weighted Average Price (VWAP) by $3 to $183 🤣🤣🤣 Nice try, but we are not falling for it 🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mbwf03/the_27_price_drop_in_after_hours_only_brought/"
}