{
    "author": "Csmbird",
    "created_utc": 1624509951.0,
    "distinguished": null,
    "edited": 1624548966.0,
    "id": "o6tseo",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o6tseo",
    "num_comments": 445,
    "permalink": "/r/Superstonk/comments/o6tseo/behavior_girl_reporting_for_duty_weve_heard_of/",
    "score": 5468,
    "selftext": "# \n\n# What the hell have I done….\n\nOriginally I started talking about behaviorism.\n\nThen some cool kids helped me find a thread about Kenny G and I saw where he had himself some planes.\n\nThis got me thinking and I went on this lovely rabbit hole venture and found all the weird shit but the White Rabbit.\n\n&#x200B;\n\n[Yah, thas me hiding behind the mushroom of truth I just devoured the last 24 hours](https://preview.redd.it/c0g0touh05771.png?width=500&format=png&auto=webp&s=bfb21cf22f2698d7f76632083805c5acdee76ccf)\n\n# [IF YOU HAVEN’T READ THIS YET PLEASE READ THIS FIRST. ](https://www.reddit.com/r/Superstonk/comments/o5w43o/need_more_wrinkly_brains_gone_down_an_aviation/)\n\nA cheshire cat that wishes to remain anonymous sent me some effing insane info. I still have alot of shizz to break down regarding some airline stuff….but I couldn’t not first address the insanity and possibly parallel universe I stumbled into. Please take time because dude I felt like Alice. Shit leads to some weird shit leads to some even weirder shit.\n\nThere is a YUUUUUUGE chance that I jumped quickly to something without digging in deep enough into one area. Probably because right when I found one weird ass thing it led me to another weird ass thing so I couldn’t fully break down what I’d just found.\n\nMy friends a cool Apian  helped me find a plane. Not just any plane. But le’ plane:\n\nKP Holdings\n\nReg.:N302AK\n\nUnited States\n\nDB flags:none\n\nType:GLEX\n\n2012 Bombardier BD700 Global 6000\n\nKP HOLDINGS LLC\n\n&#x200B;\n\nWho gives a damn?\n\nI do. You do.\n\nBehaviorally I want to escape from a financial market and economic market where people prey on the main population and reap earnings. Short term I want your fucking attention because shits gonna get insane.\n\n[KP Holdings](https://opencorporates.com/companies/us_or/12693594) is the owner of N302AK. Which is a 2012 Bombardier BD700 Global 6000. Sound familiar? Apparently KG’s plane. Look who is a member of this company? Ken in the flesh.\n\nLookie [here](https://opencorporates.com/companies?q=kp+aviation&utf8=%E2%9C%93). There are MANY KP Holdings. That being said many of them are just straight up “[principal place of business”](http://egov.sos.state.or.us/br/pkg_web_name_srch_inq.do_name_srch?p_name=&p_regist_nbr=12693594&p_srch=PHASE1&p_print=FALSE&p_entity_status=ACTINA). SO technically not different businesses. Look at the picture below. Type of business? Anything not prohibited by law. Shaaayyyydeeeeee as fuck.\n\n&#x200B;\n\n[Slick fuckers](https://preview.redd.it/29auj4b815771.png?width=1916&format=png&auto=webp&s=80974e777ffa7d6439abb618d17540d4c7b40693)\n\nSoooo many KP Holdings..not saying they’re all the same….but interesting how little information each of them have and low and behold the one Ken as a member on says the only business is anything not illegal. WHat the fack.  Guess what's really crazy? If you dig into many of them....guess who is the primary place of business? Shitttttadel. [ ](https://www.inc.com/profile/kp-aviation-holdings)\n\n&#x200B;\n\nhttps://preview.redd.it/n5c3ctab55771.png?width=225&format=png&auto=webp&s=3d5b44c8129f17d08e61fa72d507e3aa3160a225\n\nKnow what’s interesting?\n\nThere was a photo of Ken Griffin and I noticed in the background that there was this little award thing.\n\n&#x200B;\n\n[just behind his arm](https://preview.redd.it/2m6i891f55771.png?width=1920&format=png&auto=webp&s=1198aac4cff4704d9656f66458eb8c220733e3cb)\n\nNow when I looked at the photo I thought it said something like 2009. Interestingly enough look who is the Risk lifetime achievement award winner for this year? 2021 Goes to [Ken Griffin](https://www.riskawards.com/winners).Lol risky business for SUUUUUURE! Looking through previous years that are listed on the site it looks as though Shitadel always gets some kind of award.\n\nThis is funny...actually not...because it’s like the award ceremony of the devil lol. Who was the best demon this year!? Kenny G.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/brstia2p55771.png?width=572&format=png&auto=webp&s=2d40e8ac392f238554ce4a9d1d4cdf1e8acf135d\n\n# Lockheed Martin.\n\n[Recently MSM tried to boop up LMT shares](https://www.archyde.com/a-new-gamestop-lockheed-martin-seen-in-reddit-investor-spotlight-because-of-ufos/) by saying we were converting. ? Well last year at June Citadel was big into these guys. Still seems like a vague connection...but hang loose.\n\n# Air and Space Museum Donation\n\nBack a couple months ago I posted something about [Ken donating money to the National Air and Space Museum in D.C](https://www.reddit.com/r/Superstonk/comments/nk2cs4/omg_does_anyone_else_find_the_irony_in_this/). thinking how fucking ironic it was. \\*pissed me off on a personal level because as a military kid living in DC we would go there and they had this really cool upside down spinney thing you could get in so I loved the shit out of going there\\*.\n\nInterestingly Lockheed Martin has an Imax there named after it ( I mean well duh it’s the Air and Space Museum)...but given the relation between Lockheed Martin, Citadel, National Air and Space Museum, and Kenny G...There seems to be fuckery afoot.\n\nWell damn back then I thought it was ironic because you know we go to da moon. NOW I realize it’s intentional not because it’s throwing it in our face about the moon landing, but it’s throwing in our face that they are utilizing the aviation industry to hide their effing money!!!!!!!\n\nSomeone had mentioned him being a sociopath...dude this reminds me of all those psychopaths taught about where they leave hints behind because on some level they want to be found.\n\nHow do I know they’re hiding their money within the aviation industry?\n\nLet us revisit Ryan McKenna, shall we? (see other post first dingus)\n\nhttps://preview.redd.it/r60ybfip25771.png?width=1324&format=png&auto=webp&s=e368e32002e6c14bcd809355c4ba61d6639c4da4\n\nBy looking at the FULL job description we can get a better image. Ryan formed and raised capital at Blackbird Capital 1 and Blackbird Capital 2 which were private equity platforms WITH BLINDPOOLS OF CAPITAL that acquired and managed aircraft.\n\n(Very likely named after the [Blackbird aircraft](https://airandspace.si.edu/collection-objects/lockheed-sr-71-blackbird/nasm_A19920072000). This aircraft was basically way ahead of it’s time and was utilized within the USAF for 25 years. On it’s last flight the son of a bitch flew from LA to DC in an effing hour. Interestingly after they landed at Dulles on the final flight….they turned the plane over to none other than the Smithsonian. Do remember that The National Air and Space Museum is actually a portion within the Smithsonian Institute. We know Kenny likes names. The naming of Blackbird would truly be poetic. The dickass.)\n\nBlackbird spun them off into Thunderbolt Aircraft (notice how all of these are named as if they are aviation companies….similar to those other weird aviation named companies I’ve listed prior?!). Thunderbolt Aircraft is an equity platform.^(ahem) *makes me think of the platform Shitadel uses as a MM*….for...get this….**Aircraft Asset Backed Securities.** \\[Think Mortgage Backed Securities. Think Commercial Mortgage Backed Securities\\].\n\nRyan’s job description (bad boi McKenna...not our good boi Cohen) goes on to state that he would structure bank debt and **warehouse facilities** and engaged with credit rating agencies. He led investor relations with equity and debt holders.\n\nNow remember how in my other post I was trying to tie down Griffin Assets to Kenny G. I mean Griffin has a spin off in Palm Beach where he has real estate. Plus it has a location right beside citadel. AND it has an aviation assets management. Well Ryan McKenna whose been running shit at Griffin Global Asset Management used to work for Air Lease doing the dark pool trading. After looking into Air Lease….They are [owned ](https://littlesis.org/org/141450-Air_Lease_Corporation)in part by Wilbur Ross. This is a dude listed in the effing Paradise Papers.\n\nWilbur Ross is on the [Capital Committee of Markets Regulation](https://littlesis.org/org/45367-Committee_on_Capital_Markets_Regulation) with….who other than Ken Fucking Griffin himself.\n\n&#x200B;\n\n[Why dis blur out uc? fucking is an ok word. If after reading this your head didn't get huge and hands get tiny you need to read again. ](https://preview.redd.it/2wmo61w935771.png?width=474&format=png&auto=webp&s=f5e3708a81f59ea5392ae6c371410dd2a1b58b69)\n\nNow….yesterday in my post scouring for dots being connected I found that weird warehouse article right?\n\nRemember a warehouse for aviation was bought?\n\n[Articles](https://newsroom.aviator.aero/griffin-global-asset-management-closes-1-billion-warehouse-facility/) said who some of the banks were that joined in on the purchase:\n\n>“Goldman Sachs acted as the structuring agent for the Facility. Initial commitments for the facility were provided by Goldman Sachs, Barclays Bank PLC, Mizuho Americas, Morgan Stanley, Wells Fargo Bank, National Association, Bank of America, N.A. and Deutsche Bank AG, New York Branch.  \n>  \n>Hughes Hubbard & Reed LLP acted as U.S. legal advisors to Griffin and the Borrowers, Milbank LLP acted as legal advisors to the Lenders, Maples and Calder (Ireland) LLP acted as Irish legal advisors for the Borrowers, Maples and Calder (Cayman) LLP acted as Cayman Islands legal advisors for the Borrowers, A&L Goodbody LLP acted as Irish legal advisors to Griffin and PWC acted as Irish tax advisors for Griffin and the Borrowers. UMB Bank, N.A. is acting as the administrative agent and the security trustee.“\n\nWho the fack acts as LegAL AdVisORS in the Cayman Islands.....????\n\nAlso...remember Ryan McKennas job is to what? Oh ya a portion of it is to STRUCTURE WAREHOUSE FACILITIES AND BANK DEBT\n\nTL;DR\n\nGuys….there is some weird ass shit going on with this fancy shit called Aviation Backed Securities. We knew they fucked with Mortgage Backed Securities and Commercial Mortgage Backed Securities...but now they’re utilizing Aviation Backed Securities. And someone working within the realms of another one of Griffin’s hidden companies has created blackpools for the Aviation Backed Securities. And they’ve bought an effing warehouses for planes and the restructuring of bank debt.  Dude. KG has multiple other companies that he is linked to but of course doesn’t have his name on the line (except for that sweet KP Holdings listing that said he was a “member”.....weird for a company to own your effing plane if your only a “member”)..... and they are ALLLLLLL connected to aviation.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n[I'M DYING. I'M DYYYYYYING](https://preview.redd.it/opwjuh3p45771.png?width=474&format=png&auto=webp&s=302e295ae876e560098c77744218660f6553bad0)\n\n&#x200B;\n\nSide note:\n\nDude. Where you big bois at? Someone summon Cuban, Laur, et. al. Criand too. He is also big boi. More dots need connecting.\n\n&#x200B;\n\nEdit 1:\n\n&#x200B;\n\nYou guys are amazing. I'm trying to go through all your messages and comments and reply. If I don't reply I likely still updooted you. \n\n&#x200B;\n\nAlso I love that some of yall have some strong philisophic doubt. In the behaviorism world this essentially is the concept to question everything. I'm doing my best to compile more stuff and get you guys more data. Sadly I'm but a mere Ape and even this tip of the Glacier (heh pun intended) work is time exhaustive. Thank you to those with philisophic doubt as it keeps the conversation going and keeps me on my toes to ensure I get as much data as possible to share with you <3",
    "title": "🐱‍🏍🐱‍🏍Behavior Girl? Reporting for Duty. We've heard of Mortgage Backed Securities and Commercial Mortgage Backed Securities....But get this. These turds are utilizing Aviation Backed Securities and hiding money through \"blind\"/dark pools within the aviation world....And fucking warehouses!!!!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6tseo/behavior_girl_reporting_for_duty_weve_heard_of/"
}