{
    "author": "Nalifi",
    "created_utc": 1624507972.0,
    "distinguished": null,
    "edited": 1624652623.0,
    "id": "o6tax3",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o6tax3",
    "num_comments": 587,
    "permalink": "/r/Superstonk/comments/o6tax3/hi_all_its_ryan_cohen_t21_tweet_guy_im_losing_my/",
    "score": 8944,
    "selftext": "*This is not financial advice.*\n\n\\------\n\nEdit: So we are clear that T+21 did not happen Thursday, and probably not Friday either (due to the Juneteenth speculation). I reiterate that the main purpose of the post is to demonstrate that Cohen is aware of the mechanics behind this situation and price movement, and that shareholders are in good hands. However, I am inclined to present two main alternatives theses:\n\nA) SHF were able to reach the 100% net capital requirement, moving payment to T+28;\n\n[https://www.reddit.com/r/Superstonk/comments/o7g9mn/net\\_capital\\_and\\_t21/](https://www.reddit.com/r/Superstonk/comments/o7g9mn/net_capital_and_t21/)\n\nSpeculating that injection of 5 million shares through the offering allowed shorts to have enough money to pass the 75% net capital requirement. Personally, I don't think dates are an issue. The public has a limited amount of information to work with and this is the best apes can do. Up until now, this has been accurate. \n\nB) SHF covered not only the previous cycle, but also the current cycle in the runup to 340.\n\nThe fact is, apes are going to buy and hodl anyways; many are immune to the dips at this point. I've already gotten hateful comments from gme\\_meltdown users trying to spread FUD in this forum. Apes give constructive feedback, alternative theories, and support; remember this. And there is plenty of good news to come out of this week - especially solid evidence that the SI is above 200%!\n\n\\------\n\nAnd to the original post:\n\nHey all, if anyone doesn't remember me, earlier I made a DD on Ryan Cohen's Tweet timing:\n\n[https://www.reddit.com/r/Superstonk/comments/nycuk4/cohen\\_has\\_reached\\_the\\_same\\_conclusion\\_as\\_ucriands/](https://www.reddit.com/r/Superstonk/comments/nycuk4/cohen_has_reached_the_same_conclusion_as_ucriands/)\n\nObserving that RC has tweeted seemingly meaningless tweets on T+21 days. I honestly don't think they have any deeper meaning other than signaling the T+21 day, but there is some speculation on the meanings of them.\n\nAnyways, in this previous post, I calculated that Cohen had an **objectively, statistically significant** trend of tweeting on T+21 days. Back then, the chance that his tweets were \"randomly\" on T+21 days was **0.0339%.**\n\n# Ryan Cohen has tweeted again, the night before a T+21 day!\n\n[https://twitter.com/ryancohen/status/1407896835096678402](https://twitter.com/ryancohen/status/1407896835096678402)\n\n&#x200B;\n\nWith the introduction of this 5th tweet, he has now placed tweets on 5/6 T+21 days (missing only the first one, when he might have not even known about the trend). Including his father's day tweet and also this most recent one,\n\n**The probability that these tweets are random is** **~~0.0069543%~~****\\*\\*\\*\\*\\*\\*\\*\\*. 0.00707%**\n\nThat doesn't look very random to me.\n\n^(For those interested: I used a hypergeometric law in which 173 days since 1/1/2021 (It's probably actually even higher than this as he entered the GME situation earlier than this. 20 Tweets out of 173 days means 20 \"successes\" in a population of 173. Then, 6 samples (T+21 days had 5 successes in samples (Ryan Cohen Tweets on T+21 days), ^(leading to a hypergeometric probability of 0.000069543; multiplied by 100 to convert to the percent. Statisticians please correct me if I am wrong and I will edit the post.) ^(Evidently, it is better to use the chance of picking exactly 5 dates, rather than 5 out of 6 possible; this would be somewhat higher at 0.00707%, but still quite low (hence the edit).)\n\n&#x200B;\n\nAnother **subjective** assumption I made in my last post was that, because Cohen was well aware of this T+21 net capital cycle, he also timed the 5 million ATM share offering to coincide with a period in which Hedge Funds would want to drive the price down. In doing so, diamond handed apes would simply attribute lowered prices to the share offering, as many of us did.\n\n*He gave us FUD immunity.*\n\nSurely enough, Gamestop sold 5 million shares and raised 1.6 billion dollars, barely making a *dent* in the price at least in the eyes of a December ape like myself, and announced the completion of the offering leading up to the T+21 days.\n\nI think we can be excited if the price goes up tomorrow (there's some real weird fuckery going on with OTM Puts, crypt0, and other shit right now) but honestly I'm kinda shook he tweeted at all considering DFV has gone quiet. That being said I have no doubt that he's got a team that knows far more than I do about law (nothing) and is covered on this end. Either way, it shows that\n\n# Cohen and Co. know what's going on.\n\nThey could even read Superstonk DD. Maybe they realized before us. Regardless, I hope my message with these posts can be:\n\n***GME Shareholders are in good hands. Buy if you have the means. HODL. HODL till you pass out and then HODL some more. I have no doubt that this stonk will go: Just Up. (Not financial advice)***\n\n&#x200B;\n\nThings to be jacked for:\n\nApparently 002 is enforced/officially published 6/24\n\nT+21 is on 6/24\n\nRussel 1000 reconstitution 6/25\n\n$750B in longer term RRP (not overnight) also due by counterparties on Friday, June 25th? (thanks u/Criand)\n\nQuarter end inc, with RRP already at an all time high?\n\n&#x200B;\n\nJust Up\n\n&#x200B;\n\n*This is not financial advice.* *Although I was able to finally time my bananas correctly to eat them fresh, quickly following this accomplishment I also ate something I'm very allergic to like a complete idiot. Needless to say, my desire to Diamond Hand led me to the hospital safely. I ain't goin out until I see this shit explode.*\n\n&#x200B;\n\nEdit: Also, I flaired this as DD just because the last one was, and it still leads with an objective statistical analysis of the tweet timing, but I may change it to Discussion/Possible DD as there isn't that much to add in terms of the statistics, just an update.\n\nEdit 2: formatting, I'm a dumbass\n\nEdit 3: Instead of picking exactly 5 days out of 6 possible days (T+21 days), it is evidently more relevant to use a different equation picking 5 specific days that are nonrandom; this lands a revised probability of 0.00707%.\n\n&#x200B;",
    "title": "Hi All, It's Ryan Cohen T+21 Tweet Guy. I'm losing my shit",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6tax3/hi_all_its_ryan_cohen_t21_tweet_guy_im_losing_my/"
}