{
    "author": "Dismal-Jellyfish",
    "created_utc": 1624505587.0,
    "distinguished": null,
    "edited": 1624507077.0,
    "id": "o6soxw",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o6soxw",
    "num_comments": 129,
    "permalink": "/r/Superstonk/comments/o6soxw/part_ii_a_deep_dive_into_the_housing_data/",
    "score": 1565,
    "selftext": "TL:DR – I think the Housing market is in a bubble, which could trigger calamity when home values are no longer worth the inflated loans taken out to purchase them, which will begin to poison the Mortgage-Backed Securities they are packaged in causing further balance sheet woes for those trying to keep Marge from calling.\n\nEvening r/Superstonk, Jellyfish with you following up on the [housing bubble post from earlier](https://www.reddit.com/r/Superstonk/comments/o6ie6p/a_deep_dive_into_the_housing_data_released/)—I have additional data from the [US Census Bureau](https://www.census.gov/construction/nrs/index.html) [today](https://www.census.gov/construction/nrs/pdf/newressales.pdf) that I believe bolsters the case.\n\n[MOAR data!](https://preview.redd.it/8crkshwat4771.png?width=962&format=png&auto=webp&s=b0a4a6c1253c51f0811bb8d7b51c2cde0736e678)\n\nDespite supply increasing for months, **single-family home sales by homebuilders to the public in May fell 6% from the prior month to a seasonally adjusted annual rate of 769,000 houses, down 23% from the recent high in January**. This steep decline in sales occurred amid rising prices.\n\n[I'm definitely rustled...](https://preview.redd.it/213g9buet4771.jpg?width=600&format=pjpg&auto=webp&s=1cd35bd8804e2c751d2d9251f5db32a2c4a1b2c6)\n\nThis is eerily similar to what [I covered in existing home sales earlier](https://www.reddit.com/r/Superstonk/comments/o6ie6p/a_deep_dive_into_the_housing_data_released/)—existing inventory is moving slower as new housing comes online, yet sales dropped for the fourth month in a row, yet reaching historic highs in median price. Shit is whacked y’all!\n\nThe drop in sales of new homes in the past months brought sales back to about pre-pandemic levels:\n\n[ https:\\/\\/fred.stlouisfed.org\\/series\\/HSN1F](https://preview.redd.it/5gn5zovot4771.png?width=1463&format=png&auto=webp&s=68172a54e3ae1eff860fe85408a6d07dde776d0f)\n\n# On the other end of our equation, inventory really is rising!\n\nUnsold speculative houses rose for the fifth month in a row to 330,000 houses and months’ supply rose to 5.1 months.\n\nNew single-family homes completed since Jan 2021 : 1,328,000+1,347,000+1,497,000+1,426,000+1,368,000 = 6,966,000 homes\n\nNew single-family homes sold since Jan 2021 : 993,000 +823,000+886,000+817,000+ 769,000 = 4,288,000 homes\n\nSupply is up +2,678,000 homes in 2021 so far.\n\n[ https:\\/\\/fred.stlouisfed.org\\/series\\/HNFSEPUSSA](https://preview.redd.it/pvfre22mu4771.png?width=1457&format=png&auto=webp&s=24026cb5a0a188ac9d46c8054af06a5797d643ec)\n\nJust how existing homes median prices spiked 24% year-over-year, **the median price of new single-family houses rose 2.5% from the previous month, and spiked 18.1% year-over-year, to a record $374,400**:\n\n[ https:\\/\\/fred.stlouisfed.org\\/series\\/MSPNHSUS](https://preview.redd.it/rdu474gpu4771.png?width=1458&format=png&auto=webp&s=2f5cdbeb54cec16f76e92cc97a3bb9b68d0b878e)\n\nThese new homes are sold by homebuilders and purchased by Joe Q. Public. This is different than the existing home sales I covered earlier where Joe Q. haggles with Jane Doe for way over asking price on a literal dump.\n\nI think this dynamic is more dangerous, since the FED brrrrr is making it rain like James Harden in the club, and with folks getting approved for higher amounts and choosing to use the entire amount they are approved for, with builders more than eager to accommodate them!\n\nSales of homes over $500,000 accounted for 24% of total sales in May and April. Homes selling for over $400,000 accounted for 45% of total sales. Prices are way up while sales are slowing but the people who are buying are going BIG.\n\nPicking up with the previous post:\n\nWith the conditions of the housing market above, I believe we are entering ‘textbook’ bubble territory.\n\n[ Source: https:\\/\\/www.investopedia.com\\/terms\\/h\\/housing\\_bubble.asp ](https://preview.redd.it/2wj6oh3zu4771.png?width=794&format=png&auto=webp&s=eefbbdaea864f035ac93d523b46a350c745bc24f)\n\nOk, as we covered above, demand had been through the roof, but the supply is back on the rise and current stock is taking longer to move. At the same time, demand for new mortgages is decreasing as the supply continues to hold and increase—but prices continue to go up!\n\n[uh-oh...](https://preview.redd.it/q79xm9n5v4771.png?width=884&format=png&auto=webp&s=0877dda6d36c0b59d8a9056eec83fa036e580b4b)\n\nBut what about delinquency rates? This can be a source to the supply...\n\n[ https:\\/\\/www.mba.org\\/2021-press-releases\\/may\\/mortgage-delinquencies-decrease-in-the-first-quarter-of-2021](https://preview.redd.it/70ng3nt8v4771.png?width=1111&format=png&auto=webp&s=90d1c36d66707dbed8695944901794dc3abc7715)\n\n>On a year-over-year basis, total mortgage delinquencies increased for all loans outstanding. The delinquency rate increased by 141 basis points for conventional loans, increased 498 basis points for FHA loans, and increased 297 basis points for VA loans.The delinquency rate includes loans that are at least one payment past due but does not include loans in the process of foreclosure. The percentage of loans on which foreclosure actions were started in the first quarter rose by 1 basis point to 0.04 percent. The percentage of loans in the foreclosure process at the end of the first quarter was 0.54 percent, down 2 basis points from the fourth quarter of 2020 and 19 basis points from one year ago. This is the lowest foreclosure inventory rate since the first quarter of 1982.The seriously delinquent rate, the percentage of loans that are 90 days or more past due or in the process of foreclosure, was 4.70 percent. It decreased by 33 basis points from last quarter and increased by 303 basis points from last year. From the previous quarter, the seriously delinquent rate decreased 34 basis points for conventional loans, decreased 19 basis points for FHA loans, and decreased 37 basis points for VA loans. Compared to a year ago, the seriously delinquent rate increased by 205 basis points for conventional loans, increased 771 basis points for FHA loans, and increased 379 basis points for VA loans.\n\n**Then there are those still in or coming out of forbearance with the likely expiration and non-renewal of these Covid rules at the end of the month:**\n\n[The Mortgage Bankers Association's (MBA) latest Forbearance and Call Volume Survey revealed that the total number of loans now in forbearance decreased by 2 basis points from 4.18% of servicers' portfolio volume in the prior week to 4.16% as of May 30, 2021. According to MBA's estimate, 2.1 million homeowners are in forbearance plans.](https://www.mba.org/2021-press-releases/june/share-of-mortgage-loans-in-forbearance-slightly-decreases-to-416-percent)\n\n[Forbearance details](https://preview.redd.it/f43d39gcv4771.png?width=1169&format=png&auto=webp&s=81c185d9b1a2d5f82921c20d3fb569e8aef5381e)\n\nWhile it is great to see people come out of forbearance, if I am reading the numbers correctly, more than half of folks coming out are still going to have amounts that still need to be paid back on top of the normal monthly payment. Budgets are already stretched tight, [wage growth is decreasing](https://www.atlantafed.org/chcs/wage-growth-tracker), and inflation is making everything else [more expensive](https://www.reddit.com/r/Superstonk/comments/o59uyb/no_inflation_my_waffle_house_has_had_to_print_new/h2lnk5e/?context=3).\n\nIf these mortgages begin to fail, you can bet that it will have an impact on the Mortgage-Backed Security (MBS) it was packaged into. Enough of that begins to happen, and the balance sheets that were already trying to fight inflation are now caught in a two-front war with inflation and decreasing MBS values. Throw in the fact the Fed is kicking around the idea of tapering MBS purchases (who this dog shit would get offloaded to) and the problem begins to compound!\n\nTick-Tock...",
    "title": "Part II: A deep dive into the housing data released TODAY and what it can mean for GME! Hint:🚀🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6soxw/part_ii_a_deep_dive_into_the_housing_data/"
}