{
    "author": "Leenixus",
    "created_utc": 1624451141.0,
    "distinguished": null,
    "edited": false,
    "id": "o6brgy",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o6brgy",
    "num_comments": 265,
    "permalink": "/r/Superstonk/comments/o6brgy/t21_and_t35_actual_working_theory_that_predicts/",
    "score": 3894,
    "selftext": "# Intro\n\nI've posted about this before and showed proof of this \"theory\" working almost perfectly. I've already explained the methodology which is based on the use of T+21 and T+35 cycles.\n\nUsing this method, i'm able to tell almost exactly on which days GME will move significantly and not crabwalk/trade sideways. The accuracy is give or take 1 day.\n\n&#x200B;\n\n# Basic Info\n\n**What does this method predict?**\n\n* It can tell you almost with precision on which days GME will move significantly more than normal.\n\n&#x200B;\n\n**What this method can't predict.**\n\n* It can't predict when GME will moon.\n\n&#x200B;\n\n**What else can this method tell me about GME?**\n\n* If used correctly, it can indicate perfect bottoms.\n* If used correctly, it can indicate days where GME will be shorted.\n* If used correctly, it can indicate days where GME will recover to it's pre-shorted price.\n\n&#x200B;\n\n**So what? Who cares, GME will moon anyway.**\n\n* Yes GME will moon. Buy, Hodl, etc.\n\n&#x200B;\n\n\\----------------------------\n\n&#x200B;\n\n# Part 1 - Everyone else's T+21 and T+35 theory\n\n**The 'can' or 'infinity pool'**\n\nThe well known T+21 and T+35 graphs posted here have their own merit, they're not wrong, they simply track something specific which in my opinion is the actual 'can' or so called 'infinity pool' that's being kicked by the MM/SHFs.\n\nTracking the position of the can that's being kicked is fine. I wanted something deeper than this.\n\n&#x200B;\n\n**This theory Vs the basic/common T+ theory**\n\nAgain, the basic T+21 and T+35 theory has it's merits. Not bashing it. I wanted something more specific, accurate, granular and i found something.\n\nHere's the differences between my theory and the commonly known T+ theory.\n\n* **Basic:** It only gives me the information that there will be only **2** moves within T+21 and T+35.\n* **My methodology** can show **4-10** different days in a T+21 - T+35 cycle.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n# Part 2 - The Proof\n\nI guess there's no point in explaining anything further unless i show proof of my claims, right?\n\n&#x200B;\n\n**So here's my proof**\n\n* I made 2 prediction posts on Tradingview (a stock charting site).\n* You cannot edit a prediction after it's posted. So if you made a prediction, it is what it is. No editing.\n\nThey all (for the most part) accurately predicted the days on which GME would move more than normal and not crabwalk/trade sideways.\n\n&#x200B;\n\n**Post 1 -** Please excuse the mess. I was still in the process of refining the theory. Your takeaway from this is that you need to look at the vertical white lines in the future.\n\nThese indicate the days where GME should move more than normal (again, with a +-1 day accuracy)\n\n[https://www.tradingview.com/chart/GME/t15y2iPt-GME-FTD-Reset-Cycle-Update/](https://www.tradingview.com/chart/GME/t15y2iPt-GME-FTD-Reset-Cycle-Update/)\n\n*Press* ***play*** *and see the result.*\n\n&#x200B;\n\nScreenshots for bored folk - **Before**\n\n[I said it would be messy](https://preview.redd.it/1rpk38tuzz671.png?width=1571&format=png&auto=webp&s=ed9319afe5f001593414c680aea6fc5325c94d5c)\n\nScreenshots for bored folk - **After**\n\n[Very messy, but it's there.](https://preview.redd.it/mxvlmibzzz671.png?width=1578&format=png&auto=webp&s=d4ad6062b83bacf5e3e4cb54a8e72105681888b3)\n\n&#x200B;\n\n**Post 2 -** No mess here. This is where i've refined the theory and made it simple, understandable and as clear as day for anyone to understand.\n\nAgain, just look at the white lines. That's when GME should move (again never forget +-1 day accuracy).\n\n[https://www.tradingview.com/chart/GME/ATA3MRUc-GME-Next-FTD-Reset-or-Bleed-Dates/](https://www.tradingview.com/chart/GME/ATA3MRUc-GME-Next-FTD-Reset-or-Bleed-Dates/)\n\n*Press play and see the result.*\n\n&#x200B;\n\nScreenshots for bored folk - **Before**\n\nhttps://preview.redd.it/ku7li0y400771.png?width=1567&format=png&auto=webp&s=7d064c29afc1694deb156e44666d3b4ef3b30343\n\nScreenshots for bored folk - **After**\n\nhttps://preview.redd.it/dn7c4za600771.png?width=1571&format=png&auto=webp&s=1781e1b320cf9f583a38439b5fd4f2a9dd3a4081\n\n&#x200B;\n\n&#x200B;\n\n# Part 3 - The doubter\n\nIf you can do the same by using the T+21 - T+35 theory go ahead. You have proof, it's undeniable. Really, i've posted this proof before and people dismissed it.\n\nI posted proof above, what else do you want? I spent 3+ months building, verifying this theory into a working methodology and provided proof above. Take it or leave it or do better yourself.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n# Part 4 - The methodology & Basic Example\n\nThe methodology is already posted in the threads below, but i'm going to repeat it one more time in case it was missed (And i do think it was missed by too many people).\n\n* [Part 2 - The next FTD cycle bleedout days](https://www.reddit.com/r/Superstonk/comments/nzkwkf/part_2_intraweek_max_pain_the_next_ftd_cycle/)\n* [Part 3 - The next FTD cycle bleedout days](https://www.reddit.com/r/Superstonk/comments/nznccu/part_3_intraweek_max_pain_the_next_ftd_cycle/)\n\n&#x200B;\n\n**Methodology Intro - Naming**\n\nI personally call it something along the lines of: **\"Reset or Bleed\"**\n\nThe methodology assumes that on the days marked on the chart, the MM/SHFs or are forced to deal with the effects of their shorting activities.\n\nOn the days marked on the chart, MM/SHFs have to decide whether they want to:\n\n* Kick the can **(Reset)**\n* Deliver/Cover **(Bleed)**\n\n&#x200B;\n\n**Methodology - Basic Example**\n\nI'll be explaining how the basics of the methodology work. You can derive a date on which GME will move significantly based on this.\n\n&#x200B;\n\n**Step 1**\n\n*Simple*\n\n1. Take a day where you believe a decent amount of shorting occurred.\n2. Count T+21 days from that date into the future.\n3. Count T+35 days from that date into the future.\n\nNow repeat this for all other dates on which you believe there was decent shorting going on. (Yes assume all red candles are baddies shorting)\n\n&#x200B;\n\n***Step 1 -*** *Example Chart*\n\nhttps://preview.redd.it/4d2vzeuk10771.png?width=2444&format=png&auto=webp&s=0f1ee967e4fe43d1e6794bb81b896708da490b57\n\n&#x200B;\n\n**Step 2**\n\n>*Think like a hedgie. Be the hedgie. See the world through the hedgie's eyes.*\n\nBased on the chart in Step 1, we now have 4 dates on which MM/SHFs need to make a decision:\n\n1. June 14\n2. June 15\n3. June 16\n4. June 18\n\nThe T+21 and T+35 dates are coming up for the previous shorts, do you:\n\n* Kick the can **(Reset)**?\n* Deliver/Cover **(Bleed)**?\n\n&#x200B;\n\n***Think like a hedgie***\n\n* You have 4 dates for Reset or Bleed in the exact same week. How do you deal with this?\n* Failing to deliver is **NOT** an option.\n\nSo you **MUST** ***\"Reset or Bleed\"***. (Kick the can or Deliver/Cover).\n\n&#x200B;\n\n***Why is failing to deliver NOT an option?***\n\nIt should be fairly obvious at this point. Failures to deliver have been at an all time low since January's sneeze.\n\nYou're a hedgie and you DO NOT want the SEC's attention on that 1 hot meme stock.\n\n[FTDs at an all time low since January's sneeze. If you FTD too much, someone's gonna ask start asking questions.](https://preview.redd.it/zz69vk7x40771.png?width=960&format=png&auto=webp&s=4342437af775d0c9322c829da12bc0929d738543)\n\n&#x200B;\n\n**The T+21 and T+35 Cluster**\n\nAs we said previously above, we have 4 dates in the SAME WEEK on which T+21's and T+35's for previous shorts must be dealt with.\n\nhttps://preview.redd.it/lreb419h50771.png?width=1068&format=png&auto=webp&s=c7f08cba73acd6c69747c0ffa5f4e2aa0ef2aeea\n\n>**Q:** If you're a MM/SHF, what's the most logical thing to do for the above dillema? When do you deal with the underlying problem of you being too greedy and the T+21 and T+35 cycle?\n\n&#x200B;\n\n>**A:** You would **\"Reset or Bleed\"** ALL 5 coinciding cycles of that week on June 14 (Monday) right? Well usually yes, but in some cases this is instead done +1 day later. The reason that i suspect this is done is because of **FTD close out lock-in's**.  \n>  \n>This is a Finra or Sec rule (I can't remember) that says if you exceed T+21 or T+35 for closing out an FTD or what's about to be an FTD, they'll auto close it for you at market price and charge it to your balance.\n\n&#x200B;\n\nNow you also understand the better reason why no one wants to have pending FTD's with GME. If you have a lot of FTDs and they get auto closed out by **Finra/Sec lock-in trades** at the wrong time, they could cause \"delivery/covering\" at the strategically wrong time for a MM/SHF.\n\nImagine this happening for a lot of FTDs at $280 a week ago. It would trigger the moass. Similarly, imagine FTD's getting auto-closed out at market price DURING the moass. Scary (for them).\n\n&#x200B;\n\n**Step 2 - Result**\n\nWell see for yourself.\n\nThey made their move on the 15'th and not the 14'th as you'd expect. It's possible they're not even lifting a finger here and letting Finra/Sec's system auto-close to-be FTD's for them.\n\nhttps://preview.redd.it/9zbwann480771.png?width=1561&format=png&auto=webp&s=12c9ad14b22234e6c14a6c6efa24f206aa12213c\n\n&#x200B;\n\n&#x200B;\n\n# Part 4 - The Methodology & Advanced Example\n\nThis part will be messy and complex looking but i swear it's not if you've been paying attention. Incidentally, it's also already explained [here](https://www.reddit.com/r/Superstonk/comments/nznccu/part_3_intraweek_max_pain_the_next_ftd_cycle/), but here we go again anyway.\n\n&#x200B;\n\n**Part 1 - Mapping all T+21 and T+35's for all significant short days**\n\nIt's simple, find a significantly short looking day in the past and count T+21 AND T+35 from it. Mark those 2 dates. Repeat, repeat it a lot...\n\n&#x200B;\n\n*All \"significant\" short days, mapped.*\n\nhttps://preview.redd.it/6gxrwk1390771.png?width=2443&format=png&auto=webp&s=9981d25816a2a9ce8d619088bbdd4c340b3a997a\n\n&#x200B;\n\n&#x200B;\n\n**Part 2 - Map all T+21 and T+35's for each Week**\n\nHere's this week's (June 21 - 25) map as an example. More details already posted [here](https://www.reddit.com/r/Superstonk/comments/nznccu/part_3_intraweek_max_pain_the_next_ftd_cycle/)\n\nhttps://preview.redd.it/vsykczg9a0771.png?width=2107&format=png&auto=webp&s=6f65e3fc4afeb421bc50d5f63ce279014c4bea7f\n\nHere's the result of what happened this week. Tradingview chart [here](https://www.tradingview.com/chart/GME/ATA3MRUc-GME-Next-FTD-Reset-or-Bleed-Dates/)\n\nhttps://preview.redd.it/ny72bm3ea0771.png?width=1561&format=png&auto=webp&s=e0b5c843996312d9598cbc0bf9957214b1dbf497\n\n&#x200B;\n\n# Conclusion\n\nYeah this shit works.\n\nAlso look at what next week looks like. There's a LOT of cycles coinciding in the same week. To add even MORE to that, the cycles ending in this week are the result of the big 5 mil share offering of GME (technically a short).\n\nI really wonder whether the big 5 mil offering short will cause a big movement next week due to the T+21 T+35 cycles for it all end in the same week. I think it's a question of whether MM/SHF's have enough funds to **Reset or Bleed** (Kick the can or Cover/Deliver).\n\nI absolutely LOVE the perfect timing of this. It coincides with the Russel Reconstitution, with the 30'th of June Moratorium of rent stuff in the US and the release of the Bank Benchmark results as well as other things.\n\nI truly hope this is the 4D chess RC has played with this 5 mil offering.\n\n&#x200B;\n\n**Next Week's Map**\n\nHere's next week but please mind you, this one is VERY convoluted and difficult to decipher due to the amount of T+21 and T+35 cycles ending in the same week.\n\nI've done my best to figure out the days GME will move.\n\n&#x200B;\n\n*That's a lot of damage*\n\n[Please ignore the circle on the bottom, it's part of THIS week, not next week. Erroneously added.](https://preview.redd.it/akgb4t8wb0771.png?width=2445&format=png&auto=webp&s=9fdd8a79735ed934eccb4c2afca1e367667d003b)\n\n&#x200B;\n\nhttps://preview.redd.it/33822rq5c0771.png?width=2457&format=png&auto=webp&s=dedfc30628e1d4392bca4998655a1f5f6196911a\n\nThe mover dates/lines i added to my online tradingview chart are 30'th of June, 1'st and 2'nd of July.\n\nI tried my best to narrow it down, but i couldn't because next week is simply very complex and difficult to figure out and i'm winging this one based on my past experience using this methodology.\n\nLogically, the mover date for this should be the 30'th, but because the MM/SHF's won't touch this, i suspect we'll see another FINRA/SEC FTD auto-close out the next day on the **1'st of July.**\n\nAnyway again, for the millionth time, here's the link to my thing showing when we'll possibly move next week. [https://www.tradingview.com/chart/GME/ATA3MRUc-GME-Next-FTD-Reset-or-Bleed-Dates/](https://www.tradingview.com/chart/GME/ATA3MRUc-GME-Next-FTD-Reset-or-Bleed-Dates/)\n\n&#x200B;\n\n[Related, it's some of you. Get excited and accidentally sell all your GME because the 1'st of July didn't result in anything significant at your own risk. If you paperhand GME for something as dumb as a date, you deserve your fate.](https://preview.redd.it/14sq9hnfd0771.jpg?width=500&format=pjpg&auto=webp&s=dc0ebcd00a1e59a1cbe244becb8caf583899f878)\n\n&#x200B;\n\n**None of this is financial advice and i'm not a financial advisor.**",
    "title": "T+21 and T+35 - Actual working theory that predicts days where GME will move more than normal.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6brgy/t21_and_t35_actual_working_theory_that_predicts/"
}