{
    "author": "G_KG",
    "created_utc": 1626257495.0,
    "distinguished": null,
    "edited": 1626263189.0,
    "id": "ok1bta",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ok1bta",
    "num_comments": 58,
    "permalink": "/r/Superstonk/comments/ok1bta/the_intermarket_sweep_aka_the_straight_upanddown/",
    "score": 700,
    "selftext": "Hello all you glorious apes and apettes, I'm back after a break for more psychological abuse!  Actually I can't get enough....  the thought of Gabe Plotkin scouring my message board is....  brb sec cold shower time  (source: [https://finance.yahoo.com/news/melvin-t-shake-reddit-attack-205148761.html](https://finance.yahoo.com/news/melvin-t-shake-reddit-attack-205148761.html) )\n\nhttps://preview.redd.it/nghicybhj5b71.png?width=713&format=png&auto=webp&s=0c8eaead8be17fe4e180f8a159673971204efa8b\n\nSo I've noticed over time, posting about prices WAYYY out of the bid-ask spread associated with weird vertical-line-thingies, that one of the things that Gabe's data scientists work really hard to lie about are that these are \"glitches.\"  We've all seen them-  u/shugs517 was nice enough to post this some 20 days ago:\n\nhttps://preview.redd.it/685ffh6jj5b71.png?width=3024&format=png&auto=webp&s=7825ab3a3535049c099c85a5518ad8bfd1a279f2\n\nIt was pointed out that a whole lot of stocks did this \"straight DOWN thingy\" all at the end of trading day on Friday- [here is the original post](https://www.reddit.com/r/Superstonk/comments/og5pm9/uhm_guys_tons_of_stocks_and_even_etfs_are_doing_a/) from [u/Philbuzzoff](https://www.reddit.com/user/Philbuzzoff/) .  SO- after my last post a TON of deeply wrinkled brains helped me learn a shit-ton, and one of the most enlightening things was:\n\n# The Intermarket Sweep\n\nA.K.A. The most common thing that you never knew existed in the market. WHY?  Because fuck retail investors, why would we need to know anything??? as usual.  From [https://ibkr.info/node/1734](https://ibkr.info/node/1734) :\n\n[They happen All.  The.  Time.](https://preview.redd.it/q9vshtglj5b71.png?width=1088&format=png&auto=webp&s=a0b8f2a83f7de8c38ee85bef03c7fe401eebbb52)\n\nLet's explain why this is not a \"common\" trading technique, first.  So, there's a group of rules called \"regulation NMS\" that defines what is and is not \"legal\" to do while trading. From [https://www.investopedia.com/terms/r/regulation-nms.asp](https://www.investopedia.com/terms/r/regulation-nms.asp) :\n\nhttps://preview.redd.it/r08n7shpj5b71.png?width=647&format=png&auto=webp&s=114ec718e692c11d236077b7296e46927539e491\n\nThe important part here is the \"order protection rule,\" that's supposed to keep most trading inside the bid-ask spread.  From [https://www.investopedia.com/terms/o/order-protection-rule.asp](https://www.investopedia.com/terms/o/order-protection-rule.asp) :\n\nhttps://preview.redd.it/nhrms0lqj5b71.png?width=622&format=png&auto=webp&s=04791e7249123827fb6cfc597732e3874d772145\n\nHow can this rule exist AND intermarket sweeps be legal?  Um, reasons:  see [https://www.investopedia.com/terms/t/tradethrough.asp](https://www.investopedia.com/terms/t/tradethrough.asp) \\-\n\nhttps://preview.redd.it/h1qu1k5sj5b71.png?width=621&format=png&auto=webp&s=f30e01fce9bc853ee024d9a4dfe56fe3c22766d5\n\nAnd one of the most common \"instances\" where these trade-through regulations do not apply is??  (Yea I already gave away the answer, I know.)  The INTERMARKET SWEEP otherwise known as a \"sweep-to-fill order\", see [https://www.investopedia.com/terms/s/sweeptofillorder.asp](https://www.investopedia.com/terms/s/sweeptofillorder.asp) \\-\n\nhttps://preview.redd.it/tl6s0w2tj5b71.png?width=589&format=png&auto=webp&s=e8b68b03a9740475d953559ae6431359f86b3510\n\nhttps://preview.redd.it/f9ema6uvj5b71.png?width=614&format=png&auto=webp&s=db81b12955891bb01602302acffe923d9e6ec790\n\nMany people have seen this \"sweep the book\" activity where the entire buy side of the level two data just gets instantly obliterated (see explanation below).  That would be our friend, the intermarket sweep, in action.  Apparently they can even be used to create flash-crashes like GME saw a while ago (feels like years ago now)!  [Accenture's flash crash: what's an intermarket sweep?](https://www.wsj.com/articles/BL-MB-21819)  (I'm poor as shit so I don't have the sub to wsj.)  Anyway, these things are insanely common, here are some screenies I snapped of just the past few days:\n\nhttps://preview.redd.it/x3h9pmngk5b71.png?width=537&format=png&auto=webp&s=7115aa3235e201d3b2a2abfc300e04613b094d44\n\nhttps://preview.redd.it/3ldzbvrik5b71.png?width=696&format=png&auto=webp&s=191f19281e4fa3ba75042a90a2fbe7e8b108b201\n\nhttps://preview.redd.it/3aigvpsjk5b71.png?width=722&format=png&auto=webp&s=9664b63495ba8ba0c73b6184c4fedd47bf9b6993\n\nAnd I've also noticed that a LOT of them seem to coincide.  Fuckin striaght up-and-down thingies flying everywhere.\n\n# How to (try to) see Sweeps yourself with a normal trading platform:\n\nIt's not easy, because our plebeian trading platforms don't have code to display sweeps on-screen as they happen.  (Such trading systems cost over $30,000/year blehhhh)  However, once you know what you're looking for (and that the fucking things exist), you can begin to see *some* of them.\n\n# 1. Watch for vertical lines in chart with real-time data that smooths the graphics as much LITTLE as possible.\n\nThey will correspond blocks of RED or GREEN colored trades in the time & sales and/or level trading data.  If it looks like Christmas, you're in the right place for sweeps.\n\n# 2. Bigger ISN'T always better.  😮\n\nThe two windows below show the same stock, but as you can see, the TINY window shows our up-and-down line thingies (sweeps) much more clearly and reliably than the big window, even with the big window set to a higher resolution (1 min candles as opposed to 3min in the tiny chart).\n\nhttps://preview.redd.it/tpxynll7u5b71.png?width=1181&format=png&auto=webp&s=ca853deaea7cffff7149264aeb3e2a6c5e198396\n\nWhy didn't I get rid of all the itchy mocha clouds to take a clean picture???  (One of my favorite Siri-isms of all time.)  Because I couldn't risk breaking rule 3....\n\n# 3. For the love of all things crayola, DON'T REFRESH THE DATA\n\nOur platforms will average out the sweeps as soon as you refresh or change the time scales, but if you let the data feed into the chart in real time and *don't touch anything*, the chart might not \"average away\" the sweeps data and display it for you.\n\n# You might ask yourself wtf sweeps are used for since using them involves overpaying ungodly %s to get stocks 1-2 seconds faster??\n\nOnly the hedgies performing them know, and we can only guess. Sites will say \"because speed is valued over price,\" but that means.... nothing??  What I have noticed ANECDOTALLY (Read- this is THEORY until I get confirmation) is that sweeps are used when bull whales and short whales are fighting over a stock's price-  If you've watched level 2 data ever, I'm sure you've noticed \"buy walls\"  and \"sell walls,\" a huuuuuge # of orders at one particular price just  beyond the best bid/offer, that sort of buffers the price: [This Site does a nice job of explaining](https://www.yurikoval.com/blog/2018/10/understanding-buy-and-sell-walls.html)\n\n[Credit: https:\\/\\/www.yurikoval.com\\/blog\\/2018\\/10\\/understanding-buy-and-sell-walls.html](https://preview.redd.it/lnxtk9bpk5b71.png?width=960&format=png&auto=webp&s=d8ccc62a4918aabf6f840e7b5b411f22acec7135)\n\nWhen a sweep  order is filled, it \"sweeps the lvl 2 book\" as described above,  obliterating any buy or sell walls that have been put up  instantaneously. So THAT is what I think they're using it for..... A  really expensive way to instantly evaporate all of your enemies' defenses. With no buy/sell wall active any more, the price may be influenced far more easily.\n\nWhat is NOT anecdotal observation/theoretical is the research that smart peeps have done relating 1) Market sweeps, 2) High frequency trading, 3) Algorithm trading, and 4) Flash crashes.\n\nFlash crashes are heavily studied in financial academics, and it is agreed that they are caused by liquidity crises:\n\n>\"The CFTC-SEC Staff Report on the market events of May 6, 2010, identified automated execution of a large sell order in the E-mini contract as precipitating the actual crash. What then followed were “two liquidity crises—one at the broad index level in the E-mini, the other with respect to indi-vidual stocks” (CFTC-SEC \\[2010b\\] p. 3).\"  From [The Microstructure of the Flash Crash](https://www.datascienceassn.org/sites/default/files/The%20Microstructure%20of%20the%20%E2%80%98Flash%20Crash%E2%80%99%20-%20Flow%20Toxicity,%20Liquidity%20Crashes%20and%20the%20Probability%20of%20Informed%20Trading.pdf)\n\nSweep orders are highly correlated with flash crashes:\n\n>\"Precursory factors associated with FlashCrashes include unusual options activity (Boultana et al., 2014) abnormally-high levels of inter-market sweep orders (McInish et al., 2014), extreme illiquidity (Easley et al., 2011) and marketconcentration (Bethel et al., 2011).\"  From [Modelling and mitigation of Flash Crashes](https://mpra.ub.uni-muenchen.de/82457/1/MPRA_paper_82457.pdf)\n\nTrading algorithms incorporate market sweeps in their trading behavior:\n\n>\"This is imperative also because of algorithmic trades that involve “sweep orders” which scan all exchanges for the best available execution price. The preclusion of trade in one market could automatically allow search in substitute markets. An erroneous order could then have a disruptive effect in those markets which eventually would spill over to the primary market (possibly causing a longer closure).\"  From [Algorithmic trading, the Flash Crash, and coordinated circuit breakers](https://www.sciencedirect.com/science/article/pii/S2214845013000082)\n\nThe flash crash of May 2010 has been linked to HUGE market sweep activity:\n\n>\"During the Flash Crash on May 6, 2010, a short period of high stock market volatility, some stock prices declined to $0.01, while others increased to $100,000. Examining Intermarket Sweep Orders (ISOs) before, on, and after May 6, we find that ISO use is substantially higher on May 6. For those stocks whose prices fell the most, over 65% of the sell volume comes from ISOs. During the price recovery period for these stocks, about 53% of the buy volume comes from ISOs. We believe that the unusual behavior of ISOs contributed to the sudden drop and recovery of the market.\"  From [The Flash Crash: Trading Aggressiveness, Liquidity Supply, and the Impact of Intermarket Sweep Orders](https://onlinelibrary.wiley.com/doi/abs/10.1111/fire.12047)  Fuck the paywall to get the full article here: [Because paywalls suck](https://sci-hub.se/10.1111/fire.12047)\n\nOne last example- Here's an in-depth look at why and how flash crashes occur in ETFs, specifically referencing something (I don't know what) that happened in 2015:\n\n>\"The pattern is consistent: Most trades are flagged as “Intermarket Sweep”—which means it’s a market order to take out the book.\"  ...  \"HFT algorithmic trading was a big part of what we saw. I say this for a few reasons. Firstly, no human being trades one share of anything. Second, about half the trades were flagged as intermarket sweep orders (ISOs), the common form of high-frequency trading (HFT) that values speed over price. Mom-and-pop investors aren’t flagging their 80-share trades as ISOs, in my experience.\"   From [Understanding ETF 'Flash Crashes'](https://www.etf.com/sections/blog/understanding-etf-flash-crashes?nopaging=1)\n\nEDIT: Thanks to u/shiftyasiankid for grabbing this pic from a Rensole morning post- this is what GME's flash crash on 3/10/21 looked like:\n\n[holy fucking sweeps, batman](https://preview.redd.it/wiewbkss16b71.png?width=2048&format=png&auto=webp&s=a6e09dcdfced66e3bf50b0c6029b76839a7007b6)\n\nEvery time someone has posted about these \"straight up and/or down lines\" they get bombarded by Gabe's data scientists, trying to convince them either: 1) it's just a glitch, 2) someone fat-fingered a trade (illegal for a broker to take advantage of that because of reasons above), 3) someone at the broker fat-fingered the trade (seriously....   what?)  and they ALL know these are market sweeps. **I passionately hate getting lied to.  I have NO IDEA why they're all lying about this.**\n\nAnyway I'm off to vape some crayons, this fresh box of crayolas has some mad terps and I'm dying to dig in.  Hope I could provide some wrinkles!!!\n\n# TLDR: Straight-line thingies are no glitches, they're market sweeps from institutional traders.\n\np.s. there's no financial advice in here, only 🦍💎🙌🚀🚀🚀🚀🚀🚀🌙",
    "title": "The Inter-market Sweep; a.k.a the \"straight up-and-down thingies\" that are definitely NOT a glitch",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ok1bta/the_intermarket_sweep_aka_the_straight_upanddown/"
}