{
    "author": "hogie48",
    "created_utc": 1622272654.0,
    "distinguished": null,
    "edited": 1622316339.0,
    "id": "nnhyue",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nnhyue",
    "num_comments": 229,
    "permalink": "/r/Superstonk/comments/nnhyue/nftgamestopcoms_wallet_holdings_lead_me_to_a/",
    "score": 1596,
    "selftext": "EDIT:  Since I am seeing a lot of comments about how I am making assumptions that Gamestop themselves (or the owner of this wallet) is buying these coins, NO I am not.   I am simply saying these coins exist, in the wallet that exists on the nft.gamestop.com page.   Who bought them, or who sent them, is completely unknown.   Yekcoin and Barings is the only really interesting piece.\n\nDisclaimer:   I know just enough about crypto to know that I don't know shit about crypto.   I would love someone who is well versed in Crypto and DiFI to look further.  I do not advise anyone to buy any of these coins, I am basically just doing research here and don't know anything about them.   Call it a brain dump.   Also, it is extremely late and I am hoping some Aus apes can see this and keep it going while I get some sleep.\n\n**TL:DR\nThis post turned into a rabbit hole much larger than I thought it was.  Citadel sold their \"hedge fund book keeping\" business to a company, who they manage the source code for, and are also a client of?   That same company bought the assets of a British bank that went defunct in 1995 because they suffered massive losses from misreporting trades? If you don't care about memes, NFTs, Gaming platforms on blockchain, or a speculation on a possible stock market exchange run on the blockchain than CTRL + F \"Yekcoin\" and read from there, this is the biggest 7 degrees of Kevin Bacon I have ever seen.  ~~Oh yeah and GME Coins have started to be minted and transferred in to Gamestops wallet~~**\n\n---\n\nI created a post about the wallet the other day (https://www.reddit.com/r/Superstonk/comments/nl9lu2/there_is_a_lot_more_to_that_crypto_wallet_than/) so I won't go into too much detail about previous items, but a couple of things worth mentioning:\n\n---\n\nThe token address from https://nft.gamestop.com/ is \n\n    0x13374200c29C757FDCc72F15Da98fb94f286d71e\n\n(The \"1337 wallet\")\n\nEtherscan link to it: https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e\n\n- 196,000 coins of HOGE (https://hoge.finance/) that is a deflationary coin, but they have an unannounced run of NFT's, and as well their First Generation has a rocket ship flying over the moon... https://www.hogemint.com/guide. \n- 5 coins of BEPRO (https://www.bepro.network/): \"Build the future of DeFi Gaming\" \"We are a Code-as-a-Service protocol providing technology and support for blockchain-based applications.\" \n- BEPRP  (https://www.bepro.network/) \"We are a Code-as-a-Service protocol providing technology and support for blockchain-based applications.\", \"Build Anything\nPrediction Markets, NFT Platforms, Informational Markets, DeFi Gaming, and more\"\n- Random gaming related coins like GLOOP (ClickerHeroes?), \n- Random meme coins and random meme number of coins all over (69420 as an example).   There may be way more about some of these than I care to dig into though... newer ones are far more interesting for me right now but the linked post above has all the info I pulled out of them.\n\n--- \n\nI looked farther into VETH (Vether: https://vetherasset.org/,  https://www.vetherasset.io/whitepaper) from my first post as well and it is more interesting than I noticed before.\n\nhttps://i.imgur.com/lztNilw.png\n\nSnippets from the whitepaper: Vether is a \"strictly-scarce Ethereum-based asset\", and the only way to acquire it is by destroying \"an asset with existing value, such as Ether or ERC-20 tokens\". \"Vether is designed to return scarcity properties to Ethereum, captured in a single fixed-supply asset, emitted in a way that continually absorbs value, at the same time as being distributed fairly and at-cost.\"\n\nWithout digging much further into it, it really jumps out as a needing way more research into the underlying technology.  It seems to be adaptable to a company being able to use this for their own stock as it would allow them to introduce shares at a consistent rate and ensuring someone buying it is paying exactly what it is worth.\n\n---\n\nAnother new coin since my last post is uJENNY (https://jennynft.io/).  \"The First Metaverse DAO and Social Token on Unicly\", what is a DAO you ask?  \n\nhttps://www.investopedia.com/tech/what-dao/\n\n> Why make an organization like the DAO? The developers of the DAO believed they could eliminate human error or manipulation of investor funds by placing decision-making power into the hands of an automated system and a crowdsourced process. Fueled by ether, the DAO was designed to allow investors to send money from anywhere in the world anonymously. **The DAO would then provide those owners tokens, allowing them voting rights on possible projects**.\n\nhttps://i.imgur.com/kV10SHJ.png https://i.imgur.com/aRphTD5.png\n\nAgain this seems like it could be used for corporate governance over a blockchain stock.   I don't want to speculate too much on this since way more research would be needed, but this token really seems to be set up like corporate governance that allows for voting rights, splits, buying/selling at a fair price, and even an \"ETF\" style way of buying NFTs\n\n (https://www.unic.ly/: how it is combined, fractionalized, or traded) of the token, a portion of the funds sold are transferred back to the DAO and earmarked for buying NFT's (stock buybacks).  Incentivizing holdings\n\n---\n\nNOTE:  I got to this point in writing my \"updated coins\" post when I stumbled on Yekcoin... that was a long long time ago...\n\nYekcoin... now this is one that really stood out.  It is a \"Blockchain Based Payment Systems for Businesses\" (https://www.yekcoin.net/).  Makes sense and goes along with any sort of NFT direction GME wants to go, but again this strangely ties into a stock market as well.  It does not have transaction fees like a normal payment system being a fixed amount, it charges 0.05$ per transaction instead.  This would, for example, completely destroy high-frequency trading.\n\nOk, that's cool and all, but why did this coin stand out to me? Well, there are currently 2,602.1995 coins in the 1337 wallet.  That really looks like a date doesn't it, what happened on that date? \n\nhttps://www.onthisday.com/date/1995/february/26\n\n> Historical Events\n\n> **London finance house Barings collapses after huge losses in Singapore by rogue trader Nick Leeson**\n\nI'm sorry, what?   Does it just so happen there is a number of coins, in a coin related to low-cost payment systems that would completely fuck up HFT, lines up with the exact date that a British bank went defunct? \n\nhttps://en.wikipedia.org/wiki/Barings_Bank#1995_collapse\n\n> Barings was **brought down in 1995 by a massive trading loss caused by fraudulent trading** by its head derivatives trader in Singapore, Nick Leeson. Leeson was supposed to be arbitraging, seeking to profit from differences in the prices of Nikkei 225 futures contracts listed on the Osaka Securities Exchange in Japan and on the Singapore International Monetary Exchange. **However, instead of buying on one market and immediately selling on another market for a small profit, using the strategy approved by his superiors Leeson bought on one market then held on to the contract, gambling on the future direction of the Japanese markets**.\n\nSo this bank was brought down because someone was buying futures on one market, and rather than selling them right away on another for a profit, they were holding them and hoping it would go up, but didn't.  Sounds familiar?  Strange volume in certain European markets maybe?\n\n> Internal control\n\n> Leeson was general manager for Barings' trading on the Singapore International Monetary Exchange. **However, Barings circumvented normal accounting, internal control and audit safeguards by making Leeson head of settlement operations for SIMEX, charged with ensuring accurate accounting for the unit. These positions would normally have been held by two different employees. With authority to settle his own trades, Leeson was able to operate with no supervision from London—an arrangement that made it easier for him to hide his losses.**[16] After the collapse, several observers placed much of the blame on the bank's own deficient internal control and risk management practices. A number of people had raised concerns over Leeson's activities but were ignored.\n\nAgain, sound familiar?  A certain hedge fund who also has a big brother Market Maker maybe?\n\n> Corruption\n\n> **Because of the absence of oversight**, Leeson was able to make seemingly small gambles in the futures arbitrage market at Barings Futures Singapore and **cover for his shortfalls by reporting losses as gains to Barings in London. Specifically, Leeson altered the branch's error account, subsequently known by its account number 88888 as the \"five-eights account\", to prevent the London office from receiving the standard daily reports on trading, price and status**. Leeson claims the losses started when one of his colleagues bought 20 contracts when she should have sold them, costing Barings £20,000.\n\nWith no oversight, Leeson made bad bets and covered the failures by reporting losses as gains.  He altered a branches error account to prevent the oversight from getting daily reports on the failures.\n\n> Kobe earthquake\n\n> Using the hidden five-eights account, Leeson began to trade aggressively in futures and options on the Singapore International Monetary Exchange. His decisions routinely resulted in losses of substantial sums and he **used money entrusted to the bank by subsidiaries for use in their own accounts. He falsified trading records in the bank's computer systems and used money intended for margin payments on other trading. As a result, he appeared to be making substantial profits. However, his luck ran out when the Kobe earthquake sent the Asian financial markets—and with them, Leeson's investments—into a tailspin. Leeson bet on a rapid recovery by the Nikkei, which failed to materialise**\n\nJust replaced that last little bit about betting on a fast recovery to better on a dying store and you have a GME scenario...\n\n> Aftermath\n\n> Dutch bank ING purchased Barings Bank in 1995 for the nominal sum of £1[19] and assumed all of Barings' liabilities, forming the subsidiary ING Barings. In 2001, ING sold the US-based operations to ABN Amro for $275 million and folded the rest of ING Barings into its European banking division.[22] This left only the asset management division, Baring Asset Management. In March 2005, BAM was split and sold by ING to MassMutual, which acquired BAM's investment management activities and the rights to use the Baring Asset Management name, and Northern Trust, which acquired BAM's Financial Services Group.[23][24] Barings Bank no longer has a separate corporate existence, although the Barings name still lives on as the MassMutual subsidiary Baring Asset Management.[25] In March 2016, a merger was announced with other asset management subsidiaries of MassMutual, creating a new \"Barings\" headquartered in Charlotte, NC.[26] Baring Private Equity International was acquired by its respective management teams, which today include Baring Vostok Capital Partners in Russia, GP Investments in Brazil, Baring Private Equity Asia[27] and Baring Private Equity Partners India.[28]\n\nLots of names in here around who bought what part of the business (I didn't even go through them all because I got mind fucked after this next one).  The one that stood out to me the most was who bought \"BAM\" or Barings Asset Management.  A company called Northern Trust, new to me, but one thing that stood out quickly on their Wiki was they are based in Chicago.  Hmm, where do I know Chicago from?\n\nWhat's this, 2 years ago Northern Trust acquired Citadel's Omnium Technology Platform?  https://www.nasdaq.com/articles/northern-trust-acquires-citadels-omnium-technology-platform-2018-07-02\n\nWhat is Citadel's Omnium Technology Platform?   According to Frobs (https://www.forbes.com/sites/halahtouryalai/2011/05/16/what-citadels-sale-of-omnium-means-for-hedge-fund-investors/?sh=29a596521ab5), it is \n\n> Omnium, which was launched by Citadel in 2007, is a hedge fund administrator which means it is hired by hedge fund managers to maintain their books and records. Citadel's hedge funds were using Omnium for its own administration services.\n\nBusinessinsider (https://www.businessinsider.com/everyone-thinks-its-really-weird-that-citadel-just-sold-omnium-2011-5) also says \n\n> Omnium provided hedge fund services (like accounting, for example) for a variety of third party clients. **Citadel owned Omnium and was a client**. While a number of their groups had their own back and middle office personnel, other parts of Citadel relied on the company for service, according to our source. \n\n\nLet me get this straight...\n\nGamestop is holding 2,602.1995 Yekcoins that is a payment system specifically designed to disincentivize a lot of very small transactions, and that coin count just happens to line up with the date the bank Barings went defunct in 1995, and a company called Northern Trust who bought that defuncts Asset Management division just so happened to buy Citadel's hedge fund book management system in 2018, that Citadel still manages the source code for, and who Citadel is also a client of?\n\nNot going to lie... bit scared about what I just stumbled on.\n\n\n~~Oh yeah and also GME minted 2,000,000 coins out of a total 12,000,000 possible to be minted.  All 12M were sent to a single wallet, who then sent 6M to another wallet, and both wallets with 6M sent 1M each to \"1337 wallet\", leaving 10M split in the two original wallets.~~\n\nhttps://www.reddit.com/r/Superstonk/comments/nnhyue/nftgamestopcoms_wallet_holdings_lead_me_to_a/gzv2tjv/\n\n/u/ImSkrpted pointed out that the GME coins are from a different contract.   Thanks for pointing that out.   Honestly I lost track of the GME coin once I found Barings",
    "title": "nft.gamestop.com's wallet holdings lead me to a British bank that went defunct in 1995 for misreporting losses due to no oversight, and of course, that leads to Citadel...",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/Superstonk/comments/nnhyue/nftgamestopcoms_wallet_holdings_lead_me_to_a/"
}