{
    "author": "WrongByTechnicality",
    "created_utc": 1622286289.0,
    "distinguished": null,
    "edited": 1622370781.0,
    "id": "nnl5r4",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nnl5r4",
    "num_comments": 247,
    "permalink": "/r/Superstonk/comments/nnl5r4/so_i_think_the_auction_for_assets_has_already/",
    "score": 1682,
    "selftext": "Okay, so this is my first attempt at doing a possible DD and this is what I’ve come up with.\n\nI received an email from **Robinhood** (**I already transferred my shares out**) the other day telling me their ACH had changed from **Sutton Bank** and that they would now be using **JP Morgan Chase**.\nRight away my bias wanted to be confirmed that this had something to do with The MOASS. But, I didn’t yet have any proof. So, I hopped onto **DuckDuckGo** and got to searching.\n\nThe first search I did was for **Sutton Bank** which turned up, what seemed-to be a somewhat small bank in Ohio. I thought this was kind of odd due to the fact Robinhood is a pretty large brokerage company... and my confirmation bias wants them to be hiding something. Which led me to my second search which was for “Sutton Bank Assets”. This time the search results lead me to a website called https://bankjitsu.com/org/sutton-bank.cgv. Here, I came across some interesting information about parent organizations of **Sutton Bank** since it was first established in 1878. The parent organization that caught my attention for a deeper dive was a company called **Centran Corporation**.\n\nWhile looking into **Centran Corporation** I learned that they “**sustained a major securities loss and problems with its international loans in the early 80’s (sounds kinda familiar)**” before later merging with Society Corp”. After, completing the merger with **Society Corp** in 1986 they became the third-largest holding company in Ohio. They remained that way for the next 6 years where they then completed a merger with **KeyCorp** in 1994.\n\nNow, this is all speculation. But, my confirmation bias wants to connect all of this in some way and that leads me to want to believe one of the banks that got caught on the wrong side of the GameStop trade is **KeyBank**. Who in 2020 according to Wikipedia managed just under 200 Billion in assets. **KeyBank’s** Current Market cap is around $22 Billion and it just so happens JPMorgan Chase Has raised around [$22 Billion](https://www.bloomberg.com/news/articles/2021-04-15/jpmorgan-to-sell-13-billion-of-bonds-in-largest-bank-sale-ever)  in the bond market as of April 15, 2021. After raising the money the bank said it would “do something” but declined to comment any further. Could JPMorgan Chase be buying up smaller banks and clearing companies as part of some plan to consolidate and cover losses due to GME?\n\nI may be completely wrong, but my confirmation bias wants to believe we are further along in The MOASS than we think! Cheers everyone and see you all on the moon! 🚀🚀🌙\n\nTl;dr: I think Jp Morgan Chase bought Key Bank in the Defaulting Members auction of assets and they are now replacing Sutton Bank as Robinhood’s new ACH as some sort of consolidation method in order to help the MOASS run smoother.\n\n**Edit: I am assuming that the Auction of Defaulting members may have already started.**\n\n**Edit 2: Added [this link](https://www.key.com/kpb/our-insights/articles/kq-gamestops-rise.jsp)  from u/TrimleyJeweled that shows KeyBank talking about GameStop destroying the Market.**\n\n**Edit 3: Added in a screenshot of the [email from Robinhood ](https://m.imgur.com/gallery/NSHIQqX)**\n\n**Edit 4: To all the people giving downvotes. Leave a comment as to why. Help us all grow some wrinkles.**\n\n**Edit 5: It was brought to my attention by u/adventuresofjt that the [KeyBank](https://www.reddit.com/r/Superstonk/comments/nntwpt/jp_morgan_bought_key_bank_at_auction_hearing/?utm_source=share&amp;amp;amp;amp;amp;amp;amp;amp;amp;utm_medium=ios_app&amp;amp;amp;amp;amp;amp;amp;amp;amp;utm_name=iossmf)  in his area was boarded up 2 days ago on the 27th of May (the same day Robinhood sent out the email). Some are still open like the one in downtown Denver, but I’m wondering has anyone else noticed any other KeyBanks closing shop?**\n\n**Edit 6: Another interesting bit of information found by u/Flokki_the_Monk “Interesting that KeyBank just appointed a new General Counsel and Corporate Secretary just this past Monday.”**\n\nhttps://www.prnewswire.com/news-releases/keycorp-appoints-james-l-waters-general-counsel-and-corporate-secretary-301297682.html\n\n**”James L Waters came from Cullen/Frost. What a weird coincidence that Citadel Investment Group was the #1 stock holder among hedge funds of Cullen/Frost last year”** https://finance.yahoo.com/news/did-hedge-funds-call-cullen-222206998.html\n\n**Edit 7: Elaborated on my thought process a bit more in the 5th paragraph to clear up why I suspect JPM Chase bought KeyBank.**\n\n**Edit 8: Edited my TLDR to mean exactly what I think.**",
    "title": "So, I think the auction for assets has already Begun & JPMorgan Chase Bought the 25th largest Bank in the US.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nnl5r4/so_i_think_the_auction_for_assets_has_already/"
}