{
    "author": "WhyArePipesSoEvil",
    "created_utc": 1627362599.0,
    "distinguished": null,
    "edited": false,
    "id": "osgh43",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_osgh43",
    "num_comments": 123,
    "permalink": "/r/GME/comments/osgh43/fudbusters_overstocks_squeeze_was_stopped_illegal/",
    "score": 1716,
    "selftext": "\"A story with the same plot can be re-written a hundred times in different settings to excite eager audiences who are ignorant of the plagiarism.\" -Me\n\nEvery time I see OverStock brought up, I smell FUD due to a seemingly successful attack earlier in May when it was revealed that OverStock's naked shorts were allegedly grandfathered in. As in, the SEC just said, \"We know someone illegally counterfeited your shares, we're going to make you honor those and dilute your company's shares by bloating your float\". So, you'd naively use logic to conclude, \"Oh no, that happened to OverStock's shorts, that could happen to GameStop? Oh no, the squeeze is done!\" Every time the Patrick Byrne interview is shared, there's a potential for FUD from people who haven't heard the full story, so here it is.\n\nThis was the originator of the FUD post. [https://www.reddit.com/r/Superstonk/comments/np95ok/patrick\\_byrne\\_from\\_overstock\\_explaines\\_in\\_this/](https://www.reddit.com/r/Superstonk/comments/np95ok/patrick_byrne_from_overstock_explaines_in_this/)\n\nA Big Think video interview from Patrick Byrne [https://www.youtube.com/watch?v=BdBe5\\_8z53A](https://www.youtube.com/watch?v=BdBe5_8z53A)\n\nIf you pay attention, he said that the SEC has \"SAID they should grandfather in phantom shares\" back in the 2006-2009 period he was referencing. Since then, something happened which makes the original poster FUD evidenced by the first comment, below I give a history of how this boiled down.\n\nYes, the SEC were planning on honoring grandfathering. Some of you apes know about how grandfathering was a Jim-Crow era policy to prevent newly freed members of society from getting voting rights. Today, hedge funds aren't as racist, as much as they are classist. This practice allowed older firms' newly illegal activity through any new SEC policies to be considered spilt milk. Patrick Byrne, regardless of what you think of the guy speaks out when he sees things he doesn't agree with. Recently he's been getting on the wonky political side, but I ask you to skip past his 60y/o actions today and consider his 40y/o actions in 2005.\n\n# A prelude to Patrick's shorts. I describe how Amazon and OverStock grew up in the same era, but any connections are speculative, it's just an example of how shorts could determine the outcome of competition.\n\nIn 1994, Jeff Bezos, possibly with help from his former employer at DE Shaw, the first major HFT firm where he was vice president, incorporated Amazon in Washington state. He wanted to be the world's bookstore by beating in person stores with an extensive selection. Up until 1999, he had stayed in the publishing business and tried to buy out a publisher, but that was a bust. But, Time named him the 1999 person of the year for popularizing online shopping. Obviously, it took him a few years to realize not everyone was a massive dork who read books and that the Internet was a place for bringing people together, sharing information, liberating people, and porn. Lots and lots of porn. Boatloads of porn. Butt stuff, boob stuff, feet stuff, all of it. Jeff never got the big picture.\n\n&#x200B;\n\n[https:\\/\\/www.businessinsider.com\\/1997-jeff-bezos-amazon-empire-viral-video-books-2019-11](https://preview.redd.it/ais1nrbilod71.png?width=1194&format=png&auto=webp&s=fa820913ea8311bc49c97fb69f564c9bc2c51626)\n\nIn 1999, Patrick Byrne capitalized on the default of many dot-com era companies by combining online shopping with regular objects. He bought out D2-Discounts Direct, an online liquidator in 1999 and renamed it to OverStock. You could buy chairs, tiles, carpets, monitors, cables, used fleshlights, all online. Does that sound familiar? Then in 2001, the dot-com bubble burst and everyone in the business was hurting. Except, what if you get better deals on your merchandise when the economy is tanking? What if by the definition of your work, an online liquidator, you have a negative beta in your business and when a lot of companies fail, you can warehouse their assets and distribute them to the American public at an improved profit later on? When he completed his first IPO in 2002, can you think of anybody else in the industry who may have been jealous of his success? Someone like a Princeton grad who's a real assWhole ^(foods) who would enslave 1.3 million pee-bottle warehouse workers with slightly above average wages and grueling conditions just to go to space for a day or two (you weren't welcome back, Jeff)? So you have this bright eyed guy who finds the idea of an online liquidation marketplace in a successful business, buys the company out, but almost a decade back has the idea that we can use blockchain to track securities. An actual visionary unlike Jeff.\n\n[https:\\/\\/www.wired.com\\/2014\\/02\\/rise-fall-rise-patrick-byrne\\/](https://preview.redd.it/5f7i5y9eond71.png?width=944&format=png&auto=webp&s=952e36373f4407e76d864fe24ebbcea1647e69c1)\n\n2001 left the economy shaken up with the dot-com bubble and Byrne was able to capitalize on this, the guy's got degrees from Dartmouth, Cambridge, and Stanford. Jeff probably felt inferior from his toxic days at DE Shaw surrounded by the standard financial sleaze, although DE Shaw, the guy, is something of a scientist himself... So, there's a guy with a company with a value of $100 per share in 1999, down to a bubble burst low of $7 in 2001. And he's got contacts with people with the best, most powerful, manipulative, scalp-able HFT computers (at the time), and a competitor who was doing well and experiencing massive short term growth from the collapse of companies it was helping to liquidate. What do you assume that led to?\n\nhttps://preview.redd.it/0npoydz3pod71.png?width=1320&format=png&auto=webp&s=8753293199bd90ea936950dee71e370bb2bb8845\n\nOverStock grew to $70 per share at the end of 2004. After that, the media attack on OverStock began, starting with this magazine cover that seems to have been scrubbed from the internet. I beg of you to watch the Judd Bagley video I linked and the rest of Judd's videos, especially the \"Short Heard Round the World\" video.\n\n&#x200B;\n\n[https:\\/\\/www.youtube.com\\/watch?v=IZbLv\\_S\\_fYg](https://preview.redd.it/v6b080xosod71.png?width=1848&format=png&auto=webp&s=f7151ff33a24bff5ed8c8042c1f82c446bb7f351)\n\nAfter all the FUD and stock bashing, in 2005, Overstock's stock was heavily shorted, but he fought back. At the time, prior to Reg SHO, in the period between 2005-2007, the remedy was to grandfather in the naked shorts, and there was no short squeeze despite the abusive shorting. Patrick wasn't in it for the squeeze. It was people betting against him that was too egregious for him. He wanted shorts to fail and the human spirit to triumph. He spoke out against the new proposed regulations that showed favoritism to the robber baron shorters, and his advocacy worked to some extent, because Reg SHO was later amended to get rid of the grandfathering that just hurt his company with dilution. Apparently Jeff didn't have SEC moles back then. That is the end of the FUD. OverStock got naked shorted in the unfortunate period before Reg SHO's grandfathering clause was amended away, and his advocacy was critical.\n\n[https:\\/\\/web.archive.org\\/web\\/20090212131324\\/http:\\/\\/www.reuters.com\\/article\\/pressRelease\\/idUS189862+27-Dec-2007+PRN20071227](https://preview.redd.it/onf4yoprqnd71.png?width=1166&format=png&auto=webp&s=f450ceefd921858778dc24ff9ec5432ee8aba2bc)\n\nWe can't say for certain that Jeff explicitly caused the short situation at OverStock, but my point in sharing their history is that one was targeted for shorting, and the other grew to become a monopoly. The fact is, the same FUD and lies were used on OverStock, just like with GameStop. It is unfair that one company can have well-connected financial contacts and not be targeted by shorting and negative sentiment from \"analysts\" and grow successful, and another can be driven to bankruptcy from the analysts' unsubstantiated articles.\n\n[https:\\/\\/www.nbcnews.com\\/id\\/wbna13189386](https://preview.redd.it/dhbftvpqxnd71.png?width=1194&format=png&auto=webp&s=e5a1843c26af28c2fa4ef45d27a3b3636b5a6fa8)\n\nSo, we're holding GameStop. Will the naked shorts and counterfeiting be grandfathered in against the company we believe will set standards in corporate governance? No. Reg SHO has been amended and there's no policy the SEC or DTCC has that can stop our situation without the inevitable happening.\n\nWhen you see FUD, use data to invalidate it. Don't feed the trolls, but allow their lack of an argument contrast with yours and let Redditors decide, since the shills' only effect is slowing retail buy in since apes have read the facts from primary sources and KNOW that our data is solid and that we peer review shit-DD and ban conspiracy people. Their only strategy is calling you names since they don't have counter arguments that stand up. They could say things that are true, but they don't change the thesis. Today, someone told me the SEC does give out more than small fines, and they were right, occasionally, they do disgorgement proportional to ill-gotten gains for small players, but that didn't change anything about our situation, and it's unclear if the press releases saying they are prosecuting for disgorgement leads to convictions or settlements through arbitration.",
    "title": "FUD-Busters: OverStock's squeeze was STOPPED. Illegal Naked Shorts were FORCED to be counted as real by the SEC. This won't happen to GameStop because they are DIFFERENT.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/osgh43/fudbusters_overstocks_squeeze_was_stopped_illegal/"
}