{
    "author": "I_DO_ANIMAL_THINGS",
    "created_utc": 1624737459.0,
    "distinguished": null,
    "edited": 1624742423.0,
    "id": "o8hvpo",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o8hvpo",
    "num_comments": 141,
    "permalink": "/r/Superstonk/comments/o8hvpo/i_think_srficc2021003_is_significant_and_curious/",
    "score": 2603,
    "selftext": "I posted this yesterday but it got lost in pictures of the last 10 minutes of trade. Reposting now for greater discussion.\n\n[Dear Journal, I smell smoke.](https://preview.redd.it/w1f3vcdb3n771.png?width=832&format=png&auto=webp&s=424877430b361c5060c248c2507d1f2b0606ef7f)\n\nGood afternoon Apes,\n\nOnce again, I don't know anything. Do whatever with yourself.   \nAlso, 4 hour rule and don't make me into \"a guy.\"\n\n**TLDR**: I think the Fixed Income Clearing Corporation desperately needs it's requested questionable rule changes to [SR-FICC-2021-003](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/FICC/SR-FICC-2021-003.pdf) for MOASS. The SEC filed to extend the approval/disapproval date to Aug 30, 2021. No dates, don't care but I'm killing time and learning.\n\n[Federal Register Filings](https://www.federalregister.gov/documents/search?conditions%5Bterm%5D=SR-FICC-2021-003&order=newest)\n\n\\*\\*Short Background:\\*\\*  \nThe [Fixed Income Clearing Corporation](https://www.investopedia.com/terms/f/ficc.asp) (FICC) has 2 divisions:\n\n* **GSD**:  The GSD is responsible for handling new fixed-income issues and reselling government securities. The division provides netting for trades in U.S. government debt issues, including [repurchase agreements](https://www.investopedia.com/terms/r/repurchaseagreement.asp) (repos) or [reverse repurchase agreement](https://www.investopedia.com/terms/r/reverserepurchaseagreement.asp) transactions (reverse repos).\n* **MBSD**:  The MBS division of the FICC provides real-time automated and trade matching, trade confirmation, risk management, [netting](https://www.investopedia.com/terms/n/netting.asp), and electronic pool notification (EPN) to the MBS market.\n\n# On May 12, 2021, the FICC submitted to the SEC a request to modify [SR-FICC-2021-003](https://www.dtcc.com/-/media/Files/Downloads/legal/rule-filings/2021/FICC/SR-FICC-2021-003.pdf) :\n\n1. **add a new service** offering, which would allow a Sponsoring Member to submit for clearing Repo Transactions with its Sponsored Members on securities that are represented by Generic CUSIP Numbers and held under a triparty custodial arrangement (the “Sponsored GC Service”)\n2. **add language** to Rule 3A to allow FICC to recognize, for Capped Contingency Liquidity Facility® (“CCLF”) calculation purposes, any offsetting settlement obligations as between a Sponsoring Member's netting account and its Sponsoring Member Omnibus Account to ensure that a Sponsoring Member's CCLF obligation is calculated in a manner that more closely aligns with the liquidity risk associated with Sponsored Member Trades\n3. **remove the requirement** from Section 2 of Rule 3A that a Sponsoring Member provide a **quarterly representation to FICC** **that each of its Sponsored Members is a “qualified institutional buyer”** as defined in Rule 144A of the Securities Act of 1933, as amended (“Rule 144A”), or is a legal entity that, although not organized as an entity specifically listed in paragraph (a)(1)(i) of Rule 144A, satisfies the financial requirements necessary to be a “qualified institutional buyer” as specified in that paragraph\n\n[We all have wants and needs.](https://preview.redd.it/f1ew9w973n771.png?width=610&format=png&auto=webp&s=bf1521cff5bcce32efee8ba19b125c15ca910c4a)\n\n# What do? I'm not sure but here's what I've gathered:\n\n# 1. NEW SERVICE OFFERING:\n\nIt sounds like the FICC intends to add a sort of members only netting/repo/reserve account to it's GSD.  I really don't understand all of this right now but it seems like a private club for repo. As an alternative and/or buffer for the FED.\n\n[Plz help, \\<3 FICC](https://preview.redd.it/svk3vlelkn771.png?width=605&format=png&auto=webp&s=32f968bd28569dcb282b1846b698700c053921d9)\n\n**This new service seems to be extremely important to protect the liquidity of the FICC.**\n\n[The FICC seems hell bent on making sure they have a layer of protection against their Member defaulting. ](https://preview.redd.it/9uidg4m0nn771.png?width=605&format=png&auto=webp&s=2a9a0566d5f501f7ee7caea826c6f4fbaa1e48d5)\n\nThis new service seems critical. I don't know how liquidity works for the FICC but they are responsible for settling Mortgage Backed Securities and Treasury Bonds.The FICC wants to create and entirely new holding service for entities that may or may not meet the standards of  Rule 144A of the Securities Act of 1933 and they're all going to watch themselves. (We'll get to that in a moment)\n\n&#x200B;\n\n# 2. LANGUAGE CHANGE:\n\nThis is another rule change designed to protect the FICC as much as possible behind a shield of Sponsored Members, who can hide behind a shield of  “qualified institutional buyers.”\n\n[  liquidity risk to FICC is only increased to the extent the Sponsoring Member enters into a Repo Transaction with a third-party Netting Member that is novated to FICC. Such a Repo Transaction creates liquidity risk to FICC because, in the event of the Sponsoring Member's default, FICC is required to settle with such third-party Netting Member. ](https://preview.redd.it/p5knr8i2pn771.png?width=626&format=png&auto=webp&s=b104e6988720ad1e800f2b43307d3ff002572823)\n\nIt goes on to explain the obligations of it's Members and Sponsors when the house of cards begins to fall. I'll leave it to someone else to explain any of that.\n\n&#x200B;\n\n# 3. REMOVING QUARTLY REPORTING\n\nThis one I like.\n\nThey argue to remove the quarterly reporting requirement because it's too much work:\n\n[  Section 3\\(d\\) of Rule 3A separately requires a Sponsoring Member to notify FICC if its Sponsored Member is no longer either a “qualified institutional buyer ](https://preview.redd.it/iieqc90den771.png?width=611&format=png&auto=webp&s=b34a19bb8a8efc3b2482936c7f00c7ebcc7a7e64)\n\n&#x200B;\n\n* The *current* SR-FICC-2021-003 allows a Netting Member to Sponsor a \"qualified institutional buyer\" so they may access this new service, provided the \"qualified institutional buyer\" meets the requirements of  [Rule 144A](https://www.investopedia.com/terms/r/rule144a.asp) of  Securities Exchange Act of 1934\n* The FICC has filed to allow a Netting Member to Sponsor a \"qualified institutional buyer\" **without reporting if this institutional buyer meets the requirements to be \"qualified.\"**\n* **It reads as tho an \"institutional buyer\" could be Sponsored by a netting Member and is only reported once they're not longer in good standing. WHAT?!**\n\nIf redundancy is the argument and they could chose to report before/after, why would they remove the reporting requirement when ADDING a \"qualified institutional buyer?\"Mind you, this reporting requirement is to ensure the  \"qualified institutional buyer\" meets  Rule 144A, or satisfies the financial requirements necessary to be a “**qualified** institutional buyer.\n\n\\*\\*Why not remove the other half of this redundancy?\\*\\*What good does it do to report, *\"Oh yeah, those guys probably shouldn't have been in here but they're gone now, so we cool, we cool.\"*\n\n&#x200B;\n\n# Who's going to babysit these Members and their institutional buyers within this new service?\n\nThemselves of course!\n\n[You kids play safe, dad's gonna get a pack of smokes. I'll come check on you from time to time. Foods in the fridge, you know the drill.](https://preview.redd.it/0p636gu7zn771.png?width=647&format=png&auto=webp&s=6baad04d790031f38d9e84290d868e5c5c033e2b)\n\nHonestly, this does seem like they're going to be on top of it. Hourly, (or more frequent) is strict.\n\nProps to the \"Nonetheless.\"\n\n&#x200B;\n\n# THE END\n\n&#x200B;\n\nAgain, 6/24/21 SEC ^((anyone else type sex?))  published [86 FR 33420](https://www.federalregister.gov/documents/2021/06/24/2021-13287/self-regulatory-organizations-fixed-income-clearing-corporation-notice-of-designation-of-longer) in response to FICC's filing.\n\n[ Accordingly, pursuant to Section 19\\(b\\)\\(2\\) of the Act \\[5\\] and for the reasons stated above, the Commission designates August 30, 2021, as the date by which the Commission should either approve or disapprove the Proposed Rule Change SR-FICC-2021-003.](https://preview.redd.it/7jr30nexnn771.png?width=622&format=png&auto=webp&s=e7c17a4a4a91c56b4657c0877642b71ff4757d39)\n\nWell this has been fun.\n\nI like the stock and I like long term investing with companies I support. I also like government accountability and transparency. I welcome anyone with a brain to *try* and imply that I, we, you or any retail investor is manipulating anything. My cards are on the table and I'm not hiding anything from anyone.\n\n***I own GME and I don't intend to sell it!***\n\nYour turn WallStreet, let's see your hand.\n\n\\~Semper",
    "title": "I think SR-FICC-2021-003 is Significant and Curious",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8hvpo/i_think_srficc2021003_is_significant_and_curious/"
}