{
    "author": "TheBigKingy",
    "created_utc": 1618148600.0,
    "distinguished": null,
    "edited": 1618150708.0,
    "id": "moqtwf",
    "text_only": true,
    "flair_text": "Education 👨‍🏫",
    "name": "t3_moqtwf",
    "num_comments": 1197,
    "permalink": "/r/Superstonk/comments/moqtwf/the_greatest_lie_ever_told_by_wall_street_and_why/",
    "score": 19655,
    "selftext": "Something about no financial advice or whatever, I don’t know, I’m not from the US we don’t enable corporations to fuck us over for posting on a message board. Miss me with that shit.\n\nI have a background in economics, specifically game theory. I am qualified at the postgraduate level. Take what you will from that.\n\nDiamond Ape Rocket Rocket Rocket Moon\n\n**TL;DR:** Every time you ask yourself how wall st could’ve been so stupid and reckless, understand it’s because they are stupid and reckless. They’ve been conditioned to be this way. We will win because their business model is outdated.\n\nLet me fill you in on the greatest lie ever told by wall st:\n\n**They are smarter than you.**\n\nThey believe it, and most of the developed world believes it too.\n\nSo why do we all believe they are smarter than us? Well, just like we have confirmation bias in our sometimes shitty DDs, both wall st and main st are being fed confirmation bias daily about how much smarter than us they are.\n\nThey are not smarter. They just play a different game.\n\n**There are two games being played:**\n\n1. The first is the game that we (used to) believe that we were playing:\n\nWe are in a free market, the market is regulated at least somewhat to the extent that it is fair, there is no collusion and no conspiracy, because conspiracy theories are for idiots that live in their wife’s boyfriend’s basement.\n\n2 .  The second is the game that we are actually playing:\n\nThe market isn’t even nearly free or transparent. Win by any means necessary, **the only thing that matters is that you win**. Lie, cheat, steal and manipulate as much as you can afford to, because that increases your chances of winning. That’s the Nash equilibrium.\n\nHere’s the thing though, everyone has played this game for so long that wall st lost sight of the fact that they have political, financial, informational, professional, and legal advantages, and so did we. They take these advantages for granted, as if the playing field is even and they’re winning fair and square because they're just smarter.\n\nA little proof: After they colluded to turn off the retail buy button in late Jan, Steve Cohen of Point72 tweeted “Trading is a tough game . Don’t you think?”. As if this blatantly illegal market manipulation was a fair part of the game.\n\n**So why will we win?**\n\nTo answer that question, let me tell you a little story about Encyclopedia Encarta:\n\nIn the mid-1990’s Microsoft started an encyclopedia called Encarta. They employed all the right incentives. They paid professionals to write and edit thousands of articles. Well compensated managers oversaw the whole thing to make sure it came in on budget and on time. A few years later another encyclopedia started - A different model - Do it for fun. No one gets paid a cent or a euro or a yen. Do it because you like to do it. Now 10 years ago if you had talked to an economist … anywhere … and said “Hey, I’ve got these different models for creating an encyclopedia - If they went head to head who would win? 10 years ago you could not have found a single, sober economist anywhere on planet earth who would have predicted the Wikipedia model. This is the Titanic battle between these two approaches. This is the Ali-Frazier of motivation, right, this is the Thrilla in Manila, alright - Intrinsic motivators vs extrinsic motivators - Autonomy, Mastery & Purpose versus Carrots & sticks - And who wins - Intrinsic motivation, autonomy, mastery and purpose - in a Knockout.\n\nI’m sure you can see the similarities.\n\nSo while they have all the advantages that Encarta did. We have the trump card: **each other**. Yes, that’s all we’ve ever had, and we’ve just realised that’s all we need. Literally a few subreddits with some transparent information sharing and a meritocracy of ideas is all that’s needed to bring some of the most powerful people on earth to their knees…\n\nDon't get me wrong, we have big players on our side too, but we were the catalyst.\n\nIf that doesn’t explicitly demonstrate how unfair the game is, then I don’t know what else I can tell you. The game was so unfair for so long that their strategy became reckless enough that a few people buying and holding will FINISH THEM. We know it, it’s just a matter of time until they do too.\n\nThey played their cards this way because that’s the way all players taught them to play.\n\nTo be fair, their track record has been outstanding, until now.",
    "title": "The Greatest Lie Ever Told by Wall Street and Why We Will Win.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/moqtwf/the_greatest_lie_ever_told_by_wall_street_and_why/"
}