{
    "author": "GinoF2020",
    "created_utc": 1617511050.0,
    "distinguished": null,
    "edited": 1617513504.0,
    "id": "mjp5ch",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD 📊",
    "name": "t3_mjp5ch",
    "num_comments": 138,
    "permalink": "/r/GME/comments/mjp5ch/great_news_dtcc_proposes_new_rules_for_trading_we/",
    "score": 3384,
    "selftext": "DTCC – [Depository Trust & Clearing Corporation](https://www.dtcc.com/) – is the integral cog in the stock trading infrastructure, as it keeps records of the balances of securities. DTCC serves as a clearinghouse – the settling of trades from the moment you enter a position on the market via [popular stock trading apps](https://tokenist.com/investing/best-stock-trading-apps/) to the moment you exit the market. DTC had filed a rule change to the SEC that would address the above-mentioned problems. It deals both with the **multiplication of shares/securities and leveraging securities as collateral – using 40% out of 140% for borrowing or selling from the GME example.**\n\n[https:\\/\\/tokenist.com\\/is-wsb-reddit-army-about-to-make-a-comeback-with-tweaked-trading-rules\\/](https://preview.redd.it/c9n24zzo43r61.png?width=928&format=png&auto=webp&s=1dc9ec250a36c06c180bbc7562da88da13c02210)\n\nThe change removes the return of assets to the participant’s **“general free account”**. As far as the dynamic between the hedge funds [short selling](https://tokenist.com/investing/short-selling/) and retail traders is concerned, these changes imply:\n\n* When hedge funds sell ITM call options, they mask their short positions, which appear as having been closed. This new rule means that **Hedge funds would no longer be able to hide their positions by abusing call option ITM trading.**\n* This would countervail synthetic put options strategy. This stock market stratagem revolves around combining long call options with short stock positions.  This is done for the purpose of mimicking the long put option, or synthetic long put. In short, **when synthetic shares are traded in conjunction with options, they provide an appearance of a closed short position.**\n\nEffectively, these and other proposed tweaks to the ruleset **would make short-squeezing more viable in the future because opposing trading parties would not be trading in a total fog of war**. In fact, just as consumer protection legislation has clauses on legalese intelligibility for contracts, the proposed rules would dissipate such fogging when it comes to retail trading. DTCC submissions are usually approved by the SEC within a week.\n\nFor a full summary, please view\n\n[https://tokenist.com/is-wsb-reddit-army-about-to-make-a-comeback-with-tweaked-trading-rules/](https://tokenist.com/is-wsb-reddit-army-about-to-make-a-comeback-with-tweaked-trading-rules/)\n\n**Not financial advice!**\n\nEDIT1: Link to the DTCC 2021-005 - Date: 04/01/2021Description: Modify the DTC Settlement Service Guide and the Form of DTC Pledgee’s Agreement\n\n[https://mk0thetokenist81xfs9.kinstacdn.com/wp-content/uploads/2021/04/SR-DTC-2021-005-2.pdf](https://mk0thetokenist81xfs9.kinstacdn.com/wp-content/uploads/2021/04/SR-DTC-2021-005-2.pdf)\n\nEDIT2: No dates or timeframe whatsoever; Just HoDL 💎🙌 - this is not a financial advice!",
    "title": "Great news! DTCC Proposes New Rules for Trading! We may soon find out that the REAL % of shorts. That means MOASS is more likely to happen sooner than expected!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mjp5ch/great_news_dtcc_proposes_new_rules_for_trading_we/"
}