{
    "author": "creakfast",
    "created_utc": 1619475046.0,
    "distinguished": null,
    "edited": 1619487768.0,
    "id": "mz9gl6",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mz9gl6",
    "num_comments": 238,
    "permalink": "/r/Superstonk/comments/mz9gl6/nscc2021005_has_been_signed_today_implementation/",
    "score": 3382,
    "selftext": "Apes. A ***CRUCIAL*** regulatory ruling has been just signed by the DTC, and will be implemented no later than 20 business days. That means May 24th is the latest day this could be passed if we are starting the count tomorrow 4/27.\n\nThe DTCC is basically covering their own butts with this ruling, but the good news is that this means the squozazzle is imminent.\n\n&#x200B;\n\nhttps://preview.redd.it/lxtvu4v1dlv61.png?width=680&format=png&auto=webp&s=fab47ac437e0aafc65de12f83759425d18f9a3eb\n\n**TA;DR: This increases minimum fund deposit requirement for each member from $10,000 to $250,000 IN CASH. This is to mitigate the risks NSCC (DTCC) is exposed to when members get liquidated because of defaulting (margin call). In other words, NSCC is requiring EVERY member to throw $250,000 in cash to cover for member defaults. LOL.**\n\n**Addendum: NSCC can look at Members' portfolios and decide if the Required Fund Deposit amount needs to reflect the risk.** \n\n**Addendum 2: it is 20 days after the Commission (SEC) approves it. Sorry, just learned to read last week.**\n\n&#x200B;\n\nhttps://preview.redd.it/xn0zn5v4dlv61.png?width=1394&format=png&auto=webp&s=6e0bde4aa350451156179d38a77b07d9f8123823\n\n&#x200B;\n\nHOLY SCHMUCKS. JUST CHECKED NSCC MEMBERS DIRECTORY. THERE ARE 3440 MEMBERS!\n\n3440 \\* $250,000.00 = **$860,000,000.00.** This is just from the members putting in more money, not counting all the assets short positioned hedgies have.\n\n&#x200B;\n\nhttps://preview.redd.it/7uxpl1zdelv61.png?width=960&format=png&auto=webp&s=84ea04afb89cac518c54b0210a448277735e251d\n\nIt gets better: NSCC does tests that calculate the members' risks by analyzing their portfolio. **\"each Member's Required Fund Deposit would continue to be calculated with the same parameters and at the same confidence level for each Member. Therefore, Members that present similar risk, regardless of the type of Member, would have similar impacts on their Required Fund Deposit amounts.\"**\n\nI think this means NSCC can increase the minimum fund if their portfolio resembles something of Billy Hwang's.\n\n&#x200B;\n\nhttps://preview.redd.it/0l4n0nolglv61.png?width=1402&format=png&auto=webp&s=bf92c1794726827426a47577e8cd6b6718cbbceb",
    "title": "NSCC-2021-005 has been signed today! IMPLEMENTATION NO LATER THAN 20 BUSINESS DAYS.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mz9gl6/nscc2021005_has_been_signed_today_implementation/"
}