{
    "author": "K_5sixchars",
    "created_utc": 1627920177.0,
    "distinguished": null,
    "edited": 1627928361.0,
    "id": "owhki1",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_owhki1",
    "num_comments": 190,
    "permalink": "/r/Superstonk/comments/owhki1/im_going_to_say_it_shills_are_still_here_and_they/",
    "score": 3899,
    "selftext": "The comment section has done a fantastic job of expanding on this topic, the post includes comments from the comment section from fellow apes like you that really clarifies this whole conversation far beyond what I expected it to be. At the very least please read the comments highlighted in the post, it is a varying mix of views that highlights the different perspectives and facts surrounding this topic that might even give you a wrinkle!\n\n[The sentiment that GME requires market collapse is a trap, legal or otherwise, by hedge funds.](https://preview.redd.it/9wbid61vuye71.png?width=474&format=png&auto=webp&s=fd7e1640edb69c6edf62202983e9481ca6b1d8b7)\n\n&#x200B;\n\nAll GME requires is for shorts to ~~cover~~ close. From day one, that is what GME's thesis has been. The amount of posts with sentiment that, \"once the market collapses, gme is gonna moon\" is sentiment that only paints us in a bad light and gets spotlight off the center of the thesis. Which is:\n\n&#x200B;\n\nShorts did not ~~cover~~ close. Once Shorts ~~cover~~ close, GME moons.\n\n&#x200B;\n\nApes, any sentiment that could be seen as memeing the collapse of the economy, put that meme energy and pressure towards the hedgefunds ~~covering~~ closing their shorts. Because we do not need the economy to collapse for shorts to ~~cover~~ close. The responsibility does not lie on the collapse of the economy to make them ~~cover~~ close, they can ~~cover~~ close anytime they want.\n\n&#x200B;\n\nThey are just choosing not to.\n\n&#x200B;\n\nShoutout to u/DrZombieZoidberg for pointing out in the comments shorts need to CLOSE not cover.\n\n\\------------------------------------------------------------------------------------------------------------\n\nu/WeLoveTheStonks offers a counter perspective, which I respect.\n\n>The  amount of posts with sentiment that, \"once the market collapses, gme is  gonna moon\" is sentiment that only paints us in a bad light and gets  spotlight off the center of the thesis.\n\nYour  logic for this post doesn't make any sense. Part B happening because of  Part A, does not paint us in negative light.  It is simply stating an  opinion that is void of nefarious intent and based solely upon DD  arrived at after months of peer review.\n\n\\------------------------------------------------------------------------------------------------------------\n\nu/AltoniusAmakiir says it best\n\n>The fact is that the market collapse is separate and inevitable. Could a  GME squeeze be the wind that blows down the house of cards? Yes. But  the economy won't be collapsing because of GME, it will be because it  was setup to collapse already. If a major squeeze happened during a more  stable economy the economy would be fine. It's not the squeeze but the  overleverage and rampant speculation that are to blame.\n\n\\-----------------------------------------------------------------------------------------------------------\n\nu/Cacoo correcting me on the OG thesis of GME\n\nI feel your intent but I have to call this out:\n\n>From day one, that is what GME's thesis has been\n\nThis  is not accurate. The thesis was that GME was an undervalued company  with an opportunity to perform a successful digital transformation. GME  still remains an undervalued company.\n\nShort  interest is just an additional appeal of investing in the stock. And  yes, all shorts are eventual buyers, it's just a matter of *when*  (except in a successful death spiral of the company leading into  bankruptcy, but with no debt, GME will not be going bankrupt anytime  soon).\n\n\\------------------------------------------------------------------------------------------------------------\n\nu/Exceedingly brings a reality check to the post, it is very well put and I respect the adherence to the truth of the situation. The user is responding to a question I asked in the comments. We were going back and forth, but I hope this olive branch of highlighting this comment will show good will. I removed the first sentence so it reads better.\n\n>I'm an individual investor holding a stock  I like, if hedge funds happen to have naked shorted meaning they need  my shares back, then they can either pay their borrow fees forever or  close the short position by buying my shares for a price I consider  fair.  \n>  \n>I'm not causing a market  crash, the illegal naked shorting did that. But at this point hedge  funds cannot close their shorts without causing a crash. They've simply  created too many synthetics, so this is all on them, not me.  \n>  \n>But  the truth remains, no crash = no MOASS. The MOASS without a crash is  simply any old short squeeze, not the mother of all short squeezes.\n\n\\------------------------------------------------------------------------------------------------------------\n\nu/Wiezgie Explains how the crash and MOASS are related\n\n>The money that will literally pay for the shorts to close will come  from selling off all other stocks, which will cause them to drop.  \n>  \n>Even  further, their short position is gauranteed to not only make the shorts  bankrupt, but also cause the fed to literally print money to cover all  the synthetic shares that arent even supposed to exist.  \n>  \n>Hence why GME Moon = Market collapse PLUS hyperinflation\n\n\\--------------------------------------------------------------------------------------------------------\n\nu/Regular-Box-6648\n\n>Since the passing of this 300+ page ruling recently we know for sure  they have regulation in place that allows GME to squeeze without  immediately tanking the rest of the market. This requires cooperation  from the shorties and some other entities though. If they don't - not  our fault. The path has been paved for them.\n\nu/bhostess in response\n\n>This. They have been given the opportunity to lose without killing everything, they decided to say, \"fuck you\" instead.\n\n&#x200B;",
    "title": "I'm going to say it. Shills are still here and they are pushing a narrative.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/owhki1/im_going_to_say_it_shills_are_still_here_and_they/"
}