{
    "author": "Shagspeare",
    "created_utc": 1619479998.0,
    "distinguished": null,
    "edited": 1619531284.0,
    "id": "mzb5y5",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mzb5y5",
    "num_comments": 155,
    "permalink": "/r/Superstonk/comments/mzb5y5/a_shill_disinformation_post_has_been_sitting_at/",
    "score": 1096,
    "selftext": "This post is disinformation, and part of  an active disinfo campaign occurring across multiple GME subs right now:\n\n[https://www.reddit.com/r/Superstonk/comments/mz16g5/dd\\_on\\_how\\_placing\\_your\\_sell\\_limits\\_no\\_matter\\_what/](https://www.reddit.com/r/Superstonk/comments/mz16g5/dd_on_how_placing_your_sell_limits_no_matter_what/)\n\nThis post has over 160 rewards. It has 14k upvotes, a thousand comments - and it's a lie.\n\nLimit sell orders **do not apply any downward pressure on the share price by just sitting on the order book, unfilled.** \n\n**During the MOASS, that relatively small amount of low price limit orders would be blasted through.**\n\n**HOWEVER - having extremely high limit sell orders sitting on the order book could actually** ***help*** **the price rise during the MOASS.**\n\n**AND - with some brokers - these unfilled limit sell orders prevent those shares from being lent out.**\n\n&#x200B;\n\nThat post potentially contains low price anchoring - stating:\n\n>Even if it is at $1 million as a joke...\n\nThough the OP follows up by saying $1m is the floor - the ***\"$1 million as a joke\"*** is what came first, and what sticks in the mind of the reader.\n\nI'm urging the mods to take a look at that post, and consider removing it.\n\n**Update**: The mods have removed the post - much appreciated! Now, **onto what we've learned:**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Having extremely high \"joke\" limit sells could help the MOASS\n\nI wanted to add some insight u/P1ckl2_J61c2  posted [on another shill thread](https://www.reddit.com/r/GME/comments/mz3jte/thought_you_should_read/gvykym6/?utm_source=reddit&utm_medium=web2x&context=3) as to why short hedge funds could potentially want those high \"joke\" limit sell orders removed:\n\n&#x200B;\n\n>No,  that is not how things work; if  anything, it is messing up the HFT  algos with order stuffing and  tricking them into considering relatively  high sell orders meaning you  need supply well, guess what, the supply  has a very high price.As long as apes do not actually allow the orders to get filled, it will not affect the maximum potential of the MOASS. HFT algos use this technique to manipulate the price, and that is why  there  are fake order walls and millions of unfilled orders every day.\n\n&#x200B;\n\n**The truth may be that high sell orders have a positive effect, by forcing hedgies to deal with stupidly high asking prices - potentially causing the price in a MOASS scenario to LEAP and BOUND upwards to hit those very high limit sell orders in the case where hedgies are forced to cover and there is nobody selling below those \"crazy\" prices.**\n\nNow, **the shill posters want people to do the exact opposite of this, and have led potentially tens of thousands of users to remove their \"joke\" sell orders, ultimately helping the hedge funds.**\n\n&#x200B;\n\nu/Secure-Ad1612 also made a very insightful statement in the comment section below:\n\n&#x200B;\n\n>It’s  also important to remember that in the event of a total margin call,  the order book would likely be continuously wiped between halts. If/when  liquidity becomes low enough, these high limit sells will trigger,  immediately sending the share price up into the thousands, perhaps  earlier than whomever is attempting to cover would like.  \n>  \n>At  the end of the day everyone must recognize that the vast majority of  GME holders aren’t on this sub, and aren’t even on Reddit. To them, a  four digit share price would be mind blowing. The reality is many of  these retailers will sell in the high hundreds or low thousands if volatile trading begins.  \n>  \n>However, what happens is the order book begins to get wiped **before**  the majority of holders have the chance to even look at the share  price? Well, then that would mean that the stock would be sitting at  $500,000 from some random apes sell order. Now people see that number  and want that number. They will also be much more likely to hold and see  just how far things go.\n\n&#x200B;\n\n**TLDR**:  *Don't ever let anyone tell you 6,969,420.69 isn't a good start when deciding on your personal floor.*\n\n*This is not financial advice - I tried to smell my favorite color so bad there's a yellow crayon permanently lodged in my frontal lobe.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**Bonus:** This user in particular, is a very active shill.\n\n[https://www.reddit.com/user/Ok\\_Safety\\_7710/](https://www.reddit.com/user/Ok_Safety_7710/)\n\nThey are heavily pushing this new sell pressure narrative. They pop up again and again, crossposting disinformation to multiple subs.\n\n&#x200B;\n\n[https://www.reddit.com/r/WallstreetBreakers/comments/mz3x7y/remove\\_your\\_sell\\_limits/](https://www.reddit.com/r/WallstreetBreakers/comments/mz3x7y/remove_your_sell_limits/)\n\n[https://www.reddit.com/r/GMEplanB/comments/mz3wpp/remove\\_sells\\_limits/](https://www.reddit.com/r/GMEplanB/comments/mz3wpp/remove_sells_limits/)\n\n[https://www.reddit.com/r/GMEnew/comments/mz3waf/remove\\_sell\\_limits/](https://www.reddit.com/r/GMEnew/comments/mz3waf/remove_sell_limits/)\n\n[https://www.reddit.com/r/GME2\\_0/comments/mz44iw/get\\_rid\\_of\\_your\\_sell\\_limits\\_set\\_alerts/](https://www.reddit.com/r/GME2_0/comments/mz44iw/get_rid_of_your_sell_limits_set_alerts/)\n\n[https://www.reddit.com/r/GMEGME/comments/mz3vtk/remove\\_your\\_limit\\_sells/](https://www.reddit.com/r/GMEGME/comments/mz3vtk/remove_your_limit_sells/)\n\n[https://www.reddit.com/r/GME2\\_0/comments/mz3vfq/get\\_rid\\_of\\_your\\_limit\\_sells/](https://www.reddit.com/r/GME2_0/comments/mz3vfq/get_rid_of_your_limit_sells/)\n\n[https://www.reddit.com/r/Gamestopstock/comments/mz3uv4/please/](https://www.reddit.com/r/Gamestopstock/comments/mz3uv4/please/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n/r/GME has already [banned the original hedgie shill post](https://www.reddit.com/r/GME/comments/mz3jte/thought_you_should_read/).\n\nTagging the mods here to look into it \\~  [u/redchessqueen99](https://www.reddit.com/user/redchessqueen99/) , [u/Hieronymus1\\_1](https://www.reddit.com/user/Hieronymus1_1/) , [u/TomatoeHaven](https://www.reddit.com/user/TomatoeHaven/)\n\n&#x200B;",
    "title": "A shill disinformation post has been sitting at the top of this site all day - where are the mods?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/mzb5y5/a_shill_disinformation_post_has_been_sitting_at/"
}