{
    "author": "RocketApes",
    "created_utc": 1618322626.0,
    "distinguished": null,
    "edited": false,
    "id": "mq2wju",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mq2wju",
    "num_comments": 131,
    "permalink": "/r/Superstonk/comments/mq2wju/the_dark_tower_dark_pool_hft_through_the_nasdaq/",
    "score": 2454,
    "selftext": "Dear fellow apes,\n\nDid I just eat too many crayons or did I find something fishy? Please help me!\n\nOh and please forgive me, I am not native to english just native to crayons, data and tendies.\n\nSo this morning I tried to look for daily short volumes and stumbled upon [FINRA´s data page](https://www.finra.org/finra-data/short-sale-volume-daily). \n\nThinking \"yummy, data, data\" I downloaded all the data I could find about GME und was wondering why the heck there were three volumes for each day:\n\n&#x200B;\n\n1. NYSE Volume\n2. NASDAQ Chicago Volume\n3. NASDAQ Carteret (south of NYC) Volume\n\nAlright, so I plotted all of them in my old fucking Spreadsheet. Do you see what I saw?\n\n&#x200B;\n\nhttps://preview.redd.it/utpg6fid4ys61.png?width=952&format=png&auto=webp&s=398c8fd8d9dd620c03a35d167d25cd90d92c6eec\n\n&#x200B;\n\nOk, a whole lot of data, I know. Let´s zoom in to the last days:\n\n&#x200B;\n\nhttps://preview.redd.it/93gjjmlm4ys61.png?width=936&format=png&auto=webp&s=5453e26e4010d5c69ea77e634d15a81a1b13de80\n\nWTF?? **Looks like the price decline in the last days seems to correlate with more trades through the NASDAQ Data Center in Carteret, NJ**. (For you mathematicians out there, correlation coefficient is -0.6, so pretty hight).\n\nSo I google what is going on in Carteret and at first only find that they are pissed of by a possible transaction tax. Alright, why again? Further googling and my mind goes Boom!\n\n[This article nearly fucking my apely brain.](https://www.nasdaq.com/articles/time-is-relativity%3A-what-physics-has-to-say-about-market-infrastructure-2020-04-09)\n\nI try to do a summary but **please, smarter ape brains, you can do a lot better in trying to find out what this all means for GME, Dark Pools and HFT fuckery.**\n\nIt seems like the Data Center in Carteret is heavily involved in \n\n* High Frequency Trading\n* **Uses his short physical distance to the NYSE for a time advantage of some nano seconds to capture incoming orders to manipulate buyings and sellings**\n\nIn the last days, many much smarter apes than me found out about Dark Pools induced price manipulation. \n\n***Speculation:*** **It might have to do with this data center in Carteret. We need to find out more about it i think. Is Citadel involved?**\n\n[One slideshow of the Machine Intelligence Research Institute seems to explain how that could work.](https://intelligence.org/files/csrbai/wellman-slides.pdf)\n\n&#x200B;\n\nhttps://preview.redd.it/uvhmytl36ys61.png?width=951&format=png&auto=webp&s=a78ff60a7376290a7aa908ce0c1accb5b5a624e2\n\n&#x200B;\n\n**The second interesting fact that I recognized was an enlarged short percentage via the infamous NASDAQ Data Center in Chicago (Hello Kenny, is that you???)**\n\n**So yes, fuckery seems to go on. I personally hold onto the stock like my wifes boyfriend to her sweet body....**\n\n&#x200B;\n\nTL;DA: ***Something fishy going on in NASDAQ Carteret Data Center.*** [Read this fucking article](https://www.nasdaq.com/articles/time-is-relativity%3A-what-physics-has-to-say-about-market-infrastructure-2020-04-09)***.***",
    "title": "The dark tower: Dark pool HFT through the NASDAQ Data Center in Carteret?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mq2wju/the_dark_tower_dark_pool_hft_through_the_nasdaq/"
}