{
    "author": "Undead_Og",
    "created_utc": 1616681492.0,
    "distinguished": null,
    "edited": 1616715641.0,
    "id": "mcz58q",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mcz58q",
    "num_comments": 473,
    "permalink": "/r/GME/comments/mcz58q/lobbying_good_faith_journalists_to_expose_the/",
    "score": 7688,
    "selftext": "THANK YOU FOR THE AWARDS!  IT HELPS PROMOTE THE POST AND INSPIRE THIS APE!\n\nAny Journalism or Legal Writing Apes that feel compelled to lend a hand please DM me!\n\nHello Apes -\n\nI know that in the past, we've discussed briefly contacting media personalities to combat the narrative of the (bought) Main Stream Media.  I think this is an important angle we should explore.\n\nWhen I woke up, I read through the new DD and the posts from u/heyitspixel & u/rensole about the troll/shill campaign that seems to be threatening their lives.  At the very least, this is fucking with their heads, and I cannot stand by and let this happen without considering using the power we have in numbers to combat this fuckery.\n\nI propose this.  I've done some research on who might be best to contact regarding this whole situation.  They all have Twitter, and they all can be influenced publicly with a Twitter storm of messages.\n\nHere are some candidates that I believe are good targets (with some copy pasta profiles):\n\n**William D. Cohan**  The author of three bestselling books that exposed the inner workings of Wall Street’s highest-profile firms (“The Last Tycoons,” “House of Cards” and “Money and Power”),  a former investment banker who now frequently contributes to The New York Times and is a special correspondent for Vanity Fair.\n\n**Roderick Boyd** one of the 25 most feared financial reporters in America. His book about the near collapse of AIG, “Fatal Risk,” was long-listed for the 2011 Financial Times and McKinsey Business Book of the Year. A former staffer of Fortune, as well as the New York Post, The New York Sun and Institutional Investor News, Boyd founded and edited The Financial Investigator blog. In addition to having taught investigative reporting at the University of North Carolina at Chapel Hill, he regularly leads seminars at Investigative Reporters & Editors conferences on financial statement analysis and fraud detection. His work has prompted numerous regulatory, civil and criminal actions.\n\n**Nick Mathiason** is a founder and Co-Director of Finance Uncovered. He has been a business and financial journalist for close to 30 years and has broken a sizeable number of impactful stories that have had international prominence. He was one of the first UK journalists to report on industrial scale tax avoidance.  Subjects investigated include developing countries access to medicine, vulture funds, labour issues and the growth of private equity.  Formerly a business correspondent at The Observer, The Guardian, the Bureau of Investigative Journalism and the Big Issue magazine for the homeless, Nick has been shortlisted for major international journalism prizes on numerous occasions.\n\n**Ted Jeory** joined Finance Uncovered as Co-Director in January 2017. He is an award-winning journalist who changed career from accountancy in 2002, having worked for the likes of JP Morgan and Mobil Oil.  Since then he has worked as a general news, politics and social affairs reporter and editor in local and national newspapers. He also spent many years writing an acclaimed blog about the corrupted politics of Tower Hamlets in east London.  He is passionate about journalism being a force for good at grass-roots levels and while deputy editor of the Bureau of Investigative Journalism, he created the idea for its award-winning Bureau Local project.\n\n**Jeremy Scahill** an American investigative journalist, writer, a founding editor of the online news publication The Intercept and author of Blackwater: The Rise of the World's Most Powerful Mercenary Army, which won the George Polk Book Award.His book Dirty Wars: The World Is a Battlefield. Scahill is a Fellow at the Type Media Center.\n\n**John Perkins** an American author. His best-known book is Confessions of an Economic Hit Man (2004), in which Perkins claims to have played a role in an alleged process of economic colonization of Third World countries on behalf of what he portrays as a cabal of corporations, banks, and the United States government. The book's claims were met with skepticism and rebuttal but spent more than 70 weeks on the New York Times bestseller list, has been published in at least 32 languages and is used in many college and university programs.\n\n**Matt Taibbi** an American author, journalist, and podcaster. He has reported on finance, media, politics, and sports. He is a contributing editor for Rolling Stone, author of several books, co-host of Useful Idiots, and publisher of a newsletter on Substack.\n\n**Adam McKay** Director of the Big Short.  **Oliver Stone** Director of Wall Street. **Jeffrey McDonald Chandor** Director of Margin Call\n\n**Michael Monroe Lewis** is an American author and financial journalist. He has also been a contributing editor to *Vanity Fair* since 2009, writing mostly on business, finance, and economics. He is known for his non-fiction work, particularly his coverage of financial crises and behavioral finance. Author of the Big Short.\n\n**Amy Goodman** is an American broadcast journalist, syndicated columnist, investigative reporter, and author. Her investigative journalism career includes coverage of the East Timor independence movement and Chevron Corporation's role in Nigeria.\n\n**Michael Francis Moore** is an American documentary filmmaker, author, and activist. His works frequently address the topics of globalization and capitalism.\n\n**Charles Henry Ferguson** is the founder and president of Representational Pictures, Inc., and director and producer of No End in Sight: The American Occupation of Iraq (2007) and Inside Job  which won the Oscar for Best Documentary Feature. Ferguson is also a software entrepreneur, writer and authority in technology policy.\n\n**Kevin Adam Curtis** is an English documentary filmmaker. The release of Pandora's Box (1992) marked the introduction of Curtis's distinctive presentation that uses collage to explore aspects of sociology, psychology, philosophy and political history. His style has been described as involving, \"whiplash digressions, menacing atmospherics and arpeggiated scores, and the near-psychedelic compilation of archival footage\", narrated by Curtis himself with \"patrician economy and assertion\". Curtis's films have won four BAFTAs.\n\n**David J. Sirota** is an American journalist, columnist at The Guardian, and editor for Jacobin. He is also a political commentator and radio host based in Denver. He is a nationally syndicated newspaper columnist, political spokesperson, and blogger\n\n**Max Blumenthal** is an American journalist, author, blogger, and filmmaker. Blumenthal established The Grayzone in December 2015; he is the website's editor and one of its contributors.\n\n**Ryan Grim** is an American author and journalist. Grim was Washington, D.C. bureau chief for HuffPost and is the Washington, D.C. bureau chief for The Intercept. He is also a political commentator for The Young Turks, and appears frequently as a guest on The Majority Report with Sam Seder and Rising with Krystal & Saagar. His writings have appeared in several publications, including Rolling Stone, The Washington Post, and Politico. He is the author of This Is Your Country on Drugs and We've Got People. He cofounded Strong Arm Press, an independent progressive publishing house.\n\n**Dan Irvin Rather Jr.** is an American journalist and former national evening news anchor. Rather began his career in Texas, becoming a national name after his reporting saved thousands of lives during Hurricane Carla in September 1961. Rather spontaneously created the first radar weather report by overlaying a transparent map over a radar image of Hurricane Carla. In his first national broadcast, he helped initiate the successful evacuation of 350,000 people.\n\n**Ezra Klein** is an American journalist, political analyst, New York Times columnist, and the host of The Ezra Klein Show podcast. He is a co-founder of Vox and formerly served as the website's editor-at-large. He has held editorial positions at The Washington Post and The American Prospect, and was a regular contributor to Bloomberg News and MSNBC. His first book, Why We're Polarized, was published by Simon & Schuster in January 2020.\n\n**Glenn Edward Greenwald** is an American journalist, author, and former attorney.  After graduating from law school in 1994, Greenwald worked as a corporate lawyer, before founding his own civil rights and constitutional law firm in 1996. In the course of nearly a decade of litigation, Greenwald represented a number of controversial clients in First Amendment cases. Broke the case of Edward Snowden.\n\n**Kyle Edward Kulinski** is an American political commentator. Kulinski is the host and producer of The Kyle Kulinski Show on his YouTube channel Secular Talk, an affiliate of The Young Turks network.  A self-described left-wing populist and social democrat, Kulinski is a co-founder of the Justice Democrats, a progressive political action committee whose candidates refuse donations from corporate PACs.\n\n**Matt Stoller** is a fellow at the Open Markets Institute. He is writing a book on monopoly power in the 20th century for Simon and Schuster. Previously, he was a Senior Policy Advisor and Budget Analyst to the Senate Budget Committee. He also worked in the U.S. House of Representatives on financial services policy, including Dodd-Frank, the Federal Reserve, and the foreclosure crisis. He has written for the New York Times, the Washington Post, The New Republic, Vice, and Salon.\n\n**Dylan Ratigan** an American businessman, author, film producer, former host of MSNBC's The Dylan Ratigan Show and political commentator for The Young Turks. They include CNBC's Fast Money and Closing Bell, as well as DylanRatigan.com, which hosts his podcast, Greedy Bastards Antidote. From 2009 to 2012, Ratigan hosted The Dylan Ratigan Show, the highest-rated non-prime time show on MSNBC, aimed at critiquing what Ratigan described as an unholy alliance between big business and government. His first book, Greedy Bastards, was released in 2012, and spent five consecutive weeks on The New York Times Best Sellers List.\n\n**Tim Poole** is an American citizen journalist, YouTuber, and political commentator. He first became known for live streaming the Occupy Wall Street protests in 2011. Pool joined Vice Media and Fusion TV in 2013 and 2014, later moving to independent work on YouTube and other platforms.\n\n**Robert Evans** is an American journalist who has reported on global conflicts and online extremism. A former editor at the humor website Cracked.com, Evans now writes for the investigative journalism outlet Bellingcat while working on several podcasts, including *Behind the Bastards*, *Behind the Police*, *Behind the Insurrections*, *It Could Happen Here*, *The Women's War*, and *Worst Year Ever*.\n\n**Carole Jane Cadwalladr** a British author, investigative journalist and features writer. She is a features writer for The Observer and formerly worked at The Daily Telegraph Cadwalladr rose to international prominence in 2018 when she exposed the Facebook–Cambridge Analytica data scandal.  Cadwalladr was a finalist for the 2019 Pulitzer Prize for National Reporting, alongside The New York Times reporters, for her coverage of the Cambridge Analytica scandal.\n\n**Amity Ruth Shlaes** a conservative American author and newspaper and magazine columnist. Shlaes writes about politics and economics from a classical liberal perspective. Shlaes has authored five books, including three New York Times Bestsellers. She currently chairs the board of trustees of the Calvin Coolidge Presidential Foundation and serves as a Presidential Scholar at The King's College in New York City. She is a recipient of the Bastiat Prize.\n\n**Robert James Bidinotto** is a novelist, journalist, editor, and lecturer. He is perhaps best known for his critiques of leniency within the criminal justice system, and for criticisms of the environmentalist movement and philosophy. Bidinotto is influenced by the philosophy and writings of Ayn Rand, and from July 2005 until October 2008 he was editor-in-chief of The New Individualist, the monthly magazine published by The Atlas Society. \n\n**Jon Stewart** FUCKING BIG BOY SLAPPED Jim Cramer once on the Daily Show. Also owned Congress on 9/11 insurance fuckery.\n\n**\\*** I realize there are probably many many more.   I suspect that if we can create a big enough list of potential journalists to tweet at with a significant amount of our DD and evidence that we can attract at least ONE suitor.  I'd be happy to add to the list since I think the more the merrier.  Please feel free to suggest an edit.\n\n**\\*\\* I'm not biased here politically... I don't care what media venue or personality we include in this storm.  The more eyes the better...**\n\n# What is my goal?\n\nExposure.  WHY?  Well, WIN LOSE OR DRAW in our mission to the moon, these fuckers need to have this shit outed.  People need to be engaged and NOT just us apes.  The plebs who are losing money with the hedgfunds through their pensions, the people who can't afford a fractional share of GME.\n\n# How do we proceed?\n\nWe compile all the best evidence from the wrinkle brain repository.  Dark Pool Trading, FTDs, SEC do-nothings, Congressional Shillery, Hedgefund Fuckery, Troll Army Attacks, & Paid Social Media Shillery.\n\nSomeone with a better skill of prose should craft a short plea and EVERYONE here with a Twitter account send a tweet to all targets including all the independent journalist we know on YouTube & Twitter.  WE PUT PRESSURE ON THE THEM TO SPEAK.  Nearly all of these outlets are viewer-funded.  The MeMe stock saga is MUST WATCH content.  For them this will be an opportunity of a lifetime.\n\n**Media Outlets to Target:**  Joe Rogan, Jimmy Dore, The Young Turks, John Stossel, John Oliver, The Intercept, The Daily Poster, SubStack, The Daily Show, The Hill (Rising), 60 minutes, 20/20, Project Veritas, StockSleuth, ICJU, BuzzFeed News\n\nEDIT 1:  Added two more potential targets.\n\nEDIT 2:  As far as media outlets, I think the obligatory Joe Rogan, Jimmy Dore, John Oliver, are important.  They may not pick it up, but they have a ton of Twitter followers.\n\nEDIT 3: Added more targets, including lawyers for cases against Citadel.  Adding a media outlet section we can spam for pressure.\n\nEDIT INFINITY:  Jesus H... I'll be doing this all day. LOL.\n\nCurrent Mood:\n\n&#x200B;\n\nhttps://preview.redd.it/8n883i6db7p61.png?width=302&format=png&auto=webp&s=e519b8e27238ca709de25900005ed0221a72ca97\n\n# WHO IS WITH ME?!",
    "title": "Lobbying Good Faith Journalists to Expose the Manipulation",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/mcz58q/lobbying_good_faith_journalists_to_expose_the/"
}