{
    "author": "Leenixus",
    "created_utc": 1616663364.0,
    "distinguished": null,
    "edited": false,
    "id": "mctytm",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion",
    "name": "t3_mctytm",
    "num_comments": 139,
    "permalink": "/r/GME/comments/mctytm/russel_2000_just_paid_dividends_i_think_we_might/",
    "score": 3473,
    "selftext": "Uuum, i just saw... The Russel 2000, the ETF that tracks GME and the other popular stocks and all these micro caps paid dividends today...\n\nShit. How did we miss this?\n\nhttps://preview.redd.it/p86ojxie45p61.png?width=2115&format=png&auto=webp&s=2f31ec026bec5fa32340b89ccf61f17aa368afbe\n\n# What does the Russel 2000 have to do with GME?\n\nIn case you don't understand the significance of this, let me explain with the limited knowledge i have...\n\n* Just like XRT, GAMR and all those ETFs, there's IWM (Russel 2000) that is decently heavy on GME shares and it a much bigger ETF (with expensive shares at $212 - $224) than the others.\n* XRT paid dividends this Monday. That means that the XRT shares were recounted in order to record real shares for dividend payment. This also implies that the rebalance happened Friday-Weekend. So what was the effect of this from XRT on GME? We got XRT's GME shares dumped on us by the people who redeemed their ETF shares and due to the rebalance of the ETF.\n\nSoooooooo if XRT got recounted last week, rebalanced during Friday/Weekend and paid a dividend on Monday with a result of GME price dropping... then IWM (Russel 2000) having just paid a dividend today confirms that this week's price drops were IWM rebalancing, paying dividend and us getting a bunch of new GME shares dumped on us?\n\n&#x200B;\n\n# So... yeah...\n\nI think IWM just rebalanced and this was what we've been seeing over the past few days.\n\nSo does this mean there's only bright days ahead and this is why DFV is posting on twitter more often and posting his position more often now? Is this why suddenly some anal-ysts and others are suddenly changing their tune all of a sudden having realized that IWM rebalancing is a BIG thing????\n\nI don't know HOW this is a good thing exactly. I only assume it is because DFV is posting more often e.g hype e.g expectations of something occurring... Don't forget that the Gamestop Earnings were going to be on the 13'th March and they were moved to the 23'rd... could this IWM rebalancing be a reason behind this?\n\nDoes this also mean that we have a few more days of 'dumping' ahead of us?\n\n&#x200B;\n\n**Is there a strategy behind all this that we're all missing?**\n\n**Can someone who has more knowledge on all these piece all this together?**",
    "title": "Russel 2000 just paid dividends... i think we might be mildly stupid for missing this...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mctytm/russel_2000_just_paid_dividends_i_think_we_might/"
}