{
    "author": "mybustersword",
    "created_utc": 1622599135.0,
    "distinguished": null,
    "edited": false,
    "id": "nqalpq",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nqalpq",
    "num_comments": 184,
    "permalink": "/r/Superstonk/comments/nqalpq/ragnarok_part_2_the_man_behind_the_curtain_aka/",
    "score": 2564,
    "selftext": "Hello friends, romans, and apes. I am here to shine the light on the man (company) behinds the scenes, the Wizard behind the curtain.  Citadel, Melvin, Suisse, Deutsche bank, Highfields, Archegos; none are more than mini-bosses. When they fall, the final battle is not yet over. For there is one more that remains hidden in the shadows, and prefers to stay that way, for their roots run deep.\n\n# The Carlyle Group\n\nLets start with the most obvious connections. Here is an explanation from ( a website I am not allowed to share on reddit but, go on duckduckgo and search \"carlyle fed vice chair\", first link.) \n\n\"Private equity funds have been variously called “merchants of debt,” “vultures,” or “corporate raiders.” What a private equity fund typically does is to buy up companies by piling debt on the balance sheet, selling off valuable assets like real estate, extracting giant dividends for the private equity partners to the detriment of workers and customers, and then, frequently, letting the company collapse into bankruptcy while laying off thousands of workers or liquidating the whole company...It should give pause to every American that the two top men at the Federal Reserve who are implementing a new $4.54 *trillion* bailout fund for Wall Street, using $454 billion from taxpayers to absorb the losses, both got rich working for one of the world’s largest such private equity firms: the Carlyle Group.\"\n\nI am talking about Jerome Powell and Fed Vice Chairman for Supervision Randal Quarles Randal Quarles. However it is duly noted that the current, and several other leaders at Carlyle are engaging in this behavior.\n\n# What behavior? What do they DO?\n\n\"Carlyle had handled its investment in a chain of nursing homes known as HCR ManorCare, which filed for bankruptcy in March of 2018. The authors wrote that there was a 29 percent rise in serious health code violations at HCR ManorCare in the years before the bankruptcy and following a 2011 financial deal that “extracted $1.3 billion from the company” for Carlyle investors while saddling the nursing home chain with debt. \"\n\nSounds bad, sure. I implore you to google HCR manor care and carlyle and read the horrific situation that unfolded. Its not just about bankrupting companies and losing jobs. \n\nHeres a story of marketing firm for grocery,  Acosta being acquired by carlyle, then hammered by terrible debt acquisitions until it was forced into Bankrupcy. [https://www.forbes.com/sites/nathanvardi/2020/03/04/carlyle-groups-14-billion-folly-inside-the-biggest-buyout-loss-in-washington-dc-firms-33-year-history/?sh=6eaaea9125b4](https://www.forbes.com/sites/nathanvardi/2020/03/04/carlyle-groups-14-billion-folly-inside-the-biggest-buyout-loss-in-washington-dc-firms-33-year-history/?sh=6eaaea9125b4). All while Warren Buffet and his 'favorite' investment firm 3g capital hammered its biggest clients Heinz and Kraft. An attack on all sides, internal and external.\n\nAccording to his official bio, **Fed Chairman Jerome Powell** was a partner at the Carlyle Group from 1997 to 2005. and, **Carlyle group at one point bought our favorite movie chain with Bain capital** [https://www.carlyle.com/media-room/news-release-archive/loews-cineplex-entertainment-announces-close-acquisition-bain](https://www.carlyle.com/media-room/news-release-archive/loews-cineplex-entertainment-announces-close-acquisition-bain), ,,,,,[https://www.sec.gov/Archives/edgar/data/1303276/000110465905029034/a05-11153\\_1ex99d1.htm](https://www.sec.gov/Archives/edgar/data/1303276/000110465905029034/a05-11153_1ex99d1.htm)\n\n&#x200B;\n\nSo, does Carlyle have any connection to GME now? Directly- no. however, as in my previous DD Ragnarok, we look to the competition...\n\n**Carlyle acquires Jagex, developer of Runescape.** [https://www.gamesindustry.biz/articles/2021-02-04-it-was-never-about-spending-power-what-carlyle-acquisition-really-means-for-jagex](https://www.gamesindustry.biz/articles/2021-02-04-it-was-never-about-spending-power-what-carlyle-acquisition-really-means-for-jagex)\n\n\"I don't think this is a short-term thing. There has been a re-examination of different industries and where to invest, and the pandemic has shown not just a surge in player time, but has also made people fundamentally reevaluate where they want to invest and what the more mature and resilient industries are. Games are relevant, respected, and looked at in a more mature way than we've ever had, and I think that's a permanent change. It's a level of recognition we've burst through and it's a really good thing for the long-term of the whole industry..... But more importantly the studio is exploring ways to reach new and lapsed audiences. Mobile is one, as mentioned, but the game also made its debut on Steam last year, with Old School due to debut later this month. And Mansell teases that the long-running MMO is heading to more marketplaces, new countries and territories -- and hints at console ports.\"\n\nWhat would a direct competition be against gamestop, a brick and mortar retail business? *Mobile gaming of course.* Earlier this year, Carlyle acquired several companies. Ones of them is disguise. [https://www.marketscreener.com/quote/stock/THE-CARLYLE-GROUP-INC-10531255/news/Carlyle-nbsp-acquires-disguise-32629204/](https://www.marketscreener.com/quote/stock/THE-CARLYLE-GROUP-INC-10531255/news/Carlyle-nbsp-acquires-disguise-32629204/),,,,,, [https://www.disguise.one/en/xr/](https://www.disguise.one/en/xr/). Note, they went in on this deal with EPIC games [https://www.installation-international.com/technology/immersive-tech/epic-games-and-carlyle-group-invest-in-disguise](https://www.installation-international.com/technology/immersive-tech/epic-games-and-carlyle-group-invest-in-disguise). Recently, they broadcast their first esports competition. [https://www.avinteractive.com/news/video/disguise-gx-range-xr-workflows-turn-omen-challenge-esports-tournament-immersive-experience-04-02-2020/](https://www.avinteractive.com/news/video/disguise-gx-range-xr-workflows-turn-omen-challenge-esports-tournament-immersive-experience-04-02-2020/)\n\n\"disguise is a leading technology platform which enables creative and technical professionals to imagine, create and deliver spectacular live visual experiences. disguise specializes in combining real-time 3D visualisation-based software with high performance hardware. The company is one of the main providers of xR and virtual production technology to major entertainment providers, film & TV studios, broadcasters, corporates, and fixed installation companies globally.\n\nDisguise's technology has been instrumental in spearheading immersive content delivery for key projects like the 2020 MTV Video Music Awards and Eurosport's US Open coverage, live performances from artists like Billie Eilish and Katy Perry, in-game concerts like J.Balvin in Fortnite, corporate presentations from Siemens and SAP, and on-set virtual production from notable VFX studios like Framestore and Orca Studios. Since June 2020, over 150 disguise xR stages have been built in more than 35 countries and disguise xR has powered over 200 shows.\"\n\n**This is a company that can recreate the way we film, game, and consume media. They want to redefine mobile gaming, concerts, sports, news, television and movies. Hmm... which two companies have been elevated to \"meme stock\" status over the past year? What do they primarily do? gaming and movies.**\n\n&#x200B;\n\nConnections between Citadel and Carlyle\n\nWell gollytheres some juicy ones here. Not too many, uh business-y ones but some great interpersonal ones. Seems like Ken Griffin here is buddy-buddy with Carlyle former CEO David Rubenstein. Ken has donated his art collection to his exhibits and had been featured on Rubenstein's Youtube channel several times. ugh god the bromance. [https://www.citadel.com/news/ken-griffin-david-rubenstein-peer-peer-conversation/](https://www.citadel.com/news/ken-griffin-david-rubenstein-peer-peer-conversation/),,,,,[https://news.uchicago.edu/story/university-trustee-kenneth-griffin-loan-renowned-art-collection-exhibit-david-rubenstein](https://news.uchicago.edu/story/university-trustee-kenneth-griffin-loan-renowned-art-collection-exhibit-david-rubenstein)\n\nDavid Rubenstein stepped down from Carlyle and started a family office (archegos vibes anyone?) called Declaration Capital. Its difficult to find out what their investments are, but we know of a few. Convene - a rival to WeWork dealing with flexible office space. [https://convene.com/catalyst/convene-secures-152m-series-d-funding-round/](https://convene.com/catalyst/convene-secures-152m-series-d-funding-round/).  What caught my eye is their location- they offer this flexible office space at 131 South Dearborn st in chicago. You know, Citadel Towers. Home of our good friend Citadel. [https://convene.com/cities/chicago/131-south-dearborn-street](https://convene.com/cities/chicago/131-south-dearborn-street). \n\nDeclaration Also scored investments of esports company **Axiomatic** [https://www.axiomaticgaming.com/esports-ownership-group-axiomatic-secures-investments-from-michael-jordan-and-declaration-capital/](https://www.axiomaticgaming.com/esports-ownership-group-axiomatic-secures-investments-from-michael-jordan-and-declaration-capital/). Along with Michael Jordan, which is cool, i guess. Apparently he has a family investment office too (dear god).\n\n# Any other mobile gaming connections? Why yes\n\n[https://www.carlyle.com/our-business/portfolio-of-investments/riot-entertainment-oy](https://www.carlyle.com/our-business/portfolio-of-investments/riot-entertainment-oy)\n\n[https://impact.dealroom.co/companies/mig\\_china](https://impact.dealroom.co/companies/mig_china) \n\n[https://techcrunch.com/2021/05/04/riot-games-and-konvoy-ventures-back-games-publisher-carry1st-in-6m-series-a/](https://techcrunch.com/2021/05/04/riot-games-and-konvoy-ventures-back-games-publisher-carry1st-in-6m-series-a/)\n\n&#x200B;\n\nWhat really got my tits jacked is DFV's twitter post a few weeks back, showing character John Locke on the television show Lost before he blows up the Hatch with dynamite from the **Black Rock.** What's really neat is (spoiler alert) in trying to find the hatch, his friend **Boone Carlyle is killed.** [https://twitter.com/TheRoaringKitty/status/1382405013989961736](https://twitter.com/TheRoaringKitty/status/1382405013989961736)\n\n&#x200B;\n\nCONCLUSION\n\nIt appears that one very secretive fund called Carlyle Investments has big plans for both GME and our movie chums- as the leading potential competition to their investments in developing new technology and consumer-focused entertainment with AR, xR, mobile gaming, and e-sports. Rather than allowing GME and our chums a chance to adjust and adapt to the newly developing tech, Carlyle and co decide to collapse the competition and provide a clear path to their success.\n\n&#x200B;\n\n# What makes a king out of a slave? The courage to HODL",
    "title": "Ragnarok part 2- the Man Behind the Curtain... Aka why we are here",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nqalpq/ragnarok_part_2_the_man_behind_the_curtain_aka/"
}