{
    "author": "Magistricide",
    "created_utc": 1622575053.0,
    "distinguished": null,
    "edited": 1622649345.0,
    "id": "nq22pe",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nq22pe",
    "num_comments": 184,
    "permalink": "/r/Superstonk/comments/nq22pe/unfunded_liable_and_completly_screwed_part_1_why/",
    "score": 2197,
    "selftext": "A lot of people have been saying \"What if the government shuts down the squeeze? What if they're afraid of economic turmoil?\" I brought up trade agreement violations and loss of trust, but those aren't very convincing. So I'd like to bring up why I know the government won't stop the squeeze. **A huge short squeeze would be MUCH better than the alternative economic turmoil they will experience.** And no, I'm not going to talk about \"loss of faith\" or \"trade agreement violations.\" This DD is about unfunded liabilities, and how the squeeze will be the ONLY option left to pay them back, avoiding hyperinflation and bankruptcy. (TLDR at bottom)\n\nThis DD talks about unfunded liabilities. What does [that mean](https://ballotpedia.org/Unfunded_liabilities)?\n\nUnfunded liabilities refers to liabilities, or promises, that are not backed up by assets.\n\nThis can be something like a promised pension to a worker, but the company has no money to back that promise up.\n\nSo why am I talking about unfunded liabilities? Well. . . the US has a lot of those. About [87](https://www.mercatus.org/system/files/debt-in-perspective-analysis.pdf)\\~[210](https://www.forbes.com/sites/kotlikoff/2015/05/13/17-nobel-laureates-and-1200-economists-agree-with-ben-carson-re-u-s-fiscal-gap/?utm_campaign=JM-305&utm_content=v37pvp&utm_medium=ED&utm_source=for&sh=787f78704d17) trillion, [in fact](https://www.forbes.com/sites/johnmauldin/2017/10/10/your-pension-is-a-lie-theres-210-trillion-of-liabilities-our-government-cant-fulfill/?sh=4b8ee09165b1). This mostly comes from social security, medicare, military spending, and excess spending causing debt year after year.\n\n# Where does all this debt come from?\n\nThis mostly comes from Social Security and Medicare, but also excess spending and military. As we all know, the US's medical system is corrupt and only favours those with an extreme amount of money. When the government foots the bill, that's not a light one. However, it's not JUST \"Big pharma\" taking the government's money. The government has been fucking up too.\n\n[But fuck Big Pharma too, this is the shit they do.](https://preview.redd.it/ouyswx063p271.jpg?width=591&format=pjpg&auto=webp&s=c9092dcebfa08f7e889199cfe1626ec8bb9c5eec)\n\nSource [here](https://www.snopes.com/fact-check/alex-smith-died-couldnt-afford-insulin/).\n\nThis increase in cost is because the prices are dictated by the markets, not the government ([in case anyone didn't know](https://www.investopedia.com/articles/personal-finance/080615/6-reasons-healthcare-so-expensive-us.asp)). These businesses know you'll be forced to fork whatever they ask for because you can't live without it, especially for drugs like insulin. Because of that, they can just charge you whatever they want.\n\nBut if the problem with medical expenses is the lack of government interest, Social security has too much government interested in it.\n\n# The fuck up that is Social Security\n\nLet me preface this by saying that for 57% of people, social security accounts for a majority of their income. [Even the shills at CNBC agree](https://www.cnbc.com/2020/12/01/why-social-security-may-run-out-of-cash-really-soon.html). Yet, in this same article, you'll see that social security is. . . running out? How is this possible? They blame it on ageing demographics. But that's not the full picture. [People benefiting usually take out more than they put in](https://www.cbpp.org/research/social-security/understanding-the-social-security-trust-funds-0), even accounting for inflation. Take a look between 1982's demographics and 2019 demographics.\n\n[1982 Population pyramid for the US](https://preview.redd.it/u91yn2zczo271.jpg?width=635&format=pjpg&auto=webp&s=80c8750648aa502b4aed78dfcd834f1819f9ac20)\n\nSo it seems like there are many more younger people working and paying for social security, and only a few people taking that money out. In this system, social security works.\n\n[2019 Population Pyramid for US](https://preview.redd.it/nlf4deng0p271.jpg?width=661&format=pjpg&auto=webp&s=3f032b76e68709ef82405e8920e93ac9a14fa005)\n\nWell, it seems there are far more people taking social security payments compared to the people paying in. Considering that people tend to take more than they put in, it's no wonder why it's failing.\n\nBut what about investments? Doesn't the government invest their money?\n\nFrom the [government themselves](https://www.cbpp.org/research/social-security/understanding-the-social-security-trust-funds-0), they state that the program is a \"pay as you go\", meaning younger people foot the bill for older people. Then, any surplus is all invested into government bonds. The government \"borrows\" money from social security to fund other projects, and then they pay interest. This seems like a good idea, right? At least our third favourite shills at [CNBC](https://www.cnn.com/2018/05/21/opinions/social-security-myths-opinion-richtman/index.html) thinks so.\n\nHowever, keep in mind that they went all-in on **government bonds**. The same dog shit government bonds being shorted to oblivion. That, even on a good day, gives you shit returns. Great investment. This isn't even retarded by WSB standards, this is pure stupidy. At least YOLOing calls that expire the next day has SOME chance of making a profit. Investing 100% in bonds that give barely any returns guarantees failure of the system. Why do they do this? Well, it's because it's another source for the government to borrow money.\n\n**The government LOVES borrowing money.** Why would they pass up a chance to borrow some more? They're incentivized to borrow money because if you build a ton of infrastructure and give people money, they will like you, and want to vote for you. **Who cares about the economic situation in 20 years, if you just want to win the election and remain for eight?**\n\n# Why do the numbers differ so much?\n\nThe numbers differ so much because of the way unfunded liabilities are calculated. Congress likes to use the 25-year model and can change what gets calculated depending on their wording. However, some economic professors like to use the \"infinite horizon\", where they calculate the unfunded liabilities if the current system was stretched out to infinity (In reality, it's mostly just within the next 75 years, as anything beyond that is not significant enough to change the numbers).\n\n&#x200B;\n\n[Laurence Kotlikoff, the man behind the numbers](https://preview.redd.it/as8j5kn14p271.jpg?width=217&format=pjpg&auto=webp&s=6ba6a07317efb6a62088a2bca9b6f7568fbb4dd2)\n\nI'll spare you the complex math these Nobel Laureates used to calculate infinite horizon, but basically, the further out in years you go, the less the costs and income matters. So a debt worth 10 trillion in the future may only be worth 1 trillion in the calculation.\n\n# This is public and accepted knowledge.\n\nTaking a look at my previous link [here](https://www.forbes.com/sites/kotlikoff/2015/05/13/17-nobel-laureates-and-1200-economists-agree-with-ben-carson-re-u-s-fiscal-gap/?utm_campaign=JM-305&utm_content=v37pvp&utm_medium=ED&utm_source=for&sh=787f78704d17). You can see **17 Nobel prize-winning economists supported the 210 trillion figure six years ago.** **This is NOT a debated topic.** Politicians simply avoid mentioning this because this is a ticking time bomb. While there is some debate over the exact amount, as seen [here](https://www.washingtonpost.com/news/fact-checker/wp/2015/05/13/ben-carsons-claim-that-the-u-s-owes-211-trillion-beyond-the-reported-federal-debt/), no one disagrees that unfunded liabilities are real, and they will continue to grow to a staggering amount.\n\n# Why is no one talking about this?\n\nAsides from this being so boring the sheer mention of \"unfunded liabilities\" would work better than a tranquillizer dart on some people, both Republicans AND Democrats have \"borrowed\" money. Why would they want to shut down something that helps them stay elected?\n\nI'm honestly struggling to find a good source to find out who borrowed what amount from social security. It's impossible to track what the money was used for. But take a look at the US Debt growing year after year.\n\n&#x200B;\n\n[Bill Clinton may have had sexual relations with a women, but at least he didn't add to debt](https://preview.redd.it/so4w3vcl7p271.jpg?width=799&format=pjpg&auto=webp&s=f20f5c76b6d424a92ad71ac2adac56ca6b7122fc)\n\nRegardless of where you borrowed from, it's a fact that they love borrowing.\n\nIf you search it up, you just get blasted with \"No, the government isn't stealing from you.\" No one gives a shit if the government says they're \"borrowing\", if they don't plan on paying it back, it doesn't matter. The problem is that with the unfunded liabilities, they may not pay it back. They're putting up a strawman argument and tearing that apart. **Kinda similar to the GME situation, don't you think?**\n\n[CNBC with pretty much everything](https://preview.redd.it/owlrcs9h4p271.jpg?width=596&format=pjpg&auto=webp&s=d31e892638f5ecd5b5854b660fb49f2d9ee6d69b)\n\nSo the government has incentives to keep borrowing, both parties have borrowed tons of money, and they want to be able to continue borrowing, so no one talks about it.\n\n# Why the fuck do they owe so much?\n\nSure, the program isn't perfect, but 210 trillion? That's obscene. How the fuck did they dig such a big hole?\n\nIt's due to a compound of factors. Investing in government bonds give shit returns, especially with the government keeping interest rates low and having inflation rates higher.\n\nPrivatization of health care have lead to rampant cost increases, about [twice as much](https://www.healthsystemtracker.org/brief/what-drives-health-spending-in-the-u-s-compared-to-other-countries/) as comparable countries.\n\nPeople take more than they put in, especially with longer life expectancy.\n\nThe 1% are barely taxed for social security, the maximum you can be taxed for social security is $8,537.40, [regardless of what you own](https://www.adp.com/spark/articles/2020/08/social-security-wage-base-for-2020-announced.aspx) (wow, more tax benefits for the 1%).\n\nTo be honest, this doesn't even convince me. I have some speculation on what's happening, but since I can't prove it with sources, I won't elaborate.\n\n# How does the squeeze help against unfunded liabilities?\n\nIncome tax. You'll pay a lot of it once you're a millionaire. Especially since retail doesn't avoid taxes like wallstreet. The more you take from these hedge funds and banks, the move the gov gets. More details in Part II.\n\n# To recap everything seen here.\n\nThe US promised Social Security and Medicare to a bunch of people that they won't be able to pay up. This is called \"unfunded liabilities\".\n\nThis is anywhere from 87 to 210 trillion, but 210 trillion is the most accurate considering the actual amount of money the government has to pay.\n\nA short squeeze may cause some economic turmoil, but letting things stay where they are will cause far more damage due to these economic liabilities.\n\nIn part II, I will go much more in-depth on what happens if the states DO NOT do anything. Their options consist of slashing medicare and social security for old people, going bankrupt, or letting the squeeze happen.\n\n# TLDR OF TLDR\n\nUS will have tons of hidden debt soon, enough to bankrupt them. Squeeze gives them big money from capital gains tax. Tax helps to pay off debt to avoid bankruptcy.\n\nSqueeze better than bankruptcy. Government picks squeeze.\n\n**Author's note:**\n\nI'm not actually sure this DD fits this sub, as it's more general in nature, but I believe as House of Cards was more general and allowed, this DD should be fine. Also, I don't know when I'll post part II tbh. I'm just a uni student and life is getting in the way.\n\nAll sources are hyperlinked in the document. If you have any corrections or anything you feel should be added, comment below and I'll take a look. Remember, Part II is in the works.\n\nProbably shouldn't base financial decisions on a Canadian uni student, but hey, nothing here is advice.\n\nEdit 1: Explain why squeeze helps gov.\n\nEdit 2: Looks like this post kinda died in the depths of \"new\" because I got a bunch of downvotes initially (shills?), but from the upvote ratio and awards, it seems like the people who DID read it, enjoyed it. I'll upload it again later if I need to.\n\nEdit 3: I'm pretty sure this post got yeeted by \"bad actors\" seeing as it started out with a 33% upvote ratio, and now it's at 97%. However, since it passed the 1k mark, I won't be reuploading it. Seeing the awards and the attention, I plan on uploading a brief part II along with editing part I to make it more clear for those of us with fewer wrinkles.",
    "title": "Unfunded, Liable and Completly Screwed Part 1: Why the US is under much more debt than you think",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nq22pe/unfunded_liable_and_completly_screwed_part_1_why/"
}