{
    "author": "Bob_the_peasant",
    "created_utc": 1623543291.0,
    "distinguished": null,
    "edited": 1623545908.0,
    "id": "nykfgb",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nykfgb",
    "num_comments": 123,
    "permalink": "/r/Superstonk/comments/nykfgb/unpopular_opinion_all_these_works_at_citadel_and/",
    "score": 702,
    "selftext": "Why are these posts being upvoted like they are some kind of 'gotcha'?  The DTCC is literally just the country club for large banks, hedge funds, financial institutions.  They are, by definition, themselves.  This sub looks stupid as hell parading it around like it is a conflict of interests.\n\nIf you want to throw out conflict of interests posts, please look at people that work at the SEC, FINRA, the Fed that used to work at Citadel, Bank of America, Blackrock, etc.  (Or vis-versa, used to work at the SEC and now work there, it's a revolving door of bullshit).\n\nBut seriously can we stop with the DTCC / Citadel thing?  It's like saying you own your bedroom *and the house*, as if that's illegal or somehow not normal.\n\n&#x200B;\n\nEdit:  I think it's still not clear what I'm trying to say based on some of the responses. I will try to give more examples...\n\nThis is like AMD and Intel being part of the IEEE (It's not exactly like that but just bear with me).  They develop the standards (and to their advantage) for a new USB port.  But the IEEE is not the government, and could simply decide to stop existing or become a football club if they felt like it.\n\nThis is like a World of Warcraft guild.  The guild can make all sorts of stupid rules that its members follow, they can disband it, invite new people to it, kick people out of it.  They decide who gets loot if they want.  But when you file a ticket or a bug report it goes to Blizzard, not the officers of a guild.  That's the SEC or the FED.\n\n\\-End of Edit-",
    "title": "Unpopular opinion: All these \"Works at Citadel AND the DTCC\" posts make us look like idiots.",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/Superstonk/comments/nykfgb/unpopular_opinion_all_these_works_at_citadel_and/"
}