{
    "author": "RocketTraveler",
    "created_utc": 1625696345.0,
    "distinguished": null,
    "edited": 1625716536.0,
    "id": "oftiz8",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oftiz8",
    "num_comments": 1075,
    "permalink": "/r/Superstonk/comments/oftiz8/gme_ta_why_im_jacked_about_todays_drop/",
    "score": 12591,
    "selftext": "Happy Wednesday Everyone!\n\nI don't know about you, but today's drop to $177 and subsequent rebound has me **jacked more than ever!**  Why, you may ask?  Read on...\n\n# Preface\n\nSome of you may have seen my post last week referencing Rocky Outcrop's custom Directional Movement Index (DMI) indicator and how it was showing we are due for a **HUGE** uptick in volatility after these past four weeks of sideways trading.  If you haven't seen it yet, check it out here for more background:\n\n[https://www.reddit.com/r/Superstonk/comments/obteg7/gme\\_the\\_powder\\_keg\\_ready\\_to\\_explode/](https://www.reddit.com/r/Superstonk/comments/obteg7/gme_the_powder_keg_ready_to_explode/)\n\nGuess what?  The DMI indicator switched off today which means we are officially ramping up in volatility for the near future.  ***This has lined up perfectly with numerous other TA indicators that show we may have officially hit our bottom at $177 and are turning around on higher volume***\n\nIf you don't like TA or think it is invalid, I respect that.  Despite GME's heavy manipulation it has worked well for me and others to show the most likely outcome as to where prices may be heading.\n\nMy previous TA conducted on June 28 was based on what I saw at the time.  The indicators were there, but none were screaming out at me.  This time **EVERYTHING** is screaming at me.  Now is the time.\n\nWe all want the same thing.  BRRRRRRRR\n\n***As usual, I am not a financial advisor and this is not financial advice!***\n\nI'll try to keep this short.  Here we go!\n\n# TLDR;\n\n* DMI indicator is showing we are now entering a period of high volatility.  This means larger price swings up and down for the next few weeks.  ***Say goodbye to trading sideways!***\n* RSI is showing we hit Oversold levels today at **$177**\n* The most common Fib Retracement level (0.618) from the March Low and June High prices was hit today at **$177** (/u/possibly6 \\- this might interest you)\n* We bounced off of the 200 Period Moving Average (4 Hour Chart) today at, you guessed it, **$177**\n* We bounced off of our current channel's support at, yes, **$177**\n\nMultiple signs are all pointing to the same thing: $177 was indeed the bottom of this long drawn-out descending channel we've been in since June 10th.  ***Time will tell if this is holds to be true, but everything is screaming the same message.  Onwards and upwards***\n\n# DMI\n\nCheck my previous post for more background on Rocky Outcrop's DMI and how it is an incredible indicator that shows explosions in volatility before they actually occur.\n\nThe indicator started flashing on June 29th and flashed off today July 7th.\n\nhttps://preview.redd.it/vohwycfxmu971.png?width=803&format=png&auto=webp&s=3732a22cf8334961bea232d1b10d5e8e3948d185\n\n* After a DMI signal flashes on and off, the positive price action (DI+, yellow line above) and negative price action (DI-, pink line above) fight it out to become the dominant momentum.  ***Positive or negative momentum is confirmed after DI+ or DI- rise above the value of 38***\n* Currently DI- is winning the fight which is normally a bearish sign; however, notice today's DI- rejection it had at 38 on the dot.  This is indicated by the blue hashed line at the end of my arrows.  This same scenario happened back in May before our huge run-up where DI- was rejected at 38, DI+ took over, and we blew up to $350\n* If DI- manages to stay below 38 and DI+ picks up momentum, this would indicate another huge run-up with volatility in the very near future\n* We will need a few more days to see how the DI+ and DI- action plays out.  In any case, get ready for increased volume and volatility!\n\n*Huh... the DI- began reverting right around the time the price hit $177.  Must be a coincidence right...?*\n\n# RSI\n\nThe Relative Strength Index (RSI) is an indicator showing when prices may be overbought, oversold, or neutral.\n\nhttps://preview.redd.it/2eybhogwsu971.png?width=1060&format=png&auto=webp&s=ad797d21dcadccea12e68540d5fce7afc2530a82\n\n* RSI officially entered oversold territory during today's price drop to $177 before it bounced back to the oversold boundary.  This is indicated by the red hashed line above\n* Previously the RSI hit this zone in March, April, and May where we then saw large price reversals afterwards\n\n*Strange... the RSI hit the Oversold zone right around when the price hit $177.  Must be another coincidence.*\n\n# Fib Retracement\n\nFib retracements are based on the famous Fibonacci Sequence which can be found all throughout nature.  This is present even here in the stock market!  Human buying/selling behavior tends to revolve around key Fibonacci levels.  It works, and it works **very well.**\n\nhttps://preview.redd.it/b6evhk49gw971.png?width=1283&format=png&auto=webp&s=f268ba97103ead1cc09a5b89b440fd9440f7420a\n\nOnce a retracement begins and a top has been confirmed, we can draw a Fib Retracement from the previous extreme low to the extreme high.  This will give us Fib Retracement Levels.  If prices fall below the **0.236 level**, they tend to continue dropping to the **0.618 level** ***in most cases***\\*.\\*\n\n* Previous Extreme Low: $117 (March 25th)\n* Previous Extreme High: $343 (June 8th)\n* 0.236 Level: $267.  Notice we fell through this pretty hard on June 10\n* **0.618 Level: $176/$177.  Notice we hit this level today almost EXACTLY and bounced violently back to the upside.**\n* This would seem to indicate that the current downwards retracement could officially be complete\n* There is a small possibility that we continue dropping down to the 0.786 Fib Level of $147 before we begin our retracement upwards; however, given all other factors outlined in this post I see this as highly unlikely at this time\n\n*Weird... $176/$177 happens to also be the 0.618 Fib level from our previous High and Low?  These coincidences just keep piling up...*\n\n# 200 Period Moving Average\n\nThe 200 Period Moving Average has been **very well respected** on the 4 Hour GME chart.  Any time GME touches or comes anywhere close to this line, it has had huge run-ups.\n\nhttps://preview.redd.it/stmdkjxs0v971.png?width=1201&format=png&auto=webp&s=4b08c721a67ad0e477da6849b38287c827d2d712\n\n*Wow how odd?!?  The 200 Period Moving Average today was at.... yes, you guessed it: $177*\n\n# Channel Support\n\nSince June 11th we have been trading in a descending channel with upper resistance and lower support levels (see the white lines below)\n\nhttps://preview.redd.it/gdpc0wqz7v971.png?width=1129&format=png&auto=webp&s=6aec79d2bcc258b6e51bf4dfd5feab9ff9d2d703\n\nGME has tested these levels multiple times over the past month as you can see on both the upper and lower end.\n\n*Guess where the channel's lower support level is for today?  Yep, $177*\n\n# Conclusion\n\n* Today's drop to $177 when measured on numerous different indicators is showing signs of a big reversal\n* If this reversal turns out to be true, it should be enough to carry us out of the current channel and then back upwards to the upper $200's before continuing onwards\n* Volume and volatility are beginning to pick back up.  This is what we need for another move to the upside\n* ***Reminder: I am not a financial advisor and this is not financial advice! :-)***",
    "title": "GME TA: Why I'm JACKED about today's drop!",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oftiz8/gme_ta_why_im_jacked_about_todays_drop/"
}