{
    "author": "PowerHausMachine",
    "created_utc": 1616900931.0,
    "distinguished": null,
    "edited": 1616947472.0,
    "id": "met918",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion",
    "name": "t3_met918",
    "num_comments": 659,
    "permalink": "/r/GME/comments/met918/999999_sure_some_of_these_dd_are_written_by_suits/",
    "score": 6454,
    "selftext": "**EDIT!! Ok seems a bunch of people are doing detective work on my experience and picture. I'll make this easy, mod pm me I will send proof of my identity. who are the mods,** /u/rensole **and who else?**\n\n&#x200B;\n\nMore than a decade ago I was once a suit and I recognize from the characteristics of the way some of these DDs are written that they most likely are suits. All of them seem to have different motives but just like we have Suit shills that have infiltrated, long Suits have also infiltrated. I believe some are writing DDs to feed us small bits of info to keep us in the game... However, I've come to strongly believe others are here to turn us against ourselves or help them without realizing it.\n\nHere's a picture of my desk 15 years ago (4 monitors missing from pic) [https://imgur.com/a/D2Qh42J](https://imgur.com/a/D2Qh42J) as a Junior analyst staring at 10 monitors. Traded on CBOE and ICE (Intercontinental Exchange) as a JA with mostly futures. Later moved to Senior trading commodities + swaps, and finally managed a desk at different company that traded all of them. Now a dirty farmer barely making any money but live a wonderful life with my wife and kids.\n\nI have many examples of what made me suspicious but it's the way they use phrases, how they type, and how intricate some of the explanations are that makes me believe they have quant background. One example is how VaR is written, VaR = Value at risk and it's used to calculate risk of a portfolio or your positions. Back in my days executives and management were extremely anal about it being written exactly as \"VaR\" to denote value at risk b/c \"var\" itself has many abbreviations. If I ever presented to my execs about our positions and didn't write it as VaR, my SVP would rip me a new one. If i went to the board without writing it like that, I would lose my job that day. Anyways when a user wrote it as VaR, it gave me flashbacks so I started reading every post he/she would write and it occurred to me that this person has experience with Black Scholes modeling (back then was the gold standard for Pricing Options + Futures). I immediately became suspicious that either this user was once a suit like me or still is one. I started taking notes on all of the DDs written ever since February to guess if they were suits or not. I said nothing about it because I didn't want the suits to stop feeding us info. I'm saying something about it now because I believe we are at the end game and retail has proven ourselves reliable.\n\nSo what are some of the nefarious reasons I believe suits are here other than to data mine? Well 2 users in particular (that I believe are suits) that I noticed will hype us up every week that \"something huge is coming this friday!! Look at the options chain someone is setting up for a gamma!!!\" I thought to myself why does the DD from these 2 always get voted up so quickly despite them being wrong almost every week. Then it occurred to me... I think these 2 are pumping up retail so we dump our stocks for FDs which have been free premiums for them week after week and also resets their FTDs. For those that don't know, FDs are weekly options that majority of the time expire worthless which are easy premiums for the option writer. With GME IV (implied volatility) being so high, option premiums have been ridiculously expensive even for weeklies. My guess is short hedge funds are writing these FDs, gaining easy premiums $$, and using the premiums $$ to drag out the fight.\n\nI don't have any proof that this is the case and it's just a hunch of mine. I also don't want to name out these users because I could be wrong about them being a suit or about their motives. I don't know anything anymore ever since I went down this GME rabbit hole. I feel dumber and less knowledgeable the more I learn about how GME is manipulated. I don't even know if my mom is my mom anymore!! Better go get a DNA doctor degree b/c I can't trust liberal doctors to do the testing!! Get the degree myself so I can do the dna testing of my mom myself to prove she is my mom. AHHHH GOING CRAZY!!!\n\n**TLDR: short Hedge Fund Suits have infiltrated and are writing DDs to get you to buy FDs which lines their pockets with money to drag out the fight.**",
    "title": "99.9999% Sure some of these DD are written by Suits",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/GME/comments/met918/999999_sure_some_of_these_dd_are_written_by_suits/"
}