{
    "author": "--KillerTofu--",
    "created_utc": 1625967175.0,
    "distinguished": null,
    "edited": 1626022244.0,
    "id": "ohv9sd",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_ohv9sd",
    "num_comments": 312,
    "permalink": "/r/GME/comments/ohv9sd/ten_trading_days/",
    "score": 1436,
    "selftext": ">The federal securities laws allow the SEC to suspend trading in any stock for up to ten trading days when the SEC determines that a trading suspension is required in the public interest and for the protection of investors.\n\nTen trading days. This has not been discussed enough.\n\nOnce the rocket ignites and the price rises to tens of thousands in a single trading day, you bet your ass this rule will be invoked.\n\nThe two weeks that follow will be an absolute shitshow. Only GME will be halted, and the rest of the market will move on, crashing horrifically while we have no choice but to sit and watch. MSM will blame us, our shares will be in limbo, and there will be -immense- pressure to sell the second GME is unhalted.\n\nYour family will threaten to disown you if you don't sell as soon as you're allowed to. There will be FUD in superstonk. You'll see well reasoned arguments, maybe some plausible DD stating that things have changed and your only hope is to bail. Every other meme stock will drop to December 2020 prices. Senators will talk about financial terrorism inquiries for the antisocials who refuse to sell and end up profiting massively from the 'unprecedented' situation unfolding. The general gist will be 'don't you dare try to get rich by raiding Gramma's pension'. Maybe they talk about raising capital gains tax for GME holders to 80%, or automatic audits for those profiting more than $1mil from GME in 2021.\n\nYou cannot imagine the fuckery that will be unleashed over the course of these 10 trading days, expressly designed to convince us that we -cannot- continue to hold once our shares are unfrozen.\n\nBuckle up. When this baby hits 88k we're going to see some serious shit.\n\n\nEdit:  88k is not a ceiling or floor, it's a reference to Back To The Future.  If you haven't seen it, I highly recommend.  Also, this was reposted at superstonk and hit 3.7k upvotes within 3 hours and was #1 on the sub but has since disappeared.  The OP of the repost does not know why and the mods have not responded.  Take that for what you will.",
    "title": "Ten Trading Days.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/ohv9sd/ten_trading_days/"
}