{
    "author": "JCStuff_123",
    "created_utc": 1618080770.0,
    "distinguished": null,
    "edited": 1618129047.0,
    "id": "moamtm",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_moamtm",
    "num_comments": 1148,
    "permalink": "/r/Superstonk/comments/moamtm/the_hedgies_may_found_our_weakest_point/",
    "score": 8944,
    "selftext": "Hi Apes,\n\nI found an irregularity to the news regarding the loss of Melvin.\n\nNow it is important that you use your own head. I'm just pointing out what I noticed.\n\nI would also like that you correct me at any time if I'm wrong. This is the most important part of this whole sub!\n\n&#x200B;\n\nThis is all mere speculation and please again point out ANY flaws you can find!\n\nI assume that the news were planted.\n\nA really good write up on why was already posted by u/JustBeingPuny in [this](https://www.reddit.com/r/Superstonk/comments/mo038k/04102021_the_fud_news_on_melvin_stop_believing/) post.\n\nI want to add, that something on the upvotes is really off.\n\nNotice how both posts have a lot more upvotes than the rest?\n\n&#x200B;\n\n[43.1k hmm thats strange....](https://preview.redd.it/rdjpvsjt3es61.png?width=708&format=png&auto=webp&s=c9d8a10263aafb200c700a1a4a934fdbe48ef77b)\n\n&#x200B;\n\n&#x200B;\n\n[Same Message 24.0k upvotes](https://preview.redd.it/fai6cq934es61.png?width=705&format=png&auto=webp&s=dc4046cf8a9ccb9ea32d9d21c9c41e3fd0200763)\n\nOkay just compare this to our beloved news of u/rensole.\n\n&#x200B;\n\n[Around 10k upvotes on each](https://preview.redd.it/ah8cpdde4es61.png?width=1002&format=png&auto=webp&s=213be3e8e76501ced83e62eb8bc5a905541e62d5)\n\nNow let's take a look at u/atobitt\n\n&#x200B;\n\n[Around 20k Upvotes](https://preview.redd.it/zzedr7y25es61.png?width=844&format=png&auto=webp&s=c83c4e0acbd975306d9175d301ab7321c2bf6d9b)\n\nNotice here how the Everything short has 31k. However this was posted on GME and it was an important write up.\n\n&#x200B;\n\nNow let's take a look at u/WardenElite\n\n&#x200B;\n\n[Around 6 to 10k upvotes](https://preview.redd.it/wva57rbo6es61.png?width=1597&format=png&auto=webp&s=33a9c7082d42d7f61369ff6dbe6437bf1671ae6f)\n\nNow I am not calling out the users who posted the screenshots as shills because they might as well could have been just celebrating apes.\n\nHowever letting posts of reposts of some dumb internet article rise that fast is quite critical. There were no fact checks and there were no sources. Just those screenshots. I even saw some more of them. So please think about this with your cortex and not your amygdala!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nMy opinion:\n\nI think it was planted and the hedgefunds might have found our Achilles heel of us.\n\nCelebrating and pushing *'seemingly good'* news on our beloved ape sub. Getting a lot of upvotes fast!\n\nNow this can be used in two things.\n\nEither pushing a narrative on us that is not the truth which will hurt us in the long run as they already did in the past.\n\nOr testing a way on how to diverge us from our lovely tendies.\n\nNow how exactly could this happen. Even when we do not do dates, there is seemingly a lot of hype for next week. This seems to me like they are trying a fake squeeze. I haven't followed up the exact margin calls but hopefully a more wrinkly brain could give them to me maybe? I can add them here as soon as possible.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nClosing words:\n\nApes we need to grow wrinkles fast! Think if something is wrong. Always think what kind of narrative they could pinpoint on us!\n\nAgain correct me if I am mistaken!!!\n\nApes cheers together!\n\nEDIT: I'm an ape I can't spell or write! (Spelling and Grammar)\n\nEDIT2: Stop giving me awards I just looked at upvotes nothing special. Give it to the real heros!\n\nEDIT3: Some apes have pointed out that news like that short and simple are just easier to digest, so rising up more easily. This might as well be the case just wanted to point it out!\n\nEDIT4: Alot of arguments against a fake squeeze is that institutions would be margin called along the way. This might be true. Can some wrinkle also write a DD about this?\n\nEDIT5: I want to express my Achilles heel argument a little more. *puts on tinfoil hat* If they can push such things and we dance to it then we are still their puppets. Then they can say Oh look they danced to it see this needs to be shut down. And the article that reddit says more to go is the best example of it. Simply some here commented that. And then suddenly we are being generalised into those few of us. If this was successful once it can be done again.\n\nEDIT6: Even the one who posted the Screenshot commented here and found it quite strange!!!",
    "title": "The hedgies may found our weakest point.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/moamtm/the_hedgies_may_found_our_weakest_point/"
}