{
    "author": "gwglessner",
    "created_utc": 1624777957.0,
    "distinguished": null,
    "edited": false,
    "id": "o8s430",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o8s430",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/o8s430/susquehanna_international_was_a_suspect_key/",
    "score": 732,
    "selftext": "Good evening my fellow apes and warriors of new\n\n&#x200B;\n\nI bring you the largest information post of Susquehanna International LLC which is suspected of my ape brothers of being a key player in the GME saga. This isn't financial advice. This is, however, public information.\n\nSusquehanna Int LLC's sole shareholder is.......... set up in Delaware so it costs money I do not have to access the information,\n\nHere is the Delaware secretary of state's website link to all of the entities I have found related:\n\n   **SUSQUEHANNA INTERNATIONAL DELAWARE, LLC**  [https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx)\n\n&#x200B;\n\n   **SUSQUEHANNA INTERNATIONAL GROUP, LLP**  [https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx)\n\n&#x200B;\n\n   **SUSQUEHANNA INTERNATIONAL HOLDINGS, LLC**  [https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx)\n\n&#x200B;\n\nNow what I found the most interesting was the registered agent was the same entity for all three entities. Here is a little bit more information about their agent (basically their \"you talk to me to talk to the entity\" person, or.\n\nAgent = door man; (i prefer to think of the gate guardian from yu gi oh)\n\n   **CORPORATION SERVICE COMPANY**  (private equity you guessed it)\n\n[https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx)\n\nand\n\nthere are a few others but my smooth brain attention span is too small and I had to move onto looking up different information; but basically they're all in Deleware and I cannot pull any more information from the secretary of state in DE (thats the deleware postal code if you apes didn't know)\n\nOkay, so what does this mean?\n\nObviously HODL like its the arctic circle, you're naked, and you're hodling the only warm left you can grip with one (or two if you're feeling ballsy) hand\n\nAlso, these entities are structures in DE and are most likely involved in foreign trusts or complex legal entities. \n\nTHIS IS ON PURPOSE SO WE CAN'T FIND IT ON GOV WEBSITES SO WE RESORT TO TOR OR TAILS ANON DEEP WEB SEARCH WHICH WILL BE ARGUED AS INVALID, EVEN IF CORRECT - SO IM KIND OF LIMITED TO WHAT I CAN SHARE; I DONT WANT TO POST ANY MORE INFO FROM THE DEEP WEB; IT SCARS PEOPLE (me too though but thats why I like it)\n\nI didn't expect to post this much at 3 am on a Saturday; but I really hope this helps a wrinkle brain create an awesome DD much more quickly. \n\nAlso, a redditor on here posted this awesome website (I will link her later, but all credit for this website goes to her, this was not my discovery). its called [opencorporates.com](https://opencorporates.com); its basically a free 'look and search here for everything about any entity in the world' site.\n\nmy fiance is having a friend stay over and im typing this post\n\nremember to brush your teeth tonight <3",
    "title": "Susquehanna International was a suspect key player in the saga; so I did a smooth brain's best attempt at piecing together everything I possible could. Here it is",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8s430/susquehanna_international_was_a_suspect_key/"
}