{
    "author": "GMEstockboy",
    "created_utc": 1625629296.0,
    "distinguished": null,
    "edited": 1625632915.0,
    "id": "ofazyn",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ofazyn",
    "num_comments": 186,
    "permalink": "/r/Superstonk/comments/ofazyn/2008_pre_market_crash_recap_jacked_247_from_here/",
    "score": 2820,
    "selftext": "Was looking at 2008 pre market crash news and saw something that happened then and  (i think) we just experiened June 23rd 2021 when Fannie Mae / Freddie Mac securities lost their value. Keep in mind I am a true retard and I know the situations were way different and possibly this has no value.\n\n**9/7/2008 Headline:**  The U.S. government places Fannie Mae and Freddie Mac,  companies that together hold more than half of the country's mortgages,  under government conservatorship, which is akin to bankruptcy  reorganization. U.S. treasury secretary, Henry M. Paulson Jr., says the  move was crucial to avoid turmoil in the national and international  economies. \"This turmoil would directly and negatively impact household  wealth: from family budgets, to home values, to savings for college and  retirement,? he says. ?A failure would affect the ability of Americans  to get home loans, auto loans and other consumer credit and business  finance. And a failure would be harmful to economic growth and job  creation\n\n**Almost exactly 3 weeks later - 9/7/08 was a Sunday, but if you only count from the following Monday it IS exactly 3 weeks later:**\n\n**9/29/2008 (Market Crash Day):**   In a stunning move that leaves the financial world in  disarray, the House rejects the bailout plan, 228 to 205. Only 65  Republicans vote in favor of the bill, despite strong pleas by President  Bush; 140 Democrats support the measure. The Dow Jones Industrial  Average drops 778 points, it's biggest point decline ever.\n\n[https://www.infoplease.com/current-events/2008/september-2008-current-events#business](https://www.infoplease.com/current-events/2008/september-2008-current-events#business)\n\n&#x200B;\n\n[September 2008 Finance / News Headlines - Source above.](https://preview.redd.it/c7hpfh5inp971.jpg?width=876&format=pjpg&auto=webp&s=7931e8eba530e96f723c3a981dc5c2e97ffb3fa7)\n\n# Fast forward to 6/23/2021:\n\n**Fannie and Freddie Shares Drop Sharply After Supreme Court Ruling**\n\nShares of the mortgage giants Fannie Mae and Freddie Mac lost a third of their value after [a Supreme Court decision](https://www.wsj.com/articles/supreme-court-issues-mixed-ruling-on-government-seizure-of-fannie-freddie-profits-11624459222)  threw cold water on the companies’ path out of government control and a  White House official said the administration was replacing the head of  the agency that oversees them.\n\nSource: [https://www.wsj.com/livecoverage/stock-market-news-live-updates-062321/card/wMFjx5vLdryIaXVvq5nz](https://www.wsj.com/livecoverage/stock-market-news-live-updates-062321/card/wMFjx5vLdryIaXVvq5nz)\n\nu/radzak10 **posted Exactly 3 weeks later is 7/14/21 WHHHHHHHHHHHHHAT!!**\n\n**TDLR: 3 weeks before 2008 crash fannie mae/freddie mac securities lost their value and plummeted. This just happened again on 6/23/21. 3 weeks after is 7/14/21. The situations were completely different so it may be pointless information.**\n\n**Between 9/7/08 & 9/29/08 its exactly 3 weeks! (Off by 1 day), and as noted by** u/radzak10 [**here**](https://www.reddit.com/r/Superstonk/comments/ofazyn/2008_pre_market_crash_recap_jacked_247_from_here/h4bft0j?utm_source=share&utm_medium=web2x&context=3)**, 3 weeks from 6/23/21 is exactly 7/14!**\n\n# These coincidences may or may not mean nothing. In my whole 6 months of stocker experience I have never seen this and i dont know about you but im personally stayin\n\n&#x200B;\n\nhttps://preview.redd.it/6z02cpfqzp971.jpg?width=1110&format=pjpg&auto=webp&s=3a2d9ba786bf681674705a02adf19962534be1fc\n\n&#x200B;\n\nhttps://preview.redd.it/l51ms4drzp971.png?width=1280&format=png&auto=webp&s=85036f4d410aaed60cd7117fc7334a73984e5f70",
    "title": "2008 Pre Market Crash Recap - Jacked 24/7 from here on out!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/ofazyn/2008_pre_market_crash_recap_jacked_247_from_here/"
}