{
    "author": "phoenixfenix",
    "created_utc": 1625620729.0,
    "distinguished": null,
    "edited": 1625622485.0,
    "id": "of8o42",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_of8o42",
    "num_comments": 161,
    "permalink": "/r/Superstonk/comments/of8o42/shitadel_and_friends_are_shorting_innovative_ev/",
    "score": 2276,
    "selftext": "This is a series I am writing up about why I believe ALL short selling, not just naked short selling, should be banned. \n&nbsp;\n\n[Part 1](https://www.reddit.com/r/Superstonk/comments/oeicfd/why_short_selling_is_bullshit_part_1/): Short sellers target financially vulnerable companies, NOT fraudulent companies\n&nbsp;\n\n[Part 2](https://www.reddit.com/r/Superstonk/comments/oew4hl/why_capital_intensive_technology_companies_are/?) [Part 2.5](https://www.reddit.com/r/Superstonk/comments/oew76n/why_capital_intensive_technology_companies_are/?): Why capital intensive technology companies are prime targets of shorting\n&nbsp;\n\n[Part 3](https://www.reddit.com/r/Superstonk/comments/of8o42/shitadel_and_friends_are_shorting_innovative_ev/): Shitadel and Friends are Shorting Innovative EV Companies for Liquidity to Fight GME\n&nbsp;\n\nPart 4: How Superstonk is putting a stop to the game (see what I did there?)\n\n&nbsp;\n&nbsp;\n\nThe title a little Clickbaity? Yes. But by the time you finish this post, I think you’ll agree that the evidence, timing, and MO lines up with my statement. \n\n&nbsp;\n&nbsp;\n\nIf you’ve read my previous posts, you’re now able to empathize a bit with a C-suite company exec who is under heavy short attack. You can imagine how painful, how isolating it must feel, to see the news slander your name, to see everything you built up be destroyed. I think its wrong. I hope you agree with me. Now, let’s see this happening in real time.\n\n&nbsp;\n&nbsp;\n\nNow, before I start. There’s only one thing you can do to save this company at one point. Buy GME. Why? Simple, the same people shorting this company are also shorting GME. I believe that this company was shorted to raise funds to fight GME, as the short and distort began in early/mid February of this year, and appears to be led by Shitadel and friends (More on this later)\n\n&nbsp;\n&nbsp;\n\nOkay….drumroll……Lordstown Motors (Ticker: RIDE) is the company under short and distort. AGAIN, DO NOT FUCKING BUY THIS COMPANY. IF YOU WANT TO SAVE IT, BUY GME AND MARGIN CALL THE FUCKERS SHORTING RIDE.\n\n&nbsp;\n&nbsp;\n\nLet’s go over their game, and how its progressing. You all already know the playbook, our superstonk apes have laid out the DD as clear as day. Short and distort and FUD, into an SEC investigation, news reports of impending failure, C-suite fired and replaced by business financier types. What can we expect to be next? Bust out, taking on debt, followed by a leveraged buyout, or some other form of insolvency/liquidation.\n\n&nbsp;\n&nbsp;\n\nLet’s dive into the anatomy of a short attack. Let’s look at the 6 month price chart of RIDE. On Feb 11 of this year, RIDE hit a high of 30.75, nearly 3 times the IPO price, before crashing down in a straight line. Most likely, the shorting began before the short and distort came out, so that short sellers could sell their shares for as much money as possible and expanding the float with fake shares, before convincing retailers to paperhand their shares at a loss.\n\n&nbsp;\n&nbsp;\n\nOn March 12, one month after its high of 30$, RIDE ends the day at around 15$, with a short report from “Hindenburg Research” claiming that RIDE does not have a product, their R&D is fake, and that there is no demand for their product. Short and distort anyone? Does this feel like Andrew Left of Citron Research? I’ll link Hindenburg’s report here: https://hindenburgresearch.com/lordstown/.\n\n&nbsp;\n&nbsp;\n\nHindenburgs report in a nutshell: Orders for RIDE’s EVs are fake, RIDE does not have an EV that works, the CEO was kicked out of his previous company, there is rampant insider selling, and that RIDE is lying to its investors. The whole company is smoke and mirrors. Now, I’m gonna take some time to debunk the FUD, but if you’ve bought GME, you should already know better than to trust a short seller report. \n\n&nbsp;\n&nbsp;\n\nFirst and foremost: Let’s debunk Hindenburgs complete character assassination of it’s CEO, Steve Burns. I hate it when people drag other’s names through the mud, especially without merit. So, let me debunk the idea that the CEO was a bumbling idiot, while simultaneously a sleazy con artist snake trying to steal investor’s money. Seriously, FUCK SHORT SELLERS.\n\n&nbsp;\n&nbsp;\n\nOkay, let’s start here: \n>**Lordstown Founder & CEO Steve Burns Was Described To Us By Former Senior Employees as a “Con Man” and a “PT Barnum” Figure**. \n\n&nbsp;\n\nHoly shit, Steve Burns is a con artist? Which of his employees said that? A “senior anonymous employee”, which as you might guess, was not named.\n\n&nbsp;\n&nbsp;\n\n>**Burns Was Pushed Out of Workhorse By The Board Due to His Inability To Focus And Execute Projects, According to Former Employees.**\n\n&nbsp;\n\nBurns left Workhorse to start a new fucking EV company. He cofounded the former goddamn company in 1998. A company in existence for almost 25 years. They just happened to boot him just as he was getting investment from GM and a massive automotive manufacturing plant in Ohio? Oookaaay…. By the way, who said this? More anonymous “former employees”. Yea, I’ll bet.\n\n&nbsp;\n&nbsp;\n\n>**Burns Launched Lordstown 4 Months Later With Little More Than Meaningless Pre-Orders (More on this Later) and Designs.**\n\n&nbsp;\n\nBurns licenses the EV truck designs at the company he cofounds, Workhorse, to begin his own EV company. However, “former senior technology employee” says he took zero intellectual property? Sure, let’s just sell 10% of our company to our former company for no reason. Oh yea, and said former company supposedly shitcanned the CEO and cofounder in a hostile firing? Yes. Let’s just have a friendly licensing deal for non-existent technology. Seriously. Who the hell believes this garbage? Also, how is it that everyone seems to be trashing this guy anonymously? Couldn’t find a single person to say a bad thing about this guy publicly?\n\n&nbsp;\n&nbsp;\n\nThe next part says that Burns was lying to investors by faking demand. This one might have some truth, so let’s just give Hindenburg the benefit of the doubt. Burns and Lordstown lied to investors by faking interest and demand for his EV pickup truck. Let’s be serious guys. Which one of you out there thinks that a functioning pickup truck EV is a dumb business strategy because there would be no demand? Shit, Ford certainly thinks so, it’s not like they’re developing an electric version of their bestselling Ford F-150 right? Oh wait. FUD OFF.\n\n&nbsp;\n&nbsp;\n\nThe rest of the report basically says the technology is behind schedule and doesn’t work, and that their pickup trucks catch on fire. They go on to say that their prototypes are garbage and are years behind schedule. First off, all R&D ends up behind schedule. You remember Tesla? When was the last time they were on schedule with one of their promises? You invest in the company because you believe they can succeed. Oh yea, one month after Hindenburg publishes their report, a Lordstown Motors sends one of their EV prototype trucks to compete in the san felipe race. Would you be surprised if I told you it didn’t catch fire? https://www.youtube.com/watch?v=S01DGKA0mDg, https://www.youtube.com/watch?v=xDoJrtG3Kgs \n\n&nbsp;\n&nbsp;\n\nHere’s our sleazy “PT Barnum” “Con Man” of a CEO here telling his investors how the truck fared in the race: https://www.youtube.com/watch?v=xBv299eGRxM Jesus, what a fucking con-man right? Really? This is the guy who’s a “PT Barnum” figure and a “Con Man”? The poor bastard spent the entire video apologizing for not finishing the race, and couldn’t even get through his prerecorded scripted speech without an “uh, umm..”\n\n&nbsp;\n&nbsp;\n\nIf you google Lordstown Motors with CNBC, you’ll see the same garbage that CNBC says about GME. Early last month, Lordstown Motors filed a “going concern” with the SEC, because they might not have the liquidity to survive for 12 months. Yea, that’s what happens with inflation of car parts in an automotive startup that has no revenue. If…only they could find a way to raise money…maybe…print some shares and sell them ATM, like the stock market is supposed to function for raising money? Too bad their shares have tanked almost 70% from shorting…\n\n&nbsp;\n&nbsp;\n\nNow, why shouldn’t you buy RIDE? It’s too late, the board booted Steve Burns, who’s been working in the automotive space since 1998, and working on EVs since 2015, and replaced him and the C-suite with some business and finance folks just last month: https://www.nytimes.com/2021/06/14/business/lordstown-motors-steve-burns-julio-rodriguez.html. Is this a bust out? Time will tell, but I wouldn’t put a dime into that company until I know the new C-suite is committed to the company, and not Shitadel and friends. Besides, if you wanna save Lordstown Motors, bust out their short sellers through GME, and force them to buy back their shorts. Lordstown retailers don’t have the diamond hands we do, and their OBV shows that shareholders are paperhanding. You won’t make much money on a RIDE short squeeze.\n\n&nbsp;\n&nbsp;\n\nOkay, so who are the shorts behind Hindenburg research? Lets ask our good friend fintel to see who's shorting RIDE: https://imgur.com/6ZLwgFI.png\n\n&nbsp;\n&nbsp;\n\nOh shit, I think I recognize a lot of those names! Where have I seen them before? Oh yea, they're shorting GME: https://imgur.com/IUEKVle.png\n\n&nbsp;\n&nbsp;\n\nSo Shitadel, Susqehanna, Jane Street, Wolverine, Nomura, and…Hindenburg Research? Say it ain’t so! The only gentlemen missing from the RIDE party are our friends at Melvin Capital. I guess that’s what happens when your hedge fund gets absorbed by Shitadel by going balls deep in GME shorts.\n\n&nbsp;\n&nbsp;\n\nWhy RIDE? Check out parts 1 and 2 of my series. Short sellers target financially vulnerable companies, not fraudulent companies. They short and distort the company to make it appear as if the financially vulnerable company is fraudulent, to get investors to bail on the company so they can destroy the company more easily. As Elon Musk says, “It is vice, disguised as virtue”.\n\n&nbsp;\n&nbsp;\n\nWhy February? Here’s my take. Short selling provides VERY fast liquidity to those who need it. Just borrow a few million shares, and sell em into the market to make millions of dollars immediately. Why did they need that money so badly? I’ll give you three hints: G, M, and E. They fucking needed the ammo to keep GME down and avoid a complete financial meltdown of their firms. Guess what, it wasn’t enough: less than two weeks after they started shorting RIDE, GME still ripped the faces off the shorts by going from 40 to 200 in AH. Let’s pour one out for Steve Burns. He and his company didn’t deserve this, but if it wasn’t his company, it would have been someone else’s. His only crime? Not being connected to wall street, and having a financially vulnerable company that was publicly traded.\n\n&nbsp;\n&nbsp;\n\nWhy did I bring this up? I want you all to know how special GME is. The fate of RIDE is the fate of nearly every company that gets picked out and selected for the short game. It is a premeditated, predatory take-down of a cornered and defenseless counterparty. \n\n&nbsp;\n&nbsp;\n\nMaybe you say “wait a minute, I’m pretty sure Lordstown is still going to fail, and there is some fraud going on with their preorders”. Okay, sure. Don’t invest in them then. Invest in their competitors. Maybe Shitadel is right. Maybe they’re wrong. That’s the purpose of Fear, Uncertainty, and Doubt. It’s to muddy the waters so you don’t know who to believe. What do you do if you own shares of RIDE? Well, might as well sell now, and let things get sorted out before you buy back in, right? Don’t want to be the sucker that diamond handed a company into bankruptcy…. right? That’s all the uncertainty Shitadel and friends need to inject into the retail investor’s mind to get them to paperhand. That’s why it always works.\n\n&nbsp;\n&nbsp;\n\nYou wanna save emerging tech companies? EV companies? Save the planet from climate change? Cure Cancer? You wanna give every company a fair chance? This is it. We have one chance. The infinity squeeze. We gotta make this MOASS as painful as we can, so that real change is made. So that they cant keep doing this shit. They short cancer research. They short EV research. They short anything innovative. Why the fuck not, right? Easy money. \n\n\n&nbsp;\n&nbsp;\n\nAnd yes, I still believe ALL short selling, naked and otherwise, should be made illegal. Read my previous posts before you tell me that there is virtuous short selling.\n\n&nbsp;\n&nbsp;\n\nFuck. I get so angry writing these. In my next and final post, I’ll explain why GME makes me happy. Looking forward to seeing you guys there.",
    "title": "Shitadel and Friends are Shorting Innovative EV Companies for Liquidity to Fight GME",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/of8o42/shitadel_and_friends_are_shorting_innovative_ev/"
}