{
    "author": "DatgirlwitAss",
    "created_utc": 1620252792.0,
    "distinguished": null,
    "edited": 1620990402.0,
    "id": "n5s3fm",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n5s3fm",
    "num_comments": 157,
    "permalink": "/r/Superstonk/comments/n5s3fm/gensler_be_like_look_at_me_im_the_sec_now_my/",
    "score": 843,
    "selftext": "[https://financialservices.house.gov/uploadedfiles/hhrg-117-ba00-wstate-genslerg-20210506.pdf](https://financialservices.house.gov/uploadedfiles/hhrg-117-ba00-wstate-genslerg-20210506.pdf)\n\nI was highly anticipating this upcoming hearing, but after reading new SEC Chairman's published testimony, I'm nothing but Nails Polished, Lips Glossed super siked about tomorrow's hearing.\n\nI was SMDH through the entire testimony. I'm totally in my feelings about all this now and after today's bullshit, I'm inspired to write out my feelings in an effort to vent, lighten-up some spirits while most importantly, sharing \\*some\\* of what I found to be important highlights for people. Hope you enjoy my humor.\n\n\\>Higher volumes of trades generate more payments for order flow. This brings to mind a number of questions: Do broker-dealers have inherent conflicts of interest?\n\nHaaayl yeah they do! No need to investigate this further. You know what it is.\n\n\\>If so, are customers getting best execution in the context of that conflict?\n\nNah, we ain't gettin' nothin' but **HOSED**.\n\n\\>Are broker-dealers incentivized to encourage customers to trade more frequently than is in those customers’ best interest?\n\nProlly. But we like the Casino. Let the people play.\n\n\\>Robinhood explicitly offered to accept less price improvement for its customers in exchange for receiving higher payment for order flow for itself.\n\n\"Don't give me any of that born in Bulgaria shit, you knew exactly wtf you was doing, **VuuhLAAAD**.\"\n\n\\>As a result, many Robinhood customers shouldered the costs of inferior executions; these costs might have exceeded any savings they might have thought they’d gotten from a zero commission.\n\n\"Your dumbass thought these mf Apes wouldn't notice?\"\n\nDat's right, dat's right, Big G. We gamble, but we also cheap as hell. We count quarter pennies, *by* *hand*.\n\n\\>Finally, it’s interesting to note that neither the United Kingdom nor Canada permits brokerdealers to route retail orders to off-exchange market makers in return for payments.\n\n\"...And ya'll over here makin' the U.S. look ssstupit.\" \n\n(*my eyeballs lookin' at Offend Ken up and down. His Triflin' ass lookin' tore up from the floor up*) SMDH. \n\n\\>January’s events bring new light to equity market structure.\n\n\"You know what else is new? My ass at the helm. There's a new Sheriff in town, and **I** **see you**.\" \n\n\\>Nasdaq and New York Stock Exchange, those big public markets had about 53 percent of the volume in January, according to public data. So where’s the other 47 percent?\n\nThis some bullshit and a GOTdamn shame, G. I can't fucking believe this shit. SMDH.\n\n\\>In addition, Dodd-Frank provided authority to the SEC to increase transparency in the stock loan market.\n\n\"It's already legislated for me to come after your sneaky, cheatin' asses...and by the way, that's legislation, I helped write.\"\n\n\\>To be clear, I’m not concerned about regular investors exercising their free speech online. I am more concerned about bad actors potentially taking advantage of influential platforms.\n\n\"Don't get it twisted, I'm cool wit retail, they just over here exercising their 1st amendment rights. It's *ya'lls* filthy asses.\"\n\nHehehe. Yall's in traaaaaaaable! 👀👀👀😂😂😂😂👀👀 🍿🍿🍿\n\n\\>This practice, called sentiment analysis, has picked up steam in the last couple of years, and it has grown to include online communities. With that comes the risk that nefarious actors may try to send signals to manipulate the market. This is an area for which we will continue to deepen our understanding, resources, and capabilities.  \n\n\"We comin' after your robots too.\"  \n\nThat's right Big G, UNPLUG their bitch ass algorithms!  🔌🔌🔌\n\n\\>In January, several broker-dealers decided to restrict customer access to trading in certain meme stocks. These decisions understandably drew a lot of questions from the investing public. Many investors lost access to the market at a critical time. \n\nYUP! THEY SURRRRRE DID, BIG G.\n\n\\>Clearing has been a crucial part of our capital markets since the 19th century \n\n\"We been doing this for centuries, y'all have zero excuses.\"\n\n\\>Some of those broker-dealers, such as Robinhood, scrambled to secure new funding to post the required margin. A number of brokers chose to restrict additional buying activity by their customers in a variety of the meme stocks.\n\n\"All ya'll dirty mfs are getting a call from my office. But Vlad, we comin' to see yo ass *in-person*.\"\n\nYou better wear your mask Bad VLAD. Can't be gettin' masta G sick and all.\n\n\\>These decisions call into question whether broker-dealers are adequately disclosing their policies and procedures around potential trading restrictions; whether margin requirements and other payment requirements are sufficient; and whether broker-dealers have appropriate tools to manage their liquidity and risk. I’ve asked staff to look at these issues carefully \n\n\"There is reason that would justify a lawsuit(s).\"\n\nOoooh, shots been fired!! \n\nThat's cool and all fo sho, Big G. But can it be the U.S. Gov on behalf of We the People v Robinhood? Cuz we can't afford lawyers, all our money tied up in GME. Of course we will accept the proceeds. Oh, and don't forget the damages for the mental and emotional **pain & suffering.** \n\noops, almost forgot...*cash* only. Thx\n\n\\>Second, several hedge funds lost significant money during these events.\n\n\"Ape friends, it's working. Don't stop, won't stop, Gamestop.\"\n\n\\>Though it doesn’t appear to have triggered broader market events\n\n\"And don't worry about ruining the markets. We got this.\"",
    "title": "Gensler Be Like, \"Look at me. I'm the SEC NOW.\" - My Black Woman Ass Hood Response and Interpretation of Gary Gensler's House Committee on Financial Services Hearing. SEC Chairman's Gary Gensler debuts with Warning Shots!",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/n5s3fm/gensler_be_like_look_at_me_im_the_sec_now_my/"
}