{
    "author": "Wingardienleviosah",
    "created_utc": 1620259012.0,
    "distinguished": null,
    "edited": 1620323760.0,
    "id": "n5u9e1",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n5u9e1",
    "num_comments": 39,
    "permalink": "/r/Superstonk/comments/n5u9e1/us_apes_dave_lauer_says_contacting_regulators_and/",
    "score": 554,
    "selftext": "I see a lot of apathy out there amongst US apes about contacting your representatives in congress. As Dave Lauer (u/dlauer) pointed out in his AMA today: Awareness Matters. Quoting directly [from the video,](https://youtu.be/AYct0XX0uTU?t=999) \"The level of popular attention is *incredibly* important, and if there some things that people can take away from this, 'How can you make a difference or get involved?', well **if you keep the attention on these issues and you keep the SEC aware of your interest and you keep your members of congress aware of your interest,** ***that's the kind of thing that can make them move quicker.***\"\n\nSo despite your apathy, despite your distaste for politicians in the pockets of big moneyed interests, in spite of any reservations, I encourage you to give this a shot. You may just be surprised at the responses you get. By texting 50409 you are engaging with [ResistBot](https://resist.bot/), a tool that makes contacting your legislators as easy as scrolling mindlessly through DD. [Resistbot](https://resist.bot/) will identify your lawmakers, draft the letter, and send it via email and fax. It's extremely efficient and our past letter writing campaigns in several GME related subreddits got several responses, even some from members of the committee.\n\nIf you want to write your own letter feel free, **but if you want to just use my template below you can simply text 'Sign PLFLYM' to 50409.**\n\nMy template/open letter PLFLYM:\n\n————————————\n\nThe initial hearings in the House Financial Oversight Committee were a good start to getting to the bottom of recent volatility in the market. However, as a constituent, I want to encourage you to dig deeper on the parties that have caused US markets to come to the brink of collapse. In particular, attention needs to be placed on getting the SEC, FINRA, and the DTCC to account for actors accused of rampant illegal naked short selling and the counterfeiting of securities.\n\nRegulation SHO was passed by the SEC in 2008 to protect our markets and the American business community from predatory short selling tactics. Unfortunately, Reg-SHO goes almost completely disregarded by the members of the DTCC. In fact, an analysis of several episodes since 2008 shows that rampant naked short selling has been facilitated by the DTCC, generating immense profits for those making these bets at the expense of companies targeted by the illegal practice.\n\nHowever, the bet against GameStop turned out to be a bad one. The hedge funds and market makers that had created naked short positions for themselves quickly found themselves accumulating losses in January 2021. Unfortunately for GME shareholders, however, instead of paying the check on their bad bets in the ensuing ‘short squeeze’, certain actors pressured brokerages to prevent buying pressure from retail investors while market makers and hedge funds used manipulative tactics to double down on shorts via ETFs, buy synthetic long positions, and trade shares in so called off exchange 'dark pools' in order drive the price down and hide the extent of their liabilities. While this staunched the bleeding for the nakedly short parties, it merely kicked the can of covering these liabilities down the road.\n\nNow this issue is still a ticking timebomb that could cause massive losses for hardworking Americans that entrust regulators and banks to look out for their interests. This episode of blatant naked shorting could also cripple faith and accountability in American markets and make our businesses easy prey for more bad behavior by these actors. If the parties involved in the naked shorting of GME are let off the hook, they will continue to use the same tactics to artificially devalue American companies for their own enrichment while the American public loses jobs and waits to bail them out when their risky naked shorting inevitably goes against them as it did in January 2021.\n\nSet the right precedent. Bring the SEC, DTCC, NSCC, and relevant hedge funds, market makers, clearing houses, and prime brokers to testify on record in an open session of Congress, report any naked short positions and talk about their actions.\n\nThe American people deserve regulators who enforce the law equally. The voters haven't forgotten 2007, and we won't forget where lawmakers stand in 2021 on Wall Street corruption.\n\nThank you for your time and attention to this important issue.\n\n————————————\n\nHere is a screenshot of how the letter appears:\n\n[Via Resistbot](https://preview.redd.it/ac75wl9c3ex61.png?width=1024&amp;format=png&amp;auto=webp&amp;s=da3f80f6983f696e85c87416375c3bc23581c030)\n\nThe government is supposed to work and represent us. If we demand better, maybe they just might. Do your part in the democratic process and let your voice be heard by your representatives.\n\nLast but not least, whether you are a ride or die libertarian or gently caress a photo of Bernie Sanders with a deep sigh and a lone tear streaming down your face before bed, we can all get behind this: Everyone who hasn't already should download and use the [Gamestop App](https://www.gamestop.com/GameStop-App.html). Vote with your dollars, if nothing else.\n\nRemember: Citizens Together Strong.\n\n100 Signature Milestone - https://twitter.com/resistbottrends/status/1390364090573328385",
    "title": "US Apes: Dave Lauer says contacting regulators and your Representatives really does help. You can do it in less than 5 minutes using this template by texting SIGN PLFLYM to 50409. Every voice helps.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/n5u9e1/us_apes_dave_lauer_says_contacting_regulators_and/"
}