{
    "author": "possibly6",
    "created_utc": 1623277608.0,
    "distinguished": null,
    "edited": 1623354636.0,
    "id": "nw84nw",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nw84nw",
    "num_comments": 888,
    "permalink": "/r/Superstonk/comments/nw84nw/elliot_waves_and_gme_why_tomorrow_should_be/",
    "score": 8142,
    "selftext": "Sup Apes,\n\n&#x200B;\n\nnot financial advice.\n\nOn a mission to prove (some) TA actually works 🚀\n\ncheck out yesterday's prediction: [https://www.reddit.com/r/Superstonk/comments/nvh6xr/i\\_predicted\\_todays\\_peak\\_by\\_45\\_my\\_thoughts\\_for\\_the/](https://www.reddit.com/r/Superstonk/comments/nvh6xr/i_predicted_todays_peak_by_45_my_thoughts_for_the/)\n\nin  my post from yesterday, many of you thought i was shilling by saying I saw 264 coming today. Who's retarded now bitches??? I'm no shill, I just tell you what the chart is saying to me in an unbiased manner. look at the low of after hours today...\n\n[30m](https://preview.redd.it/rf9utqvhdb471.png?width=2766&format=png&auto=webp&s=e165efd7cccc80764a7c2a54231ee345708e3e23)\n\nSo... now that we know we can accurately use EW to predict movements, i've got some juicy confirmation bias for you. I apologize for my post yesterday not being too enthusiastic, it was only because I had a strong feeling that based off our wave setup that a steepish correction was inevitable. Low and behold, we hit my loading zone from yesterday (visualized above by the purple fib lines).\n\nUsing EW, in the very low chance today was NOT the bottom of our cycle 4, then 238.1 would be our next target. ABC correction targets ideally 50% of the 12345 impulse, tho on a bigger scale we look to have completed our cycle 4, which targets 38.2% of the 123 (im so so so sorry i know this probably makes no sense, but I promise it all checks out and adds up)\n\nUsing this, lets zoom out and see where our cycle 5 should end up, based on the *assumption* that 264 was our cycle 4 completing:\n\n[specifically look at the white \\\\\"waves,\\\\\" this is our cycle set \\(3rd biggest subdivision of waves in EW speak\\)](https://preview.redd.it/4vs0tr4reb471.png?width=2130&format=png&auto=webp&s=2c0bb2c6e801f7ad1b8a219efb183a7b1daf5228)\n\nIdk about you all, but I'm waking up as early as I can and abusing the buy button on my brokerage. this dip won't last long, take advantage of it!\n\nSo lets talk upside price targets now. given that wave 5 targets a 1:1 of wave 1, we can conclude that we should hit AT THE VERY MINIMUM 368 before seeing a strong (ish) correction. Keep in mind, if we crush that target, then we can re assess (granted I'll need to chart out the intermediate waves within the cycle for more precise targets, I'm just too lazy and giving you a basic outlook for the rest of the week.\n\nFor your convenience, should we absolutely crush the 368 targets, watch the levels below for a rejection and show us how strong your diamond hands really are!\n\n[possible cycle 5 targets should we exceed 1:1 extension ratio](https://preview.redd.it/9ccn44j9fb471.png?width=556&format=png&auto=webp&s=c5ee1dfb0294be41d1494bf10e726b972352c0d2)\n\nfirst of all, don't you fucking dare day trade. With this roadmap I hope you have a better idea of what to expect going into tomorrow and the rest of this week. I'm ecstatic.\n\n&#x200B;\n\nFor fun, lets zoom out and see for the hell of it what my bigger targets are, for the super cycle and grand super cycle:\n\n&#x200B;\n\n[hehe](https://preview.redd.it/lg944b4qfb471.png?width=2636&format=png&auto=webp&s=320f403b87ff115f72a15b023a657dd871505c3d)\n\nand keep in mind, this isn't even the squeeze. This is just the calm before storm.\n\nTLDR: BUY DIP. VERY LIKELY 264 was bottom of cycle 4, meaning in ape speak, now we go UP to at least 368.68 in the next few days. if by the off chance that 264 was not the bottom, expect around 238, but no lower (should literally be impossible using EW) than 219. CHEEEEEEEERS!\n\nbuckle up ;)\n\nedit: I see some people saying my \"predictions\" aren't valid because I lay out a few different scenarios. In the market, it's not so much about being 100% certain of an outcome, rather be certain of the possible outcomes and act accordingly. This is why I give all the possible scenarios.\n\nedit 2: today feels eerily similar to the day after march earnings where shorts tried desperately to push price down, we all know what happened the next day...\n\nedit 3: possibly (6) final update for today, looking to have bounced at the 264 level as outlined, I should have mentioned this target in the DD, though it was mentioned in the comments somewhere with another EW ape. keep an eye on 256 as well.\n\nedit 4: lol just for fun, take a look at $IWM, its laughable how desperate they are at this point\n\nedit 5: I set buy orders at 264 and 257, went to the gym and saw we were around 245 and got super excited. Thanks ken, threw the rest of my checking account in and set a buy order at 238 and was super happy to see it filled. The fact that we keep dipping slightly below the 238 level tells me SHF are hunting stop losses, but the fact that they aren't pushing it much farther tells me they're running outta ammo. I really hope you all took advantage of today's fire sale, i got a feeling tomorrow will be like march 25th 🚀\n\nedit 6: nooooo hahaha we broke below 219. Lower your pitchforks please lol, I'll draft a new theory tonight. All this means is that i have to redraw my cycle wave set, as we broke the rules of EW today. Just means juicier upside targets, cause this would technically be a cycle \"2.\" Imma need to really wrinkle my brain to redraft this, thanks for putting your faith in my abilities nonetheless :) For what its worth the next bounce candidate i had on watch was 213\n\nedit 7: holy fuck I'm so jacked, wait till you see my new dd... todays price action confirms something huge!!!!! 213 is THE BOTTOM!!!!!\n\nedit 8: lol i love y'all so much i went and gave targets on gangnam style for a few minutes when reddit was down, you found my youtube channel if you were there ;)",
    "title": "Elliot Waves and GME, Why Tomorrow Should Be Exciting 🚀",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nw84nw/elliot_waves_and_gme_why_tomorrow_should_be/"
}