{
    "author": "Usual_Retard_6859",
    "created_utc": 1624995159.0,
    "distinguished": null,
    "edited": 1625002828.0,
    "id": "oafiga",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_oafiga",
    "num_comments": 105,
    "permalink": "/r/Superstonk/comments/oafiga/remember_all_those_screwed_up_cost_basis_people/",
    "score": 651,
    "selftext": "During the mass exodus from Robbinghood there were many reports of whacked out cost basis showing up for prices that were much higher than what showed on the exchanges.  Up till now we have never gotten a good explanation as to why.   Here is your answer.  Darkpools.  These dark pools of liquidity are more like dark pools of bullshit where wallstreet under the guise of liquidity actually has different prices than what us common folk get and they're nothing but a scam.  So without  further ado ill get into the meat.   Im a GME ape through and through but the proof comes from this movie stock filing of Jan 29th.  [SC13D/A](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001411579/d2815761-9ae4-4d8e-8201-1d2c181a527f.html) Before anyone corrects me about the dates of happenings the sneeze did happen the 27th but all these transactions filed the 29th took place on the 27th.\n\n&#x200B;\n\n&#x200B;\n\n[Darkpool prices](https://preview.redd.it/8rlbhxmm69871.jpg?width=1035&format=pjpg&auto=webp&s=d24d28601350deb9942a93bd0ebd13368d5e13c6)\n\n&#x200B;\n\nAs per the Nasdaq?\n\n&#x200B;\n\n&#x200B;\n\n[Retail prices](https://preview.redd.it/vf58mdwx69871.jpg?width=673&format=pjpg&auto=webp&s=c8781fefb2d5bc5490069a2ffd419299049db365)\n\n&#x200B;\n\nAs you can see the last five price sell ranges are above the retail highs buy as much as 20%.  What magic is this?  Darkpool fuckery.  I would even go as far to say that the current retail price and the prices we see every day are bullshit on every stock.  I also wouldn't put it past them to decide on which orders to send to the exchange to advertise the story they want to tell.  Like a movie stock being 3 times January highs?   I propose that the darkpool price of GME is three times January highs, pre MOASS or $1500/share.   It also totally clears up this comment by the president of the NYSE with credit going to the original poster.\n\n&#x200B;\n\n[https://www.reddit.com/r/Superstonk/comments/o25oi1/nyse\\_president\\_admitted\\_dark\\_pool\\_exchanges\\_are/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/o25oi1/nyse_president_admitted_dark_pool_exchanges_are/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\nThere's only one thing we can do now and that's buy and hold till the price is right bitches.\n\n&#x200B;\n\nAddendum:  If this is true and it looks to be valid then we are up against all of wall street.  With a huge bid/ask spread between exchanges and darkpools, every share sold by retail at exchange prices garner huge profits.  Its in the longs best interest to keep this price low to stave off margin calls which are based on exchange prices so they can continue to reap profits.  Explaining the sideways price action.    Now long term we are on an upward trajectory even with institutional ownership dropping from 122% to  41%.  Why? Because they're selling on the darkpools  where prices are higher.\n\n&#x200B;\n\nAddendum 2:  The more I think about it the more it makes sense.  60% dark pool trading.  If these dark pools are acting as separate markets not an appendage of the market.  By restricting the flow you screw with supply and demand and can control the price on either side.  All in the dark.....pool of shit.\n\n&#x200B;",
    "title": "Remember all those screwed up cost basis people got while transferring?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/oafiga/remember_all_those_screwed_up_cost_basis_people/"
}