{
    "author": "SuperstonkBot",
    "created_utc": 1618771688.0,
    "distinguished": null,
    "edited": 1618775630.0,
    "id": "mtistc",
    "text_only": true,
    "flair_text": "🤖 SuperstonkBot",
    "name": "t3_mtistc",
    "num_comments": 831,
    "permalink": "/r/Superstonk/comments/mtistc/are_we_headed_toward_a_hypeinduced_market_crash/",
    "score": 7577,
    "selftext": "# Are we Headed Toward a Hype-Induced Market Crash?\n\n## We’ve Been Trading IOUs this Whole Time!\n\n##  \nDisclaimers\n\nThis report is meant to summarize my research and findings over the last 3 months, not necessarily to serve a definitive reference. More knowledgeable people than me should weigh in and poke/correct any holes in my thesis, and you should **do your own research**. **Don’t blindly trust me, strangers on the internet, or the media (see the highlighted link in the supporting documentation as to why the media is in on this).**\n\n\n  \nI have a long position in GameStop. It is currently my only US market exposure. This is not financial advice. I do not work in the financial sector. This report was written on April 18 2021.\n\n\n  \nWhile GameStop is central to the thesis, the report will not go too deep into specifics with GME speculation. Remember, the thesis is about the overall hype being fed into the reddit speculators by the reddit-hype machine. As such, some numbers are rough estimates based on the reddit speculation I observed and the data I collected, and events may be slightly out of sequence in the timeline to facilitate the writing.\n\n## Summary\n\nAn ongoing battle between retail investors on reddit speculating on GameStop stock (and other “meme stocks”) and malicious hedge funds who are manipulating the stock market using counterfeit shares is about to come to a climax and uncoil a tightly-wound spring of debt, fraud, and corruption. The situation appears so dire that the mechanisms in place to control the debt that the malicious hedge funds have accumulated, should they default (get margin called), are not adequate and are about to fail. The government has taken notice and is signaling that they are about to close the loophole that allows for counterfeit shares and enforce the rules. Meanwhile, large financial institutions are propping themselves up for a major financial event that is rapidly approaching.**This appears to be a financial event similar to the global financial crisis of 2008, or worse.**\n\n## Research\n\n### What’s Going on Here?\n\nBefore we dive in, let’s explain the core of the issue at play for this thesis. Some malicious hedge funds have been abusing poorly written rules and banking frameworks around short selling to inject counterfeit shares/securities into the markets. This is done via a practice known as Naked Short Selling. Essentially they are borrowing shares to pay back shares that they have borrowed, and are also abusing the options market to “reset the timer” for delivery of the shares. They do this to manipulate market prices with the help of the media collusion, government inaction, and other tactics (check out Confessions of a Paid Stock Basher in the supporting documentation). These malicious hedge funds short companies that appear to be fundamentally on the brink of bankruptcy, and attempt to play the “bankruptcy lottery” to maximize gains. Remember Toys ‘R’ Us? Today we’re focusing on GameStop (GME).\n\n### Timeline\n\n-In early 2020, reddit user DFV (Keith Gill, also known as DeepFuckingValue and Roaring Kitty) identified GameStop as a company with potential for a complete turnaround that already had momentum building them towards success. The hedge funds missed this. He posts his research on YouTube (Roaring Kitty) and his “YOLO” GME positions on reddit (WallStreetBets) regularly. High short interest in the stock is one of the main reasons for his long play on GME.\n\n-Enter: businessman Ryan Cohen. He purchases a large stake in GME, gets on the board of directors, and is proposing changes.GameStop is about to be renovated into a successful e-commerce company like Chewy.com before he sold it to PetSmart.\n\n-The price of GME steadily increases.\n\n-Eventually the YOLO bet pays off for DFV and the reddit hype slowly builds up.\n\n-The malicious hedge funds continue to deeply short GME and attempt to manipulate price by injecting massive amounts of counterfeit shares in the markets, “doubling down” on their bankruptcy bet in the process.\n\n-President Biden nominates Gary Gensler for SEC chairman\n\n\n  \n\n  \n-The January 2021 GME Short Squeeze begins. The stock briefly peaks above $500.\n\n-Robinhood pauses trading on its platform for select securities, including GME. This effectively decapitated the short squeeze. Robinhood cited liquidity issues for the pause.\n\n-Reddit eventually exposes Naked Short Selling scam but also speculates on whether GME was not the only security shorted\n\n-GME price settles down to \\~$40\n\n-Further reddit research speculates that the hedge funds are still deeply short on GME. Some speculate that malicious hedge funds have been doubling down consistently on their GME short positions in order to fabricate more counterfeit shares during the run up to the squeeze to manipulate the price. In doing so they would have essentially dug themselves into a deeper hole and another larger short squeeze would be likely. Estimates vary, but many speculate that there are 5 to 10 times more counterfeit shares than there are real shares of GME. This is literally impossible to measure as far as I’m aware.\n\n\n  \n-In February, a US congressional hearing regarding the Robinhood shenanigans is held, and DFV is called to testify.\n\n-After the hearing, DFV doubles down to 100,000 shares of GME, and people notice he still has an amazing $12 call for 50,000 more shares expiring on April 16.\n\n-Reddit hype builds up again and GME gets to the $150-$200 range fairly quickly and ends up mostly stagnating there for over a month.\n\n-Bag holders (mostly brokers, clearinghouses, and exchanges) on the naked shorts, should a hedge fund collapse with massive debt, start issuing SEC filings detailing rule change proposals that signal impending trouble (strengthening their “insurance policy” and rules regarding securities tracking and short selling)\n\n-Reddit’s research now speculates that hedge funds are still manipulating the GME market price, but so are the institutional bag holders, because they have not gotten their rules in place to cover their asses yet.\n\n-The SEC starts sending signals that they are tightening the noose on these loopholes and maybe shutting down the printer (I looked into this myself, that last part about slowing down the Federal Reserve has yet to be confirmed with actual official communications but I think that since the incoming chairman dealt with the 2008 crash he will probably want to rip the bandaid in favour of full reforms, based on my research on him.) The Office of the Whistleblower page on the SEC website really shows what I mean.\n\n\n  \n-Meanwhile, GameStop and Ryan Cohen continue to make moves towards success. They are pulling in some prime talent from Amazon and are going all in on e-commerce. They have also cleared their debts, posted promising sales figures, updated their at-the-market equity offering program, plan on installing Ryan as chairman of the board, and are now in search of a new CEO. All of this is fueling more reddit hype for the stock.\n\n-The annual meeting of shareholders is scheduled for June 9, with a record date which would put a share recall deadline on the brokers that is very close to DFV’s April 16 call expiry date.\n\n-Lots of reddit research and speculation is done around these dates and whether they mean that hedge funds with short positions must cover their shorts.This includes lots of people posting their puts and call bets on WallStreetBets with expiry dates around those dates, and April 16 (DFV’s $12 call date)\n\n\n  \n-Reddit’s research eventually speculates that the bond market is also being injected with insane amounts of counterfeit US Treasury Bonds as a means to raise liquidity because “treasury printer goes brrrrrr” historically since 2008. Some even speculate that this has been going on since at least 2008. **The theory here is that the US Treasury bond market is currently a bubble of counterfeit Naked Shorted bonds, just like GME. “Everything Short.”**\n\n-US Senate confirms Gary Gensler for SEC chair, who is now scheduled to be sworn in on April 17 2021\n\n-**April 16 2021:**\n\n**-DFV exercises his $12 call and doubles down again. He is now at 200,000 shares of GME. The “YOLO Update” is labeled as Final. This will further fuel the reddit hype.**\n\n**-SEC issues a Public Statement \"Staff Statement on Fully Paid Lending\" signaling enforcement against those abusing the naked short loopholes starting April 22 2021. The statement indicates that this is the end of a 6 month grace period for the financial institutions in question to put measures in place to remain compliant before enforcement of securities lending rules.**\n\n**-Meanwhile some of the big banks are announcing record-breaking bond sales, likely to raise liquidity to prepare while a few hedge funds like Archegos are going bust in spectacular fashion.**\n\n**-April 17 2021: Gary Gensler is sworn in as SEC chairman.**\n\n### Other Factors\n\nI initially didn’t put much consideration in the research based on patterns in the GME charts, but if you follow some of the guys doing the technical analysis with the charts and research the patterns that they are talking about, you start seeing a few things going on. [u/WardenElite](https://www.reddit.com/user/WardenElite/submitted/) is one of the main contributors of this type of research on reddit. Since the patterns in stock market charts are essentially representative of human psychology, I think it's likely that many of the patterns are still valid despite the heavy price manipulation.\n\n\n  \nIf you tie that into the timing of the ongoing pump and dump of Dogecoin (a joke cryptocurrency, worthless by design), you can see that there are a lot of indications and theories of hedge fund liquidity troubles being \"solved\" by pumping and dumping things like Dogecoin start to form. Dogecoin, which was essentially born on reddit as a joke, is being weaponized against the reddit cryptocoin speculators in my opinion. The timing of the recent DOGE pumps coincide with the January GME squeeze and the current events. My personal research on DOGE and the technical analysis of charts is ongoing, however the signs point to something big brewing and about to happen. I do not believe Elon Musk is involved at this time.\n\n\n  \n**My belief is that the self-fueling reddit hype machine and technical analysis indicators for GME are currently converging around the SEC's enforcement deadline of April 22 mentioned in the April 16 in the SEC Public Statement on fully paid lending.**\n\n\n  \n### Follow the Leaders\n\nWe should also look to experts with proven track records with predicting these kinds of things.\n\n\n  \nMichael Burry (of \"The Big Short\" fame) is the big one here. He actually inspired DFV’s first YOLO post in WallStreetBets after he saw Burry’s firm, Scion, go very long on GME. Burry has been warning us of an impending market crash as well, saying**rampant speculation** and **easy debt** are putting the markets “on a knife’s edge”. Sound familiar? **Robinhood hands out margin accounts like candy** to people who have no idea how to properly use them. He has called Robinhood a “Gamified Casino”. Remember, most speculators on WallStreeBets are treating this like a casino, both ironically and unironically. Michael Burry had also warned investors before the 2008 crisis and shorted the housing market, making billions in the process. The SEC recently got him to stop talking and his twitter account is now gone. Hmmmmmmm.\n\n\n  \nWarren Buffet has warned us of a “bleak future” for fixed-income investors in the annual Berkshire Hathaway letter to shareholders. “Fixed-income investors worldwide – whether pension funds, insurance companies or retirees – face a bleak future.” He’s warning us to stay away from bonds!\n\n\n  \nAnd then there’s Jeremy Grantham. I encourage you to listen to Grantham’s interview with Bloomberg from January 22nd. I can’t summarize it here; it’s better if you just watch it. It’s linked in the supporting documents. It sent chills down my spine.\n\n\n  \n**I believe this is what they are warning us about this time.**\n\n## Theory\n\nNow this is where I connect the dots and form a theory. Take it with a grain of salt, and do your own research before forming your own opinion.\n\nThe majority of the US markets have switched from mortgage-backed CDOs (Collateralized Debt Obligations) to US Treasury bond-backed CLOs (Collateralized Loan Obligations) as their “foundation” following the 2008 financial crisis.\n\n\n  \nIf GME short squeezes again, and the reddit research on counterfeit US Treasury bonds is accurate (especially the “Everything Short” theory), the second GME short squeeze may be so epic (think infinity squeeze similar to Vokswagen in 2008, but without Porsche intervening) that the protective measures in place at the time won’t be sufficient and will fail.\n\n\n  \nThe Federal Reserve would have to intervene, causing the US Treasury bond bubble to pop. It’s also possible that the impending enforcement of securities lending rules by the SEC could pop the counterfeit US Treasury bond bubble on its own. The reddit research, or “DD,” on this is extensive and, in my opinion, of high quality, but has a large element of speculation due to the lack of transparency with official filings and market manipulation in play.\n\n\n  \nIf the US Treasury bond does crash, it will take out the rest of the US markets, and possibly international markets, just like in 2008 when the US subprime mortgage crisis climaxed and triggered the global financial crisis.\n\n\n  \n**The foundations of the US markets are built on a bubble of counterfeit US Treasury bonds that is about to pop, and reddit is the needle.**\n\n## Supporting Documentation\n\n##### Key evidence/research sites is in bold\n\n-[**Counterfeiting Stock - Explaining illegal naked shorting and stock manipulation**](http://counterfeitingstock.com/)\n\n**-**[**Jim Cramer draws fire over manipulation comments \\| Reuters**](https://www.reuters.com/article/cramer-interview-idUKN2036292620070320)\n\nThe YouTube video referenced has since been taken down, but the 2006 interview is up at [**https://www.youtube.com/watch?v=W90V\\_DyPJTs**](https://www.youtube.com/watch?v=W90V_DyPJTs) as of April 18 2021. I have a hard copy saved as it frequently gets taken down by TheStreet.com for copyright violation. The video does not appear anywhere on their site anymore. Jim Cramer is now a TV host for financial channel CNBC. Connect the dots.\n\n**-**[**Confessions of a Paid Stock Basher \\| AAPL Message Board Posts \\(investorvillage\\.com\\)**](https://www.investorvillage.com/smbd.asp?mb=445&mn=25514&pt=msg&mid=1288319)\n\n-[Investor Relations \\| Gamestop Corp\\.](https://investor.gamestop.com/home)\n\n-[Former Chewy CEO Ryan Cohen urges GameStop to become the Amazon of video games (cnbc.com)](https://www.cnbc.com/2020/11/20/former-chewy-ceo-ryan-cohen-urges-gamestop-to-become-the-amazon-of-video-games.html)\n\n-[Can Ryan Cohen Work His Chewy Magic At GameStop? Here’s A Possible Game Plan (forbes.com)](https://www.forbes.com/sites/joanverdon/2021/01/11/can-ryan-cohen-work-his-chewy-magic-at-gamestop-heres-a-possible-game-plan/?sh=15dc348c472a)\n\n-[submitted by DeepFuckingValue (reddit.com)](https://www.reddit.com/user/DeepFuckingValue/submitted/)\n\n-[GME YOLO update — Oct 8 2020 : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/)\n\n-[GameStop short squeeze - Wikipedia](https://en.wikipedia.org/wiki/GameStop_short_squeeze)\n\n-[Short Squeeze Definition (investopedia.com)](https://www.investopedia.com/terms/s/shortsqueeze.asp)\n\n-[GME : GameStop Corp. - Yahoo Finance](https://finance.yahoo.com/quote/GME/) 1Y chart\n\n**-**[**What to Know About Gary Gensler\\, Wall Street’s New Watchdog \\| Barron's**](https://www.barrons.com/articles/gensler-named-new-watchdog-of-wall-street-51610984182)\n\n-[**Keith Gill\\, aka 'Roaring Kitty\\,' testified to Congress on the GameStop saga \\| Boston\\.com**](https://www.boston.com/news/local-news/2021/02/18/keith-gill-roaring-kitty-gamestop-congress)\n\n[**Naked shorting in GME and how the pieces suddenly fit together : wallstreetbets (reddit.com)**](https://www.reddit.com/r/wallstreetbets/comments/lglrg5/naked_shorting_in_gme_and_how_the_pieces_suddenly/)\n\n**-**[Where are the Shares?](https://wherearetheshares.com/)\n\n-[GME YOLO update — Feb 19 2021 : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/lnqgz8/gme_yolo_update_feb_19_2021/)\n\n**-**[**Mystery solved: The deep ITM calls are coming from none other than the devil himself : GME (reddit.com)**](https://www.reddit.com/r/GME/comments/m05jed/mystery_solved_the_deep_itm_calls_are_coming_from/)\n\n-[is dogecoin a pump and dump scheme? : CryptoCurrency (reddit.com)](https://www.reddit.com/r/CryptoCurrency/comments/msktbh/is_dogecoin_a_pump_and_dump_scheme/)\n\n-[**Dogecoin, the Cryptocurrency That Started as a Joke, Is Spiking - The New York Times (nytimes.com)**](https://www.nytimes.com/live/2021/02/08/business/stock-market-today)\n\n-[Dogecoin USD - Yahoo Finance](https://finance.yahoo.com/quote/DOGE-USD/) YTD chart\n\n**-**[**Regulatory Rule Filings \\- Legal &amp; Regulatory \\| DTCC Financial Services**](https://www.dtcc.com/legal/sec-rule-filings)\n\n**-**[**The Depository Trust Company (DTC) Rulemaking (sec.gov)**](https://www.sec.gov/rules/sro/dtc.htm#SR-DTC-2021-002)\n\n-[Citadel is throttling buy orders &amp; manipulating the stock downwards : DeepFuckingValue (reddit.com)](https://www.reddit.com/r/DeepFuckingValue/comments/mcrr80/citadel_is_throttling_buy_orders_manipulating_the/)\n\n-[Biden Pick Gary Gensler Is Sworn In as SEC Chairman - Bloomberg](https://www.bloomberg.com/news/articles/2021-04-17/biden-pick-gary-gensler-is-sworn-in-as-sec-chairman)\n\n-[**SEC\\.gov \\| Staff Statement on Fully Paid Lending**](https://www.sec.gov/news/public-statement/staff-fully-paid-lending)\n\n**-**[**SEC\\.gov \\| Office of the Whistleblower**](https://www.sec.gov/whistleblower/pressreleases)\n\n-[Why Michael Burry Is Predicting A STOCK MARKET Crash - YouTube](https://www.youtube.com/watch?v=xtrH9LzN7SQ)\n\n-[**The EVERYTHING Short : GME (reddit.com)**](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n**-**[GME Annual Shareholder meeting (AGM) + Recalling the shares : GME (reddit.com)](https://www.reddit.com/r/GME/comments/me59wg/gme_annual_shareholder_meeting_agm_recalling_the/)\n\n-[Walkin' like a duck. Talkin' like a duck : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/ml48ov/walkin_like_a_duck_talkin_like_a_duck/)\n\n**-**[**What Is Archegos and How Did It Rattle the Stock Market? - WSJ**](https://www.wsj.com/articles/what-is-archegos-and-how-did-it-rattle-the-stock-market-11617044982)\n\n-[GME YOLO update — Apr 16 2021 — final update : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/msblc3/gme_yolo_update_apr_16_2021_final_update/)\n\n-[**Bank of America\\, Goldman Sachs\\, and JPMorgan Chase Had Huge Bond Sales \\| Barron's**](https://www.barrons.com/articles/goldman-sachs-bank-america-jpmorgan-bonds-dividends-51618602441)\n\n**-**[**US government debt hit as analysts braced for $370bn in Treasury sales \\| Financial Times \\(ft\\.com\\)**](https://www.ft.com/content/f296fe3c-63f3-4d5c-a71f-1a677f450ff6)\n\n**-**[**The Fed - Who Owns U.S. CLO Securities? (federalreserve.gov)**](https://www.federalreserve.gov/econres/notes/feds-notes/who-owns-us-clo-securities-20190719.htm)\n\n-[Structured finance then and now: a comparison of CDOs and CLOs (bis.org)](https://www.bis.org/publ/qtrpdf/r_qt1909w.htm)\n\n**-**['Big Short' investor Michael Burry has warned of a stock\\-market bubble and slammed Tesla\\, Robinhood\\, bitcoin\\, and the GameStop frenzy in recent weeks\\. Here are his 17 best tweets\\. \\| Currency News \\| Financial and Business News \\| Markets Insider \\(businessinsider\\.com\\)](https://markets.businessinsider.com/currencies/news/big-short-michael-burry-tweets-tesla-robinhood-bitcoin-gamestop-bubble-2021-3-1030156694)\n\n**-**[**'Big Short' investor Michael Burry says he'll stop tweeting after SEC regulators paid him a visit \\| Currency News \\| Financial and Business News \\| Markets Insider \\(businessinsider\\.com\\)**](https://markets.businessinsider.com/currencies/news/big-short-investor-michael-burry-stop-tweets-sec-regulators-visit-2021-3-1030222890)\n\n-[Berkshire Hathaway CEO Warren Buffett warns against investing in bonds (theceomagazine.com)](https://www.theceomagazine.com/business/finance/berkshire-hathaway-warren-buffett/)\n\n**-**[**Why Grantham Says the Next Crash Will Rival 1929, 2000 - YouTube (Bloomberg, January 22, 2021)**](https://www.youtube.com/watch?v=RYfmRTyl56w)\n\n##### Further Research\n\n###### *Keith Gill (aka DFV, DeepFuckingValue, Roaring Kitty) the Legend Himself*\n\n[https://twitter.com/TheRoaringKitty](https://twitter.com/TheRoaringKitty)\n\n[https://www.reddit.com/user/deepfuckingvalue](https://www.reddit.com/user/deepfuckingvalue)\n\n[https://www.youtube.com/channel/UC0patpmwYbhcEUap0bTX3JQ](https://www.youtube.com/channel/UC0patpmwYbhcEUap0bTX3JQ)\n\nRelevant posts:\n\n[100%+ short interest in GameStop stock (GME) – fundamental &amp; technical deep value analysis - YouTube](https://www.youtube.com/watch?v=GZTr1-Gp74U&list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6&index=4)\n\n[5 reasons GameStop stock (GME) is a roach not a cigar butt a la Warren Buffett &amp; could short squeeze - YouTube](https://www.youtube.com/watch?v=JWdWCtLMoU0)\n\n[The Big Short SQUEEZE from $5 to $50? Could GameStop stock (GME) explode higher?? Value investing! - YouTube](https://www.youtube.com/watch?v=alntJzg0Um4&list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6)[Hey Burry thanks a lot for jacking up my cost basis : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/d1g7x0/hey_burry_thanks_a_lot_for_jacking_up_my_cost/) (first YOLO update)\n\n[GME YOLO update — Oct 8 2020 : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/)\n\n[GME YOLO update — Feb 19 2021 : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/lnqgz8/gme_yolo_update_feb_19_2021/)\n\n[GME YOLO update — Apr 16 2021 — final update : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/msblc3/gme_yolo_update_apr_16_2021_final_update/)\n\n\n  \n###### *My reddit Rumour Mill*\n\nIt is biased towards GME as much of the theory revolves around the stock. Browse at your own risk (you will need to sift through a lot of trash) and don't blindly trust strangers on the internet (or even me). **Do your own research, there are paid shills among the redditors. >> READ THIS FIRST**[**Confessions of a Paid Stock Basher \\| AAPL Message Board Posts \\(investorvillage\\.com\\)**](https://www.investorvillage.com/smbd.asp?mb=445&mn=25514&pt=msg&mid=1288319)\n\n[https://www.reddit.com/r/DeepFuckingValue+GME+GME2+MOASS+Superstonk+gme\\_capitalists+wallstreetbets/](https://www.reddit.com/r/DeepFuckingValue+GME+GME2+MOASS+Superstonk+gme_capitalists+wallstreetbets/)\n\nnote: the subreddit “DeepFuckingValue” is named after Keith Gill, but is not associated with him.\n\n\n  \n###### *Notable reddit contributors*\n\n[https://www.reddit.com/user/atobitt/submitted/](https://www.reddit.com/user/atobitt/submitted/)\n\n[https://www.reddit.com/user/rensole/submitted/](https://www.reddit.com/user/rensole/submitted/)\n\n---\n\n***This is not financial advice!***  \n*This post was **anonymously** submitted via **[www.superstonk.net](https://www.superstonk.net/)** and reviewed by our team.\nSubmitted posts are unedited and published as long as they follow r/Superstonk rules.*",
    "title": "Are we Headed Toward a Hype-Induced Market Crash?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mtistc/are_we_headed_toward_a_hypeinduced_market_crash/"
}