{
    "author": "Dwellerofthecrags",
    "created_utc": 1616104194.0,
    "distinguished": null,
    "edited": false,
    "id": "m81nei",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m81nei",
    "num_comments": 113,
    "permalink": "/r/GME/comments/m81nei/analyzing_options_oi_for_tomorrow_puts_calls/",
    "score": 596,
    "selftext": "TL;DR I'm a smooth brain but I find this information fascinating and think there could be some pretty good action around several price points tomorrow. I believe this to be the reason shorts loaded up and longs have remained patient. Both are ready for the possibility of an epic battle. Would love to have more wrinkly brained apes contribute to the information here.\n\n&#x200B;\n\nhttps://preview.redd.it/o44su5ylsun61.jpg?width=908&format=pjpg&auto=webp&s=0b9323ba1297387bb8c37dfb62175a3c8b53241c\n\nLooks to me like the battle for $200 is significant for both sides. On either side is a massive wave of activity that is currently OTM. Price closing above $250 means over 10k of calls (1M shares) that are currently OTM finish ITM and forces over 6k of puts (600k shares) OTM. Finishing over $300 would mean almost 27k contracts (2.7M shares) that are currently OTM would finish ITM and almost 13k puts (1.3M shares) go from ITM to OTM.\n\nOn the flipside, dropping below $150 would cause over 25k in puts (2.5M shares) to be ITM that are currently OTM while causing 11k (1.1M) in calls to fall OTM. Falling below $100 makes an additional 31k in puts ITM (3.1M in shares) for a total of 56K in puts flipping from OTM to ITM (5.6M shares).\n\nThe past couple of days have been quiet for a reason. I expect tomorrow to have some fireworks. I'm not predicting MOASS or anything, just saying I expect a significant uptick in volume and probably some crazy price swings as both sides throw haymakers. To all the new Apes out there, jumping off a roller coaster is a surefire way to get hurt or worse. Strap in, enjoy the ride, and hopefully we're toasting to the greatness of RC and DFV on Saturday. The weather is pretty unpredictable though so don't be surprised if we have to rain check the celebration.\n\nAs for me, I HODL. I BUY MORE GME (Stimmy is transferred and will finally be cleared for purchasing tomorrow). I EAT CRAYONS AND WATCH THE FIREWORKS!\n\n💎🙌\n\n🚀🚀🚀🚀 🚀🚀🚀🚀 🚀🚀🚀🚀 🚀🚀🚀🚀\n\n&#x200B;\n\nEdit: Not financial advice. I just like the stock.",
    "title": "Analyzing Options OI for tomorrow (Puts & Calls). Couple of important price points to pay attention to. Definitely looks like there could some big battles on the horizon so buckle up and HOLD on! 💎🙌",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m81nei/analyzing_options_oi_for_tomorrow_puts_calls/"
}