{
    "author": "atobitt",
    "created_utc": 1616064668.0,
    "distinguished": null,
    "edited": 1616090112.0,
    "id": "m7o7iy",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m7o7iy",
    "num_comments": 1135,
    "permalink": "/r/GME/comments/m7o7iy/blackrock_bagholders_inc/",
    "score": 9926,
    "selftext": "EDIT: FMR is Fidelity. I've updated this below.\n\nEDIT 2: Removed MUST investment because they [paperhanded](https://www.marketwatch.com/story/large-gamestop-shareholder-must-asset-management-sold-off-its-stake-2021-01-28) in Jan's peak.\n\n*This is not financial advice. Everything disclosed in the post was done by myself, with public information. I'm just making a DD smoothie for your smooth ape brains..*\n\n**TL;DR- BlackRock is operating in a shadow market with Citadel and Bridgewater Associates. The three are contributing to the greatest market manipulation of all time, and the head of the snake (Citadel) is beginning to flail. I believe Citadel shorted the majority (if not 100%) of BlackRock's $GME portfolio, in addition to other highly shorted stonks, leaving BlackRock to hodl the bag.** \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nBefore we start to finger-bang, you'll understand a lot more of this if I explain a few things. I promise I won't to turn this into an accounting/legal lecture, but if we're going to look for whales, you'll need to know how.\n\nI'll be referencing a form called [SEC Schedule 13G](https://www.investopedia.com/terms/s/schedule13g.asp). This is used by institutional investors (like hedge funds) when they acquire more than 5% ownership in a company. Likewise, they would file a Schedule 13D if they bought 20% or more. Investors usually do this when they want to exert influence over the future operations of a company.\n\nSo, when a hedge fund buys between 5% - 15% of a company, it's usually just to milk their tendies and not influence their operations.\n\nWith me so far?\n\nWhen a qualified institutional investor buys at least 5% of a company, they have to report it in their *Schedule 13G* within 45 days of year-end. The only exception is if they purchase more and it brings their total ownership above 10%. When this happens, they must file the 13G by the **end of the month** in which their ownership breached 10%.\n\nQuick example:\n\n1. Whale buys 5% of $GME in July 2020. They have to file a 13G within 45 days of 12/31/2020.\n2. On October 15th 2020, they buy an additional 5% of $GME's outstanding shares. They now own 10% and must file their initial 13G within 10 days of 10/31/2020.\n3. From this point on, any **change** (bought or sold) **of 5% or more** must be reported by the end of that month in which the change was made.\n\nNow buckle up apes: I'm bout' to wrinkle that smooth brain.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI started investigating $GME's [13Fs](https://www.sec.gov/edgar/browse/?CIK=0001326380) from 2020 to find out who the biggest whales are. As discussed above, those owning more than 10% would have to file an amended 13G if they bought or sold more than 5%. This would tell us which whales are still in the fight.\n\nHere's what I found..\n\nWhales travel in pods. Although they may not communicate together, they *think* together... It's important to note that most whales will start *paperhanding* parts of their portfolios when a stonk isn't performing... it's basic investing... and during 2020, $GME wasn't a very attractive buy.. (thank god for u/deepfuckingvalue).\n\nSome *bearish* whales include Dimensional Fund Advisors, Vanguard Group, and State Street Corp.. Not only did they NOT BuY tHe DiP, but most of their sales occurred evenly throughout the year which signals a bearish position.\n\n1. Dimensional Fund Advisors LP\n   1. Owner since Q2 2003\n   2. Holds [5.6417%](https://www.sec.gov/Archives/edgar/data/0001326380/000035420421000127/SEC13G_Filing.htm) of $GME as of Q4 2020 (drop from 7.0627% in Q4 2018)\n2. Vanguard Group\n   1. Owner since Q2 of 2002\n   2. Holds [7.4012%](https://www.sec.gov/Archives/edgar/data/0001326380/000110465921018148/tv0931-gamestopcorpclassa.htm) of $GME as of Q4 2020 (drop from 10.5198% in Q4 2019)\n3. State Street Corp\n   1. Owner since Q1 of 2001\n   2. Holds [3.5058%](https://www.sec.gov/Archives/edgar/data/0001326380/000009375121000355/GameStopCorp.txt) of $GME as of Q4 2020 (drop from 4.2532% in Q4 2019)\n\nIn contrast, we had another whale pod that most definitely BoUgHt ThE dIp during 2020; several for the first time.\n\n1. The silverback himself- Ryan Cohen\n   1. Aggregate shares of [9,001,000](https://www.sec.gov/Archives/edgar/data/0001326380/000119380520001580/xslF345X03/e620155_4-gme.xml) as of Q4 2020.\n2. Maverick Capital LTD\n   1. Owner since Q1 2020\n   2. HODLs [6.6793%](https://www.sec.gov/Archives/edgar/data/1326380/000119312521044436/d120770dsc13g.htm) ownership, 1.4053% of entire portfolio (25 highest / 832 in portfolio)\n   3. Increased holdings by *164.11%* since Q1\n3. Senvest Management, LLC\n   1. Owner since Q3 2020\n   2. HODLs [7.2418%](https://www.sec.gov/Archives/edgar/data/1326380/000090266421001289/p21-0581sc13ga.htm)\n4. Morgan Stanley\n   1. Owner since Q1 2002\n   2. HODLs 6.1305% of $GME as of Q4 2020\n   3. Increase of [114.24%](https://fintel.io/so/us/gme/morgan-stanley) since Q4 2019\n\nAlthough these are bull whales and we *want* to believe they are trying to force a squeeze (not saying they *aren't)*, the SAFEST assumption is that they realized GameStop was *extremely* undervalued and wanted to get in while the tendies were frying... Regardless, we can't really tell if they are still holding because an amended 13G is only filed for these guys at year-end.. Unless they bought more than 10% of outstanding shares, but I haven't seen a recent amendment for any of them..\n\nANYWAY, IT MATTERS NOT!\n\n\"Call me Cap'n APEhab: I'm searching for Moby Dick\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nOne of the biggest $GME owners at the end of 2019 was FMR, LLC (fidelity)... They owned [9,267,087](https://fintel.io/so/us/gme/fmr-llc).. I didn't realize they just transferred 100% of the position into another side of the company. Tricky to catch that...\n\nAt any rate, this left us with only one chickontender.... **BlackRock, Inc.**\n\nAccording to their most recent 13F on 12/31/2020, BlackRock had $3,134,881,697,000 (yeah, trillion) in assets. If you check page 4 of their annual [10K](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001364742/c7a7c1bc-6afa-4e2a-929e-aa2af777caeb.pdf), they list **$8,676,680,000,000** in assets under management (AUM)...\n\nNow Citadel and BlackRock go way back.. Several of BlackRock's employees ended up working at Citadel, and vise-versa. Check out [Navneet Arora](https://www.citadel.com/leadership/dr-navneet-arora/), for example. He's the current Head of Global Quantitative Strategies at Citadel and previously served as Managing Director and Global Head of Model-Based Credit Research at BlackRock....\n\n....Are you ready for this?\n\nThere was an [article](http://alphacution.com/blackrock-bridgewater-citadel-and-the-decline-of-speculation-at-scale/) published by Alphacution in 2019 which explained the shadow-relationship between BlackRock, Citadel, and Bridgewater. Long story short, the author weaves the thread between all three firms and shows how their coordinated efforts are rigging the game for big money. BlackRock (the beta) provides trillion-dollar asset bases which are pushed through Bridgewater's (the Asymmetric Alpha) quantitative management zone. Citadel (the Structural Alpha) then acts as the market maker (through Citadel Securities) and rigs the market by serving them the most favorable trades using their high-frequency trading platforms.... If you haven't read my first article [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/), please do so.\n\nWant proof? In February 2020, Bloomberg published an [article](https://www.bloomberg.com/news/articles/2020-02-21/citadel-blackrock-win-battle-over-speed-bump-in-stock-trades) showing how companies like Citadel, BlackRock, and the Royal Bank of Canada (former CEO of Royal Bank is now on the board of BlackRock) were able to shut down a proposal by the CBOE which tried to implement a four-millisecond delay in it's EDGA exchange. This would take a HUGE ADVANTAGE out of Citadel's high frequency platform and presented a systemic risk to their secretive three-way affair.\n\nSo guess who shut down the proposal? **The F\\*CKING SEC.**\n\nhttps://preview.redd.it/gv3nsyh1tqn61.jpg?width=1284&format=pjpg&auto=webp&s=baccef76487c9a217e27529dcf49666dfb8a2b39\n\n.....Makes me sick to watch a House Committee meeting where the SEC shills just shrug their shoulders and say *\"we'll get to the bottom of these matters\"*... like you don't already know about it..\n\nAnyway, BlackRock, Bridgewater, and Citadel are basically best friends. BlackRock cooks & serves the tendies, Bridgewater packages the order for the customer, and Citadel provides coupons at the register. Now how does this tie back into $GME?\n\nLet's review:\n\n1. BlackRock is the Moby Dick of GameStop and brick n' mortar stores weren't doing too well in 2020..\n2. Throughout the year, they liquidated [18.23%](https://fintel.io/so/us/gme/blackrock) of their $GME position\n   1. Q1 balance of 11,271,702 shares\n   2. Q4 balance of 9,217,335 shares\n      1. This is a reduction of 2,054,367 shares / 11,271,702 shares (18.23% decrease)\n3. Citadel & Friends decided to short 140% of GameStop by borrowing shares from asset managers like BlackRock. Gabe Plotkin even ADMITTED they do this with asset funds like BlackRock during the 1st Committee Meeting and Bloomberg wrote an [article](https://www.bloomberg.com/news/articles/2021-03-06/the-biggest-players-in-the-short-selling-game-are-getting-a-pass) about it\n4. When stocks aren't performing well, asset managers like BlackRock will make money by charging a [high interest rate](https://iborrowdesk.com/report/GME) on lending shares for highly shorted stocks\n5. Citadel Securities pockets the proceeds from selling the short shares and never plans on repurchasing them after GameStop goes bankrupt\n6. BlackRock makes more money on the high interest rate than they would on the sale of their declining $GME shares, and everyone gets a good ol' fashioned hand job before sleeping soundly at night...\n\nThe only problem is that Ryan Cohen stepped in to challenge Moby Dick... Whether intentionally or not, Ryan more than likely prevented the entire collapse of GameStop when he purchased 9,001,000 shares during 2020....\n\nIn addition to the number of autists hodling shares, his purchase GUARANTEED that 9,001,000 shares would NOT be sold through paperhanded FUDers. I know there are other significant stocks with high short volumes and I'd bet my left nut that BlackRock did the same thing to them. Now would be a great time for BlackRock to sell their shares of $GME when the price is +$200, but wait.... THEY DON'T HAVE THEM. If they sold a significant part of their portfolio, like they were doing throughout 2020, they would have filed an amended 13G to show the reduction. I'd bet my right nut that BlackRock lent most, if not 100% of their shares and Citadel left them HODLing the bag.\n\n\"But BlackRock has waaaaay more money than Citadel. Surely they'll be fine\"\n\nWrong. BlackRock is not an investment bank- they manage assets. Their primary business is to network and gather large amounts of money, then package it within various investment vehicles. Their total revenue for 2020 was $16,205,000,000 (with a B) and while this sounds impressive, it's peanuts compared to the $8 trillion in assets on their balance sheet. In fact, the actual net income attributable to BlackRock was less than $5,000,000,000 (with a B).... Imagine BlackRock as a giant tendie warehouse, but without a distribution network.... That's where Bridgewater and Citadel Securities step in.\n\n[BlackRock, LLC 2020 10K](https://preview.redd.it/4qp4mne0ern61.jpg?width=547&format=pjpg&auto=webp&s=476a699098b444bd1f3b0a3018fe9bd16354b93e)\n\nSo where does this leave us now...\n\nCitadel is hemorrhaging funds like there's no tomorrow. In addition to all of this, they just [issued $600,000,000](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/hg-bonds-citadel-finance-places-600m-of-notes-in-bond-market-debut-terms-62989441) in 5 year bonds on March 3rd... For a company that manages \"$384 billion in assets\", this seems ridiculous... It's more likely that the head of the snake is choking on it's own venom and BlackRock could cease to have a dominant market-maker for that $3 trillion asset fund.. It's literally poetic justice.\n\nThis turbulence between BlackRock and Citadel can only end poorly for them... BlackRock built a supply chain relationship with Citadel and Citadel obviously needs an asset manager. Don't believe me? *76.7%* of Citadel's portfolio are DERIVATIVES! BETS on the outcomes of the market!... less than 25% are actual, physical shares! Imagine driving a car without gas; running a marathon without eating; landing on the moon without tendies... Of course, BlackRock will cash in a moon shot once they receive their shares, but it will cripple their biggest market maker in return.\n\nSpeaking of which....\n\nCitadel has owned shares of BlackRock (BLK) since Q3 of 2008. Their business relationship started at a rather *peculiar* time if you ask me. Although it has fluctuated since at least Q4 2018 (earliest I can see) , they just sold off [48.31%](https://fintel.io/so/us/blk/citadel-advisors-llc) of their BLK portfolio and own 206,500 BLK puts to 135,700 BLK calls (1.52 put/call).. For those who don't know... 1.52 is an EXTREMELY high put ratio. They've actually had a large put ratio on BlackRock for quite a while... anything over 0.7 signals bearish, and anything over 1 is treated like a dumpster fire. It's like Citadel knows that BlackRock is screwed without a mule like Citadel Securities.\n\n*\"Want to know what you get out of it? You get the ice cream, the hot fudge, the banana, and the nuts. Right now, I get the sprinkles, and yeah, if this goes through, I get the cherry. But you get the Sundae, Vinnie. You get the sundae\"*\n\n*- Jared Vennett, The Big Short (2015)*\n\nUnfortunately, BlackRock never got their tendies and are probably PISSED that their business partner didn't handle their end of the deal... Even though $GME was a small portion of their portfolio, it was declining in value. Not to mention all of the other assets that were lent as highly shorted stocks... They made a few bucks on the high loan % but it wasn't for long...\n\nAnd now the table is set.... Citadel is gasping for air, BlackRock is at risk of losing a major partnership with a dominant market maker, and the DTCC just started ringing the dinner bell...\n\nI think I hear the wellerman calling.",
    "title": "BlackRock Bagholders, Inc.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m7o7iy/blackrock_bagholders_inc/"
}