{
    "author": "possibly6",
    "created_utc": 1616111760.0,
    "distinguished": null,
    "edited": 1616125311.0,
    "id": "m84bit",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m84bit",
    "num_comments": 484,
    "permalink": "/r/GME/comments/m84bit/gme_319_price_levels_to_watch/",
    "score": 8704,
    "selftext": "edit: putting this up top so it's seen. **I'm GETTING DOWNVOTED TO OBLIVION!!!** Guess the shills don't want us buying anymore... for that I throw the last of my bank account in GME tomorrow. \n\nEndgame is upon us and we all know it. I feel like there isn’t much of a point in me giving my price predictions anymore, because if you’ve been reading the DD, we all know some MASSIVE FUCKING SHIT is about to go down!!! \n\nSalutations apes, u/possibly6 here with your price levels to watch tomorrow, 3/19. Remember this ain’t no mothafuckin financial advice hoe, I Ape am an.\n\nI received a few messages from people yesterday asking if I was going to post as usual, I’m sorry but (turns out I have Covid lol) I wasn’t feelin it. I’m actually feeling a lot better today, so I guess there’s a light at the end of the tunnel.\n\nI’ll keep the DD brief. Look at this 1hr view of GME.\n\n[yummy colorful crayons](https://preview.redd.it/xayv5yeucvn61.png?width=2878&format=png&auto=webp&s=7de5a8970e5eb0984102a33f6bb4ac94a16eb4e5)\n\nLook at the light blue support and resistance lines. The patterns here are known as a symmetrical triangle and a descending channel. Basically, price has bounced around off these levels, as you can visualize above.\n\nSomething to note, if you didn't see my last [DD](https://www.reddit.com/r/GME/comments/m6qx4b/the_cup_and_handle_pattern_explained_for_dummies/), the very small green box underneath the purple line is a gap up from March 8th. There is **VERY STRONG SUPPORT**  at the 172 level (red line above the purple line.)\n\nSymmetrical triangles can break in either direction (see below)\n\nhttps://preview.redd.it/te0nv6h1evn61.png?width=2880&format=png&auto=webp&s=21902f3e62130c3c0fdf7a55022b05825f15cb52\n\nI would LOVE to see the breakout to the upside, though I suspect tomorrow will be a last-ditch effort by the shorties to demoralize retailers and try to get people to sell (spoiler alert: it won't work).\n\nidk about you, but I have an addiction to buying GME shares. Everyday the squeeze is not squoze, I buy at least 1 share.\n\nThat being said, I LOVE buying my favorite stock for CHEAP, so the levels that I will be watching tomorrow to average up (I first started accumulating at 16 hehe) are **187-190** (light blue line), **172**, **157** (bottom of big green box) and I have a hail Mary buy order for **150**.\n\n[BLUE = 187-190    RED = 172    BOTTOM OF BIG GREEN BOX: 157     PURPLE\\/GREEN=140](https://preview.redd.it/1jsavonyhvn61.png?width=2880&format=png&auto=webp&s=b52aad12338a5b1ecc3295ccf49756309eb1cdef)\n\nThis rocket is about to take off, and idk about you, but **IM JACKED TO THE FUCKING TITS**\n\n[MACD and TTM Squeeze look Bullish on the 4hr](https://preview.redd.it/od10e20rivn61.png?width=2880&format=png&auto=webp&s=fbef8a7209f6b25e2d94da8669710024b4b60ff3)\n\nI would love to see us liftoff tomorrow, but I don't like putting dates on things as it just leads to disappointment should it not happen on said date. nonetheless, payday is coming soon. I can feel it. I've never seen this community so excited, even when GME has been having a down week.\n\nTLDR: THE SQUEEZE IS IMMINENT! I suspect tomorrow shorts will play dirty, and I expect a crazy fucking volatile day due to quad witching. Buy and **HODL!!!** Support levels to watch tomorrow are **187, 172, 157,** and if shit gets really crazy, **140.** In all honesty I'll be buying throughout the day cause price literally doesn't matter as of now.\n\n&#x200B;\n\nobligatory 🚀 🚀 🚀 🚀 🚀\n\nI wrote this high asf  🦍 💎\n\nedit: thanks for all the well wishes! I'm on day 12ish of covid so I'm almost home free. I'm kicking covid's ass like I'm kicking melvin's by **hodling** 🚀\n\nedit 2: wow didn't even notice how fast this is getting downvoted... just goes to show they don't want you to see this. **WERE WINNING APES!**",
    "title": "GME 3/19 Price Levels to Watch 🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m84bit/gme_319_price_levels_to_watch/"
}