{
    "author": "G_KG",
    "created_utc": 1616092422.0,
    "distinguished": null,
    "edited": 1616140982.0,
    "id": "m7xipv",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m7xipv",
    "num_comments": 251,
    "permalink": "/r/GME/comments/m7xipv/whale_watching_the_sweeping_seas_318/",
    "score": 1212,
    "selftext": "Hello ape friends!  Time to gather your crayons and go whale watching!!  So I have been fascinated (read: obsessed) by the movement in the options market for the last week or so.    It seems like the price of the stock is being primarily driven by activity in the options market- [read the first post here](https://www.reddit.com/r/GME/comments/m6ivjc/whale_watching_conversions_with_crayons/?utm_source=share&utm_medium=web2x&context=3), and the [second post here.](https://www.reddit.com/r/GME/comments/m7c0lv/whale_watching_conversions_with_crayons_316/?utm_source=share&utm_medium=web2x&context=3)  This week, our brains have been freshly wrinkled- if you have not read the Gafgarian GME presentation, [FOR THE LOVE OF APE DOWNLOAD AND READ IMMEDIATELY!](https://drive.google.com/file/d/1VL3zAmTPjptr-vevx6PtQzYGZVKNDUZZ/view)  But the main takeaway is: GME has a huuuuuuge number of synthetic stock (the FTD stocks) that hedgies are basically playing hot-potato with in the options market.  Liquidity is getting lower, and lower, and options trading could be one of the last tools in their monkey-shed... ape is hopeful.\n\nLet's start first with the active option strikes at the end of yesterday (charts are from [Optionsonar.com](https://www.optionsonar.com/unusual-option-activity/gme)):\n\nhttps://preview.redd.it/01kd81ywstn61.png?width=1831&format=png&auto=webp&s=ae2ba72ba28845c22b7e6b07c665364cc484d675\n\nI mentioned that all the deep-ITM calls you see here are a way that short-sellers make it appear they have more stock than they do.  (This satisfies the requirement that they can \"easily come up with the stock\" for their FTDs.)  Well, I checked the option strikes this morning (kind of) at 11amCT/12pmET, and behold:\n\n[12pm Eastern Time](https://preview.redd.it/v2jrjmiittn61.png?width=1833&format=png&auto=webp&s=ee981469cdaa6bbf56ed7b7f05ed81d862e87c10)\n\nFirst, and most obviously, the shorts have constructed two \"put walls\" at $350 and $400 (close up pic below).  And...... No more green crayon cluster at $12-$30!!  They've been replaced by.... \"sweeps?\"  SOMEONE SWEPT UP MY PERFECTLY GOOD CRAYONS!? **APE ENRAGEMENT.**  Then I remembered I can actually read (a recent development) and looked up: [what are sweep-option-trades?](https://help.optionsonar.com/article/14-what-are-sweep-option-trades)  From the link: \"Sweep trades are typically large orders that are broken into a number of different smaller orders. They are filled much more quickly by being split on multiple exchanges. A sweep order instructs the broker to identify the best prices on the market, regardless of offer size, and fill the order piece-by-piece until the entire order has been filled. ...  **Sweep orders also indicate that the buyer wants to take a position in a hurry, which could imply that he or she is anticipating a large move in the underlying stock’s share price in the very near future.\"**  I feel brain wrinkles forming.....   SO ITCHY....\n\nI needed soothing, so I went back to my crayons.  And noticed something....\n\n[1:00 pm Eastern Time](https://preview.redd.it/5zpqnoxfvtn61.png?width=1823&format=png&auto=webp&s=43f62aae0deb87c5448b0b1f15a60c7ed5afb307)\n\nA brand-spanking-new sweep at $300.  I panicked, and very quickly hid all of my crayons.  When I came back to check on this \"sweep,\" well.....\n\n[1:20 Eastern](https://preview.redd.it/mb1xdry8ztn61.png?width=1823&format=png&auto=webp&s=3efa28121365c7ca17f4732d77412b97ba5bd9a6)\n\nThe sweep was replaced by this brand-new crayon!  Looks like someone very quickly constructed another put-wall right at $300.\n\nhttps://preview.redd.it/1yjnvzfwwtn61.png?width=1492&format=png&auto=webp&s=07e612ac1540fc0db6bde7f107ecb7c08fcf9587\n\nConfirmed!  Someone very quickly swept up a whole bunch of crayons and piled them all at $300 (ape interpretation).  Let's check the entire range once again:\n\n[2:20 Eastern time](https://preview.redd.it/34eezpnkxtn61.png?width=1819&format=png&auto=webp&s=6e85bdc5e923eb91fe26e2b448d9989f0ab75dc3)\n\nNew sweeps at $90 and $800!!!  Ape has no clue what they're planning.  But one thing way different about today is the lack of obvious conversions activity...  doesn't look like there is any evidence of that ANYWHERE on today's options, and that's a significant change from yesterday.\n\n**EDIT/UPDATE:** Here's what our active option strikes look like now, after market close:\n\n[4:00 Eastern, all option strikes from $0 to $800](https://preview.redd.it/jbhawaytiun61.png?width=1828&format=png&auto=webp&s=51cafb486908244e221aec16a24131e11b9255d1)\n\n[Close-up of $175 to $500](https://preview.redd.it/q371j7mvjun61.png?width=1820&format=png&auto=webp&s=a07fbcec0c75ae756a3835e4ec1e8f187b18b6c4)\n\nSweep at $90 is gone- teeny crayon pile built at $100.  NEW sweep at $50!  Put wall at $300 has been fortified, and a new put wall at $280.  Here's the total amount of money invested into those put walls: $4 million at $280, $11 million at $300, $7 million at $350, and $9 million at $400.\n\n**THEORIES ON WHY THESE ARE HERE:**  1) At first glance, this is what I thought: short-seller fuckery.  Maybe they're prepping to sell those shares to try a flash crash.  Also,  [u/Dropbombs55](https://www.reddit.com/u/Dropbombs55/)  found an article explaining [\"call and put walls.\"](https://quant.stackexchange.com/questions/60711/what-are-call-and-put-walls-around-a-strike-price-to-kill-off-vega-and-preven)  2) Big wrinkle-brained thinking [found in this comment](https://www.reddit.com/r/GME/comments/m7xipv/whale_watching_the_sweeping_seas_318/greh1j7?utm_source=share&utm_medium=web2x&context=3), credit u/hyperian24 , triggered my own wrinkle formation... **This is what I think is going on, but I need help from smarter apes:**\n\n[**DEEP ITM BULL PUT SPREAD**](https://www.optiontradingpedia.com/free_deep_itm_bull_put_spread.htm)**.**  From this article: \" **The Deep ITM Bull Put Spread could be used when one expects the price of the underlying stock to move up significantly by options expiration ....  Deep ITM Bull Put Spreads achieve their maximum profit potential when the underlying stock closes at or below the short strike price by expiration  ....  \\[this strategy\\] should be used only when a significant rally is expected.\"**\n\nThese options ALL expire tomorrow 😁 So who did this?  Either BULLS who want to make money in options because they expect a huge increase in price tomorrow, or... BEARS who want to cut their losses by making money when the stock experiences a huge increase in price.  What's in common?  Someone thinks the stock will see 280-300-350-400 levels tomorrow.  Not saying it's guaranteed to happen, but someone just bet a few million in options that it will!  💎🦍🙌🚀🚀🚀🚀🚀🚀🚀💲💲\n\n**TLDR FOR APES WHO NO READ GOOD:** No one is selling.  Price movement is due to options activity.  Someone expects the price to go high tomorrow, or is at least hedging against it.\n\n💎🙌🦍🖍🖍🖍🖍🖍🚀💲\n\nEdit:  I can't say I'm surprised by this:\n\nhttps://preview.redd.it/rkh51ftx2un61.png?width=1262&format=png&auto=webp&s=7828b9437a1ee4f93bd9ac871c05db1bf2182e13",
    "title": "WHALE WATCHING - The Sweeping Seas, 3/18",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m7xipv/whale_watching_the_sweeping_seas_318/"
}