{
    "author": "nostbp1",
    "created_utc": 1626279931.0,
    "distinguished": null,
    "edited": 1626280253.0,
    "id": "ok7wh0",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ok7wh0",
    "num_comments": 116,
    "permalink": "/r/Superstonk/comments/ok7wh0/buy_the_dip_of_course_but_stop_with_these_their/",
    "score": 641,
    "selftext": "**edit: i can't edit the title but i want to change \"tank price until catalyst\" to \"control price till catalyst\".** they likely don't want to tank it too far as the cheaper it gets the more shares we can buy and an increasing chance some of the big funds buys in.\n\nPeople are setting themselves up for more disappointment if you try to call their \"last shot\" \n\nIts a never ending circle. They short a stock (synthetic or otherwise) to bring price down. We buy dip and give them cash. They can use this cash to meet margin requirements. \n\nInterest rates currently are basically 0-1% a year. They are able to borrow shares for essentially free and if they can't find them they can create synthetics given they're also a MM (MM citadel writes contracts for HF citadel so no actual money lost?)\n\nThis circle will continue repeating until someone is able to go to bat for us. Whether that's GameStop themselves announcing a crypto dividend or some type of dividend forcing some positions to close or the SEC/regulatory body saying \"enough is enough\" and ending their little game. \n\n**Until then, we are stuck. We buy? They short and get free cash to stay alive one more day. We don't buy? They don't short and keep their cash and stay alive one more day or they short the stock down to force sells.**\n\nIn layman's terms, I'd say they're taking 10000% loans from apes to live one more day and almost certainly planning to dip and let someone else hold their bag (lose in a blaze of glory from yesterday's post).\n\nThis is my theory anyways. I don't see how we aren't giving them cash with the assumption we're only gonna sell for WAY more than 180. If someone can correct me, I'm happy to listen but I doubt there's much retail selling volume and i even moreso doubt there's institutional selling volume given they've held for this long and they can afford it going to 0. GME for Long HF is a hedge. They'd buy put contracts which may expire worthless anyways so may as well hold GME. \n\nThat leaves SHFs and daytraders who are fulfilling buy orders. SHFs literally do not have the shares so they have to be shorting (naked, synthetic, or legal) all of which basically provide them with cash.",
    "title": "Buy the dip of course, but stop with these \"their last shot to tank the price\". Buying synthetics gives them cash. They'll continue being able to tank price until a true catalyst arrives.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/ok7wh0/buy_the_dip_of_course_but_stop_with_these_their/"
}