{
    "author": "kman907",
    "created_utc": 1626290083.0,
    "distinguished": null,
    "edited": 1626295169.0,
    "id": "okbek2",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_okbek2",
    "num_comments": 83,
    "permalink": "/r/Superstonk/comments/okbek2/if_i_were_ryan_cohen/",
    "score": 704,
    "selftext": "Let’s play some 4D chess.\n\nGameStop is aware that all good news is met with major attack to kill hype. \n\nEvery. Single. Time. \n\nI would take this pattern and use it against them by starting the most incognito reverse FUD move stock has ever seen. \n\nStep one, pepper in tons of 7/14 references that only apes pick up on via Twitter, crypto codes, you name it. \n\nStep two, let apes find bread crumb trail and hype the date to the point that listening shills report back to palpatine overlords as probable launch date. \n\nStep three, shills think they are big brained and set up massive FUD attack and price drop for that date to counteract said launch date. \n\nStep four, apes are fucking un-breakable so we go about our business like any day letting SHF swing at nothing but air while we buy tasty dip.\n\nStep five, drop bomb day after or couple days after when SHF have spent all ammo and can’t do shit to shut down hype. \n\nThe opponent whether it be table top, boxing, or warfare that approaches first almost always is disadvantaged. \n\nJust food for thought. I’m hodling no matter what happens this week, month, or year.\n\nEdit: this my a response to a comment, but I think I could be more clear up here, “It takes awhile to get their shit together, between shorting etfs, dropping crypto, coordinating media fud etc, it is a lot of effort for them. I agree, they will attack it again, I’m talking more about timing than anything.”\n\nEdit 2 for extra smooth apes: “yes they can come up with fake shares blah blah, I’m not talking about exhausting them completely. I’m talking about releasing company news in a window of time that catches them off guard and ill-prepared. That way the stock price can reflect positive news. There is always a gap between two swings.”",
    "title": "If I were Ryan Cohen…..",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/okbek2/if_i_were_ryan_cohen/"
}