{
    "author": "whosStupidNow",
    "created_utc": 1626921736.0,
    "distinguished": null,
    "edited": 1627000762.0,
    "id": "op4zhy",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_op4zhy",
    "num_comments": 208,
    "permalink": "/r/DDintoGME/comments/op4zhy/drs_direct_registration_system_why_not_register/",
    "score": 694,
    "selftext": "&#x200B;\n\n[Gamestop's transfer agent](https://preview.redd.it/s32pz0jrdoc71.png?width=225&format=png&auto=webp&s=a148b43d5be37ce7cb649da7f9eb0437445e8545)\n\nTL;DR/TA;DR: If you are a paper hand and are going to sell at the first sign of gains you might as well not even bother reading this at all.  But if you are diamond hand please continue.\n\n&#x200B;\n\nNow that I have your attention, and before you call this out as FUD, let me wrinkle that smooth brain.  Everyone that buys and sells their shares through a broker is a [beneficial owner](https://www.investopedia.com/terms/b/beneficialowner.asp).  A beneficial owner is a person who enjoys the benefits of ownership even though the title to some form of property is in another name.\n\n**Who is the legal owner of your shares?**  Publicly traded securities are often registered in the name of a broker.\n\n**Why is this done?** it speeds up transactions without having to constantly change the name of the registered owner of the stock.  Trading real shares takes time. (need to find a buyer and seller, etc. etc)\n\n**Why hasn't Gamestop corp said anything about direct registering your shares?**  They are not allowed to because of some rule change at DTC according to Dr. T.\n\n**Why hasn't anybody said anything about this before from the sub?** They have been.\n\nCheck out the [Superstonk interview](https://www.youtube.com/watch?v=fGVY2Kco8ng) with Dr. T.  Go to the 4:15 minute mark, and watch it for literally a minute or two.  Dr. T says that the issuer (Gamestop) can't tell you to direct register but investors can demand from their broker to register shares in your own name with the transfer agent.\n\n(edit: in case you were wondering about that company she is talking about it is CMKM Diamonds Inc.)\n\nFor those of you that bought her book: go to page 153. question 19 asks:\n\n\"**How can any stock holder be sure he's holding genuine shares, as opposed to counterfeit? (Certificate holders excepted, of course.)**\n\n(answer) Many issuers (*in this case gamestop)* offer Direct Registration for investors: no certificate, electronic access to the market and you are registered with the issuer. Unfortunately, according to the Securities Transfer Association, the electronic portion is poorly developed at the broker level; there is little to no training at the retail level; and the costs are borne entirely by the issuer. **But if you have direct ownership, on the books of the issuer, there can be no question of your genuine shares.**\"\n\nThere is a superscript at the end of the answer referencing point 78 in the back of the book directing you to check out computershare.\n\n**Who is the transfer agent?** Computershare is the transfer agent. here is a [link to their website](https://www-us.computershare.com/Investor/#DirectStock).\n\nhere is a [link to Gamestop's Proxy Statement.](https://gamestop.gcs-web.com/static-files/8f795a88-54a3-4320-b3e2-a2d5f28be6c4)  If you go to page 16 of 61, it lists computershare as their transfer agent.\n\n**Remember the thing about the voting?**  Look at page 14 of 61.  Who is entitled to vote?  [Holders of Record of Shares of common stock](https://www.investopedia.com/terms/h/holderofrecord.asp).   Holders of record is the brokers, not you.  unless you are registered with computershare you are a [beneficial owner.](https://www.investopedia.com/terms/b/beneficialowner.asp)  I think this is how they \"trimmed\" the over-vote.  You are not the \"Holder of Record\" the broker is.  And I believe this is why they are allowed to lend shares that you purchased because they are their shares to lend.\n\n**Why wasn't there a lot of people at the annual meeting?** This confused me when I was watching the superstonk live feed and the video was filmed across the street from the building where the meeting was.  again I would like to direct you back to the [proxy statement](https://gamestop.gcs-web.com/static-files/8f795a88-54a3-4320-b3e2-a2d5f28be6c4), go to page 15 of 61 part 5 last sentence,  \" you will be entitled to attend the annual meeting only if you were a stockholder of record as of the close of business on April 15, 2021 or if you hold a valid proxy for the annual meeting \"\n\nSo, that explains that.\n\nHowever, here is my personal experience dealing with computershare:\n\n1. I called computershare to  open an account and transfer some of my shares from my broker to them.  They told me that the process has to be started from the broker side and that I would have to contact them.\n2. I called my broker to transfer shares to computer share and they told me that I could not do it over the phone and that I would have to go a bank branch. (The bank is my broker)\n3. I went to the bank and they told me I had to make an appointment with a financial advisor.\n4. At the appointment, the financial advisor didn't understand what I was talking about and had to get the supervisor.  The supervisor also did not seem to know what I was talking about.  I thought this odd since they were \"financial advisors\" at the bank.  How could they not know what DRS (direct registration system) is?  The supervisor directed me to the regional manager for the bank.\n5. The regional manager called me and we talked for a few minutes and told me that the process has to be started by computershare, directing me back to where I started.\n6. I called computershare back and they confirmed again that the bank had to start the process, so I told them that the bank was giving me the run around and requested computershare to send me some official instructions that I could bring to the bank to get the process started.  Round and round we go...\n\n\\*\\*UPDATE!\\*\\*: So I was able to get the process started.  To do it you need to have shares in either a cash or margin account.  My shares are in registered accounts so I just purchased more shares instead of moving my shares around.  Anyway, you have to wait for the trade to settle, then a quick call to the broker.  (The process is done on the broker side not Computershare's side) I told the guy that I wanted to direct register my shares with the transfer agent and the guy was super helpful for once.  The fee for me was $56.50 for the transaction (regardless of how many shares) and they said the process takes 3 - 5 business days.  So in a week, I'll officially be a real Gamestop shareholder.  Tits are Jacked to the tits!\n\n&#x200B;\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nEDIT: u/moo4mtn commented a helpful link for the STC (securities Transfer Corporation):\n\n[https://www.stctransfer.com/direct-registration-system/](https://www.stctransfer.com/direct-registration-system/)\n\nhere is a copy/paste from the site:\n\n \n\n**Transfer Shares To or From a Broker**\n\nShares held by a broker to can be transferred to Direct Registration  electronically by contacting a stockbroker and instructing the broker to  transfer all or some of your shares through the Direct Registration  System. In order to transfer shares to a brokerage account, the  appropriate broker/dealer information must be added to your shareholder  account. Any transfer of shares from the account requires a Medallion  Signature Guarantee. This requirement helps to protect the shareholders  from an unauthorized transfer of book-entry shares.\n\nThere seems to be a little confusion on the processing of Direct  Registration transactions. The brokers must use DTC’s Direct  Registration System Profile Modification by Participant (DRSP) function  that allows the Broker/Dealer to either electronically:\n\nMove shares to the Transfer Agent to set up a DRS account for the benefit of an investor by: **a WT by Transfer** or\n\nTransfer an investor’s designated shares to its DTC Bank/Broker Dealer account: **Profile Transaction**\n\nAs the Broker you should have a DRS statement from the shareholder  indicating the account that the shares should be withdrawn from.  Securities Transfer Corporation requests notification from the  shareholder that they are moving their shares (a letter of instruction)  with their signature Medallion guaranteed and a transfer fee.\n\nIf there are any questions on how to process these transactions, please call DTC at 888-382-2721\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n&#x200B;\n\n[this is the way \\(probably\\)](https://preview.redd.it/mt73qsr3eoc71.jpg?width=356&format=pjpg&auto=webp&s=f617f814be0804400b1f9fc8565350be4d5defb2)\n\n&#x200B;\n\nThe point I am trying to make here, is that the brokers do not want you to do this.  I believe that's why this process is so difficult.  They want to keep your shares so they can lend them out to make money.  For me, this has been the most difficult thing to get done.   Buying high and holding through deep dips is easy compared to actually getting shares that you already paid for registered in your own name.   If you register your shares with Gamestop through the transfer agent (computershare), your broker will have to locate and deliver real shares to the transfer agent.  If retail holds more than the float like everyone is saying, and especially now when the SHF shorted the living shit out of our favorite stock, what do you think would happen if all the shares are registered?\n\n&#x200B;\n\n&#x200B;\n\n[Maybe this. Who knows?](https://preview.redd.it/imp53d7zdoc71.png?width=647&format=png&auto=webp&s=e13f280ab86db3e0e70c3eafd90a2e1c6284c316)\n\n&#x200B;\n\n&#x200B;\n\nIf you actually have a computershare account, you are holding real shares and not the bullshit \"debt and derivatives\" that the market makers use to create the phantom shares that everyone is trading with their broker.  Hold on to those mofos.  Those are the real ones.\n\n**Am I telling you to transfer all your shares to computershare?** No.  I am not telling you to do anything.  What you do with your shares is entirely up to you.   As I said before, trading real shares can take a few days.  There is a chance if you are registered with the transfer agent and the MOASS happens you would not be able to sell your shares fast enough to benefit.   However I have seen posts saying that a short squeeze can take a week or two to finish.  So I think it is worth the risk.\n\nGo ahead and try to move some.  Just one share even.  I bet you will meet some resistance from the broker.  I've been trying to direct register for two weeks with no joy to be had but I am still trying.  Just the fact that this is a cumbersome process makes me suspicious of my broker and makes me want to get this done even more.\n\nThere are a lot of people here saying that they are diamond handed.  I have even seen people comment that they will hold a few shares forever even through MOASS.  So right now, I am **not** talking to the \"softer than 10-ply paper-hands\" that are going to sell on the first spike up of gains.  I am talking to the ruthless forged under extreme pressure diamond-hand mountain gorillas that lurk in this sub.  If you plan to hold a share forever for posterity or for some emotional attachment that you have gained from being here and anybody that has \"forever shares\", go get those direct registered (DRS direct registration system (if I haven't said it enough and you forgot -> computershare)).  There is no reason not to.  You should even be able to attend the annual meeting next year and Gamestop might even have to rent out a stadium to seat everybody\n\nu/MommaP123 has some great posts about direct registration\n\nhere is one: [link](https://www.reddit.com/r/Superstonk/comments/o6o2ok/could_direct_registering_shares_create_a_nuclear/)\n\nhere is a step-by-step process: [link](https://www.reddit.com/r/Superstonk/comments/oix5zk/step_by_step_method_for_direct_registering_shares/)\n\n&#x200B;\n\n&#x200B;\n\nIn conclusion I will leave you with this:\n\nhere is a post by u/Bladeace titled [Citadel has hostages: .....](https://www.reddit.com/r/Superstonk/comments/ofdhkk/citadel_has_hostages_explaining_why_the_moass_is/) that got me thinking....\n\nthere is a part highlighted here saying, \" If the person has not delivered such a security within 35 days after the trade date, the broker-dealer that effected the sale must borrow securities or close out the short position by purchasing securities or like kind and quantity\"\n\nThis pretty much says that the broker will be on the hook if the shares are not delivered to you after 35 days.   So my question for you to think about is:\n\nIf your broker is on the hook and MOASS happens, what would prevent them from shutting down the sell button just like robin hood shut down the buy button back in January?  This could be my own paranoia kicking in but I am moving some shares to computershare just to be safe.  It is entirely up to you if you decide to do the same.  This whole post is just to get the info out there so people know that this is available.  I did not know this was a thing two weeks ago.\n\nIf you sell through computershare it is sold on the open market  so no worries of not getting your tendies in my opinion.\n\nThere is a chance everybody reading this has already direct registered their shares and I took the long way around and I am late to the party.  If that is the case I apologize for being extra smooth brained and redundant.\n\nObligatory:  this is not financial advice and I am not a financial advisor.  But you know what? After talking to the people at the bank, how hard could it be to actually become one?\n\n&#x200B;\n\nI actually would like input from anybody with a wrinkle brain to see what they think.  There is a chance that I don't know what I am talking about but I believe that I have enough links to back up what I am saying.  Is there a reason this is not talked about? I would actually would like to know a legit reason not to besides \"WaIt tIlL YoU HaVe tO fILe YouR TaxEs\"\n\nBrain smooth; helmet on; tits jacked; tendies baking; seat belt on; wife with boyfriend; rocked ignited;  [destination mooooooooooooooooooooooooOOOON](https://www.youtube.com/watch?v=xLVChRVfZ74)\n\n&#x200B;\n\n[see you there](https://preview.redd.it/bcski2jeeoc71.jpg?width=225&format=pjpg&auto=webp&s=4f17af9f88a73c1a19a4c1863718f697a9ab86d8)",
    "title": "DRS (Direct Registration System) Why Not Register Your Shares Directly in YOUR OWN NAME?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/op4zhy/drs_direct_registration_system_why_not_register/"
}