{
    "author": "Csmbird",
    "created_utc": 1624380556.0,
    "distinguished": null,
    "edited": 1624406991.0,
    "id": "o5rl2l",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o5rl2l",
    "num_comments": 229,
    "permalink": "/r/Superstonk/comments/o5rl2l/behaviorism_girl_here_lets_talk_about_this_shiz/",
    "score": 1641,
    "selftext": "Originally I intended to leave a response to a fellow Apian. However given the importance I wanted to expand upon it in an entire post….damn you comment word limits. I’ve posted and commented on shit going down in the market as it relates to behaviorism, but it’s important for all folks to understand a bit better. My educational background is predominantly in education but I also have 1500 supervision hours, am an MSEd and hold additional credentialing courses to sit for my behavior analyst board exams this summer. I aint just blowing smoke up your shiny hiney.\n\nu/zerolimits0 had posted a response over here[Right here](https://www.reddit.com/r/Superstonk/comments/o526t1/ape_news_network_62121_breaking_news_the_shorts/h2nlj4w/?context=3). Ya know, our awesome sign dude was showing where Kenny G or his henchman had their own sign placed stating they covered lol.\n\nThis was some of our responses to one another. (I don't have a damn clue how to put a gallery here....sorry. Three stacked photos will have to suffice. Sorry again).\n\n&#x200B;\n\n[Uh](https://preview.redd.it/36o9r01sgu671.png?width=821&format=png&auto=webp&s=62c200eae18b160703379416f416b277aad58c73)\n\n&#x200B;\n\n[deux](https://preview.redd.it/4wmahcuugu671.png?width=787&format=png&auto=webp&s=2f14a62b8685a276cd19b4950125c3b2c98520dd)\n\n&#x200B;\n\n[twa](https://preview.redd.it/2nhkjkpwgu671.png?width=749&format=png&auto=webp&s=038b135bc17615217cba209839c05025909335eb)\n\nAs said previously I was just going to comment. This is what I originally was going to respond with:\n\n*It's pretty bonkers but it's fairly basic. And it's pretty effing wild how blatant their behavior is to manipulate people to do certain things.*\n\n*Essentially it's this on every level with MSM, Shitadel, all of them:*\n\n*\"Attention so people listen to them so they can escape money loss and escape the bullshit situation they created that they didn't realize would come to fruition so they hopefully can save some of their tangibles...ie their fucking money.\".*\n\n*While I'm sure they all get off on the shit, sensory/automatic reinforcement really isn't at play here*\n\n*I realized it would be dumb to comment this without expanding further. So ‘eeeeere we go.*\n\n&#x200B;\n\n# Foundational concepts, keepin it basic yall.:\n\n‘Ere we go. This is an attempted quick foundation course in Behavior Analysis through basic vocabulary.\n\n**Stimuli/Stimulus:** anything within an environment. Can be a person, animal, inanimate object, a movement, a change like a sound, lights on/off, etc.\n\n**Reinforcer**: Any stimuli that increases behavior\n\n**Punisher**: Any stimuli that decreases behavior\n\n**Reinforce**: Behavior increases\n\n**Punish**: Behavior decreases\n\n**Function**: the reason for behavior.\n\n* There are four functions of behavior. Sensory, Escape, Attention, Tangible.\n* \\-It was once believed that one should look at one specific function for behavior, however Greg Hanley and other practitioners heavily predicate the importance of considering multiple functions as they essentially enhance one another. Amazing video. This concept specifically starts around[ 1 Hour 5 Minutes. ](https://duckduckgo.com/?q=hanly+function+of+behavior+assessment&iax=videos&ia=videos&iai=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DrB65QnVkKjw)\n\n**Establishing Operations**:Anything that happens that sets the stage for people to engage/disengage in possible behaviors.\n\n**Motivating operations**: something that sets the stage for people to be more likely to engage in a behavior\n\n* *Ex: I haven’t had anything to eat since last night. If I drive down the road and see a sign with a burger, I might go get myself a damn burger.*\n\n**Abolishing operations**: something that sets  the stage for people to be less likely to engage in a behavior\n\n* *Ex: I just pigged out on pizza. If I drive down the road and see a sign with a burger I’m less likely to get myself that burger.*\n\n**Unconditioned reinforcers/punishers**: Nobody needs to make us want/like/dislike shit. This shit just comes nat-UR-al.\n\n&#x200B;\n\n# It’s important to note that there are a variety of functions based on the job of each person so explicit functions may have slight variances regarding behaviors of individuals within different groups. It is important to note that behaviorism aligns specifically to the study of individuals rather than conglomerates of groups. However I would argue that given that there are behaviors in play which benefit specific individuals in exactly the same way within the same conglomerate one can deduce that each individuals behavior is aligned with a predicated target in mind, thus the behaviors of each individual in each group is going to be aligned with the needs of each conglomerate in mind.\n\n&#x200B;\n\n**Let's attempt to do a little not so functional analysis of the behavior, shall we? Gonna look specifically at the descriptions of all teh shit they've done and compile my insights right 'ere:**\n\n# MSM\n\nis always going to be attention driven given that they rely on viewership for monetization. However they also are owned by head honchos within the market, thus their tendies (tangibles/money) rely on their boss writing a check. Boss writes check if they say what they want them to.\n\n# Shitadel and Other Market Makers\n\nLook at all they're doing to get people to believe/disbelieve certain aspects within the market. They're paying shills to sit on reddit/yahoo. They're writing up lovely propaganda within MarketWatch and Motley Fool. Even going and putting up a daggum sign near the road saying that \"hedgies have covered\". They want attention in one form so they can escape the attention of another form.\n\nWhat’s kind of crazy and makes me sick when I think of it: You’d hope they’d also have the behavior function of escape when considering the mess they’ve made. But has their behavior regarding shorting stocks decreased? No. It has stayed consistent to what they have been doing. Nothing is causing a decrease in their behavior….yet. There has not been any stimuli thus far that has been deemed aversive enough to create a contingency where their behavior is punished.\n\n(Please note that within behaviorism..punishment and reinforcement do not equate to bad/good. It just means punishment=behavior decrease, reinforcement=behavior increase. If I smoke cigarettes and stop something, I’m punishing the behavior that was previously reinforced...but damn that’s a good behavioral contingency for it to have punished that behavior).\n\nThose slap on the wrist fines they get? Yeah that shit aint doing nothing to cause a decrease in their behavior. And the data shows. They have tons of money so they are essentially in a state of satiation. When you’re satiated towards a stimuli (money here), you’re less likely to engage in behavior to attain that money.\n\nIt’s also been mentioned that they may have zero intention to cover.\n\n[Uno](https://www.reddit.com/r/Superstonk/comments/o33gvh/just_a_friendlfy_reminder_of_the_cost_to_borrow/)\n\n[Dos](https://www.reddit.com/r/Superstonk/comments/n6ly3b/after_hearing_shorts_didnt_get_margin_called/)\n\n[Tres](https://www.reddit.com/r/Superstonk/comments/o0wi78/was_using_some_old_pallets_when_i_noticed/)\n\nRelying on the possibility of a bailout. Their behavior actually backs this theory up. They are not trying to escape the mess they’ve made. They keep shorting the stock. They’ve imploded the cryptos and random stocks to increase their liquidity and have utilized that liquidity the short the stock additional times. IF they were trying to escape the mess they’ve made they would have utilized that money to start covering. They have not. The government has bailed out banks in the past. The government bailed them out in the past under a similar administration (dude was vice, now he’s president), and they have experienced a behavioral contingency which has reinforced their current behavior. From this perspective their behavior is operant behavior because of the consequences of their same behaviors in the past.\n\n# Government\n\n“Everything is OOOOOK”. They want no attention here. Having tendies might be nice yeah. But the function at play regarding their behavior (considering specifically the meeting from yesterday with Yellen, Ginsler, Biden, etc.) is to escape any questioning of our financial circumstances. Escape people’s onlooking eyes. Escape people probing and prodding when they should just stay in their “lane” as the public.\n\n# NCC/ICC/DTCC\n\nTangibles. Escape. They know (and the beautiful DD out there has shown) shits gone awry. What can they do to minimize any blows they take? Let’s put in some new rules and regulations. It’ll be less of a blow at the front and save some of their tangible tendies if they start slowly incorporating some rules and regulations into their market. Escape: They gotta get out of this damn shit storm MMs played.\n\n# Apes\n\nOur behavior plays out in a few different ways when considering this situation.\n\n**Tangibles**\n\n* Dude. We want the effing tendies. Money is a major unconditioned reinforcer for us. We also have motivating operations in play that increase our behavior momentum. Alot of us work normie jobs (not all, sure there are wealthy wealthy whales out there). Alot of us are likely middle class/lower class. The opportunity for money has us diamondhanded. We’ve never had millions and millions so that is reinforcing for us. We’ve been desensitized to punishment of short attacks. We just hold and hold cause honestly...we’ve never had millions so it is definitely a reinforcer. There is no satiation here, we are in a state of deprivation which makes us even more likely to hold that good boi behavior of engaging with this stock.\n\nHere our lovely money can be used to purchase backup reinforcers. Backup reinforcers are lovely things like:\n\n\\-Lambos\n\n\\-Dogs\n\n\\-Cats\n\n\\-Gamestations\n\nAbility to donate to charities\n\n\\-Trips to Disney World\n\n\\-Buying a new pair of shoes when you’ve been wearing the same ones for 5 years straight.\n\n\\-A house\n\n\\-A chicken coop\n\n&#x200B;\n\n**Escape**:\n\n1. Escape the corruption. Corruption on so many freakin levels.\n2. Escape poverty\n3. Escape working for the damned man.\n4. Escape coworkers who talk about dumb shit\n5. Escape your beater of the car that was a handmedown from your mom and the headrest keeps popping off.\n\n**Attention**:\n\n!!!Here this basically is why we engage with one another here rather than why we hold the stock as it was for Tangible and Escape!!!\n\n1. Attention from others so they can stave off against poverty\n2. Attention from other to share information\n3. Attention from others so we can get help.\n4. Attention on the issues of financial corruption with the attempt to change shit up.\n\n&#x200B;\n\n&#x200B;\n\n# tl;dr:\n\n&#x200B;\n\n[All good things](https://preview.redd.it/2atpi5csju671.png?width=500&format=png&auto=webp&s=28d3653da422c05d592e991ba2d5a05273c4b53e)\n\nThere are scientific explanations for their behavior....and ours. All good things...all good things. Hold your stock. \\*Just as you would have even if you never read this....\\*None of this is financial advice. Just a mere monkey woman here.\n\n&#x200B;\n\n&#x200B;\n\nWant to learn more?\n\nGo look into Cooper, Heron, Heward; B.F. Skinner; Greg Hanley. Good place to start :)\n\n&#x200B;\n\n# Edit 1:\n\nu/[**CANTPRONATWORK**](https://www.reddit.com/user/CANTPRONATWORK/) **commented and reminded me I'd forgotten extinction!!!! It was somewhat intentional as I didn't see it playing directly alongside the functions of behaviors...but there is one example of this shit wayyy down there at the bottom of Edit 1, which is something yall would probably get a kick out of.**\n\nThey said:\n\n*Thanks for the breakdown! I do wish you'd touched base on extinction which is something apes should be striving for.*\n\n*(for anyone reading this who's unfamiliar, extinction is basically where the reinforcement stops working, ie: the scare of dips lessens)*\n\n&#x200B;\n\n**Extinction** is a critical aspect within behaviorism. It's important to clarify here that ***extinction is not where reinforcement stops working***\\*\\*\\*...but it's when reinforcement is no longer being given.\\*\\*\\* Personally...while I think extinction is good in some circumstances...I don't necessarily agree with it being something we should be striving for specifically at face value. However if the entire financial system stopped reinforcing these dickheads that would be schweet. In essence they somewhat are by putting rules like ohhhh 002 into place where they can margin call them any fucking time rather than them getting to dick around all but once/twice a month.\n\nExtinction is where something that has been previously reinforced is no longer reinforced. Personally I would disagree about the scare of the dips lessons being extinction. That would be desensitization. However, if Kenny and his boys have been used to shorting companies into death spirals and getting away with bankrupting companies and not having to pay tax money on their income.....and all the sudden when they can't short a company into bankruptcy. **Aw shit that is extinction.**\n\n&#x200B;\n\nAlong with extinction comes the lovely **extinction burst.** An extinction burst is a rapid and greatly magnified burst of unwanted/often aggressive behavior that can take place when a behavior that they were previously reinforced for stops. Remember that video of the folks at Citadel (or was it Melvin?) When they started busting shit up and shouting \"WHY AREN'T THEY SELLING!?\". That my friend was an extinction burst. They were used to folks selling. Their previous behavior of shorting increased and stayed because they were reinforced by it. They made money from that shit and it was reinforcing. They were used to shorting stocks-price goes down- people sell. Ohhhhh but this time stocks get shorted-price goes down-people hold. They did not likie that one bit. This is precisely an extinction burst.\n\n&#x200B;\n\n# Edit 2: Had to bold highlight some shit. ",
    "title": "🐱‍🏍🐱‍🚀Behaviorism Girl Here. Let's talk about this shiz real quick. It's important- I shall share my knowledge....That being said I'm simply a monkey woman. 🐱‍🏍",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5rl2l/behaviorism_girl_here_lets_talk_about_this_shiz/"
}