{
    "author": "LongTimeGamer",
    "created_utc": 1624413696.0,
    "distinguished": null,
    "edited": false,
    "id": "o632ht",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o632ht",
    "num_comments": 52,
    "permalink": "/r/Superstonk/comments/o632ht/mapping_00_appearances_to_the_ftd_cycle_and_why/",
    "score": 625,
    "selftext": "Hell.00 again! If you haven't heard of \".00 Guy\", know I’m obsessed with the appearance of .00 Open, Close, High, and Low price points in GME.\n\nNo way is this financial advice. I’m just a guy that like’s mapping the appearance of his favorite number in his favorite stock.\n\nLet’s get this out of the way first:\n\nDid GME have an Open, High, Low, or Close price point ending in .00 today?   \n**YES - GME saw an After Hours close of $219.00**\n\nIs GME Trending above average for .00 appearances?  \n**YES, in June GME is currently seeing a .00 Open Price rate of appearance of 25%.**  \n**A normal stock in the $200 - $300 price range typically see a .00 Open price appearance rate of 3.96%.**\n\n&#x200B;\n\nhttps://preview.redd.it/kj1wjue59x671.png?width=552&format=png&auto=webp&s=d813a0a3ab941c31c0bec52bde2b3bfcd0cffb3b\n\nNow, let’s get right into what’s new:\n\nIf you missed [my last post](https://www.reddit.com/r/Superstonk/comments/o1gn2u/i_processed_16_years_of_data_across_8_stocks_to/), I took a deep dive into the appearance of GME Open, Close, High, and Low price points ending in .00. I *felt* I was seeing .00 more than other stocks, and I proved that to be true. A Double DD too much? Just know that GME is seeing 5-10X more price points ending in .00 than the stocks I compared it to.\n\nAt the completion of my last DD, I wrote a note on my desk, “*research GME’s .00 v. the FTD cycle - release findings regardless*”. Let’s take a look at what I uncovered.\n\n**TL;DR: This DD is broken into two segments. The first explains that I see no direct correlation between the FTD cycle and .00 appearances and that it’s unwise to say the FTD cycle is causing an increase in .00 appearances. The second segment details why it’s always important for apes to be critical, ask questions, and understand that data can be manipulated.**\n\n\\----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**.00 | The Data**\n\nI’ve exported all my data from Yahoo's historic price exports. I love transparency.\n\nI pulled FTD data from [https://gme.crazyawesomecompany.com/failures-to-deliver.php](https://gme.crazyawesomecompany.com/failures-to-deliver.php) rather than the SEC directly ([https://sec.report/fails.php?tc=GME](https://sec.report/fails.php?tc=GME)) to speed up data processing.\n\nI then marked critical FTD dates with the T+Cycles. I marked if the stock opened at a .00 price point. I tracked a 60-trading-day average for rate of .00 appearances. Finally, I marked the % change from that day’s open to the prior day.\n\n[You can view my data in Google Sheets here](https://docs.google.com/spreadsheets/d/1FHN6YvK8S3Iu5pCOaj5d0hVVo4wkLQCfffiVek6EUp0/edit?usp=sharing).\n\n&#x200B;\n\n**1.00 | My .00 and FTD Theory**\n\nBefore I started my work on this DD, I wanted to have a clear understanding of what I wanted to research. I’ll summarize as follows:\n\nI am interested in determining if there is a correlation between the T+Cycle and the appearance of .00 price points. I want to see if there are any trends in .00 price points mapped out to certain T+Cycles.\n\nMy new FTD theory would be deemed true IFF I could connect a .00 trend to a T+Cycle. Perhaps I would see a cluster of .00 price points around a FTD date. Perhaps I would see .00 appearances just at, before, or after big price movements. I wasn’t sure what I was going to find, but the .00 and FTD relationship would only be confirmed if there was something unique to connect the two together. \n\n&#x200B;\n\n**2.00 | What the Data Shows**\n\nI’ve stared at this data for the past few days and see no correlation between the FTD cycle and .00 appearances.\n\nI’m playing with a limited data set of 118 trading days and 5 key FTD dates…but in that limited data there is just nothing I can confidently point to and say “that’s unusual”. \n\nMy data does show that as each FTD cycle passes, the rate of opens at price points ending in .00 increases. However, this **does not** uniquely connect the FTD cycle to .00 appearances.\n\n&#x200B;\n\n|FTD Date|60 Day Avg. of .00 Opens|\n|:-|:-|\n|1/15|3.33%|\n|2/24|5.00%|\n|3/25|8.33%|\n|4/26|13.33%|\n|5/25|21.67%|\n|6/24|Currently at 25.00%|\n\nMy previous DD clearly stated that the rate of .00 appearances has increased throughout 2021. Therefore, the increase in relation to the FTD dates is not a unique connection and I do not feel comfortable with making any claims tying the T+Cycle and FTDs to the appearance of .00 price points.\n\nBummer, I know. It’s nice to have additional confirmation bias but I also feel like it’s just as important to come out and say, “*I did my due diligence and I saw nothing*”. \n\nIn summary, the .00 rate is steadily increasing and while there is no connection to FTDs, **my original theory holds true**. I will continue to monitor .00 appearances for abnormalities.\n\n\\----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**3.00 | GME, Data, and You.**\n\nApes, be cautious. \n\nSince my first post on the increasing trend of .00 appearances, I have been tagged in and noticed more posts about “.00 Guy” and my original theory. I’ve seen Apes that have understood and correctly shared my data. I’ve also seen Apes that have misunderstood or have used my data to misdirect others.\n\n**Be critical of data!**\n\nJust because someone says a number and shows a chart or data set doesn’t mean their conclusion is correct. It would be wrong of me to have come in here and told you that FTD and .00 appearances are related and since .00 rate is increasing, we should see an increase in the next cycle. That’s an incorrect conclusion that could be pushed with my data.\n\nAsk questions, push back, and don’t accept anything as gospel if you can’t verify it yourself. This is why I include access to my data sources and data itself.\n\n**Understand Data Can Be Manipulated.**\n\nhttps://preview.redd.it/wdxsdx2y9x671.png?width=1058&format=png&auto=webp&s=2a504b25caa8f2991d9b7b7799ea3fdd281e2b91\n\nMaybe it’s not as direct as a made-up fact, but biases are everywhere. From the questions we choose to ask to the data we choose to include in our data sets, we are biased. Just the fact you’re reading this on Superstonk means you are most likely biased to pro-GME conclusions.\n\nAs people, we continually build on a foundation of knowledge. While the foundation can be expanded or replaced, it’s important that accurate and verifiable information be easily accessible to new apes to prevent that foundation from being built on falsehoods.\n\nOverall, this subreddit does an amazing job of filtering content via the Knights of New to our amazing mod team and community that works to ‘debunk’ DD that has been proved inaccurate. But, FUD can slip through.\n\n**Ask Why Am I Seeing This?**\n\nNew DD or Data is the good stuff. I can’t get enough of it myself. But, next time you see a top post by a new name, ask why. Why this data set? Why this conclusion? Why now? \n\nAs a sub, there is somewhat safety in numbers. Content from shills is often easily filtered from New, but every now and then something gets through. “Ban me”, “I’m Tired”, “I’m Homeless and Hold GME”, etc has all been content we’ve seen on this sub and have said no more. These were easy to identify as FUD. The purpose? None. The conclusion? None. The value? None.\n\nDo you know what’s trickier? \n\nReceiving countless *direct messages* to research certain stocks to include in my .00 comparisons. I believe this is an avenue taken by shills to insert themselves in a stealthy way. They told me it would be “the next stock to moon” and that these are “stocks that are on the precipice of super squeezing”. They thought If they messaged me about these stocks now, I might include them in my next update. \n\nAll it would take would be for me to include and mention one stock you may not have heard of and how it’s trending similar to GME to satisfy the shills. They didn’t have enough karma to post and even if they did, it’s more work to write DD than it is to slide certain stocks into the DM’s of DD writers. \n\n**Wait.**\n\nThis might just be the simplest of all techniques if you’re unsure about a new post - just wait. It’s as easy as Buy & Hold and requires no effort on your part. If something doesn’t seem right, don’t instantly upvote it because it fits satisfies that confirmation bias. Let others take a read and counter or confirm the DD.\n\n**There is no ape that has every wrinkle, but every wrinkle exists across all apes.**\n\nMuch L.00VE.",
    "title": "Mapping .00 Appearances to the FTD Cycle and Why Apes Need to be Cautious about Data",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o632ht/mapping_00_appearances_to_the_ftd_cycle_and_why/"
}