{
    "author": "tendieful",
    "created_utc": 1624374964.0,
    "distinguished": null,
    "edited": 1624376990.0,
    "id": "o5phuu",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o5phuu",
    "num_comments": 318,
    "permalink": "/r/Superstonk/comments/o5phuu/ryan_cohen_started_chewy_with_15m_in_investments/",
    "score": 11406,
    "selftext": "I have added commentary to the interview and bolded what I think are the important takeaways. If you want to read the un-adultured full interview you can find it [here.](https://www.forbes.com/sites/zackfriedman/2020/08/16/entrepreneur-chewy-founder-ryan-cohen-shares-his-best-advice/?sh=4c7b405d5840) I cut out the end part where he answers some questions about his dad. While very insightful information into the life of RC, I didn't feel like analyzing that particular part as it relates to investing.\n\nOver 7 years RC and Chewy raised around $350m in investments. He sold to PetSmart for 3.5bn. He has already raised [$550m](https://www.shacknews.com/article/124044/gamestop-gme-completes-550-million-secondary-stock-offering-shares-skyrocket) \\+ [1.126bn](https://finance.yahoo.com/news/gamestop-completes-market-equity-offering-104500035.html) = **$1.676bn** for GameStop\\*\\*.\\*\\* The difference is this isn't private money.  These monies were acquired by selling to long term devoted investors. He is starting off at GameStop in a significantly better capital position than he did at Chewy. GME **is and is not** a meme.\n\n>**Cohen** also served as **CEO** of **Chewy**, which **PetSmart acquired** in **2017** for **$3.35 billion**, which at the time was the **largest e-commerce acquisition ever**.  \n>  \n>**Zack Friedman:** Why did you see a need for Chewy that didn’t exist with Petco, PetSmart, Amazon and other online retailers?  \n>  \n>**Ryan Cohen:** I was going to the neighborhood pet store for my dog food but because I was busy building a business, I didn’t always have the time to make the trip. **I tried Amazon** and the big box retailers, but they were all **missing** the **specialized experience** and their **customer service sucked**. Try calling them.  \n>  \n>**With Chewy**, I combined the best from all of them. I saw an opportunity to differentiate from the pack and **convert fanatical pet parents, like myself, into die-hard customers.** Our customers got the **local pet store experience with the convenience of shopping online.**\n\nYou can see that RC really believes in what he does. It's a mentality like this why some people would say \"Invest in the man, not the company\". You see a similar aspect with someone like Elon Musk. Not to put anyone on a pedestal but many investors put a lot of blind faith into him because they believe in his vision. It's great when you get the combination of a great company and a visionary behind the wheel. It's the cherry on top of a sound investment. You can see he built the business because he identified a major flaw in the existing market and sought to remedy it with controversial and groundbreaking business ideas. Some of it was against the grain as he elaborates to further on. You can see a mirror premiss in his investment in GME.\n\n>I **focused on bringing a human element to e-commerce**. We provided **24/7 US-based** **customer service** and included **small touches** like **handwritten** holiday **cards** and personalized pet portraits. These were ways we could **connect with customers** and **build loyalty over time,** optimizing for a **lifetime relationship,** **not a single transaction**. Chewy’s **relationship with customers** was the **secret sauce**.\n\nThis is the main reason why Microsoft, and likely Sony, have commission based sales relationships with GameStop. Both companies have the ability to create decreased Customer Acquisition costs though GameStop vs Amazon or WalMart and create longer LifeTime Revenue and increase their Total Addressable Market. GameStop does have the largest digital magazine subscription in the world. Someone like Ryan Cohen will be able to capitalize on this aspect by focusing on Customer Service and Customer Experience. You can tell he as a huge inclination towards his customer loyalty. Another great article in the link at the top of this paragraph.\n\n>**Friedman:** You were **rejected by 100 different investors.** What did you learn from the process? **What made you keep going when you kept hearing no?**  \n>  \n>**Cohen:** For me, each no sounded like they just didn’t understand my vision. It was frustrating at times, but never discouraging. **Those “no”s never made me doubt my strategy** – it was the opposite. I was **motivated by** all the **rejections** and they just got me fired up.\n\nBuy and fucking hold. Don't worry about the noise.\n\n>Most investors couldn’t get past **two hurdles:** **competing head-on with Amazon** and the **pets.com failure** during the **dot com bubble.** But I was convinced being focused on the **pet category along with high-touch customer service** gave Chewy unique **competitive advantages.** **Pets.com** was a good idea but a **decade too soon** and without sufficient scale to **cover their costs.** These two hurdles didn’t scare me. **I never considered changing my business plan.** One highly respected venture capitalist told me he would be more interested if we were selling live pets over the internet rather than pet supplies. Like most investors, he believed running into Amazon’s teeth was suicidal.  \n>  \n>I understood that **thinking big** was likely going to be **misunderstood** along the way. I’m contrarian by nature, so **being misunderstood often validates** what I’m doing. It wasn’t until Chewy boxes were on doorsteps across the country that the bulk of **investors started to recognize** **our formula**.\n\nHow many times has Ryan and GameStop shown they have a hidden edge that no one expected? That sentiment will only continue to grow.\n\n&#x200B;\n\n>**Friedman:** Let’s talk about execution and scale. You’ve said that you used Zappos as a model. You also were inspired by **Jeff Bezos** and **Amazon’s growth** and **model**. How do you go from idea to platform to scale? What was the process and **how did you scale so quickly?**  \n>  \n>**Cohen:** In **just three months** we built a **website**, found a **distributor** and **partnered** with a third-party **logistics company.**\n\nWhat has GameStop done in the last three months? Raised almost 2bn in cash. Made a ton of new hires. Expanded their product offering. Completely changed their board. Increased revenues and online sales. Got rid of the drift wood, thank you for your service Sherman. Revamped their online presence. Sustained insane valuations compared to where they were last year.\n\n&#x200B;\n\n>In June of 2011 we launched. I focused on four pillars and we did them better than anyone else. We **started** with the **value proposition** of **delighting our customers**, which we did through **amazing customer service**, **low prices**, **fast shipping**, and **selection**. The onus was on us to create the most efficient supply chain to support that business model.\n\nThis is where we start getting into some more serious DD on RC's comments. Anyone who has ever worked for a multi billion dollar corporation recognizes what RC means when he starts talking about building pillars. Pillar systems are some of the most cliche corporate business strategy foundations that exist. What this tells me is this guy is familiar and *in the know* with running a multi-billion dollar company. He obviously has experience with Chewy but this jargon validates that he was actually doing something while he was there. Those who have been following along know that he has made a major shift towards delighting customers and offering a better value proposition. Anyone in the USA who has experienced the Door Dash same day delivery knows what I'm talking about.\n\n&#x200B;\n\n>When we **reached $200 million in sales**, we had to **insource fulfillment** to be able **scale** to the next level. We **opened** our **first two warehouses in 2014**. By **2018** we had **seven warehouses** around the country and **4.7 million square feet of space.** Each is the size of 13 football fields and four stories high.\n\nGameStop, like I just said is using DoorDash for fulfilment along with pickup in store. Covid is probably presenting a lot of challenges for this right now, and no doubt every industry is either going to adapt or die though these times. Maybe RC intends to insource this as well for GameStop. I also do not know what they currently do for warehousing and distribution but I would imagine this would be one of the first things RC would intent to overhaul if he saw fit. Will be curious to see if we can get any insight into these plans, if any. To give you reference 4.7 million square feet is about 3x3 city blocks or it would take about 6km by 6km of property to fit warehouses of that size. Roughly peaking. It's large though. So he is capable of managing logistics of a large scale. This is the scale of multi billion dollar operations. \n\nEdit: [A good spot to add u/thechaoschicken 's contribution about GameStop expanding their fulfillment capabilities with a new 700k+ sq.ft facility.](https://investor.gamestop.com/news-releases/news-release-details/gamestop-expands-fulfillment-network-new-facility-york)\n\n&#x200B;\n\n>I needed to **hire** the **best people** and **delegate** into their **areas of expertise**. Each employee we hired had a strong bias for action and were excited about the **opportunity to disrupt the pet industry.** We always hired for **will over skill.** One you can teach, the other you can’t. Everyone and everything revolved around being **customer obsessed.** We **scaled** from **3 employees** in **2011** to over **9000 Chewtopians** by **2018**.\n\nI specialize in labor management for large corporations. I also ran a small business with several employees. These are the fundamental aspects of managing people. You could literally be entirely unqualified in your field, as long as you delegate to qualified people and hire people based on their attitude vs their qualifications, then you will build a very strong culture and worker base. Most skills can be taught to most people, especially the motivated ones. But only the motivated ones can help you drive business forward. They will grow as much as you nurture them. One of my largest concerns with GameStop is that, judging by their subreddit, they have a ton of disgruntled employees. Sounds like they are often driven to quitting through unreasonable growth and sales expectations and competing with stores that manipulate figures. Among other problems. To see Ryan call his employees \"Chewtopians\" really signifies that he has a personal relationship with his workers. I would like to see that type of culture expanded in GameStop.\n\n&#x200B;\n\n>We **prioritized long term growth** **over short term profitability**. The last thing you want to be is a subscale e-commerce company. You’re a **dead man walking,** and **Amazon** will **crush you**. We **rapidly expanded our product offering** to include all pet food and supplies so there was never a reason to shop elsewhere.\n\nExpect the same thing with GME. Sustained growth. Long term investment. He knows what it takes to take on Amazon. We know this. We've seen it before in Chewy. Maybe Bezos will be smart enough to partner this time. Only time will tell. They have already expanded their product offering in the USA. Expect that to continue.\n\n&#x200B;\n\n>By **2018**, **90%** of our **revenue** was from **repeat customers**.\n\nThis is easier to achieve with something like pet food, but holy smokes that is an insane figure.\n\n&#x200B;\n\n>We raised **six rounds** of **financing** and more than **$350 million** over **seven years**. We grew sales from **$2 million** in **2011** to **$3.5 billion** by **2018**, a **190% annual growth rate**.\n\n190% ANNUAL growth? Jesus christ those kind of returns are practically unheard of on a continued basis.  Applying that to GME sends it to a trillion dollar valuation in less than 5 years. [Here's](https://www.youtube.com/watch?v=dB9ZerucuwQ) a video of Anne Hand, CEO of Super League Gaming talking about the potential market for the gaming industry.\n\n&#x200B;\n\n>**Friedman:** What’s the most misunderstood thing about entrepreneurship?  \n>  \n>**Cohen:** Don’t let the pictures or magazines mislead you, it’s not at all glamorous. Negotiating with vendors, reading long contracts, conducting nonstop interviews, convincing investors to give you money, combined with a constant stream of everyday problems, is not fun.  \n>  \n>The Type A in me is **competitive** and **loves to win**, but the day-to-day feels like you’re losing. If you think you’re winning you’re probably not doing a great job building your company. Even as our **sales** **grew** into the **billions**, I always felt behind. Whether that’s the right mentality or not, that’s how I’m wired.  \n>  \n>**Friedman:** What are three pieces of advice you would give to an aspiring entrepreneur?  \n>  \n>**Cohen:**  \n>  \n>I’d be remiss to say my way is the ‘right’ way. It’s simply **what worked for me.** My dad had a glassware importing business, and he told me about how he was talking with his dad one day. His dad had pointed at two trucks. “You see those trucks there?” he’d said. “If what’s in one of those trucks will make you more money, and what’s in the other truck will make your **customers happier**, choose the one that makes your **customers happier,** even if you make less money.” That served as the guiding premise for Chewy.  \n>  \n>Second, I was **never afraid to say no.** I was constantly bombarded with new ideas, and when you’re growing quickly it’s critical to stay focused, **so I said no to almost everything.** There’s a time and place for ideation, but in the early days when resources are finite, it’s important to choose a handful of things and do them extremely well.\n\nThis just provides some insight into his business strategy. Out of the box thinking can be a great thing, so don't be worried if you see some un-orthodox moves come from RC.\n\n&#x200B;\n\n>Third, my **biggest risk** would have been **not taking risk**. The risk of going **head-to-head** against **Amazon.** The risk of **insourcing fulfillment**. The risk of building a company in **Florida rather** than a **popular tech hub**. The risk of **spending $3 million a month on TV ads,** more than Home Depot [HD](https://www.forbes.com/companies/home-depot) [\\+1.6%](https://www.forbes.com/companies/home-depot)'s budget. The risk of **hiring expensive executives** even though we **weren’t profitable.** These decisions were some of the most **controversial** and required me being **comfortable betting against conventional wisdom**, and were often **contrary** to the **advice of my board**. Suffice it to say, I was not the most popular board member.\n\nThis is basically where I stopped analyzing the interview. Like i said, he goes on to answer some questions about his dad. Which I believe lend a lot of insight into his personality and life but I didn't really feel comfortable commenting on it. I have no doubt his dad would be pretty proud of what he is doing now. As a father myself I would be completely blown away if my kids were doing what he's doing. Based on what RC says here I believe you can get a feel for what to expect next. TV/Social Media ads are probably coming. So much meme potential for them. Hiring expensive execs has already started. If anyone could share the DD on that I would love to link it here. The next piece of the puzzle will be what they plan to do with the over 1bn in cash on their books right now. Expecting some type of acquisition or major business expansion.\n\nTl;Dr: You guys really need to put more blind faith into this guy",
    "title": "Ryan Cohen Started Chewy with $15m in Investments. He is Starting Off at GME with $1bn. This Interview is the Only DD I Need. Possible Blue Prints for GME?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5phuu/ryan_cohen_started_chewy_with_15m_in_investments/"
}