{
    "author": "Calluma93",
    "created_utc": 1617697555.0,
    "distinguished": null,
    "edited": false,
    "id": "ml6xy0",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion 🦍",
    "name": "t3_ml6xy0",
    "num_comments": 230,
    "permalink": "/r/GME/comments/ml6xy0/elia_the_everything_short_gme_and_the_potential/",
    "score": 2006,
    "selftext": "I wrote a (not so) quick summary of what was uncovered in the fantastic Everything Short DD by u/atobitt\n and how it relates to GME and the market at large.\n\nSorry, I'll try to be concise but please let me know if I'm wrong/can explain better.\n\nThe market has enjoyed the longest bull period in history, since the bottom of the 2008 collapse to now, this means everyone has been making a lot of money going long on anything, APPL, TSLA, FB, whatever.\n\nThis has meant most people are taking the riskier route of putting their money into the stock market since it's easy money. That means they're not investing in safer options, like Treasury Bonds.\n\nThen Covid hits and crashes the market massively. The previous president was very wrapped up in market numbers and, to put it politely, tactically inept when it comes to long term fiscal policy.\n\nSo rather than let the market sort itself out as nature intended, his policy was to reduce interest rates and start a massive quantitative easing program. Basically he made it super easy for banks and businesses to get cash to weather the storm.\n\nNow this money printing should cause inflation since there is more dollars in existence. But since these new dollars were mostly going to businesses, and the cash that went to poor people was used mostly to pay debts and such, the dollars weren't really hitting the economy. And all the well off people who received stimulus money but didn't really need it put it straight into the stock market since it was doing so well.\n\nSo there should've been inflation in the economy but it ended up being contained in the stock market. If you look at the SPY you can see the huge dip in March and then a massive spike to higher than were it would've been if the pandemic never happened.\n\nThis is the inflation.\n\nNow enter Citadel and friends. They've just been handed blank checks to borrow as much money as they like and pay no interest on it. Perfect, zero interest loans are great.\n\nThey use this new wealth of liquidity to do their favourite new trick; naked short sell failing companies into bankruptcy, and take the massive profits.\n\nThis goes well for them and since it worked so well in the past they become more bold. They see a sure thing in GME and short many more times the number of shares that exist cause they Gamestop will never recover from an attack like that. But uhoh Ryan Cohen steps in and turns the business around and now they are well and truly fucked. They need to return the massive amounts of borrowed shares but can't get them.\n\nSome day soon something will happen and this will unwind and cost them more money than they can stomach and they will go bankrupt. Poetic justice and rightly deserved.\n\nIn an ideal world this would be the end of it, they got greedy and paid with their company.\n\nBut they are just way more greedy than anyone could have imagined, enter what was just revealed in the Everything Short DD.\n\nSo basically rehypothecation is using what someone owes you as collateral for a loan you take out. So if I loan you £5k to buy a car then the collateral is the car that I keep if you don't pay. But I go to someone else and say I want a £5k loan, I don't have any collateral but I do have this car can I use that? And wildly they say yes. This is fine as long as nobody defaults, but if I do then the chain is broken cause suddenly the guy has no way to get the car from you and is out of luck.\n\nNow the car in this situation is Treasury Bonds. They \"borrow\" a bond from someone and short sell it, just like what they've been doing with GME. The lender still owns the bond cause they expect to get it back. But the bond is used as collateral in a different loan, even though it doesn't actually exist.\n\nAnd this chain just keeps going and going where people keep using this same non-existent bond as collateral for a loan, and everyone is cool with it cause cash is so abundant right now they can't give it away.\n\nBut now GME isn't a sure thing and it's looking like Citadel is going to get fucked when they get margin called to buy back all these GME shares they created out of thin air.\n\nIt will almost certainly bankrupt them, thus destroying a link in the rehypothecation chain and the whole thing will come crashing down.\n\nEveryone will be looking for these bonds that Citadel promised they could have in the unlikely scenario where they go bankrupt, but surprise surprise, they never existed and 7 people all want this one fake bond to get their money back.\n\nSuddenly trillions of dollars in promised collateral is deleted, along with more trillions of dollars in necessary compensation for us GME apes, there's a realistic chance that there isn't enough liquidity in the market to pay off all these losses.\n\nNow the government is in a tricky spot cause if they don't pay out, the entire world sees the US markets as an unsafe bet and pulls their money out, killing the already wrecked economy.\n\nOr they can turn on the money printer that's already been running at dangerously high levels all year, and inflation will explode like Michael Burry is predicting and the dollar will become worthless.\n\nAnd since the dollar is the world reserve currency it will ruin economies around the world.\n\nAll because Citadel weren't making enough money.\n\nThis may look a bit worrying but just because the dominoes have been set up like this, doesn't mean they will definitely fall in this way. Hopefully there is work being done to take them down slowly and there are ways of destroying money through debt as a way to counteract the creation of money, so not all is lost.\n\nBut I think its very important to know that these greedy institutions have brought us to the brink yet again for the third time in my lifetime and they can't keep getting away with it.",
    "title": "ELIA The Everything Short, GME, and the Potential Market Crash",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/ml6xy0/elia_the_everything_short_gme_and_the_potential/"
}