{
    "author": "downbad99",
    "created_utc": 1620507386.0,
    "distinguished": null,
    "edited": false,
    "id": "n7yb71",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_n7yb71",
    "num_comments": 122,
    "permalink": "/r/GME/comments/n7yb71/when_ryan_cohen_makes_his_transformation_we_need/",
    "score": 1399,
    "selftext": "Apes, I urge you to take a look at /r/GameStop . It’s full of first hand accounts, detailing what it’s like to work for this company all of us are so passionate about.\n\nTake a moment to step away from all of the dreams you hold about what you’ll do with your millions once the MOASS happens, and think about the people who are making it possible. The people working for this company who put in effort every day to make it better.\n\nThese people are just like us. Unlike the shorters at Shitadel and Melvin, we know what it’s like working difficult jobs to get by. The GameStop employees are fellow apes, and as the company transforms and the MOASS happens, and we become lifelong GameStop customers, please, treat them with kindness.\n\nJust from a brief look at /r/gamestop , it doesn’t seem fun. Long hours, working an entire shift alone, dealing with bureaucratic middle management, not the greatest pay. With RC and the MOASS, GME has the opportunity to show love to the little guys making the wheels on this machine keep turning. Once this is all over, GME should be a place people are dreaming of working at, with generous pay and benefits.\n\nDon’t forget to take care of the little guys.\n\nTL;DR:\nWorking at gamestop is not the most glamorous position in the world. With the transition by Ryan Cohen, I hope he will make and effort to improve conditions for employees and make GameStop a great place for both customers and employees.",
    "title": "When Ryan Cohen makes his transformation, we need to ensure better conditions for GME employees",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/n7yb71/when_ryan_cohen_makes_his_transformation_we_need/"
}