{
    "author": "RobinGoods",
    "created_utc": 1623020159.0,
    "distinguished": null,
    "edited": 1623022451.0,
    "id": "ntxyjw",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ntxyjw",
    "num_comments": 73,
    "permalink": "/r/Superstonk/comments/ntxyjw/stop_calling_them_meme_stocks_they_are_momentum/",
    "score": 736,
    "selftext": "Ug I don’t know what more there is to say here, it’s all in the title, but I need to add text here because I need at least 250 characters due to sub rules, well here goes \n\nA momentum stock is a stock that is so manipulated is it’s not behaving off fundamentals, that is a very clear sign that parts in the system aren’t working right this is some thing that average folk understands but as soon as we call them meme stocks it doesn’t help us or get the normal folk to think about it behold it being a meme by us labeling it as such\n\n\nHow many of your friends rolled their eyes, thought it was dead issue/already squeezed or you just knew that they didn’t know what was really going on, so we had to fuck their wife’s. Probably all of us. we need to work on our branding. Once we get better branding we get more people understanding our movement and this will put the political pressures for legislation reform. I want to hear this issue being addressed by the President of the United States\n\nif occupy Wall Street protests and the 2008 crisis wasn’t enough to get the reform we needed in place we’re gonna need better branding and more public face speaker heads for this movement. \n\nIf the SEC makes money every time these hedge funds commit crimes instead of making them serve jail time they are corrupt. The SEC shouldn’t be incentives to make money off fines, they should be held accountable for fairness and law and order. The SEC isn’t blind to these issues, they profit off them.\n\nThe DTCC cannot be a self regulated  institution. No foxes allowed in the henhouse\n\nWe need to work on branding!\n\nEdit: movement stocks are also a good name\n\nEdit2: wanna make it clear not fin advice, I personal just like the stock, that being said, if you own GME or not their is a systemic issue.",
    "title": "Stop calling them “meme” stocks. They are momentum stocks. When the media calls them “meme stocks” it comes with a negative connotation and the average folk take it for just that.. a meme. We are a movement for financial reform. Let’s get better at our branding to get the legislative reform we need",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/ntxyjw/stop_calling_them_meme_stocks_they_are_momentum/"
}