{
    "author": "WingzTTV",
    "created_utc": 1626838245.0,
    "distinguished": null,
    "edited": false,
    "id": "oohuzq",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oohuzq",
    "num_comments": 185,
    "permalink": "/r/Superstonk/comments/oohuzq/i_have_a_feeling_this_is_what_pg13/",
    "score": 2062,
    "selftext": "I hope everyone had a wonderful day today! By no means am I a wrinkled brain, I only see connections that could potentially give the community hype!   \n\n\nSo to begin, [NSCC-2021-002](https://www.sec.gov/rules/sro/nscc/2021/34-92213.pdf), is the rule set that \"Automates the Margin Call Process.\"  How this rule is getting put to use is something called [Supplemental Liquidity Deposits](https://www.investopedia.com/terms/s/supplemental-liquidity-provider.asp). (Click for an Investopedia Link.)  \n\n\n#  Current Rules Relating to Supplemental Liquidity Deposits \n\n>**Currently, NSCC only collects supplemental liquidity deposits during monthly**  \n>  \n>**options expiry periods in order to cover the heightened liquidity exposure resulting from**  \n>  \n>**increased trading activity around options expiration.**\n\n#  Proposed Changes to the Rules Relating to Supplemental Liquidity Deposits \n\n>As discussed above, NSCC may only collect supplemental liquidity deposits  \n>  \n>during monthly options expiry periods under its current Rules.  \n>  \n>  \n>  \n>**However, NSCC can face sudden** [liquidity shortfalls](https://www.investopedia.com/terms/s/shortfall.asp) **on any business day, not just those business days that fall within monthly options expiry periods, particularly during volatile market conditions unrelated to options expiration.**  \n>  \n>  \nTo address this issue, NSCC proposes to change the  \n>  \n>frequency at which it may collect supplemental liquidity deposits to each business day,  \n>  \n>based on a daily calculation. This proposed approach to collecting supplemental liquidity  \n>  \n>deposits should allow NSCC to respond quickly to any sudden liquidity shortfalls arising  \n>  \n>from a Provider’s activity, regardless of when those shortfalls occur.\n\n  \nTo add on to that, the Top 30 Providers of the NSCC that qualified from 2016-2020, will be a part of the \"new\" SLP.  (links up to that liquidity test that recently happened and only tested for finances from October 2020 and before.)  \n\n\nNow you must be wondering on how this relates to anything in the title, well take a look at this.  \n\n\nhttps://preview.redd.it/0gam0shvihc71.png?width=735&format=png&auto=webp&s=254250f27a0265ec501043feae982fc8a3ba8582\n\nIf my speculation is correct, the 30 days for NSCCs holdings started July 20th, which is when MoonJam started. 30 days later . . . is when MoonJam ends. (August 20th)\n\nhttps://preview.redd.it/kf47f3t1ehc71.jpg?width=1920&format=pjpg&auto=webp&s=30ec2a0f561e4b6a97c47ef6190424ad5f862e31\n\nhttps://preview.redd.it/rka63d47jhc71.png?width=537&format=png&auto=webp&s=5307c6ed4e5a1c59e7c7d573a6da186c7ab911e3\n\n# The kicker to seal my speculation? The \"30 calendar day holding period\" is also on Page 13.\n\n# TLDR; BUCKLE THE FUCK UP APES",
    "title": "I have a feeling THIS . . . is what PG-13. 🚀🚀🚀",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/Superstonk/comments/oohuzq/i_have_a_feeling_this_is_what_pg13/"
}