{
    "author": "Stonkinator3000",
    "created_utc": 1626817807.0,
    "distinguished": null,
    "edited": false,
    "id": "oobz5x",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oobz5x",
    "num_comments": 53,
    "permalink": "/r/Superstonk/comments/oobz5x/msm_narrative_that_yesterdays_market_drop_was/",
    "score": 1265,
    "selftext": "How this relates to GME is that of course we need the market to crash in order to push the portfolios of shfs into the danger zone where their long positions are no longer worth enough to meet margin requirements against their short positions.\n\nThis is putting all the major players in a jam since they need to get out of their long positions before the mother of all crashes but can’t get out of them too quickly or everything will snowball due to that tremendous pressure on the portfolios of anyone short GME. In my opinion this is why the market has kept pumping to ungodly highs. Turns out all those major players are less competitors than they are part of a cartel, a cartel in which retail is completely excluded.\n\nEnter the absurd premises for large market drops spread by MSM. We’ll probably see many more of them in the coming days and weeks after huge red days. We’ve got to remember that most retail investors watch mainstream media and more or less believe the general narratives presented there. MSM’s trick will be to leave easily discoverable Easter eggs, like the covid variant fear story yesterday, to compel these retail investors to buy the ‘dip’ of their own accord and thus slowly but surely trade places with institutional investors and become the biggest bag holders in modern history.",
    "title": "MSM narrative that yesterday’s market drop was covid fears was actually pretty clever bc it made dumb money feel clever in thinking “meh, covid fears overblown. I’ll buy the dip” Institutions are in process of slowly making retail bag holders, and expect many more dead cat bounces before implosion.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oobz5x/msm_narrative_that_yesterdays_market_drop_was/"
}