{
    "author": "thegreatself",
    "created_utc": 1622156202.0,
    "distinguished": null,
    "edited": false,
    "id": "nmjxfs",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nmjxfs",
    "num_comments": 224,
    "permalink": "/r/Superstonk/comments/nmjxfs/one_of_the_harder_parts_of_holding_for_me_has/",
    "score": 3503,
    "selftext": "Although I don't believe it literally, I think there's some truth to be found in the saying \"*If you want to make God laugh, tell him your plans*.\"\n\nI have a pretty small social circle (it's more of a dot) anyway so while my girlfriend and parents both know I've invested *some* money (read: YOLO'd) in the stock-market that's about as much as they know - my girlfriend saw my proxy voting materials and saw that they were for GameStop but she's still about as clueless to trading and the market as I was just a few months ago and actually basically still am.\n\nSo she's been having a really hard week at work and texted me today that she feels especially exhausted, overwhelmed, and is starting to hate her job (so, typical wage-slavery) - a job she *just* started that was supposed to be a huge improvement in nearly every area over her last one and related to the field she's interested in.\n\nI so desperately want to be able to tell her to stop worrying, that we're going to have a fuckton of money soon but really I can't make that promise because I don't actually know that for certain, as convinced as I am personally. I'm *pretty sure* but I still can't make that leap to bring her hopes into my gamble.\n\nFor similar reasons I've never tried to convince anybody else I know to 'buy-in', although I can already predict some future \"If you knew why didn't you let me know so I could be rich too?\" situations and the answer is pretty simple - I don't want to be held personally responsible for someone potentially *losing* a lot of money, whether by paper-handing during a dip or selling too early on the way up and having to live with an insane amount of lost profit. As much as I love this community I can also see how from an outside perspective it initially seems to share some characteristics with very insular conspiratorial communities but for me personally, that doesn't matter because I like the stock and I like /r/Superstonk. \n\nThis particular 'conspiracy' just happens to be 100% true and yes, they do all say that but again, doesn't matter - time will almost always reveal what is true and what isn't.\n\nI missed the buttcoin train years ago but I was lucky enough to not be too late for this rocket - I just hope as many other people catch a ride as they can *without* me having to convince them or proselytize. \n\nTo those of you who have talked your friends and family into Ape-hood good work - I know they will appreciate you later - it's still not something I can bring myself to do.",
    "title": "One of the harder parts of holding for me has been purposefully not talking with a single soul in \"real-life\" about it",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nmjxfs/one_of_the_harder_parts_of_holding_for_me_has/"
}