{
    "author": "fatedMercy",
    "created_utc": 1613951593.0,
    "distinguished": null,
    "edited": false,
    "id": "lpa0s3",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_lpa0s3",
    "num_comments": 320,
    "permalink": "/r/GME/comments/lpa0s3/plotkin_and_griffin_accidentally_showed_us_their/",
    "score": 2862,
    "selftext": "\nPlotkin’s written testimony had a part that stuck out to me, and it finally clicked. Along with GameStop, he mentioned having positions in AutoZone and Expedia. \n\nFor a supposed brilliant investor, “one of the best money managers of his time” as Griffin put it, why would those holdings be something to brag about?\n\nThey’re not. \n\nIn actuality, he’s just accidentally admitting that he “covered” his GME positions by focusing his attention on XRT. How would he effectively help manipulate the price of GME while using XRT? By holding long positions in other companies that XRT contains. Like, say, AutoZone and Expedia. \n\n\nGriffin told us something very important also. \n\nWe couldn’t figure out how they effectively traded volume back and forth to short on such low volume without buying countering it. Even though on many of these days, the buy/sell ratio was well above 50%, some days as high as 65-75%. \n\nIf someone has a link to the exact part, I’ll edit my post to include it. But Griffin talks about trading to a whole cent. \n\nRetail only has the ability to trade in whole cents. $10.00 or $10.01. HF’s and MM’s have the ability to trade to the 3rd decimal point. \n\nGriffin kept dodging the questions about trade executions, and here’s why. They can trade amongst each other at $10.005, $10.015, and they know who they are trading with. \n\n\nSIR, I THINK WE’VE GOT ‘EM\n\n\nFriday close: [3rd decimal point](https://ibb.co/Jz7M4zQ)\n\n[Plotkin’s written testimony ](https://docs.house.gov/meetings/BA/BA00/20210218/111207/HHRG-117-BA00-Wstate-PlotkinG-20210218.pdf)",
    "title": "Plotkin and Griffin accidentally showed us their cards in the hearing 🃏🃏🃏",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lpa0s3/plotkin_and_griffin_accidentally_showed_us_their/"
}