{
    "author": "Regardskiki71",
    "created_utc": 1627837547.0,
    "distinguished": null,
    "edited": 1627860480.0,
    "id": "ovvy5h",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_ovvy5h",
    "num_comments": 206,
    "permalink": "/r/GMEJungle/comments/ovvy5h/posting_this_here_i_made_it_to_page_2_of_the/",
    "score": 2297,
    "selftext": "\n…holy f. They basically have already thrown their prime brokerage under the bus. Nevermind that bonuses across banks are pegged to how much business you make not how much money you theiretically save from risk so the business model literally sets up this way of people looking the other way. “The Archegos matter directly calls into question the competence of the business and risk personnel who had all of the information nevessary to appreciate the magnitude and urgency of Archegos risks but failed to take decisive and urgent action to address them” (pretty sure that is the Stanley Tucci role in Margin Call)\n\nNow stop for a second and consider this is one ego mad, high flying, risk taking tiger cub at one bank. You think Bill Hwang was the only risk taker out there? You think he has Gabe Plotkin beat? Gabe must make Bill look like a toe the line nerd in comparison if Steve Cohen gave him cold hard cash sold to the world as as a heartwarming gesture of kouhmbayah love from one fund manager to another in a time of duress. \n\nIt also reminds us that people in finance are greedy humans. BUT THEY ARE JUST HUMANS. When Gabe told Congress at the hearing “our systems wouldnt even allow us to do that” he is literally referencibg the same systems that Credit Suisse is telling us their prime brokerage had to….TO NO AVAIL..because no man made system can keep a greedy man from trying to find a way around it. \n\nI still have 172 pages to go before the Gamestop mention and I can already tell you hedgies are fuk’d \n\nHOLD THE LINE!! 🚀🚀🚀\n\nEDIT 1:  Omg. Quote on page 4: “CS continued to do business with Archegos both during and after these criminal and regulatory matters” 😂😂\n\nI wonder if Bill Hwang ever had to take piss tests like anyone else would\n\nEDIT 2: after a “reputational review” “Prime Services advocated maintaining Archegos as a client based on its strong market performance and “best in class” infrastructure and compliance…and shrugged off the settlements, guilty pleas, and trading ban as isolated incidents”\n\n[report here at credit suisse](https://www.credit-suisse.com/about-us/en/reports-research/archegos-info-kit.html)\n\nEdit 3: I worked at a hedge fund. I was basically jack of all trades office manager/investor relations and helped our CFO so I interacted with our prime broker every day. Multiple times a day. They balance your fund every day. The cfo’s whole job is basically mAnaging the prime broker. These are very close relationships. The people at the prime broker I dealt with were just like me: in their twenties being paid okay but not well for nyc area and way overworked. I also worked as a writer in finance writing industry news and we would have to write about prime brokers or risk management firms because those guys wanted their names in front of managers whenever possible. In all these situations it is a business like any other. Everyone is low man on the totem pole until they are not. And by the time you are not you have been built into a machine that knows how to NOT rock the boat and to collect your dues. No wonder crashes can be counted on to happen cyclically.\n\nEdit 4: “Over the next several years Archegos would periodically exceed the 75% threshold [get margin called]. Each time however, CS would grant Archegos a grace period - SOMETIMES AS LONG AS FIVE MONTHS” (pg 8)\n\nEdit 5:  “The contractual protections CS had negotiated with Archegos were illusory as the business appears to have had no intention of invoking them for fear of alienating the client” 🤯\n\nEdit 6: the more i read this the more I think margin calls have been an ongoing negotiation between funds and prime brokers over gme all year. This on page 12 “By August 2020 Archegos PE had increased significantly to just under $530m (against a $20m limit). Because PE limit breaches are intended to be rare and consequential events Archegos was included on a list of PE offenderS” [me note that is plural. OffenderS] “Archegos was in material breach of its PE limit and included on those lists FOR MUCH OF 2020”\n\nEdit 7: Archegos was in breach of scenario limits which should have meant margin calls virtually every week from July 2020 until it defaulted in March 2021. (Pg 12)\n\nIm mainly putting these in here so we can all see Margin Calls are not just a call out of the blue. Its negotiating and bullying and threatening to pull business and it takes someone w balls to finally pull the plug….or just there is no more money. They are coming. This is literally a whole report saying hold hold hold apes!\n\nEdit 8: imagine how much money you could make apes with this much leverage and this much coddling and ass kissing:  “With PE more than 25 times the $20 million limit and the severe scenario exposure nearly three and a half times the limit, the business urged that Archegos not be evaluated on the “Severe Equity Crash” scenario that CS historically had employed, but rather on a more forgiving “Bad Week” scenario.”\n\nEdit 9: this is interesting to me because this is moving things around globally which, i know has been on our mind this week. Also to show the crazy lengths to which prime brokerages (complicit in fund managers’ bad behavior) work to prop managers up. “In the fall of 2020, the business and Risk were focused on migrating Archegos’s swaps from one CS U.K. entity (Credit Suisse Securities (Europe) Ltd. or “CSSEL”) to another (Credit Suisse International or “CSi”). This was part of a broader effort to wind down CSSEL, but also moved Archegos to an entity (CSi) that had a higher stress scenario appetite at a time when Archegos was substantially in breach of the scenario.” (Pg 16)\n\nEdit 10: HOLY SHIT AT ONE POINT CS WAS POSTING MARGIN BacK to ARCHEGOS on certain positions while on others archegos was still over their limits “Archegos was still in breach of both PE and scenario limits, but over the course of that month both numbers began to creep downward. Nevertheless, Archegos’s swap margins remained depressed (an average of 6.9%) because PSR made no effort to renegotiate the static margin on old trades. Further, because Archegos’s positions had appreciated in value, CS actually had to post nearly $1.13 billion in variation margin to Archegos between October and December 2020. “\n\nEdit 11: I wonder if this could be indicative of GME holdings\n\n“In January 2021, in connection with its 2020 annual credit review, CRM downgraded Archegos’s credit rating from BB- to B+, which put Archegos in the bottom- third of CS’s hedge fund counterparties by rating. CRM noted that, while in prior years Archegos had estimated that its portfolio could be liquidated within a few days, Archegos now estimated that it would take “between two weeks and one month” to liquidate its full portfolio”\n\nEdit 12: someone in comments below recommends this fantastic post ftom 53 days ago that i somehow missed. [prime brokerage fukery post ](https://www.reddit.com/r/Superstonk/comments/nvbsip/theory_hedgies_have_not_defaulted_and_seen_their/?utm_source=share&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;utm_medium=ios_app&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;utm_name=iossmf)\n\nEdit 13: remember how i said margin calls are negotiations and dick measuring contests? (Ok i just added that second part now lol) pg 19 “Ultimately, the business asked Archegos for $750 million in additional initial margin. While Archegos refused to post the amount requested, it did agree to post $500 million in additional margin, largely by converting excess margin it currently held at CS”\nTHEY REFUSED. LOLOLOL.\n\nEdit 14: Apparently if your broker is between a rock and a hard place you really dont have to pick up the call. Your memes are all on point. “The business continued to chase Archegos on the dynamic margining proposal to no avail; indeed, the business scheduled three follow-up calls in the five business days before Archegos’s default, all of which Archegos cancelled at the last minute. Moreover, during the several weeks that Archegos was “considering” this dynamic margining proposal, it began calling the excess variation margin it had historically maintained with CS. Between March 11 and March 19, and despite the fact that the dynamic margining proposal sent to Archegos was being ignored, CS paid Archegos a total of $2.4 billion—all of which was approved by PSR and CRM.”\n\nEdit 15: i know people have tracked graphs of the portfolio to see how gme fits in. Specific to Archegos’ demise during this week I find this interesting. Gme price during this march week closed at $194.49, $181.75, 120.34, 183.75, 181.00\n“During the week of March 22nd, the value of these positions began to fall precipitously. Archegos’s single largest position, ViacomCBS, dropped 6.7% on March 22 and continued to fall in the days that followed. On March 23, Archegos had over $600 million of excess margin remaining at CS but, by the next day, that excess margin was wiped out by market movements and Archegos owed CS more than $175 million of additional variation margin, which CS called, and Archegos paid. That same day, March 24, while the ViacomCBS stock price continued to fall, another of Archegos’s significant long positions, Tencent Music Entertainment Group, plummeted 20%. CS determined that it would be making a $2.7 billion call for variation margin the next day. Given the size of that call, the matter was escalated to the Co-Heads of Prime Services and the Head of Equities, who scheduled a call with Archegos for that evening to inform it of the upcoming margin call. Archegos’s COO informed CS that Archegos no longer had the liquidity to meet either CS’s or any of its other prime brokers’ margin calls on the following day. That evening, CS’s IB CEO and Group CHief risk officer were informed about the Archegos situation; it was the first time that either recalled hearing about Archegos.”\n\nEdit 16: bahahaha the poor swiss. “On the morning of March 25, 2021, CS issued two margin calls—one for Prime Brokerage and one for Prime Financing—that together totaled over $2.8 billion. That day, Archegos reiterated that its cash reserves had been exhausted by margin calls from other prime brokers earlier in the week.” DOH.\n\nEdit 17:  no wonder these dudes all act like spoiled brats. They literally live by different rules “difficult conversations” ROFL the tail wagging the dog here. AND LET ME REMIND YOU THIS IS JUST ONE FUND MANAGER. “Third, the business refused to engage in difficult conversations with Archegos or to exercise its contractual rights—for example, the right to call additional margin as necessary on three-days’ notice. Throughout 2020 and 2021, the business was focused on pursuing only those terms it believed Archegos would accept to avoid losing Archegos’s business, and not on securing terms CS should demand from a contractual counterparty posing the type of elevated risk presented by Archegos.”\n\nEdit 18: attests to my totem pole analogy: “Further, despite the fact CRM employees sounded the alarm as to the inadequacy of Archegos’s swap margins given CS’s PE and scenario exposure, more senior Risk employees did not support their more junior colleagues’ efforts with any urgency and instead allowed the business (particularly PSR) to pursue an accommodative approach of partial and inadequate remediation without deadlines.”\n\nEdit 19: if there is a doubt in your mind that it cannot happen again or that surely bank prime brokerages have filled in the gaps I give you page 30 in which they discuss the fact that a similar issue (not as much leverage but way less reward for the risk taken by the bank) was still being unwound and remediated because CS had let Malachite Capital default in March 2020. So they had literally just watched things go bad with another, smaller fund (not in prime brokerage but in equity derivatives) and had cost CS $214million in losses when it had only brought them $6.9m in gains. Lolol.\n\nEdit 20: Not all margin requirements are dynamic (WTAF) “Prime Brokerage’s Prime Margin system allows users to establish and modify dynamic margin rules as agreed with a particular client, with the goal of margining overall portfolio risk… But some clients negotiate bespoke dynamic margining rules to govern their Prime Brokerage portfolios.”\n\nEdit 21: pages 43 and 44 and swaps and bullet swaps and managers doing all sorts of acrobatics to get long term tax benefits and how a huge bank with supposedly WHOLE SYSTEMS (as Gabe Plotkin likes to point out) cannot keep up. So in fact this is all i need to read to see plainly, Gabe, that your “systems” (which I know are not built in your office that holds only a single printer but in which you are referencing your almighty back office prime broker) DO ALLOW FOR FUKERY\n\nEdit 21: how you think they currently doing as bag holders for whomever else when there is also this fact: “Risk was not immune from the cost-cutting measures; we understand that from 2019 through Archegos’s default, roughly 40% of managing directors in Risk departed CS (the majority of these departures were involuntary) and were replaced in large measure by existing CS directors who were promoted to managing director,…Specifically, in Prime Services Americas, the total headcount decreased 44%, with managing director and director head counts decreasing by 54% and 33%, respectively, over this time period. In Prime Services EMEA,34 the total headcount decrease was 39%, with managing director and director head counts decreasing by 23% and 43%, respectively. In addition, and with particular relevance to Archegos, the number of traders on the U.S. Delta One flow trading desk was reduced from six to three in 2019.\nAt the same time, CS did not reduce the size and breadth of the Prime Services business: indeed, senior management was focused on increasing revenue. As a result, the significantly smaller Prime Services team struggled to handle more work with less resources and less experience.”\n\nEdit 22: lest you allow steve cohen’s “trading is a rough game isnt it?” Mess with your head…big banks are just filled with human beings. And I give you this from page 51 (basically in any job you have right now imagine your boss being in charge of billions rather than just widgets) “all events, neither of the Co-Heads of Prime Services believed he was specifically responsible for supervising CS’s relationship with Prime Financing clients in the United States—including Archegos. Indeed, neither claimed any particular familiarity with Archegos (including its persistent limit breaches) before the default, notwithstanding that Archegos was among Prime Services’ top 10 clients throughout the period, ultimately becoming its third largest hedge fund counterparty by gross exposure before its default.”  Hello. Im just here to collect my bonus and possibly screw an admin from the Bronx w Daddy issues (okay I may be revealing too much of my own life experience there lolol)\n\nEdit 23: JFC (and this is THEIR report so it has been scrubbed literally as best they legally can lol) “However, the overall arrangement, including the liquidity constraints, was never memorialized in any formal contract (although it was specifically agreed in email by Archegos), and it appears that these constraints were never invoked or implemented by Prime Services as particular Archegos swap positions grew to exceed 2 days’ (and even 5 days’) DTV over the years.” Pg 71 discussing the insane back and forth on margin requirements SINCE 2018 when archegos was +40% but ended the year -36% lol\n\nEdit 24: the poor head of psr died in an accident in feb 2020 and they literally bring that up every 5 pages as though development and succession planning arent supposed to be one of these muraculous “systems to mitigate risk” that gabe likes to referemce. CS literally says they had flagged Archegos because of Key Man risk (relying on one person for most of your investing genius) and now they are saying look guys our head of PSR died and so things were kinda in dissarray. Your a bank mofos. You are literally THE RISK MANAGEMENT ARM OF A BANK.\n\nWe say all the time they are dealing with apes that they dont know how to handle people this daft as to buy and hold? Well really its that they we are up against people with no morals and infinite greed and in the end that never wins (see: every scifi story ever written)\n\nEdit 25: is this potentially when gme entered their portfolio? “Indeed, there was only one week—the week ending March 20, 2020—right after Archegos added significant short positions—in which Archegos’s portfolio was not long- leaning, as illustrated in the chart below. The long-bias of Archegos’s portfolio increased the counterparty risk associated with Archegos.” Page 75\n\nEdit 26: i may get to buy more next paycheck…” On July 15, 2020, Archegos had $604 million in net scenario exposure—241.6% of the $250 million limit.81 From that point on, Archegos remained in breach of its net scenario limits virtually every single week for the remainder of its relationship with CS.” Makes me think of the [rubberbands around watermelon guy](https://youtu.be/azA_zYYYy7I)\n\nEdit 27: you think succession planning is hard? summer vacations are a motherf*cker. Lol. “On July 22, 2020, the CRM Exposure Monitor reflected Archegos’s net scenario exposure as $828 million (over 330% of the $250 million limit). In response, the CRM analyst covering Archegos emailed his PSR counterpart, asking how the scenario exposure could be remediated and whether PSR was comfortable with the exposure. PSR responded that the stress exposure was “primarily driven from the pure directional footprint,” and that PSR was contemplating approaching Archegos with a new margining model that would scale “Tier 1 base swap [margin] and adjust to control for Bias should the book materially deviate from neutrality.”…\nCRM did not respond until August 10, 2020. CRM stated that the PSR proposal was “sensible” and would yield “more margin” for CS, and asked if the proposal could be put in place. PSR does not appear to have responded, and the proposed tiered margining model was never implemented.\nMeanwhile, Archegos’s scenario exposure continued to grow. By August 12, 2020, the net scenario exposure had grown to $846.6 million. On August 18, CRM emailed PSR to discuss a remediation plan that would reduce exposure.”\n\nEdit 28: it appears we are in a completely fraudulent system. “Archegos could not expand its long positions at existing margin levels. CRM further noted that Archegos’s PE was $518 million—more than 25 times the $20 million PE limit—and Archegos had not provided its 2019 audited financials, which was problematic given that “potential fraud risk is higher” for a family office like Archegos than for a “commingled fund managed by an SEC-registered Investment Adviser.””\n\nEdit 29:  EVERYBODY gets to dispute margin. Lmao.  Remember Malachite? (Edit 19) “In response, CS issued several calls for variation margin between March 10 and March 16, 2020, most of which Malachite disputed in whole or part.” 🙃 credit suisse seems to NEVER WIN A DICK MEASURING CONTEST.\n\nEdit 30. Pages 90-92ish. Lol. They made a “project copper” after malachite to figure out what to do better 🤷🏻‍♀️(um. Your jobs?) and then came up with a new committee. Because the takeaway was malachite had been too much risk for the potential reward. Sooooo guess what? This committee reviews archegos in sept 2020. And the prime broker told them “Archegos had never missed a margin call” AND “portfolio with CS was “indicative” of its portfolio across its several other prime brokers” (come on Mom. jimmy’s mom lets HIM play with fireworks”\n\nQuestion apes: do we know what prime brokerages melvin and susquehanna et al use?\n\nEdit 31** okay guys do these dates mean anything\n “Archegos’s PE and scenario exposure numbers ballooned significantly at the beginning of 2021. While the annual credit review, prepared in January 2021, had referenced January 6, 2021 PE of $46.2 million, by January 15, Archegos’s PE increased to $143.6 million, and by January 21, the PE increased further to $213 million, more than 400% of the newly-increased PE limit.”\nGme jan 6 $18.36\nJan 15 $35.50\nJan 21 $43.03\n\nI mean Viacom did not move during these dates.\n\n“In late January, CRM queried the Credit Control group as to why Archegos’s PE had climbed so dramatically, from approximately $32.5 million on January 6, to $331.3 million on January 26, to $721.3 million on January 27.”\n\n“As noted supra, this chart was generated using weekly PE data compiled by CS. According to these data, Archegos’s PE dropped sharply in mid-February and early March 2021: from approximately $517 million on February 12, 2021; to approximately $72 million on February 19, 2021; to approximately $490,000 on February 28, 2021; and to approximately $220,000 on March 5, 2021. Then, as of March 12, 2021, PE increased to approximately $227 million. CS has confirmed that the data accurately reflects the output of the model. As discussed infra, on February 18, 2021, CS received an additional $500 million of initial margin from Archegos, contributing to the initial decrease of PE to approximately $72 million. However, the substantial fluctuation in PE over this period and, particularly, the fact that the model put Archegos’s PE near zero less than three weeks before its default resulting in over $5 billion in losses to CS is notable. It is also unclear that the PE model incorporated appropriate inputs relating to Archegos’s substantial position in Chinese ADRs. Because the ADRs were traded on U.S. exchanges and denominated in USD, it appears that they may have been proxied to U.S. indices and U.S. default parameters. We trust this will be studied in the context of the substantial ongoing work at the bank on PE remediation.”\n\nHmmmm. Truly I wonder what could have been that volatile at that EXACT SAME TIME.  I know people have posted the chart but im a word person and seeing it written out as an unavoidable yet vague footnote gives me the tingles\n\nEdit 32: FUNNIEST THING EVER. Credit Suisse wanted the prime broker team to get another billion in mathin from Archegos. The last sentence here is too much. \n\n“The Head of PSR responded later that day, pushing back forcefully on CRM’s requests. First, he argued with CRM’s characterization of Archegos’s position, stating that he did not want “people up the chain thinking” that Archegos had “refuse[d] to work with” CS, noting that Archegos had “always been willing to help [CS] get to the right place,” by, among other things, “executing an SCMA in short order” to help with the business’s capital requirements, “getting CSI docs done quickly to migrate” off CSSEL, and “adding over $1bn of shorts at the end of last year because we asked them to start balancing out their book.”\n\nEdit 33: finally. The actual gamestop referemce on pg 111. “You’ll recall they took an $800mm+ PnL hit in CS portfolio during “Gamestop short squeeze” week [at the end of January]. We were fortunate that we happened to be holding more than $900mm in margin excess on that day, so no resulting margin call. Since then, they’ve pretty much swept all of their excess, so think the prospect of a $700-$800mm margin call is very real if we see similar moves (also why $500mm severe stress shortfall limit not only reasonable, but also plausible with more extreme moves).”\n\nEdit 34: this is kinda saying potentially all archegos’ prime brokers wld be holding GME if CS is “The CRM analyst told his supervisors that, while Archegos refused to answer specific questions about its holdings at other prime brokers, Archegos had told him that, “as they leg in to positions, they ideally prefer to do so pro rata across their core [prime brokerage] providers,” including CS, although that was not always accomplished. The CRM analyst noted that CS “should assume that [Archegos] potentially ha[d] additional exposure” on the same large, concentrated names “away from [CS]”\n\nEdit 35: This is for the software engineers. Again the last sentence IS A CHEFS KISS. LMAO\n“The software engineering team ran Archegos’s swaps portfolio under the dynamic margining rules applicable to Archegos’s Prime Brokerage portfolio and delivered the results to the Head of PSR on February 10, reflecting that Archegos would need to increase its existing swap margin by $3 billion. That is, Archegos’s existing swap margin was approximately $1 billion, but if its swaps portfolio was margined under the Prime Brokerage margining rules, the total initial margin requirement would be approximately $4 billion, resulting in a day-one step up of $3 billion in additional initial margin.\nAfter receiving this news, the Head of PSR did not pursue this option.”\n\nEdit 36: so the project copoer committee at cs meets again and runs archegos’ numbers in feb 2021 and decide to watch for a few weeks, then possibly get $250m more margin in march and review at next meeting in April. This is what we are up against folks. A slow moving train wreck which jacks my tits because i get paid every two weeks and I am glad to be able to increase my bet against these negarious mofos. But understand the entire industry has been working behind the scenes since jan if not earlier to prop these fund managers up against us.\n\nEdit 37: if you read anything make it page 125-129 this will be the trailer when they make the story. Phone calls all weekend and the final back stabbing amongst brokers\n\nEdit 38: their offices are just as much a clusterf*ck as yours or mine. Gabe Plotkin take your “systems wont allow us to do that” and but it where the sun dont shine. Here’s a little story for you. “Specifically, on March 12, 2021, Archegos emailed a Delta One trader and the Prime Services middle office team asking to extend the maturities of these swaps for 24 months. The trader forwarded the request to the Head of PSR and the PSR analyst covering Archegos, and asked if there were any issues with renewing the swaps. The trader did not copy the middle office, or anyone else, on his email to PSR. In the meantime, a junior member of the middle office team responded to Archegos, copying the trader, and reported that the swaps had been extended. This was not consistent with established protocol, which requires the middle office to await the trader’s direction before initiating the booking. Shortly thereafter, the trader received a response from the PSR analyst directing the trader to hold off on the extension request because CS was engaged in discussions with Archegos about transitioning to dynamic margining. The trader did not recall receiving the email from the middle office stating that the swaps had been extended and, in any event, did not forward the email from PSR to the middle office team or otherwise direct the middle office to reverse the booking of these swap extensions. Nor is there any evidence that the trader informed the two more junior traders on the desk of PSR’s direction to hold off on Archegos’s requested extensions.\nAlthough the middle office had initiated the booking of the swap extensions without the trader’s approval, the swap extensions still required confirmation by a Delta One trader. That occurred later that day when one of the more junior traders provided his sign-off on the list of daily middle office bookings. That trader, who does not appear to have been privy to the PSR request that Delta One hold off on the swap extensions, approved the swap extensions, and the maturity date officially changed. He did so without first checking that PSR had approved the swap extension because he assumed that the middle office had already received confirmation from a Delta One trader prior to initiating the booking.\nFollowing the extensions, RWA for the business increased dramatically and these extensions were determined to be the cause. As a result, the Head of PSR spoke with Archegos and, on March 25, the extensions were reduced to approximately three weeks. The junior middle office employee acknowledged his breach of standard operating procedure in booking the trade without formal direction by a trader. The trader who communicated with PSR also regretted not informing both the middle office and the other traders of PSR’s direction and acknowledged that it would have been prudent to do so given the size of the swaps at issue. The more junior trader who approved the booking similarly acknowledged his failure to check with others on the desk before approving lengthy extensions of such large trades and agreed that it would have been prudent to do so.” 🤷🏻‍♀️ whoopsie. Systems. What are ya gonna do? 🤷🏻‍♀️\n\nEdit 39: “Head of Equities—as part of their day-to-day management and oversight of Prime Services…Eventually, Archegos grew to be Prime Services’ third largest hedge fund counterparty by gross exposure. But none of these managers remembers Archegos being called out as a risk”  mind you that is HEAD OF EQUITIES. Mere managing directors at these firms make base salaries of $600k and bonuses of $100-200% of that. “I dont remember hearing about that fund before today…the day they lost us $5bn. So sorry. I plead the fifth. Must need more ginko biloba in my diet” 🤷🏻‍♀️\n\nEdit 40: more for the engineers and illustrative of the greed “The business did not prioritize investment in technology that would have assisted in more effectively managing risk. For instance, PSR had identified a relatively inexpensive fix for bullet swaps that (subject to client agreement) would have automatically re-calculated initial margin based on the current mark-to-market value of the portfolio (thus preventing margin erosion). This fix would have cost approximately $150,000, but the business did not prioritize or fund it.”\n\nEdit 41: astounding. “After the market closed on March 24, 2021, CS calculated that it would make an approximately $2.7 billion margin call on Archegos the next day. Archegos indicated that it would not be able to meet the call. At that time, Archegos had a concentrated portfolio with CS totaling nearly $24 billion in notional GMV, among the largest portfolios across Prime Services…if CS’s senior-most executives had been aware of Archegos’s portfolio and the considerable risks it posed to CS in the weeks leading up to the night of March 24, 2021 (as CS was preparing to make a $2.7 billion margin call on a little-known family office), they might have been in a position to take risk mitigation steps earlier”. Do you see that? A LITTLE KNOWN FAMILY OFFICE. Imagine what happens when banks have dick measuring contests with i dunno….the guy who owns the mets??? (Who I assume borrows and slaps Brandon Nimmo’s dick on the table rather than climbing a ladder, pushing aside his belly and trying to keep his own on the surface and/or near a ruler)\n\nEdit 42: amongst the recommendations for improvement: define roles better and use dynamic margining. ARE YOU KIDDING. ITS 2021 and Gabe Plotkin keeps referencing all the great systems in place to keep greedy immoral criminal mofos like himself from stealing from us and these systems dont include dynamic management of portfolios for margin purposes?? Nor do they apparently include commin sense like this revommendation for improvement on page 154 “Prioritize hiring experienced risk managers” 🥸\n\nEdit 43:  i have reached the end. A 4 sentence conclusion written by the team of lawyers who wrote this report for credit suisse which basically says mea culpa life came at us fast. \n\nSo in conclusion my dearest apes I believe the moral of this tale is things move slowly…until they do not. BUY. HOLD. BE GOOD TO EACH OTHER.\n\nTLDR As requested:\nhedge fund managers operate above and outside of the laws of society and financial risk management because their counter parties want their business so much and nobody is incentivized long term to hold them accountable - so the crashes will be bigger and bigger….and I believe GME will be the spark that uncovers the biggest implosion so far!",
    "title": "Posting this here: I made it to page 2 of the Archegos Report and…",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ovvy5h/posting_this_here_i_made_it_to_page_2_of_the/"
}