{
    "author": "hell-mitc",
    "created_utc": 1619395475.0,
    "distinguished": null,
    "edited": 1619402480.0,
    "id": "myl37p",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_myl37p",
    "num_comments": 70,
    "permalink": "/r/Superstonk/comments/myl37p/its_just_a_bug_bro_part_6_bug_spray_edition/",
    "score": 1098,
    "selftext": "Alright everyone, here we go again. I am going to try to spare us all a ton of detail because we have been reading a lot of it for the weeks now. Atobitt got deeper into the rehypothecation theory so we should understand that to a degree; but this will reiterate it and more, and I feel that we can do better with how the system works. \n\nI, personally, have tried to *actually understand* the information we all keep throwing out, and I think I have a pretty good grip on it (mind you I am not an expert and anyone who can poke holes in this, please do \\[not you shill, fuck you\\]).\n\nObligatory “**this is fucked**” at the beginning of anything I write, and the fact none of this is financial, legal or advice of any sorts.\n\n[https://www.newyorkfed.org/medialibrary/media/research/epr/2012/1210cope.pdf](https://www.newyorkfed.org/medialibrary/media/research/epr/2012/1210cope.pdf)\n\nTL;DR: FUCK YOU READ IT. But I know, none of us want to read anything so here it is (read the last bold paragraph too because it ties it all together). This document seems to tie together how Hedge Funds, Banks, DTCC and the Fed have all been trying to get their numbers to work out. The long hours overnight, the fed system going down, the stopping of sales through brokerages; the rules are in place since the 2008 crisis to allow for A LOT more margin lending with the proper stress tests, solely based on math, tri-party repo transactions, and haircuts (no, not the hair kind). \n\n· This all ties to GME because it seems that they all have a serious liquidity crisis (because of their margin lending and because GME isn't going bankrupt \\[obviously\\]), and the price has been kept down artificially (BY EVERYONE)\n\n· They basically don’t want a mass sell-off of securities (for anyone)\n\n&#x200B;\n\nhttps://preview.redd.it/awjppqzeqev61.png?width=350&format=png&auto=webp&s=f2ca6da08793817b49cc429722b3f4f75d258a11\n\n“Because a repo is effectively a collateralized loan, the key terms are the same for both: borrower and lender, maturity date, cash loan amount, interest rate9, collateral eligibility, margin schedules, and the treatment of the contract in the event of either party’s failure”\n\nHere is your best explanations of what a repo is. It basically dictates how the agreement they (two parties) have in place (Master Repo Agreement \\[MRA\\]) will be executed or terminated, and *how the margin will be maintained* (bear in mind this is how they loan money; based on the collateral that is available).\n\nSo, lets pretend for a second that we are a massive hedge fund or securities broker that holds our clients shares in Street Name. Now lets pretend that a lot of what we have purchased has been purchased with loaned cash (margin). So, these shares held in street name are held in what we know as cede & co (basically a partner network within the DTCC). Apes are buying all the shares and locking them in in the delivery period, and you need to keep buying shares that you can’t find because they are all sold (see what I am getting at here?). We will revisit this shortly.\n\n&#x200B;\n\nhttps://preview.redd.it/l00w4jlqqev61.png?width=347&format=png&auto=webp&s=0eebdac106a2e159068ca81097d18af903865179\n\n“Dealers use the tri-party repo market mainly to obtain largescale, short-term financing for their securities inventories at a low cost. They typically use only one of the two clearing banks to settle their tri-party repos. Large cash providers maintain accounts at both clearing banks in order to transact with dealers at each of them.”\n\nAnyone care to guess who these two banks are? JP Morgan and Bank of New York Mellon. And who wants to see what the lending rates are for certain securities and bonds?\n\n&#x200B;\n\nhttps://preview.redd.it/9p54gtstqev61.png?width=749&format=png&auto=webp&s=e556398c9edaf2b499b19c067f7da78e265a8dc4\n\n&#x200B;\n\n[That a lot of treasury collateral value...](https://preview.redd.it/q9jhywzuqev61.png?width=688&format=png&auto=webp&s=a7e355e11e3484710803d3128283961e7db74338)\n\nI can literally feel your eyes glazing over from here, so you ask, how does this tie to GME and what happened hell-mitc?\n\nWell, lets reexamine for a minute. \n\nIn this document, it outlines how “The GCF market has several functions for dealers. Some use the market for a substantial share of their inventory financing, on an ongoing basis….Dealers also use GCF repos for collateral upgrades, borrowing cash against agencies’ MBS collateral and reinvesting the cash against Treasury securities. They may choose to do this because it is easier to finance Treasury securities than agency MBS” (maybe...uhhh...because they're backed by the people?).\n\nWe have an extensive group of hedge funds, shorting a stock they were sure was going tits up, and now, their positions have exposed them (and their dealers) greatly. If we go back to how they are clients and customers (also in a cash sense**), then they are using this system of borrowing against their securities AND the Treasury securities they hold.**\n\nHere’s another line that tickles me a little, because this is how our banks tie into this; “A large dealer might have tri-party repo relationships with, say, twenty or more significant cash providers. Each relationship can involve many different deals on a given day.”\n\n**HAHAHAHAHA**\n\nSo, it would appear that our banks, the Fed, our favorite hedge funds and us, have been putting money into the system on the assumption that (1) enough would sell soon enough to offset the purchase of the physical security, and (2) the eligible collateral can be borrowed against as long as you take a little haircut. \n\nBut what if your hair gets too short? Well here is where I am pretty sure it all ties together and the entire system is against us while we wait for them to change the math. \n\n1.  An industry that doesn’t work past 4pm has been up for all hours of the night meaning chances are some legislations has changed that we aren’t privy to (not just DTCC)\n2.  The Fed uses proprietary software (Fedwire® Securities Service) that helps to determine credit, collateral, leverage, margin, etc. Check it out [https://frbservices.org/financial-services/securities/index.html](https://frbservices.org/financial-services/securities/index.html)\n   1.  We watched the Fed system go down and GME skyrocketed, something happened that caused them to either take the software offline, or juggle the impending margin calls that were about to unfold\n   2. [https://frbservices.org/assets/resources/rules-regulations/operating-circular-7-102917.pdf](https://frbservices.org/assets/resources/rules-regulations/operating-circular-7-102917.pdf)\n      1. THIS DOCUMENT IS FUCKED, it explains why the Fed wont be responsible for defaults, but also the legislation required. It is called **Operating Circular No. 7.** There are a lot more, but this serves its purpose in relation to defaults of a member and overleveraging.\n\nSo, we have reached a point where I am kind of coming to a conclusion that this isn’t contained to any specific organization or entity. In the New York Fed document:\n\n**“The exposure of a clearing bank to a single dealer can routinely exceed $100 billion (Federal Reserve Bank of New York 2010). In the event that a dealer fails, its clearing bank could, in an unexpected situation, discover that the market value of the collateral provided by the dealer is insufficient to cover the amount owed to the clearing bank. The stability of the clearing bank could also be threatened if it decides instead to hold the collateral on its own balance sheet, thereby increasing its leverage. The vulnerability of a clearing bank to a troubled dealer is intensified by “wrong-way” risk, meaning that, in a crisis situation, the failure of a dealer may be correlated with a sudden reduction in the market value of some securities that collateralize the dealer’s tri-party repos. Moreover, an attempt by a clearing bank to lower its exposure to a failed dealer through a sudden “fire sale” of the collateral could itself reduce the value of that collateral, thus exacerbating the losses to the clearing bank and to other market participants that hold positions in the same or similar assets. This danger buttresses the importance of the Primary Dealer Credit Facility (PDCF), introduced by the Federal Reserve Bank of New York during the financial crisis (Adrian, Burke, and McAndrews 2009). The PDCF provided an alternative source of financing for collateral that might otherwise have been liquidated in a fire sale; such a liquidation could have potentially destabilized the markets and eroded the capital of these asset holders.**\n\n**HOLY FUCK**\n\nThey are literally trying to avoid a market sell-off of broker securities because the fire sale will cause the market to crash. They went through this in 2008 with Lehman and Bear. They are about to go through it again, and have tried to stop it before it gets too crazy. Soooo many banks are exposed to Citadel et al. that they pretty much don’t want anyone to be able to scoop up the shares at discount prices without having something in place first (anyone see that little DD today??). I would also speculate that the Archegos and Credit Suisse debacle are warnings to everyone, not us, everyone in the industry. They know this stuff already, we are just figuring it out.\n\nSo, we have a nice little foundation where everything is getting kind of crazy. It would seem that the banks are now competing for who gets a piece of the pie, or who goes bankrupt, ORRR they are *all* really trying to wait us out and see if we will sell (HAHA FUCKING GOOD LUCK 2 WEEKS, 2 MONTHS, 2 YEARS, ILL BE HOLDING MY SHARES AND BUYING MORE). \n\nAnyway everyone, I hope this helps, and I hope we can all keep moving forward. Might be a little battle but I get the feeling we are on the right track and can make a difference if we keep plugging away.\n\nReferences\n\n1. [http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=4&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=196&f=G&l=50&co1=AND&d=PTXT&s1=fedwire&OS=fedwire&RS=fedwire](http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=4&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=196&f=G&l=50&co1=AND&d=PTXT&s1=fedwire&OS=fedwire&RS=fedwire)\n2. [https://www.newyorkfed.org/medialibrary/media/research/epr/2012/1210cope.pdf](https://www.newyorkfed.org/medialibrary/media/research/epr/2012/1210cope.pdf)\n3. [https://www.newyorkfed.org/tripartyrepo/margin\\_data.html](https://www.newyorkfed.org/tripartyrepo/margin_data.html)\n4. [https://www.newyorkfed.org/banking/tpr\\_infr\\_reform.html](https://www.newyorkfed.org/banking/tpr_infr_reform.html)\n5. [https://www.dtcc.com/clearing-services/ficc-gov/gcf-repo](https://www.dtcc.com/clearing-services/ficc-gov/gcf-repo)\n6. [https://frbservices.org/financial-services/securities/index.html](https://frbservices.org/financial-services/securities/index.html)\n7. [https://frbservices.org/assets/resources/rules-regulations/operating-circular-7-102917.pdf](https://frbservices.org/assets/resources/rules-regulations/operating-circular-7-102917.pdf)\n\nEdit 1. Here's the DD from earlier.\n\nThis one.\n\nhttps://www.reddit.com/r/Superstonk/comments/my1hio/friday_the_dtcc_approved_wabra_morgan_stanley/\n\nHe explains it in the comments, basically there is now an approved dtcc firm to help with the liquidation process so it doesn't hit the market. We actually might be in a completely fraudulent system towards retail investors.",
    "title": "It's Just a Bug, Bro Part 6 - Bug Spray Edition",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/myl37p/its_just_a_bug_bro_part_6_bug_spray_edition/"
}