{
    "author": "triteacid",
    "created_utc": 1628245783.0,
    "distinguished": null,
    "edited": false,
    "id": "oz407c",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oz407c",
    "num_comments": 297,
    "permalink": "/r/Superstonk/comments/oz407c/i_like_the_fact_that_cnbc_fucked_around_with_gary/",
    "score": 12675,
    "selftext": "Remember the first couple of times the „news“ called GME holders idiots, rioters, dangers, gamblers, lunatics on all of that? I remember being angry in the beginning. \n\nWell, now they gave that feeling to GG by cutting up his words and misrepresenting/altering his message. I think they are throwing every poker chip they have at this problem, right now. Even CNBCs and other MSM losing most of its viewership and trust mid-term is preferable for Ken and his friends to losing this bet. \n\nLet that sink in. That is the magnitude of what is happening. They are willing to permanently lose their best tool of control over the unwashed masses for this. They just pissed on the SEC chiefs shoes in public and he posted those 2 missing minutes HIMSELF, in his own Twitter soon after. \n\nI can’t argue with anyone saying that there is little hope for the SEC actually stepping up and doing it’s job to stop Shitadel and friends, but I hope they will. Now that Gary Gensler actually makes public appearances I think we’ve entered a new phase. He openly states that they are looking at the market structure very closely. Wait who is the Market Maker for almost half of all retail volume? Get fuk Ken.\n\nTLDR: I have hope that Gary Gensler might actually be pissed about the massive corruption is happening, which he himself just felt at the hands of CNBC. The old story he must’ve believed of “the finance industry will regulate itself” is completely dead now and the winds of change are blowing. HODL to the moon 🚀🚀🙌🏻💎",
    "title": "I like the fact that CNBC fucked around with Gary Gensler by cutting out 2 minutes of his interview, which he then posted himself. It speaks to me of incredible arrogance, or helplessness openly cenorsing the chief of the SEC.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oz407c/i_like_the_fact_that_cnbc_fucked_around_with_gary/"
}