{
    "author": "NoBluebird6562",
    "created_utc": 1622982537.0,
    "distinguished": null,
    "edited": false,
    "id": "ntko8r",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_ntko8r",
    "num_comments": 155,
    "permalink": "/r/Superstonk/comments/ntko8r/naked_short_selling_the_truth_is_much_worse_than/",
    "score": 5107,
    "selftext": "Just came across this article (another Sunday afternoon trawling through the internet), from Silver Doctors back in February '21. Not sure if it was posted here then, but really good read. We need more of these articles hitting the internet! \n\n&#x200B;\n\nA few quotes highlighted below. \n\nLink  [Naked Short Selling: The Truth Is Much Worse Than You Have Been Told – Silver Doctors](https://www.silverdoctors.com/headlines/world-news/naked-short-selling-the-truth-is-much-worse-than-you-have-been-told/) \n\n&#x200B;\n\n**Naked short sellers are not motivated by moral and ethical reasons, but by profit alone.** They attack good, but weak and vulnerable companies. **They are not the saviors of capital markets, but the destroyers.**  \n\n&#x200B;\n\n*“If you control the settlement system, you can do whatever you want,”* the source said. *“The compliance officers have no teeth because the banks are making big money. They over-lend the stocks; they lend from cash account shares to cover some of these fails … for instance, if there are 20 million shares they sold ‘long’, they can cover by borrowing from cash account shares.”* \n\n&#x200B;\n\n\"When you have the ability to sell an unlimited number of non-existent phantom shares in a publicly-traded company, you then have the power to destroy and manipulate the share price at your own will.\" \n\n&#x200B;\n\n\"Big banks and financial institutions are turning a blind eye to some of the accounts that routinely participate in these illegal transactions because of the large fees they collect from them. These institutions are actively facilitating the destruction of shareholder value in return for short term windfalls in the form of trading fees. They are a major part of the problem and are complicit in aiding these accounts to create counterfeit shares.\" \n\n&#x200B;\n\nThe short-sellers and funds who participate in this manipulation almost always finance undisclosed “short reports” which they research & prepare in advance, before paying well-known short-selling groups to publish and market their reports (often without any form of disclosure) to broad audiences in order to further push the stock down artificially. There’s no doubt that these reports are intended to create maximum fear amongst retail investors and to push them to sell their shares as quickly as possible. \n\n***That is market manipulation. Plain and simple.*** ",
    "title": "Naked Short Selling: The Truth Is Much Worse Than You Have Been Told",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ntko8r/naked_short_selling_the_truth_is_much_worse_than/"
}