{
    "author": "Bonca1222",
    "created_utc": 1626654372.0,
    "distinguished": null,
    "edited": false,
    "id": "on2zhg",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_on2zhg",
    "num_comments": 76,
    "permalink": "/r/GMEJungle/comments/on2zhg/theory_fud_this_weekend_was_to_dissuade_linkedin/",
    "score": 1031,
    "selftext": "We all know this weekend was bad. Unfortunately it came at a time when we were gaining traction with serious people. This was probably the worst time for us to have a meltdown, as people who saw the LinkedIn posts during the week and came to check out the sub over the weekend were likely appalled by what was going on and never even made it to the DD. \n\nIt is going to be incredibly important over the next few days and weeks to appear overly professional. This isn’t another “no memes” post, feel free to keep it light. But no fighting in the comments (I’m guilty of this as well), let the newsapes post the news, and not flood the sub with 200 of the same post. (Not because it’s annoying to see the same thing, but because it makes a ton of work for the moderators to look at all the reports and then deal with all the comments) Hold the new mods and this mod team to a high standard, but don’t make their job any harder by posting annoying shit, or getting off topic. Keep the political stuff out, it just causes problems in the comments and that means more work for the mods as well. \n\nThis next week will be a real opportunity to change people’s minds about the stock regardless of the price action. But we can’t do that if we don’t behave and explain our DD rationally and calmly so as to remain credible and not discounted as “a bunch of internet lunatics.” If we can convince more money to be interested in GameStop, that will only hurt the shorts as they’ll have to spend more and more money. \n\n\n**TL;DR** It is my opinion, that this week the goal should be to convince serious people that we are credible and make the shill posts obvious, because real apes will be quietly buying and holding, and not flinging their shit.",
    "title": "Theory: FUD this weekend was to dissuade LinkedIn people from taking GameStop seriously",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GMEJungle/comments/on2zhg/theory_fud_this_weekend_was_to_dissuade_linkedin/"
}