{
    "author": "FeedbackSpecific642",
    "created_utc": 1626531685.0,
    "distinguished": null,
    "edited": false,
    "id": "om55z9",
    "text_only": true,
    "flair_text": "𝗥𝗲𝗾𝘂𝗲𝘀𝘁",
    "name": "t3_om55z9",
    "num_comments": 78,
    "permalink": "/r/DDintoGME/comments/om55z9/if_you_want_the_legislation_changed_to_more/",
    "score": 854,
    "selftext": " \n\nFull  disclosure, this is the ~~second~~ third time I've posted this (twice on the cinema group's forum) after it basically  died on its arse the first time. I think this is too important not to  bring to everyone's attention hence attempt number two.\n\n**TLDR and it looks boring: -**\n\nThe  Financial Regulation Authority are suggesting changes to legislation  and what finance firms such as Shitadel have to report to them and how  often. These proposals would make SI more accurate and it would be more  difficult for firms to hide their shorts and FTDs. It ends on a request  to comment on the FINRA page, I've posted it below but for ease here it  is again.\n\n[https://www.finra.org/rules-guidance/notices/21-19](https://www.finra.org/rules-guidance/notices/21-19)\n\nWhat  a coincidence all these new regulations are now being discussed after  years of inaction. I'm sure that's all it is, coincidence and nothing to  do with the possibility that the meme stock revolution could completely  crash the entire finance industry.\n\nFINRA are requesting comments on potential reporting changes- [https://www.finra.org/rules-guidance/notices/21-19](https://www.finra.org/rules-guidance/notices/21-19)\n\nYou  are requested to comment on these proposals. Let's face it, the Hedge  Funds are going to be using their voices to prevent these changes from  occurring so we need to use our voice too. There are a lot more apes  than Hedgies.\n\nI've cut and pasted  just some of the proposals (man, if you think this is a long and dry  read, wait until you read the webpage): -\n\n1. **Account-level Position Information:**   Alternatively,  FINRA is considering requiring firms to report (for   regulatory purposes  only; not to be disseminated publicly) short   interest position  information with more granularity by reporting at the   account level for  all equity securities\n2. **Synthetic Short Positions:** In addition, FINRA is considering requiring firms to reflect synthetic short positions in short interest reports.\n3. **Total Shares Outstanding (TSO) and Public Float:**   FINRA  also is considering including in FINRA-disseminated short   interest data,  where available, the TSO and public float for   securities. (I might need someone to explain this in more detail as I   may well be wrong in thinking this would include all naked shorts.)\n4. **Threshold Security Field:**[12](https://www.finra.org/rules-guidance/notices/21-19#_edn12) FINRA    is considering including in FINRA-disseminated short interest data a    new field that would indicate if the security is a threshold security  as   of the short interest position reporting settlement date.\n5. **Frequency and Timing of Short Interest Position Reporting and Data Dissemination**    Increasing the frequency and timing of reporting and disseminating   short  interest data would provide FINRA, other regulators, investors   and  other market participants with a more current view of short   interest  information, better inform investors’ and other market   participants’  investment decisions, and provide more timely information   to FINRA for  regulatory use.\n6. **Information on Allocations of Fail-to-Deliver Positions**     FINRA is considering enhancing its short sale reporting program by    adopting a new rule to require members to submit to FINRA (for    regulatory purposes only; not for public dissemination) a report of    daily allocations of fail-to-deliver positions to correspondent firms    pursuant to Rule 204(d) of Regulation SHO. \n7. **Synthetic Short Position**   (I know this is mentioned above but this explicitly refers to the   practice HFs use to \"kick the can down the road\" for FTDs.)                                                                  The sale of a call   option and purchase of a put option with the same  expiration date and   strike price provides equivalent exposure to the  price of a stock as a   short sale. Despite this equivalence, this  synthetic position does not   currently create a short position that would  be reportable under the   current version of Rule 4560. The extent of use  of this and other  types  of synthetic short positions is unknown.                                                                                                             A more expansive reporting requirement that captures synthetic  short   positions would allow FINRA to be better able to understand  market   participants’ short sale-related activity. As synthetic short  positions   provide equivalent exposure, information on them may also  provide   investors and other market participants with similarly useful    information on negative sentiment.\n8. **Loan Obligations Resulting from Arranged Financing**   When a customer closes-out a short position by delivering shares    borrowed from a member’s affiliate, the customer acquires an obligation    to deliver shares to the affiliate in the future. The exposure from   this  loan obligation is substantially equivalent to a short position   but the  loan obligation is not a reportable short position under the   current  version of Rule 4560. If customers can close out short   positions by  borrowing shares from unaffiliated lenders, those loan   obligations would  have the same economic equivalence to reportable   short positions. We  request comment below on whether firms have such   programs.\n\nI  think it's very important for us to have our say. In my previous post  people said it will have no effect, perhaps not but if we don't comment  it definitely will have no effect. Comments must be submitted before the  4th August 2021.\n\nFeel free to correct any errors I've made (as if you guys need an invitation). Thank you.",
    "title": "If you want the legislation changed to more accurately reflect true Short Interest and FTDs here's your opportunity.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/om55z9/if_you_want_the_legislation_changed_to_more/"
}