{
    "author": "bobsmith808",
    "created_utc": 1624056923.0,
    "distinguished": null,
    "edited": 1624650437.0,
    "id": "o32geb",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o32geb",
    "num_comments": 454,
    "permalink": "/r/Superstonk/comments/o32geb/update_on_t21_cycles_and_dd_on_dd_by_ucriand_and/",
    "score": 6368,
    "selftext": "&#x200B;\n\n[Gotta have more DD - Christopher Walken](https://preview.redd.it/etc6x1qko9671.png?width=622&format=png&auto=webp&s=e37dd0262ea3ca1050ce7a877bdded647dffd7de)\n\nHi apes, Bob again. yay [gamestop.com](https://gamestop.com)\n\nSo I’ve been reading some really interesting DD lately from u/criand and u/dentisttft and I wanted to check out how things line up together and mix it into [my own forward looking DD on Option related FTD cycles](https://www.reddit.com/r/Superstonk/comments/nsyw3k/ftd_cycle_mapping_into_the_future/) that are actually based off a DD that u/criand posted a while back on [T+35 into ♾ Loop T+21 cycles on Options](https://www.reddit.com/r/Superstonk/comments/nf22qz/theory_on_the_ftd_loop_missing_link_a_t35_surge/).  Using that information, I was able to extrapolate dates (**no dates**) and predict large stock movements over the past few months.  Like my wife's boyfriend always tells me: \"You'll have to trust me\" on this because I never posted anything on it before the DD linked above.  If you think I'm full of shit, that's OK too, you can follow these instructions to make me feel better about you not trusting me:\n\n1. Find a 🍌\n2. Do what u/rick_of_spades did.\n\n**Ok, TO THE POST!**\n\nIn this post, we will be exploring the possible relationship between the GME price movement and all the cycles because, contrary to popular belief, there usually isn’t just one answer for things happening.  No, I'm not talking about 🚲 or 🚴‍♀️ or even 🚴‍♂️... this is a 🚳 cycling area, so don't fuck around!  We are talking about recent and not so recent DD on T+21 Cycles, T+35 Cycles, and we'll throw in some SLD in there for extra flavor so, in the words of 🍦 papa Cohen 🐸...\n\n# BUCKLE UP\n\n**Disclaimer:**  I’m still learning and able to take constructive criticism, so please pick this apart. The point of this is to expand our knowledge and find truths. Also, I'm too smooth to advise anyone on anything, so take you bag of 💰 do what **you** want with it :D\n\n**Credits:** Special thanks to u/dentisttft who was kind enough to share his source data with me, which I’ve folded into my own dataset I’ve been working with. u/criand has not responded to my data requests as of yet, but if he does, I’ll gladly fold in his data to this analysis and provide an update.\n\nHoly shit, I must be going for a record with the introduction to the post... let's get to it shall we?\n\n# Is the T+21 cycle a thing?\n\nI like to think so…  It's been pretty consistent.   Also, I think it's not just T+21, but more a T+35 cycle from option expiry into a T+21 ♾ loop.  DD linked above in intro if you want to check that out.  Based on some DD from u/criand a while back.\n\n&#x200B;\n\n[T+35 into infinity loop T+21 can kicking by Mr Mayo](https://preview.redd.it/3j4nrazno9671.png?width=2831&format=png&auto=webp&s=297017663692fa40a3c1e4a7402a93442c37989d)\n\n# Is T+35 FTD cycle a thing?\n\nI think so too, but in a different way.  The T+35 FTDs look to be eyeball-correlated (this is a technical term of course) to be largely pre-emptive movers in and of themselves, but aren't very consistent.   Volume on the trading days matter a lot more than these IMHO, but they do contribute, as that's the settlement date that needs to be met, so these generally add to the buying pressure.  You might ask why on these specific days? Well, it's because Mr Mayo et al don't want to rip off the Band-Aid, so they keep it on as long as possible, allowing it to fester and grow into a bigger problem before being forced to take care of it at the very last second.\n\n[T+35 FTD cycles.  Data represented was cross-checked against u\\/dentisttft 's data](https://preview.redd.it/y70vt3ppo9671.png?width=2829&format=png&auto=webp&s=95ba49cf7f0db733080a9c01052995ce924ea072)\n\n# What does this look like as a full picture?\n\nI have more data going back in time as well as predictions for dates in the future, but lets' stick to what we have been analyzing up to this point to stay on track. If you are interested in backwards to 2015, I have a full data set to play with - hit me up! and if you're interested in the mapping into the future, I've done through the end of the year already with the available data.\n\nOh, I promised a full picture, but before we go there, **let's look at SLDs...**\n\nWhat's an STD, you say? Well, to that, I'd say ask your wife's boyfriend - he would know, but you don't have to worry about it.  SLDs, on the other hand are Supplemental Liquidity Requirements  and mean that once a month sHFs have less money to play with while they settle up on their options activities, and we all know how they love options. There is a [fantastic post about SLDs and liquid shits](https://www.reddit.com/r/Superstonk/comments/njgs66/rc_tweet_analysis_part_2_dumb_and_dumber_turbolax/) by, you guessed it, u/dentisttft.  It took me a few reads and a non-half assed (Ron Swanson) approach to learning how this worked, and I'm glad I did, because I think this might be one of the keys to understanding this whole thing.\n\n[SLDs line up pretty fuckin well to price improvements and all the major jumps for GME \\(or at least the start of them\\) since January 2021. ](https://preview.redd.it/fgk5pwuro9671.png?width=2834&format=png&auto=webp&s=0f9a05b1bdbd5d8b6f77eb36e264337c78016d84)\n\n# Putting everything together.\n\nhttps://preview.redd.it/83lh02buo9671.png?width=600&format=png&auto=webp&s=6eaa3de16b5d5b038bbaed34eacac2727dd7a274\n\n# A closer look when these powers combine.\n\n&#x200B;\n\n[Click to open - it's detailed with some explanations and further below.](https://preview.redd.it/w0fa4divo9671.png?width=2828&format=png&auto=webp&s=b151d07e5a01a2adb5259c22dc47ac1aef156ba9)\n\nIf we dig into this eyeball-based correlation (**statistical analysis will come in a later post**), it seems like something is going on here, but it's not 100% - That shy cycle on 3/15 ruined everything... or did it?  you remember that kickass post from u/dentisttft that you read and understood completely?  No? Go re-read and understand that the SLDs take money away from the sHFs for a period of time, which makes it that much harder to suppress GME.  When the stars align, and by stars, i mean all the things I'm tracking, we see big bumps!  **With a little more buying pressure at those times, we might finally see the rocket launch!**\n\nNo, SEC, I'm not suggesting there be any coordinated buying... leave us alone and put your head back in Kenny's jar of mayo.  It's safe and warm(?) there...  Also, maybe check out Cramer's speech about getting people to buy at 2:45... enforcement my ass, but I digress\n\n**Edit**: It's important to also understand that each completed cycle, we see higher lows.  u/renz004 made a post about this explaining that might help paint the picture.\n\n# Here's my working theory\n\nThere's a lot of moving parts to this stock, but the primary predictable movers I've been observing have been:\n\n1. SLD Hold Periods that reduce sHFs liquidity temporarily (about 12 days per month)\n2. T+35 FTD Cycles\n3. T+35 Option Delivery followed by T+21 infinite loop cycles\n\nI believe when they all coincide, we get larger moves to the up side.  Some of these moves are less violent on the up side than others, but that's likely due to some of the following factors:\n\n1. volume aligning with the cycles\n2. volume related to the cycles\n3. fuckery\n\n# Looking to the future\n\nSeeing this data, I'm JACKED for next week.  We have an upcoming wambo combo on Wednesday the 23rd (T21 cycle for April) and on Thursday, ~~6/24~~ 6/25 (thanks Juneteenth) we will see the next T21 cycle for the Jan options they've been can kicking.  The FTD data lines up here as well and there are some bigger days in the cycle than we have seen in recent weeks on that front.  To jack you up more, it all aligns with a SLD hold period, and we have the possibility of the ATM offering being done and more positive news in the pipeline\n\n**edit**:\n\n* u/Datprayincajun_ pointed out we might see 002 on Monday\n* u/No-Letterhead-4407 reminded me that the new CEO is tarting next week, and about possible Russel 1000\n* and u/Mellow_Velo33 gave probably the most simulation confirming technical indicator of all:\n\n>there's a full moon too next week\n\n**so yeah, here's what I'm looking like this weekend:**\n\n[credit to u\\/encab91](https://preview.redd.it/9s1ozooxo9671.png?width=512&format=png&auto=webp&s=16947e5dbfff3a34b5faeb963cb2a68b190f5602)",
    "title": "Update on T+21 Cycles, and DD on DD by u/criand and u/dentisttft because...",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o32geb/update_on_t21_cycles_and_dd_on_dd_by_ucriand_and/"
}