{
    "author": "SirMiba",
    "created_utc": 1622847869.0,
    "distinguished": null,
    "edited": false,
    "id": "nshyy9",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_nshyy9",
    "num_comments": 408,
    "permalink": "/r/Superstonk/comments/nshyy9/just_another_reminder_literally_every_company/",
    "score": 6299,
    "selftext": "I've been holding since the second peak of Mt. FUD in January. Catalysts came and went, and Shitadel shorted GME to hell and back, every. single. time. I said this months ago now, but I'll say it again: You almost have to give Shitadel some credit for their relentless consistency and adherence to strategy. In the light of how absolutely futile their efforts are, they are in fact, more retarded than we are. They'd gladly YOLO the entire US economy into the blackhole that is GME, if the DTCC, OCC, and so on hadn't gone \"OH FUG :DDD Shitdal gone nuglear xDD\" and slowly tried to cover their own asses in time.\n\nNow the sad thing is that Ken is probably not checking GME as feverishly as apes are. He's probably way more busy gobbling schlong on people that he needs to stay good friends with, while moving wealth into IRS havens. Shitadel's HFT is probably more or less fully automated and operated by someone else. The algo they got running doesn't care about anything, and it will just attempt to keep the price at target price while executing the daily manipulation. It's quite literally just programmed to kick the can day after day after day, no matter what. **This does not change on catalyst days, it only appears to get instructions to be way more aggressive.** Regarding catalyst / good company news days, this just seems to be the standard mode of operation. When I first began, I read comments on other investing subs that it's normal for stocks to dip after good news, decent earning reports, etc, on the reasoning that \"better performance was priced in and now its correcting\". Bullshit, I'm 100% convinced it's HF and Market Maker short strategy to earn money on retail investors (obviously not 100% of the time).\n\nBut okay, so here's the point: Shitadel is not gonna let a random ass day be the reason they throw in the towel. Ken would probably use his wife as collateral at a sleazy pawnbroker run by sex starved degenerates without blinking, if he could use that money to stay in the game. They have to be forcefully liquidated by external forces putting a foot down saying enough is enough. Anything that costs them money that can be delayed, will be delayed. Anything that costs them money that can be avoided, will be avoided. They simply do not fucking care about the days we look forward to, only in the sense that have to short more aggressively.\n\nGOOD \"NEWS\": Shorting GME is extremely expensive, and the financial world is waking up to this fact now. Shitadel is, according to our DD, standing in shit to the nose and the rate of change in daily GME costs is increasing EXPONENTIALLY FOR THEM. The only way to avoid paying back a loan, is to take out a larger loan and use that to pay off the original loan. Every loan that they cannot pay back, they either let eat at their finances, or they cover it with a larger loan until that one also begins eating away. This exponential behavior is slow, initially, but eventually the rate of change will be so fast that Ken will not be able to blink as fast as the zeros adding onto the % change. It's entirely possible that Shitadel could have some last hail mary (oh how many times I've heard this one too) stored away for such an occasion, but as always, they are fuk if retail does not sell. You mostly likely won't have to wait years for this.\n\nTA;DR: Shitadel doesn't care about catalysts like the shareholder meeting. They won't stop until forced by others to stop, which will happen because it's very expensive to short GME.",
    "title": "Just another reminder: Literally EVERY \"company catalyst\" since January has resulted in either sideways trading or a huge short attack. Earnings report, chairman announcement, debt settling, fund raising, w/e. There is NO reason to think ANYTHING but -15% will happen after the shareholder meeting.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nshyy9/just_another_reminder_literally_every_company/"
}