{
    "author": "Noderpsy",
    "created_utc": 1628535096.0,
    "distinguished": null,
    "edited": 1628552000.0,
    "id": "p17t52",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_p17t52",
    "num_comments": 216,
    "permalink": "/r/Superstonk/comments/p17t52/its_been_one_helluva_ride_but_i_feel_that_the_end/",
    "score": 3033,
    "selftext": "They stopped retail from buying, but it didn't work.\n\nThey changed the SI% formula, but it didn't work.\n\nThey lied through the media, but it didn't work.\n\nThey tried to pump silver/etc, but it didn't work.\n\nThey tried to raid for stop losses, but it didn't work.\n\nThey tried to sue DFV, but it didn't work.\n\nThey stalled to bore retail, but it didn't work.\n\nThey opened shell companies, but it didn't work.  (Or did it?)\n\nThey censored the S.E.C chair, but it didn't work.\n\nThey invaded social media with disinformation, but it didn't work.\n\nThese bozos backed up the Brinks truck to hire the best quants, psychologists and manipulators that they could get their tiny little mayo dipping hands on, and at the end of the day the only thing that works for them is routing the order flow and shorting through ETFs.  Cat's out of the bag on that one too btw.\n\nI'm shocked that this whole thing has been allowed to drag on this long.  It only furthers to reinforce the magnitude of what is about to happen.  The only way that this can play out now is by letting the market correct itself.\n\nIn order to preserve the \"sanctity of the market\", they must allow it to naturally purge itself of these bad actors, thereby maintaining the \"integrity\" of the system, and paving the way for an actual future with continued retail support.  Any interference in this redistribution of wealth would likely result in catastrophe, a mass exodus of international wealth and individual securities investments.\n\nYou know it, I know it, they know it.  Tell me I'm wrong.\n\n^(Please note, these are just my opinions, and I only eat crayons with high terpene content.)\n\nEdit:  As a user pointed out below in the comments, these short institutions have spread their risk around the globe.  This is clearly now an international issue.",
    "title": "It's been one helluva ride, but I feel that the end is upon us now. Here's some simple perspective before the ground starts to shake.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/p17t52/its_been_one_helluva_ride_but_i_feel_that_the_end/"
}