{
    "author": "leisure_rules",
    "created_utc": 1622017287.0,
    "distinguished": null,
    "edited": 1623783595.0,
    "id": "nlbsgy",
    "text_only": true,
    "flair_text": "𝐑𝐞𝐯𝐢𝐞𝐰𝐞𝐝 𝐃𝐃 ✔️",
    "name": "t3_nlbsgy",
    "num_comments": 87,
    "permalink": "/r/DDintoGME/comments/nlbsgy/the_fed_repo_market_and_overleveraged_equities/",
    "score": 738,
    "selftext": "With massive QE over the past year and recent spikes in Overnight Reverse Repurchase Agreements, how does it play into the GME short squeeze?\n\nBuckle Up kiddos, this is a long one:\n\n**(EDIT: if you're here to learn about RRPs, feel free to ignore the last 2 sections)**\n\n# Agenda\n\n* The Federal Reserve\n* Repurchase Agreement (Repo) Market\n* The Value of the Dollar\n* Synthetic Share Creation\n* My Theory\n\n# The Federal Reserve\n\nThe Federal Reserve, The Fed as it’s commonly referred to, is the US Central Banking institution. Without getting too much into the history of banking both in the USA and globally, a national central bank was always advocated for, but never fully successfully implemented, dating all the way back to the Revolutionary War.\n\nThe modern day Fed got its start in 1913 via the Federal Reserve Act, singed into law by President Wilson on Christmas Eve. Prompted by consistent financial instability, and specifically the Panic of 1907, Senator Aldrich gathered a group of financial experts (essentially the richest American businessmen at the time) out on a small island off the coast of Georgia, to come up with a solution that later became the basis for the Federal Reserve Act. The Act stipulated the creation of a system of private and public entities that would help manage the monetary supply of a national US currency. Essentially, an institution that existed within the boundaries of the Federal Government, but was not beholden to public scrutiny.\n\nThe Fed has since had a tumultuous, yet ultimately prosperous journey over the years. A number of various regulations, Acts, and reforms have shaped the Fed into what it is today. Currently operating across 12 Central Banks, the Federal Reserve System works with the US Treasury Department and federal legislators to oversee the monetary policies of the US economy. There are similar Central Banks around the world, as well as a number of decentralized global institutions such as the IMF.\n\nThe Fed manages this monetary policy through Open Market Operations, managing the supply of reserves in the banking system, influencing interest rates and the supply of credit. These operations can be simplified into two categories with opposite objectives:\n\n1. Expansionary Monetary Policy - the Fed creates and pumps reserves into the banking system, putting downward pressure on interest rates to encourage borrowing. Stimulating the economy\n2. Contractionary Monetary Policy - the Fed buys back reserves in the banks by issuing securities in exchange for cash. This is to taper the supply of cash in the markets, putting upward pressure on interest rates - thus encouraging saving.\n\nThe Fed is an extremely complicated beast and requires multiple DDs on the history alone, but I think for the purposes of this we can move on.\n\n# The Repurchase Agreement (Repo) Market\n\n**Repurchase Agreements**\n\nRepurchase agreements (RP) play a crucial role in the efficient allocation of capital in financial markets - maintaining liquidity. They are widely used by dealers (banks, MMFs, GSEs, etc) to finance their market-making and risk management activities, and they provide a safe and low-cost way for institutional investors to lend funds or securities.\n\nAn RP is a sale of securities coupled with an agreement to repurchase the same securities on a later date and is broadly similar to a collateralized loan.\n\n*For example, dealer can borrow $10 million overnight from a corporate treasurer at an interest rate of 3 percent per annum by selling Treasury notes valued at $10,000,000 and simultaneously agreeing to repurchase the same notes the following day for $10,000,833. The payment from the initial sale is the principal amount of the loan; the excess of the repurchase price over the sale price ($833) is the interest on the loan. As with a collateralized loan, the corporate treasurer has possession of the dealer’s securities and can sell them if the dealer defaults on its repurchase obligation. (*[*LINK*](https://www.newyorkfed.org/medialibrary/media/research/current_issues/ci10-5.pdf)*)*\n\nFrom the perspective of the Fed, an RP provides cash to a dealer in exchange for a US Treasury Bond (T-Bond), with the understanding that the T-Bond will be returned to the borrower, and interest will be paid on the specified date with the returned cash. The benefit is to provide an influx of cash liquidity into the Repo Market, that can be then dispersed through the broader market via various market-making and investment operations of the dealers.\n\n**Reverse Repurchase Agreements**\n\nThe opposite side of the Repo Coin is the Reverse Repo (RRP). As the name implies, this agreement allows the Fed to issue T-bonds back to dealers in exchange for cash. As one would assume, this is effective in decreasing cash supply, but increasing commodity supply via the T-Bonds - which can be used as collateral and/or increased value on the dealers’ balance sheets.\n\nLike regular Repos, RRPs have a preset date on which the security needs to be returned to the Fed, and traditionally the Fed will provide some interest for the bank to incentivize the process. The charts we keep seeing regarding record numbers are for Overnight Reverse Repos.\n\nWhen the Fed created the RRPs back in 2013, the RRP system was intended to be a temporary fix. There were caps set both on the overall lending amount, as well as the amount each counterparty/dealer could store ‘overnight’ - overnight being a somewhat loose term, actual settlements could be a few days to weeks later, most are in fact overnight though. In 2015, the Fed decided to raise interest rates from their all-time low for the first time since the GFC.\n\n* Quick tangent on interest rates: specifically for this, the *the federal funds rate* is the market rate at which banks, or banks and GSEs, lend to each other, usually overnight, on an unsecured basis. Unsecured meaning it’s bi-lateral and has no central clearing party securing the exchange. These CCPs help to mitigate risk in the exchange, and can help lead to fewer FTDs when used as intended.\n   * ***EDIT***\\*: this is the very basic premise of LIBOR vs. SOFR -\\* [*here's a very basic overview in case you're curious*](https://www3.mtb.com/content/dam/mtb-web/pdfs/LIBORtoSOFRTransition_Email.pdf)*. We're scheduled to switch to SOFR at the end of 2021.*\n* The FFR acts as the basis for all other interest rates, as down/up pressure on it will inevitably have the same effect on all rates. The primary tool the Fed uses to control the federal funds rate is the interest on reserve balances (IORB) rate, which is the interest rate the Fed pays on deposits of banks at the Fed, which are called “reserve balances.”\n\nThe Fed creates an abundant supply of reserve balances, making them readily available (“printing cash”). The oversupply will push rates down, and no bank should lend money into the fed funds market for less than it could earn by just keeping the funds on deposit at the Fed, meaning the fed funds rate should always be equal the IORB rate.\n\nBack to how ON RRPs are involved; because these agreements with the Federal Reserve are basically the same as a deposit, the ON RRP facility effectively extended the authority of the Fed to pay interest on reserve balances to a broader set of counterparties. Specifically money funds, which are important lenders in the repo market, the ON RRP helped ensure that overnight repo rates in the market would not trade well below the Fed’s ON RRP rate - or in the case we’ve been seeing recently, going negative!\n\nRather than accept negative repo rates, many investors are investing in the Fed at the ON RRP facility, currently earning 0%. Anticipating this, the Federal Reserve announced on March 17, 2021 that it was raising the per-counterparty cap on the facility from $30 billion to $80 billion. And without that aggregate cap, the total amount of RRPs that can be issued per day is based on the SOMA.\n\n*The Federal Reserve System Open Market Account (SOMA) is a large account containing dollar-denominated assets acquired through open market operations. These securities serve several purposes. They are:*\n\n* *collateral for U.S. currency in circulation and other liabilities on the Federal Reserve System’s balance sheet;*\n* *a tool for the Federal Reserve’s management of reserve balances; and*\n* *a tool for achieving the Federal Reserve’s macroeconomic objectives.*\n\nSpecifically, the new RRP aggregate cap would be based o*n and limited to the amount of Treasury securities* held outright in SOMA. Right now that total is somewhere around $4T. The Counterparties consist of 50+ banks, Government-Sponsored Enterprises (GSEs), and Investment Managers and their specific Money Market Funds (MMFs). Those last ones are the BlackRocks, Vanguards, and various asset funds of similar scale - the entities for which this whole RRP facility was created to include.\n\n&#x200B;\n\nhttps://preview.redd.it/4bjmmuy8bf171.png?width=1170&format=png&auto=webp&s=364de2f28064a22d0ac69d4bb3cf362158343c1c\n\nWhy the sudden uptick, and what’s with the spikes in the past? The ON RRP facility has typically been used an end-of-quarter reconciliations for banks and GSEs. However, when the COVID bill was passed, a temporary amendment to SLR (supplementary leverage ratios) excluded reserve balances from the calculation.\n\nAs of 3/31, the SLR requires banks to fund reserve balances in part with equity, and since equity is more expensive than debt for banks, when the exclusion of reserve balance ended, it became more expensive for banks to hold reserve balances. So they now send them over to the Fed every night to get the excess reserves off the books.\n\nSo, that means that although the aggregate is seemingly very high, individual counterparty limits can still (and will likely soon) be met. They are able to store this excess cash for free, while being able to make a profit off of the T-Bonds. When or if that happens, we can only speculate on what will occur. Lack of collateral liquidity in order to satisfy short positions, and subsequent margin calls is the main theory. But, this is where we start getting into uncharted territory….\n\n# Value of the Dollar\n\nBefore we begin to go too far down a path of speculation, I want to draw attention to the value of the US dollar - or at least the perceived value. There are a lot, *I mean a lot*, of specifics around FIAT currency and fractional-reserve banking that I don’t think we need to get into for this conversation. But the basics come down to 3 things that affect the value of the dollar at any given point in time:\n\n* Exchange Rates\n* Treasury Notes\n* Foreign Currency Reserves\n\n*Although exchange rates likely will play a major factor, I’ll try focusing on the latter two for this.*\n\nThe value of the dollar tends to move in sync with the demand for **Treasury notes**. In short, the U.S. Department of the Treasury sells notes at a fixed interest rate (yield) and face value; investors bid at a Treasury auction for more or less than the face value depending on demand, and then they can resell them on a secondary market.\n\n*Note: this is different than Repos, there is no obligation to send the T-Bond/cash back.*\n\nA lot of factors determine the yield on 10yr T-Bonds, the main one in focus right now is Quantitative Easing which raises concerns around inflation. Traditionally, that has a negative effect on the 10yr T-Bond yield which in turn weakens the value of the dollar. Something we saw last year was a significant fall in the yield along with a devaluation of the dollar. Yields across all treasuries took a dive, short-term being the hardest hit - some dropping to 0% back in March of 2020. This was obviously just the start of where we are now.\n\nLooking at **Foreign Currency Reserves** are just what the name implies; dollars held within Central Bank Reserves of other countries. Because the dollar is universally accepted for all US exports, foreign countries that have a high ratio of exports to imports take that excess cash and end up stockpiling it in their banks (Japan and China).\n\n&#x200B;\n\nhttps://preview.redd.it/cww9bx2lbf171.png?width=934&format=png&auto=webp&s=24bc8291bee837da36c1d0e3d2382416b0bf6d8c\n\nThis figure shows how many dollars have ended up in foreign reserves since the beginning of the IMF financial operations in 1947. Because there is so much out there, major changes in these reserves can have a compounding effect on the dollar. Meaning if other factors (i.e. QE and weakening yields) cause the dollar to weaken, the value of those foreign reserves inevitably decreases. As a result, they are less willing to hold dollars, and issuing them back into the market increases supply and perpetuates the decline in value.\n\nSo what does that mean right now? **For that, we turn to the IMF**.\n\nA brief history: similar to the Fed, destabilization through economic turmoil necessitated a centralized bank from which countries could borrow cash, specifically dollars. See, import/export deltas are not the only factors affecting the reserves in foreign countries. Through the IMF, they were able to borrow dollars in order to bolster their own economies - especially after WW2. With the inclusion of more countries, the IMF grew to a point beyond which the supply of dollars could support. In 1971 the United States government suspended the convertibility of the US dollar (and dollar reserves held by other governments) into gold. Meaning, no more trading your cash for our gold, instead you can have treasury bonds. After an economic downturn in the late 70s around oil inflation, the IMF changed its policy and operates across 8 major currencies: U.S. dollar, the euro, and, to a lesser extent, the Japanese yen, the British pound, and a few others. However, when crises hit, companies and investors still usually seek safety in dollars. But what’s happening today?\n\n&#x200B;\n\nhttps://preview.redd.it/1ojm4svibf171.png?width=585&format=png&auto=webp&s=fb3ed1023dd4af8b00f73d166e5fe7a239fdd693\n\nForeign countries and investors are losing faith in the dollar, thus exacerbating our already out-of-hand inflationary problems. It’s a downward spiral in the value of USD. So it begs the question of what is the Fed doing? With a mandate geared towards purely domestic conditions around the dollar, the dominance of it on a global scale allows them to set a effectively monetary policy for the whole world. Why would they want to potentially risk losing that? Well, in all reality it seems they’re trying really hard to avoid that! Countries have been diversifying reserves for a while now, well before COVID hit. The excessive QE through the past year has been an effort of staving off what seems to be the inevitable. The US accounts for less than 1/4 of Global GDP, yet the US dollar reserves still remain at 59% - despite now being at a 25 year low. A prime example of the impact of Foreign Reserves on the value of the dollar is this is a recent selloff from Japanese Reserves which lead to a spike in yields. The rise in yields caused by this selling affected the psychology and market views of other investors, who reacted and began selling more themselves. The pressure moved through the market in March, into London hours and then early New York trading.\n\n# Which now leads me to the next, somewhat more speculative section.\n\n**I’d like to quickly cite the following articles that helped me structure and build out that overview before moving into the next section. Highly suggest reading through all of these:**\n\n* [Northern Trust 2016 White Paper on RRPs](https://cdn.northerntrust.com/pws/nt/documents/white-papers/asset-management/federal-reserve-reverse-repo-program.pdf)\n* [Bank Policy Institute ON RRP Overview](http://www.apple.com/)\n* [Dollar Value](https://www.thebalance.com/value-of-us-dollar-3306268)\n* [Declining Global Domination](https://www.ft.com/content/408d4065-f66d-4368-9095-c6a8743b0d01)\n* Federal Reserve Website and Article Links:\n   * [IORB](https://www.federalreserve.gov/monetarypolicy/reqresbalances.htm)\n   * [SOMA](https://www.federalreserve.gov/monetarypolicy/clbs_soma_201003.htm) & [2](https://www.newyorkfed.org/aboutthefed/fedpoint/fed27.html)\n   * [CCPs](https://www.federalreserve.gov/econres/feds/files/2019058pap.pdf)\n   * [Negative Interest Rates on Repos](https://www.newyorkfed.org/medialibrary/media/research/current_issues/ci10-5.pdf)\n   * [RRP FAQs](https://www.newyorkfed.org/markets/rrp_faq_151216.html)\n* IMF Articles and Website\n   * [Dollar Drop](https://blogs.imf.org/2021/05/05/us-dollar-share-of-global-foreign-exchange-reserves-drops-to-25-year-low/)\n   * [Foreign Holdings Changes](https://blogs.imf.org/2020/12/16/glaciers-of-global-finance-the-currency-composition-of-central-banks-reserve-holdings/)\n   * [Reserve Currencies In and International Monetary System](https://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2020/11/17/Reserve-Currencies-in-an-Evolving-International-Monetary-System-49864)\n* [Japan](https://www.wsj.com/articles/how-japanese-investors-accelerated-the-treasury-selloff-11617183002)\n* [Synthetic Share creation (next section)](https://www.youtube.com/watch?v=WvO0RGsh688&t=2s)\n* [Forward vs. Future](https://www.investopedia.com/ask/answers/06/forwardsandfutures.asp)\n\n*\\*Alright, for this next portion please know that this is getting into speculative territory and I am in no way a financial advisor. You should not base any financial decision on this information, please do your own DD beforehand.\\**\n\n# ON RRPs & Synthetic Shares\n\n~~So by now we’ve all heard of synthetic shares, and to a large extent we understand how they’re created. To recap:~~\n\n*~~When constructing a generic synthetic equity position, the portfolio manager uses cash to buy risk-free bonds and takes a long position in equity futures contracts (married put-call). If the portfolio manager already has a position in risk-free bonds, he/she can just add the contracts. This combination of bonds and futures replicates the performance of the equity without actually having an equity position. Hence, a synthetic share is born in the form of a forward contract on the same underlying asset.~~*\n\n~~So let’s talk about these resulting forward contracts, and how they differ from futures contracts:~~\n\n~~Both forward and futures contracts involve the agreement to buy or sell a commodity at a set price in the future - in our case, a short sell (betting on the price to go down).~~ **~~While a forward contract does not trade on an exchange, a futures contract does.~~** **~~Settlement for the forward contract takes place at the end of the contract,~~** ~~while the futures contract settles on a daily basis.~~ **~~Most importantly, futures contracts exist as standardized contracts that are not customized between counterparties.~~**\n\n~~So let us clarify; a synthetic share necessitates a risk-free bond to offset a put-call parity and match the exact price of the underlying asset. US T-Bonds make really great risk-free assets. These synthetic shares create not additional futures contracts but~~ *~~forwards contracts~~* ~~which operate differently, namely they can traded OTC and do not have to be settled until the end of the contract. This helps to explain consist dark pool usage without ramifications, increased FTDs, as well as explosion in demand for US T-bonds. They need to use them to create synthetic forwards contracts on underlying equities in which they hold major short positions. Hence why we keep seeing so many GME shares available to borrow every. single. day.~~\n\n~~The other side of the argument is that banks and HFs are using these T-bonds being lent via ON RRPs to satisfy FTDs on outstanding short positions, for the T-bonds themselves. This supports the Everything Short Theory, and I believe that this is happening, but not to the extent we thought. These institutions short the treasury bonds based on the same negative sentiment that causes foreign reserves to slowly decrease - people are losing faith in the dollar. I believe however, based on the Counter DD to the Everything Short Theory, that all of these firms hold long positions in T-Bonds to offset their shorts adequately - which is not the same case for GME. These banks, GSEs, MMFs, etc. need a strong value of USD just as much as the Fed to properly be able to operate and “make the markets” - making them money.~~\n\n# So in conclusion, my theory is this:\n\n~~The Federal Reserve is doing everything in its power to maintain its foothold as the global monetary policy maker. Prior to COVID, they saw declining foreign reserves on the horizon and lowered the yield to increase value and demand of the dollar. COVID hit and there was no choice but to implement record-breaking QE measures, however uncertainty across the globe was prevalent, and drove the T-Bond yield to unprecedented lows. Now we’re seeing the opposite process through ON RRPs which allow counterparties such as banks and MMFs to borrow T-Bonds and avoid paying negative interest rates on the repo market. This serves two purposes in pulling cash out of circulation, in an attempt to stave off inflation, while also satisfying the increased demand for T-Bonds, attempting to put off the MOASS for as long as possible.~~\n\n~~This increased demand is fueled by two things:~~\n\n1. **~~Utilization of T-Bonds as Risk-Free collateral in the creation of synthetic equities~~**\n2. **~~Satisfying settlements on outstanding T-Bond short positions~~**\n\n~~The Fed does not want a MOASS resulting in devaluation of the dollar, and their subsequent loss of power on the global stage. There is talk about how taxes paid back to the IRS after the MOASS would pay off a huge chunk of national debts. Why would the Fed want that? That debt is their leverage over monetary policy! They want to perpetuate spending, increasing the debt and issuing endless amounts of RRPs to keep kicking the can down the road. Just keep to the status quo - as dictated by Mr. Jerome Powell himself.~~\n\n~~To be clear, I am not the biggest fan of central and fractional-reserve banking, in fact I think it is the root of all major issues plaguing humanity. However, I’ve tried to provide an objective look at the history, functions, and present impact it all has on the current situation.~~\n\n&#x200B;\n\n***~~to summarize - I do not think the Fed is willingly allowing the short-sale of Treasury bonds - because it’s just not happening on as big of a scale as hypothesized. However, to explain the demand for these T-Bonds, I believe they are allowing utilization of T-bonds in the creation of additional synthetic equities in order to push off the MOASS, and the impending inflation that follows.~~***\n\n&#x200B;\n\nWhat this means for the MOASS and GME, I honestly don’t know. From my perspective, it could theoretically go on for a very long time. Potentially forever if the Fed is willing to continue increasing the counterparty cap for ON RRPs, and increasing the SOMA Treasury balance (aggregate cap) through QE. My gut tells me that’s just not possible, and I have to believe that exposure of this activity on a grand scale will be the catalyst we need. Hence this write-up. I hope it was informative and helpful, please feel free to ask any questions and/or poke any holes in this theory.\n\nWith that I propose a 4th commandment to the coveted chimp creed:\n\n**BUY.HODL.VOTE.SHARE. 🦍🚀👊💎🔊**\n\n**To** u/crazysearchjefferson **and all mods, I would be very curious to get your take on this.**\n\n&#x200B;\n\n# EDIT:\n\nFor those visiting, or revisiting, I just wanted to post some updates stemming from further research and conversations with fellow users:\n\n* \"Losing faith in the dollar\" carries a strongly negative connotation, implying a rapid or sudden change in international monetary dynamics. To be clear, these are macro moves that happen on much longer timelines than we might be used to - although the past 5 months do feel like a lifetime.\n   * In addition to that point, we have to consider motives of other central banks and governments not wanting to remain beholden to the monetary supply set by the US/Fed. It might not so much be losing faith in the dollar, so much as it is gaining faith in their own/another country's currency.\n* The Fed is speculated to permanently establish an ON RP facility - the opposite of what we are talking about here, that can facilitate liquidity directly with MMFs and corporate funds on BOTH sides of the Repo market\n   * [https://www.marketwatch.com/story/fed-officials-express-support-for-permanent-repo-facilities-in-april-minutes-11621463892](https://www.marketwatch.com/story/fed-officials-express-support-for-permanent-repo-facilities-in-april-minutes-11621463892)\n   * [https://www.bloomberg.com/opinion/articles/2021-05-25/fed-aims-to-radically-transform-funding-markets](https://www.bloomberg.com/opinion/articles/2021-05-25/fed-aims-to-radically-transform-funding-markets)\n   * If this is true, the Fed can entirely circumvent the current primary brokers who do not always operate in line with the Fed's monetary policy.\n      * It could be theorized that the Fed is planning to have a plan of operation for managing liquidity in the repo market for if/when some of these primary dealers no longer are able to perform their obligations ***(marge... marge is that you calling?)***\n   * They already have one created specifically for foreign reserves (FIMA) to issue overnight RPs to countries that need temporary cash, so a similar would be instilled domestically -\n      * [https://som.yale.edu/blog/fed-creates-dollar-repo-facility-for-central-banks-extending-liquidity-to-central-banks-that-don-t-have-fed-swap-lines](https://som.yale.edu/blog/fed-creates-dollar-repo-facility-for-central-banks-extending-liquidity-to-central-banks-that-don-t-have-fed-swap-lines)\n* Everything Short Theory Being 'validated' via House Committee Hearings:\n   * while I do still think that institutions are shorting treasury bonds, I still hold to the assumption that it's a hedge more so than a large-scale affront on the bond market.\n   * From what I understand, we have to raise the debt ceiling by July 31st or risk those T-Bonds defaulting. I feel like that’s why the Congressman references the crisis in 2011 at the beginning.\n   * This article kinda describes what this congressman is worried about\n      * [https://www.google.com/amp/s/www.wsj.com/amp/articles/u-s-treasury-evaluating-various-scenarios-for-debt-limit-reinstatement-11620217869](https://www.google.com/amp/s/www.wsj.com/amp/articles/u-s-treasury-evaluating-various-scenarios-for-debt-limit-reinstatement-11620217869)\n\nThanks again for reading, again - be kind to one another",
    "title": "The Fed, Repo Market, and Over-leveraged Equities",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nlbsgy/the_fed_repo_market_and_overleveraged_equities/"
}