{
    "author": "fusionnnnnnnha",
    "created_utc": 1626561396.0,
    "distinguished": null,
    "edited": 1626571906.0,
    "id": "omeb9e",
    "text_only": true,
    "flair_text": "💭 Opinion 💭",
    "name": "t3_omeb9e",
    "num_comments": 1247,
    "permalink": "/r/GME/comments/omeb9e/gmes_gambit_how_we_were_almost_all_fooled_by/",
    "score": 4735,
    "selftext": "**Update:** u/pinkcatsonacid **just removed this from the new sub** r/GMEJungle  **just as it was getting traction**. **~~No answer or explanation.~~** **~~Looking very very sus.~~**\n\n[https:\\/\\/www.reddit.com\\/r\\/GMEJungle\\/comments\\/omf35n\\/gmes\\_gambit\\_how\\_we\\_were\\_almost\\_all\\_fooled\\_by\\/](https://preview.redd.it/o4r3d6rmbvb71.png?width=689&format=png&auto=webp&s=a0333c57f1d181b9c3029272f64d6dd67b789621)\n\n**Update 4:**\n\n[Looks like r\\/gmejungle is being brigaded and reported to oblivion. Very Bullish. Moass incoming? ](https://preview.redd.it/auww4bjcjvb71.png?width=641&format=png&auto=webp&s=165dcbf215bb18a4a209375dd416a39a4099fd2a)\n\n&#x200B;\n\n**UPDATE 2: UNDENIABLE EVIDENCE OF MOD SHILL FUCKERY by** u/MoonTellsMeASecret[reddit.com/r/Superstonk/comments/ombmj8/i\\_smell\\_bullshit/](https://reddit.com/r/Superstonk/comments/ombmj8/i_smell_bullshit/)\n\n**Update 3: Lots of shills commenting BUY AND HODL. IGNORE THE DRAMA. NO ON CARES!!Now why would I or any real ape ignore the people fucking us? Are you actually retarded? Or more likely just a shill.** [Apparently at least 10,000 apes do care.](https://www.reddit.com/r/Superstonk/comments/om5wan/red_you_need_to_step_down_you_based_this_entire/)\n\n**These are the same people who will be saying I SOLD! THE STOCK IS GOING TO DROP when we squeeze.**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**GME's GAMBIT**\n\nhttps://preview.redd.it/vhr2fz52nub71.png?width=744&format=png&auto=webp&s=13523cf08c64a5529a7feecb2259d33fbacbdbf5\n\n&#x200B;\n\nYou've been misled to believe hedgefunds are playing checkers. Surprise, they're not. But they want you to think they are. Don't underestimate them.\n\n**Why is all of this FUD happening in superstonks right now?The more important question however, is** ***why?*** \\*\\*Why string the community along?\\*\\*We're all going to be millionaires so why do a lousy job at moderation? Why the drama and Fud?Why the lack of transparency and delay in response? Why try and protect your image with PR?Who gains from confusing and distracting apes? **Simple, only hedgefunds and those short on GME.**\n\n**Users are claiming it's all unintentional. I disagree and this post will prove why they're setting up you and every ape here to get fucked, right in front of your eyes for the last 6 months.The drama is the misdirection.We've all been manipulated the last 6+ months to trust these individuals and go against our own instinct even in the face of damning texts, posts, screenshots, chat logs, and behavior.Their covers are breaking and their true colors are being shown for the first time.You never see a punch coming just by looking at the hand, you need to look at the entire body.The bigger picture.**\n\n&#x200B;\n\nhttps://preview.redd.it/k43qyfz8nub71.png?width=567&format=png&auto=webp&s=d7aba3733c2ab818ebd4f0b39661f56380c8d8a2\n\nTrust me said the scorpion\n\n**TLDR:** Renshill co-opted the daily news and paid shills were likely used to boost him/ redshill/ wardumb to create their cult following who would downvote/dismantle/suppress any dissent/questioning. Remember all the appreciation posts and mod worship? I sure do. Redshill is his accomplice. Wardumb was the bait/distraction. These are the SAME original 3 that split everyone from the first GME sub with \"drama\". Now they're splitting Superstonks.**These are some hefty claims, sure. The proof is below.**\n\nThey called it \"drama\" but it's all intentional and coordinated chaos on their behalf. I know many give them the benefit of the doubt but that's much too generous for the architected and coordinated damage they're causing.\n\n**It's not drama. It's an act**. They're going to come out with a PR written statement to try and salvage their reputations for Monday so that apes still trust them. **They've so far been unsuccessful in dividing apes but their true intention could be to create the MOAF (Mother of all FUD) when the MOASS triggers or worse, their last tactic could be to nuke superstonks as their cover is starting to fall apart.In true shill hedgie fashion, their plans have backfired and actually united apes. We're early on their plans, but we're definitely not wrong. But where's the proof? Show me! Read below.**\n\n**Now that the truths come out about the mods this last week, we can see things clearer now.**\n\n&#x200B;\n\n**First, an appetizer of their greatest hits by** [u/fusionnnnnnnha](https://www.reddit.com/user/fusionnnnnnnha/) **:**\n\n**Renshill: Snapshot from a thread yesterday. Apes don't forget. In fact, many remember.**\n\n&#x200B;\n\nhttps://preview.redd.it/f8ejs87anub71.png?width=744&format=png&auto=webp&s=16fc4f7986e4486f105a4d4ed6d3dbf060ddc9d7\n\nComments from today\n\n**a comment chain from wardens disgusting comments from 2 months ago calling it**\n\n&#x200B;\n\nhttps://preview.redd.it/srt5x6ucnub71.png?width=737&format=png&auto=webp&s=d3950cc858631a2e3799d0a575290f238dc1dbbf\n\nComments from 2 months ago\n\n**Red Shill Queen:** [If you didn't think Redchessqueen99/mods/superstonk was compromised by now, here's photo proof posted 2 months ago.](https://www.reddit.com/r/GME/comments/n92t2w/if_you_didnt_think_redchessqueen99modssuperstonk/)\n\n&#x200B;\n\nhttps://preview.redd.it/6g5obkqenub71.png?width=903&format=png&auto=webp&s=659ee37934576b71da5a44c173a2bbece341ea8e\n\n&#x200B;\n\n**Warden:** [This post on Warden was also one of the many removed from superstonks](https://www.reddit.com/r/GME/comments/ndis14/you_finally_exposed_yourself_beyond_a_reasonable/)\n\n&#x200B;\n\nhttps://preview.redd.it/v2q907ifnub71.png?width=742&format=png&auto=webp&s=065499413a4f8c751f5c90ad70344a0544e1297c\n\nhttps://preview.redd.it/qrqfts1gnub71.png?width=751&format=png&auto=webp&s=e21897d7ffecbe4b8537f7f557704134ca1945e6\n\n&#x200B;\n\n**Post from 3 months back calling it. Apes have been seeing it:** [Wardumb delete](https://www.reddit.com/r/GME/comments/mhzgwg/whether_you_like_it_or_not_warden_is_the_new/)\n\n&#x200B;\n\nhttps://preview.redd.it/qgnkd40hnub71.png?width=745&format=png&auto=webp&s=35851ccde2efd2f8701def5ff9c942f9a3302a38\n\n&#x200B;\n\n**BONUS: Satori.**\n\n[Renshills stonewalls then bans reputable DD writer u/mybustersword for inquiring about Satori after just 15 minutes](https://www.reddit.com/r/Superstonk/comments/nruy5r/renshill_why_did_you_ban_a_superstonk_user_within/)\n\n**Even if it was just far out speculation, why immediately ban him if he was just asking questions that were connecting rather than just being transparent? What are you hiding? Why all the smoke and mirrors? Deflect, obstruct, ignore. Classic renshill. \\*chefs kiss\\***\n\n[u/mybustersword](https://www.reddit.com/u/mybustersword/) can probably elaborate more on his experience with what happened.\n\n&#x200B;\n\nhttps://preview.redd.it/lekmnibinub71.png?width=1276&format=png&auto=webp&s=bb97da00dfccdcc18349fca5573ef35f38c79f8e\n\nScreenshots were taken a month ago\n\n&#x200B;\n\nhttps://preview.redd.it/ku19qwhjnub71.png?width=960&format=png&auto=webp&s=6551436f242d62f0ffc80c35fe89eb90a26fd39e\n\nScreenshots were taken a month ago\n\n&#x200B;\n\nhttps://preview.redd.it/j7vldvxjnub71.png?width=1284&format=png&auto=webp&s=baca2741d713f2d73c2dc62273f97fb24b41b409\n\n&#x200B;\n\nhttps://preview.redd.it/f0693gilnub71.png?width=640&format=png&auto=webp&s=4fc5b1f01ebfa92c08c2b60eac0193624ee2bba1\n\nScreenshots were taken a month ago\n\n**BUT RENSHILL, IM JUST HERE FOR THE STOCK. JUST BUY, HODL!!!!** \\-says every shill trying to misdirect from the actual problem and cancer at hand. I'm sure every ape has felt betrayed/wronged from mod actions the last few weeks, why would anyone real just be fine with that? Especially now that we're seeing more signs of infiltration? Who would want to distract from that, oh hedgies. As always. Why? Because they want you to look at the hand. Focus on it. Get tunnel vision. Just buy and hold and don't pay these people who are actively fucking you any attention at all. Be distracted so you don't see the incoming fist imploding on your face.\n\n&#x200B;\n\nhttps://preview.redd.it/715epiaonub71.png?width=2494&format=png&auto=webp&s=66d6012386bc2094bb69143b27b73564934f3ad1\n\n\\*\\*Furthermore, we all know to hold. That's second nature now. Holding literally takes nothing.\\*\\*So why can't I call out the very people fucking me and fucking the community over?\n\nIn my honest opinion, I have a hunch the shills are calling it \"**MOD DRAMA**\" trying to play it off as **harmless** and **innocent**, which **it isn't at all**. **To say that Renshill and Redshill did these things for \"nudes\" or to \"simp\" is a convenient cover for what they're actually doing. Infiltrating, manipulating, and deceiving**. These aren't innocent teenagers just \"messing around\". We all understand the stakes at play here. They do more than anyone being moderating and being involved every single day as they have been. **There are billions if not trillions of dollars on the line.** You would have to be naive to think that they are just causing \"teen drama\". I don't believe either are retarded enough (as they might claim) to do otherwise. **Call it what it is, FUD. They weren't set up. They are the set up. Why do you think madie hasn't been banned as soon as this came information came out? Anyone mod who learned they were manipulated would instant ban the perpetrator especially with the outcry from apes. So why has nothing happened still? Because they're all in on it together. Unanimous vote to kick out the one person who found out about this? Doesn't scream innocent to me. Doesn't scream victim to me. Misdirection. Don't fall for it.**\n\n**It seems many of you have forgotten.**\n\n**Appear weak when you are strong, and strong when you are weak** — Sun Tzu. The supreme art of war is to subdue the enemy without fighting. If you know the enemy and know yourself, you need not fear the result of a hundred battles.\n\n**Okay, great Renshill! BUT THIS IS ALL STILL SPECULATION!!! These are interesting posts but how can you prove these claims for sure with solid proof? Well, if you're still in denial...**\n\n**All of the above was just foreplay. Here is where they really get fucked.**\n\n&#x200B;\n\nhttps://preview.redd.it/4iiw0btpnub71.png?width=2405&format=png&auto=webp&s=8423a6e5449e40e97b8091f3635c3084bfcce7b5\n\nAbove: Just a mere fraction of how much Renshill, Redshill, and Wardumb are about to have their cover blown.\n\n**DEEP DIVE BY** [u/Gzurnenplatz](https://www.reddit.com/user/Gzurnenplatz/) **OVER 2 MONTHS AGO. Combing over everything with a microscope.**\n\n[Pt 1 Understanding how manipulation works & the gme beginning](https://www.reddit.com/r/GME/comments/mtyjbi/superstonk_is_sus_an_investigation_into/)\n\n[Pt 2 How to spot a deep fucking operative & the king](https://www.reddit.com/r/GME/comments/mtyk40/superstonk_is_sus_an_investigation_into/)\n\n[Pt 3 The queen and the jester](https://www.reddit.com/r/GME/comments/mtylq0/superstonk_is_sus_an_investigation_into/)\n\n**First, the basics.**\n\n**Part 4: How to Spot a Deep-Fucking-Cover Operative for apes**\n\nDates: April 11th to 12th, edits on 17th.\n\n&#x200B;\n\nhttps://preview.redd.it/wmeo5tgqnub71.png?width=700&format=png&auto=webp&s=1aa529e06aa06e7bad5ac85a586eec800aa69a48\n\n**Professional manipulators are selectively trained experts, often have years of practice, and are supported by large institutions with access to substantial resources** – usually the police, military, or 3 letter agencies. Unravelling a professional undercover plot is significantly harder than recognizing amateur manipulation.\n\nWhen an undercover operative first approaches a community they intend to infiltrate, there are a few specific things they will do to ensure they are not suspected from the start, as well as some notable behaviors they may exhibit over time. Understanding these can make them possible to spot, and while they definitely don’t guarantee that someone is an undercover, they do serve as good indicators.\n\n**General indicators of an undercover:**\n\n1. **Having an uncanny but powerful charisma about them, though often expressed subtly.** Meeting a professional manipulator ‘in character’ is a truly bizarre experience in hindsight. Essentially it feels like encountering someone for the first time that you’ve somehow already known your entire life. Their subtle behaviours, such as vocal inflections, mannerisms and facial expressions, feel weirdly familiar, almost nostalgic, as if from someone you knew from before you can remember. Most people are put at ease by this, becoming more relaxed and open, but if you look very carefully (without making them aware you are doing this), it is sometimes possible to detect the inauthenticity just beneath the superficial surface.\n2. **Being keen to provide upfront explanation (justification) for any character incongruities in their appearance, behavior, or backstory.** This is to cover anything that may otherwise make them look out of place in the community, and the explanations given will ultimately be unverifiable – it may be technically possible to prove, but this proof itself is either implausible to obtain, or could be easily faked.\n3. **Being vague or evasive about their history, and providing unsubstantiated and unverifiable ‘facts’ that aren’t positively reflected in their character.** This is important, as being vague means no truth is committed to – they can be more flexible later if needed, and are less likely to be caught contradicting themselves. When (gently and carefully) pushed, they will typically produce something more, but once they say anything concrete it can’t be undone, so it must be committed to memory.\n4. **Sometimes in crucial conversations, particularly when discussing activist-related theory or personal motivations, they sound more like they’re speaking from memory than intuition.** This one is very difficult to describe, but basically their speech will be slightly more uniform and consistent in an uncanny way, as well as subtly ‘flat’ sounding – relative to how they regularly speak, of course. Basically, it will sound rehearsed. On the other hand, if someone really believes in the ideas and goals of the group they’re in, this is usually apparent in the enthusiasm and spontaneous energy in their language.\n5. **Doing something illegal early on**. Most people naturally find it difficult to believe someone could be a cop if they, for example, take hard drugs, vandalize a bank, or fight other cops in the street (all happened btw). The crime(s) will be done with or in front of trusted members of the community, who then become believable accounts that ‘prove’ the undercover can also be trusted.\n6. **Taking on a workload, or demonstrating a skill-set, that is disproportionately greater than what can normally be expected.** Any undercover cop will have a small team working behind the scenes to provide them with intelligence briefings, character guidance, and supporting materials. Accordingly, undercover cops will often seem to become surprisingly good at everything within just a short period of time, and will simply be able to get more stuff done than others can.\n7. **Providing somewhat different behavioral narratives (including stated motivations, desires and goals) to different people, then performing actions that are subtly inconsistent with all of them, but still technically ‘fit’.** In other words, they are two-faced, but very good at getting away with it. This is how it appears when someone is setting narrative absences while masking their behavioral anomalies in a cohered manner. This can be particularly difficult to spot, but having information from multiple perspectives can make it easier… Assuming you know the people you’re conferring with aren’t undercovers as well.\n8. **Bringing more sus people in. Getting the first undercover inside is the hardest part, but once one cop is reasonably trusted they can start slowly introducing others**. These additional undercovers can often be even more suspect and unverifiable than the original, because a key aspect of their trustworthiness is they already know someone ‘trusted’.\n\n&#x200B;\n\nhttps://preview.redd.it/zrg0kf6rnub71.png?width=798&format=png&auto=webp&s=73286094d5d65580ca70ed0f3608e7825e189f86\n\n**It is a common misconception,** often reinforced in the Hollywood spy genre, **that undercovers work alone. In reality, undercovers rarely work alone; where there is one, there are others to back them up and support them**. Once they are settled into the community, they don’t stop there either, as the eventual aim is for them to have full control. This usually comes about through a structured pattern of sowing confusion, manipulating inter-personal drama, then initiating a significant event that will (to the keen eye) usually resemble a ploy of some kind. This can be a soft organizational coup, but most of the time members are too wary to let something like that happen. More often, undercovers instead gain control of the community by engineering a conflict, instigating a split, and forming a new group where they informally take charge. The greater the outrage they can manufacture against the original group, and the more people they can bring over to the new one, the greater the success of the operation. Does this sound familiar?\n\nIn the build-up to the ploy, **undercovers will typically fall into either a general ‘leader’ or ‘support’ role.**\n\n**The leader is the most common role for an undercover,** and in my experience they are usually cisgender males. While they may begin as a fairly quiet background character, their final form is never simply a lurker; their goal is not merely to observe, but to influence. For example, in activist groups, surprisingly it is frequently the most militant, active and ‘with it’ people that turn out to be cops (not saying most active militants are cops, but that most undercovers perform as active militants). They do this to position themselves as an informal leader within an otherwise leaderless organization, and steer the group towards their own ends.\n\n**Two indicators for a leading undercover:**\n\n&#x200B;\n\nhttps://preview.redd.it/hkotl3rrnub71.png?width=400&format=png&auto=webp&s=f0745003e242374f513a0531023dcd09b1d03ff1\n\n**9) Controlling the discourse**. What they say may not always make the most sense, but they will be vocal, persuasive, and project a vibe of authority without really seeming to try. They are often keen to chair meetings, plan agendas, and finalize written statements. Basically they tend to get their own way without it coming across like that.\n\n**10) Accruing status, and then choosing to utilize it.** This is one of the late signs of power formation, and may be difficult to reverse once it has gotten this far. At this point, they are not yet properly in the position of informal leadership, but they likely hold a small sphere of influence within the wider community. Behaviors will include gently pushing people towards actions they may not wish to take otherwise, passively dominating decision making through having multiple allies, and carefully praising or rewarding people *as if* they are an authority.\n\n**For a leading undercover, general indicators tend to be possible to spot because they’re always ultimately trying to achieve something overarching, rather than simply vibing while having personal goals.** They swim upstream, so cannot help but be in motion – we can detect this motion. Also because their true motivations are concealed, we can expect to see their ‘character arc’ evolve in a slightly incoherent and disjointed manner. Once the ploy is revealed, it may be possible to reasonably confirm they are an undercover, but until that moment it’s all just suspicions – hence why these cases are rarely solved until too late.\n\n**The support is the next most common role adopted by an undercover, and they only ever exist in relation to an undercover leader**. They tend to be more difficult to identify, as their primary narrative functions tend to be indirect and less obvious. Typically their purpose is to facilitate the leading undercover in positioning themselves as a leader, while minimizing suspicion against both of them. It is common for a support character to act in a romantic relationship with their respective leader.\n\n**Some indicators for a supporting undercover:**\n\n**11) Humanizing a suspect leader.** This includes confirming their context and background (“Oh yeah we go way back, we actually met on a bus in 2013...”), discussing their character while they aren’t around (not necessarily in an entirely positive way, just talking about them as if they’re real), and publicly performing (rehearsed) dialogues allowing the leader to temporarily appear vulnerable or flawed in a controlled setting.\n\n**12) Giving frequent explanation and excuses for a suspect leader’s behavior.** “How come you’re saying this now when a month ago you said the opposite?”; “Amazing how you’re able to do so much organizing and still hold down a full-time job – where is it you work again?”; “Woah, where did you get all this great intel from anyway?” If the leader is constantly seen as being on the defensive and having to justify themselves, it raises suspicions. A support can jump in to respond, or more commonly, anticipate questions that are likely to be asked, then provide answers upfront and unprompted during semi-related discussion when the leader isn’t around.\n\n**13) Consistently upholding a suspect leader’s account of the truth.** This means siding with them during simple ‘he said, she said’ disagreements, helping twist current narratives to align with the leader’s goals, and including the same crucial, fabricated detail(s) when recounting historical events.\n\n**Support indicators are much harder to spot**, mostly because they are so benign at face value, and can all be easily misattributed to any normal person. Before the ploy takes place, a support undercover will effectively only be suspect through their proximal relationship to a much more suspect leading undercover – suspicion through overly-convenient association. Once the ploy is executed, then it becomes more clear who the support undercovers are, as they tend to play a central role in whatever transpires – guilt through being complicit.\n\n**There are two other types of undercover cop roles I have noted in the past.**\n\n**The ‘device/diversion’ undercover is an actor with a more specific role, usually revolved around indirectly facilitating the ploy in some way**. By basically only being an object in the plan, it usually doesn’t matter how suspect they are, as they are not visibly moving anything along. This means they can also serve effectively as a punching-bag for suspicions, as for some reason most regular people in these situations tend to only be suspicious of one person at a time. They can usually be identified by general indicators.\n\n**The final type is ‘monitor’. This is an undercover role that is generally assumed to exist, but it’s almost impossible to tell who they may be.** Their entire purpose is to simply exist in the background, watching everything happen, and memorizing as much key information as possible. They will typically be someone unassuming, quiet, and boring. This won’t be relevant to our situation here, as Reddit is already a public platform.\n\n**The fact we’re dealing with a potential manipulation in the digital world does somewhat alter the playing field.** Indicator 1 will be impossible to find, as this can only be seen during direct face-to-face contact. It will be substantially harder to identify indicator 4, as only having access to recorded audio means a lot of quality is lost. I also cannot say much for indicator 8 because I was not close to the mod team at all. However, since everything is publicly available and stored for later viewing, indicator 7 should be easier to spot.\n\n\\*\\*Now that you have an idea of how these people behave, let's dig into it.The perpetrators. Hold on to your socks, we're going deep.\\*\\****Section 2: The King Renshill***\n\n&#x200B;\n\nhttps://preview.redd.it/m0k7j7esnub71.png?width=315&format=png&auto=webp&s=c6c15fe7a74ff359ae5bd78adf3bbb2966ae626a\n\n***Section 2:*** **coming Later today. The Psychology and behavior of the KING Renshill.**",
    "title": "GME's Gambit. How we were almost all fooled by Rensole, Redchessqueen, and Wardenelite from the very start. The truth about their deception. Their end game unsuccessful and how their last strategy could be to nuke Superstonks / MOAF (Mother of All Fud). Damning evidence. Part 1/3",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/GME/comments/omeb9e/gmes_gambit_how_we_were_almost_all_fooled_by/"
}