{
    "author": "Hiftee",
    "created_utc": 1625314572.0,
    "distinguished": null,
    "edited": 1625330502.0,
    "id": "ocwykh",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ocwykh",
    "num_comments": 717,
    "permalink": "/r/Superstonk/comments/ocwykh/the_hype_and_excitement_for_an_announcement_has/",
    "score": 8377,
    "selftext": "I’m hyped every day the market is open. Nothing wrong with getting excited for stuff, I love it. But it’s starting to feel like people are expecting an announcement is forthcoming like it’s a done deal, and I have no idea where it’s coming from. I don’t think it’s common for a company to raise cash via selling shares then turn around and pay a dividend, seems counterintuitive. A customer service rep with a sunglasses emoji doesn’t mean much, those folks aren’t plugged into to any significant info. The 741 dissection is going nuts. And the July 14th NFT thing also doesn’t mean an announcement needs to happen at that time either. It’s all just speculation.\n\nAll this feels like a good opportunity for an enemy combatant to take some fun speculation and run a massive hype campaign to raise expectations only for them to get smashed when nothing happens. AGAIN. Remember, they are backed into a corner and their ONLY weapon is psychological warfare.\n\nNot worried about apes that have been here for months, moreso newer apes that maybe haven’t been through an “emotional pump and dump” before. And I do see a lot of comments in these hype posts saying they don’t care about dates, which is great. But it really feels like someone is taking the hype ball and overinflating it on purpose. \n\nStay vigilant, stay hyped, but stay grounded.\n\nEdit: if I could change the title, I would rephrase to say “investor related announcements”. The gamer in me is excited to see what they’re cooking up. But the investor in me is not expecting to hear anything on the 14th, but I’d be happily surprised if we did.",
    "title": "The hype and excitement for an announcement has turned into expectations. GameStop hasn’t said anything indicating an announcement is coming, this is all coming from speculation and it feels…unnatural.",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/Superstonk/comments/ocwykh/the_hype_and_excitement_for_an_announcement_has/"
}