{
    "author": "ChudBomB",
    "created_utc": 1625314854.0,
    "distinguished": null,
    "edited": 1625325813.0,
    "id": "ocx0zl",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ocx0zl",
    "num_comments": 152,
    "permalink": "/r/Superstonk/comments/ocx0zl/youve_heard_of_a_backhanded_compliment_right_well/",
    "score": 3614,
    "selftext": "For those unsure of the definition of a backhanded compliment:\n\n**An insult disguised as a compliment\n\"No, honey...I love yours. I don't even like them big.\"\n\"Relax, sweetie...you were perfectly adequate.\"\n\"Your haircut really slims your face.\"\nSince Michael is a pompous prick, I think I'll give him a backhanded compliment.**\n\nNow lets get onto backhanded FUD:\n\n**A message which appears as it has good intentions, but highlights the negatives which has been spewing across MSM. For example...\n\"My mate who is a fellow ape, was telling me he was watching something on TV about how ridiculous it would be for GME to hit crazy prices\"**\n\nOr\n\n**Spreading a negative article from a news site with the title, \"Hahaha MSM is so full of shit\"**\n\nThis is psychology 1-0-1, there is a subconscious message hidden within the backhanded subject.\n\nI've tried to highlight this before, but hopefully this gains more traction.\n\nHave a great weekend everyone.\n\nEdit: So the purpose of the post wasn't to scrutinise anyone, but to bring awareness to what they might actually be reading. The community is great at self policing itself in tandem with the Moderators. There are people with very different experience levels in trading, which in turn can affect emotional levels of those lesser exposed to the bullshittery that goes on. We look out for one another here.",
    "title": "You've heard of a backhanded compliment right? Well how about backhanded FUD?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ocx0zl/youve_heard_of_a_backhanded_compliment_right_well/"
}