{
    "author": "soIcanPlayBanjo",
    "created_utc": 1618676876.0,
    "distinguished": null,
    "edited": false,
    "id": "mstvkk",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_mstvkk",
    "num_comments": 5,
    "permalink": "/r/Superstonk/comments/mstvkk/i_could_easily_believe_in_madoffs_existence_but/",
    "score": 27,
    "selftext": "Just a thought. It was so easy for me to believe that all types of snakes like Madoff exist - that take people's money and run. But I could not easily trust the existence of a man who just believed in a business and held to his guns. Who is not running some pyramid scheme to profit off the masses. And that is a shame.\n\nAfter months of me learning and reading DD, learning to believe in others (thank you u/rensole and Pixel - not sure if he's on here, I've been trying to stay off Reddit as much as possible) I was 150% convinced that this is, indeed, is the way. They can shroud the road with thorns and traps, they could take everything that exists in paradise and hide it, but I have the location mapped - etched deeply in my mind. There's a certain power you obtain when you KNOW something to be true. The entire world can lie to you for as long as they want. That is a power I don't believe I have ever had about anything in the past.\n\nThis translated into me having hope for the future, and in the good of people. I know I'm gonna get a shitload of money at the end of this, but fuck, the change in mindset alone is worth it.\n\nSo, Keith, aka RoaringKitty, aka u/deepfuckingvalue thanks for just fucking being genuine. You don't see that much nowadays. I have always loved GameStop and money so this is right up my alley. But there's so much more to it now.\n\nKeith Gill is just a man. If he were a cat, I might idolize him. But... also... Jesus was a man. So take that as you wish. I, however, am ape.\n\nI love this fucking stock and I love you fucking apes. FUCK.",
    "title": "I could easily believe in Madoff's existence, but not Keith Gill's",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/mstvkk/i_could_easily_believe_in_madoffs_existence_but/"
}