{
    "author": "ChippThaRipp",
    "created_utc": 1617307958.0,
    "distinguished": null,
    "edited": 1617325247.0,
    "id": "mi3xdt",
    "text_only": true,
    "flair_text": "News 📰",
    "name": "t3_mi3xdt",
    "num_comments": 197,
    "permalink": "/r/GME/comments/mi3xdt/dtcc_new_proposed_rule_change_dtc2021005/",
    "score": 3169,
    "selftext": "Document can be found here:\n\n[https://www.dtcc.com/legal/sec-rule-filings](https://www.dtcc.com/legal/sec-rule-filings)\n\nThis was posted just after market close today. I'll be updating this post with more information about the rule change as I read it.\n\nIt appears as though they are tightening up the requirements on short selling, requiring the short position to actually borrow or own the stock they sold short...\n\nThe proposed rule change will affect two documents; **\"DTC Settlement Service Guide\"** and **\"DTC Pledgees Agreement\"**\n\nI will continue to update throughout the night. I also see other posts about this topic and recommend viewing those as well.\n\n&#x200B;\n\nFirst, lets understand some of the terminology used here.\n\nWhat is a Participant, Pledge and Pledgee?\n\nHow I am reading this is that a participant is a member who has an account with the DTC. A Pledge is the person who is lending a security, and the Pledgee is the person receiving the lent security.\n\nWhen a Participant **pledges** securities to the pledgee account of a **pledge** at **DTC** (sometimes called a “hard **pledge**”), the securities are under the sole control of the pledgee. Only the pledgee can redeliver or release the securities. Pledgee accounts continue to be available at **DTC**.\n\nOk, now let's begin.\n\n&#x200B;\n\n>Purpose:  \n>  \n>The proposed rule change of DTC would modify the Settlement Guide and the form of Pledgee’s Agreement, as described below. Specifically, the proposed rule change would revise text in the **Settlement Guide** and **Pledgee’s Agreement** to clarify the text with respect to the processing of book entries of Pledge-related activity at DTC. **The proposed revisions would  reflect in the text of the Settlement Guide and Pledgee’s Agreement that Pledged Securities remain credited to a Pledgor’s Account unless the Pledgee makes a demand for the Pledged Securities, as described below**. In this regard, the respective texts of the Settlement Guide and the Pledgee’s Agreement currently indicate that Pledged Securities are credited to a Pledgee’s Account. As discussed below, the proposed rule change relates to a technical aspect of the operational processing of Pledge transactions and would not impact the rights or obligations of a Participant or Pledgee.\n\n*Bold text is what they are trying to change with the new ruling.*\n\n&#x200B;\n\nTwo of the main goals in the proposed rule change:\n\n&#x200B;\n\n>As described above, the proposed rule change would allow Participants and Pledgees to more readily understand the Rules and Procedures relating to the processing of book entries of Pledges at DTC by  \n>  \n>(1) clarifying text to more accurately reflect the operational process of how book entries of pledges are entered on DTC’s system, and  \n>  \n>(2) making changes to text for readability necessary in the context of the proposed clarification. By clarifying the Rules to facilitate Participants ability to understand the operational processes relating to pledge services, DTC believes that the proposed changes would facilitate Participants’ and Pledgees’ ability to process pledge transactions and related understand DTC system functionality designed to accommodate key aspects of the pledge process, including the ability of the Pledgee to release Pledged Securities or make a demand for collateral relating to the Pledged Securities, as described above. Therefore, by facilitating the ability of Participants to understand the related Rules and pledge functionality, **DTC believes the proposed rule change would promote the prompt and accurate clearance and settlement of securities transactions**, consistent with Section 17(A)(b)(3)(f) of the Act. 26\n\n*Probably trying to fix the massive FTD issue with GME and other heavily shorted stocks?*\n\n&#x200B;\n\nLet's talk about effective date now, so we don't hype anyone up too much. It mentions the \"The proposed rule change would become effective upon filing\". I believe this means filing with the Federal Register, which usually takes a couple days. If anyone has more insight on this it would be much appreciated. More info, including a link the the Federal Register website below:\n\n[https://www.federalregister.gov/](https://www.federalregister.gov/)\n\n&#x200B;\n\n>**(A)** Notwithstanding the provisions of paragraph (2) of this subsection, a proposed rule change shall take effect upon filing with the [Commission](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1283237621-2067023497&term_occur=999&term_src=title:15:chapter:2B:section:78s) if designated by the [self-regulatory organization](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-201292346-2067023529&term_occur=999&term_src=title:15:chapter:2B:section:78s) as (i) constituting a stated policy, practice, or interpretation with respect to the meaning, administration, or enforcement of an existing rule of the [self-regulatory organization](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-201292346-2067023529&term_occur=999&term_src=title:15:chapter:2B:section:78s), (ii) establishing or changing a due, fee, or other charge imposed by the [self-regulatory organization](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-201292346-2067023529&term_occur=999&term_src=title:15:chapter:2B:section:78s) on any[ person,](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-991716523-482320180&term_occur=999&term_src=) whether or not the[ person ](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-991716523-482320180&term_occur=999&term_src=)is a[ member ](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1077769574-482320174&term_occur=999&term_src=)of the [self-regulatory organization](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-201292346-2067023529&term_occur=999&term_src=title:15:chapter:2B:section:78s), or (iii) concerned solely with the administration of the [self-regulatory organization](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-201292346-2067023529&term_occur=999&term_src=title:15:chapter:2B:section:78s) or other matters which the[ Commission,](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1283237621-2067023497&term_occur=999&term_src=) by rule, consistent with the public interest and the purposes of this subsection, may specify as without the provisions of such paragraph (2).\n\n*Document references the above when talking about the effective date.*\n\n&#x200B;\n\n**DTC’s Settlement Service Guide** proposed changes:\n\nhttps://preview.redd.it/z9omq4auxmq61.png?width=571&format=png&auto=webp&s=60749a558996e4f51fc759392c859f7650eccb50\n\n*Basically, a record will be created for any lent securities showing the status as \"lent\", so that it cannot be used again in another transaction. The way I understand this is that it would prevent lending already lent shares and allow for better reporting and transparency in the market.*\n\nProposed changes to paragraph 2 of the  **DTC’s Settlement Service Guide**:\n\nhttps://preview.redd.it/i77dcxmlymq61.png?width=567&format=png&auto=webp&s=dca4546f2b20649ce18ce5a620eccbc905a299ed\n\n*Making sure that there is always a record of lent securities. That record can only be removed if the security is returned from the original borrower/owner...?*\n\nProposed changes to the Collateral Loan Service referenced in the **DTC’s Settlement Service Guide**:\n\nI initially provided the current information for the Collateral Loan Service, so here it is now with the proposed changes to it.\n\nhttps://preview.redd.it/l0b14qaysmq61.png?width=562&format=png&auto=webp&s=5ca6b161fc6d39d3891dc246163caf7e6052da86\n\n*The lender must record that a security was lent, which prevents them from using that position to complete other transactions. Release of the position removes the record and makes the security available again to the lender...?*\n\n&#x200B;\n\nRemoving this in a few because I don't think it's relevant:\n\n* **~~DTC Pledgee Banks~~** ~~– DTC participants can submit free or valued pledges or releases to DTC Pledgee Banks.~~\n* **~~Options Clearing Corp (OCC)~~** ~~- A participant writing an option on any options exchange may fully collateralize that option by submitting free pledges and release requests of the underlying securities by book-entry through DTC to the (OCC).~~\n* **~~Federal Reserve Bank (FRB)~~** ~~- Participants who are depository institutions maintaining a deposit account at a Federal Reserve Bank (FRB), can make free pledges and release requests to the FRB.~~\n\n&#x200B;\n\n**Main changes to the Pledgee Agreement:**\n\nhttps://preview.redd.it/2huuuxvqumq61.png?width=597&format=png&auto=webp&s=9182e0424bef193b71b05dcb79e9252a0a4fa144\n\n*Sounds like they are trying to do this to better account for the amount of shares in the system.*\n\n&#x200B;\n\n**Edit 1:**\n\nI reorganized everything to try to make this post more readable, so it's not scattered all over the place. Most of the same information is there, just in different places.\n\n&#x200B;\n\n**Edit 2:** 4/1/2021 @ 6:16 EST\n\nMore organization. Included what documents each proposed change references.\n\n**Edit 3:** 4/1/2021 @ 6:36 EST\n\nMore changes, updated captions trying to decipher what each of these new rule changes are implying. This is how I interpret the document and could be completely wrong, so please fact check me.\n\nGoing to take a break for now, I'll be back soon.\n\n**Edit 4:** Ok guys, calling it a night. I'll try to still respond to comments and make changes to the post if I got anything completely wrong.\n\n&#x200B;\n\nu/VroumVroum6830 made a post about this same topic and included a great ELIA:\n\nYou can't borrow the same banana more than once.\n\nYou can't use collateral to do other bets ( rehypothecation )\n\nYou can't use banana contracts to close banana debts.\n\n&#x200B;\n\nGo check out their post here for more info:\n\n[https://www.reddit.com/r/GME/comments/mi3xdp/dtc2021005\\_1st\\_april\\_2021/](https://www.reddit.com/r/GME/comments/mi3xdp/dtc2021005_1st_april_2021/)",
    "title": "DTCC New Proposed Rule Change - DTC-2021-005!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mi3xdt/dtcc_new_proposed_rule_change_dtc2021005/"
}