{
    "author": "Sh0w3n",
    "created_utc": 1617265802.0,
    "distinguished": null,
    "edited": 1617273569.0,
    "id": "mhqvee",
    "text_only": true,
    "flair_text": "News 📰",
    "name": "t3_mhqvee",
    "num_comments": 292,
    "permalink": "/r/GME/comments/mhqvee/reverse_repo_rate_for_today_is_at_134_billion_usd/",
    "score": 3128,
    "selftext": "Yeah, you read that right. \n\nThe Reverse Repo Rate, mentioned in the [Everything Short DD](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/?utm_source=share&utm_medium=web2x&context=3) by u/atobitt has risen over 28.25% since yesterday. The complete bond market is short. To give you a comparison:\n\nThe Reverse Repo Rate between March 16 - March 26 was between 0-20 Billion per day.\n\nMarch 29: 40 Billion\n\nMarch 30: 104 Billion\n\nMarch 31: 134 Billion\n\nYou can check yourself here: [https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000](https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000)\n\nRepo and Reverse Repo explained in Ape by wrinkly brain u/atobitt:\n\n***Step 1: Repurchase & Reverse Repurchase agreements.***\n\n*WTF are they?*\n\nA Repurchase Agreement is much like a loan. If you have a big juicy banana worth $1,000,000 and need some quick cash, a repo agreement might be right for you. Just take that banana to a pawn shop and pawn it for a few days, borrow some cash, and buy your banana back later (plus a few tendies in interest). This creates a liability for you because you have to buy it back, unless you want to default and lose your big, beautiful banana. Regardless, you either buy it back or lose it. A reverse repo is how the *pawn shop* would account for this transaction.\n\n*Why do they matter?*\n\nRepos and reverse repos are the *LIFEBLOOD* of global financial liquidity. They allow for SUPER FAST conversions from securities to cash. The repo agreement I just described is happening daily with hedge funds and commercial banks. In fact, the submitted amount for repo agreements today (3/29) was [$40.354 BILLION.](https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000) This amount represents the ONE DAY REPO due on 3/30. So yeah, SUPER short term loans- usually a few days. It's probably not a surprise that back in 2008 the go-to choice of collateral for repo agreements was mortgage backed securities.\n\n&#x200B;\n\nComparison:\n\nThe average reverse repo rate for February 2021 was on average around 1-2 billion per day.\n\nFor 2019, pre-covid, it was below 1 billion for the end of march. Combined.\n\nFor 2020, when FED went BRRRR, it was higher than now. But that's when the problems started with the repo rate, as mentioned in u/atobitt's DD.\n\n&#x200B;\n\n\\---\n\nEdit: Since some are commenting regarding repo / reverse repo:\n\nYou are the FED (big ape)\n\nRepo: Big ape wants bananas (bonds) and gives money for it, agreeing to buy it back later. More money in the system.\n\nReverse Repo: Big ape wants money and gives bananas for it. Less money in the system.\n\nThis, together with a negativ repo %, means, that there is a shortage for bonds in the market (maybe someone shorted bonds, huh, does that sound familiar?), so someone is actually PAYING money to give their money away for bonds. There is no shortage for money due to the FED, but there is no more bonds that are needed because you might have to return them (because you might have shorted them).\n\n&#x200B;\n\n\\--- EDIT 2:\n\nTo clarify regarding the uniqueness of this:\n\n100B$ together with a negative repo interest % happened three times as far as I can research back in time.\n\nMarch 2020\n\nJune 2020\n\nMarch 2021\n\n100B$ together with a positive repo interest % is rare, but happened.\n\n100B$ together with a negative repo interest % is madness and is NOT NORMAL. And this is happening HERE.\n\nThe bond market is completely SHORT.",
    "title": "Reverse Repo Rate for today is at 134 BILLION USD - 28.25% rise in 24 hours - 10x the Average for March",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhqvee/reverse_repo_rate_for_today_is_at_134_billion_usd/"
}