{
    "author": "zylon0217",
    "created_utc": 1620104267.0,
    "distinguished": null,
    "edited": 1622240940.0,
    "id": "n4gdgh",
    "text_only": true,
    "flair_text": "Stonky Pets 🐱‍👤",
    "name": "t3_n4gdgh",
    "num_comments": 131,
    "permalink": "/r/Superstonk/comments/n4gdgh/today_i_learned_that_my_cat_is_worth_over_20/",
    "score": 1783,
    "selftext": "My cat started vomiting up blood for no reason, and I had to take her to the pet ER. I only had 10 dollars to my name, and had to paper hand two shares to pay for her treatment. My credit cards are maxed, and I had no other choice. But she’s been with me for five years, and I’d paper hand another share if I had to for her. \n\nBut still, 20 million dollar ER trip, holy moly. Lol\n\nEdit: Thank you everyone for all the love and positivity you’ve all been spreading, It really helps, I love my kitty, and she just turned five years old so she’s still so young!!\nHer blood test came back and was unfortunately riddled with bad news, but as for now, she’s happily chasing her toys and seems to be feeling much much better. Her urinalysis is Friday at 11am, hopefully that comes back healthy and happy..\nThanks to everyone for your concern! \n(Her name is Katarina, I just thought that calling her Kat for short was hilarious)\n\nEdit 2: Urinalysis came back totally clean! Looks like there were no problems there and she’s good to go! Doing another blood test in two/three weeks, but for now, happy and healthy\n\nEdit 3: 5/27: she’s been having a really bad cough/wheezing fit every couple days since the shots a while ago, x-ray for her tomorrow at 4pm, fingers crossed she’s okay\n\nEdit 4: 5/28 her cough is an infection, one week of antibiotics and she’s good to go!",
    "title": "Today I learned that my cat is worth over 20 million dollars.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/n4gdgh/today_i_learned_that_my_cat_is_worth_over_20/"
}