{
    "author": "Csmbird",
    "created_utc": 1626929974.0,
    "distinguished": null,
    "edited": false,
    "id": "op735s",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_op735s",
    "num_comments": 101,
    "permalink": "/r/Superstonk/comments/op735s/behavior_girlbcbape_again_aviation_automobile/",
    "score": 1194,
    "selftext": "Guess who’s back?\n\n&#x200B;\n\nhttps://preview.redd.it/4uha6q1e4pc71.png?width=474&format=png&auto=webp&s=24a8335201d3a64e23978335cb8c45b7e1861900\n\n&#x200B;\n\nBack from taking my board exams to lay some slick BCBApe shit on ya cause I passed....\n\nThat being said none of this shit has to do with that....but let's analyze some of this fucking shit I found thanks to [u/fewdea](https://www.reddit.com/u/fewdea/) and [u/snoo\\_75309](https://www.reddit.com/u/snoo_75309/)\n\n# Uno (Mas Escondite)\n\nI ran across [this ](https://www.reddit.com/r/Superstonk/comments/oovqze/whats_the_deal_with_selling_a_leased_car/h61vomz/?context=3)post earlier by [u/fewdea](https://www.reddit.com/u/fewdea/) where they mentioned that they went to sell their car to a used car company (guess they serve pancakes too?). When they went there a sign was up stating that the company was only able to buy cars back from folks who did not use specific lenders.\n\nFinanciers aren't letting people buy assets upon which loans are based because they then would have to turn that cash (which is a liability) over.\n\nRemember [u/criand](https://www.reddit.com/u/criand/) and [u/attobit](https://www.reddit.com/u/attobit/) talking about Citadel losing their clothes and cash being a fucking liability?\n\nHang in there with me.\n\n[u/Snoo\\_75309](https://www.reddit.com/u/Snoo_75309/) went on to question in a comment:\n\n>“I am a little confused though, i know cash is a liability for banks when it's their customers deposits, but cash from a sale of an asset the bank owns? I guess they're using deposits to invest in car loans that makes sense, because once they deposit the cash if it was deposit $ it becomes a liability vs an auto backed securities can be used as collateral for cash if the banks need the cash.”\n\nCash is a liability regardless of where it came from. It’s almost like they have a place to keep their assets without worrying of inflation or having someone come after it….you know…..\n\nFeel similar?\n\nYall. We see Reverse Repos every day regarding The Treasury. They don’t want to hold on to the cash so they are utilizing Reverse Repos (it aint a proper noun, but shit at this point I’m making it one).\n\nAm I saying this is the same as Reverse Repos.\n\nAbsolutely hell fucking no. I’m saying this is another place for them to hide wealth and another way they are fucking our economy like..hmmmmmm Mortgage Backed Securities.... Shittily so because a car owner under an Automobile Loan (gonna call this a proper noun too and just capitalize on it...heh heh.) can’t sell their car/the automobile loan to get any equity out of what they may have in the car.\n\n# Dos: El Coche\n\nLet thine eyes not deceive you.\n\n[Insights - Auto Asset-Backed Securities (diamond-hill.com)](https://www.diamond-hill.com/insights/a-152/auto-asset-backed-securities.fs)\n\nLookie lookie. Here is a breakdown of the Security Structure Breakdown for 2017 and 2019\n\n&#x200B;\n\nhttps://preview.redd.it/md42eso84pc71.png?width=1244&format=png&auto=webp&s=7ce6c9c6e8245d68b5882a2a171a8cb33e09e8c0\n\n&#x200B;\n\nhttps://preview.redd.it/w5iairt94pc71.png?width=1067&format=png&auto=webp&s=8cc3b3814176cb686c3fa74cf2d8a63600bab131\n\nWhat’s insane is that they even went on to say that OHHHHH iTs NoT liKE tHe BiG sHoRt…\n\n&#x200B;\n\nhttps://preview.redd.it/epe28h9b4pc71.png?width=1156&format=png&auto=webp&s=ed08a31bfcc9cd43d8f037ecc2c33c4a3b257a87\n\nNot like the big short?\n\n[Even when a Law Firm Has a website dedicated to this shit?](https://www.stockmarketloss.com/securities-law/auto-loan-backed-securities/)\n\n# Tres: Avion de Bombardeo\n\nRemember this is a place they’re hiding assets, just as I found numerous major fucking banks jumped in together to buy a fucking AIRPLANE WAREHOUSE that cost 2 BILLION FUCKING DOLLARS.\n\nI was going to post a link to the article. But some assholes are gonna shout conspiracy so let me just quote the hell of it all so you’re not dissuaded from linking.\n\n[This was from Business Wire on April 27th:](https://www.businesswire.com/news/home/20210426005957/en/Griffin-Global-Asset-Management-Closes-1-Billion-Warehouse-Facility)\n\n>“DUBLIN--(BUSINESS WIRE)--Griffin Global Asset Management DAC and Griffin Global Asset Management (Servicer) LLC (together, “Griffin”) announced today that on April 23, 2021 Palisade Aviation Holdings Warehouse, Ltd. and Palisade Aviation Holdings Warehouse, LLC (together, the “Borrowers”), closed a five-year senior secured warehouse facility with an initial committed amount of $1,000,000,0000 (the “Facility”). The Borrowers were jointly established by Griffin and funds managed by Bain Capital Credit, L.P. as part of a joint venture focused on building a diversified aviation portfolio in conjunction with a world-class commercial aviation leasing and alternative asset management platform.  \n>  \n>The Facility includes innovations that provide the Borrowers with maximum flexibility to offer its airline partners a variety of financing solutions, ranging from operating leases to finance leases to direct loans across a diverse spectrum of asset types and ages. The Facility is also unique in providing more flexibility on concentrations of certain airline exposure than a traditional warehouse facility, providing the joint venture with a powerful bridging tool to long-term capital markets solutions.  \n>  \n>“We are grateful for the support from our banks as we grow the Griffin platform into a leader in the aircraft leasing and financing sector. This warehouse facility has significant capacity and flexibility that will allow us to create customized capital solutions for our airline customers going forward,” said Ryan McKenna, Founder and Chief Executive Officer of Griffin.  \n>  \n>“Developing this warehouse facility was a collaborative process with our lending partners and resulted in a first-of-its-kind facility in the aviation industry. The overwhelming support from these seven financial institutions is very meaningful as the growth of Griffin accelerates. Going forward, we will continue to create innovative financial products that will meet the evolving needs of the airlines and OEMs in this dynamic market,” said John Beekman, Chief Financial Officer of Griffin.  \n>  \n>Goldman Sachs acted as the structuring agent for the Facility. Initial commitments for the facility were provided by Goldman Sachs, Barclays Bank PLC, Mizuho Americas, Morgan Stanley, Wells Fargo Bank, National Association, Bank of America, N.A. and Deutsche Bank AG, New York Branch.  \n>  \n>Hughes Hubbard & Reed LLP acted as U.S. legal advisors to Griffin and the Borrowers, Milbank LLP acted as legal advisors to the Lenders, Maples and Calder (Ireland) LLP acted as Irish legal advisors for the Borrowers, Maples and Calder (Cayman) LLP acted as Cayman Islands legal advisors for the Borrowers, A&L Goodbody LLP acted as Irish legal advisors to Griffin and PWC acted as Irish tax advisors for Griffin and the Borrowers. UMB Bank, N.A. is acting as the administrative agent and the security trustee.  \n>  \n>About Griffin Global Asset Management  \n>  \n>Griffin is a commercial aircraft leasing and alternative asset management business with offices in Dublin, Ireland and Los Angeles, USA. Griffin’s team of aviation professionals works closely with airlines, OEMs, and financiers to deliver customized fleet solutions and innovative financing products to airlines globally.  \n>  \n>For more information, please visit [www.griffingam.ie](http://www.griffingam.ie/) or [www.griffingam.com](http://www.griffingam.com/).”\n\nFrackin hell, please go back and read my other juice if you’re having a hard time following this. I’m almost certain this Griffin Global Asset Management is one of KGs spinoffs like KP Holdings.\n\nThink I’m just fucking around?\n\n[Some Moody Ass Bitch downgraded a hell of alot of Aviation Backed Securities back in January….](https://www.moodys.com/research/Moodys-downgrades-Aviation-Capital-Group-Trust-II-aircraft-lease-backed--PR_270395)\n\n&#x200B;\n\nhttps://preview.redd.it/0pnvtob64pc71.png?width=1874&format=png&auto=webp&s=3650797f611c432e46d850cb44e18a25c7fbbb74\n\n&#x200B;\n\nHahaha awwww that’s soooooo [Fitch](https://www.fitchratings.com/research/structured-finance/37-of-aviation-abs-notes-downgraded-slow-recovery-credit-negative-in-2020-21-08-10-2020).\n\n&#x200B;\n\nhttps://preview.redd.it/2rt7jv454pc71.png?width=1920&format=png&auto=webp&s=5c742f5904e0ef4ec83bed749508ac6707c5301f\n\nEven BloomTurd dropped something on this shit:\n\n[Aircraft-Lease Bonds Draw High Demand as Investors Seek Yield - Bloomberg](https://www.bloomberg.com/news/articles/2021-01-21/aircraft-backed-bonds-draw-heavy-demand-as-investors-seek-yield)\n\n&#x200B;\n\nhttps://preview.redd.it/z7h6xug34pc71.png?width=1911&format=png&auto=webp&s=339f43be78f49eb2e4ee2f0a1ece16d044d3636c\n\nNotice how CastleLake just sold 595 MILLION DOLLARS backed by aviation bonds!!!!! Look at the headlines/links off to the top left.\n\n“Castlelake’s ABS adds safeguards to mitigate Covid uncertainty”\n\n“Bonds were nearly ten times over subscribed, investor says”\n\nThat is contradictory as fuck.\n\nNow….at the bottom look who led the transaction?\n\n&#x200B;\n\nhttps://preview.redd.it/qybvkl624pc71.png?width=1914&format=png&auto=webp&s=cf32cf8b3ba4787e57348773d2065a0690e3cad2\n\n&#x200B;\n\nhttps://preview.redd.it/cp84z2pz3pc71.png?width=1915&format=png&auto=webp&s=5a6a6336d7144c8e58f6fce7c86cc8754beca4c8\n\n&#x200B;\n\n# Cuatro: La Casa\n\n[u/Fewdea](https://www.reddit.com/u/Fewdea/) dug a little and also found that there were [Rental Backed Securities](https://www.washingtonpost.com/news/wonk/wp/2013/11/08/wall-street-figured-out-how-to-securitize-your-rent-should-you-worry/) that even awful MSM shouted about back in 2013.\n\nDon’t believe there are Rental Backed Securities? Well [Penn State sure as fucking hell does.](https://www.smeal.psu.edu/ires/documents/single-family-rental-securitizations-spring-2015)\n\n&#x200B;\n\nhttps://preview.redd.it/lhpzyq2v3pc71.png?width=697&format=png&auto=webp&s=8c16a47842c489276770bb1f2382222f9ea36339\n\n^(Just gonna throw some more information in here that I’m really not sure what the fuck to make of:)\n\n^(Guess who was buying up rental properties and using them as Rental Backed Securities? Blackstone. Guess who is still buying up rental properties like a dog licking their owners plate? Blackstone.)\n\n^(Blackstone even went so far as to acquire) [^(Home Partners of America.)](https://www.nasdaq.com/articles/blackstone-to-acquire-home-partners-of-america-for-%246b-2021-06-23)\n\n^(Here’s some more about Blackstone’s RBS) [^(dealings)](https://www.ft.com/content/d5fd71ce-43cd-11e3-9438-00144feabdc0#axzz2jcfcy9OK)^(. Guess what? Apparently they’re also AAA rated.)\n\n# tldr; SOME FUCKY SHIT HAPPENIN'. We have seen them destroy with Mortgage Backed Securities. Now we are seeing them fuck shit up with Commercial MBS, Aviation BS, Auto BS, and now fucking Rental BS.",
    "title": "🐱‍🏍👀Behavior Girl/BCBApe again... Aviation, Automobile, Rental Backed Securities. And they've been quietly downgrading their ratings👀🐱‍🏍",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/op735s/behavior_girlbcbape_again_aviation_automobile/"
}