{
    "author": "petitepain",
    "created_utc": 1626866461.0,
    "distinguished": null,
    "edited": false,
    "id": "oonvcg",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oonvcg",
    "num_comments": 111,
    "permalink": "/r/Superstonk/comments/oonvcg/max_strike_prices_of_new_weeklies_signalling/",
    "score": 1015,
    "selftext": "This post builds upon the information brought to light by /u/wakeuparleen\n\n[^(https://www.reddit.com/r/Superstonk/comments/omhrho/someone\\_with\\_a\\_wrinkle\\_fucking\\_help\\_v2/)](https://www.reddit.com/r/Superstonk/comments/omhrho/someone_with_a_wrinkle_fucking_help_v2/)\n\nStarting from 8/13, the two new weekly calls have a max strike prices which are just above the current prices. The possible explanation why? SHFs know they're fucked soon. They will not make bets if they know they will lose money on them.\n\n# The weekly calls\n\n|Expiring Date|Max strike price|\n|:-|:-|\n|7-23|$680|\n|7-30|$570|\n|8-6|$440|\n|8-13|**$217.50**|\n|8-27|**$250**|\n|9-3|???|\n\nMarket makers are responsible for depth and liquidity in options trading.Previously made available weekly options had high maximum strike prices. The same holds for the monthly options: between 8-20 and 11-19 max strike were $680, $680, $680, $800.\n\nClearly a downwards trend in the weeklies from 8-13. Something happened between the making of the 8/6 and 8/13 weeklies. Time will tell if it continues (when 9-3 options come out and if 8-13 & 8-27 max strike prices might increase).\n\n# Defeat is imminent\n\nFor the newer weeklies, some kind of new information made the market makers lower the max strike significantly. **Normally this means missing out on free tendies, but SHFs aren't dumb, just crooked. So the risk must be deemed too great for the reward.**\n\nFrom the point of which the market makers (Citadel mainly, but possibly Susquehanna and Point72 too) decided to lower the max strike prices for the new options they had to make available (one of MMs their responsibilities), something became clear:\n\nthe chance (risk for the other side) of MOASS increased greatly. 🚀🦍\n\nIf the theory holds, some piece of information meant that the MOASS-reality is setting in for SHFs, defeat might be inevitable from this point on.\n\nThis defeat (MOASS), according to the new information, could happen starting from (date of the creation of 8/13 weeklies) to some point in the future (new max strike prices could go even closer to the share price, but Citadel still has a duty as MM to create weeklies).\n\n# The information\n\nAs to what this new information is, it could of course be a date/information regarding GameStop their NFT, some kind of dividend or even pulling their shares out of the DTCC completely.\n\nI have zero doubt that Citadel, as the biggest market maker in the world, could attain dividend dates/information or other stock information well in advance for any stock, let alone $GME, the reason, the chosen one that pops the bubble which shatters it all, and which forces citadel to go down.\n\n&#x200B;\n\nThis is also in line with the deathspiral theory by /u/PowerRaptor : shorts must lower the prices of new synthetic shares to meet the ever increasing pressure of the margin debt requirements. Image for a good illustration.\n\n&#x200B;\n\n[Deathspiral theory https:\\/\\/www.reddit.com\\/r\\/Superstonk\\/comments\\/oktyvl\\/deathspiral\\_for\\_shorts\\_to\\_stay\\_short\\_the\\_price\\/](https://preview.redd.it/un3cggmdvjc71.jpg?width=3508&format=pjpg&auto=webp&s=4f0499b3049e2d541ac99bd9a1892bb9a1ff245c)\n\nLet me know what you think and wrinkled apes please point out any mistakes.\n\n&#x200B;\n\n***TLDR: New weekly call options maximum strike prices are dangerously close to current share prices. Could signal the defeat of SHFs/MMs.***\n\n^(This post is not financial advice, just explaining the rules of the game in this massive game theory game so we can achieve the optimal outcome which is desirable to every ape.)",
    "title": "Max strike prices of new weeklies - signalling DEFEAT IS IMMINENT for the SHFs",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oonvcg/max_strike_prices_of_new_weeklies_signalling/"
}