{
    "author": "Cagerlac",
    "created_utc": 1620053041.0,
    "distinguished": null,
    "edited": 1620092177.0,
    "id": "n3xupo",
    "text_only": true,
    "flair_text": "Shitpost 👾",
    "name": "t3_n3xupo",
    "num_comments": 465,
    "permalink": "/r/Superstonk/comments/n3xupo/just_heard_the_term_paperhanded_bitch_at_work/",
    "score": 8982,
    "selftext": "Turns out 80% of the engineers at my company hold GME, and the majority were ridiculing another engineer that sold out when it crashed. \n\nNeedless to say, we instantly became best friends, and shared our positions and thoughts on GME. There’s no better way to connect with a group a guys at work that I was only loosely familiar with before.\n\nNow we will be even less productive!\n\nEdit: To set the stage properly, I’ve been working from home for the last 13 months. I finally came back in to the office just to check on a few things. We’ve hired a few engineers recently that I’d hardly taken the time to get to know. I was walking through the engineering department on fairly urgent business when I saw a group of younger engineers holding a conversation. I eavesdropped in on the conversation and just heard, “paper-handed bitch.” My ears perked up and I stopped dead in my tracks. I turned around and said, “wait, are you guys talking about GameStop?” *insert Spider-Man pointing at Spider-Man pointing at Spider-Man meme*\nThe look of recognition of a on their faces seeing a fellow ape in the wild was priceless. By the time we were done reminiscing on the last 4 months and sharing opinions, I was mentally ready to pack up and go home for the day. Knowing other folks that also have a personal stake in GME makes this move so much more fun. It’s one thing to be ridiculed and called a paper-handed bitch on the internet. It’s another thing entirely to have coworkers holding you accountable and making sure that we all hold together. My hands gained a few more diamonds today.",
    "title": "Just heard the term, “paper-handed bitch,” at work.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n3xupo/just_heard_the_term_paperhanded_bitch_at_work/"
}