{
    "author": "jacobbomb",
    "created_utc": 1622841322.0,
    "distinguished": null,
    "edited": 1622894377.0,
    "id": "nsfq6l",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_nsfq6l",
    "num_comments": 208,
    "permalink": "/r/Superstonk/comments/nsfq6l/gamestop_amc_expected_to_leave_russell_2000_join/",
    "score": 1697,
    "selftext": "Update #3: One ape has [shared](https://www.reddit.com/r/Superstonk/comments/nsfq6l/gamestop_amc_expected_to_leave_russell_2000_join/h0n7grn/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) that it looks like GME has been removed from the microcap index. Now we await news on changes to the Russell 1000 & 2000. \n\n**Update #2:** brainworms confirmed, I’m just retarded. No update/change on GME’s status in the 2000 index or if it’s to be included in the 1000 **(YET)**. My previous update was referencing the [wrong FTSE index](https://www.ftserussell.com/products/indices/set). I was unaware that there were other index’s in other countries (in this case, Thailand) and immediately assumed that “large cap” was a different term for the Russell 1000, completely missing that it wasn’t the Russell at all, it was the SET index. \n\nAs of the time of this update (~11:59 EST) the latest press release the FTSE has released is announcing Russell **3000** changes. You can find their press releases [here](https://www.ftserussell.com/press) and hopefully they will have an announcement regarding the 1000 & 2000 soon. \n\nOnce more, I am *incredibly* sorry for the confusion/whiplash. This is a good lesson for me to slow my fuckin roll. Again,  **the SET index is NOT the same as the Russell 1000**, but I figured I should still leave some of this in this post to mention that **you shouldn’t be a dumbass like me and assume “large cap” means Russell 1000.**\n\n\n\nHey everyone, I wanted to bring some more attention to this news since this move seems like it could have a pretty decent impact on GME and the sentiment around it as well. \n\nI want to start by giving credit to u/WisePhantom as his post ([link](https://www.reddit.com/r/Superstonk/comments/ns4bza/russell_reconstitution_is_today_at_6pm_edt/?utm_source=share&utm_medium=ios_app&utm_name=iossmf))was the first I saw here mentioning this. Personally, I heard about this through the radio but wanted to give credit to them since they already made a post mentioning this. \n\nNow, this move hasn’t been completed or finalized yet, the preliminary list of companies on the Russell index’s is getting released tonight. The confirmation of the index changes is completed on June 28th. \n\nThis is a pretty significant change for the Russell 2000 as GME and AMC together made up **7.5%** of the index’s gains leading up to this annual overhaul. That’s right, *2 stocks out of 2000* made up 75X their weight of the entire index. (This is according to Bloomberg radio, haven’t had an opportunity to fact check this yet but will edit this post if that’s incorrect) \n\nThis news could sway a *lot* of opinions on Gamestop. The company being included with some of the most valuable companies in the WORLD sends a message to even the boomeriest of investors that they aren’t kidding about their digital transformation. \n\nHere is how I’m seeing this as bullish for GME: \n\nThe possible effects on GME could be significant as well. Being a part of the 1000 would mean a bigger slice of the index pie. That, combined with that the index is full of companies that Wall Street is undeniably bullish on means that the gains for GME would be bigger AND better. \n\nNow, what about the good ol’ SHF that we know and ~~love~~ are bearish on? This (again, in the way I’m looking at this currently) is *horrible* for their shorts. GME being on the Russell 1000 means that now on top of struggling to get countless apes with risk tolerance levels that cause suicide bombers to say “what the fuck are they thinking?”, they now have to literally fight the influence of the Russell 1000. They have to believe that the company will go under despite being debt-less and having all of the above mentioned pros. Not only that, but now instead of trying to short the Russell 2000 which they might not have *too* much invested in, they have to try and short an index that holds many of the same stocks that they’re likely LONG on, harming their own positions in the process. (Perhaps this is a factor as to why many banks are no longer allowing shorts on Gamestop?) all of that, JUST so they could TRY to close their short positions in the green. \n\nNow, I’m not a wrinkle brain by far, so if anything I’m saying is wrong or misguided then PLEASE call that out. But from my current point of view, this news seems.. pretty fuckin big. \n\n**TLDR: Gamestop moving to the Russell 1000 index could be SERIOUS bad news bears to those short on the stock. It could also convince more fundamentalist investors to invest a bit into the company as well.**\n\nEdit: Just another shoutout to u/WisePhantom since they tried to make note of this and bring awareness to it first.",
    "title": "Gamestop & AMC expected to leave Russell 2000, join Russell 1000.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsfq6l/gamestop_amc_expected_to_leave_russell_2000_join/"
}