{
    "author": "HODLTheLineMyFriend",
    "created_utc": 1620863360.0,
    "distinguished": null,
    "edited": false,
    "id": "nb30rz",
    "text_only": true,
    "flair_text": "𝗗𝗮𝘁𝗮",
    "name": "t3_nb30rz",
    "num_comments": 63,
    "permalink": "/r/DDintoGME/comments/nb30rz/daily_heat_map_of_citadel_and_melvins_long/",
    "score": 725,
    "selftext": "Hi all, sharing with you today's heat maps for Citadel and Melvin's long holdings (plus Susquehanna, last-minute addition!). These are based on their 13Fs from 12/31 and their 13D/G filings to present, with prices as of market close. As I noted yesterday, I've trimmed Melvin to remove V, MA and FB, as their market cap size means Melvin's sells wouldn't impact their price much. Equities with thinner liquidities are more vulnerable to dumping.\n\n# Citadel\n\n[Lots of red, a little green in the healthcare space](https://preview.redd.it/5qy79kwkxry61.png?width=1496&format=png&auto=webp&s=69ea5ed5d3494cc36e65669325b08693a9bb0eaf)\n\nRumors are swirling of margin calls for unknown companies based on the last few days' sea of red. That certainly seems possible now. The dominoes may have started falling...\n\n# Melvin\n\nNote that $EXPE and $FICO took really big hits down: those are 2 of Melvin's largest holdings. And here I thought my Ts could not be any more jacked after the Gamestop tweet about Moass Effect!\n\nI took longer to get this post together because Melvin [just filed a new 13G today](https://www.insidermonkey.com/insider-trading/filing-13dg/176152) and I wanted to digest it. They disclosed 11.4% ownership of $IAA. So I've got that in there and it's also...checks notes...red.\n\n[That's just blood red now, or maybe fire red? Fire Sale!](https://preview.redd.it/c4vdratc0sy61.png?width=1581&format=png&auto=webp&s=602821a608c25ae10ad92910fc09ac92f75fb5f3)\n\nI also made a map for stocks that are (believed to be) shorted by Citadel/Melvin/Susquehanna/etc, and which have tended to move in unison. If you can't read it, KOSS and EXPR are in there. Today, though, AMC was the lone green out of a sea of red. GME had a solid recovery to $150, before it settled back to its $144.79 close.\n\n[The Victims](https://preview.redd.it/gchvg5m5yry61.png?width=1584&format=png&auto=webp&s=b47d9fcf332ade53cba46ba2d4254bf8047a36a2)\n\n# Susquehanna (SIG)\n\nI finally found a source of 13F data on SIG, so you can enjoy this sea of red on their long holdings, with the lone exception of PFE.\n\n[Marge N is gonna call ya](https://preview.redd.it/9bd0ho4qyry61.png?width=1579&format=png&auto=webp&s=9f23043f6a13a03de47f1bb10dc5c6f80826422e)\n\n# Jane Street Group\n\nThanks to some wrinkly apes, I got more information on Jane Street Group. I'm actually not convinced they're in this as a true short, despite their links to the short hedgies. They appear to be mostly focused on ETFs, and bond ETFs specifically. Also, most of their holdings are options where they buy both puts and calls, so they're betting on movement and not directly on GME. They also are moving in and out of positions in days or weeks, so they're more HFT than hedge fund.  The overlap with Citadel's long holdings is still suspicious, but that's as far as I can go on the available data.\n\nRef: [Jane Street: the top Wall Street firm ‘no one’s heard of'](https://www.ft.com/content/81811f27-4a8f-4941-99b3-2762cae76542)\n\n# Sources:\n\n[Citadel Investment Group 13F](https://www.insidermonkey.com/hedge-fund/citadel+investment+group/44/holdings/#/)  \n[Melvin 13F](https://www.insidermonkey.com/insider-trading/filing-13dg/176152)  \n[Susquehanna 13F](https://stockzoa.com/fund/susquehanna-international/)  \n[Jane Street Group holdings](https://www.insidermonkey.com/institutional-investor/jane+street+group+llc/601711/holdings/)  \n[Virtu Financial holdings](https://www.insidermonkey.com/institutional-investor/virtu+financial+llc/769/holdings/)  \n[Melvin 13G filed today on IAA](https://www.insidermonkey.com/insider-trading/filing-13dg/176152)\n\nIf you want to see my previous daily heatmaps, or a few DDs that I've written around GME, my profile page is here: u/HODLTheLineMyFriend.\n\n***HODL the line, friends!*** **🚀🚀🚀**",
    "title": "Daily Heat Map of Citadel and Melvin's Long Holdings — May 12 2021",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nb30rz/daily_heat_map_of_citadel_and_melvins_long/"
}