{
    "author": "humans_being",
    "created_utc": 1624802742.0,
    "distinguished": null,
    "edited": 1624814321.0,
    "id": "o8xq1l",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o8xq1l",
    "num_comments": 432,
    "permalink": "/r/Superstonk/comments/o8xq1l/i_choose_to_think_this_is_all_about_a_birdhouse/",
    "score": 7797,
    "selftext": "I'm an old head.  Been working my whole life doing okay.  Yeah, I lived through 2008.  I've always been in manufacturing and since I live in Michigan that manufacturing has always centered on automotive.  2008 wasn't good.  Married raising two sons and the floor dropped out in an instant.  I admit it.  I lost the house.  It is what it is.  You take a few on the chin and keep moving on.  So fast forward to December of last year.  My oldest tells me about this Gamestop stuff.  \"You should look into this.  It's interesting\".  Reddit wasn't unknown to me I've been active for quite a few years but never ran across any of this stuff and to be honest with you (at the time) I probably couldn't even spell rehypothecation let alone have a cursory understanding of it.  The more I read the more I learned.  Now I sit here as a fellow diamond hand and something occurred to me.  Why?  Why is this all what it is?  Most of it makes no sense.  Still doesn't make any sense.  But some of it does make sense.  At least to my highly unrefined brain.  The one thing that makes sense in all this craziness is Ryan Cohen.  For whatever reason he's the only part of any of this that makes sense to me.  To someone who isn't a father or hasn't lived the life I've lived the Ryan Cohen component might be one of the things that to them...doesn't make sense.  We all have our perspectives and to me the Ryan Cohen perspective is the easiest to figure out.  Chances are I'm probably wildly off.  I might have built this perspective in my brain in an attempt to figure out 'why'.  Maybe I'm wrong.  Maybe I'm right.  I'll probably never know but it is what I believe and what I believe is it's all about a birdhouse.\n\nWe've all seen Ryan's tweets about his Dad.  I'm sure most of us have read the stories written about Ryan and his Dad.  We've read what Ryan has said about his Dad.  I think these things are very important.   Take yourself back to when you were a kid.  You can use your own examples.  I think the examples vary but the feelings are the same.  For me, it was a birdhouse.  My old man was a house painter who could hand craft things.  He could build a fence and build a garage.  He was a creator.  Its a compulsion.  The need to create.  \"I need to make something\".  So one weekend's task was to build a birdhouse for my Mom.  Pops took me out to the shed and we gathered up some hand tools.  We shot to the lumber yard and he picked out the wood he'd be using.  We got home and I watched as he started creating.  I was just a wee lad so I really didn't know a handsaw from a roofing nail.  He took the time to show me.  Before I knew it he had me building a birdhouse too.  He had his and I had mine.  By late Sunday his was done.  It wasn't majestic.  It didn't have gold leaf or ornate trimming but it was stout.  The joints were tight.  The walls were solid.  The roof was waterproof.  Everything you need for a birdhouse.  He hung it on a tree.  I remember my Mom kissing him on the cheek.  She got her birdhouse.\n\nI was probably too young and too stupid to know any better so I just kept going.  Dad was already inside as I continued to bang away and bend nails and saw corners that barely fit together.  It was dark.  I kept looking at my pile of hilarious wood and his birdhouse and comparing.  Obviously one was not the other.  Mine was a mess.  But it was mine...and I liked it.\n\nI put the birdhouse in my hands and walked inside.  Pops was already half asleep in his chair watching TV.  I outstretched my hands and presented my birdhouse.  I didn't say a word.  My dad's eyes opened.  He looked at it and he looked at me.  While half asleep he muttered something like \"well that'll make for a good one, Joe.  that'll be just fine\".\n\nThat night I fell asleep thinking about what improvements I could make.  How I could do some things differently.  Better.  When I woke up I immediately sought after my birdhouse.  I looked next to the chair.  I looked on the work bench.  I looked everywhere. I thought maybe Dad threw it away.  I looked in the garbage pails.  It was gone and so was Dad.  He was already at work.  I eventually found it by not looking for it.  I eventually found it.  There it was.  Hanging in the tree right next to the one Dad built.\n\nI choose to think Ryan Cohen is a creator.  He is a builder. Its something he cannot control.  How many billions did he have after Chewy?  How many sandy beaches does that buy?  How many lifetimes of luxury does that buy?  What does he do instead?  He dumps his cash and time into a dying brick-and-mortar retailer and gets laughed at by just about every talking head on earth.  Why?\n\n...because after he's done he's going to walk up to his Dad with outstretched arms and without speaking a word he's going to say \"Dad, look what I built\".",
    "title": "I Choose To Think This Is All About A Birdhouse",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8xq1l/i_choose_to_think_this_is_all_about_a_birdhouse/"
}