{
    "author": "delish-noodles",
    "created_utc": 1624786781.0,
    "distinguished": null,
    "edited": 1624835018.0,
    "id": "o8txwq",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o8txwq",
    "num_comments": 902,
    "permalink": "/r/Superstonk/comments/o8txwq/if_gamestop_is_competing_against_amazon_in_the/",
    "score": 19492,
    "selftext": "I'm SICK and TIRED of seeing Amazon being total POS to all their employees especially the delivery drivers, temp and warehouse workers. Everytime I interact with any of their delivery workers, they look like they're on the verge of tears from shitty hours, low wages and just straight up constant abuse. NO ONE DESERVES TO BE TREATED LIKE THAT. WTF.\nBeing as drunk and emotional as I am right now. I'm going to put this shit out there. I'm a fellow shareholder and a frequent GameStop customer. After MOASS, I hope GameStop sees this post and becomes BETTER than Amazon and crush their ass and wax the damn floor with Bezos head.\nGamestop. Please pay your employees a livable wage and great benefits. Insane changes are happening and that's the one thing that I specifically want in shitty corporate America. A new fucking STANDARD IN THIS DAMN COUNTRY.\n\nThat is all.\n\nEDIT 2: Yes, Gamestop employees are still not being treated well now guys. Check out r/gamestop! We know that GameStops newly assembled executive team is insane and extremely bullish. We all noticed that they're listening to us apes and adding in more things to their inventory (board games, legos, electronics, etc.). With no debt, their number of employees is still growing, and them building more warehouses. It means this is a great time to voice our concerns for their current and future employees! \n\nMy hope for them as the company as they get a more solid footing in the industry is to also train and improve their management. Better management, happier employees, happy AND satisfied customers. Straight out of the Costco playbook!\n\nEDIT: Good mother of god. This blew up! Thanks for the love and rewards everyone. A bunch of first awards for me! I now feel less regret after my hangover",
    "title": "If GameStop is competing against Amazon in the future. I want GameStop to treat their employees better than them.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8txwq/if_gamestop_is_competing_against_amazon_in_the/"
}