{
    "author": "MartoPolo",
    "created_utc": 1621262989.0,
    "distinguished": null,
    "edited": 1621386390.0,
    "id": "nei95i",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nei95i",
    "num_comments": 474,
    "permalink": "/r/Superstonk/comments/nei95i/a_string_of_events_are_unfolding_that_cannot_be/",
    "score": 4175,
    "selftext": "Disclaimer: I'm a smooth brainer with a lot of time.\n\nSo the reason for this little DD is because of a certain find by u/PapaTheSmurf and his post\n\n[https://www.reddit.com/r/Superstonk/comments/nd39dl/srnysearca202054\\_need\\_some\\_wrinkles\\_asap/](https://www.reddit.com/r/Superstonk/comments/nd39dl/srnysearca202054_need_some_wrinkles_asap/)\n\n  \nThe finding in question is as follows and it clicked in a couple of missing pieces to a theory I have about our secret whale.  \n[https://www.sec.gov/rules/sro/nysearca/2021/34-91901.pdf](https://www.sec.gov/rules/sro/nysearca/2021/34-91901.pdf) \n\nThis rule appears to provide an exemption for companies that fall under “investment companies” in obtaining shareholder permission before issuing securities that relate to acquisition of stock or assets of another company.  \nThis is huge considering that both BlackRock and Vanguard quite literally, are major institutional shareholders (almost always number 1 and 2 in ownership) of almost every major company in America.\n\nhttps://preview.redd.it/pgjpu1rpzoz61.png?width=826&format=png&auto=webp&s=dac7e0e819ef18f386e52fc970b7cde5a6ac7318\n\nSeriously, look through Yahoo finance and look up a company and their top institutional holders. They're all BlackRock and Vanguard.  \nBlackRock currently has an Asset Under Management value of US$9T (9,000,000,000,000).  \nVanguard has US$7.1T.  \nTogether it’s $16.1Trillion.  \nThe reason why I put them together is because the highest institutional holder of BlackRock shares is Vanguard.  \n\nNOW.\n\nThis is a very important headline.  \n[https://www.bloomberg.com/news/articles/2020-05-21/how-larry-fink-s-blackrock-is-helping-the-fed-with-bond-buying](https://www.bloomberg.com/news/articles/2020-05-21/how-larry-fink-s-blackrock-is-helping-the-fed-with-bond-buying)  \n‘BlackRock is now the Fourth Branch of Government.’  \nThis headline is important because it’s not really much of a metaphor. BlackRock assists, funds and even advises government entities as well central banks.   \n\nThat’s a stupid amount of power.  \nNow from here we have a motive under a certain conspiracy theory. A good video on it here:  \n[https://www.lewrockwell.com/2021/04/bill-sardi/who-runs-the-world-blackrock-and-vanguard/](https://www.lewrockwell.com/2021/04/bill-sardi/who-runs-the-world-blackrock-and-vanguard/)  \n\n\nThis video is where I’ve got most of the research up until this point in the DD. It’s worth a watch if you have time, seriously. It’s a lot to take in but all the information is cited, and with all the bullshit we’ve seen citadel pull it’s really not that far-fetched.\n\nBack to the topic at hand.   \nWhat happens when you combine the very largest securities holders on the planet that have government ties and a sneaky rule that allows Investment companies to buy out other companies without any prior permission? See where I’m going with this?  \nAnd if this wasn't good enough, this whole GME fiasco is going to be a double whammy for our big friend BlackRock.  \nSince, (quoting DR. T) “Citadel doesn’t wear clothes” they’ve been keeping the prices on the stock market incredibly low, we know this. Citadel has been a leech on these two giants for many many years, and GME is the prime time to rip this leech off by its slimy ass tail.  \nBut the juicy treat is not Citadel. It’s the DTCC.  \nAnd I mentioned this in a previous fluff post after an epiphany one sleepless night.  \nWhen Citadel is done, and the bill comes in at $64Trillion.  \nNot only will these megalodons have a portfolio through the fuckin roof when all of their shares come back above water with the stock market inflating again.  \nBut they can literally buy the DTCC, piece by piece as GME shoots through the goddamn milky way.\n\nBelow is a very detailed step by step visual for those who still don't see where this is going.  \n\n\n[I made this with all the crayons I haven't eaten yet.](https://preview.redd.it/f5lle58dzoz61.png?width=1152&format=png&auto=webp&s=4a93bbfb2fd9099fc847203bd2a9261a56afabbd)\n\nWhat this means is not only are BlackRock and Vanguard going to own the entire stock market by holding all of its physical shares.  \nThey’re going to own every single company in it.\n\nAnd because of this ownership rule, they’re going to own the entire western face of this planet in one swing, have total undeniable control and no one can stop them.\n\nWhat they plan and what happens after is open for debate, my best guess is what is explained in the video I linked earlier.\n\nTLDR: invest in gold or BlackRock after GME moons.",
    "title": "A string of events are unfolding that cannot be stopped",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nei95i/a_string_of_events_are_unfolding_that_cannot_be/"
}