{
    "author": "Suspicious-Singer243",
    "created_utc": 1621261422.0,
    "distinguished": null,
    "edited": 1621263450.0,
    "id": "nehluy",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nehluy",
    "num_comments": 60,
    "permalink": "/r/Superstonk/comments/nehluy/april_16_an_ftd_origin_story/",
    "score": 1590,
    "selftext": "As I write this at 9:10 CDT, $GME is up 5%. **A solid, solid green day.**\n\nYesterday I [argued in some DD](https://www.reddit.com/r/Superstonk/comments/ndzxdh/origin_stories_an_uncovering_of_more_ftd_cycles/) that **there are not one, but at least FIVE active FTD cycles**. This explains the previously random 3%+ upswings in GME through identifying the data at which the initial naked short sell scam began for each cycle.\n\n**I did not include April 16th as an origin date because we did not have confirmation** of a solid green day.\n\nGiven this morning's price movement, **I am highly suspicious that April 16th initiated a new cycle.**\n\nHere's why:\n\n1. **Seemingly unexplained, yet significant upward movement in price**. No catalyst, news, or visibly large buys.\n2. **April 16th was a monthly options date**. These are dates that were the only available options month or a year prior to the date, meaning there was a heavy concentration of positions. More importantly, a heavy concentration of positions far in the money (the strike price of the option was well below the price of GME).\n3. **Brother** u/deepfuckingvalue\\*\\*.\\*\\* Many of those far in the money options were his at $12, which may have provided him possibly more than a slight ability to effect price on his own. He also bought 50K more shares.\n4. **Strong buyer sentiment.** Do you remember how many people were on the sub alone hitting refresh to see what DFV did? Now consider Twitter traders who might take a position for fun just in case we are right? The world watched to see what happened that day. And, after hours price rose. But, should it have gone up more?\n\nEdit: This is pure speculation. Another thought is that April 19th(Monday) gapped up and hit a high of $175. Then over the course of the 19th and 20th they dropped it from down to $153 over those days. That's a price reduction of 12.5%. Let's look for confirmation tomorrow and Wednesday.\n\n**Conclusion:**\n\nMy belief is that April 16th was the initiation of a new 21-day FTD cycle. They heavily shorted the stock to fight back buyer sentiment during regular trading hours, likely matched DFVs 50K new share purchase in after hours, and battled upward pressure due to calls being exercised.\n\nOnly time will tell...\n\nTick tock,\n\nu/suspicious-singer-243",
    "title": "April 16: An FTD Origin Story",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nehluy/april_16_an_ftd_origin_story/"
}