{
    "author": "JustBeingPunny",
    "created_utc": 1617364726.0,
    "distinguished": null,
    "edited": 1617365629.0,
    "id": "miiuy3",
    "text_only": true,
    "flair_text": "News 📰",
    "name": "t3_miiuy3",
    "num_comments": 40,
    "permalink": "/r/GME/comments/miiuy3/04022021_the_daily_fud_report_from_the_fud_patrol/",
    "score": 835,
    "selftext": "*This post was previously removed for breaking sub rules. It has been amended and the previous post deleted. I apologise for doing so and aim to be more vigilant in the future.*\n\n&#x200B;\n\n**GOOOOOOOOOOOOOOOOOD FRIDAAAAAAYY**\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xk10krp4yqq61.png?width=252&format=png&auto=webp&s=49ed045fc3b83154024b43664acdc791c4e5ccbe\n\n&#x200B;\n\nYes. It's good Friday.\n\nYes you should have a ***\"day off\",***\n\nBut I know some of you apes are here lurking, looking for that sweet sweet nectar of news. Your loved one is busy with their sidepiece and you've just had crayola soup for breakfast. BUT YOU NEED NEWS.\n\n[**u/Rensole**](https://www.reddit.com/u/Rensole/) **has deservedly taken today off, the market is closed. The ape is a god and must have 69 hours in the day to provide what he does without failure.** [**u/thr0wthis4ccount4way**](https://www.reddit.com/u/thr0wthis4ccount4way/) **deserves an honorable mention for the GOD TIER DD. The rest of the mods also deserve heaps of praise for their time and dedication to this sub.**\n\n*Also, If any of you apes can use that Adabo Fortoshop. I'd love to rep a FUD PATROL logo!*\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\n# YOU WANT DATES... HERES A DATE I CAN GET WITH.\n\n&#x200B;\n\n&#x200B;\n\n[Let's just put this one in our calendars.](https://preview.redd.it/0uveedv8yqq61.png?width=300&format=png&auto=webp&s=1bf519f624841737cda5cc0c3829ef4e00de1d90)\n\n&#x200B;\n\n🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀\n\n&#x200B;\n\n# TODAY'S TOP SUBJECT...\n\n&#x200B;\n\n# MAINSTREAM MEDIA TALKING POSITIVELY ABOUT GAMESTOP.\n\n*But they're talking...positively?...What could be so wrong?*\n\n# \n\n**THE FUD PATROL SMELLS A BIG PILE OF FUDDY POOP** (*AND THIS TIME, IT'S NOT MINE)*\n\n&#x200B;\n\n*THIS IS FOR SOME OF THOSE MOTLEY FOOLS THAT STILL THINK THE MEDIA HAS OUR BEST INTERESTS AT HEART. EDUCATE OUR FELLOW PEOPLE AND AID THEIR TRANSITION TO* ***APE***\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\n# The breakdown\n\n&#x200B;\n\n&#x200B;\n\n[I just typed \\\\\"breakdown\\\\\" into google and this was first image, I swear](https://preview.redd.it/vou6h7rkyqq61.png?width=220&format=png&auto=webp&s=73205061408d28cc49dc19393feb39bdabc3bbe0)\n\n&#x200B;\n\n**The media is known to be as easy to buy as Friday fire sale. In fact, it's known HF even incorporate this into their investments! The blatant previous shilling to prevent the squeeze and the negative narrative shows that.**\n\n**It would be no surprise when there is a sudden change from the media's current, bullish outlook on GME, to bearish within a week. I believe it to be due to 2 leading possibilities:**\n\n&#x200B;\n\n&#x200B;\n\n# 1. The media are protecting themselves (possible)\n\nI'll keep this short. This is one is obvious. The media have access to exactly the same DD on [r/GME](https://www.reddit.com/r/GME/) that we do and in fact, they possibly have just a little more info.\n\nThey (like us) know the market is going to crash harder than the Wall St. pavement and one of the few stocks to come out alive positively afterwards, will be GME.\n\nThey  begin to talk positively about GameStop, so when it moons, they pull the '***WE*** ***TOLD YOU SO. WE CALLED THE BIGGEST TRADE OF THE CENTURY!'***\n\n**They currently do this when the stock plummets, so it's not hard to believe them doing the same when it goes up.**\n\nBoomers will be glued to the articles forever on as they now know *'this is where the best investment advice is'*\n\nThis could also mean that the short HFs don't have enough firepower to control the media and in fact, the longs might just have outbid the position. Maybe a whale is now controlling the narrative?...\n\n***If one media outlet begins to talk positively, they all do. Would you have wanted to have wrote  'GME IS FINISHED', as it moons? While your competitors began reporting it before it squeezed?***\n\nSo why is this only a *'possible'?* Well these media outlets still survived on HF money after the 2008 collapse. It seems they all can say what they want with ZERO repercussions. So I can't be sure they care too much about what they say. But if the company that funds them goes under? Well......\n\n&#x200B;\n\n# 2. The HF are using the media to shill positively, encouraging buyers only to drop the price and shake paper hands (more likely)\n\n&#x200B;\n\nThis is the more likely scenario. This is a textbook approach used before. The situation is as follows.\n\n* Create positive sentiment, drawing in buyers from a wider audience and pushing up the price.\n* HF prepare all the shorts and tactics they have in their arsenal\n* When they feel the price has been pushed up enough, they hit the stock as **HARD AS POSSIBLE**, shaking paper hands to snowball the downward momentum\n* They then drink some champagne on the balcony of Wall St to celebrate.\n\nThis is more likely. It's been used time and time again as a tactic for HFs. Shaking paper hands is one of their only ways to prolong the situation, though currently this is a very dangerous tactic.\n\n&#x200B;\n\n**Any upwards momentum might be just a bit too much for them to contain and could spark it to fly upwards. As seen previously, only a small amount of buying pressure is needed to make it jump a few $.**\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\n# TODAY'S LESSON\n\n&#x200B;\n\nThe overriding motive is to talk truthfully about current events to **gain trust.** So when they then report on the stock going down,'**tHeY MuSt bE TeLLiNG tHe TrUth'**\n\n&#x200B;\n\n&#x200B;\n\n['tHeY MuSt bE TeLLiNG tHe TrUth'](https://preview.redd.it/0ecy85u21rq61.png?width=3880&format=png&auto=webp&s=603b4e3212d946ee22c4ba5018a172ac82b9b374)\n\n&#x200B;\n\n**This balanced narrative is usually an act. The whole media is an act (but let's stay focused).**\n\n**So when your mother, father, caretaker, zookeeper, friends** ***(that aren't on*** [r/GME](https://www.reddit.com/r/GME/)) **or anyone else for that matter, shows you that everyone is now bullish about GME, show them why! BUT TELL THEM TO BEWARE OF THE POSSIBLE SHILLING THAT MAY FOLLOW.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# USE THE BULLISH MEDIA TO YOUR ADVANTAGE. Explain why it's right to be bullish (new team, Ryan Cohen)\n\n&#x200B;\n\n# BUT, recommend that if they do invest in GME, they only know to HODL.\n\n&#x200B;\n\n# Bring them here to understand the motivation for HF and media to create positive sentiment, for it only change in a weeks time to make you sell.\n\n&#x200B;\n\n# SHOW THEM WHY NOT TO LISTEN AND WHY THEY SHOULD HODL EVEN MORE.\n\n&#x200B;\n\n# 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nHave some big rockets.\n\n&#x200B;\n\n**Apes no fight other apes. Apes help apes. --------------------** ***If in doubt, HODL it out.***\n\n&#x200B;\n\n**FUD PATROL lives on.**\n\n*Disclaimer- This is never financial advice. In fact this is the FUD PATROL explicitly stating that your financial investments are of your own free will and any decisions should not be influenced by any previous, present or future posts.*",
    "title": "04/02/2021 - THE DAILY FUD REPORT FROM THE FUD PATROL - Today's FUD, the positive media narrative and why all may not be as it seems!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/miiuy3/04022021_the_daily_fud_report_from_the_fud_patrol/"
}