{
    "author": "luytes",
    "created_utc": 1617383114.0,
    "distinguished": null,
    "edited": false,
    "id": "miolkm",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News 📰",
    "name": "t3_miolkm",
    "num_comments": 140,
    "permalink": "/r/GME/comments/miolkm/citadel_buying_dc_regulator_to_keep_markets/",
    "score": 5457,
    "selftext": "I’m gonna repost this, since the downvotes this post is getting is more than usual, they really don’t want this to be seen. Credits to Dennis Kelleher u/WallSt4MainSt\n\n——————\n\nCitadel buying DC regulator to keep markets rigged & dark\n\nNot going to post very often unless I really think it'll be of interest, but it was just announced today that the most recent Chairman of one of Washington's most important financial regulators, the Commodity Futures Trading Commission (CFTC), was purchased, er, I mean hired by Ken Griffin at Citadel; as [www.bettermarkes.com](https://www.bettermarkes.com) press release below states, this is how they rig the system against you ( [https://bettermarkets.com/newsroom/epidemic-regulators-selling-out-highest-big-finance-bidder-undermining-public-confidence](https://bettermarkets.com/newsroom/epidemic-regulators-selling-out-highest-big-finance-bidder-undermining-public-confidence)):  \n\n**The Epidemic of Regulators Selling Out to the Highest Big Finance Bidder & Undermining Public Confidence via the Revolving Door Must be Outlawed**\n\n**Washington, D.C.** **–** Dennis M. Kelleher, President and Chief Executive Officer of Better Markets, issued the following statement in response to [reports](https://www.bloomberg.com/news/articles/2021-04-01/citadel-securities-hires-ex-cftc-chairman-tarbert-as-legal-chief?sref=mQvUqJZj) that the most recent Chairman of the Commodities Futures Trading Commission (CFTC) was just hired by Citadel Securities:\n\n“The announcement that the most recent Chairman of the Commodities Futures Trading Commission (CFTC) has been hired by Citadel Securities as its Chief Legal Officer is just the latest regrettable example of a senior government regulator appearing to sell out his public service to big finance via the revolving door. Recent ex-regulator hires at Robinhood, Coinbase, D.E. Shaw, Apollo Global Management, Spring Labs and many others preceded this latest revolving door hire by Citadel. \n\n“This is little more than legal corruption and bribery. That’s why the revolving door used to be looked down upon as disreputable and sleazy, often referred to as ‘influence peddling.’ This undermines the trust and confidence in government by the American people and it demoralizes the many hard-working public servants who sacrifice to actually serve the public.\n\n“Out of hundreds of millions of Americans in the workforce, it is implausible that these people are being hired solely on the merits. They appear to be purchased, at least in part, for the insider knowledge, access, and connections they obtained while purportedly serving the public. These revolving door purchases are examples of how Wall Street uses its economic power to buy political power to keep the financial system rigged to enrich themselves at the expense of retail investors, the financial system and, ultimately, the country. This corruption disgusts the American people and Congress should outlaw it by prohibiting former regulators from working directly or indirectly for any entity within their jurisdiction while in government for not less than five years.”\n\nNot financial advice",
    "title": "Citadel buying DC regulator to keep markets rigged & dark",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/miolkm/citadel_buying_dc_regulator_to_keep_markets/"
}