{
    "author": "Criand",
    "created_utc": 1626680716.0,
    "distinguished": null,
    "edited": 1626681505.0,
    "id": "on9dtz",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_on9dtz",
    "num_comments": 476,
    "permalink": "/r/Superstonk/comments/on9dtz/otm_puts_are_the_passed_puck_of_short_positions/",
    "score": 8311,
    "selftext": "# 0. Preface\n\nI am not a financial advisor. I do not provide financial advice. Many thoughts here are my opinion, and others can be speculative.\n\nSpeaking of which - **this whole post is rather speculative. It needs more discussion**. **I marked it as possible DD.** This is a spill of thoughts. Notably two things here which need further discussion:\n\n* **I don't believe FTDs have ever driven the price movements and therefore T+21/T+35 cannot be the solution to the puzzle.** I'm leaning towards Net Capital around monthly options and SLD phases instead.\n* **The \"OTM PUTs\" that expired on July 16th and other dates are not hidden FTDs.** I believe that these are Covered PUTs that the SHFs have sold to 'pass the puck' of their short position as a balance sheet trick. Therefore you should **not** expect the price to shoot up from these PUTs. However, the expirations are significant and in theory shift their margin call price down.\n\nAnd yup - I've written about both of these in the past. T+21 and the OTM PUTs. Guess what - I can be wrong and I have been wrong in the past. The T+21 cycle (or T+35 theory) seemed good until it let out a tiny fart on June 24th. That's when it was time to take a step back and look at everything again.\n\nDoes this change the thesis that shorts haven't covered? Hell no. I'm just saying we probably still don't know what's driving these price movements.\n\nI'm tossing a curve ball at you. Or rather a curve wrench.\n\n[ Dodge this suckas](https://preview.redd.it/x9ovppsui4c71.png?width=2560&format=png&auto=webp&s=566c30e930070e19f9112199c96668331404426a)\n\n# 1. FTDs are not driving price movements; Reg Sho has done nothing\n\nAs a recap of Reg Sho: It was implemented by the SEC to try to curb short selling and naked short selling by establishing a few rules regarding failures to deliver (FTDs). These rules force close-out of FTDs on a timeframe barring various conditions.\n\nThe notable sections are [242.204](https://www.law.cornell.edu/cfr/text/17/242.204) and [242.203](https://www.law.cornell.edu/cfr/text/17/242.203) where some theories of GME price movements originated from.\n\nBasically, these rules require FTDs to be closed out after N number of days of being identified as a FTD. For the T+35 theory, it requires **buys** to close out the FTDs.\n\n[ 242.204\\(a\\)\\(2\\) - T+35 Theory Origination](https://preview.redd.it/70q16sdwi4c71.png?width=1534&format=png&auto=webp&s=95f30e10b12ab6b6778d33ad138846ab95adfb02)\n\nSeems reasonable. We could track an FTD spike and then count out T+N days and a buy-in should occur to drive the price movements.\n\nHowever, the text is important here. It states, \"...on the thirty-fifth consecutive calendar day following the trade date for the transaction, immediately **close out the fail to deliver position...**\".\n\nThis means that for 242.204(a)(2), or any Reg Sho rule to apply, the FTDs would have to be carried **the full 35 days** in order to be subject to this rule. Reg Sho isn't going to apply to FTDs which are no longer reported to the SEC because they have already been satisfied/closed out.\n\nPopping up a chart from October 2020 to January 2021:\n\n[ FTDs October 2020 to January 2021](https://preview.redd.it/amu49t10j4c71.png?width=2195&format=png&auto=webp&s=d6d265961de1859d87d5441cdd2c79f619b93050)\n\nWay on the left side, there is a spike of FTDs reaching 3,000,000 aggregate around October 12th. By October 13th, the FTDs dropped to around 1,000,000. By October 15th, FTDs dropped to a meager 40,000.\n\nReg Sho T+35 **does not** apply here to those 3,000,000 FTDs because they were already satisfied/closed out by October 15th. If buy-ins were used to satisfy the FTDs, then we should have seen a price increase when the FTDs were satisfied. But, that did not happen. The price stayed stagnant.\n\nThe same continued on through the rest of 2020 and into January 2021 until FTDs permanently dropped to an average of under 100,000. FTDs are closed out/satisfied, price doesn't increase due to buys, and those FTDs are gone. They're not subject to the T+35 rule because they are not carried the full time to be obligated by those close-out rules.\n\nFollowing January, they allegedly moved to shorting ETFs containing GME. Here's a chart from /u/broccaaa charting FTDs of GME + ETFs from January 2021 to May 2021:\n\n[ FTDs January 2021 to May 2021](https://preview.redd.it/jd6bnof1j4c71.png?width=1751&format=png&auto=webp&s=019c20d8feeada06ebf89260d8b5029497d93d8f)\n\nThere are red arrows pointing to drops in FTDs throughout the year. Despite there being significant fails on certain dates, they were closed out almost immediately and were no longer subject to Reg Sho requirements just like from October 2020 to January 2021. Again, notice how no significant price movements occurred when these FTDs were 'closed out'.\n\nThe key takeaway here being that if Reg Sho was actually driving the price movements, then we would be seeing FTDs accumulate and be carried the full T+N days for buy-ins to be forced. Rather, they are satisfied/closed out rather quickly without any significant increase of the stock price.\n\nOn top of this, I do not see how only a couple million FTDs could suddenly cause a surge of 20-30 million volume per day for that price surge from May 25th to June 8th. Likewise back for the January or February spikes with tens of millions and hundreds of millions of volumes. The number of FTDs just does not line up.\n\nWith all that being said, I can't see T+21/T+35/T+N/Reg Sho playing a role here **at all**. Mainly because of loopholes and bypassing close out requirements.\n\n# 2. Loopholes, Buy-Writes, Dodge Reg Sho Forever\n\nIf you can dodge ~~a wrench~~ Reg Sho, you technically don't have to meet your FTD closeout obligations, and you can continue on happily shorting a stock.\n\nHere's a little blog post about possible [dodging of reg sho closeout requirements](https://smithonstocks.com/part-6-illegal-naked-shorting-the-secs-regulation-sho-is-intended-to-prevent-illegal-naked-shorting-but-is-ineffective/). It outlines quite a few possibilities despite Reg Sho being 'foolproof'. Note that these are alleged and have not necessarily been performed - ever. But, it is worth bringing up because there's still cracks that can be used to circumvent the rules.\n\n[ https:\\/\\/smithonstocks.com\\/part-6-illegal-naked-shorting-the-secs-regulation-sho-is-intended-to-prevent-illegal-naked-shorting-but-is-ineffective\\/](https://preview.redd.it/qcd9kw03j4c71.png?width=721&format=png&auto=webp&s=f4e11694f8600204680421ba659bbf85212a04d0)\n\nOne thing that is not listed above are buy-write trades as defined by the SEC itself. Which there is pretty good evidence of, and therefore much more believable than the above bullets.\n\nI've posted [about buy-writes in another post](https://www.reddit.com/r/Superstonk/comments/oc4f79/well_there_it_is_more_mathevidence_pointing_to/) where I did some quick math to show that the shorts most likely never covered when the SI dropped from \\~226% to \\~30%. Instead, they utilized a malicious options practice called a \"buy-write trade\". This trade is with a complicit market maker to make it appear that the SHFs had met their FTD close-out obligations while still maintaining their position.\n\nThe buy-write is a quick transaction:\n\n1. The SHF sells deep ITM CALLs to a Market Maker (or other counterparty). They choose deep ITM CALLs due to the almost guaranteed trade between the two parties. It is unlikely that others would be using these deep ITM CALLs.\n2. The Market Maker sells shares to the SHF. They can sell these shares without first locating them in a bonafide agreement. So, despite liquidity, the trade can be performed.\n3. The SHF now has enough shares to spoof to the Clearing House that they \"met their FTD closeout obligations\" because they \"have the shares\". The FTDs that are reported drop off a cliff.\n4. The Market Maker wants to remain neutral in this trade. They exercise the deep ITM CALL to get the shares that they sold to the SHF back to them and the trade is closed out.\n\nWhat happened here is that the SHF never lost their original short position and the Market Maker remained neutral in the trade without generating additional shorts.\n\nSo in the entire buy-write transaction, a deep ITM CALL is used to swap these shares. These typically happen on the same day and CALL OI does not increase because the options are closed out right away. Let's check for evidence of these buy-writes in October and January:\n\n[ Buy-Writes in October 2020 and January 2021](https://preview.redd.it/7e0wj9h4j4c71.png?width=2195&format=png&auto=webp&s=6a7871bc68003f26288ccecaca645fb8ae96a6a3)\n\nIn the above picture, big spikes of ITM CALL volumes occur around FTD dates, and there is no subsequent increase of ITM CALL OI despite the large volumes. Glance at the volumes for January 22nd, 2021 and the corresponding change in OI. That's... a lot of volume for little to no OI change.\n\nPoof. The FTDs are gone and the SEC gives Reg Sho a handshake for a job well done.\n\nThese alleged buy-writes continued to happen throughout 2021 per /u/broccaaa's data on suspicious deep ITM CALL volumes. The die-off of the ITM CALLs comes coupled with the lack of FTDs on GME itself because shorting was most likely moved to ETFs.\n\n[ https:\\/\\/www.reddit.com\\/r\\/Superstonk\\/comments\\/mvdgf5\\/the\\_naked\\_shorting\\_scam\\_in\\_numbers\\_ai\\_detection\\/](https://preview.redd.it/qg2pocu5j4c71.png?width=1918&format=png&auto=webp&s=c1daf4e5f1952120e7f67703fc94326b485e0c31)\n\nIf they have been performing these buy-write trades and potentially other FTD dodging methods for a long time, I doubt that they'd suddenly stop and allow Reg Sho to take over. They'd continue to kick the can by any means. FTDs for GME have been a meager amount for a long, long time, and they are never carried the full T+N days. If they can dodge closeout requirements with any method whatsoever, then why not continue doing it over, and over, and over?\n\nI just can't see Reg Sho or T+21/T+35 playing a role. I can, however, see the price movements being about monthly options and net capital because it becomes a balance sheet issue.\n\n# 3. Monthly Options, SLD Phases, Net Capital, and Share Offerings\n\nThank you to /u/JaboniThxDad (and many other users) who identified the share offerings could have been detrimental to the price movements and suppressed things: **T+21. The game of Hide & Seek is finally over. And while I'm at it I might as well try to prove how July 14th is going to become our new January 13th.**\n\nWhich makes sense. The two share offerings that occurred were:\n\n* April 5th to April 26th: 3,500,000 shares\n* June 9th to June 22nd: 5,000,000 shares\n\nThis means that not only were 3,500,00 + 5,000,000 = 8,500,000 shares sold into the market resulting in more sell pressure, there was also that many more shares available to legally borrow. These allowed a large suppression of the price because that was about 15% extra float added from the original 57,000,000 float.\n\nPer the above sections of this post, I think FTDs and Reg Sho do jack-all. In my eyes, it would be balance sheet related, such as Net Capital 240.15c3-1. I've written [a post about Net Capital in the past](https://www.reddit.com/r/Superstonk/comments/ny2ov4/a_revisit_to_net_capital_what_is_truly_driving/) thinking it tied together the T+21 theory. But again, I'm tossing out T+21/T+35/T+N completely.\n\nA quick summary of [Net Capital Requirements For Brokers or Dealers - 240.15c3-1](https://www.law.cornell.edu/cfr/text/17/240.15c3-1):\n\n>...is designed to ensure that a broker-dealer holds, at all times, more than one dollar of highly liquid assets for each dollar of liabilities (e.g., money owed to customers and counterparties), excluding liabilities that are subordinated to all other creditors by contractual agreement. The premise underlying the net capital rule is that if a broker-dealer fails, it should be in a position to meet all unsubordinated obligations to customers and counterparties and generate resources sufficient to wind down its operations in an orderly manner without the need of a formal proceeding......**A broker-dealer must ensure that its actual net capital exceeds its required minimum net capital at all times.** \\- [Source](https://www.mercatus.org/system/files/peirce_reframing_ch6.pdf)\n\nIn other words, you must have enough capital to not be margin-called. If they do not maintain enough capital, they're a risk to their customers and counterparties. This rule tries to ensure that they have enough money to pay up in the event of a default.\n\nThe juicy part is that short securities on their books are calculated with an ever-increasing haircut against their net capital requirements. So the longer those short positions are held, the more it eats away at their net capital and puts them at risk:\n\n[ Net Capital Rule; Short Securities Deduction From Net Capital Per \\\\\"Days After Discovery\\\\\"](https://preview.redd.it/ietff7d7j4c71.png?width=1228&format=png&auto=webp&s=6c624ef28d822d76230233750e1164af513b5fae)\n\nWe also have Supplementary Liquidity Deposit (SLD) phases around monthly options which requires a chunk of liquidity to be deposited to the NSCC two days prior to monthly options expirations and is held by the NSCC until T+2+7 = T+9 days following expiration. This is a perfect opportunity for the SLD requirement to eat up enough liquidity for Net Capital to become an issue. Their short positions cannot let them default, so they'd need to wipe out the positions with buy-ins. It's off to the races in some SLD periods as the price goes on a spiral upward driving more buy-ins.\n\nBut, if a share offering is placed around these monthly options - then it can kill off the momentum due to the dilution of shares and giving a larger amount of fresh shares to borrow. Here's everything plotted out since January:\n\n[ Price Movements Around Monthlies, SLD Periods, and Share Offerings](https://preview.redd.it/bgeuzrp8j4c71.png?width=2433&format=png&auto=webp&s=1fdf7e656257b694452218943c8e67d807a54567)\n\n1. January - no share offering. Price goes on a run.\n2. February - no share offering. Price goes on a run.\n3. March - Price starts to go on a run, share offering kicks in and kills the momentum.\n4. April - Price cannot start on a run because of the share offering. Extra shares available to legally borrow / short.\n5. May - no share offering. Price goes on a run.\n6. June - Price cannot start on a run because of the share offering. Extra shares available to legally borrow / short.\n7. July - no share offering. Price might go on a run.\n\n# 4. OTM PUTs are not hidden FTDs. But, they could be a passed puck of the short positions\n\nOn to my other speculative part of the post.\n\nOh magic 8-ball 🎱, tell us what the OTM PUTs mean. Because I sure as hell don't know - but I have a theory.\n\nThere are a few posts thinking that these OTM PUTs are hiding FTDs and that there will be buy pressure because of expiration. I **do not** think that is the case. Rather, the expirations of these OTM PUTs is more detrimental to the SHFs due to it being a 'passed puck' coming back to them.\n\nThe main theory is that they're utilized as married PUTs to hide FTDs and dodge Reg Sho closeout obligations. **I have three problems with this**:\n\n* The Married PUT method, as [outlined by the SEC](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf), would typically use ATM or ITM PUT options. What we've been seeing are **deep** OTM PUTs. Such as $0.50 deep. Literally the lowest possible things could go. They could just have a market maker saying \"well, screw it, let's do a married PUT\", but that feels like too much of a leap.\n* The buy-write trades are already being used to dodge the Reg Sho closeouts and we see evidence of them utilizing the deep ITM CALLs to perform that trade. The numbers of the buy-writes and OTM PUTs lines up scarily close from the January drop of 226% -> 30% SI (1.1M CALLs and 1.1M PUTs). Why would they double-dip? One of the methods is enough to accomplish this goal.\n* There have been significant OTM PUT expirations over time with no buy pressure following the expirations. January 29th (327,000), February 5th (263,000), February 12th (248,000), March 19th (447,000), April 16th (427,000).\n\nSo... what's going on? Again, this is speculative. But I believe that they utilized the \"Covered PUT\" approach. This is easy enough for the SHF to do, because they already met the requirements in order to sell them. It's like selling a covered CALL - you'd need 100x shares to be able to sell the covered CALL to someone. In order to sell the covered PUT - you'd need 100x shorts. In this trade it would be the SHF selling and (presumably) Citadel buying.\n\n[ https:\\/\\/www.adigitalblogger.com\\/option-strategy\\/covered-put\\/](https://preview.redd.it/gvm2yzhaj4c71.png?width=778&format=png&auto=webp&s=40a3133df11e296ab3ce47a24b6837ee1a76a4b3)\n\nThe SHFs already have their shorts. They've already masked their FTDs/shorts to the clearing house through buy-write trades. Why open up the OTM PUTs? Why sell them?\n\n1. The SHF can get a tiny amount of cash as premium when they sell the OTM PUT. Very, very miniscule amount. But enough to give them a slight buffer in their cost basis of the short position.\n2. **\\[Speculative\\]** The SHF can pass the puck of their short position over to the buyer of the PUT until expiration. On the SHFs balance sheet they can erase the short position and say that they are now \"short the PUT\" rather than being \"short the stock\". And thus, their shorts will no longer be a danger of them being margin called.\n\n\\_\\_\\_\n\n**NOTE: Arbitrary numbers being used as an example here**.\n\nIn other words for #2, think of the following:\n\nYou have 30,000,000 shorts on GME. Your short position is eating up 30,000,000 \\* $150 = **$4.5 Billion** and you're close to being margin called. What do you do?\n\nAh! You'll sell covered PUTs to your buddy who wants to help you not get margin called. The puck will be passed to them until expiration and the price will hopefully go down really low by then.\n\nYou can't scrub all of the shorts, but a good majority, so you sell 20,000,000 / 100 = 200,000 OTM PUTs to them.\n\nThe puck is passed until expiration, and you now effectively have 30,000,000 - 20,000,000 = 10,000,000 shorts on your balance sheet. Your short position is only eating up 10,000,000 \\* $150 = **$1.5 Billion** and you're safe from being margin called for the time being. **The margin call price has essentially been shifted up 3x despite the price still trading at $150**. The math isn't that simple but that would be the jist of it.\n\nMaybe you spread those PUTs out to various expiration dates. Over time, those PUTs expire and it slowly passes the puck back to you. Those PUTs are gone but your short positions are transferred back to you. It's a game that can't be played forever - better hammer the price down before time runs out.\n\nOne date rolls by and it expires 50,000 of those PUTs. That's 5,000,000 shorts back for a total of 15,000,000 of the original 30,000,000. The short position is now eating up 15,000,000 shorts worth off of the balance sheet rather than only 10,000,000 shorts. The margin call price starts to shift back down.\n\nSoon enough, all of those PUTs expire and all the shorts are back on your balance sheet. You better hope that the price has deteriorated enough to avoid being margin called by the time that happens.\n\n\\_\\_\\_\n\nWhat have we seen over time? OTM PUT OI skyrocketed in January and has been deteriorating over time. If the theory is correct, then their margin call price was shifted up a significant amount in January when PUT OI peaked and has been decaying since then.\n\nNotice the massive drop following April 16th expirations. Surprise! It's no ordinary option expiration! That's when Citadel and banks were starting to work the night shift.\n\nThe July 16th expirations should drop the majority of these PUTs once more, sending back roughly 400,000 OI = 40,000,000 shorts worth back to their balance sheets with a remaining \\~200,000 OI on January 2022. Once again, surprise surprise, lots of FUD started popping up around this significant expiration date.\n\n[ \\/u\\/broccaaa https:\\/\\/www.reddit.com\\/r\\/Superstonk\\/comments\\/o14ccz\\/the\\_naked\\_shorting\\_scam\\_in\\_numbers\\_part\\_deux\\_up\\/](https://preview.redd.it/zxyalm4cj4c71.png?width=1917&format=png&auto=webp&s=1e6b0cad0d1bc1a1cc635c1dfe9a9d5f088f12d4)\n\nBy the looks of it, this is what is currently going on (assuming \\~1.1M total OTM PUTs = 110m shorts = 190% SI of float stuffed away in January):\n\n|Date|Number of Shorts Still Hidden in OI|Number of Shorts Back on Balance Sheets|Number of Shorts Still Hidden In OI (%)|Number of Shorts Back on Balance Sheets (%)|\n|:-|:-|:-|:-|:-|\n|(End of) January|\\~110,000,000|\\~0|\\~100%|\\~0%|\n|February|\\~100,000,000|\\~10,000,000|\\~91%|\\~9%|\n|March|\\~95,000,000|\\~15,000,000|\\~86.5%|\\~13.5%|\n|April|\\~60,000,000|\\~50,000,000|\\~54.5%|\\~45.5%|\n|May|\\~55,000,000|\\~55,000,000|\\~50%|\\~50%|\n|June|\\~55,000,000|\\~55,000,000|\\~50%|\\~50%|\n|**July**|**\\~20,000,000**|**\\~90,000,000**|**\\~18.2%**|**\\~81.8%**|\n\nThe SHFs are about to get a huge puck of shorts passed back to them. Which can shift the margin call price down **a lot**. Which could be why there is so much desperation lately to hammer the price and instill FUD. Interesting timing around this massive option expiration date in my opinion.\n\nIf you recall, [Melvin got their cash injection](https://www.bloomberg.com/news/articles/2021-01-25/citadel-point72-to-invest-275-billion-in-melvin-capital) on **January 25th. The price of GME that day went from open of $96 to a high of $159 to a close of $76.** The OTM PUTs and buy-writes started to occur on this date.\n\nMaybe the margin call price was actually hit in January but was dodged because of this practice by passing the puck for a brief period of time. Maybe the margin call price is about to come back close to those scary levels.\n\nBut maybe I'm also completely off track here.\n\n[ Picture stolen from a movie like how I steal other things](https://preview.redd.it/gz7sm3gdj4c71.png?width=621&format=png&auto=webp&s=d69f03a3d8529e86367084fe795533becd8911ae)",
    "title": "OTM PUTs are the passed puck of short positions that is slowly being passed back. The price movements are around monthly options, SLD periods, and net capital requirements. Not FTDs.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/on9dtz/otm_puts_are_the_passed_puck_of_short_positions/"
}