{
    "author": "-ordinary",
    "created_utc": 1617038477.0,
    "distinguished": null,
    "edited": 1617068365.0,
    "id": "mfujgv",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_mfujgv",
    "num_comments": 454,
    "permalink": "/r/GME/comments/mfujgv/i_gotta_be_honest_you_guys_im_leaving_the_sub_til/",
    "score": 6741,
    "selftext": "I’ve transcended my worries. And I know what I need to do (BUY and HOLD). What else is there? I can wait this bitch out as long as need be. \n\nY’all need to chill out. You’re arguing and becoming manic. I don’t even check the GME ticker much anymore TBH. I might actually uninstall my trading app to really enforce diamond hands and relieve myself of exposure.\n\nAnyway, I’ve had a blast, love y’all, talk to y’all on the other side ;).\n\nI love this stock.\n\n💎🚀💎🚀💎🚀💎🚀💎🚀💎🚀💎🚀💎🚀💎\n\nEdit: just wanted to say for my apes - pride is a useless tool. Anyway, I’m still active on Reddit in general and so seeing in my inbox the comments on this thread. I’m noticing that there are shill accounts goading me/heckling me/calling me a female genitalia (praise be). I made this edit to let y’all know that I find this to be confirmation that shills are using our beloved sub as a war ground. They need it. This gives me even more resolve, but more importantly is confirmation that they’re desperate. They must be desperate if they’re dependent on this place for their sabotage operations. Take this as you will. I meant what I said. I love y’all, but truly intend to distance myself from the noise and find sweet refuge in the space of my conviction. Wasn’t meant to be a vanity post but rather a message and invitation to others. Be good to yourself and trust what you already know. There aren’t many opportunities in life to express your values and resolve. This is one. See y’all on the other side.",
    "title": "I gotta be honest you guys. I’m leaving the sub til after the squeeze. Y’all are trippin.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/mfujgv/i_gotta_be_honest_you_guys_im_leaving_the_sub_til/"
}