{
    "author": "SG_Retard",
    "created_utc": 1627390409.0,
    "distinguished": null,
    "edited": false,
    "id": "osm965",
    "text_only": true,
    "flair_text": "News 📰",
    "name": "t3_osm965",
    "num_comments": 64,
    "permalink": "/r/GMEJungle/comments/osm965/as_sec_chairman_pushes_his_attorneys_some_are/",
    "score": 560,
    "selftext": "Gary Gensler's propensity to break up handshake settlement deals has created some distrust with current staff, sources say. Meanwhile, law firm demand is also driving some exits.\n\nJuly 23, 2021 at 05:30 AM\n\n8 minute read\n\nThe original version of this story was published on National Law Journal\n\nWhat You Need to Know\nRecruiters and former SEC lawyers are expecting an exodus of talent from the securities watchdog.\nFrom his days at the CFTC, new SEC chair Gensler has a reputation for pushing his lawyers.\nBut any outflow will likely be covered by a fresh batch of hiring at the SEC later this year.\nGary Gensler, the new U.S. Securities and Exchange Commission chairman, is pushing for tougher enforcement on a raft of investment and compliance issues. But in the process, he seems to be causing a stir among the agency’s senior attorneys.\n\nThe SEC has seen high attorney attrition this year, according to a tally of moves from the agency, and those talking with internal SEC lawyers are expecting more attorney exits. Some former SEC lawyers say Gensler’s propensity to break up handshake settlement deals that were in process before he became chairman in April has created some distrust with current SEC staff, as well as his hard-charging approach to managing SEC lawyers. Meanwhile, law firm hiring demand appears to be driving some exits, too.\n\nAccording to data provider Firm Prospects, which tracks attorney moves including in and out of federal agencies, 16 lawyers left the SEC from January through July 21 to return to private practice.\n\nOnly two of them—Chairman Jay Clayton, appointed by former President Donald Trump, and ex-SEC trading and markets deputy director Elizabeth Baird—arrived at the agency during the Trump administration. Baird was hired by the watchdog in September 2018 and left last month to Steptoe & Johnson. Clayton returned to his old firm, Sullivan & Cromwell.\n\nOne legal industry recruiter said the phone had been “ringing with associate director-level SEC attorneys in D.C., and senior officer regional director-level folks” who are looking for law firm jobs.\n\nThe exodus has not yet reached the heights of the first year of the Trump administration; by July 2017, the SEC had already lost 24 lawyers that year to private practice, according to Firm Prospects. In the same 2017 time period though, the agency also hired 20 more lawyers directly from law firms—resulting in a net decrease of four lawyers.\n\nSo far this year, the SEC has only added another nine attorneys, according to Firm Prospects—leading to a net decrease of seven in all.\n\nFormer SEC attorneys said they predict more defections this year based on some internal agency conflict. In particular, private practice lawyers who have recently left the SEC point to Gensler’s willingness to scuttle handshake settlement deals that agency attorneys already negotiated—more so, apparently, than previous chairs. \n\nDeals made by the enforcement division with rulebreakers require sign-off from the commission. While this sign-off is no rubber stamp in most cases, the commission often takes its cues from the lawyers who have worked on the deal and division management, explain lawyers familiar with the process.\n\n\nAccording to lawyers who have recently worked on enforcement deals with the SEC, multiple settlements have been rejected as they’ve been presented to the commission for approval because Gensler, they say, wants more compensation from the defendants and feels the levels of the last few years have not been sufficient.\n\n“He wants these cases settled, but he wants the resolutions to be stronger and more significant,” one former SEC lawyer, who is now a partner at a D.C.-headquartered firm, said.\n\nThe situation is disconcerting on two fronts, say former SEC lawyers who are now in private practice. One is that the staff is demoralized when a settlement is rejected by the commission. The other is that it “doesn’t look good,” said another ex-SEC attorney based in D.C., to go back to defense counsel and say “we thought we had authority to reach the settlement we agreed [on], but we don’t.”\n\n“Then SEC lawyers are probably going to have to litigate the action—assuming they can’t get defense counsel (who is now very irritated) to sign off on more severe remedies or penalties,” the lawyer continued. “Yet the SEC enforcement division probably doesn’t have the manpower to litigate, because the staff has shrunk due to attrition over the last four years. So, they’re trying to do more with less.”\n\nHaving to renegotiate settlements is leading to a lack of trust between the commission and Gensler on one side and the SEC lawyers who negotiated those settlements in good faith on the other, the lawyer said, adding, “That brings a lot of tension, and that makes people want to leave.”\n\nA D.C. securities litigator said the SEC has been “pushing hard” in some of the investigations he has been handling for clients. “They’re pushing hard in areas that seem a little excessive compared to previous negotiations.”\n\nYet one securities litigator who regularly negotiates with the SEC on enforcement matters says it is often the case that the commission rejects initial handshake agreements.\n\n“The frequency of rejection might be up at the SEC at the moment, but the commission knocking back initial settlement agreements is not a rare occurrence,” the securities litigator said.\n\nThe SEC did not reply to a request for comment.\n\nGensler’s Approach\nSome of the SEC exits are no doubt driven by law firm hiring in an environment of heightened securities enforcement.\n\n“The potential of more cases being investigated, more charges being brought, and more cases being litigated, there is more work on the defense side,” the legal industry recruiter said. “There is a market for those folks wishing to leave the SEC, especially given the complex nature of the work and the benefits of having counsel who understands internal SEC processes.”\n\nBut sources also point to Gensler’s no-nonsense approach to managing staff as potentially turning away some agency employees.\n\nAccording to one lawyer now in private practice but who worked with Gensler at the Commodity Futures Trading Commission (where he was President Barack Obama’s commissioner from May 2009 to January 2014), Gensler was notorious for pushing his lawyers hard when he was overseeing Dodd-Frank regulatory implementation.\n\n“Back then, it wasn’t the CFTC’s enforcement division that was bearing the brunt,” the ex-CFTC attorney said. “Instead, it was the regs people who were implementing Dodd-Frank [the sweeping post-financial crisis Wall Street reform act] who were under intense pressure from Gensler.”\n\nAs a result, Gensler’s CFTC was able to come out with its Dodd-Frank regulations ahead of the SEC. But the pressure exerted on the watchdog’s staff, the former CFTC lawyer said, ultimately contributed to the regulator’s staff unionizing.\n\n“He’s an aggressive regulator—and people have to work,” the ex-CFTC lawyer said. “But in this current environment—when the lateral market for attorneys is so buoyant—I could see why folks would want to leave.”\n\nIt is no surprise that Gensler’s SEC would be more focused on enforcement than Trump-era Clayton, lawyers familiar with the inner workings of the SEC across multiple commissioners and administrations say. A Democratic administration’s model for enforcement often places more emphasis on more cases and more individuals; the so-called “broken windows” philosophy of policing the markets was a distinct characteristic of Obama-appointed Chairwoman Mary Jo White’s tenure at the SEC from 2013 to 2017.\n\nGensler recently told investment lawyers and bankers that his agency would pursue aggressively bad financial actors “playing with working families’ savings.” The chairman is also taking a key interest in the reporting of environmental, social and governance (ESG) information by listed companies, according to reports, and this focus will likely expand the responsibility of the enforcement division.\n\nGensler is potentially counting on adding more staff that will get behind his vision of a watchdog with sharper teeth. In his FY 2022 budget request, Gensler asked for nine additional positions in the enforcement division and in total wants to raise staff from its current 1,316 to 1,330.\n\nAdam Oliver, co-founder of Firm Prospects, said he expects to see some additional hiring by the SEC this fall. “Hiring by the agency tends to track upwards after the summer months, with 2017 being the one exception in recent years,” he said.\n\nIn testimony in front of a House appropriations subcommittee on May 26, Gensler said enforcement in 2020 had 6% fewer staff on board than it did in 2016.\n\n“Other divisions are similarly stretched thin,” he told lawmakers. “As more Americans are accessing the capital markets, we need to be sure that the commission has the resources to protect them.”\n\nIn May, he appointed seven-year SEC enforcement veteran Tejal Shah to be his enforcement counsel. Shah has deep experience investigating and litigating the range of cases the SEC brings, including broker-dealer accounting fraud and compliance failures, insider trading and market manipulation.\n\nThe SEC saw turnover in the top slot in enforcement this year, when former Paul, Weiss, Rifkind, Wharton & Garrison partner Alex Oh resigned from the director’s position just a few days after taking the job. A couple of months later, the SEC announced the appointment of New Jersey Attorney General Gurbir Grewal as the new enforcement boss.",
    "title": "As SEC Chairman Pushes His Attorneys, Some Are Choosing the Door | Law.com",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/osm965/as_sec_chairman_pushes_his_attorneys_some_are/"
}