{
    "author": "ThatGuySizemore",
    "created_utc": 1619620813.0,
    "distinguished": null,
    "edited": 1619620897.0,
    "id": "n0gai4",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_n0gai4",
    "num_comments": 358,
    "permalink": "/r/Superstonk/comments/n0gai4/inflation_is_ramping_up_fast_external_supporting/",
    "score": 2525,
    "selftext": "I work for a medium-sized Software Company as a manager in the Technical Support department. I specifically work with software in the distribution unit. Today, we had our monthly division update meeting, which is usually just information on financials, stats, and some industry trends. Casually, they slipped in some information on a huge trend:\n\n[Removed information that was confidential and irrelevant](https://preview.redd.it/lnhnuv3xdxv61.jpg?width=2180&format=pjpg&auto=webp&s=8c11ce948feda9c230bf2bbb2b700632eee95e4c)\n\nOur customers in this division are typically wholesale or office supply sales. As of this past quarter, they are experiencing MASSIVE inflation on their commodities they sell.\n\nI am not here to go over the DDs that u/Atobitt wrote. If you haven’t read them yet, go read them. They are pinned on his profile.\n\nI can hear you asking: what does this have to do with GME? GME has a massive negative beta. That negative beta on GME means one thing: as the market declines, GME goes up. There’s already a lot of good DD on this already, so I won’t go into it either. The bottom line is this - GME is the BEST investment to hedge against a market decline. GME WILL moon, the market will decline, and it will be TREMENDOUS when it does. 🚀🚀🚀🚀\n\nTLDR; The US economy is experiencing the largest amount of inflation we have ever seen. A market correction is imminent. GME is the single best way to hedge against a market decline. BUY and HODL 💎🙌🏼\n\n*Edit: This is not financial advice. I melt down crayons into a soup, throw in alphabet noodles, and that's how I decide where to invest my money.*",
    "title": "Inflation is ramping up FAST - External Supporting Evidence of u/Atobitt’s DDs",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n0gai4/inflation_is_ramping_up_fast_external_supporting/"
}