{
    "author": "myFIREjourney",
    "created_utc": 1619625825.0,
    "distinguished": null,
    "edited": 1619629362.0,
    "id": "n0i5et",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_n0i5et",
    "num_comments": 238,
    "permalink": "/r/Superstonk/comments/n0i5et/notice_of_liquidation_ie_morgan_stanley_and/",
    "score": 3404,
    "selftext": "**Edit:** Marked as Discussion for now. Let me know if flair needs to be updated. Also will try to update with more info on the filings including CIK details so everyone can find the filings. Added images in the body of the post in case you guys couldn't see the various examples from the Imgur link.\n\nI came across the following on the sec.gov site and would appreciate any insight, education or ELI5 explanations so we can all learn together. I think I’m best at research or finding things. I’m learning so I have lots of questions and I’m not always sure how relevant information may be. **Please note: I am not a financial advisor. This is not financial advise.**\n\nHow can you tell a company is being liquidated for a margin call vs. for another reason? See photos for reference of upcoming liquidations (includes Morgan Stanley and JPMorgan funds).\n\nHow important is a company “restructuring” or “reorganization”? Can someone help explain this (especially in relation to companies we know have Shorted GME)? I’ve come across some filings along these lines. Investopedia says: “There are numerous reasons why companies might restructure, including deteriorating financial fundamentals, poor earnings performance, lackluster revenue from sales, excessive debt, and the company is no longer competitive, or too much competition exists in the industry.” Would it be helpful to share this info?\n\nAny tips of other things to look for to try to spot a company under financial “duress”?\n\n&#x200B;\n\nImage Source: [https://imgur.com/gallery/jOMYThR](https://imgur.com/gallery/jOMYThR)\n\n&#x200B;\n\n[2. JPMorgan International Advantage Fund](https://preview.redd.it/bsf2hajw2yv61.png?width=828&format=png&auto=webp&s=c090a642df938a455bd8e603d1e6cc70cd7f9cfe)\n\n&#x200B;\n\n&#x200B;\n\n[3. Absolut Shares Trust](https://preview.redd.it/it3tksk13yv61.png?width=828&format=png&auto=webp&s=39192ca3cee7cfbc91510248057d67e82889108d)\n\n&#x200B;\n\n&#x200B;\n\n[4. Russell Investment Company](https://preview.redd.it/blzrd7w63yv61.png?width=828&format=png&auto=webp&s=e75f814d645d37d0209a4851ba07de65d534fbb6)",
    "title": "NOTICE OF LIQUIDATION (i.e. Morgan Stanley and JPMorgan) - How do you best tell a fund or company is going to be liquidated?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n0i5et/notice_of_liquidation_ie_morgan_stanley_and/"
}