{
    "author": "lucas_kardo",
    "created_utc": 1619625078.0,
    "distinguished": null,
    "edited": 1619708073.0,
    "id": "n0hv1o",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n0hv1o",
    "num_comments": 557,
    "permalink": "/r/Superstonk/comments/n0hv1o/the_latino_ape_gang_checking_in_proud_gme_holder/",
    "score": 6544,
    "selftext": "Hey beautiful apes,  this is just starting here!   We are a bunch of countries and millions and millions and millions of possible apes in the making. \n\nTrends here are powerful as shit.   Just look at what one new reggaeton song does.  You get all the busty latinas dancing like it’s an ape mating ritual.  \n\nGME is more than a trend.  It’s a well documented, DD intensive, mathematical movement!   \n\nIf GME doesn’t give you a hard on like watching a Latina doing “perreo” to a Bad Bunny song, i don’t know what else will. \n\nWhen we moon 🚀🚀🚀🌑🌑 (very soon) I will throw a dancehall perreo party and stream all the sexy latinas dancing to the beat of GME.   \n\nThe second party I will invite all the APEs to a private Island in Panama’s Pearl Islands Archipelagos in the pacific coast and go crazy!!   (Im well known for throwing sick parties with the hotests girlss around!!). \n\nRemember, HOLD and VOTE!   The floor ir $10milliom!!  GME to the moon!! 🚀🚀🚀🚀🚀🚀🚀\n\n\n\nEdit 1:  missed my mexican friends 🇲🇽🇲🇽\nEdit 2:  of course how am i gonna miss all my papis. 🇵🇷🇵🇷🇵🇷🇵🇷.\nEdit 3: 🇩🇴🇩🇴 representing also!\nEdit 4: 🇨🇺🇪🇨🇺🇾🇵🇾🇬🇹🇳🇮🇭🇳🇧🇴\n\nIncreidable to see apes in every country of Latin America and beyond!   We strong and growing!!  🦍🦍",
    "title": "The latino ape gang checking in!! Proud GME holder since $40. Im from 🇵🇦 and have friends from 🇨🇴🇻🇪🇵🇪🇨🇱🇦🇷🇧🇷🇸🇻🇬🇹🇨🇷 HODLING GME shares. The movement is just picking up in this part of the world. 🤲💎🦍🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🌑",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/n0hv1o/the_latino_ape_gang_checking_in_proud_gme_holder/"
}