{
    "author": "bosshax",
    "created_utc": 1621606226.0,
    "distinguished": null,
    "edited": 1621614971.0,
    "id": "nhtg1p",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nhtg1p",
    "num_comments": 118,
    "permalink": "/r/Superstonk/comments/nhtg1p/the_nbbo_best_price_is_only_determined_by_round/",
    "score": 1321,
    "selftext": "**Many retail investors assume that if there is ONE SHARE exchanged at $10,000,000 then that price will be set as the Market Price. THIS IS WRONG!**\n\nThe current market rules for setting the NBBO require that trades be in ROUND LOTS.\n\nhttps://preview.redd.it/uiryz9j6ch071.png?width=437&format=png&auto=webp&s=bd7a63c61ae57dd13c7c1023cc23b8b8e7415c03\n\nThis means if there is not a trade executed at 100 x GME then that is not setting a new price! Similarly if you want to drop the price you trade in a bunch of 100 blocks.\n\nYour single trades, unless aggregated by a broker or market maker, will NOT move the needle unless many other people are buying at the same price at the same time.\n\nI stumbled on this after seeing this post by u\\\\Xandrul01 about limit orders:\n\n&#x200B;\n\nhttps://preview.redd.it/oxjki8bx7h071.png?width=624&format=png&auto=webp&s=7482cd3d3686cd0b1b4e84867306b3006e59f152\n\n\"Small orders can possibly not trade on limits the market just touches the price because **odd lots ( less than 100 shares ) are not protected under rule NMS.\"**\n\nWhat is rule NMS:\n\n\" **Reg NMS is a set of rules that defines how trading works in the U.S. for all listed stocks**.\n\nAs automated trading increased, NMS ushered in a new era of competition in trading and introduced a   number of important **protections for investors.**\n\nIn 1994, following the introduction of the Unlisted Trading Privileges Act, or [UTP](https://www.congress.gov/bill/103rd-congress/house-bill/4535/text), stocks were allowed to trade on any venue. That meant the primary listing exchange was no longer the only exchange on which a ticker could trade.\n\nReg NMS also mandated market-wide cross-connectivity, allowing for a competitive and distributed market. Then the centrality of the SIP ensured that all participants **knew where and what price** the **best bid and offer** for each stock was at all times.\n\nNMS also prohibited trade-throughs and crossed markets, ensuring that customer orders were **filled at the best prices available**, regardless of what exchange each stock is trading on.\"\n\nSource: [https://www.nasdaq.com/articles/reg-nms-dummies-2019-05-09](https://www.nasdaq.com/articles/reg-nms-dummies-2019-05-09)\n\n**TLDR: The NMS rule is VERY IMPORTANT in ensuring that a trade is executed at the BEST PRICE. However if a trade is TOO SMALL (less than 100 shares) then these protections do NOT apply!**\n\n**SUSPICION**: Since retail buying, especially for GME, includes a lot of 1 share buys, it's entirely possible these orders are NOT being filled at best execution. Market Makers and Brokers (like Robinhood) could theoretically very carefully slowly feed SMALL LOT ORDERS in darkpools at the WORST PRICE.\n\nThis might explain how retail buying can be suppressed to NOT INFLUENCE the market price! It would take 100 share lots at a certain price to hit the ask to set a new NBBO (best market price).\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**AS a stock price rises the ODD LOT PROBLEM becomes really bad, for example AMAZON, because their share price is so high that there are less and less 100 block orders.**\n\nsource: [https://www.nasdaq.com/articles/nms-ii%3A-an-odd-solution-for-the-odd-lot-problem-2020-05-07](https://www.nasdaq.com/articles/nms-ii%3A-an-odd-solution-for-the-odd-lot-problem-2020-05-07)\n\n**\"**[**Currently**](https://www.nasdaq.com/articles/reg-nms-dummies-2019-05-09)**, when you are trading, the SIP shows you an NBBO. That’s the best of the best buyer and seller regardless of which exchange they’re waiting in, although it needs to be for at least a “round lot” (usually 100 shares).** If you’re trying to capture spread, that round lot also ensures you have a “protected” quote, meaning you won’t miss fills if a large trade causes worse prices to trade at other venues (be “traded through”). It’s also the same prices that Rule 605 uses to monitor investors’ execution quality and protect them from bad fills.\n\n**However, the U.S. market has an “**[**odd lot problem**](https://www.nasdaq.com/articles/what-happens-in-an-odd-lot-world-2019-06-20)**.” That’s because 100 shares of AMZN (for example), at over $200,000 not only qualifies for block size but is multiples larger than the average trade or best bid value. So what tends to happen is that algos and individual investors bid for smaller values of AMZN, creating an \"insiders\" market at better prices than the NBBO shows.**\n\nOne problem with this is that investors and brokers using the SIP won’t know that there are small buyers and sellers at slightly better prices in the market.\n\nBut there is a good reason to have round lots in a stock like GE, where 100 shares represents around $700. Considering the average trade is around $7,000, the public, protected best-ex quote should represent enough shares to fill the average trade.\"\n\n**In short AS the stock price rises there are naturally MORE and MORE ODD LOT PROBLEMS:**\n\n&#x200B;\n\n[In short AS the stock price rises there are naturally MORE and MORE ODD LOT PROBLEMS. In GME this is compounded because you have retail that typically buy in small lots anyway and then you have the potential for GME shares to go to $10,000+. ](https://preview.redd.it/kdpqvsn4ah071.png?width=813&format=png&auto=webp&s=c825c26b8ebee18648b115ae02b35948b165dd14)\n\n&#x200B;\n\n&#x200B;\n\n[THE SEC realized this is not always an efficient solution for traders, so they proposed to change how Round Lots are determined and can set the NBBO](https://preview.redd.it/vkx82az9ah071.png?width=737&format=png&auto=webp&s=aa1b3311e458dadb716609d87acf61efd7044d3f)\n\nTLDR: SEC realized this is not efficient as there may be buyers who want to buy 10 shares of Amazon at $22,000 (current price $20,000) and since it is less than 100 round lots it would not set a new NBBO. This also works vice versa for a lower price.\n\n**NEW SEC PROPOSAL**\n\nThe proposal results in an NBBO that has a more consistent value (green line in Chart 2). [Our data](https://www.nasdaq.com/articles/why-intelligent-ticks-make-sense-2020-01-09) suggests this will also significantly tighten displayed quotes for higher-priced stocks. However, there are three consequences that traders might not like:\n\n1. With the size of a round lot between $1,000 and $5,000 (for almost all stocks), the official NBBO might represent a smaller quote than almost all spread-crossing trades that will be benchmarked against it.\n2. **It’s possible that a stock like AMZN could be BID and OFFERED for one share at a one-cent spread. That’s not the kind of size or spread capture that many think is good for liquidity and price discovery.**\n3. There are still odd lots.\n\n**HOW OTHER MARKETS SOLVE THE PROBLEM:**\n\n**\"In other developed markets, the solution to the odd lot problem has been to eliminate the distinction between round lots and odd lots.**\n\n**Allowing trades in any whole number of shares in turn makes all quotes equal. It also ensures that the true best bid and offer is displayed for all to see.**\n\nThe downside, as [we’ve noted before](https://www.nasdaq.com/articles/a-data-driven-intelligent-ticks-proposal-2020-01-23), is that nobody wants to be benchmarked against one-share quotes.\"\n\n**TLDR:** Other markets allow price discovery to just function like supply and demand. If there is a single trader willing to sell at $1,000 and a single trader willing to buy at $1,000 then that can be the latest Market Price! If other traders feel that is over or undervalued they will quickly submit their bids and the market will naturally find the best price.\n\n**The current system means that whomever can trade in 100 share blocks can influence the price significantly! Your one share lots TOTALLY DON'T MATTER unless a broker or market maker decided to group them together, but they can abuse when and when they may not want to group!**\n\nThe SEC rule that created this new NMS II proposal seems to be this one: [https://www.sec.gov/rules/proposed/2020/34-90019.pdf](https://www.sec.gov/rules/proposed/2020/34-90019.pdf)\n\nIt was proposed in September 2020 and it was never implemented (I could not find any confirmation it was ever executed, it seems to just have remained in comment phase forever).\n\n**TLDR:** Round Lots basically give more power to trades grouped in 100 share lots to set the price (up or down). A single trade for a single share will NOT do anything and NOT set the NBBO.\n\nLots less than 100 shares are called ODD lots. ODD lots are not protected by NSM rule which ensures they are executed at the best price. This might be an opportunity for brokers and market makers to execute retail orders slowly in odd lots and give a worse execution and or reduce the impact of retail orders on price!\n\nODD lots are a big problem, for example in AMAZON where the share price is $20,000. You would have to have a trade $20,000 \\* 100 in order to move the new price, which means there are a lot of individual trades that could improve the price discovery but they don't.\n\nThe SEC proposed a change called NSM II in September 2020 which would give more power to smaller lot orders to influence price, but it was never implemented.\n\nOther market economies do away with lots entirely- allowing a single share at any price to determine the best market price. Where there is a buyer and a seller= market price. Makes sense to me!\n\n&#x200B;\n\n**IMPLICATIONS:**\n\nI suspect that small order lots could be used to manipulate the price. By simply executing retail orders slowly in small odd lots these orders are NOT protected by the NSM rule and it could mean that a market maker could skim the difference.\n\nMore importantly this does mean that retail orders, which are naturally for fewer shares, do not impact the price as they should.\n\nThis also means that in the event of the GME price surging to incredible levels it will take 100 order lots at the same price in order to move the price up.\n\nThis whole idea is VERY complex and I am not a financial expert. It's entirely possible I'm simplifying this too much or not fully understanding how individual trades could still be grouped or executed. Still the fact that the SEC sees this as a price discovery problem that needs fixing and the fact they're taking to long likely means it's very complex and the establishment probably does not want to change this. I think this is worth researching and would love for more apes to join the quest of how truly price is determined and how price can be manipulated through these different mechanisms!\n\n&#x200B;\n\n>**\" A better solution involves a market where all orders count equally, and the lit quote is as competitive and inclusive as possible, while also ensuring spreads are deep enough to fill most orders. \"**\\-Source: [https://www.tradersmagazine.com/am/nms-ii-doesnt-fix-the-odd-lot-problem/](https://www.tradersmagazine.com/am/nms-ii-doesnt-fix-the-odd-lot-problem/)\n\nEDIT 1: We are SO LUCKY to have amazing Honorable Gentlemen like u/dlauer in this community.   \n\n\nAs per his comment:  \"So this is all accurate, with a caveat. It doesn't mean that an odd lot order can be executed outside of the NBBO. It means that an odd lot cannot help to **set** the NBBO. \"\n\n**SPECULATION:** Does this mean that AFTER the PEAK of MOASS... If APES sold VERY MINIMAL QUANTITIES in ODD LOTS then these sells would NOT affect/set/lower the NBBO? This disadvantage for odd lots not setting a price HIGHER could prove to be an advantage for not setting it LOWER... \n\n&#x200B;",
    "title": "The NBBO (best price) is only determined by round lots (100 shares and more). This means single share buys do squat all in setting market price. This means retail traders trading a lower volume don't impact the price as they should and high price stocks (AMZN) require a lot of volume to move price",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhtg1p/the_nbbo_best_price_is_only_determined_by_round/"
}