{
    "author": "SuperstonkBot",
    "created_utc": 1624717937.0,
    "distinguished": null,
    "edited": false,
    "id": "o8bwht",
    "text_only": true,
    "flair_text": "🤖 SuperstonkBot",
    "name": "t3_o8bwht",
    "num_comments": 113,
    "permalink": "/r/Superstonk/comments/o8bwht/srdtc2021011_and_nscc2021007_ficc2021004/",
    "score": 666,
    "selftext": "[https://imgur.com/a/zgk7AKP](https://imgur.com/a/zgk7AKP)\n\nHere is a link to just the summary page for SR-DTC-2021-011.  The same applies to NSCC-2021-007 and FICC-2021-004.\n\nI highlighted portions of interest with some explanations for why I believe this legislation should not be enacted because it lets the DTCC completely off the hook, scott-free.  If they are the \"insurance\" for their Participants then they should not be allowed to change the rules at this stage of the game when it is becoming very clear that the Participants are going to default and the DTCC will be on the hook to cover the remaining portion of their short positions.\n\nIf the DTCC can simply create legislation that lets them off the hook then who is responsible for covering the shorts if companies like Citadel go bankrupt?  The Fed is not going to let it happen any more than the DTCC is.  Therefore, WHO is going to cover the shorts if they get margin called?  Will, they NOT ever get margin called if the regulatory agencies simply overlook the \"cooked books\" forever?  We cannot let these latest DTCC filings go through without challenging the language.  Comments are open for 45 days and we should use every bit of that to ask for clarification and ensure that they are not off the hook for covering their participants' short positions if the participants become completely liquidated and/or go bankrupt.\n\n---\n\n***This is not financial advice!***  \n*This post was **anonymously** submitted via **[www.superstonk.net](https://www.superstonk.net/)** and reviewed by our team.\nSubmitted posts are unedited and published as long as they follow r/Superstonk rules.*",
    "title": "SR-DTC-2021-011 (and NSCC-2021-007 & FICC-2021-004)",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/Superstonk/comments/o8bwht/srdtc2021011_and_nscc2021007_ficc2021004/"
}