{
    "author": "AllenPrescott",
    "created_utc": 1620153020.0,
    "distinguished": null,
    "edited": 1621447008.0,
    "id": "n4upgx",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_n4upgx",
    "num_comments": 190,
    "permalink": "/r/Superstonk/comments/n4upgx/dtcc_rule_nscc2021801/",
    "score": 3313,
    "selftext": "I believe the 60 day comment window ends this week. Up to 10 days to implement after that. So much has been written about this already that I don't want to reinvent the wheel posting it all here again, but the quick summary as I understand it is entities need to cough up capital daily to cover high risk positions after this goes into effect or they can get margin called quickly. Like same day quickly... Coincidentally, nearly everything is red today. Possible said entities are scrambling for Capital to avoid 801 margin calls over the next few weeks? If the situation was dire enough, I could even see them selling off long shares they held for hedging shorts just to stay in the game (thus putting them at infinite risk if the stock goes up.)\n\nDisclaimer: Not financial advice. I am just imagining possible scenarios that may fit current events. Under no circumstance should anyone listen to anything I say. Ever... My posts contain information that may cause cancer in the state of California.\n\n\n***Update 5/4 2100EST(ish)***\n\nGreat news! First hurdle completed - No objections to 801!\n\n[https://www.sec.gov/rules/sro/nscc-an.htm#SR-NSCC-2021-801](https://www.sec.gov/rules/sro/nscc-an.htm#SR-NSCC-2021-801)\n\nSecond hurdle, 002, is due this week. I found someone basically posting the same information as me, and I hate 100 posts all saying the same thing so I'm stopping updates and dropping a link to his posts:\n\n[https://www.reddit.com/r/Superstonk/comments/n51u5d/sec_has_no_objections_to_nscc801/?utm_medium=android_app&utm_source=share](https://www.reddit.com/r/Superstonk/comments/n51u5d/sec_has_no_objections_to_nscc801/?utm_medium=android_app&utm_source=share)\n\n***Update 5/19***\n\nSR-NSCC-2021-002 comments due 6/2\n\nSource: https://www.sec.gov/rules/sro/nscc.htm#SR-NSCC-2021-002",
    "title": "DTCC rule NSCC-2021-801",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n4upgx/dtcc_rule_nscc2021801/"
}