{
    "author": "Dan_Bren",
    "created_utc": 1618371992.0,
    "distinguished": null,
    "edited": 1618377274.0,
    "id": "mqikg9",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_mqikg9",
    "num_comments": 49,
    "permalink": "/r/GME/comments/mqikg9/another_day_without_large_block_purchases_of_deep/",
    "score": 1262,
    "selftext": "Good evening everyone,\n\n[u/Dan\\_Bren](https://www.reddit.com/u/Dab_Bren/) here Just wanted to provide you all with the daily update regarding the block trades of DEEP ITM calls that were previously happening.\n\nAs can be seen below there were no large block trades of DEEP ITM calls bring the total to 6 out of the last 7 days without any large block purchases.\n\n[GME Biggest Trades 4-13-2021](https://preview.redd.it/2dubkmx692t61.png?width=1227&format=png&auto=webp&s=7bdf19fe0fcb2da8478b12cfbdd72d75d7cb7409)\n\nI just want to be clear that I'm not here to speculate on what I don't know. I just take the dataset I am presented daily and provide my best inferences to the good people of this sub. Nothing here should be taken as fact it is purely my opinion and mine alone. With that being said I think the lack of large block trades of DEEP ITM calls is very telling.\n\nMany have been quick to point out that this doesn't mean there are no DEEP ITM calls being purchased. This is of course true as the \"Big Trade Detector\" doesn't catch any trades smaller than 100-200 contracts. But let's delve into this more. If they could be making these trades in smaller chunks \"off the radar\" of things like this Biggest Options trades list from Fidelity why aren't they?\n\nFor starters lets talk about risk. These large block trades of DEEP ITM calls were almost always traded in pairs. It has been surmised from some other DD posts that it is very likely that this the whoever buying and then shortly after reselling. Let's take a look at the time period over which these trades took place.\n\n[GME Biggest Options Trades 4-4-2021](https://preview.redd.it/o38e54y492t61.jpg?width=1222&format=pjpg&auto=webp&s=b6eec43fc6e7a776ef2c67aab338c6393cf81c41)\n\nAs we can see the $20 and $12 calls were very likely purchased 13:22:50 and likely sold at 13:22:52 (aka 2 seconds later). Personally I have no idea of the intricacies of how these are used to reset FTD's and I'm not going to sit here and pretend to understand. What I do know is that if I was buying and reselling 100's of millions of dollars of call options on a very volatile stock I would be trying to unload these positions are quickly as possible to minimize my risk exposure. The most efficient way to do this of course is buying and selling these quickly in one large chunk and ended up on our favorite daily chart pictured above. Now you may notice that on the other set of $12 and $15 calls (probably) purchased at 13:58:05 but (likely) sold at 15:29:24. The reason for why they held them this long you may ask; I don't have a goddamn clue. I don't know if this had to do with the reset process, if they used it to further manipulate the stock, or if they just decided to be gamblers for an hour and a half. What I do know is they would've hidden these from us the whole time if they had the ability to. The disappearance of these large block trades is significant and if they are to proceed without them, this will negatively impact them in some way.\n\n[u/Dan\\_Bren](https://www.reddit.com/u/Dan_Bren/) out.",
    "title": "ANOTHER DAY WITHOUT LARGE BLOCK PURCHASES OF DEEP ITM CALLS (4/13)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mqikg9/another_day_without_large_block_purchases_of_deep/"
}