{
    "author": "npham54",
    "created_utc": 1628296870.0,
    "distinguished": null,
    "edited": 1628361000.0,
    "id": "ozjar8",
    "text_only": true,
    "flair_text": "🚨 Debunked 🚨",
    "name": "t3_ozjar8",
    "num_comments": 212,
    "permalink": "/r/Superstonk/comments/ozjar8/proof_that_at_least_15_billion_of_gme_shares_were/",
    "score": 1602,
    "selftext": "**\\*\\*\\*\\*\\* I am NOT a financial advisor & this is NOT financial advice.  Take everything you read, see, or hear with a grain of salt.  Verify it ALL with your own DD & come up with your own conclusions! \\*\\*\\*\\*\\***\n\n&#x200B;\n\nhttps://preview.redd.it/fs3vwgvqbzf71.png?width=158&format=png&auto=webp&s=eaba72048a1d7bb18d22652307a74163c5921a3d\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*EDIT\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nMy sincerest apologies to everyone.  I made a mistake on rushing this out too fast without confirming the fact that one of our members shared with me.\n\nThanks to u/C3ll3 for correcting me on the numbers shown are indeed the actual share numbers already and NOT the actual number of contracts which would have a multiple factor of 100x per contract.\n\nI will fix this post and strike thru all the incorrect parts.\n\nThe number after correction comes out to 39,903,283 shares when calculated the correct way.  Albeit it nowhere near the original calculated amount, it's still a pretty significant number considering that leaves only about 30 million left over shares if we are to subtract the 39.9 million.\n\nOnce again, I truly apologize for rushing this out without confirming it first with someone who understands this better than me.  I have learned from this and I won't make this same mistake again.\n\nIf the Mods feel like this post should be deleted in the best interest of the community, then I am in full support of it.\n\nSince I have made a mistake on my own misunderstanding of the number I was looking at and have fixed this post to reflect that, this can be left, if desired of course by the Mods, as a learning lesson for those who may very well be on the same path as I was thru their own research.  Maybe if they see this and the corrections, they might not make the same mistakes as I did so to prevent any possible future misunderstandings.\n\nWell at least that makes sense to me.  You're not obligated to feel the same.  I'm not sure how to lock this thread as a member has suggested thru a reply here.  If a Mod could do that please?\n\nTruly appreciate everyone's understanding in advance and my sincerest apologies once again.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*EDIT\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n&#x200B;\n\n&#x200B;\n\n*~~TL;DR - I will not post one, this data is important and to understand it, you need to see everything in it's entirety.  I'm sorry if this is unacceptable to you and you are not obligated to continue reading.  I do appreciate you even stopping in to look and wish you nothing but the absolute best.~~*\n\n\\--------------------------------------------------------\n\nPlease let me start with this:\n\nIt's your right to perceive things how you want and I'm not here to convince you of anything.  I'm just here to share the truth.\n\nNothing in here is my own speculation.  It's 100% facts in which you can verify for yourself & come to your own conclusion.\n\nSo with that being said, let's continue on.\n\nI created a spreadsheet to show you some pretty insane information.\n\nThe data I used is pulled straight from a publicly accessible website called **Holdings Channel** and here's the link for our GME STONK:\n\n[https://www.holdingschannel.com/bystock/?symbol=Gme](https://www.holdingschannel.com/bystock/?symbol=Gme)\n\nThis is what you're going to see:\n\n&#x200B;\n\nhttps://preview.redd.it/wiwsyqvg4sf71.png?width=3849&format=png&auto=webp&s=66e358469662e7f95220ea73e1842edd09d39112\n\nAs you can see from the red highlighted section, this is the data that I selected from the top and all the way down to the absolute bottom of the page.\n\nI then proceeded to simply copy and paste all that copied data and pasted it into a new spreadsheet.\n\nThe next step was to reformat the data to look a lot more presentable and easier to read for all eyes.\n\nThe spreadsheet is available to download here so you can verify the formulas yourself that they are indeed correct or not:\n\n[https://docs.google.com/spreadsheets/d/1\\_j7ZoiQvcoiuC3j5oWYepMntuzuQLXoeQYQlx6QOPF0/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1_j7ZoiQvcoiuC3j5oWYepMntuzuQLXoeQYQlx6QOPF0/edit?usp=sharing)\n\n&#x200B;\n\nhttps://preview.redd.it/ttal0xuh5tf71.png?width=1924&format=png&auto=webp&s=232e7092d0d04849e53c88234fc35c45f44d9ac2\n\nYou can either download the spread sheet to follow along or just keep reading as I will reveal the total shocking numbers in just a moment.\n\nSince I'd rather not manually punch the numbers and add them one by one in a calculator app, and possibly hitting the wrong number or symbol by mistake and giving a totally wrong number, I'm going to use the apps in built calculator to guarantee that the numbers can't be wrong.\n\nThe data has been sorted to look more cohesive and easier to follow along with.\n\nI have highlighted some numbers which we'll revisit in just a moment.\n\nIf you download the sheet and you understand spreadsheet formulas for calculations, then please be my guest to verify that they are indeed correct to show the right numbers.\n\nLooks like there are 3 really important numbers out of all of this and also including the \"As Of\" dates.\n\nThose following numbers are the:\n\n1. Put Total\n2. Call Total\n3. Shares Total\n\n~~If you know how options work, then you understand a few basic things:~~\n\n1. ~~Each Call or Put option contract is equal to and has the rights to control 100 actual real shares~~\n2. ~~In order for a Call or Put contract to become LEGALLY VALID, the 100 shares PER CONTRACT are SUPPOSED to be located FIRST by the brokers even before the contract can be consummated.~~\n3. ~~If the shares are not found by the time the contract expires or when the opposite person decides to close out the contract early as long as it's profitable, then shares that were supposed to be \"found\" prior to the consummation of the contract, will become FTD's and the contract is then terminated and kept on record (supposedly).~~\n\n~~Given that basic information that you can easily verify anywhere and with anyone who understands the life cycle of a Call/Put Option contract, let's do some really easy basic calculations from what the spreadsheet spit out.~~\n\n~~The 3 numbers that we wanted to remember from above will come into play now.  According to the spreadsheet and the calculations it made we got the following numbers:~~\n\n1. ~~Put Total on 03/31/2021 = 24,220,402 Put Option Contracts~~\n2. ~~Call Total on 03/31/2021 = 9,150,644 Call Option Contracts~~\n3. ~~Shares Total held by all Institutions on 03/31/2021 = 24,833,525~~\n\nNow we do see that there are more recent numbers dated for the quarter ending 06/30/2021.  Unfortunately not all the data is in so we can't get a complete picture as of then.  The best at the moment we can get for today is the numbers on 03/31/2021 when all the institutions had to get their 13F reports in.\n\n~~You might be asking, why didn't I include the final number in the spread sheet to make it a littlie bit \"quicker\" to just see, but I didn't wanna ruin all the fun for you  😜~~\n\n~~To figure out how many options contracts are left over after taking one Put Contract & cancelling it out the opposite Calls Option Contract and leaving us with a number of contracts which doesn't have an opposite to be cancelled out so we must take that number into account to figure out how much shares it represents.~~\n\n~~Put Total - Call Total = Remaining Contracts~~\n\nLet's plug in the numbers and see what that comes out to:\n\n~~24,220,402 - 9,150,644 = 15,069,758 Put Options Contracts~~\n\n~~Now remember, 1 Options Contract = 100 of GME Shares~~\n\n~~15,069,758 PUT Options Contracts x 100 GME Shares = 1,506,975,800 GME SHARES~~\n\nDon't forget!  We still have to ADD the SHARES TOTAL to this number too!!!\n\n~~1,506,975,800 + 24,833,525 = 1,531,809,325 Shares that are HELD & SUPPOSED to exist in order for those PUT Options to EVEN EXIST!!!~~\n\n~~Let me repeat that:~~\n\n~~That is 1.53 BILLION SHARES!~~\n\n&#x200B;\n\nHow many GME Shares were outstanding on or around 03/31/2021?  This site here can tell us:\n\n[https://ycharts.com/companies/GME/shares\\_outstanding](https://ycharts.com/companies/GME/shares_outstanding)\n\n&#x200B;\n\nhttps://preview.redd.it/m5ko5spcwtf71.png?width=1928&format=png&auto=webp&s=ae034c4f8c0748e9216332d15ca65f248e7db1b3\n\nSo let's select March 17, 2021 since it's the closest date without passing the 13F filing date so we can get the most accurate number possible.  So YCharts shows 69.94 MILLION GME shares are outstanding on that day.\n\nLet's subtract the number of shares owned by the institutions since we've counted that number into the total above already.\n\n~~69,940,000 Outstanding GME Shares - 24,833,525 = 45,106,475 GME Shares Left Over for EVERYONE else.~~\n\nDon't forget, we still haven't even thought about the following 3 \"locations\" where GME stonks are being held.\n\n1. APES! Of course you're not included in that number yet!  Whomever owned GME Stonks on 03/31/2021 would count towards this number\n2. Insider share holders, yep, this doesn't even count even Ryan Cohen's own stash of GME STONK!\n3. Lastly, this doesn't even include the insane amount of GME STONKS that are supposed to be accounted for in any ETFs or any other \"vehicle\" in which they wanna shove GME STONKs in.\n\n~~I can only imagine what those 3 numbers are going to be total, but there's NO WAY in living hell that all 3 are going to split 45 million GME stonks!~~\n\nLike I previously mentioned, none of this is speculation.  This is all factual data you can choose to verify for yourself to come to whatever conclusion you want to with this information.\n\n&#x200B;\n\nhttps://i.redd.it/x91xez6q0uf71.gif",
    "title": "PROOF that at least 1.5 BILLION of GME Shares Were Reported on 03/31/2021 thru Options Alone!!! 🤯",
    "upvote_ratio": 0.7,
    "url": "https://www.reddit.com/r/Superstonk/comments/ozjar8/proof_that_at_least_15_billion_of_gme_shares_were/"
}