{
    "author": "Mammoth-Priority-516",
    "created_utc": 1627429976.0,
    "distinguished": null,
    "edited": 1627471916.0,
    "id": "osyb3a",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_osyb3a",
    "num_comments": 108,
    "permalink": "/r/Superstonk/comments/osyb3a/the_next_big_index_squeeze_is_this_the_catalyst/",
    "score": 1489,
    "selftext": "First of all, My tits are jacked because this reminds me of the Tesla index squeeze back in late 2020!!! I am typing this on my phone and I will add more details when I get home!! I need everyone help to find the amount of indexes that follow the S&P 400 and how much money is tracking it. From there, we can guesstimate how much money will be spent buying our beloved GME! This post is just a background story on the Tesla squeeze and how it can happen to GME!!!!\n\nFirst off, Tesla stock been trading flat since like 2014 to late 2019 until they reported their first profitable quarter and the stock took off. Pre split price (5 for 1) was roughly 350 and it went to 700 before covid crash happened and it dropped with everyone else. Tesla was shorted about 20%, (reported) so when it started to push up with the rest of the market in April, shorts were forced to cover and it had a parabolic run through the summer and it started to drop after the stock split in August but it did over 10x from the 2019 fall lows (500 was the splited price and it dropped to 350 before the inclusion news came out). In late 2020 they announced they were joining the S&P 500 and when people heard the news, Tesla nearly doubled again in a month on the news from 350ish(splited) to 695!! The market cap was quite big too, so a lot of big money were front running it and retail were all over it too!! The idea was there was huge GUARANTEED buying pressure coming in and they will buy at any price on the day of the inclusion!! Most indexes must buy to properly track the index so you can sell it to them at any price so a lot of people made good money off the trade. (Buy my shares for 40 million each kenny) \n\nSo Tesla doubled on the news and in the last 15 mins of the day of inclusiog, a lot of funds either brought their shares through dark pools or used the golden cross method which is essentially a buying at specific price and all the index funds were doing it. I remember how crazy it was because I was front running it too and made some money off it. In the last hour, they tanked the price nearly 10% and suddenly there was a huge green dildo because of the golden cross and dark pool print hitting the tape all at the same time  and it got halted and the day ended at 695!! I think a lot of index funds did not buy in and they were hoping to get in cheaper and a lot of shorts did not cover. Then early 2021,Tesla did one last run from 700 to 900 and it was a series of gamma squeeze and shorts covering and some index funds buying! Tesla price action is iconic and will be studied in future books for sure but it all goes down to the supply and demand. Tesla ownership was quite insane because Elon Musk had 20% of the entire company. I was doing the math and the index fund literally had to buy roughly 20% of the company off retail and other people who brought the stock before the inclusion. People were worried that too many people got in and there was too much supply while others thought there was not enough shares to go around for the index funds! Sounds like GME!!! So Tesla was roughly 500 billion at the time and 20% was needed to be brought!!! 100 billion of money coming in but remember Tesla doubled before the actual thing so it was more like a 250 billion move on the inclusion. Tesla was hated cuz some many people got burned shorting it and they should of been added a while back but wall street kept pushing it off and Tesla was the biggest company to join the index of all time and they never added something as big as Tesla!! It was a total mess in hindsight. \n\nLets look at GME situation now!! Gme is at 12 billion market cap, I don't know how much buying pressure is gonna come in(qaunt apes please help) but this can be it. Even if we get like 500 million In money coming in, that would put us at 200 and the margin call range is not that far from here. Plus we might see a run up pre inclusion like Tesla! The situation is kinda similar because Tesla had huge retail interest and they both had small  squeezes!! So my point is this, the volume is all time low since 2017 and if the volume comes through, we may be up for a crazy gamma squeeze and a short squeeze!!! Imagine if 10 million shares is needed!!! I don't even think there is enough shares for a 5 million buy in pressure!! With the current volume, 10 million can move GME 50 bucks minimum!! Plus gamma squeeze!! Tesla only had a 20% short interest, GME has like infinite short interest!!! This can be the catalyst we been waiting for. Once I get the numbers, I will update it the post so we have a better idea of how much buying pressure is coming in. Remember, the supply is low asf as we have no volume now and this can be the spark of MOASS!! \n\nI rushed this post and there could be gamma errors but I will edit it later as I want this to be out for everyone to read!!! Please help me get the actually numbers  \nQuant apes! 💎✋🚀🚀🚀🚀🚀🚀🚀\n\nTdlr: not very long but the main point is the supply is low and the index can create buying pressure and it can push us above the margin call prices and we can MOASS! \n\nEdit one: I cleaned up some errors and I am getting down voted like crazy😆 wut doing Kenny?\n\nEdit two: I forgot to point out how big gme is in the overall S&P 400 index because Tesla was about 2% of the entire S&P 500 but again, GME has a less supply of shares available so it will be interesting to what will happen. Tits jacked!!\n\nEdit three: so the index of s&p 400 is about two trillion, (Dec 2020 figures) and I am trying to find how many etf tracks it and how much they are worth. BTW S&P 400 is four times bigger than R1000 so there should be a net positive buy in for sure!",
    "title": "The next big index squeeze????? Is this the catalyst for Moass???? Let's talk about Tesla s&p 500 index squeeze and the correlation with GameStop!!",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/osyb3a/the_next_big_index_squeeze_is_this_the_catalyst/"
}