{
    "author": "Icbra",
    "created_utc": 1627385999.0,
    "distinguished": null,
    "edited": 1627421302.0,
    "id": "osl63n",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_osl63n",
    "num_comments": 1020,
    "permalink": "/r/Superstonk/comments/osl63n/the_stock_is_becoming_illiquid_and_today_at_730/",
    "score": 9617,
    "selftext": "I am calling it right now today we will se no more than 700-800k volume eod, and they stock will trade in a slow upwards trend.  \nToday might likely be the last day we will see volume this low.   \nThe only other thought i have is that something big will happen today, cause reddit has been fuckin around alot lately and this post was almost impossible to make.  \n\n\n700-800k eod volume and 1 trillion RRP are my thoughts for the day.\n\nEdit: Since I'm being heavily ridiculed and getting slot of hate for my post i want to clarify what i meant about something big. \nWhat i meant is that based on the volume and my OWN calculations that might be faulty 700-800k eod volume is my personal low point prediction for today, and that i don't think we will pass 1 million. \n\nI meant that if something big will happen it may interfer with my prediction.\nFor example if a shf really starts to close their positions or if we experience more fuckery in the form of another huge sell off by shorters like the one in March..\n\nI haven't tried to promise anyone something big will happen i simply said. \n\nAnd btw if my prediction is right something big has indeed happened today 700-1 mil eod volume today would be huge. \n\nSince it's further proof of our thesis...\n\nPREDICTION will post down here if i got anything right.\n\nSomething big: Chinese exchange *\n\nVolume:\n\nRRP: 927 billion.\n\nEdit 2: i have never gotten this amount of hate and condescending comments ever in my life about a post i made just for fun and to try and guess some things based on my own calculations and trends I've been noticing. \n\nI did flair it as opinion cause i didn't want anyone to think this was DD or some kind of absolute truth. \nFor the same reason i didn't post or talk about the calculations i have made myself so this could be mistaken as DD. \n\nBy something big i never stated that it would show om today's Price, however ppl are failing to realize cause of blind hate towards me and the OPINION i tried to share that today's movement on the Chinese exchange is something really big. \n\nThe RRP to 1 trillion was just my own personal fun xtra to go together with my volume prediction. \nI also thought it would move upwards today witch it clearly did but i shot trough the ceiling and i think thats ok, it didn't matter to me so much to be wrong or right about it.\n\nAs for volume i made this prediction 2 hours before market open based on previous volume in pre market and how it correlates to eod volume. My calculations got me to the number 745,xxx and i thought it was cool to share it. \n\nOf course i was early and i could have made a better prediction and i contemplated this with myself if i should wait with my prediction til i had more to go by. \n\nBut i figured that it would be cooler to make it early, not to take a swing in the dark but to get a more wholesome and fun response. \n\nThe truth is the longer you wait with calling something the later it just becomes the obvious and the prediction doesn't hold the same value anymore. \n\nHowever all the hate i am getting and people shit talking me really scares me, cause i have in no way tried to misslead anyone nor have i willingly tried to tell lies. \n\nYou must understand that a prediction is just a guess and my guess was wrong i can deal with it why can't you? \n\nThe slow upwards trend was a prediction based on most recent days and how my prediction on the new low volume would be shown in the price action. \n\nI was wrong here as well i am sorry if anyone is offended. \n\n\nHowever i want to state that alot of our situation is based on predictions and it's something we should be more welcoming towards since it's the most basic reason we are here. \n\nAnd i don't know if all this hate was actual apes or if it was some kind of shill.\nCause with the sheer amount of hate and trashy comments i have gotten today i kinda don't understand the reason for a distribution of wealth if people this shitty will become millionaires. \n\nAnyways take care! And have a nice weekend i will not be on reddit for a while now.. i want to reevaluate this sub and reddit as a whole has become.\n\nEdit 3. Pls do not send more concerned redditor suicide watch things about me, i do not want to harm myself and tbh i find it quite offensive since i know people who sadly have taken their own life. And there is nothing fun with it. \n\nIf this is real concerns you can stop with it. I am fine.",
    "title": "The stock is becoming illiquid, and today at 7.30 we have no more than 2.6k volume.",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/Superstonk/comments/osl63n/the_stock_is_becoming_illiquid_and_today_at_730/"
}