{
    "author": "Weegoh",
    "created_utc": 1626965972.0,
    "distinguished": null,
    "edited": 1626970541.0,
    "id": "opfiwu",
    "text_only": true,
    "flair_text": "🐍Debunked🐍",
    "name": "t3_opfiwu",
    "num_comments": 175,
    "permalink": "/r/GME/comments/opfiwu/charles_schwab_can_execute_9999_trades_because_im/",
    "score": 1069,
    "selftext": "-----\n*****Update***** Talked to the trading desk again to sort out whether we would need to call to place trades over $10,000. He said no, but if a stock price were to hit $100,000+, the app and website would not work because of \"the system,\" and the person placing the trade would need to call. \n\nI am calling Fidelity's instutional side now and will report back.\n\n-----\n*****Update 2*****\n\nJust talked to Fidelity's trade desk, service team, and trade services teams. The consensus was there should be no problems placing the trade, but they can't predict whether or not there will be systems issues if something like a huge squeeze were to happen.\n\nThe trade services desk's recommendation is to place a limit or stop order, good until canceled (GTC), and to place this limit/stop ahead of the squeeze. We all know there is a ceiling on limit orders based on current price, so this may not be the best option.\n\nMy thoughts here (which are going to be unpopular) are that we will have to wait and see. These trading platforms are based on outdated technology, and since there has never been a squeeze like what we're looking at, their systems have never been tested for an event like this. \n\n-----\n\nJanuary ape here, XXXX hodler, and I work in the financial industry (something I had hoped to not share). But, you know, duty calls, so here goes.\n\n\nI’m licensed as an Investment Advisor Representative (IAR) and have a Series 65, so although I am technically a financial advisor, I am neither providing advice here nor receiving any compensation for information I post here. I also eat crayons, but that has nothing to do with being a financial advisor.\n\n\nI am happy to provide proof (CRD number + other things) to mods, if they/you are interested.\n\n\n**TADR**: Schwab no stop trade, Schwab break share into smaller shares, trade smaller shares many times until equal to bigger share price. Schwab have no problem and Schwab can handle squeeze.\n\n\n**TLDR:** Because of an older system, Schwab can’t technically handle trades larger than $9,999. However, they have developed a workaround for this - they split the shares into “synthetic” smaller shares, which they then trade to reach the market price of the share. Both the trading desk and our Institutional Service Team confirmed if a certain stonk were to squeeze, they would have no problem trading it at any price.\n\n\n**Example:** They trade shares of BRK.A, currently at $400,000/share regularly and without problems.\n\n\nMy career has largely been at a large Registered Investment Advisory (RIA) firm. Because we’re an RIA, we have access to the institutional side of custodians (Schwab, TD, Fidelity, etc.), and because we’re large, we have access to the “elite” service teams, which we call when our clients (who are exclusively high-net-worth) need something done on their accounts.\n\n\nAfter seeing the Charles Schwab can’t sell more than $9,999 post yesterday, I decided to reach out after my entire butthole clenched. This morning, I called our Charles Schwab Service Team, who connected me to Schwab’s Institutional Trading Desk. Below is a summary of what their trader told me.\n\n\nTheir system is “old,” so they’re not able to place trades greater than $9,999. But since share prices have increased, they’ve developed a workaround.\n\n\nFor Berkshire Hathaway (currently at \\~$400,000), they split the stock into 100 smaller stocks, which they call “synthetic” stocks (different than the synthetic shares that Kenny and Stevey are using to fuck over the U.S.), then trade the 100 smaller stocks all at once so it appears as 100 transactions of a $4,000/share stock instead of a $400,000 one-share trade.\n\n\nHe also said in the case of a short squeeze for a certain stonk, they would have no problem handling trades for securities greater than $9,999.\n\n\nSo, with my butthole now unclenched, I thought it would be helpful to all my fellow Schwab apes (and any apes who are still in Robinhood - I know you’re still there) to dispel any notions they would not be able to sell a stock trading above $9,999. According to both Schwab’s elite service team and their institutional trading desk, you can and will be able to execute big fucking sells at Charles Schwab.\n\n\nBuy, HODL, get out of Robinhood, and I’ll see you all on the moon.",
    "title": "Charles Schwab can execute $9,999 trades. Because I'm a financial advisor at an RIA, I talked to both our Service Team and the Institutional Trading Desk, who explained the details.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/opfiwu/charles_schwab_can_execute_9999_trades_because_im/"
}