{
    "author": "Dan_Bren",
    "created_utc": 1619057291.0,
    "distinguished": null,
    "edited": false,
    "id": "mvv0t9",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mvv0t9",
    "num_comments": 25,
    "permalink": "/r/Superstonk/comments/mvv0t9/no_deep_itm_call_blocks_purchased_today_421/",
    "score": 507,
    "selftext": "What up Apes,\n\nu/Dan_Bren with a quick update on today's DEEP ITM calls.\n\n[GME Biggest Options Trades 4\\/21\\/2021](https://preview.redd.it/0rve0srysmu61.png?width=1226&format=png&auto=webp&s=e12f5155f7ecc8bc1d7e2963ba12eef3863c2e63)\n\nThere weren't any. (Large purchases)\n\nNothing really new on this front so I wanted to take this time explain a bit more into how these DEEP ITM calls were being used to \"hide\" FTD's(Failed-to deliver).\n\nI personally was not the best when it came to explaining this but an ape with more wrinkles than I summed it up beautifully. BIG shoutout u/ujar89 for this one:\n\nHere is the process they use to reset/hide FTDs. Please keep in mind Citadel is also a market maker. (Yes I know, conflict of interest). 'A' can be Citadel and 'B' can be Melvin in this example.\n\n1. A (the market maker) gives B X amount of synthetic shares (remember only market makers have this power). B gives A collateral so A doesn't get screwed (the collateral is basically the premium A pays to purchase the contracts from B).\n2. B uses those synthetic shares to close out existing FTD positions.\n3. B writes deep ITM calls (so A knows it's B).\n4. A buys the calls and exercises them receiving X shares back as IOUs.\n5. Now B has effectively closed out old FTDs while creating fresh new IOUs that will become FTDs in due time.\n6. Repeat as needed to avoid reporting FTDs and pretend like you covered.\n\nI hope this helped cleared up the inner workings of the process for some of you.\n\nSee you all tomorrow",
    "title": "NO DEEP ITM CALL BLOCKS PURCHASED TODAY (4/21)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mvv0t9/no_deep_itm_call_blocks_purchased_today_421/"
}