{
    "author": "PeopleCalledRomanes",
    "created_utc": 1623860735.0,
    "distinguished": null,
    "edited": 1623861744.0,
    "id": "o18t8a",
    "text_only": true,
    "flair_text": "𝘜𝘯𝘷𝘦𝘳𝘪𝘧𝘪𝘦𝘥 𝘋𝘋",
    "name": "t3_o18t8a",
    "num_comments": 61,
    "permalink": "/r/DDintoGME/comments/o18t8a/bny_mellon_are_citadels_clearing_bank_for/",
    "score": 694,
    "selftext": "With the [new found document](https://www.reddit.com/r/Superstonk/comments/o13686/am_i_reading_this_correctly_from_041321_citadel/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf) outlining Citadel’s agreement for a line of credit with BNY Mellon, I wanted to point out that BNY Mellon are one of two clearing banks. The other is JP Morgan (who last I knew severely limited operations). In the triparty repo market, their role is to settle the transaction of various securities, and particularly government securities (Treasury securities, agency MBS). \n\nPreviously I have written about Citadel’s role in the repo market ([found here](https://www.reddit.com/r/DDintoGME/comments/nypf3d/citadel_and_the_7_citadels/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf)). Effectively, they are able to act as secondary market makers for government bonds (with a role nobody else has). This puts them in a similar situation with Treasury securities as with GME. I know you’re thinking it, and yes, this is exactly the collateral used in Overnight Reverse Repos. Though Citadel are not Fed ON RRP counterparties, BNY Mellon are.\n\nIn order to act in this capacity, Citadel must have an account set up with a clearing bank to settle trades with institutional counterparties through their clearing bank (BNY Mellon).\n\nAlso, final note, Pershing = BNY Mellon, if you see that anywhere.\n\ntl;dr: Citadel are using every play in their book, no holds barred. This line of credit isn’t with just any old bank, it’s with a bank that lets them be a market maker for government bonds.",
    "title": "BNY Mellon are Citadel’s Clearing Bank for Triparty Repos",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/o18t8a/bny_mellon_are_citadels_clearing_bank_for/"
}