{
    "author": "Civilian1984",
    "created_utc": 1621190367.0,
    "distinguished": null,
    "edited": false,
    "id": "ndurwf",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_ndurwf",
    "num_comments": 211,
    "permalink": "/r/GME/comments/ndurwf/what_they_sec_are_most_afraid_of/",
    "score": 1284,
    "selftext": "On 6/9 in Grapevine, TX during the 2021 GME shareholder's meeting, the results of the proxy vote will be revealed.  Many apes out there, including myself, expect the number of shares voted to far exceed the available float.  It is my belief that the SEC also knows this and is preparing for the reveal of the biggest financial fraud perpetrated against investors since Madoff himself.  \n\nWith recent F13 filings as of March 31, the total institutional ownership of GME is reported to at or above 100% of the available 69 million shares.  \n\n&#x200B;\n\n[See how they backed out 16.1&#37; of the calculated owership to make the pie equal 100&#37;..you can't make this stuff up.](https://preview.redd.it/sf28od8xxiz61.png?width=640&format=png&auto=webp&s=9382aefbb916d5cfb16ef54b408b754c301c842e)\n\nDid you apes catch that by the way, that GME added 3.5M shares to the float of 65.3M shares available to make a nice rounded up 69M shares..lol..RC killin me.  So on 6/9 they are gonna count 69M shares...or is that just the starting point?  \n\n&#x200B;\n\n[The GME float is now 69M shares after 3.5M shares were offered at the market offering completed on 4\\/26.](https://preview.redd.it/u7a7etjbyiz61.png?width=640&format=png&auto=webp&s=9c3d52feb63a2435c109c9cfbc72e458cd31cd2e)\n\nSo, back to the point, RC tweeted from Arlington, VA GameStop this week, just a stone throw's distance from our nations capital city. \n\n&#x200B;\n\n[RC in DC, maybe to see the SEC?](https://preview.redd.it/3xwcqio20jz61.png?width=744&format=png&auto=webp&s=de9a62c1c77b5bd93e5df24c8bf928a153d7f57e)\n\nCould it be, as some have speculated, that he wasn't just in town by chance, but that his presence was needed in DC to discuss the impending urgent situation that is likely to occur on 6/9 when the proxy vote count is revealed.  Is it reasonable to expect that we could see 169M shares voted, why that's only 10M apes with 10 shares each on top of insitutional ownership votes, how about 10M apes with 50 shares average or 100 shares?  And why wouldn't it be that large of a number, Burry and DFV figured out the shorts were in too deep 2 years ago..2 freakin years ago!   If this number is what I and many other apes implicitly know it will be, the SEC will be publicly revealed to be incompetent in letting this situation get to the level of the greatest financial scandal in history!  They will be forced to do something at that point.  We the Ameripoor and Europoor Apes, the Ants, and the rest of the world will be the one's screaming look, \"the emporor has no clothes\"!  At the risk of becoming a global laughing stock, they will have to do something and shorts will have to cover.  Hang on, rocket's fueling up for launch!\n\nTL/DR:  Buy, Hodl, & **VOTE!!**",
    "title": "What they (SEC) are most afraid of..",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/ndurwf/what_they_sec_are_most_afraid_of/"
}