{
    "author": "Dannyboi93",
    "created_utc": 1615483463.0,
    "distinguished": null,
    "edited": 1615485507.0,
    "id": "m2vje6",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m2vje6",
    "num_comments": 63,
    "permalink": "/r/GME/comments/m2vje6/i_believe_the_following_price_movement_has_been/",
    "score": 626,
    "selftext": "As you can see in the image below, the stock is moving in a weird manner, for starters, an ascending triangle usually comes about as a price moves up and hits resistance, but there was none of that here, as soon as the day started the ascending triangle began to form.\n\nhttps://preview.redd.it/hm7f7nn1mfm61.png?width=1573&format=png&auto=webp&s=aa3a691adf4a2eaf229bd79f9e81e2ab9359e882\n\nSimilarly, there has been no consolidation between stage one and two, there has been no time for the market to decide what it wants to do, it simply did one thing and moved straight onto the other, which I've never seen before.\n\nNow on the other hand, this could simply be organic price movement, but the thing that struck as bizarre is section (b), the price has been sold off to trigger the SSR for tomorrow already, so why when the stock is moving up, would there be another huge selloff. The only thing I can think of is that it was (b) was created by the same people who caused (a), thus setting the precedent for an ascending triangle which was further bolstered in (c) and (d).\n\nThe thing is, to make a price move like that, you have to have a lot of shares of GME. Now, let's say I'm an institution and I want to unload stock to realise profits. I can't dump all my stock at once because then I would tank the price and I wouldn't be guaranteed to get a good price for all of my stock, so I sell a bit, wait for the price to rise, sell a bit more, wait for the price to rise, etc - thus creating an ascending triangle **however,** as is currently popular sentiment, the price is going to go to the moon, so there would be no reason to sell my stock, I have no reason to realise profits, that further bolsters the case for this being an orchestrated move. Not because a big player is realising profits, but because a big player has specifically created this pattern  to catalyse the upward movement - **specifically coinciding with two days of SSR.**\n\n&#x200B;\n\n\\-----------------------\n\n**That brings me to my last point,** this pattern, which is a strong bullish pattern, was created the exact moment that two days of SSR was created. So as a big player I think, right once I've set the SSR I need to guarantee the price is going to go up, because otherwise it's a wasted opportunity, if it ranges, and people short, it diminishes the effects of SSR as opposed to a bull run. I can do that buy printing a huge fuck off bullish signal on the chart. Step 1, create the SSR, step 2, create the bull run, and then I profit.\n\n\\--------------------------\n\nTL;DR - **The current price pattern has been create specifically by a big player on our side to catalyse the bull run and make the most of 2 days of SSR**\n\nApe TL;DR - 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n*this is not financial advice, I just like the stock, it's also pure speculation so take it with a grain of salt*",
    "title": "I believe the following price movement has been specifically created to trigger the gamma squeeze. Analysis inside.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m2vje6/i_believe_the_following_price_movement_has_been/"
}