{
    "author": "ihatedmyboss",
    "created_utc": 1615457949.0,
    "distinguished": null,
    "edited": 1615670920.0,
    "id": "m2n44x",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m2n44x",
    "num_comments": 1001,
    "permalink": "/r/GME/comments/m2n44x/webull_confirms_cnbc_article_about_gme_price_drop/",
    "score": 15623,
    "selftext": "**Good Morning fellow Europoors and Galactic Apes**\n\nMore info has surfaced to indicate the obvious: **Pure** **Media F\\*ckery**\n\n\\*\\* **Please read the UPDATES at the end of this post**\n\nWe've heard of it and most have seen [Cramer himself talk about how he manipulated the market](https://www.youtube.com/watch?v=8DJlogbrDcA), but now we're seeing the degree of f\\*ckery play out IRL.\n\nNow, you know HF's are done for when the media stays quiet ALL day while the $GME rocket is making a pit stop to pick up our fellow $350+ apes....\n\nBut the minute the price dropped \\~ $170, we saw an influx of articles published about GameStop's \"demise.\"\n\nhttps://preview.redd.it/7xisdvdmqdm61.jpg?width=500&format=pjpg&auto=webp&s=970ea5cef57cb7925c1587c5fe83e3a2ca8335f5\n\n&#x200B;\n\n# Media F*ckery Part I\n\nOur fellow intelli-ape u/PermitNo1490 pointed out how CNBC published an article within a couple of minutes of the short attack, pointing towards a [coordinated tactic so we panic sell.](https://www.reddit.com/r/GME/comments/m247iu/this_article_about_the_40_drop_was_released_by/)\n\n&#x200B;\n\nhttps://preview.redd.it/k2lx5f1sqdm61.jpg?width=500&format=pjpg&auto=webp&s=5a08770582dcf5def677a600efbbe603161e99ef\n\n&#x200B;\n\n# Media F*ckery Part II\n\nNow check this shiznitz out- [this article](https://www.cnbc.com/2021/03/10/gamestop-surges-40percent-then-wipes-out-gain-completely-and-is-halted-again.html) was published at **12:41 p.m. EST**, and the journalist himself stated \"the shares lost all of those gains in a rapid decline around **12:30 p.m. ET.**\"\n\n&#x200B;\n\nhttps://preview.redd.it/zqxkxhk5rdm61.png?width=400&format=png&auto=webp&s=8e15b5ddbf91aafc886b7c13ff0a57d7bc88194b\n\n&#x200B;\n\nSo basically, he gathered data, wrote this article, edited it, added charts, and published it within 11 minutes?\n\n&#x200B;\n\nhttps://preview.redd.it/cifx0y2ardm61.jpg?width=249&format=pjpg&auto=webp&s=23faae62e86ae4d9f4c2870ffbd9afe46742fbc2\n\nFrom the horse's mouth, dude was microwaving some cock within those 11 mins. His multi-tasking skills are Next-f\\*cking-level.\n\n&#x200B;\n\nhttps://preview.redd.it/kw152srerdm61.png?width=500&format=png&auto=webp&s=3a2b6ea5570be53e551d5f89800a40a0b08122fd\n\n&#x200B;\n\n# Media F*ckery Part III\n\n# \n\n~~Ladies and gentleapes, let me introduce you to this journalist at MarketWatch, published an article at~~ **~~11:55 a.m. EST,~~** ~~yet the price drop occured well after.~~\n\n\\*\\***EDIT:**\\*\\*  It's been brought to my attention that E\\*trade's app was experiencing a glitch and posted the article's time incorrectly. This can also be true. No comment from E\\*Trade or MW has been released yet.\n\nCredit to  u/ReceptionNo3764 for posting the below [screenshot](https://www.reddit.com/r/GME/comments/m2aho0/how_it_started_vs_how_its_going_lmao_market_watch/)\n\n**EDIT 2:** [MrDavidNio](https://twitter.com/mrdavidnio) posted the [tweet](https://twitter.com/MrDavidNIO/status/1369733681259053061) originally.\n\nAccording to E\\*trade's app, the article publish time reflects **11:55 a.m. EST**, but when we [visit the article now](https://www.marketwatch.com/story/gamestop-stock-was-reaching-new-heights-but-shares-in-the-meme-stocks-just-plummeted-11615398208), it shows **12:43 p.m. ET**.\n\n\\* **EDIT 3:**\\* It's been brought to my attention that E\\*trade and other brokerage apps were displaying the incorrect timestamp. Hence the article's timestamp was an hour off and displaying the time as 1 hour before (11:55am instead of 12:55pm).\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/gurk614q2gm61.png?width=450&format=png&auto=webp&s=cc9946e72bd54b51b58e5d57d45de03cf9af3369\n\n&#x200B;\n\nhttps://preview.redd.it/qfrj1gxlrdm61.png?width=498&format=png&auto=webp&s=de91572ffa38bd9dc5c080464833286dcf23ca94\n\n&#x200B;\n\nA Twitter user [posted this](https://twitter.com/dave_jupiter/status/1369897260553822208): he saw the same article from MarketWatch posted on the WeBull app (WeBull doesn't write the articles, of course). So he reached out to WeBull, expressing his concerns about the timing of the article.\n\n**Check out WeBull's response about the timing of the article:**\n\n&#x200B;\n\nhttps://preview.redd.it/7td94ygnrdm61.png?width=296&format=png&auto=webp&s=003115f2165baf9f456860fe94fe86aeb73da522\n\n**\\*Disclaimer:** I can't confirm the accuracy of this message from WeBull customer service (unless I speak to WeBull directly). However, I saw it posted around Twitter and thought I'd share.\n\n**TL;DR:** Expect even more f\\*ckery today and in the days to come, esp when it's time to moon. Many held down to $39, and our diamond-balls apes held all the way down from $487. They can't shake me or break me. Drive it down to $0.99, I'll buy more.\n\n**Obligatory:** Not financial advice. I'm a dumb money retail gambler. I don't know Jack Schitt.\n\nIf anyone would like to add to this or if I've made any errors, please let me know and I'll correct.\n\n**EDIT 1**: Some images are not loading for some reason. Let me know if you're unable to see.\n\n**EDIT 2:** Whoa! Thank you for all the comments and love. Many apes have provided more info and I'm trying my best to go through hundreds of comments. Reddit desktop is running extremely slow for me and the app keeps freezing on me. Will update as soon as I can.\n\n**EDIT 3:** Please please do not harass any of the journalists on their social media accounts. I understand it's upsetting, but we are FAR better than that. We don't need to stoop to the f\\*ckery level. Screenshots were provided for informational purposes only.\n\n**Edit 4:** I've been receiving a ton of msgs about the date of the MW article showing on Google 14hrs prior to the price dip. Yes, I noticed this yesterday and here's why I didn't find it necessary to post:\n\nAn article sitting as a draft can be discovered by Google's bots prior to publishing- this is called **indexing.** Additionally, the URL or title of the article can also be changed at a later time.\n\nSo the question many are asking: \"Why would an article about GME's price decline even be sitting as a draft, many hours prior to it actually happening?\"\n\nOften, journalists working for large publications draft up an article early on so when/if the news breaks, they can publish it quickly.\n\nHere's my **personal take** on this specific situation (and I'm not asking anyone to agree with me): $GME has been on a [ride upwards since 2/24/21](https://finance.yahoo.com/quote/GME/history?p=GME), with the exception of a couple dates (2/26, 3/02) where the stock price closed just a few dollars lower than the previous day's close. Yet, the day the price takes a 40% dive (and rallies right back up- ayeee!!), suddenly articles are published super quickly. Now, I get it- it's completely possible for someone with dope ass skills to publish an article within minutes, all while microwaving chicken. Nonetheless, I still find it sus.\n\n**Edit 5:** In relation to the screenshots I've posted here- tons of people **claimed** yesterday to have seen the article before the price dipped, and so they posted their observations on Twitter and r/GME. I get it, it's not proof, just statements.\n\nDo with this information what you will.\n\n**My Thoughts:** Do I think media manipulation exists? F\\*ck yes. Do I think media is currently being manipulated re: GME, regardless of if these journalists in question had insider info about the price drop or not? F\\*ck yes.\n\nIt's blatantly obvious. These are so-called financial experts who cover the stock market every damn day, and have public information about GME easily available to them, plus a shit ton of other tools/resources, yet they deliberately choose to disregard GME's fundamentals.\n\nRemember, there are BILLIONS, likely trillions, of dollars on the line here. The media isn't your friend, they're on the HF's payroll to spread FUD. This isn't anything new. We should know by now how Jim Cramer manipulated the market and used the media to cause panic. [He said it HIMSELF.](https://www.youtube.com/watch?v=8DJlogbrDcA)\n\n**For you lazy apes, here are some of JC's statements directly from the video:**\n\n\"Mechanics are more important than the fundamentals....Who cares about the fundamentals!\"\n\nOh, this one is my fav:\n\n\"I think it's important for people to recognize that the way that the market really works is to have that nexus of hit the brokerage houses with a series of orders that can push it down (stock price), **then leak it to the press and then get it on CNBC, that's also very important. And then you have a kind of vicious cycle down.\"**\n\nMind you, he works as a host for that exact news channel CNBC, offering \"expert financial advice\" to millions of people.\n\n**FYI:** The YT video of him admitting to [market manipulation is constantly removed](https://www.nerdwallet.com/blog/investing/history-jim-cramer-thestreetcom-founder-mad-money-host/) by JC's team. The video was reposted recently on 2/3/21, and I wouldn't be surprised if it's removed again.\n\nWant more? [Here's another article](https://www.reuters.com/article/cramer-interview-idUKN2036292620070320) from 2007 talking about getting \"bozo reporters\" and feeding them wrong information.\n\nDo with this info what you will.\n\nAs for me, I'm holding until HFs are sucked dry (using desktop so can't post diamond hands, rockets, apes, 'nanas emojis...forgive me).\n\n\\*not financial advice, just an ape waiting for tendies\n\n&#x200B;",
    "title": "WeBull Confirms CNBC article about $GME price drop was published WHILE price was still high**",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/m2n44x/webull_confirms_cnbc_article_about_gme_price_drop/"
}