{
    "author": "peenweens",
    "created_utc": 1621860608.0,
    "distinguished": null,
    "edited": 1621868760.0,
    "id": "njx7so",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_njx7so",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/njx7so/crypto_moving_to_gme_dont_count_on_it/",
    "score": 914,
    "selftext": "I made a comment about this in the daily, but wanted to post it here for some more visibility.\n\nThis sudden obsession with crypto's supposed mass move to GME is based on zero real information. Until I see volume that shows they've moved, I'm going to assume it's more FUD for the media to blame crypto on the market decline. Especially when there's really only one post on the whole crypto sub linking the recent dip and GME, and most of the comments are talking like it's just conspiracy mumbo-jumbo. The general consensus on the crypto sub is that they've been infiltrated by r/superstonk conspiracy theorists.\n\nSo that means either:\n\n1. This is an intentional shill tactic to shift the blame of the market decline to crypto day traders\n2. This community has just taken no news too far and made tons of memes without real evidence\n3. Both of the above\n\nMy opinion is that it's #3. Shills made this no-news \"news\" here, and our sweet smooth-brained apes went to the meme factory because it's exciting. This is what they wanted. ALWAYS DOUBLE CHECK YOUR SOURCES, OR CHECK FOR YOURSELVES BEFORE YOU INADVERTENTLY SPREAD FUD!!!\n\n[Here's the original post on the other sub.](https://www.reddit.com/r/CryptoCurrency/comments/njegof/the_real_reason_crypto_is_tanking/) Look at the comments.\n\nJust buy, hodl, and vote.\n\nEdit: As u/the-stratonites mentioned, there is another possibility: it's so HFs/media can say the reason GME went up today is not because of T-35 or anything to do with GME directly, but because crypto people started selling all their crypto and bought GME instead.",
    "title": "Crypto moving to GME? Don't count on it.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/njx7so/crypto_moving_to_gme_dont_count_on_it/"
}