{
    "author": "NA_1983",
    "created_utc": 1624944335.0,
    "distinguished": null,
    "edited": 1625003614.0,
    "id": "oa1sn0",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oa1sn0",
    "num_comments": 120,
    "permalink": "/r/Superstonk/comments/oa1sn0/gme_and_on_balance_volume_dd_bullish_or_selloff/",
    "score": 1807,
    "selftext": "&#x200B;\n\n&#x200B;\n\n[Hello fellow Apes, its Deep Dive time! Today is the day of many Moon chicken tenderloins! Just Kidding!](https://preview.redd.it/ilik9lqt75871.jpg?width=625&format=pjpg&auto=webp&s=f11b3d361c61bb5553b8f123a5e2a9ce2060d6a4)\n\nSeriously though, I’d like to take a stab at an On Balance Volume (OBV) DD.  Go over what OBV is, what we are seeing with this indicator and how it relates to the stock we like.   On a routine basis we’ve seen posts with reference to OBV and statements that it shows no one is selling off.   There has however been some controversy that this statement doesn’t hold true and related FUD that there has been a recent selling trend.  Let’s understand OBV and test which of these theories holds true.\n\n&#x200B;\n\n&#x200B;\n\n[So What is OBV and What is it Signaling for GME? ](https://preview.redd.it/ctugc2rv75871.png?width=1214&format=png&auto=webp&s=e5ea3f31397a2969e1779df03293741400fb1546)\n\n**How I’ve Broken Up this Due Diligence:**\n\n* I)\t Obligatory This is Not Financial Advice Statement\n* II)\tWhat is On-Balanced Volume (OBV) (History, Concept & Theory)\n* III)\tHow is OBV Calculated\n* IV)\tWhat is OBV Used For / How the Indicator Works\n* V)\tCriticism of OBV with GME (A Focus on Divergence)\n* VI)\tTesting GME OBV (Does the Trend Show a Sell-Off?)\n* VII)\tMy Ape Conclusion / TLDR\n* i)\tMy Sources for this DD\n\n&#x200B;\n\n# I) Obligatory This is Not Financial Advice Statement\n\nI am not a certified financial planner/advisor nor a certified financial analyst nor an economist nor a CPA nor an accountant nor a lawyer.  I am not a finance professional in any manner through any formal education.  I can however smoke/grill an exceptionally good tenderloin steak, but of course that’s just my opinion man!  But yeah, your basic Ape here that learned the inter-webs and drew some pretty graphs for SuperStonk’s entertainment and discussion purposes.  Almost all this post is regurgitated data that I cut and paste from public sources on the web.\n\n&#x200B;\n\nOk, now that’s out of the way…let me take a stab at understanding OBV…\n\n&#x200B;\n\n# II) What is On-Balanced Volume (OBV) (History, Concept & Theory)\n\nOn-balance volume (OBV) is a technical trading momentum indicator that uses volume flow to predict changes in stock price. Joseph Granville first developed the OBV metric in the 1963 book Granville's New Key to Stock Market Profits.\n\n&#x200B;\n\nGranville believed that volume was the key force behind markets and designed OBV to project when major moves in the markets would occur based on volume changes. In his book, he described the predictions generated by OBV as \"a spring being wound tightly.\" He believed that when volume increases sharply without a significant change in the stock's price, the price will eventually jump upward or fall downward. \\[1\\]\n\n&#x200B;\n\nI feel most of us would agree with that statement regarding how GME usually responds to a daily dose of high volume. \\[A\\]\n\n&#x200B;\n\nThe basic theory behind the On Balance Volume indicator is that volume precedes price. Buying and Selling pressure precede actual price changes, and this indicator measures the buying and selling pressure by using volume.\n\n&#x200B;\n\nWhen volume on PRICE UP days is greater than volume on PRICE DOWN days, OBV increases.\n\nWhen volume on PRICE DOWN days is greater than volume on PRICE UP days, OBV decreases. \\[3\\]\n\n&#x200B;\n\n# III) How is OBV Calculated\n\nOn Balance Volume (OBV) measures buying and selling pressure as a cumulative indicator that adds volume on up days and subtracts volume on down days. When the security closes higher than the previous close, all of the day’s volume is considered up-volume. When the security closes lower than the previous close, all of the day’s volume is considered down-volume. \\[2\\]\n\n&#x200B;\n\nAgain, On Balance Volume is calculated by adding the day's volume to a cumulative total when the security's price closes up and subtracting the day's volume when the security's price closes down.\n\n&#x200B;\n\n\tIf today's close is greater than yesterday's close then:\n\nOBV = Yesterday’s OBV + Today’s Volume\n\n&#x200B;\n\n\tIf today’s close is less than yesterday’s close then:\n\nOBV = Yesterday’s OBV – Today’s Volume\n\n&#x200B;\n\n\tIf today’s close is equal to yesterday’s close then:\n\nOBV = Yesterday’s OBV \\[2\\]\n\n&#x200B;\n\nI would stress when understanding the calculation, that OBV is a macro indicator focused on daily metrics.  Analyzing OBV on an hourly basis in a short time frame may not really give you an accurate trend or direction of the overall buying/selling pressure. \\[A\\]\n\n&#x200B;\n\n# IV) What is OBV Used For / How the Indicator Works\n\nOBV is generally used to confirm price moves.  The idea is that volume is higher on days where the price move is in the dominant direction, for example in a strong uptrend there is more volume on up days than down days. \\[4\\]\n\n&#x200B;\n\n**How this indicator works:**\n\nThe actual value of the OBV is unimportant; concentrate on its direction.\\[2\\] (This is important concept with OBV IMO \\[A\\])\n\n&#x200B;\n\n**Trend Confirmation:**\n\nOBV can be used to confirm price trends. Where volume supports price action this creates convergence.\n\n&#x200B;\n\nThis can be seen when looking at the OBV trend vs. the underlying asset’s daily high price.  Is there convergence or divergence between the two?  Convergence is where the trend in the OBV line corresponds with the trend in the underlying asset’s price.  Conversely, if the two trend lines trend away from each other, this is obviously divergence.  \\[A,5\\]\n\n&#x200B;\n\nDivergence Example:\n\n[This is called a negative divergence or bearish divergence.  This is often interpreted as an indication of lower prices ahead because buyer interest is declining despite the rising price.](https://preview.redd.it/21uqyf7y75871.png?width=602&format=png&auto=webp&s=21b375bad1985dc86bbeecde79ed63dec121e020)\n\nWhere both the price and OBV line are rising, this is a signal that the price will continue to climb. Vice versa, where the price and OBV line are both falling, traders can continue to expect the downward trend in price to continue.\n\n&#x200B;\n\n[A downward confirming trend, both price and OBV are making lower peaks and lower troughs.](https://preview.redd.it/jxw1o4v085871.png?width=602&format=png&auto=webp&s=fb87a8b419c228ec20f6b82417b24e381a5d479d)\n\nThe degree of slope in the OBV line is critical to confirm the strength of the signal. Price movements on a slightly sloped OBV line is not a strong indicator. Price changes of a steep-sloped OBV line is a strong indicator. \\[5\\]\n\n&#x200B;\n\n**Trading Signals:**\n\nWhen OBV is up, buying pressure is up and when OBV is down, then selling pressure is up.\\[3\\]\n\n&#x200B;\n\n* When both price and OBV are making higher peaks and higher troughs, the upward trend is likely to continue.\n* When both price and OBV are making lower peaks and lower troughs, the downward trend is likely to continue.\n* During a trading range, if the OBV is rising, accumulation may be taking place—a warning of an upward breakout.\n* During a trading range, if the OBV is falling, distribution may be taking place—a warning of a downward breakout.\n* When price continues to make higher peaks and OBV fails to make higher peaks, the upward trend is likely to stall or fail. This is called a negative divergence.\n* When price continues to make lower troughs and OBV fails to make lower troughs, the downward trend is likely to stall or fail. This is called a positive divergence.\\[2\\]\n\n&#x200B;\n\n# V)  Criticism of OBV with GME (A Focus on Divergence)\n\n**Large Spikes in Volume Throw Off OBV**\n\nCompany announcements, news releases, and a multitude of other reasons can cause traders to either become excited or concerned about a stock’s price potential. This can lead to a mass of buying or dumping of stock. This sudden increase in volume can throw off an OBV Indicator for a period of time. This is because volume is added or subtracted to the running OBV total. One large spike in volume will require a settling period. During this settling period, the OBV indicator will not be reliable in providing trend confirmation or price reversal signals.\\[5\\]\n\n&#x200B;\n\n**My Ape Thoughts:**\n\nA large spike in volume is obviously the biggest criticism of GME OBV.  The initial GME squeeze in January saw a massive volume spike in a noticeably short period.\n\n&#x200B;\n\nThe OBV debate now with GME is if there is a sell-off occurring in recent months or if the diamond hands continue to buy and hold.  This leads us to a more in depth look at OBV divergences and charting GME’s data.  I’ll get to that below.\n\n&#x200B;\n\nThe subjective question is how long is the typical OBV Indicator “thrown off”?  What is this period I’ve time?  IMO we’ve seen 5 solid months of post squeeze GME buying and selling pressure with more normalized volume.  I would argue a February through June GME OBV vs. price chart would sufficiently show an accurate trend.  I’ll test that out below.\n\n&#x200B;\n\nAgain, the controversy around GME OBV deals with the premise that the massive January volumes have thrown off the OBV trend.  That when viewed from a 6-Month or YTD perspective OBV is not useful to predict possible GME buying/selling trends. \\[A\\]\n\n&#x200B;\n\nSo here are the questions we must ask to either confirm or disprove the skeptics:\n\n* If we removed January volumes and viewed OBV and price from February to now, would it change the buying/selling trend?\n* What would the buying/selling trend be if we only looked at the last 60 market days?\n* Does January even matter?  Will OBV, regardless of the start date, always take the same shape?\n\n&#x200B;\n\nLet’s touch on Divergences one more time:\n\n**Divergences**\n\nOBV can be used as signals for trend reversals. Where volume does not support price action, this creates divergence.\n\n&#x200B;\n\n**Bullish Divergence** occurs where the OBV line moves higher while the underlying asset’s price continues to fall. As volume precedes price, a bullish divergence creates a buy signal as the price is expected to reverse and launch upwards.\n\n&#x200B;\n\n**Bearish Divergence** occurs where the OBV line moves lower while the underlying price rises. Just like a tightly wound spring, bearish divergences create a sell signal and traders can expect the price to reverse and launch back down. \\[5\\]\n\n&#x200B;\n\nSo let’s chart this out and find out if GME OBV is Bullish, Bearish, confirming up or confirming down?\n\n&#x200B;\n\n# VI)  Testing GME OBV (Does the Trend Show a Sell-Off?)\n\nFirst let us look at GME’s OBV past 12 months as a base line.  OBV in Navy and the Daily High Price in the Dashed Green.\n\n[Baseline GME OBV vs. Price over the past year.  A general upward trend shown.](https://preview.redd.it/4sz64tm385871.png?width=2294&format=png&auto=webp&s=af33cd4650306de9a2e2467f81c109ccb29b988d)\n\nNext Let’s compare the trend and shape of OBV from December 2020 to June 2021 (Red) compared to February 2021 to June 2021 (Blue).  This will help us answer the first question of “Does January even matter?”  Will OBV, regardless of the start date, always take the same shape?\n\n&#x200B;\n\n[GME OBV with January Volume \\(Red\\) and without January volume \\(Blue\\)](https://preview.redd.it/qv0ps1t585871.png?width=2310&format=png&auto=webp&s=db0245f6cc9dbfcd7569bc302d31497cd4bfa339)\n\nNow if you remember from above on how this indicator works, the actual value of the OBV is unimportant; we only need to concentrate on its direction.  If you look at this chart from February 1st to today, the trend and shape is identical, only at different values.\n\n&#x200B;\n\nThis begins to answer our questions.  January only matters for January.  The 5 months succeeding do not appear to be thrown off by the January spike.  At worse, 2-3 weeks of February are still boggled from the volume spike.  I’m confident looking at March through June’s OBV will give this analysis a solid trend.\n\n&#x200B;\n\nThis leads us to looking at two more charts.   Let’s analyze the trading signals for:\n\n&#x200B;\n\n1 - OBV and daily high price from March to now.\n\n2 - OBV and daily high price from the past 60 days.\n\n&#x200B;\n\n**March to June Chart:**\n\n[GME OBV Macro Analysis from March to June, negating the January Spike in Volume](https://preview.redd.it/o9uhvt0985871.png?width=2508&format=png&auto=webp&s=53317db4b81dd5ac9eb0344dda1fa80cc8d50df1)\n\nSo this most macro view of the past 5 months does not show us a divergent trend, bullish or bearish.  I would say this is a weak downward confirming trend .  Extremely weak and remember the degree of slope in the OBV line is critical to confirm the strength of the signal. Price movements on a slightly sloped OBV line is not a strong indicator.\n\n&#x200B;\n\nIf you look at the 4/25 to about 5/23 sideways price trading range, the OBV during this time rising.   This indicated buying interest and accumulation of shares during this time which will ultimately lead to a breakout to the upside on 5/25. (this comment isn’t trended on the chart, but is positive/bullish)\n\n&#x200B;\n\nSo lets look at the last 60 days to see if this gives a clearer picture.\n\n&#x200B;\n\n**May through June chart:**\n\n[Two OBV Trend in the past 60 days, confirming up and confirming down.](https://preview.redd.it/l8tsanwb85871.png?width=2434&format=png&auto=webp&s=96cf4580cffdb6870f8cdd478ffaefb0e62ebf9b)\n\nAt first pass, the past 60-day OBV trend didn’t appear divergent, bullish or bearish.  From late April through early June an upward confirming trend demonstrating buying and holding (solid trend lines).  Then, since GME hit $344 on 6/8 there appeared to be a trend reversal towards a downward confirming trend (dashed trend lines)…..but, but… I think that I'm looking at it incorrectly….\n\n&#x200B;\n\n**May through June 2nd Look:**\n\n[Let’s take a closer look at just June](https://preview.redd.it/391rnxsd85871.png?width=2404&format=png&auto=webp&s=93ed42803465648c15df32895160ec2f4b39ccbd)\n\nLooking closer at just the past month, it occurred to me that we are actually looking more bullish than anything else.  Bullish divergence happens when prices make a lower bottom but the OBV does not decline to new lows. That’s clear with the red trend lines.  Otherwise, the dashed trend lines show a bullish upward confirming trend.\n\n# POST EDIT on 6/29:\n\nI Ran this chart on Yahoo with a similar focus as the May through June charts above and got very similar results.  Purple trend lines show a bullish upward confirming trend.  Red Trend lines are showing a **Bullish Divergence** (where the OBV line moves higher while the underlying asset’s price continues to fall).  Green Trend lines show a downward confirming trend in the past few weeks, but I believe the prior red and purple trend lines make up for this recent downward pressure.  I'm still jacked!\n\nhttps://preview.redd.it/k7osfbmuz9871.png?width=964&format=png&auto=webp&s=27cda7d59a2fcb95c4fc77d93789b65666df101d\n\n# VII)  My Ape Conclusion / TLDR\n\n&#x200B;\n\n**First observation,** while I agree with the GME OBV critics that large spikes in volume can throw off a OBV indicator, **I would argue that since March the volume has normalized** enough that we can use OBV to some degree to measures buying and selling pressure.\n\n&#x200B;\n\n**Second observation**, when looking at the OBV vs daily high price since March is formed a very weak downward confirming trend.  This trend is practically flat.  I don’t believe this was a sell off.  I think averaged across this time period p**eople actually did just slowly buy and hold**.\n\n&#x200B;\n\n**Third observation**, when looking at the last 60-days, especially the last 3 weeks, we’ve actually seen an **upward confirming trend** reverse into a possible **Bullish Divergence** (where the OBV line moves higher while the underlying asset’s price continues to fall).   As volume precedes price, a bullish divergence creates a buy signal as the price is expected to reverse and launch upwards.\n\n&#x200B;\n\n# Finally, don’t listen to anyone about a sell off, things aren’t getting worse, they appear to be getting better with this indicator.  No dates, but if the trend over the past few weeks holds, I would expect a potential upward breakout.\n\n&#x200B;\n\nThank you!  Now please throw darts at this DD and tell me what I missed!\n\n&#x200B;\n\n[OBV Signals are Clear for Lift Off!](https://preview.redd.it/ykh89x8g85871.jpg?width=588&format=pjpg&auto=webp&s=c95cc21a3e10a695578b3b7ca8105553053b3deb)\n\n# A few closing thoughts on OBV in general:\n\n**Not a Standalone Indicator**\n\nOBV is not a standalone indicator. A criticism of OBV is that it doesn’t account for the degree in price movement. Regardless of whether the stock price moves by a few cents or hundreds of dollars, if the closing price is greater than the prior closing price, volume will be added to the OBV running total. This doesn’t provide a holistic view of price action which in turn can create misleading or confusing trade signals.\n\n&#x200B;\n\nOne way to combat this is to pair OBV (a leading indicator) with a lagging indicator such as a moving average. A long-term moving average can be plotted on top of the OBV line (not the price chart) and can provide additional confirmation of trend direction. Where OBV is moving above the moving average, this confirms an upward trend. Conversely, an OBV below the moving average confirms a downward trend.\n\n&#x200B;\n\n**Is OBV a good indicator?**\n\nOne limitation of OBV is that it is a leading indicator, meaning that it may produce predictions, but there is little it can say about what has actually happened in terms of the signals it produces. Because of this, it is prone to produce false signals. It can therefore be balanced by lagging indicators.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**i)  Sources:**\n\n\\[A\\] My Own Ape Thoughts\n\n\\[1\\] [https://www.investopedia.com/terms/o/onbalancevolume.asp](https://www.investopedia.com/terms/o/onbalancevolume.asp)\n\n\\[2\\] [https://www.fidelity.com/learning-center/trading-investing/technical-analysis/technical-indicator-guide/obv](https://www.fidelity.com/learning-center/trading-investing/technical-analysis/technical-indicator-guide/obv)\n\n\\[3\\] [https://indzara.com/2021/04/on-balance-volume-technical-indicator/](https://indzara.com/2021/04/on-balance-volume-technical-indicator/)\n\n\\[4\\] [https://en.wikipedia.org/wiki/On-balance\\_volume](https://en.wikipedia.org/wiki/On-balance_volume)\n\n\\[5\\] [https://leah-mathieson.medium.com/the-on-balance-volume-obv-indicator-how-volume-can-improve-your-trading-4ce18da5bc3f](https://leah-mathieson.medium.com/the-on-balance-volume-obv-indicator-how-volume-can-improve-your-trading-4ce18da5bc3f)",
    "title": "GME and On Balance Volume DD (Bullish or Sell-Off?)",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/oa1sn0/gme_and_on_balance_volume_dd_bullish_or_selloff/"
}