{
    "author": "ChiefNorske",
    "created_utc": 1624208184.0,
    "distinguished": null,
    "edited": false,
    "id": "o49x2t",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_o49x2t",
    "num_comments": 138,
    "permalink": "/r/DDintoGME/comments/o49x2t/rrp_theory_and_why_the_time_bomb_is_ticking/",
    "score": 760,
    "selftext": "Hey there all beautiful people. This post I'm going to be explaining a couple RRP theories that i've been thinking about and analyzing, along with why the the end is imminent. \n\nTo begin, we all know the RRP have been hitting all time highs, and have continued to be on an upward trend for around a month now. I think that's crazy, but I want to know why. Why reverse repos? Until last week they had a rate of 0%, until it was raised to 0.05%, which is still so utterly low. They're still losing whole percent's to inflation. \n\nTheory 1: \n\nSo we know RRP's only have 0.05% rate, and that there are short terms bonds with even better rates. \n\nhttps://preview.redd.it/cymeo2808g671.png?width=756&format=png&auto=webp&s=38c919025ecfb285567d8ddb34f71f8930927c45\n\nSee above,\n\nSo there are better rates, but yet they decide to continue to throw the money into RRP instead of locking it up into bonds or other assets. So the theory goes as this: there are no better assets or guarantees than 0.05%. Everything else in the market is complete and utter garbage. Or, they aren't entirely sure when they will need the cash and don't want it locked up in bonds that don't mature for years, either or, but continue to Theory two as to why they won't put it into bonds.\n\n&#x200B;\n\nTheory 2:\n\nY'all remember Atobitts amazing string of DD's? To be more specific, remember the one where he proves that the treasury bond market is shorted to hell and back? You picking up what i'm putting down here? Those that participate in RRP know that they actually can't put it into bonds because it will start the short squeeze in the bond market. That they'll be even more fucked than just letting it stagnate in RRP. I really believe this to be a big factor in the huge uptick in RRP. and that they are only going to get higher and higher. Trillions potentially by end of month.\n\n&#x200B;\n\nTheory 3:\n\nI thought GME would be the catalyst that blows up the market, but the longer that they allow this to go on, we are realizing that the market was going to collapse without a \"meme\" stock assisting it. With all the potential pattern lining up to go off this week, I firmly believe that there will be so much buying and selling pressure, that the volatility could cause members to default. Another thing is the potential approval and implementation of 002, resulting in hourly margin calls and the requirement to meet them.. or else. \n\n&#x200B;\n\nThere are no coincidences. Everything is connected and in the end we can only hope that taxpayers aren't held with the bag. This could be our one and only chance to change the market for the better and to ensure that there is a free market for our kids and grandchildren.\n\nI'm still trying to figure out why bank stocks took a massive DUMP this past week... Please comment below and talk to me about what y'all think and how we can hive mind a solution. \n\nEnjoy the rest of y'alls weekend for another week starts tomorrow.",
    "title": "RRP Theory and Why The Time Bomb is Ticking Harder Than Ever.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/o49x2t/rrp_theory_and_why_the_time_bomb_is_ticking/"
}