{
    "author": "Throwaway2Experiment",
    "created_utc": 1621846985.0,
    "distinguished": null,
    "edited": 1621847231.0,
    "id": "njthzc",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_njthzc",
    "num_comments": 515,
    "permalink": "/r/Superstonk/comments/njthzc/too_many_posts_talking_about_crypto_apes_like/",
    "score": 11721,
    "selftext": "First, Crypto Apes, if you're truly here, welcome!\n\nJust because crypto is crashing doesn't mean those that have invested until now are somehow chumps or previously delusional. They didn't crack open a GME Bible this weekend and go, \"Holy shit! My life is a lie!\"\n\nNo. These are people who have been HODLing and buying the dip since GME was a curly hair on our unjacked tits; unnamed, unloved, unsightly.  These folks know volatility and they are tenacious; staring at their markets 24/7/365, manually trading, swapping wallets, shitcoining, staking, and mining. They've seen their version of Robbinghoods, manipulation, and market crashes.  Some have seen impressive gains. Others, catastrophic losses.  They. Are. Us.\n\nJust like us, they've had hopes of riches due to equal parts tenacity, patience, balls, and faith. Often they've been investing in a method of responsible consensus that is the seed to the future that we GME Apes want: a fair, honest, accountable, and transparent market.\n\nIF this Crytpo crash is the gas to our steady flame and their joining in our fight is the weighted catalyst we've been begging for ... Thank them for taking up arms. If they're here, they're moving their resources from one war front to the other. They're not idiots. They're tacticians and they've been aware of us. The whole world has been aware of us.\n\nApes together. Apes strong. The smooth brains and ants welcome their digital brother apes. Together, we'll win this.",
    "title": "Too many posts talking about Crypto Apes like they're idiots who are 'waking up' to our reality. It's belittling and we're above that. We haven't won anything and they've done everything right for themselves.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/njthzc/too_many_posts_talking_about_crypto_apes_like/"
}