{
    "author": "CupioDissolvi333",
    "created_utc": 1628272966.0,
    "distinguished": null,
    "edited": 1628285614.0,
    "id": "ozc10j",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ozc10j",
    "num_comments": 117,
    "permalink": "/r/Superstonk/comments/ozc10j/new_terms_were_listed_by_t212_brokerage_today_i/",
    "score": 536,
    "selftext": "[T212 New Terms](https://preview.redd.it/r7ib64uvwrf71.png?width=710&format=png&auto=webp&s=b5255aa65fff5739896257d5e23823a6bb956c58)\n\nNew terms were listed by T212 brokerage today.\n\nFirst Question:\n\n1. **Para 13.3** this new language re: ‘ in the unlikely event that a third party exercises its rights over such unsettled Investments’.\n\nHow do I interpret this – who is this ‘third party’? Who is it that can call on my GME shares (i.e. my Investments) as ‘security for the fees it charges for holding’ my GME shares??? Moreover, if I'm not mistaken, T212 is only liable to me up to £85,000. So they have this limited £85k liability in the event that this 'third party' claims my GME shares for fees???\n\n2) **Para 20.7** the second part regarding the ‘special stock dividend’ – this seems to refer to the scenario previous discussed on Superstonk; i.e. if GME issued a really special crypto dividend which the DTCC wouldn’t be able to replicate due to the unique serial #, which would precipitate in the DTCC having to recall all shares. T212 new language says: ‘this may not be possible in certain situations, for instance, due to… technical reasons’, which would result in T212 paying that ‘corporate action’ (i.e. the special dividend – or this new GME crypto dividend) as cash. This sounds like a way for T212 to get around (a) having to pay us as GME holders this crypto dividend, (b) the share recall scenario\n\n&#x200B;\n\nEither way - I think T212 users (including myself) need to pressure T212 to explain itself!\n\nEDIT: loads of peeps are asking about other brokers they could use. I’d consider Saxo Bank (fees are high, but they seem reputable); DEGIRO (maybe less reputable, low fees, and I’ve heard they do PFOF as well); Fineco bank (v little experience of them); Schwab (again - need $25k minimum invested, but they appear reputable and are more of a boomer broker)",
    "title": "New terms were listed by T212 brokerage today. I have 2 q's: (A) para. 13.3 - who is this mysterious '3rd party', (B) T212 seems to be shielding itself from this new potential GME crypto dividend which was talked about (which might be more confirmation bias) (I think T212 needs to explain itself)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ozc10j/new_terms_were_listed_by_t212_brokerage_today_i/"
}