{
    "author": "playswiththebottle",
    "created_utc": 1628460804.0,
    "distinguished": null,
    "edited": 1628465633.0,
    "id": "p0o7xv",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_p0o7xv",
    "num_comments": 85,
    "permalink": "/r/GMEJungle/comments/p0o7xv/michelle_a_avan_former_executive_director_of/",
    "score": 503,
    "selftext": "**Michelle A. Avan found dead in her home by family members. Suspect in custody under $2 million bail.**\n\n&#x200B;\n\n**EDIT3: At the top for visibility to answer your question why/how is this related to GME?**\n\nBank of America is likely heavily involved with shorting GME through Merrill Lynch. [https://www.reddit.com/r/GME/comments/m2v2bb/merrill\\_lynch\\_may\\_be\\_the\\_big\\_shorting\\_whale/](https://www.reddit.com/r/GME/comments/m2v2bb/merrill_lynch_may_be_the_big_shorting_whale/)\n\nAvan  was an executive director of regulatory, financial risk and  reputational risk for ten years (2011 - June 2021) ensuring compliance  with regulations for Merill Lynch.\n\nThe  suspect is a BofA investment banker and risk management etc. (since June 2020)  serving companies with annual revenues of $50 million to $2 billion.\n\n**If you think this information is not worth seeing for whatever reason, remember you are free to downvote and/or report this post.**\n\n&#x200B;\n\n&#x200B;\n\n**Now on to the original post:**\n\nAvan had **recently** (June 24, 2021) transferred to a new role with Bank of America. She had just become part of the leadership team of the Global Diversity & Inclusion Organization as Head of Global Women and Underrated Talent Strategy.\n\nShe was a former **executive director of regulatory, financial and reputational risk oversight** in Merrill, with 2,500 financial advisors in 98 offices  in nine states and Guam in western Merrill. They **ensured compliance with regulations and corporate policies.**\n\nOfficers were called to the scene by a relative who was unable to reach  Avan. A cause of death had not been released, although homicide  detectives reported that Avan **“appeared to have suffered trauma to her  face.”**\n\nA suspect was in custody Friday, Aug. 6, on suspicion of murder stemming from the death of a prominent banking executive inside her Reseda, California home.\n\nMichelle began her financial services career in Morgan Stanley, Delaware  in 1994 and has soared to become an account executive in the New  Orleans office. She joined Merrill Lynch as a Registered Client  Associate in New Orleans in 1998 and became Vice President when she  arrived in Los Angeles in 2000. She has been a Western Director since 2011.\n\n&#x200B;\n\n**EDIT:**  The suspect is a Bank of America executive as well: Anthony Duwayne Turner. [https://lasentinel.net/man-arrested-in-murder-of-michelle-avan.html](https://lasentinel.net/man-arrested-in-murder-of-michelle-avan.html) Thank you u/Hopeless_Dreams713 for the addition.\n\n&#x200B;\n\n**EDIT2: The suspect, ANTHONY TURNER was recently (July 2020) named GLOBAL COMMERCIAL BANKING MARKET EXECUTIVE**\n\nSource: [http://ourweekly.com/news/2020/jul/16/bank-america-names-anthony-turner-global-commercia/](http://ourweekly.com/news/2020/jul/16/bank-america-names-anthony-turner-global-commercia/)\n\nBank of America has announced the appointment of Anthony Turner as  Global Commercial Banking market executive for the Greater Los Angeles  and Inland Empire markets, leading a team of 17 commercial bankers  covering Los Angeles County, Ventura County and the Inland Empire.\n\nTurner and his team will serve companies with annual revenues of $50  million to $2 billion, providing a variety of financial solutions,  including treasury, credit, investment banking, risk management,  international and wealth management.\n\nWith more than 20 years in the financial services industry, Turner joined Bank of America in 2015, and prior to that held a variety of  leadership roles at Wells Fargo and CIT/OneWest Bank.\n\nTurner earned a Master of Business Administration degree from the  University of Southern California and a Bachelor of Arts degree in  Quantitative Economics from the University of California, San Diego. He  also holds Series 7 and 63 licenses.\n\nHe is currently the vice chair of the Weingart YMCA, serves on the  board of the City of Vernon Chamber of Commerce, and is an active member  of the USC Alumni Association. He is also a former board member of the  Los Angeles Sports Council and The New Leaders, as well as a former  co-chair of Bank of America’s Black Professionals Group (BPG).",
    "title": "Michelle A. Avan - Former executive director of regulatory, financial and reputational risk with Merrill Lynch Wealth Management found allegedly murdered in her home.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p0o7xv/michelle_a_avan_former_executive_director_of/"
}