{
    "author": "thisperson131",
    "created_utc": 1624143128.0,
    "distinguished": null,
    "edited": 1624159790.0,
    "id": "o3rv2z",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o3rv2z",
    "num_comments": 292,
    "permalink": "/r/Superstonk/comments/o3rv2z/mortgages_and_default_protection_ending/",
    "score": 4150,
    "selftext": "I was a mortgage loan originator for about 5 years. I worked for companies like Quicken Loans (Rocket), United Wholesale Mortgage (UWM) and Citi. With the mortgage protection program ending, I wanted to discuss this a little.\n\nMortgage protection program is coming to an end at the end of this month. This will likely have a larger impact on non-depository institutions in comparison to depository institutions. Since 2008, banks have been servicing less of their mortgage originations and holding a smaller share in the market. A Mortgage Servicer is who you pay your mortgage to, these are referred to as MSR (Mortgage Servicing Rights). Quicken Loans primarily services its loans, meaning it makes money by collecting the interest on the payments from the borrowers. Where as a lot of banks today will quickly sell off the MSR to their loans. Why? Because its takes up their assets and are unable to offer more services and they're after the quick money, origination fees.\n\n&#x200B;\n\n[https://internationalbanker.com/finance/why-have-banks-stepped-back-from-mortgage-servicing/](https://internationalbanker.com/finance/why-have-banks-stepped-back-from-mortgage-servicing/)\n\n&#x200B;\n\n[Non-Depository financial institutions have been growing in the servicing market](https://preview.redd.it/tjht4ou4hb671.png?width=2611&format=png&auto=webp&s=1ec0f5e424d3a3e4de6c280edfa3f10d86c05143)\n\n&#x200B;\n\n[Non-Depository institutions have been destroying the competition in both Purchase and Refinances](https://preview.redd.it/ic5qdc76hb671.png?width=2810&format=png&auto=webp&s=51d5b1634344e380d433a0c2241e5d54dcd34deb)\n\n&#x200B;\n\nWhat is interesting to me about Quicken Loans/Rocket is that when I worked there, we were strongly against going public. Dan Gilbert spoke about this specifically during meetings with his banking staff. We didn't want investors to tell us how to run our business. But all of a sudden last year during a pandemic they went public after being completely against it?\n\n[https://www.freep.com/story/money/business/2020/06/20/quicken-loans-ipo-who-gets-rich/3197631001/](https://www.freep.com/story/money/business/2020/06/20/quicken-loans-ipo-who-gets-rich/3197631001/)\n\n&#x200B;\n\nhttps://preview.redd.it/nsrbcr4whb671.png?width=2112&format=png&auto=webp&s=9c006ecc3227a262294c4795cead0e56860f2671\n\nThis was also the same mentality with United Wholesale Mortgage. This was a \"family owned business\". Jeff Ishbia started the company in 1986 with Mat Ishbia running the company as CEO as of 2013. And yet for some reason, UWM went public as well in the middle of a pandemic...\n\n&#x200B;\n\n[https://www.forbes.com/sites/antoinegara/2021/01/23/how-mat-ishbia-cashed-in-on-the-biggest-spac-ever-from-benchwarmer-to-13-billion/?sh=78a6d3637a33](https://www.forbes.com/sites/antoinegara/2021/01/23/how-mat-ishbia-cashed-in-on-the-biggest-spac-ever-from-benchwarmer-to-13-billion/?sh=78a6d3637a33)\n\n&#x200B;\n\n[I specifically didn't highlight Rocket because that is the only name in this list that makes sense. The rest is BS](https://preview.redd.it/7rw6xutyhb671.png?width=2172&format=png&auto=webp&s=632a56d4ba4701323e0a5d99d0ddb0234d593711)\n\n[https://www.housingwire.com/articles/here-are-the-top-15-mortgage-lenders-of-2020/](https://www.housingwire.com/articles/here-are-the-top-15-mortgage-lenders-of-2020/)\n\n2 – **United Wholesale Mortgage**\n\n* Total Originations – 560,796\n* Total origination volume – $182.82 billion\n\nNow take a look at the others, Rocket is indeed larger. However, WF, Chase & BofA are smaller in the mortgage industry. In fact, so much smaller that UWM has more originations and volume than Chase and BofA put together.\n\n1 – **Rocket Mortgage**\n\n* Total Originations – 1,142,638\n* Total origination volume – $313.41B\n\n4 – **Wells Fargo**\n\n* Total Originations – 319,429\n* Total origination volume – $126.9 billion\n\n8 – **JPMorgan Chase**\n\n* Total Originations – 224,833\n* Total origination volume – $95.6B\n\n9 – **Bank of America**\n\n* Total Originations – 184,088\n* Total origination volume – $76.91B\n\n&#x200B;\n\nSo here we have 2 mortgage giants who have great year over year sales and are legitimately the 2 largest mortgage originators in the industry. And yet, they're going public in 2020 despite never having the intention. The only thing that does make sense, is they are preparing to have cash on hand to handle defaults...\n\n&#x200B;\n\n[https://www.mayerbrown.com/-/media/files/perspectives-events/publications/2020/12/so-you-want-to-form-an-msr-fund-issues-and-considerations.pdf](https://www.mayerbrown.com/-/media/files/perspectives-events/publications/2020/12/so-you-want-to-form-an-msr-fund-issues-and-considerations.pdf)\n\n&#x200B;\n\nhttps://preview.redd.it/vlp9h7u2ib671.png?width=1953&format=png&auto=webp&s=82b0f11e197907d80d1d1ba44278a10000c9c15f\n\nUpon looking for MSR information because initially, that's where my search was. I found a plethora of articles mentioning the liquidity and capital risk involved with non-bank MSRs. This would line up well with both UWM and Rocket wanting to do an IPO. My guess is with the problem on hand seeing their mortgages begin to be delinquent late 2020, and the company still doing very well. It made sense to go public, generate cash and be prepared to pay out.\n\n&#x200B;\n\nA couple other things I found interesting. AmeriHome is looking sketchy to me. They did a large sell off to Ocwen of 48 Billion of MSRs (essentially 50% of their MSR), and were sold to Western Alliance Bank. This company services mortages, and buys from lenders to sell to investors. I can only imagine how much shit they are sitting on which to me, is probably why they were bought out. To me, this reminds me of BofA purchasing Cousntry Wide months before the crash. I would guess this company found its bag holders.\n\n&#x200B;\n\n[https://www.housingwire.com/articles/ocwen-to-buy-48b-msr-package-from-amerihome/](https://www.housingwire.com/articles/ocwen-to-buy-48b-msr-package-from-amerihome/)\n\n[https://www.nationalmortgagenews.com/news/behind-western-alliances-1-billion-bet-on-a-mortgage-lender](https://www.nationalmortgagenews.com/news/behind-western-alliances-1-billion-bet-on-a-mortgage-lender)\n\n&#x200B;\n\nhttps://preview.redd.it/iyqbtlsxib671.png?width=2205&format=png&auto=webp&s=487efa18a0e4a9ab3da6bb658ea6f27fc4fac9b3\n\n&#x200B;\n\nAnother thing I found interesting, may be related to absolutely nothing at all. These are companies that offer PMI or Private Mortgage Insurance. On conventional loans, typically if a buyer doesn't put 20% down, they have to pay PMI until the loan reaches 78% LTV or 80% LTV and is requested to have the PMI removed. But what is interesting to me is the may 12th date. All of these dropped in valuation at this time. This also coincides with when c r y p t o started to tank. I've seen other mentions of this date, not sure what it means though.\n\n[https://www.nationalmortgagenews.com/news/genworth-cancels-mortgage-insurer-ipo-citing-sector-volatility](https://www.nationalmortgagenews.com/news/genworth-cancels-mortgage-insurer-ipo-citing-sector-volatility)\n\n&#x200B;\n\nhttps://preview.redd.it/4zr1w0l6ib671.png?width=2292&format=png&auto=webp&s=639ad0945dc5ee36f845adbaecbb9585cf3cea5d\n\nTLDR: It is in my opinion, if mortgages do start defaulting and foreclosing. We should keep an eye out for non-depository institutions and Mortgage Servicers as these are up to a lot of risk on their own business models and liquidity problems. I personally think Rocket and UWM are at high risk as well as mentioned Ocwen and Western Alliance Bank. (See edit 4 why Rocket/QL really stands out here...)\n\n&#x200B;\n\nNone of this is financial advice\n\n&#x200B;\n\nEDIT: I tried to make an edit from my mobile device and it messed up all of the images :)\n\nEDIT2: What I wanted to edit from my phone... a few more things to point out. A housing crisis like 2008 is highly unlikely. As of right now, its estimated about 5% of mortgages are delinquent which isn't very high. Only mortgages over 120 days delinquent can receive a foreclosure notice. From this data:[https://www.nationalmortgagenews.com/news/mortgage-delinquencies-drop-sharply-but-point-to-an-uneven-recovery](https://www.nationalmortgagenews.com/news/mortgage-delinquencies-drop-sharply-but-point-to-an-uneven-recovery)\n\n&#x200B;\n\n[We can see about 2 million mortgages as of 3\\/31 are candidates for foreclosures.](https://preview.redd.it/s4wz1nbojb671.png?width=2082&format=png&auto=webp&s=685205b438b7dcab008d8c3fb7b363f10dcd271d)\n\nKeep in mind, these numbers are a  few months old. Another thing to point out, I'm unsure if when the mortgage protection ends if:Foreclosure notices will go out the next day\n\nOr if Foreclosure notices will need 120 days after the protection period.\n\nAlso, borrowers can request a loan modification or extension. Most likely, if we see foreclosures pop up. It won't be anywhere near as bad as 2008.\n\n&#x200B;\n\nEDIT3: For those worried about their mortgage holder defaulting, this wouldn't be a problem for you. It would just be transferred to another MSR and you would continue your payments through them.\n\n&#x200B;\n\nEDIT 4: Yes mortgages are sold to Mortgage Backed Securities. In which case, its generally not the lenders problem any more. HOWEVER, Quicken Loans writes A LOT of FHA loans and has had problems with FHA historically. With FHA loans, if they are defaulted on the originator is on the hook...\n\n[https://www.nationalmortgagenews.com/news/mortgage-delinquencies-drop-sharply-but-point-to-an-uneven-recovery](https://www.nationalmortgagenews.com/news/mortgage-delinquencies-drop-sharply-but-point-to-an-uneven-recovery)\n\n\" Finally, for banks that had been involved in FHA lending, the period following the GFC highlighted the particular risks for servicers. If a servicer made an insurance claim on a defaulted FHA loan, and it was later found that an error had been made with respect to the origination or servicing of that loan, the servicer could be liable under the FCA for treble damages. These cases were pursued aggressively by the U.S. Department of Justice (DOJ), and many large bank servicers paid extremely large fines, often for very minor origination errors. \"\n\n[https://www.housingwire.com/articles/49337-quicken-loans-agrees-to-pay-325-million-to-resolve-fha-loan-allegations-with-doj/](https://www.housingwire.com/articles/49337-quicken-loans-agrees-to-pay-325-million-to-resolve-fha-loan-allegations-with-doj/)",
    "title": "Mortgages and Default Protection Ending",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o3rv2z/mortgages_and_default_protection_ending/"
}