{
    "author": "krootzl88",
    "created_utc": 1623276522.0,
    "distinguished": null,
    "edited": false,
    "id": "nw7qr4",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nw7qr4",
    "num_comments": 261,
    "permalink": "/r/Superstonk/comments/nw7qr4/overvoting_is_cleared_to_match_each_brokers_dtc/",
    "score": 7151,
    "selftext": "\nHi fellow Apes! \n\nA lot of FUD has been shared around the 'low' vote count; this needs to be rectified! 🙂 A bit of visible frustration in the livestream as well! \n\n*The vote was never going to be higher than the float:*\n\nhttps://www.sec.gov/spotlight/proxyprocess/proxyvotingbrief.htm\n\n(clipout) - - >\n\"*How can these issues [over-voting] be addressed, and at what cost or consequence?*\n\nBackground: Generally broker-dealers attempt to address the over-vote/under-vote situation by implementing of one of three reconciliation methods: (1) “post-mailing reconciliation”; (2) “pre-mailing reconciliation”; or (3) a hybrid process of both post-mailing and pre-mailing reconciliation.\n\nPost-mailing reconciliation (post-reconciliation) is a process whereby the data is reconciled to accommodate an over-vote situation after the broker-dealer’s customers have submitted their votes. If the broker-dealer votes in excess of its position at DTC, the broker-dealer will reconcile or adjust the number of votes to correspond to its DTC position.\"\n\nTL;DR: vote counts are adjusted BY THE BROKERS to be within normal parameters if over-voting occurs. \n\n\n... so there you have it. Tits should still be jacked!! Mine are 😅 💎👐=🚀 🚀 🚀",
    "title": "Over-voting is cleared to match each broker's DTC holding! SEC is notified, and so is the company. 🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nw7qr4/overvoting_is_cleared_to_match_each_brokers_dtc/"
}