{
    "author": "YoungLadeen",
    "created_utc": 1623258016.0,
    "distinguished": null,
    "edited": 1623266198.0,
    "id": "nw0phc",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nw0phc",
    "num_comments": 146,
    "permalink": "/r/Superstonk/comments/nw0phc/so_this_is_the_humongous_wave_of_fud_that_weve/",
    "score": 3991,
    "selftext": "Apes, we knew that the hedgies and shills were gonna be upping the FUD a whole fucking tonne of notches today, and it’s clear to see that it’s to do with the mods, just like GME and WSB.\n\nTrue, Pink made a mistake talking the CNBC i’ll admit, but she’s only human (edit : She didn’t do an interview at all, shills created this rumour) . Think about all the things she’s done so far for all of us. The Jungle Beat, all her posts. Now she’s made a mistake and all the shills have come out in force. I’ve seen several posts saying she should be removed as mod and kicked out. \n\nARE YOU FUCKING SERIOUS????? \n\nThis is bullshit. We need to be even more supportive now. All the shills have come out and are currently having a field day, dividing the community. Please, I know we don’t have much brain cells because we’re all retarded, but try and see past this situation. THE FUTURE IS BRIGHT FOR US!!!\n\nThe shills will probably come out for this post too going nuts in the comments and this post will get downvoted but please remember one thing true apes\n\n#APES TOGETHER STRONG \n\nalso \n\n#BUY AND HODL\n\nEDIT : \n\n#PINK DID NOT DO A CNBC INTERVIEW\n\nAll the FUD is now coming to light. Strap up apes. This’ll be one rollercoaster of a ride 🙌🏻",
    "title": "So THIS is the HUMONGOUS wave of FUD that we’ve been warned about for 6/9",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nw0phc/so_this_is_the_humongous_wave_of_fud_that_weve/"
}