{
    "author": "samgungraven",
    "created_utc": 1627055381.0,
    "distinguished": null,
    "edited": false,
    "id": "oq56lb",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oq56lb",
    "num_comments": 322,
    "permalink": "/r/GMEJungle/comments/oq56lb/80_of_retail_trades_do_not_affect_the_price_at_all/",
    "score": 2608,
    "selftext": "According to Q1 data from the SEC, between 80% to 95% of trades in GME after the January sneeze is \"Odd Lot\" trades. Odd Lot is trades under 100 shares. This is usually seen as a sign of heavy retail involvement, no surprises there.\n\nThe data is available here at [SEC Market Structure Data Downloads by Individual Security](https://www.sec.gov/opa/data/market-structure/marketstructuredownloadshtml-by_security.html)\n\nu/jsmar18 made a good visualization of it in this DD named [Odd Lots Show that GME Interest is Not Subsiding](https://www.reddit.com/r/Superstonk/comments/nar8dc/odd_lots_show_that_gme_interest_is_not_subsiding/)\n\nHowever, Odd Lots have another effect that honestly f\\*cks retail investors in the ass. From FINRA's FAQ on [Market Transparency Reporting, Section 310](https://www.finra.org/filing-reporting/market-transparency-reporting/trade-reporting-faq#310), A310.3 we find this little beauty:\n\n>\"odd lot transactions do not update the high, low and last sale price for the security\"\n\nYes, you read that right! 80-95% of trades in GME have absolutely no effect whatsoever on the price. Interest from retail, because we deal with smaller lots than 100 shares, has no effect. The rules of Supply and Demand are suspended because of... rules.\n\nWhat's even worse is that odd lot trades done in ATS (dark pools) might not even make it onto the consolidated tape. What? It needs some more digging, but in this paper called [Alernative Trading Systems: Description of ATS Trading in National Market System Stocks](https://www.sec.gov/marketstructure/research/ats_data_paper_october_2013.pdf) on top of page 10, it says:\n\n>This subsample also excludes trades of less than 100 shares (which are generally not required to be reported to the consolidated tape)\n\nOne can only presume it doesn't need to be reported because it doesn't affect the price anyways. Can maybe wrinkly brains comment since it seems to be an established truth that all trades have to be reported within 10 seconds.\n\nSo, I for one feel that #DarkPoolAbuse trending on Twitter is more than deserved. Seems retail has everything stacked against us, but we'll still win. Apes together strong.",
    "title": "80%+ of Retail Trades do NOT affect the price AT ALL",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oq56lb/80_of_retail_trades_do_not_affect_the_price_at_all/"
}