{
    "author": "Cuttingwater_",
    "created_utc": 1616456575.0,
    "distinguished": null,
    "edited": 1616503067.0,
    "id": "mb18u2",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_mb18u2",
    "num_comments": 445,
    "permalink": "/r/GME/comments/mb18u2/definitive_proof_that_gmes_price_has_been/",
    "score": 10359,
    "selftext": "Hello my fellow Apes 🦍🦍🦍,\n\nFor anyone with any lingering doubts about GME price being getting manipulated prepare to have your 🦍🧠🤯.\n\nI am going to show some fairly definitive proof, using a measure called **'On-Balance Volume'** which will show that all the downward price pressure has been with EXTREMELY minimal volumes.\n\nYou apes don't only have 💎✋ BUT ARE ALSO BUYING THE DIPS because total net buying volume has net INCRASED since January!\n\nFor me personally, this was the final piece of evidence I needed to feel certain about where this stock is going. 🚀🚀🚀\n\n&#x200B;\n\n\\---------- **BOILERPLATE:**\n\nI still know nothing, I can't do math good. PLEASE don't listen to me! Obligatory 🚀🚀🚀\n\n**TLDR: Price drop from Jan 29 to Feb 4 was done with almost no net negative buying pressure (very low share volumes). Proof that 🦍 are💎✋ AND are buying the dips! Overall positive buying pressure has only increased since January. 💎✋🚀🚀🚀**\n\n&#x200B;\n\n**---------- On Balance Volume (OBV)**\n\nBefore I 🤯 your mind, here is what **OBV (On-Balance Volume)** is all about:\n\n&#x200B;\n\n>On Balance Volume (OBV) measures buying and selling pressure as a cumulative indicator, adding volume on up days and subtracting it on down days.\n\nOn Balance Volume (OBV) line is simply a running total of positive and negative volume. A period's volume is positive when the close is above the prior close and is negative when the close is below the prior close.\n\n>The absolute number of the OBV does not matter, what does is the relative height of the line over time.\n\n**Rising OBV reflects positive volume pressure that can lead to higher prices.** **Conversely, falling OBV reflects negative volume pressure that can foreshadow lower prices.**\n\nThis means, that if we see a significant decline in share price, we should also see a decrease in OBV line at a similar magnitude.\n\nFor my fellow 🤓, here is the equation:\n\n&#x200B;\n\nhttps://preview.redd.it/x2rdy831yno61.png?width=773&format=png&auto=webp&s=618e906593350ce0dda3582350de0b40001c05b5\n\n**---------- Examples of share price following OBV**\n\nBelow I have 5 examples from other companies (AMD, Tesla, Cineplex, Royal Caribbean, Canopy) and all of them have OBV lines that very nicely go along with the share price.\n\nNote: All data from TradingView (awesome app btw) and Period set to 1 day.\n\n**This is what the relationship between OBV and price should look like.** In fact, the whole purpose of the OBV is that it actually can show when a price is about to move in a certain direction as you can see the spikes in OBV are all 1 to 2 periods before the share spikes.\n\n&#x200B;\n\nhttps://preview.redd.it/4eab8zsrtno61.png?width=588&format=png&auto=webp&s=dba059fa5fe898892115b4d4cb985338cd52dbec\n\n**---------- GME: When Share price doesn't follow OBV**\n\nAnd now let's get to GME.\n\n[Link to my TradingView so you can see the data live](https://www.tradingview.com/chart/Pseqbe9R/)\n\nhttps://preview.redd.it/86g5hrduvno61.png?width=786&format=png&auto=webp&s=b361870079f8ead02585bbd11d2969f546e69725\n\n* Here you can see huge positive buy pressure from Jan 12 to 27, increasing by 462% with a share price increase of $305 ([VWAP - volume weighted average price](https://www.investopedia.com/terms/v/vwap.asp#:~:text=The%20volume%20weighted%20average%20price%20(VWAP)%20is%20a%20trading%20benchmark,and%20value%20of%20a%20security)).\n* Then the share price dropped by $264 (80%) from January 29 to Feb 4. If this was a real drop (i.e. people were actually selling their shares), we would expect a relative decrease in the buying pressure, however we only see it go down by 9%! 🤣🤣\n* When GME spiked in February, it actually gained more total positive buying pressure and surpassed the previous high point set on January 27!\n* It has only gone higher since. **On March 10 & 12, we were at the highest level, 25% higher than January** and even today, we are still 17% higher. This is also important because it showed that not much extra buy pressure was required to bring the price up from $40 to $300\n\n**THIS AS CLOSE AS YOU WILL GET TO PROOF OF 💎✋! Almost no one actually sold during this period, or we would have seen a huge increase in negative buy pressure.** If you just looked at the OBV, you would think that the stock price should be around $450-500\n\nThe **red line is what I think the OBV SHOULD look like for the current stock price.**\n\n**Note: This observations is true if you set the period to 1 week, 1 day,  4 hours, 3 hours, 2 hours and 1 hour**\n\n\\---------- **TLDR**\n\n**TLDR: Price drop from Jan 29 to Feb 4 was done with almost no net negative buying pressure (very low share volumes). Proof that 🦍 are💎✋ AND are buying the dips! Overall positive buying pressure has only increased since January. 💎✋🚀🚀🚀**\n\n**Stake:** Shares in GME\n\n[This is an update to my previous post on OBV and I have had several people ask for an update.](https://www.reddit.com/r/GME/comments/m6fjld/the_ultimate_fud_killer_definitive_proof_that/)\n\n&#x200B;\n\nhttps://preview.redd.it/q4nc9gjdroo61.png?width=400&format=png&auto=webp&s=d04e72b2a5ae4d047811394027a08dfeab1694e0\n\nOMG Apes! You did it:\n\n&#x200B;\n\nhttps://preview.redd.it/wo6fxmw0wro61.png?width=600&format=png&auto=webp&s=ce8f0cb4157091effa6af7c28bb6aff6c46ca7c7\n\n&#x200B;",
    "title": "Definitive proof that GME's price has been artificially deflated, that apes are💎✋ and that total buying pressure has actually INCREASED by 24%! This rocket is ready to pop! 💎✋🚀🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mb18u2/definitive_proof_that_gmes_price_has_been/"
}