{
    "author": "WardenElite",
    "created_utc": 1616417876.0,
    "distinguished": null,
    "edited": 1616459877.0,
    "id": "mamxp0",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mamxp0",
    "num_comments": 419,
    "permalink": "/r/GME/comments/mamxp0/live_charting_for_3222021_predicting_the_days/",
    "score": 8877,
    "selftext": "**This is not financial nor investment advice. These are ideas and opinions for information purposes only.**\n\n*This post will read bottom to top. It's easier for people to refresh the page and see edits at the top*\n\nI changed my Twitter handle to [**https://twitter.com/warden\\_elite**](https://twitter.com/warden_elite)\n\nHere is my YouTube. [https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM\\_g](https://www.youtube.com/channel/UCZDDUjJl54h9UidiwVotM_g)\n\n**If you want to support me, check my Reddit profile bio. I appreciate you guys!**\n\n&#x200B;\n\n# Will I do an earnings call stream? No. Sorry but I need peace and quiet to interpret the call. I will still accept questions on Kofi (Check my profile for details). I will answer your questions on Kofi in near realtime as the earnings call is going on. Thank you!\n\n**Edit 14 4:03PM:**\n\n# UPDATE, I WILL BE STREAMING WEEKLY ON MONDAYS. SAME TIME 9:15PM EST.\n\n**Edit 13 4:00PM:**\n\nGreat finish! Last minute buying spike helping us end around 194. Nothing too crazy, volume was still low. Good day overall! Still on schedule following the 172 diagonal.\n\nhttps://preview.redd.it/dq7hdsi8ymo61.png?width=2132&format=png&auto=webp&s=b1826bacf17b99ac86649171e4420bb4b8c44d19\n\n**Edit 12 3:25PM:**\n\nB more likely.\n\nhttps://preview.redd.it/mgcvn78wrmo61.png?width=2142&format=png&auto=webp&s=7fd82ede7990ce1303ff5d3cdffc14ff2eb82f36\n\n**Edit 11 3:18PM:**\n\nPower hour kicked in, not much action yet. Volume hasn't really picked up.\n\n**Edit 10 2:48PM:**\n\nStill low volume, expect sideways for now until volume ramps up.\n\nhttps://preview.redd.it/16b7rrpclmo61.png?width=2135&format=png&auto=webp&s=fa9f724a1be198d9a06cec22969b1bfd8f369e6a\n\n**Edit 9 2:42PM:**\n\n# I'm going through my Kofi now to answer questions. Sorry, I have a lot of messages to go through. Please check your Kofi if I have responded to you.\n\n**Edit 8 2:32PM:**\n\n**Will I do an earnings call stream?** No. Sorry but I need peace and quiet to interpret the call. I will still accept questions on Kofi (Check my profile for details). **I will answer your questions on Kofi** in near realtime as the earnings call is going on. Thank you!\n\n**Edit 7 2:28PM:**\n\nVolume still low. Nothing too interesting. Checkout my stream btw!\n\n**Edit 6 2:16PM:**\n\nJust to help you guys understand the state of the play, and to recap the stuff that got accidentally deleted, **we are hugging the diagonal support for most of the day. Mostly trending sideways. Volume is extremely low.**\n\n**Edit 5 2:14PM:**\n\nReverting to the mean. Snapping across VWAP\n\nhttps://preview.redd.it/tvzilgx4fmo61.png?width=2139&format=png&auto=webp&s=34ea234d019a2c5a865c3c8ae32c3074ec114214\n\n**Edit 4:**\n\n**I will not be streaming again for a bit. Just need to take a break :D Takes a lot of time to set everything up.**\n\n**I got a test Tuesday so I may not do my daily post. Sorry, midterms week!**\n\n&#x200B;\n\n# The bottom half of this post was messed up. Sorry IDK what happened. Edits 1-3 disappeared and so did my intro :P Nothing much happened in those edits anyways. Checkout my below video! Just finished the stream a couple minutes ago.\n\nhttps://preview.redd.it/u0kzd68thmo61.png?width=2560&format=png&auto=webp&s=1849ee5048283378c17f3a4a467a2ce09431427f\n\n**Anyways, link to livestream:** [https://www.youtube.com/watch?v=MxT8bp4qBjk&ab\\_channel=WardenElite](https://www.youtube.com/watch?v=MxT8bp4qBjk&ab_channel=WardenElite)\n\n&#x200B;",
    "title": "Live Charting for 3/22/2021, predicting the day's price action in detail with Warden. THE ENDGAME EXPLAINED. LIVESTREAM EDITION!",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mamxp0/live_charting_for_3222021_predicting_the_days/"
}