{
    "author": "DigitalSoldier1776",
    "created_utc": 1616397825.0,
    "distinguished": null,
    "edited": 1616488915.0,
    "id": "mahlmy",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mahlmy",
    "num_comments": 261,
    "permalink": "/r/GME/comments/mahlmy/repost_due_to_dd_deletion_of_my_original_post/",
    "score": 9480,
    "selftext": "Make sure y'all all start using this by just commenting the user link on your post My post is already getting downvoted or having upvotes removed 10 minutes after posting: [u/L2DBot](https://www.reddit.com/u/L2DBot/)\n\nMany people were not able to see my original comment..this one here.  I made a comment about that occurring and that I didn't understand it but its now hidden by negative votes.\n\n***So to start, and this should be fairly brief, here's the original post link about the iBorrowDesk report and of course far more info as well:***\n\n[https://www.reddit.com/r/GME/comments/ma19v7/theres\\_multiple\\_fundamental\\_market\\_disconnects\\_in/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/ma19v7/theres_multiple_fundamental_market_disconnects_in/?utm_source=share&utm_medium=web2x&context=3)\n\n***Link to iBorrowDesk for GME:***\n\n[https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)\n\n***Before you read or after, doesn't matter, just look at the fee graph and i think we can see the waves shrinking in terms of short fees because the amount of money needing to keep it at those levels is fucking significant. The waves are only going to get smaller.  They put too much into the first wave to save themselves from the outcome.***\n\nYou've seen the iBorrowDesk image, now look at my hand written DD that i graphed on another separate post (not now, come back to it):[https://www.reddit.com/r/GME/comments/m7glq3/so\\_ive\\_spent\\_over\\_an\\_hour\\_doing\\_this\\_and\\_i\\_hope/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/m7glq3/so_ive_spent_over_an_hour_doing_this_and_i_hope/?utm_source=share&utm_medium=web2x&context=3)\n\nEdit: You can also just skip that and go straight the graph I made with those percents compared to GME daily close for ALL YTD days:\n\n[https://www.reddit.com/r/GME/comments/m861o4/so\\_last\\_night\\_i\\_posted\\_my\\_calculation\\_of\\_daily/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/GME/comments/m861o4/so_last_night_i_posted_my_calculation_of_daily/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nAs I was staring at the fee line graph and looking at the amazing fee at some points in time, the dates really started standing out.  Exactly on March 24th, 2020, the short interest borrow fee was at 101%.  Why does this date stand out to me?  1 single reason, the short positions were IMO set up over a year in advance and this year on ***March 24th?  That's the day after the GME earnings report this year***..Notably after this in March, the graph spikes in April and May far higher than March 24th.  ***Speculation:  We can look to the past in the borrow fee to this year and watch the bleeding live.  No date predictions on a squeeze(WHICH I CANT WAIT TO FUCKING SEE GENTS AND LADIES!!), I just think this week is going to be exciting and I like the Stonk!***\n\nEdit: I forgot to add that March 9th was the 2020 earnings for GME\n\n**The Short Interest Fee Graph looks like a reverse Elliot Wave**\n\n&#x200B;\n\n***My Probability calculator from Fidelity on Active Trader Pro has consistently been aiming GME well into the 5 figures on share price in May, and I've been racking my brain trying to figure out how this is being automatically generated and why.***\n\nWhy when GME price goes up and down, no matter what, the ***future price top end*** keeps staying in the 5 figures.  when GME hit $350 the calculator already had GME over $22,000 a share the day before...this has to be the ABSOLUTE BARE MINIMUM.  Why?  Because that number has to be calculating if every share that needed to be covered was bought all consecutively..idk though, your guess is as good as mine on that.  I hope somebody else can shine a brighter light on this for us Apes!\n\n***Now here is what I referred to as being speculative.***\n\nI know that Melvin Capital had listed 6,000,000 in Puts on GME as of their Feb 16th SEC filing on their holdings.  Where's the speculation at you ask?  So as I look at the options table on Yahoo Finance, for weeks mind you, I notice there are all kinds of PUT OPTIONS well below any price a reasonable person would be betting on.  Even if you got paid to place the puts on $GME being under $5 when would you have done that...last year?  It certainly wouldn't have been anytime recently.   Once I saw a Put Option in Feb or March and the Strike was at like $2-3 and it said 60,000 open interest, it ***(Melvins Short position hidden in plain sight as a worthless Put option)*** clicked to me.  The hedges who have shorted GME to the Marianas Trench are so greedy, they mirrored their short positions with puts around the same prices.  We might not have to guess what the short positions are, we can look at the Put Options.  Speculation at best, but the numbers lining up so well and being so massive, nobody in their right mind would have ever thrown so much money away like that.\n\nEdit 2: I have a pinned post on my profile that is a screenshot of these 6,000,000 in puts on GME from Melvin:\n\n[https://www.reddit.com/r/WallStreetbetsELITE/comments/lw0cky/either\\_melvin\\_lied\\_about\\_closing\\_position\\_ms\\_in/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/WallStreetbetsELITE/comments/lw0cky/either_melvin_lied_about_closing_position_ms_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\nEdit 3:  If you've made it this far reading, I suggest you watch the entire Superbowl Halftime show by MJ.  DFV tweeted the image of him Holding where he stood still for 3 minutes.  the whole video is a message to me and its great.  If you can sit there and watch MJ hold for 3 minutes while everyone continues to cheer..then you're an ape and thats the exact feeling we all have, nonetheless in this halftime show, it was a point to show we're all in this together no matter what our differences are [https://www.youtube.com/watch?v=nBkNQZ-6QHg](https://www.youtube.com/watch?v=nBkNQZ-6QHg)\n\n&#x200B;\n\nLet me tell y'all a little secret.  Melvin and Friends have to pay people to run fear campaigns and smears against GME, Reddit etc.  Imagine the money they have to put into this.  Now compare to the hedgefunds on our side of the coin..do they need to pay for campaigns to drive the price up?  Of course not. Why?  Because look at all the happy investors who love nothing more than to advertise for free!  We outnumber them in terms of man power.  We win by keeping this relevant across the internet!!!  ***Think Pop---Eyes and their chicken----sandwich!!***\n\nTl;dr In short, I like the stock, I bought at $44.50 after DFV made his legendary statement and double down of 50,000 shares.$GME go brrrrrrrrrrrrr\n\nFYI I have a support line at $188 or so, stay calm 💎💎🍗🍗🚀🚀\n\nThese lines made me fixated on the artificial volume My Support Lines here are based on where I think Artificial Volume caused the price to drop down from $508 to $160 or so, check the date on the post and look at the 10 day chart:\n\n[https://www.reddit.com/r/WallStreetbetsELITE/comments/m34o55/you\\_guys\\_these\\_supportresistance\\_lines\\_based\\_on/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/WallStreetbetsELITE/comments/m34o55/you_guys_these_supportresistance_lines_based_on/?utm_source=share&utm_medium=web2x&context=3)",
    "title": "REPOST DUE TO DD DELETION of my Original Post .....Disclaimer: This is not a date prediction for ridiculous upward price action. But I believe that the hedges bleeding has been under our noses this whole time on iBorrowdesk. This will be a mix of others' DD info plus a little speculation. No images",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mahlmy/repost_due_to_dd_deletion_of_my_original_post/"
}