{
    "author": "idLogger",
    "created_utc": 1624554894.0,
    "distinguished": null,
    "edited": 1624629667.0,
    "id": "o75dt4",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o75dt4",
    "num_comments": 168,
    "permalink": "/r/Superstonk/comments/o75dt4/dark_pool_not_required_market_markers_can_control/",
    "score": 2655,
    "selftext": "u/atobitt u/redchessqueen99 u/rensole u/pinkcatsonacid u/criand u/mcuban u/deepfuckingvalue u/dlauer **Market markers maybe using the “riskless” principal because MM controls majority of the trades and has the ability to see Payment for Order flow including limit orders. MM just needs to group all orders on buy sides and never report transaction on** u/dlauer **“10 sec” tape. Here’s the references from FINRA rule.** \n\n[**https://www.finra.org/filing-reporting/market-transparency-reporting/trade-reporting-faq**](https://www.finra.org/filing-reporting/market-transparency-reporting/trade-reporting-faq)\n\n**Q102.2: Does the 10-second reporting requirement apply to the submission of non-tape reports to FINRA?**\n\n**A102.2:** No. Members are not required to submit non-tape reports to FINRA within 10 seconds of trade execution; however, regulatory reports generally are required to be submitted within specified time frames. For example, members must submit the non-tape report for the offsetting \"riskless\" leg of a riskless principal transaction as soon as practicable after the offsetting leg is executed, but no later than the time the FINRA Facility closes for the trading day. See [NTM 00-79](https://www.finra.org/industry/notices/00-79) (November 2000). However, to qualify for the exemption from the requirements of Rule 5320 (Prohibition Against Trading Ahead of Customer Orders) for riskless principal transactions, a member must submit, contemporaneously with the execution of the facilitated order, a non-tape report reflecting the offsetting \"riskless\" leg of the transaction. See Rule 5320.03. For purposes of this exception, \"contemporaneously\" has been interpreted to require execution as soon as possible, but absent reasonable and documented justification, within one minute. See NTMs [95-67](http://www.finra.org/ntm/95-67/) (August 1995) and [98-78](https://www.finra.org/industry/notices/98-78) (September 1998).\n\nNon-tape reports that are submitted for regulatory transaction fee purposes under Section 3 of Schedule A to the By-Laws must be submitted by the end of the reporting session for the FINRA Facility. See Rules 7130(c), 7230A(g), 7230B(f) and 7330(g).\n\nClearing reports must be submitted to the FINRA Facilities in conformance with the trade reporting rules, as well as all applicable rules of other self-regulatory organizations, including the rules of the National Securities Clearing Corporation (NSCC) requiring that locked-in trade data be submitted in real time and prohibiting pre-netting and other practices that prevent real-time trade submission. See DTCC/NSCC Important Notice A#7663, S#7333, dated January 7, 2014.\n\n**Q100.7: What is a \"non-tape\" report (also referred to as a \"non-media\" report)?**\n\n**A100.7:** A non-tape report can be either a \"regulatory\" report or a \"clearing\" report, neither of which is publicly disseminated. A regulatory report, sometimes referred to in the trade reporting rules as a \"non-tape, non-clearing\" report, is submitted to FINRA solely to fulfill a regulatory requirement (e.g., to report certain transactions subject to a regulatory transaction fee or, where applicable, to report the offsetting \"riskless\" leg of a riskless principal transaction). A clearing report, sometimes referred to in the trade reporting rules as a \"clearing-only\" report, is used by members to clear and settle transactions; information reported to FINRA in a clearing report is transmitted by FINRA to the National Securities Clearing Corporation (NSCC). Clearing reports also can be used to satisfy a member's obligation to provide regulatory information to FINRA, if applicable.\n\n***https://www.finra.org/rules-guidance/notices/00-79***\n\n**Alternative Approach To Riskless Principal Trade Reporting**\n\nAfter reviewing concerns raised by the firms, and consultation with the SEC and NASD Regulation, Nasdaq has adopted a different method for reporting riskless principal trades that can be used as an alternative to the original approach set forth in the *Notices*.3 This new approach can be utilized by both market makers, which for the first time must adhere to Riskless Principal Trade-Reporting Rules, and by non-market makers, which have been subject to the Rules for some time.\n\nUnder the alternative approach, member firms may report a riskless principal transaction by submitting either one or two reports to ACT. The first report would be required only if the member is the party with a reporting obligation under the relevant Nasdaq trade-reporting rule. The second report, representing the offsetting, \"riskless\" portion of the transaction with the customer, must be submitted by all members electing to use the alternative method for riskless principal trade reporting, regardless of whether the firm has a reporting obligation, when the firm effects the offsetting trade with its customer. This report will be either a non-tape, non-clearing report (if there is no need to submit clearing information to ACT) or a clearing only report. 4 In either case, the report must be marked with a capacity indicator of \"riskless principal.\" Because this is not a last sale report, it does not have to be submitted within 90 seconds after the transaction is executed, but should be submitted as soon as practicable after the trade is executed but no later than by the time ACT closes for the trading day (currently 6:30 p.m., Eastern Time). The effect of the new rule can be illustrated by the following examples.\n\n***Example 1***\n\nA market maker (MM1) holds a customer limit order to sell 1,000 shares of ABCD at $10 that is displayed in its quote. MM1 sells 1,000 shares to a second market maker (MM2) at $10. (MM2's bid represents proprietary interest, not a customer order.) When there is a trade between two market makers, the Nasdaq trade-reporting rules require the member representing the sell side to report the transaction.5 MM1, the seller in this transaction, reports the sale of 1,000 shares by submitting a last sale report to ACT marked \"principal.\" MM1 then fills its customer order for 1,000 shares. Under the new alternative approach, MM1 would submit either one of the two following reports marked \"riskless principal\" to ACT for the offsetting, riskless portion of the transaction:\n\n* a clearing-only report if necessary to clear the transaction with the customer; or\n* a non-tape, non-clearing report (if a clearing entry is not necessary because, for example, the trade is internalized).\n\nThis submission is not entered for reporting purposes and thus there will be no public trade report for this leg of the transaction. Because MM2 did not enter into a riskless principal transaction, MM2 does not have an obligation to submit the second report.\n\n***Example 2***\n\nBoth MM1 and MM2 hold customer limit orders: MM1 holds a marketable customer limit order to sell 1,000 shares of ABCD and MM2 holds a customer limit order to buy 1,000 shares of ABCD, both of which are displayed in the market makers' quotes. MM1 sells 1,000 shares to MM2 at $10. MM1 and MM2 then fill both of their customer orders. MM1 submits two reports to ACT—a last sale report and either a clearing-only report or a non-tape, non-clearing report—as described above. MM2 does not have a reporting obligation under the Nasdaq trade-reporting rules because it bought 1,000 shares from MM1. Therefore, it does not submit a last sale report for the transaction with MM1. However, for the offsetting transaction with its customer, MM2 is obligated to submit to ACT either a clearing-only report or a non-tape, non-clearing report marked \"riskless principal.\"\n\nSEC.gov search **“riskless”** has many issues on subject including a study by **Laura Tuttle · Senior Financial Economist at U.S. Securities and Exchange Commission** March, 2014 https://www.sec.gov/files/marketstructure/research/otc_trading_march_2014.pdf\n\n\n“Broker-dealers effect trades for customers acting in a principal, agency, or riskless principal capacity. **The capacity in which a broker-dealer acts can affect how the volume of OATS execution reports relates to the volume of trades on the consolidated tape.** Generally, a principal trade is one in which the BD trades for the firm’s own account. In an agency trade, the transaction is conducted on behalf of a customer; the BD does not own the position at any point in time. A trade can generally be classified as riskless principal when the BD acquires the position for the firm’s account with the intention of using it to fill (at the same price) a customer order it has already received. These three capacities can be similar economically but have different reporting requirements to OATS and the Consolidated Tape. For example, agency and principal trades generally require one execution report in OATS for each side, and one report to the consolidated tape per trade. **The second leg of a riskless principal trade, however, would generally have an OATS execution report for each side but no associated consolidated tape report. In view of the different ways in which a client order can be executed and their differential impact on consolidated tape volume, I interpret volume figures cautiously.** In addition, I provide detail regarding the percentage of volume being transacted as riskless principal to allow for interpretation by readers.”\n\n**Mr. Brent J. Fields Federal Advisory Committee Management Officer and Secretary Securities and Exchange Commission** Aug. 21, 2018 https://www.sec.gov/comments/265-30/26530-4268151-173129.pdf\n\n\n“We also are concerned that delayed dissemination of **block trade reports can mislead the market about supply and demand** conditions when dealers distribute the block in smaller trades whose reports are immediately disseminated. For example, if a dealer crosses $20 million in bonds from one seller to four buyers each buying $5 million on a **riskless-principal** basis, under the recommended proposal, **FINRA would delay dissemination of the $20 million dealer buy report** but would **immediately disseminate reports each of the $5M dealer sales.** The immediately disseminated reports would give the appearance of surplus buying demand and the possibility that one or more dealers have been left short facilitating this customer demand. The response to such **reports could artificially push the price of the bonds higher,** at least until FINRA disseminates the “$10MM+” dealer buy trade two days later.”\n\n**SEC** June 10, 2021 https://www.sec.gov/rules/sro/cboebyx/2021/34-92149.pdf offer to sell tax payer paid for information of Short Sale data and “riskless” principle data which could be used in market manipulation.\n\n\n“The Exchange proposes to offer Short Sale Volume data on an end-of-day and intraday basis which will be available for purchase by Members and non-Members. Specifically, the Exchange proposes to offer an end-of-day short sale volume report that includes the date, session (i.e., Pre-Opening Session,4 Regular Trading Hours,5 or After Hours Trading Session6),7 symbol, trade count, buy and sell volume, type of sale (i.e., sell, sell short, or sell short exempt), capacity (i.e., principal, agent, or **riskless principal**), and retail order indicator. The end-of-day Short Sale Volume data would include same day corrections to short sale volume.” \n\n**SEC v Citadel Cease and Desist** Janurary 13, 2017 https://www.sec.gov/litigation/admin/2017/33-10280.pdf\n\nMany wholesale market makers largely handle marketable orders on a fully automated basis, using proprietary algorithms to determine whether to execute the order, in whole or in part, as a principal (i.e., internalize, or take the other side of the trade) or whether to attempt to fill all or part of the order on a **riskless principal basis by sending orders to a variety of other trading centers, including exchanges, dark pools, and other wholesale market makers.**\n\n\n**SEC v Credit Suisse Cease and Desist** Sept. 28, 2018. https://www.sec.gov/litigation/admin/2018/33-10565.pdf\n\n\n“9. **The RES desk executed order flow on either a “principal” basis or a “riskless principal” basis.** In a principal execution, also referred to as “internalization,” RES took a proprietary position with risk by either buying from or selling to the customer. **In a riskless principal execution, RES also bought from or sold to a customer,** but RES did not take on any meaningful risk because RES, with a customer order in hand, first obtained the position in the marketplace **(e.g., by trading principally on lit markets or in a dark pool),** and then provided a corresponding execution to its customer at the same price (or better). RES executed held customer orders in one of three ways: **(i) RES traded as principal to fill the entire order; (ii) RES executed the entire order on a riskless principal basis; or (iii) RES executed some of the order on a principal basis and some on a riskless principal basis (referred to herein as “split fills”).** \n\n10. For the held orders at issue, RES did not charge customers commissions or markups, and instead sought to **profit from its principal trading.** RES considered two elements of potential profit: **(i) spread capture (i.e., capturing the difference between the bid and ask for a security at the time the order was received); and (ii) impact capture (as set forth below).** RES also considered the potential risk associated with internalizing all or part of the order. \n\n11. **The RES desk executed over 15 million held orders (over 8.5 billion shares) with a total market value of approximately $227 billion during the Relevant Period.2”**\n\n**TL;DR** 🤔💡💭 Imagine MM can see majority of volume and flow including market orders. Say bid $50.05 Ask $50.25. Market Markers can group all orders together reclassify as \"limit orders\" @$50.25. Then file “riskless” principal non-tape transaction. Meaning no record of transaction or delayed reporting. Send millions of volume plus limit orders to dark pools or not. Under this “riskless” principle only have to report by 6:30pm. \n\n**This maybe the reason why there are massive spike or decrease in volume, after hours.**\n\nOr just group the wholes days limit orders and with all the same price and classify as “riskless” and orders can disappear from tapes.\n\nTo categorize “Riskless” principal transactions can have no-tape (record) or trail of transactions or at minimal delayed in reporting until 6:30pm eastern after market hours. This can help facilitate inaccurate volume and true supply and demand pricing of a stonks, bonds, and so forth.\n\n**Citadel** received a SEC Cease and Desist in Jan 13, 2017 using the “riskless” principal.\n\n🤑 Exchange offers the sale of Short Interest Data and “riskless” principal transaction.",
    "title": "Dark Pool Not Required, Market Markers can Control Pricing w/out Orders Reported, \"Riskless\" Principal Non-Tape Classification",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o75dt4/dark_pool_not_required_market_markers_can_control/"
}