{
    "author": "QnBru",
    "created_utc": 1624777733.0,
    "distinguished": null,
    "edited": 1624823240.0,
    "id": "o8s2i1",
    "text_only": true,
    "flair_text": "☁️ Fluff  🍌",
    "name": "t3_o8s2i1",
    "num_comments": 53,
    "permalink": "/r/GME/comments/o8s2i1/unexpected_diamond_hands/",
    "score": 531,
    "selftext": "I’ve been investing since college. I took a lot of pride in taking my 2500$ and turning it into $25,000 while completing undergrad. People on campus knew me as the dude with the big boy job and “commitments.” I only told very few about my investments, sport bets, side hustles, etc… I did tell a close friend about my interest in stock market and we had convos back and forth regarding ipos(Christ on a bike did I sell Roku too soon), penny stocks, whatnot. Fast forward 3.5 years she’s in law school and I’m running a marketing department and she texts me out of the blue…\n\n In early to mid January, B (let’s call her B for sake of this post) texts me and asks me if I’m into this GameStop thing.. in the past few years, I’m paying attention to the market, banking on things like ammunition(poww), VRAY, etc… day trading to make a quick buck…\n\nI look into GME that famous Friday where after hours jumped from $64/share to like $100 something and it caught not just my attention, but attention of those in upper management within my organization. We were having our weekly lunch meeting and discussed how crazy this GameStop phenomenon is and we kicked ourselves for not getting in sooner. Me, our SVP, Sales director, CEO/CFO, and their families all bought in after hours to see what the hype was all about. \n\nB and I go back and forth throughout the weekend - Hyped about the week upcoming and what an opportunity this was. She told me to check out Reddit and join this community to see what’s going on, I didn’t even know what Reddit was at this time, but naturally made an account and joined the GME sub as well as WSB. Hell, we’ve got the whole office invested at this point. \n\nI’ve gone all in and held from $290.29 back in late January through the $40 dip where I was able to average down (thanks hedges) to a price of $60/share avg to avg up to a little over $100 now with xxx shares soon to be xxxx depending on how long this dip lasts… I may be a lurker on these subs, but I’m a huge GME guy IRL..\n\nWith all of this said, I joined the ape community as a skeptic and with very minimal knowledge regarding a Short Squeeze, but I’m 100% ape, in fact on that fin famous Sunday, I was one of the first 2,000 to join Superstonk as the FUD attack was gnarly here… \n\ntLDR:\nI’ve read the DD, I’ve YOLOd, my hands are diamond, and my tits are Jacked. See you all on the moon! Wish I had gotten in sooner when DFV saw the value, but never have been prouder to be apart of a community! \n\nP.S. the purpose for this post is: I’m a lurker and upvoter in r/GME and r/superstonk - there are thousands like me and these diamond hands have been forged! Can’t wait to have a beer with you all in the sports bar on the moon. \n🚀 🚀 🚀 🌚 💎 🙌\n\nEdit: If you haven’t read, I’m obviously not a financial advisor, but rather a hopeless GameStop Romantic. This is not Financial Advice!\n\nEdit 2: changed An abbreviation to Short Squeeze, as I would never want to offend any other ape- another beautiful thing of this community is the ability to learn from others!",
    "title": "Unexpected Diamond Hands 💎 🙌",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/o8s2i1/unexpected_diamond_hands/"
}