{
    "author": "DaBi5cu1t",
    "created_utc": 1619981759.0,
    "distinguished": null,
    "edited": 1619982390.0,
    "id": "n3d51y",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_n3d51y",
    "num_comments": 59,
    "permalink": "/r/Superstonk/comments/n3d51y/how_former_british_prime_minister_david_cameron/",
    "score": 777,
    "selftext": "Time for some quality banter.\n\nNo TLDR becasue it isn't really that long. Also no links other than the one below. We should encourage each other to do our own research. That, and I'm so giddy at the prospect of writing this I can't be arsed.\n\nAnyhoo, take a look at this post which isn't getting as much attention as it deserves\n\nhttps://www.reddit.com/r/Superstonk/comments/n37lcj/archegos_jp_morgan_goldman_melvin_sec_filinghedge/?utm_medium=android_app&utm_source=share\n\nArchegos over leveraged gets margin called.\n\nGreensill Captial were tied into Archegos\n\nCredit Suisse freezes 10 bill headed for Greensill\n\nDavid Cameron lobbied for Greensill\n\nGreensill were largest investors in Liberty Steel\n\nDavid Cameron had up to 60 million to make from Liberty Steel IF...\n\nDavid Cameron could convince UK government to save Liberty from liquidation\n\nHe failed.\n\nCameron is now looking at public enquiry (fuck all will come of it)\n\nThat above link shows Archegos was likely unloaded with debt from Melvin losing out on GME\n\nMoney moved to Cayman Islands\n\nBoom, Archegos takes the fall becasue Bill Huang is a crook and the fall guy\n\nDavid Cameron 60 mill down thanks to GME.\n\nLove it\n\nEdit: as a side note, the ham faced Etonian pig fucker was actually trying to secure public funds to prop up a private company to secure his investments. Prick.",
    "title": "How former British Prime Minister David Cameron got fucked by GME. Strap in, this is a fun one!",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/n3d51y/how_former_british_prime_minister_david_cameron/"
}