{
    "author": "khashi1",
    "created_utc": 1619958256.0,
    "distinguished": null,
    "edited": 1619985302.0,
    "id": "n35dao",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_n35dao",
    "num_comments": 300,
    "permalink": "/r/Superstonk/comments/n35dao/the_importance_of_education_i_have_learned_more/",
    "score": 9032,
    "selftext": "# \n\nhttps://preview.redd.it/1d3tfrgagrw61.jpg?width=1500&format=pjpg&auto=webp&s=48dd1a394514ae24b9dad9166f8ff676115f1edd\n\n# Apes,\n\nYou guys are impressive.  No, I mean it.  Picture this little story.  5 months ago, I heard rumors on Reddit about people buying GameStop and I rolled my eyes at it.  I did.  I watched it go up to 30 dollars a share and I finally read the DD.  I said, it's logical but it's GameStop.  I bought 3 shares then watched it climb to 40.  This is when Citron steps in and insults the Reddit community.  I've never seen a stock respond that way in all my years of trading.\n\n&#x200B;\n\nSo I buy more.  I go hard in the 300s and even bought a couple shares pre market 500 plus.   Then they shut down the buy side of trading.   Now, I've literally never SEEN that before.   I have never see any broker say, \"No, you can't buy that stock and claim it was to protect them.\"    So, I hold all the way down.  I have HUGE losses and I won't lie, I was getting a little nervous all that time in the 40s.  Then it happened.  Someone got margin called and we shot back up to into the 200s, then I watched illegal things happen.  That's when I said, this is fucking the real deal!!!   They shorted during breaker halts, they threw the kitchen sink at getting the price back down.  There was no real news that would have made GME trade that way.  If there was no news driving the price action that means FUCKERY was amuck.\n\n&#x200B;\n\n&#x200B;\n\nNormal stocks don't go up 400% in a day on no news then fall 300%.  They fucked up.   When I say they, I mean the entire system.  The DTCC, Hedge Funds, Main Street Media, SEC, & politicians all colluded to cover the truth.   That they allowed extreme greed and hubris to keep from paying the little guy.  But oh man did they FUCK UP!   I didn't give up, it made me hungry for answers.  I've spent more time reading, learning about on how things work, and eager to help.  The community is only growing and getting more allies.  Everyone knows the game was rigged but we didn't realize how badly it was rigged.\n\n&#x200B;\n\n&#x200B;\n\nThen Apes start unearthing facts like these news outlets like MarketWatch, Motley Fool, etc are fucking owned by hedge funds, institutional investors, and smart money.  The smoke and mirrors start looking super obvious.  Smart Apes start to learning how their game was played.  It wasn't that the information wasn't around, it's that most people don't seek it out.  People like Dr. T had been screaming this stuff at the top of their lungs and I never heard a peep.  It's like my eyes are open now and I can't unsee their fuckery.  Smart Apes are now breaking complex systems down for the masses and holy shit.....\n\n&#x200B;\n\n&#x200B;\n\nThese institutions have now combined knowledge, anger, and the masses; it's going to create a catalyst for change.  If they had allowed this to pop to 800 a share, I probably would have gotten out and moved on with my life.  I would have never learned how broken this system is.  The DTCC has gone on for a long time without true oversight.  This system has not evolved in years.  The SEC is a running joke.  They pay attention when they feel like it.  This creates a breeding ground for fuckery and robbing the poor to keep the rich, well, rich.\n\n&#x200B;\n\n&#x200B;\n\nIf our politicians won't make this corrupt system change for us, then we will change those politicians.  I'm starting local in the next election cycle but my goal is to get to a level that matters.  Be the change Apes.  Don't take things lying down and say, \"Well, that is just how things are.\"  We are gaining knowledge and that is power.  When you start seeing through their bullshit and spreading that knowledge, that's how you create change.\n\n&#x200B;\n\n&#x200B;\n\n# Keep Learning you beautiful Apes and go change the world!!\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nTLDR:  Blah blah, corruption.  Blah blah, Anger, knowledge, the DTCC/SEC/Hedgies created the King Kong monster of a problem by drawing this out.... now Apes are smarter and stronger.  Diamond hands were forged by blood sweat and tears.   I'm not leaving until I'm paid and changes are made.",
    "title": "The Importance of Education: I have learned more in 5 months trading GME, than the previous 30 years \"investing\". I have learned about the corruption, the lies, the deception of using media to control us \"dumb\" money. Literally, the worst thing they could have done was shut down trading in Jan!!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n35dao/the_importance_of_education_i_have_learned_more/"
}