{
    "author": "natep001001",
    "created_utc": 1624422898.0,
    "distinguished": null,
    "edited": 1624423168.0,
    "id": "o65lq6",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o65lq6",
    "num_comments": 191,
    "permalink": "/r/Superstonk/comments/o65lq6/final_warning_to_secure_your_brokerage_accounts/",
    "score": 1715,
    "selftext": "First of all, I’m not saying MOASS is tomorrow or some shit like that. Rather that things are really heating up and it could happen at any time... You don’t wanna be caught with your pants down and scramble to get things setup durning MOASS. \n\n- Get an encrypted email, and link it to your brokerages/ bank accounts. I use/ recommend Proton mail. \n\n- Turn on 2 factor authentication for brokerage/ bank accounts. \n\n- Change passwords to 16+ digits, using random combinations of letters, caps, numbers, and special characters.\n\n- Get/ turn on a VPN when browsing Reddit or clicking links for extra security. \n\n- GET THE FUCK OFF ROBINHOOD IF YOUR STILL THERE!!\n\n- Make sure margin is turned off in your brokerage accounts, and shares held in cash. \n\nHonestly, that’s all I really have but believe it could be significantly important, especially when talking about receiving potentially xx-xxx+ millions, in a time when most people will be suffering financially.   Don’t push it off.  Imagine your MOASS gains are on the line now.  \n\nLastly, this isn’t to scare anyone, more of a “better safe than sorry” situation.  If anyone has more suggestions, please post in comments as this is not a field I’m very knowledgeable in. \n\n🚀🚀🚀🚀",
    "title": "🚨 Final warning to secure your brokerage accounts before all eyes are on us apes. List of things to do below",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o65lq6/final_warning_to_secure_your_brokerage_accounts/"
}