{
    "author": "ECHOFIFE",
    "created_utc": 1624408184.0,
    "distinguished": null,
    "edited": 1624421970.0,
    "id": "o61cg2",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o61cg2",
    "num_comments": 128,
    "permalink": "/r/Superstonk/comments/o61cg2/hedge_funds_are_holding_our_country_back_from/",
    "score": 3109,
    "selftext": "I want to preface this -- I'm high and tired from work. I'm also former marine crayon-eating ape, so I'm dumb as rocks. This is my first real post on the sub that actually contributes anything valuable. Please do your own research to confirm.\n\nTLDR: The financial system is a leech on our economy and society.\n\nEDIT: fixing punctuations and typos. \n\nI saw the post about Michael C Bodson, so I decided to snoop around.\n\n&#x200B;\n\n[Mike Bodson, President and CEO of DTCC](https://preview.redd.it/l715qaqlew671.png?width=480&format=png&auto=webp&s=c542109fc03704210244463fa77391668f0adfa7)\n\nMichael Bodson is President and CEO of DTCC. Crypto posed a threat to clearinghouses like the DTCC, so the DTCC invested into Digital Asset Holdings. It's a financial company that builds products based on distributed ledger technology (DLT). The idea was that Wall Street would co-opt blockchain technology and strip crypto of its decentralize nature. ([https://www.institutionalinvestor.com/article/b1505pph2t0x7g/the-2017-tech-40-michael-bodson](https://www.institutionalinvestor.com/article/b1505pph2t0x7g/the-2017-tech-40-michael-bodson))\n\nNow let's take a look into Digital Asset Holdings.\n\nGuess who is on its Board of Directors? Michael Bodson. How do you use the DTCC to invest into a company where you sit on its board? I guess there's no conflict of interest here, so lets move along. Another interesting fact is that the CEO of Digital Asset Holdings, Yuval Rooz, is a former Shitadel employee. After his tenure at Shitadel, he went to DRW Trading Group as a Senior Algorithmic Trader.\n\n[CEO of Digital Asset Holdings](https://preview.redd.it/2dvdku6saw671.png?width=259&format=png&auto=webp&s=739780e6bfecc76524a07767da587aba2a651a53)\n\nI mentioned that Digital Asset Holdings was co-founded; so now, let's take a look at the other guy.\n\n[Don Wilson, Co-founder of Digital Asset Holding, and CEO of DRW Trading Group](https://preview.redd.it/tm8xtihqcw671.png?width=498&format=png&auto=webp&s=339061d3d6989e09f522808e0865cc7dd5f7dd16)\n\nThis dude, Don Wilson, co-founded Digital Asset Holdings... and he's CEO of DRW Trading Group. Okay, so Yuval Rooz worked for him, then went on to start a company with him, as CEO of that company? These guys sure love helping each other out with their business ventures. I wish I had friends like that.\n\nSo let's take a deeper dive into Donny.\n\nin 2018, Don Wilson was cleared in a manipulation case.\n\n>A US financial regulator has been defeated in its pursuit of Don Wilson, one of the world’s leading derivatives traders, in a stinging ruling by a judge who derided the agency for bringing a misbegotten market-manipulation case.  Judge Richard Sullivan in New York dismissed all charges against Mr Wilson and his Chicago-based trading group DRW in the long-awaited ruling, two years after he heard the case.  \n>  \n>([https://www.ft.com/content/8416eb88-f70f-11e8-af46-2022a0b02a6c](https://www.ft.com/content/8416eb88-f70f-11e8-af46-2022a0b02a6c))\n\nOkay, he got away but we all know he's a crook. Going back further, Don made huge campaign contributions to former Chicago mayor, Rahm Emanuel. An article from 2015 criticizes the former mayor and his \"Hedge Fund Flash Boys.\"\n\n&#x200B;\n\n[Rahm Emanuel, former mayor of Chicago 2011-2019, and former US Congressman 2003-2009](https://preview.redd.it/1dg5mjstow671.png?width=477&format=png&auto=webp&s=dcfa9cadbcb1e2d7df96f074953ded47c5f6e682)\n\n&#x200B;\n\n>Many of Rahm’s top contributors are heads of “high-frequency trading” funds—a murky and controversial trading strategy that is currently the subject of several class-action lawsuits.  \n>  \n>Two of the largest high-frequency trading funds in Chicago—Ken Griffin’s Citadel LLC and Donald Wilson’s DRW Trading Group— have poured over a million dollars into Rahm’s campaign.  \n>  \n>...  \n>  \n>Griffin is also reported to be a close friend of Rahm’s.  \n>  \n>Griffin — who is literally the wealthiest man in Chicago — spends much of his obscene fortune bankrolling far-right Republicans across the nation. When he isn’t stuffing cash into Republican campaign coffers, Griffin indulges in excesses on a par with the trust kings of the Gilded Age, snapping up a network of luxury homes, including a reported $135 million spread in Palm Beach, Florida and a $13.3 million penthouse at the Waldorf-Astoria in Manhattan.  \n>  \n>...  \n>  \n>Rahm’s influence in Washington must have helped: DRW and similar firms were not subjected to these regulations.  \n>  \n>And this was a good thing, because the very next year DRW Securities LLC was fined $20,000 by the Chicago Board of Options Exchange for failing to maintain capital reserves at the level of a paltry quarter of a million dollars.  \n>  \n>DRW Trading Group was also investigated by the CFTC for using high-speed trades to manipulate a reference rate that was used to calculate the value of a bet $350 million bet made by DRW. The investigation is on-going.  \n>  \n>([https://hedgeclippers.org/rahm-emanuel/#\\_ftn2](https://hedgeclippers.org/rahm-emanuel/#_ftn2))\n\nLooks like Kenny and Donny both like influencing politics, so they can keep getting richer.\n\nThese assholes all know each other and love giving each other reach-arounds. They casted a larger net over our financial system and political system, and they are bleeding us dry.\n\nI think it's obvious how much these criminals control our government. The wealth disparity is growing larger by the day. These crooks are stopping our political system from working and holding our country back from progress.\n\nI honestly do believe they made our politicians spread misinformation during the pandemic, to keep us in lockdown longer, so they could keep on shorting companies. Hurting people and businesses, just so they can make a profit. I really hope they are all held accountable at the end of all of this. I know most of them will get away, but wishful thinking.\n\nApes strong together.\n\nMy favorite ape is an orangutan, so here you go:\n\nhttps://preview.redd.it/gd6aarhhtw671.png?width=586&format=png&auto=webp&s=fd03b2877a11834f929ca037965012fdb7ab8e93",
    "title": "Hedge funds are holding our country back from progress",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o61cg2/hedge_funds_are_holding_our_country_back_from/"
}