{
    "author": "According_Bee2757",
    "created_utc": 1619692951.0,
    "distinguished": null,
    "edited": 1619703721.0,
    "id": "n11nbe",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_n11nbe",
    "num_comments": 210,
    "permalink": "/r/Superstonk/comments/n11nbe/why_a_market_crash_benefits_gamestop/",
    "score": 2713,
    "selftext": "# Part 1: Introduction\n\nHello, you horrible lot. I am back to give you another dose of that sweet confirmation bias after generally positive feedback from my post yesterday describing [Market Tops & Distribution Days](https://www.reddit.com/r/Superstonk/comments/n0htur/the_end_is_near_market_tops_distribution_days/?utm_source=share&utm_medium=web2x&context=3).\n\nI am about to take this one or maybe even two steps further and try and link this all together even more! I'm telling ya after this; you're gonna be one jacked ape.\n\n# Part 2: A Critical Analysis\n\nYesterday, you apes did what you did best. You picked some holes in my DD and asked some valuable questions, and I am not one to run away from tough questions, and I wanted to try and answer a couple.\n\n&#x200B;\n\n>u/DinoDaDon27  \n>  \n>What is the more likely scenario; The market starts crashing while GME moons simultaneously? Or will the market see a deep dive first due to liquidations of other assets and then it will carry over to a large amount of short-covering for GME?\n\n&#x200B;\n\n>u/CatoMulligan  \n>  \n>So what happens if the market has a correction or crashes before there is the MOASS? I know that with such a strong negative beta GME usually would trade contrary to the market, but what is the mechanism that would cause the GME price to go up while the rest of the market tanks? Would the tanking of the market result in widespread margin calls that would then trigger the squeeze?\n\n&#x200B;\n\nI'm just going to park these questions here and get back to them very soon.\n\n# Part 3: Even More Evidence\n\nThis short but sweet part aims to confirm that we will see a market crash in your ape minds. Yesterday I gave you one angle, but a smart ape does not only listen to a single voice of reason but multiple voices.\n\nTo that end, I have compiled multiple data points using different forms of analysis to point towards a crash.\n\n**Some External Data:**\n\n[BlackRock CEO & Frothy Markets](https://www.cnbc.com/video/2021/04/19/market-feels-a-bit-frothy-says-blackrocks-rick-rieder.html)\n\n[Warren Buffett Indicator](https://www.currentmarketvaluation.com/models/buffett-indicator.php)\n\n[Michael Burry & The Market on a Knifes Edge](https://markets.businessinsider.com/news/stocks/big-short-michael-burry-warns-stock-market-huge-risk-crashing-2021-2-1030106969)\n\n[Sven Henrich on Margin Debt](https://www.reddit.com/r/Superstonk/comments/muol3n/margin_debt_is_also_mooning_northmantrader_gives/?utm_source=share&utm_medium=web2x&context=3)\n\n[FINRA Margin Debt Graph](https://www.reddit.com/r/Superstonk/comments/muvk7p/i_see_the_margin_debt_post_got_traction_so_ill/?utm_source=share&utm_medium=web2x&context=3)\n\n[Insider Transactions Ratio](https://www.reddit.com/r/Superstonk/comments/musoiz/i_believe_were_officially_in_the_end_game_now/?utm_source=share&utm_medium=web2x&context=3)\n\n**Edit 1:** [Shiller PE Ratio](https://www.multpl.com/shiller-pe)\n\n**Some Top-Notch DD with a Load More Links at the Bottom:**\n\n[Are We](https://www.reddit.com/r/Superstonk/comments/mtistc/are_we_headed_toward_a_hypeinduced_market_crash/?utm_source=share&utm_medium=web2x&context=3)[ Headed Toward a Hype-Induced Market Crash?](https://www.reddit.com/r/Superstonk/comments/mtistc/are_we_headed_toward_a_hypeinduced_market_crash/?utm_source=share&utm_medium=web2x&context=3)\n\nNow apes, if you have clicked every single link, looked at it all, both the links posted here and the links in the DD, and you still don't believe that the market is going to be a crash at some point, then you need to try this simple magic trick.\n\n1. Hit head on the wall 4 times\n2. Re-read everything\n\nRepeat until it works!\n\n# Part 4: What Next?\n\nAssuming you have all made it to this stage without too many concussions and that we are all in agreement that there will be a market crash at some point in the future (near future, hopefully!), then we may move to the next stage.\n\nIn my ape-ish opinion, there are three potential ways that this is going to play out. Ranked from least likely (1) to most likely (3)\n\n1. Retail buying pressure increases, outside retailers FOMO in, hedge funds are margin called\n2. Daddy Cohen releases some game-changing news, acts as a huge catalyst, hedge funds are margin called.\n3. The market crashes, hedge funds are margin called\n\nThis post will discuss outcome Number 3.\n\n# Part 5: The Basics\n\nLet's discuss the bread and butter of how hedge funds borrow cash to trade with.\n\n**Leverage:**\n\n&#x200B;\n\n>Leverage is the use of borrowed funds to increase one's trading position beyond what would be available from their cash balance alone.  \n>  \n>Brokerage accounts allow the use of leverage through margin trading, where the broker provides the borrowed funds.  \n>  \n>Leverage, however, can amplify both profits as well as losses.\n\n[Investopedia Definition](https://www.investopedia.com/articles/forex/07/forex_leverage.asp)\n\n&#x200B;\n\n[Leverage does not change the outcome.](https://preview.redd.it/56pol32z23w61.png?width=960&format=png&auto=webp&s=75c1077c1263b7ec4e224bab09ad947b9021238f)\n\n&#x200B;\n\n**Margin call:**\n\n&#x200B;\n\n>A margin call occurs when the value of an investor's [margin account](https://www.investopedia.com/terms/m/marginaccount.asp) falls below the broker's required amount. An investor's margin account contains securities bought with borrowed money (typically a combination of the investor's own money and money borrowed from the investor's broker). A margin call refers specifically to a broker's demand that an investor deposit additional money or securities into the account so that it is brought up to the minimum value, known as the [maintenance margin](https://www.investopedia.com/terms/m/maintenancemargin.asp).\n\n[Investopedia Definition](https://www.investopedia.com/terms/m/margincall.asp)\n\n&#x200B;\n\n**Why this matters:**\n\nI like to keep speculation out of my DD as much as possible and enjoy working only with evidence. If we put these together, we get a very basic mechanism.\n\n1. Hedge funds are using leverage to increase potential profits\n2. Leverage can also amplify losses\n3. A margin call occurs when the value of a margin account decreases\n4. The value of a margin account will decrease because the value of the underlying securities have decreased (i.e. a market crash)\n\nLeverage + Market Crash = Margin Call\n\n# Part 6: Meet the Data\n\nSo the critics among you will say, \"yeah, well, good luck thinking that the hedge funds will be stupidly overleveraged to a point where they are extremely exposed\". In response, I give you this:\n\n&#x200B;\n\n[Leverage of up to 20:1?!](https://preview.redd.it/lkawo71z43w61.png?width=776&format=png&auto=webp&s=e0077911eee5b71561f1f447be7ea1591c6c9d44)\n\nNow I accept that in this case, this is extreme leverage, but the premise is the same, the leveraging caused a margin call which then sparked the sell-off of their stocks.\n\n**Edit 2: Average Hedge Fund Leverage**\n\n>As mentioned, hedge funds vary widely in their leverage practices. Some assets, such as certain kinds of derivatives and covered call options, are leveraged by their very nature and don't necessarily involve a huge debt position. It's not unusual for a hedge fund to be leveraged between 100 and 500 percent, however, depending on the asset class. Leverage up to 10 times is not unheard of, though that would mean that a 10 percent decline in the leveraged part of the investment portfolio would wipe out investors' equity altogether. A recent survey from the United Kingdom Financial Authority finds that the average hedge fund was leveraged about 2.5 times\n\n[Zacks Finance](https://finance.zacks.com/hedge-funds-borrow-lot-money-make-investments-1580.html)\n\n# Part 7: What Happens When a Fund is Margin Called\n\nThe process as I understand it will happen as follows with thanks to u/OnlyGoesUp\n\n&#x200B;\n\n>Day 1: HF (A) The end of the day close price is noted and margin requirements are calculated. (Example $400 close)  \n>  \n>Day 2: HF (A) The hedge fund now has to start closing failing short positions and will need to consider selling long positions (if they have any) to cover the cost of buying back shares at a rapidly increasing price. ( Example $1200 close)  \n>  \n>Day 3: HF (A), HF (B) and HF (C) Are now in a pickle and are all being margin called repeating day 2.  \n>  \n>This will go on and on until all hedge funds have been called or have voluntarily closed their shorts. When a margin call occurs, they each have up to 5 days to meet their own requirements from the initial call (and they will use as much of it as they can as they want to avoid a parabolic move up on day one).\n\n&#x200B;\n\n[FINRA confirming this process](https://preview.redd.it/s9tsaa6673w61.jpg?width=745&format=pjpg&auto=webp&s=c8c47c216c3d6946e1e0930dcd926885142d01ae)\n\n[FINRA Sauce](https://www.finra.org/investors/learn-to-invest/advanced-investing/understanding-margin-accounts)\n\n# Part 8: Putting it all Together\n\n**\\*SPECULATION TIME\\***\n\nUntil now, I have been working with evidence and facts - from this point onwards, this is my interpretation of the data that has been presented, including the order of events. This aims to answer the questions raised at the very start of this post.\n\n&#x200B;\n\n1. We will see a market crash.\n2. The value of all of the hedge funds securities will decrease as the price of stocks decrease.\n3. This will inevitably lead to the margin call of overleveraged hedge funds.\n4. The margin call will cause overleveraged hedge funds securities to be sold, further decreasing the value of other hedge funds margin accounts, leading to further margin calls.\n5. The process repeats rippling through the markets until we reach the hedge funds short on Gamestop.\n6. The hedge funds short on Gamestop can no longer maintain their margin and become margin called so they MUST cover their short positions and buy back the stock.\n7. This causes a domino effect of margin calls, and the short squeeze begins.\n\nHopefully, you will agree that very few jumps have been made during this speculation, and the thought process is logical and backed up by data.\n\n&#x200B;\n\n# Just don't fucking dance.",
    "title": "Why a Market Crash Benefits Gamestop",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n11nbe/why_a_market_crash_benefits_gamestop/"
}