{
    "author": "c-digs",
    "created_utc": 1622044956.0,
    "distinguished": null,
    "edited": 1622055624.0,
    "id": "nlkif6",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_nlkif6",
    "num_comments": 227,
    "permalink": "/r/DDintoGME/comments/nlkif6/the_market_is_not_red_this_is_not_the_squeeze/",
    "score": 1503,
    "selftext": "Something is throwing me off about this rally.  I know many apes are in an excited state given the long stretch of sideways trading and I don't want to damper anyone's excitement, but this surge feels *off*.\n\nI hope some folks give this some thought so that we can think through how this will unfold and how to interpret events over the next few days.\n\n1. I would have expected that as GME (and other meme stocks) shoot UP, that the market should go DOWN since the shorts should be moving their capital towards buying up shares.  VXX, SQQQ, and VIX should all be shooting up.  What we are seeing is a bit unexpected to me.\n2. My conjecture is that the red days in both the market and crypto the two weeks leading up to this week was an act of capital accumulation to execute some level of covering of FTDs and perhaps some smaller shorts may be exiting their positions this week.  Even the OCC memo on the 5/17 raising the Clearing Fund by $588m is part of this capital accumulation.\n3. I think that with this FTD cycle, they have exposed their hand that ***the shorts have not covered***, but I think that there is a plan in place to keep kicking this down the line by the fact that the market is not red.  In other words, they've calculated how much capital is required to withstand this FTD cycle and extracted that capital over the last few weeks and now, because the risk exposure is ***defined*** for this FTD cycle, the market is green despite the fact that GME (and other meme stocks) are exploding and should be pulling capital from the market.\n4. Coupled with u/AlexanderHood's [May 26th Update on the Married-Put Forensic Analysis - Shorts all the way down](https://www.reddit.com/r/Superstonk/comments/nl90c5/may_26th_update_on_the_marriedput_forensic/), my conjecture is that this is **not the squeeze** and has all been planned to hold out for more time.  They are still creating irrational puts to carry FTDs.\n5. We can also anticipate that it is likely they already have the tools, backdoor agreements, and strategies in place to prevent uncontrolled price movement (e.g. get ready for shutdowns, disappearing buy buttons, and system outages).  The late nights by banks around the world that we've been observing and the SEC closed-door meeting may have been in preparation of the capital accumulation and coordination for this week.\n6. There is an incredible symmetry to the days on March 4 - 9 (see below) but with far less volume\n7. With this, we can anticipate that perhaps we will see a return into a more stable price once this FTD cycle once again kicks the can down the line.\n\n[March 4-9 surge versus current surge.](https://preview.redd.it/qoe01mzlmh171.png?width=1630&format=png&auto=webp&s=0523cddb8d4f40b90a95290188469d5bf4ccec4e)\n\n[iBorrowDesk showing that Interactive Brokers still has the borrow fee at 1&#37;](https://preview.redd.it/jd81msikii171.png?width=352&format=png&auto=webp&s=9aa17da8af4369c191e311a9ca16328a8cdc7d26)\n\nWould love for other folks to chime in and provide some thoughts and counterpoints so that we can better understand if this is indeed the start of the squeeze or just \"Yet Another FTD Cycle\".\n\nMy secondary goal is to uncover other avenues of due diligence and ideas to explore to see if we can find data that explains the market activity leading into and including this week.\n\n**Edit**: [Then we have this Tweet from Ihor Dusaniwsky that mentions S3 rating GME and AMC 10/10 for a short squeeze](https://www.reddit.com/r/Superstonk/comments/nlkrke/confirmation_bias_tits_jacked/).  Definitely the sense that some fuckery is afoot.",
    "title": "The Market is Not Red; This is NOT The Squeeze",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nlkif6/the_market_is_not_red_this_is_not_the_squeeze/"
}