{
    "author": "Which_Stable4699",
    "created_utc": 1615168475.0,
    "distinguished": null,
    "edited": 1615213154.0,
    "id": "m053rh",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m053rh",
    "num_comments": 133,
    "permalink": "/r/GME/comments/m053rh/dtcc_thoughts/",
    "score": 592,
    "selftext": "Hi my fellow apes, I just wanted to quickly talk about the new DD that was posted today about the DTCC. Let me start by saying I was already bullish AF on GME. I'm not a whale by any stretch of the imagination, but I do hold a sizeable position and will be adding more Monday. That said, lets talk about the new DTCC rules. Here is my take:\n\nIt looks to my like these HFs are clearly looking at bankruptcy as the result of their previous placed shorts against GME. The only way this changes is if a miracle happens and in order for this to have even a chance of occurring they need time, a lot of it. The plan to gain time has largely been continuing to short driving the price down, essentially doubling down on their bets (possibly tripling or quadrupling). They do this because basically things cannot get any worse for them than bankruptcy and the next entity in the chain of responsibility will be the one to end up paying for these new positions. Time also gives the owners and employees more time to milk money out of their respective companies via bonuses, paychecks, etc. I guess one could argue they may have an unrealistic plan to get out by attrition of apes deciding to sell at a loss over time while keeping the price low, but lets leave that be for now.\n\nNow the DTCC, who in all likelihood has far greater transparency into this situation than us apes, now steps in and puts into play new rules that would strike fear in the hearts of HFs. Why? Well it seems they believe that by letting them continue to dig this hole, the likelihood of the DTCC having to cover their losses has increased to an unacceptable level. It seems the DTCC has come to the conclusion that these shorts are wagering with someone else's money (DTCC,s), so they decided to basically severely limit their means to do so, and thus their ability to delay MOASS. Now I firmly believe several factors are playing a part in DTCC's risk assessment here: clear long interest from whales, the return of retail buying power via tax returns and stimulus, potential share recall, potential stock split (forward or reverse), possible boomer interest from them losing control of the MSM narrative.\n\nI spent the majority of the day trying to figure out an angle where this new rule hurts the MOASS narrative and have so far come up empty. This rules seems aimed at self preservation and towards making sure the people who caused this situation bear the brunt of the economic losses. Beyond that, this seems to infer an intent to allow this to play out to it's natural conclusion given the existing rules of the market. In my opinion, government intervention to save the hedge funds from MOASS was always the biggest risk, though not the most likely for a number of political and economic reasons. It looks like this threat is being taken off the battlefield, which is amazing for us apes. Now if this gets too out of hand, 100k/share+ they may reassess that stance but I think they assume this can be wrapped up in a bow for far less on the majority of shares. It is not my intent to tell anyone what they should or shouldn't sell for, if some of us get 10m/share \"Power to the players\" I am simply giving my own smooth brained outlook on at what point this piece may be returned to the battlefield.\n\nFinally, I don't think any of us who have been on this ride believe that there is not a massive fucking short problem, however it is always possible to be wrong even if the math checks when you have at best incomplete or manipulated data to work with. The second rise to $200 after the initial hype died out was the first factual reassurance that there is both still a huge short problem and that the majority of apes have continued to diamond hand GME, in fact I believe we have gobbled up far more shares in the interim. Continued investment post hype was unexpected behavior to the HFs and I don't think they know how to deal with a individual investors who buy the dip, buy the rise, and never sell. The recent large purchases of ITM options and big money pushing up the price also seems to reaffirm our narrative is based in reality. The DTCC rule change is yet more reassurance that the best is yet to come.\n\nI encourage any comments critical of what I have put forth. If there is a logical counterpoint on this new DTCC rule, I want to hear it. And with that my fellow apes, I shall take my leave of you.\n\n**TL:DR** (courtesy of u/Grand_Barnacle_6922):  u/Which_Stable4699 \"read the DTCC rule changes and reread it; it seems like DTCC wants  to Cover their own ass and make HFs front money in case they blow up.\" Great summation, one slight correction ... I can't read.\n\nI am currently invested $250k in GME, starting in the upper $200s lower 300 range then more in the during the drop to $40, and finally some more at $150. Monday I plan to drop an additional $150k, bringing me to $400k total investment. This is all hard cash and while I briefly saw green before my $150s purchase, this has been straight red for me since pretty much day one. Once I pick up the new shares I'll up date this with a link. I know placing our positions is discouraged, however I buy in absence of rhyme or reason and will sell at the fucking moon, Melvin.\n\n**\\*\\*\\*Edit\\*\\*\\***\n\nWell it turns out I don't quite have 400k in GME, \\~23k in other positions. Due to the pre-market this morning there is a bit of green though. In any case, as promised [https://www.reddit.com/r/wallstreetbets/comments/m0ggt0/yolo/](https://www.reddit.com/r/wallstreetbets/comments/m0ggt0/yolo/)\n\n\\*\\*\\*Edit 2 \\*\\*\\*\n\nApparently not only can I not read, but am also not good with the math. The options brings the total YOLO to $413k. Stay diamond handed my apes!",
    "title": "DTCC Thoughts",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m053rh/dtcc_thoughts/"
}