{
    "author": "renz004",
    "created_utc": 1616726374.0,
    "distinguished": null,
    "edited": 1616767468.0,
    "id": "mdeute",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mdeute",
    "num_comments": 121,
    "permalink": "/r/GME/comments/mdeute/for_the_short_squeeze_to_start_sooner_a_smart_ape/",
    "score": 2751,
    "selftext": "*Notice: Updated DD is added to bottom of this post - last updated 03/26/21 10:02am*\n\n[Citadel Vs Smart Ape Vs Blackrock](https://preview.redd.it/31bsfao3qap61.png?width=719&format=png&auto=webp&s=8327b1780b3a35ba0440dcd716891d5b3708212e)\n\n \n\n\\--------------------------\n\n**DD used:** Live Charting for weekly price targets, King Kong for Hedge history\n\nWarden Elite's Live Charting\n\n[https://www.reddit.com/user/WardenElite/](https://www.reddit.com/user/WardenElite/)\n\nKing Kong: Magnum Opus DD (posted on behalf of Wuz)\n\n[https://www.reddit.com/r/GME/comments/md89wg/king\\_kong\\_magnum\\_opus\\_dd\\_posted\\_on\\_behalf\\_of\\_wuz/](https://www.reddit.com/r/GME/comments/md89wg/king_kong_magnum_opus_dd_posted_on_behalf_of_wuz/)\n\n\\--------------\n\n**Theory**\n\n**-=Citadel VS Blackrock =-**  \n\\-Citadel's strategy is to try to outlast retail's interest in GME by pushing the share price down continuously (whether shorting the stock directly or through ETFs). Citadel plans to profit on the way down by using Put Options so that it can ultimately survive the mess it has found itself in. Citadel has also been trying to insure itself in case of a short squeeze by placing very high OTM Calls as well.\n\n\\-Blackrock's strategy has been to identify the strike price that Citadel has been placing the majority of its Puts weekly, and then pushing the share price above that number. Blackrock is also being careful not to push the price higher than it has to so that none of the sky-high OTM Calls made by Citadel get triggered. Why doesn't Blackrock just push the share price past Citadel's Call strike prices and start the squeeze now? Because Blackrock doesn't want to risk the chance of Citadel surviving the squeeze.  \nThe goal of Blackrock's strategy is to bleed Citadel to the point that they will absolutely be liquidated in a short squeeze. Blackrock will push the GME price to the squeeze only if it knows for sure Citadel will not survive so that it can buy up all the shares in all the markets that Citadel once held. Blackrock will be buying up all of Citadel's liquidated positions because they will be at bargain prices. Otherwise, Blackrock can remain in a position of dominance over Citadel indefinitely for as long as the threat of a squeeze exists.  \nTLDR: Blackrock wants to use Citadel like a loot pinata.\n\n**-=Smart Ape=-**  \nSmart Ape knows all hedges are greedy and only care about making money.  \nSmart Ape knows hedges read these boards because we have very good DD.  \nSmart Ape knows buying and holding will \\*eventually\\* force a squeeze to happen, regardless if Blackrock decides to initiate it or not.\n\nBut, Smart Ape wants the squeeze to come sooner.  \nSmart Ape thinks the squeeze would happen sooner if Blackrock believes with certainty that it can bankrupt Citadel during the squeeze. Smart Ape knows Blackrock will deliver the killing blow on Citadel by pushing the price up to the squeeze if Citadel has lost lots and lots of money leading up to it. Smart Ape believes Blackrock will let the price go to the moon during the squeeze for maximum pain on Citadel until it dies. Smart Ape thinks Blackrock is probably spending lots of time trying to deduce weekly what price point would be the maximum pain for Citadel's options to end up OTM.\n\n\\------------------------  \n**Strategy**  \n**\"The Enemy of My Enemy is My Friend\" even though all hedges are the enemy.**  \n\\-Smart Ape thinks things will go faster if every week Citadel's Put and Call positions are deduced and posted in easy-to-see DD for all to see.  \n\\-Smart Ape also wants DD with a list of Citadel's most held Stock tickers, so that Smart Ape can use GME gains to buy at bargain prices Citadel's liquidated positions after the squeeze.  \n\\-Smart Ape will edit into this post good DD links that contain this info.\n\nSmart Ape will still buy and hold GME, because Smart Ape loves the stock.\n\n\\----------------------------\n\n\\----------------------------\n\n\\----------------------------\n\n\\----------------------------\n\n**NEW DD EDITS:**  \nUpdated 03/25/21 -11:34pm -----  \nBlackrock Bagholders DD discusses more business history between Citadel and Blackrock\n\n[https://www.reddit.com/r/GME/comments/m7o7iy/blackrock\\_bagholders\\_inc/](https://www.reddit.com/r/GME/comments/m7o7iy/blackrock_bagholders_inc/)  \nIMO that was great DD and adds another layer to the whole Citadel and Blackrock relationship.  \nAt the end of it :  \n*\"Citadel has owned shares of BlackRock (BLK) since Q3 of 2008. Their business relationship started at a rather peculiar time if you ask me. Although it has fluctuated since at least Q4 2018 (earliest I can see) , they just sold off 48.31% of their BLK portfolio and own 206,500 BLK puts to 135,700 BLK calls (1.52 put/call).. For those who don't know... 1.52 is an EXTREMELY high put ratio. They've actually had a large put ratio on BlackRock for quite a while... anything over 0.7 signals bearish, and anything over 1 is treated like a dumpster fire. It's like Citadel knows that BlackRock is screwed without a mule like Citadel Securities.*\n\n*Unfortunately, BlackRock never got their tendies and are probably PISSED that their business partner didn't handle their end of the deal... Even though $GME was a small portion of their portfolio, it was declining in value. Not to mention all of the other assets that were lent as highly shorted stocks... They made a few bucks on the high loan % but it wasn't for long...\"*\n\nSmart Ape Response: Even in that theory, despite Blackrock and Citadel being in business together leading up to it, they are not friendly towards each other. I would theorize that Blackrock may have already made contingency plans for Citadel's imminent collapse.  \n\\---  \n**NEW DD EDITS:**  \nUpdated 03/26/21 -12:21am ---  \nDD level response from comments below: Sesquehanna may be the Long Whale, not Blackrock\n\n*I hate to throw cold water on your theory, but I don't think Blackrock's trading desk is moving and shaking $GME like you theorize. They are an investment bank, a long whale. They pay lobbyists and politicians for their gains. Citadel going down is bad bad news for them.I believe your big whale is Sesquehanna, who owns 4.4M $GME shares and competes with Citadel in the option-making market. 1 in 5 options in the secondary MKT is sold by SIG.*  \n*Their CEO Jeff Yass is obsessed with Poker & Chess and requires all employees of the firm to partake in poker tournaments. He believes the understanding of game theory is the most important skill for a SIG trader to grasp.*  \n[*https://sig.com/quantitative-trading/game-theory/*](https://sig.com/quantitative-trading/game-theory/)  \n*A firm that requires traders to master game theory is playing poker/chess with a stock called Gamestop. The puzzle fits nicely together.*\n\nSmart Ape Response: Whether the Kong trying to take out Citadel is Blackrock or Sesquehanna makes no difference in that it's still helpful for everyone to know Citadel's max pain in Puts and Calls every week. I.E. Regardless who is attacking Citadel, the sooner Citadel falls the sooner the Squeeze will start.  \n\\---  \n**NEW DD EDITS:**  \nUpdated 03/26/21 -10:03am ---  \nWarden's live charting for  03/26/21, and he identified shorters buying Puts at $200, so likely Citadel trying to make money at that pricepoint. We must make sure today closes above $200.  \n[https://www.reddit.com/r/GME/comments/mdojvs/live\\_charting\\_for\\_3262021\\_predicting\\_the\\_days/](https://www.reddit.com/r/GME/comments/mdojvs/live_charting_for_3262021_predicting_the_days/)  \n\n\nhttps://preview.redd.it/imnnuzp7qdp61.png?width=2506&format=png&auto=webp&s=d7af274a9020c279612a5c349c95dbd3e9557d19",
    "title": "For the Short Squeeze to start SOONER, a Smart Ape would deduce Citadel's weekly Options positions.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mdeute/for_the_short_squeeze_to_start_sooner_a_smart_ape/"
}