{
    "author": "WardenElite",
    "created_utc": 1616678757.0,
    "distinguished": null,
    "edited": 1617469131.0,
    "id": "mcy6kh",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mcy6kh",
    "num_comments": 1618,
    "permalink": "/r/GME/comments/mcy6kh/live_charting_for_3252021_predicting_the_days/",
    "score": 11615,
    "selftext": "This is not financial nor investment advice. These are ideas and opinions for information purposes only.\n\n*This post will read bottom to top. It's easier for people to refresh the page and see edits at the top*\n\n**Historical support and resistance levels for reference today:**\n\n116.5, 125.5, 132.5, 141, 145, 147.5, 150, 152.5, 156.5, 162.5, 172, 183.5, 184.5, 187.5, 190.5, 192, 195, 197.5, 200, 209, 211.5, 214.5, 218, 226, 230, 234, 243, 250, 253, 256.5\n\n177 diagonal\n\n&#x200B;\n\n**Edit 8 Unredacted:**\n\nThe answer to today's general movement was predicted in edit 8. I spotted large Call skew at 150 strike (unbalanced Call volume), then I saw a massive chain being setup between 150 and 180. I knew something was up and that this would fly.\n\n[data courtesy of optionsonar.com](https://preview.redd.it/17qneu71e8p61.png?width=2493&format=png&auto=webp&s=a2806806c3d3734b2cd62e207cae6c36d16281be)\n\n**Edit 47 4:05PM:**\n\nWow.\n\n**Edit 46 3:44PM:**\n\nChoppy price action, we just saw a gap up at the minute tick. Aggressive shorting countered by aggressive buying.\n\nhttps://preview.redd.it/adcp0ahea8p61.png?width=2141&format=png&auto=webp&s=8b6dd6b6403ee6e0f4dff093d5ef365daa9cc586\n\n**Edit 45 3:22PM:**\n\nHigh volume on 120 strike puts. Bears fighting back.\n\n**Edit 43 3:16PM:**\n\nThank you RC for the great summary of today:\n\nhttps://preview.redd.it/gabzu3l058p61.png?width=598&format=png&auto=webp&s=e977df28678f97671e053b2e11fbb443618472d8\n\n**Edit 42 3:08PM:**\n\nRemember they got tomorrow as well to fight for that 185 mark. This will get ugly as the shorts start throwing everything they have at this stock.\n\n**Edit 41 3:04PM:**\n\nWe have a safety net at 155. This is a battle around 185 and if we can push through that and 200, it's literally a free for all charge to 220.\n\n**Edit 40 2:59PM:**\n\nShorts are getting annihilated once again in the options market. Those measly Puts were bought in an attempt to control the tsunami that is pushing the price up.\n\n[data courtesy of optionsonar.com](https://preview.redd.it/vxk727t628p61.png?width=2509&format=png&auto=webp&s=cead28681b1b44b7574000390df25856af1ae524)\n\n**Edit 39 2:56PM:**\n\nWe've pierced through the 177 diagonal resistance like butter. Onwards to 183.5!\n\n**Edit 38 2:52PM:**\n\nWall Street never thought retail would have this one simple trading power: holding.\n\nFor year's they've pumped and dumped several stocks using scare tactics to shake out all the paper hands. For the first time in history, retail finally managed to have the courage to completely invalidate all of Wall Street tactics through the sheer power of diamond. friggin. hands.\n\n**Edit 37 2:45PM:**\n\nI think Act 2 of this show is starting either later today during power hour, or tomorrow morning.\n\n**Edit 36 2:41PM:**\n\n**Millions of dollars of call volume still increasing at 180-200 range. This is not a bull trap in my opinion.**\n\nhttps://preview.redd.it/uttl1s3uy7p61.png?width=500&format=png&auto=webp&s=7f27a1a6295c94df1036a12201b0a82a59f9e2a7\n\n**Edit 35 2:24PM:**\n\nNew ascending channel forming looking to retrace to 172.\n\nhttps://preview.redd.it/ec2pnmcsv7p61.png?width=2140&format=png&auto=webp&s=8d4fee4c95057be8b687d30f4e285112d05f1aa5\n\n**Edit 34 1:58PM:**\n\nI'll call it the 177 diagonal resistance. Added to the list of supports and resistances.\n\n**Edit 33 1:54PM:**\n\nI'm seeing whales load up at the 175-190 strike right now. We'll likely see a temporary sagging until they decide to ignite the boosters again.\n\nWe're also challenging a new downwards diagonal resistance. If we break through this, we should be able to boost to the 183 range. Thanks to u/[CountGeeTee](https://www.reddit.com/user/CountGeeTee) for pointing this resistance out.\n\nhttps://preview.redd.it/p9djdk0iq7p61.png?width=2141&format=png&auto=webp&s=7e6449677974deb60b2173dec0ec169985dedf09\n\n**Edit 32 1:36PM:**\n\nVery tight battle. Put volume accelerating to combat long side. It's a close battle.\n\n**Edit 31 1:13PM:**\n\nBattle over making 172 a support.\n\n**Edit 30 1:06PM:**\n\nI believe this is an expensive fight over options goalposts. This fight can end either way, but I'm confident longs can win the war.\n\n**Edit 29 1:00PM:**\n\nDISCLAIMER. THIS FIGHT CAN END BOTH WAYS. THIS IS A BATTLE BETWEEN TWO GIANTS. We are merely spectators. Enjoy the show while it's running!\n\n**Edit 28 12:49PM:**\n\nForgot to update, **two new horizontal lines added at 156.5 and 162.5**.\n\n**Edit 27 12:39PM:**\n\nThanks so much for supporting me on Kofi! I've just purchased some additional trading analytics tools, and have also had a kind Reddit user provide me with some of theirs! I'm investigating the options activity more in depth and will keep you all posted on what I find.\n\nGeneral conclusion is that the Bloomberg Terminal is limited in usefulness. I will have to rely more on options scanners to get useful information.\n\n**Edit 26 12:12PM:**\n\nhttps://preview.redd.it/s53e9cp887p61.png?width=2140&format=png&auto=webp&s=a1ad3615d7b04b06a5abc5693736bb2d53091e3f\n\n**Edit 25 11:42AM:**\n\n# I'm living cohosting with Andrew Mo Money rn.\n\n[https://youtu.be/ir8o13svhXw](https://youtu.be/ir8o13svhXw)\n\nWill still update the doc\n\n**Edit 24 11:35AM:**\n\nI'm swapping today's technical analysis completely over to options analysis. This is an options game right now.\n\nIMPORTANT PRICE TARGETS:\n\n145, 150, 180, 190, 250, 400. These are all prices that will be fought over. As soon as we cross one threshold, we'll be propelled to the next.\n\n**Edit 23 11:33AM:**\n\nMy edit 21 in ape language. Many Calls make stock go BOOM.\n\n**Edit 22 11:29AM:**\n\nIn my opinion, according to my data, the battle is on for the 150 mark. Prepare for some turbulence.\n\n**Edit 21 11:24AM:**\n\nThat's it. The put skew just got annihilated. They've split the differential and the shorts have completely lost in the options market...\n\n**Edit 20 11:23AM:**\n\nhttps://preview.redd.it/119pu90lz6p61.png?width=480&format=png&auto=webp&s=bf20b39c6bf71ce4e2cff3f24e25b0d34785f058\n\n**Edit 19 11:20AM:**\n\nAscending channel headed towards 172.\n\nhttps://preview.redd.it/om435q7vy6p61.png?width=2139&format=png&auto=webp&s=e4f9be34f6eeff4454adc137d8fa1f8b12e33655\n\n**Edit 18 11:19AM:**\n\nLong whales are out for blood.\n\n**Edit 17 11:16AM:**\n\nIf we hold at 150 into Friday, the delta hedging by MMs will potentially be huge...\n\n**Edit 16 11:13AM:**\n\nCall volume has doubled! DOUBLED!\n\n**Edit 15 11:07AM:**\n\nThere is a tight battle being fought on the options market right now. Large quantity of OTM puts being exchanged, but Call options loading in at several ITM strike prices.\n\n**Edit 14 11:04AM:**\n\nTHE TIDES ARE TURNING. My options scanner is going bonkers right now with the call volume.\n\n**Edit 13 11:02AM:**\n\nVIX up? Yes. B\\_T\\_C down? Yes. GME up? Yes!\n\n**Edit 12 11:01AM:**\n\n\\*Begin playing epic battle music as I watch these little green candles wobble up\\*\n\n**Edit 11 10:50AM:**\n\nI need to Redact my edit 8 for information purposes. My trader friends freakin out haha. Can't show the enemy what we know!\n\n**Edit 10 10:45AM:**\n\nThere was a very interesting TA theory I saw a few weeks back, that we would see a pullback to the 120-140 region before we can climb again. I guess that theory is now valid!\n\n**Edit 9 10:37AM:**\n\nAs the price is consolidating, I will take the time to sift through the Bloomberg Terminal and continue to identify any useful information. I've really learned a lot since getting my own Terminal yesterday and I think there's some interesting insights to be discovered.\n\n**Edit 8 10:33AM:**\n\n**\\[REDACTED\\]**\n\n**Edit 7 10:25AM:**\n\n**Bull trap or not, I'm still bullish on this stock.**\n\n**Edit 6 10:21AM:**\n\nPrice settling into the 132.5-140 channel. Unknown institution bought in. Too bad Bloomberg Terminal won't have info on this.\n\n**Edit 5 10:02AM:**\n\nHuh... takeoff?\n\n**Edit 4 9:54AM:**\n\n**Part of that force is all of you HOLDING!**\n\n**Edit 3 9:51AM:**\n\nI hope you all understand the gravity of this situation. They shorted tons of ETFs yesterday to oblivion. They are doing it again, **dragging the entire market down, yet GME remains in the green.** A colossal force is keeping us above water.\n\n**Edit 2 9:36AM:**\n\nModerate volume. 1million first candle on Webull (volume is reported slightly differently on different platforms). It would appear from some charting last night that **the 116-118 zone is one of the strongest support zones.** Today we will see if it can hold.\n\nhttps://preview.redd.it/90uh6d5ng6p61.png?width=2138&format=png&auto=webp&s=70c9e8ec4bdd95539af9f3d6e971a830ff1d48e4\n\n**Edit 1 9:33AM:**\n\nHang in there as I catch up on all the drama in the sub.\n\n# Begin Reading Here\n\nhttps://preview.redd.it/9tdh6pwwd6p61.png?width=769&format=png&auto=webp&s=495a3365a3a424b0387f08313f76959329730277\n\nGoooooooooooooood morning my fellow apes!\n\nSo I finally got access to my own Bloomberg Terminal. Spent a good amount of time examining all the data and it seems there's a lot more nuance to the data that what's available in the screenshots on Reddit. **It seems that ownership is actually slightly delayed, so please take my statement yesterday about long ownership increasing with a grain of salt.** I'll continue scanning through all the data, so stay tuned!\n\n# Premarket Analysis\n\nBroader market down today. GME up in the premarket with a higher chance of starting off strong at market open.\n\nI have a couple messages and drama to catch up on as I just woke up so bear with me. Be back soon with my edits!",
    "title": "Live Charting for 3/25/2021, predicting the day's price action in detail with Warden. The calm before the storm.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mcy6kh/live_charting_for_3252021_predicting_the_days/"
}