{
    "author": "zoowes",
    "created_utc": 1616668460.0,
    "distinguished": null,
    "edited": 1616672782.0,
    "id": "mcv70a",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_mcv70a",
    "num_comments": 79,
    "permalink": "/r/GME/comments/mcv70a/this_is_the_endgame_from_a_finance_psych/",
    "score": 2196,
    "selftext": "Obligatory 🚀🚀🚀💎🙌💎🙌💎🙌\n\nOkay you 🦍🦍, this is my first DD so be gentle. I have a background in Finance &amp; Psych, and wanted to offer my **opinion** on recent events:\n\n1. The ER was just that. Shows strong fundamentals and turnaround. ER dumps are NOTORIOUS so this was also expected. In fact, the aggressive shorting we just saw is **another sign that the HFs are thrashing one last time before they die**.\n2. **RC LANGUAGE** \"delight\" shows he is in full control of GameStop. But where is RC in all this? If we use the assumption that there were bad actors (ex. Jim Bell) in GameStop, helping Shitadel &amp; Friends, then RC's behavior is **perfect**. While he may not be CEO, it is **clear** from George Sherman's tone, attitude, and language that RC is the one who is really in control.\n3. Please check out u/heyitspixel latest post and wish him well, whatever he decides to do. He has contributed so much to this community and  we should respect his decision. Regarding the messages and spam he's getting, it has ramped up **dramatically. This tells me that the HFs know that their shills are ineffective, so they are trying to intimidate and bully us into submission. It won't work.**\n4. The DTCC's language is serious. There has been much discussion on the -7 or -22 beta (which means when we 🚀🚀, the market is going to go down. How much? Probably a lot, unless the DTCC can step in and save some face. **The DTCC is moving much quicker now, signaling a margin call due to Members' overexposure. Once 801 gets approved, I think 🚀🚀 is imminent.**\n\nEDIT: 2:30 EST SEC closed door meeting potentially for 801 today? - speculation\n\nTL;DR: ER good, ER dip also good, RC language good, DTCC finally doing something? Basically buy and hold (not financial advice).",
    "title": "This is the ENDGAME: From a Finance & Psych Perspective",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mcv70a/this_is_the_endgame_from_a_finance_psych/"
}