{
    "author": "makebreakcreate",
    "created_utc": 1620351103.0,
    "distinguished": null,
    "edited": false,
    "id": "n6n626",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n6n626",
    "num_comments": 96,
    "permalink": "/r/Superstonk/comments/n6n626/maybe_the_gamestop_hearing_has_been_misdirection/",
    "score": 1266,
    "selftext": "Seeing everyone's reactions to today's GameStop hearing gave me pause to wonder...  Maybe the focus on Payment for order flow (PFOF) has been a case of carefully controlling the conversation away from the real issue on purpose.\n\nWe know the real issue around GME is abusive shorting.  It was abusively shorted, and available evidence says it continues to be. (No data supports that anyone covered.  The only information provided as evidence has been 1. an anonymous source saying they covered in late Jan/early feb & 2. self reported short positions & 3. KenG saying they closed their positions in GME)\n\nWhat if this entire hearing is designed to try and control the public narrative away from the topic of shorting.  They might be doing the magicians trick of waving their left hand in front of your face so that they can take action with their right hand.\n\nIf they are trying to minimize the crater when this goes off, then they certainly wouldn't want it coming out in a hearing that Yes, GME continues to have a short interest of XXX% and it WILL explode. (causing everyone and their cat to immediately pile back in).  It would make much more sense to redirect now, and Oh surprise, Hold another hearing focused on abusive short selling after the market meltdown, as a distraction from the real issue of overleverage, rehypothecation and abusive market makers\n\nThese hearings seem to occur AFTER the fact of the thing they are discussing.\n\nPFOF was an issue that has now been exposed, Lets hold an ineffective hearing about this thing that has ALREADY had an impact.\n\nAbusive short selling.  That fuse has been lit, but the explosion hasn't occurred. Why draw attention to it now in the hearing?\n\nAfter the upcoming market meltdown, I'm sure a hearing will occur focusing on the wrong thing again.  Always putting Focus on the wrong topics as a distraction from the real currently impacting issues.",
    "title": "Maybe the GameStop hearing has been misdirection all along: PFOF, Shorting & overleverage",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6n626/maybe_the_gamestop_hearing_has_been_misdirection/"
}