{
    "author": "creakfast",
    "created_utc": 1620073070.0,
    "distinguished": null,
    "edited": false,
    "id": "n466af",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_n466af",
    "num_comments": 95,
    "permalink": "/r/GME/comments/n466af/sec_passes_dtc2021007_on_april_30th_which_was/",
    "score": 1164,
    "selftext": "What's good shareholders, creakfast here. I like to go back and forth w/ posting memes and DTCC rule filings. Today happens to be a rule following day. \n\n&#x200B;\n\nhttps://preview.redd.it/knh7q6y2oyw61.png?width=200&format=png&auto=webp&s=4580c2dceb9c47d8e757102eaddd0de0893a043f\n\nOn April 21, I [posted](https://www.reddit.com/r/GME/comments/mvh4hb/dtc2021007_signed_april_20_2021_is_forcing_all/) on DTC-2021-007, trying my best to help present the information given in the rule filing by the DTCC. In this post I am going to shorten this name to 007. Basically, the 007 would centralize any activity where two parties agree to manually change \"cash adjustment claims to principle and interest (“P&I”) payments on stock loan and repurchase agreement (“repo”) positions\" (quoted from 007). This would be done by directing participants to use ClaimConnect (new centralized way UNDER DTCC's eyes) instead of APO service (old way to manually change AWAY from the DTCC's eyes).\n\n&#x200B;\n\nIn this [post](https://www.reddit.com/r/Superstonk/comments/n25kw4/srdtc2021007_notice_of_filing_and_immediate/gwhe8qg/?utm_source=reddit&utm_medium=web2x&context=3) on r/Superstonk there seems to be misunderstanding on the correct effective date. You can see in the below picture, that SEC filed and made 007 **IMMEDIATELY** effective. \n\n&#x200B;\n\n[From SEC website](https://preview.redd.it/b9fda9vmlyw61.png?width=1254&format=png&auto=webp&s=6a37e8c8a3aaf157db9e298733397f2c7ea9e590)\n\n&#x200B;\n\nNow in the original filing, the effective date was listed as July 9th, 2021. But the SEC just passed this rule 2 and half MONTHS earlier than expected. This is telling me that there must be some nefarious activity going on behind the scenes involving [participants](https://www.dtcc.com/-/media/Files/Downloads/client-center/DTC/alpha.pdf) and repo/stock loans. \n\nGuess who's on the participants list. That's right - Citadel, UBS, Robinhood, JP Morgan, Credit Suisse, you name it.\n\n&#x200B;\n\nSound familiar? Our beloved stock has probably been lent out on a count only God knows. \n\nu/atobitt wrote a [piece](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/) calling out \"Citadel and friends shorting the treasury bond market to oblivion using the repo market.\" \n\n007 is proving that our **DD has been right.** That is the most important thing right now. We can't trust the stock price. We can't trust the short interest %. But WE CAN TRUST OUR DD. We can trust Cohen. \n\n&#x200B;\n\n[Name is Bond. Treasury Bond.](https://preview.redd.it/h1pyfaabjyw61.png?width=650&format=png&auto=webp&s=ab6cbded178ddb0e59be5df9671db8339ed9e4d3)\n\n&#x200B;\n\n&#x200B;\n\nGary Gensler must be seeing insane numbers if he is passing rules wayyy before it is due. Or maybe he did a pump fake with the 7/9 date and decided to catch them off guard and finish strong for an and-1. Either way, he is paving the way to sweep the short HF's 4-0 in the finals. My boy Gary left mid-way through an MIT semester to suit up. He is passing rules like Rondo on the '08 Celtics.  \n\n&#x200B;\n\nhttps://preview.redd.it/sgqu20qppyw61.png?width=478&format=png&auto=webp&s=c6c53c554cf71d2f549b507efd1fea4f25f92298\n\nAnd apes know the drill - BUY and HODL. Moon soon. GGEZ.",
    "title": "SEC passes DTC-2021-007 on April 30th, which was originally to become effective on July 9th, 2021. Clarifying misunderstandings and connecting the dots with 'The EVERYTHING Short.' (Not financial advice)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/n466af/sec_passes_dtc2021007_on_april_30th_which_was/"
}