{
    "author": "C2theC",
    "created_utc": 1622223571.0,
    "distinguished": null,
    "edited": 1622724702.0,
    "id": "nn370o",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nn370o",
    "num_comments": 924,
    "permalink": "/r/Superstonk/comments/nn370o/why_i_am_ecstatic_gme_is_taking_a_dump_and_the/",
    "score": 10740,
    "selftext": "Apes, lend me your ears.\n\nI am **pumped** that GME took a fat dive from $268.80 down to below $235.00 as of this post. Why? Because it means we've figured out the *modus operandi* of the shorts, and HFs are fuk.\n\n**TL;DR** HODL, because GME is going to the moon. 🚀\n\n# T+35/T+21 Cycles\n\nThis is real, and the juiciest part of this post. As I noted in my [Cyclical Patterns in Failure-To-Deliver (FTD) and Short Interest Reporting](https://www.reddit.com/r/Superstonk/comments/nezp94/cyclical_patterns_in_failuretodeliver_ftd_and/), written upon the DD of those before me, the T+35/T+21 cycles are consistent, empirical, measurable, and now, *predictable*. Read the DD of [I've estimated the current SI% based on the SI Report Cycle and Deep ITM CALL purchases.](https://www.reddit.com/r/Superstonk/comments/nc1lny/ive_estimated_the_current_si_based_on_the_si/) by [u/Criand](https://www.reddit.com/u/Criand/) for more details.\n\nIn the chart below, we can see that each T+21 cycle (there are around five, which I've noted above the GME chart ), in every twenty-one trading sessions, GME has a regular spike. The mechanics of this are likely to be kicking-the-can-down-the-road for the FTD cycles, and even if there might be doubters about the underlying cause, you cannot doubt the observable data that this happens exactly every twenty-one days on schedule. If the sun rises every twenty-four hours, who cares if the Earth rotates around the Sun or the Sun rotates around the Earth (shout-out to Galileo Galilei who stood up to the shills of his day)—the sun still rises every twenty-four hours.\n\nAdditionally, I am tracking possible cycles for dips in the yellow lines below the chart. Though I am not sure if there is a definite pattern yet, it is human nature (actually the nature of every system due to entropy) to do the same thing over and over on a repeating basis, such as the timing of morning/night routines of showering and brushing your teeth, aka personal hygiene.\n\nThe one pattern I have seen is that on each Short Interest Reporting Settlement Date, marked by \"SIR,\" GME takes a dump. *Especially* after a run such as the one this week. If the pattern as depicted by the yellow lines holds true, watch out for another dump on the first day of trading next Tuesday.\n\n[A cyclical pattern emerges](https://preview.redd.it/k6g14efb6w171.png?width=2433&format=png&auto=webp&s=a63cec898848e621d7b3325722b59dbe130afd24)\n\n# AMC Correlation\n\nIf you were a HF that was deep in the red shorting GME, consider this strategy:\n\n1. Buy OTM AMC calls\n2. Spend money to keep the GME price down, let AMC rocket, and let retail FOMO set in\n3. Entice people to paper-hand GME, then sell those AMC calls to them\n4. Buy OTM GME puts\n5. Take the cash generated and drive down the GME price\n6. Sell now-ITM GME puts and pay yourself back\n\nBy doing the above, you can end up spending very little or breaking even on your capital and achieve:\n\n* Pushing down both the price of GME and AMC at no cost to you!\n* Deflate the morale of GME apes that we missed out on AMC riches\n* Deflate the morale of AMC ape-cousins that they didn't sell at the peak or bought at the top\n* Give a story to Main Stream Media (MSM) to report that the MoASS is over, and that AMC is now -30%, from the peak, never mentioning the +120% from last Friday\n\n# AMC Price Action\n\nWhat drove the price action for AMC this week? This section is all speculative, and there are multiple possibilities, some or all or none of which may be true:\n\n1. There is no news, and there are no sellers, so the only driver for the price action are the shorts themselves\n2. It is not even 2p EST and the volume on AMC is 522M, and the average 20-day volume is 165M. How is a 3× average volume possible on no news, and yesterday was 5×, unless institutions were involved?\n3. Funds are getting margin called and need to cover or provide more cash\n4. Shorts would let AMC go in order have ammo to suppress the price for GME, which is far more detrimental to the shorts\n5. MSM needs a piece to talk about how much AMC came down, to \"encourage\" GME hodlers to paper-hand and sell, if not now, then build it into the psyche for the MoASS\n\n# Crypto Crash\n\nThe market is a zero-sum game. Due to the amount of losses in crypto, to the tune billions, it is not possible that it was all retail. Institutional investors were the whales that cashed out. The money had to go somewhere. It is likely a good portion went to the manipulation of GME and AMC, as well as the possible covering of margin calls. At the very least, it is still held as cash. This is why the general market hasn't tanked, because shorts haven't had to sell any of their beloved shares in the S&P 500 to cover for GME/AMC.\n\n# Conclusion\n\nJacked to the tits!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEdit: *modus operandi* not *operus modi -* thanks u/Mufragnosky",
    "title": "Why I am Ecstatic GME is Taking a Dump, and the Possible Correlation with AMC and Crypto",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nn370o/why_i_am_ecstatic_gme_is_taking_a_dump_and_the/"
}