{
    "author": "pinkcatsonacid",
    "created_utc": 1624911597.0,
    "distinguished": "moderator",
    "edited": 1624984676.0,
    "id": "o9siy5",
    "text_only": true,
    "flair_id": "f1616402-b693-11eb-a256-0e4ef3af69e3",
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_o9siy5",
    "num_comments": 1545,
    "permalink": "/r/Superstonk/comments/o9siy5/the_jungle_beat_monday_06282021_important_sub/",
    "score": 4832,
    "selftext": "*The Jungle Beat will be posted at 4:20 pm NYSE time every trading day!*\n\nhttps://preview.redd.it/4l73al7wt1871.png?width=1426&format=png&auto=webp&s=2a810afb3f1ea3601932c323ac9e1e4684e8312e\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🎤🎸🥁 🦍Welcome to the Jungle🦍🥁🎸🎤\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Today's Recap 📈\n\n# $GME Closing Price: $213.25\n\n&#x200B;\n\nOpen Price: $211.25\n\nDaily High: $224.45\n\nDaily Low: $210.20\n\nVolume: 4.75 MM\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🖍🍎🚌GME 101🚌🍎🖍\n\n&#x200B;\n\n*If you're new to Superstonk, start here!*\n\n&#x200B;\n\n[Superstonk FAQ](https://www.reddit.com/r/Superstonk/wiki/index/faq#wiki_how_do_i.2C_as_a_retail_investor.2C_stand_a_chance_against_the_hedge_funds.3F) (Updates coming soon)\n\n[Superstonk Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\n**NEW!!** We will be having a \"Smooth Brain Sunday Megathread\" every Sunday as a place to ask all the questions you've been wanting to get answered! Please be advised that all answers provided are from individual users and, as always, any information you receive requires doing your own due diligence!!\n\nThe apes of [r/Superstonk](https://www.reddit.com/r/Superstonk/) sincerely appreciate the time and effort put into getting this information out there. 🦍🤝💪\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Gamestop is Officially on the Russell 1000 Index\n\n&#x200B;\n\n[credit u\\/Edawg661](https://preview.redd.it/pepdof9de2871.png?width=828&format=png&auto=webp&s=570720c11ae84ec6aefb86dd7ddda6c7e3efd8eb)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🚫No Brigading🚫\n\n&#x200B;\n\nAs you have probably seen by now, there have been reports to reddit admins that Superstonk users have **allegedly** been brigading other subs. u/redchessqueen99 [wrote a post here that addresses the issue](https://www.reddit.com/r/Superstonk/comments/o80eky/no_brigading/) **(THIS IS REQUIRED READING)**, but I want to get into this. If we're going to be accused of something, let's look at facts.\n\n&#x200B;\n\nWe know there are popular users (\"influencers\") in stock/finance subreddits that have been paid by companies to promote certain tickers and write/post DD. How do we know that?\n\n&#x200B;\n\n[**Because you have apes like me who blew their diamond whistle instead of taking the check.**](https://www.reddit.com/r/Superstonk/comments/ms6yvq/blowing_my_diamond_whistle_as_a_highly_visible/)\n\n&#x200B;\n\nhttps://preview.redd.it/j5ksbue4b2871.png?width=1078&format=png&auto=webp&s=c44c58abaff4e4420823bd97827930e3025ccd50\n\nWait, so there's **PROOF** that there are **PAID SHILLS** on **THIS VERY WEBSITE?** (reddit as a whole, I mean)\n\n**Yep.**\n\n[And when we investigated these \"shill-shell\" companies, we found some pretty disturbing stuff. Like the psyops manual used to train people who take jobs shilling, politicians, volunteers, etc...](https://www.reddit.com/r/Superstonk/comments/mtc4xu/buying_influence_the_pump_and_dump_scheme_preying/)\n\nWe also know that paid shills are also sent into internet forums to bash certain stocks so as to drive down their price. We know they are sent to communities like ours bash a stock to the long positions in the community. This activity is as old as the internet chat room (a/s/l? :P).\n\nSo, duh, we know shills are a thing. Mods and members alike have been experiencing the harassment these paid bad actors use to attack us with their psyops and bullying communities like ours. And the bullying continues in other communities yet nothing is done after repeated reports. Seriously. If you could see some of the abusive wording in the mod reports on Superstonk posts, presumably from trolling shills, as well as the harassing DMs and posts directed at single users on other subs (myself included), you would see what a psychological battle this has become for us all. $&\\*@#!&%\\^! I JUST LIKE THE STOCK!\n\nSo now I present the possibility here... we know we have been dealing with shills for months in these forums. So much so, that we've had to develop special AI software, SATORI, to help combat this epic problem. *Would it be so crazy to assume that we have shills going into other communities and pretending to be members of Superstonk, spreading negative sentiment?* Who knows. But Satori is now actively finding out for us. We should get the data soon.\n\n&#x200B;\n\n![img](qpld9231b2871 \"\n\")\n\nThis isn't a normal community. We are disproportionately targeted because of our unique popularity in the scope of reddit, yet here we stand tall. Remaining vigilant in our DD and excellent to each other. There is no evidence presented to us yet of any posts on this subreddit condoning brigading (we have requested from multiple sources), but we will continue to investigate.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# New Karma and Age Requirements, Cross-Posting and Mention Bans, and more\n\nGiven the level of fire we are under at this time, and to combat the issue of alleged brigading, the only alternative to completely going dark (which won't happen), is to up the automod age requirements to comment and post.\n\n**Satori is still approving users, regardless of age and karma, everyday. And if you have already been approved by Satori, these new rules will not affect you!!!**\n\nThis is mainly to keep shill accounts out. And it has proven effective in the past. We prefer to stay defensive rather than offensive, and don't feel it's a moment too early to be raising these requirements to protect the sub. The issue has also brought the need to ban crossposting as well as many new words being added to automod (the ones that pertain to other subs).\n\nOh, and... In case you missed it, we also had some code forcibly added to our automod code by reddit admin:\n\n![img](6uhvmvrmc2871 \"\n\")\n\nSo no more links to other communities or call outs of other communites. 🤷‍♀️\n\nThe mod team appreciates you understanding that we are doing what we have to do to keep this community safe.\n\n&#x200B;\n\nI know some interns that are going to be out of a job this summer......\n\nhttps://preview.redd.it/ei6zsu9x52871.jpg?width=880&format=pjpg&auto=webp&s=c33ca63334a58f6daba01f5d58d08cef6fcb1d59\n\nLook for more info coming soon in an upcoming update post from u/redchessqueen99\n\n# YOU CAN STILL COMMENT !apeprove! TO BE ON THE LIST OF USERS FOR SATORI TO FAST TRACK TO APPROVAL STATUS!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# No More MSM GME Talky 🤐\n\n&#x200B;\n\nDon't even get me started on the narrative that retail-reddit in particular- is somehow capable or responsible for \"influencing\" a stock. This is clearly MSM trying to paint a narrative. (Brigading sound familiar? More on that below)\n\nLooks like a couple Billion in liquid capital and a rockstar exec team isn't promising enough. Sorry, I didn't know you were supposed to show your hand in poker before the dealing is done? Is it normal business practice to expect business strategies be proactively made public? Were 2 positive QE reports not enough? Russell 1000 upgrade? No? Ok....\n\n&#x200B;\n\n[Credit u\\/apegoneinsane ](https://preview.redd.it/ds3w3rxh22871.png?width=960&format=png&auto=webp&s=ec3f06bd47de66ff596be13fa3c3f92de3edbd7c)\n\n# “Baird receives certain payments on retail option orders routed to Citadel Securities” 👀👀👀👀👀\n\n&#x200B;\n\nMSM is just a propaganda machine. We've always known that. Now it's becoming more blatant, the more desperate they become.\n\n&#x200B;\n\n...Which brings me to MarketWatch. I won't link the article here because I don't want to give those MotherFUDders clicks. And I also don't want to post screenshots because that's a gray area in our NO BRIGADING rule and I'd rather play safe and set a good example here.\n\nIt basically said that we are the new popular stock sub, but then goes on to say that we had a \"flurry of anti(*that* sub) posts\" and have almost half a million members.\n\nUmmm.... are we playing two truths and a lie??\n\nModerators here have not at any time allowed any kind of call outs to other subs in this manner. And we certainly are actively removing and potentially banning users that are guilty of these brigading posts. MSM is really trying to paint this sub with a brigading brush, but I, for one, am not buying it.\n\nTL:DR: Don't trust the narrative that MSM is writing right now. (As if we did before, but extra caution now is warranted.)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# A note from your friendly local Pink Cat ✌💖🐈🦄🚀\n\n&#x200B;\n\nToday's JB probably seems a little feisty. That's because it's warranted. Building this sub has been a labor of love on everyone's part, not just the mods. This community is built by apes, for apes. We are just the groundskeepers for the think tank. You all make it shine with content.\n\n&#x200B;\n\nHaving said that, we are volunteers. Every one of us. We are here because we like the stock and like the sub. And we have all endured months upon months of harassment just for that simple fact alone. Yet we endure. Because the stock and the company's future is just *that fucking awesome*.\n\n&#x200B;\n\nI/we, this whole mod team... we will not let the sub be attacked from any source if we have any say in the matter. 🦍🤝💪\n\n&#x200B;\n\n[Shield Wall!!!!!](https://preview.redd.it/yjxjgwhaf2871.jpg?width=1324&format=pjpg&auto=webp&s=f0b896fd5b3edcc9b32a49d40ed32e9f5e7d5947)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# We Like the Company! We Support the Company!\n\n&#x200B;\n\nObviously you're a shareholder because you love Gamestop and have high hopes for its future. Supporting the company you love on the retail front is a great way for a shareholder to ensure a business' success! Here are several ways you can show your public support for Gamestop;\n\n* [**Shop at Gamestop.com**](https://www.gamestop.com/) **🛒**\n* [**Become a PowerUp Rewards Member**](https://www.gamestop.com/poweruprewards/) **✊**\n* [**... Which gets you a subscription to Game Informer Magazine**](https://www.gameinformer.com/) **🚀**\n* [**Follow Gamestop on Twitter**](https://twitter.com/GameStop) **🦍**\n* [**Subscribe to Gamestop's YouTube Channel**](https://www.youtube.com/user/gamestopvideo) **🖍**\n* [**Follow Gamestop on Twitch**](https://www.twitch.tv/gamestop) **🎮**\n* [**Follow Gamestop on Instagram**](https://www.instagram.com/gamestop/?hl=en) **🌙**\n* [**Follow Gamestop on Facebook**](https://www.facebook.com/GameStop) **🦧**\n* [**Apple Devices- Download the Gamestop App**](https://apps.apple.com/us/app/gamestop/id406033647) **(Link to App Store) 🍌**\n* [**Android Devices- Download the Gamestop App**](https://play.google.com/store/apps/details?id=com.gamestop.powerup) **(Link to Play Shop) 📈**\n* **Brands owned by Gamestop; ThinkGeek, GameInformer,** [**MicroMania**](https://www.micromania.fr/)**, and** [**EB Games**](https://www.ebgames.ca/) **💎**\n\nPlease remember apes, as you are interacting with Gamestop Social Media, that their objective is to reach gamers and promote their brand to their demographic. Yes it's fun when they tweet MOASS and Chickie Tendies, but let's not flood them with comments about Ken, Naked Short Selling, and Mayonnaise. Let's show them support by joining, contributing to, and expanding their robust community of gamers!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 🚨 Reddit down 🚨\n\n# With Reddit having issues during high traffic, exciting moments in this saga, we have discussed what to do if Reddit has an outage.\n\n**IF REDDIT GOES DOWN AT A PIVOTAL MOMENT A LARGE PORTION OF THE MOD TEAM IS ON TWITTER.**\n\n[https://twitter.com/ByeTriangle](https://twitter.com/ByeTriangle)\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/u\\_sharkbaitlol](https://twitter.com/u_sharkbaitlol)\n\n[https://twitter.com/BradduckF](https://twitter.com/BradduckF)\n\n**IF THERE IS SOMETHING BIG GOING ON WHILE THE OUTAGE IS HAPPENING WE MAY ALSO UTILIZE THE \"EMERGENCY BROADCAST SYSTEM\" TO RELAY INFO:**\n\n[SuperstonkLive YouTube - Emergency Broadcast System](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***OOK OOK***\n\n***\"I may have been early, but I am not wrong\"***\n\nhttps://preview.redd.it/ipiwhqxxt1871.png?width=1600&format=png&auto=webp&s=4395b8c806799ecbaffc67d4f28c0cc3bfa74017",
    "title": "The Jungle Beat- Monday 06-28-2021- Important Sub Updates! 🦍🤝💪",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9siy5/the_jungle_beat_monday_06282021_important_sub/"
}