{
    "author": "sryidc",
    "created_utc": 1622294271.0,
    "distinguished": null,
    "edited": 1622318357.0,
    "id": "nnnb8e",
    "text_only": true,
    "flair_id": "4c901ca2-b1b1-11eb-83d0-0ed719c76173",
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_nnnb8e",
    "num_comments": 722,
    "permalink": "/r/Superstonk/comments/nnnb8e/fud_warningi_believe_the_jump_in_this_subs_user/",
    "score": 8146,
    "selftext": "I've been suspicious of the online sub count from the moment it was being referenced frequently. I had no idea how many online users were on the sub until these posts started showing up and I'll bet that was the case with others.\n\n**I think they are going to pump and dump the sub.**\n\n**First** \\- artificially inflate subs user numbers. I don't think these are bots, I think they are just empty user accounts to make the sub count look larger. If they are bots they could just be sitting \"online\" to boost the online user count.\n\n**Second** \\- Have shill accounts post over and over referencing sub count.\n\n**Third** \\- Have your army of empty user accounts unsub and fake an exodus, possibly corresponding with a massive fud campaign. Making it look like the user base is upset and giving up. **Possibly with a new sub destination**.(u/Jabarumba)\n\nWe have seen in the past that FUD increases on the weekends.\n\nSo be alert.\n\nWe know what to do. The subs numbers are moot.\n\nWE **BUY**.\n\nWE **HODL**.\n\nWE **VOTE**.\n\nWE WILL WIN.\n\n**A**ll **P**eople **E**qual\n\n&#x200B;\n\n[COINTELPRO Techniques for dilution, misdirection and control of a internet forum](https://www.reddit.com/r/Superstonk/comments/mwi2qj/because_i_cannot_stress_this_enough_i_am/?utm_source=share&utm_medium=web2x&context=3)\n\nEdit: Formatting\n\nEdit 2: Added cointel pro link.\n\nEdit 3: Added u/Jabarumba's comment\n\nEdit 4: I don't think this necessarily requires any action to be taken by us or the mods. **Remember what was said before**: any \"call to action\" or any statement of urgency, **other then to vote**, is most likely misdirection. This post was only to draw attention to the sub count and the possibility of it being a shill tactic.\n\nEdit 5: edited wording for clarity.",
    "title": "🚨FUD WARNING🚨I believe the jump in this subs user count could be setting the stage for a large FUD attack.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nnnb8e/fud_warningi_believe_the_jump_in_this_subs_user/"
}