{
    "author": "TheCaptainCog",
    "created_utc": 1619550303.0,
    "distinguished": null,
    "edited": false,
    "id": "mzvy41",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_mzvy41",
    "num_comments": 65,
    "permalink": "/r/GME/comments/mzvy41/users_of_superstonk_alone_own_between_27_million/",
    "score": 646,
    "selftext": "**TL:DR; after doing two polls and comparing to another user's results, I estimate superstonk users own between 27 million and 35 million shares of GME.**\n\nI'm reposting this from superstonk. Some users recommend I share this in places where it'll get viewed, so I'm posting it here as well. \n\nThis is my last post (probably...) about the survey research I've done. I actually have work to do which I'm putting off for this, and I really have to get back to it. If anyone else wants to play around with it, the data is available in my previous post. \n\nFirst post:https://www.reddit.com/r/Superstonk/comments/mwziwn/users_of_superstonk_own_at_minimum_9_million/\n\nPrevious post: https://www.reddit.com/r/Superstonk/comments/myaxaw/update_retail_users_own_at_absolute_minimum_138/\n\n**Introduction**\n\nThere have been many opportunities for short sellers to cover their short positions since January, and it has been speculated many times this is the case. Publicly available data, such as SI%, have also predicted a decline from over 140% to around 20-40% recently. Adding to this, institutional ownership has been predicted to be around 137% on current bloomberg terminal updates (https://www.reddit.com/r/DDintoGME/comments/mz6zq1/26042021_gme_bloomberg_terminal_information/). But as of yet, and remains to be a crucial variable, is that retail ownership remains a mystery. It has been heavily speculated to be much greater than GME issued shares. Previously, I made a survey to estimate retail ownership. Since last time, I added another poll. The first poll I was unsure of how accurate (possibly because of trolling) the 500-1000 and >1000 categories were. I also tried to extrapolate the results to all of retail. To account for this I removed the 500-1000 and >1000 categories. Some users pointed out that even if I remove those groups, it's still comparing two different populations as we have little general retail data. They were valid arguments. Instead, I'm now making inferences only for superstonk users. The other issue with my first poll was overcrowding of the 100-500 groups and absence of a 0 share group. After splitting these into more groups and adding the 0 group, I see a more normal-like distribution of responses. Using a frequency distribution (https://www.spss-tutorials.com/frequency-distribution-what-is-it/), which is a type of statistical binning or histogram (https://en.wikipedia.org/wiki/Histogram), to predict superstonk ownership, I provide an estimate that superstonk GME ownership is at minimum 27 million shares, upwards of 35 million. \n\n**Results**\n\n*Respondent Bin Distributions*\n\n\nGroup\t| Respondents\t| Percentage\n:-- | :--: | --:\n0\t| 4\t| 0.250312891\n1 to 5\t| 87\t| 5.444305382\n6 to 10\t| 106\t| 6.633291615\n11 to 15\t| 113\t| 7.071339174\n16 to 20\t| 90\t| 5.63204005\n21 to 30\t| 151\t| 9.44931164\n31 to 50\t| 199\t| 12.45306633\n51 to 100\t| 278\t| 17.39674593\n101 to 150\t| 159\t| 9.949937422\n151 to 200\t| 72\t| 4.50563204\n201 to 300\t| 106\t| 6.633291615\n301 to 400\t| 52\t| 3.254067584\n401 to 500\t| 43\t| 2.690863579\n501 to 750\t| 44\t| 2.753441802\n751 to 1000\t| 31\t| 1.939924906\n>1000\t| 63\t| 3.942428035\nTotal\t| 1598\t| 100\n\nBased on bin sizes and ranges within them, the 11 to 15 bin had the highest representation. In the bins as a whole, the highest number of respondents had between 51 to 100 shares, with 31 to 50 being the next largest bin.\n\n\n*Estimation of 200,000 person population*\n\n\nGroup | 200000 people | Shares min | Shares max\n:-- | :--: | :--: |--:\n0\t| 500.6257822\t| 0\t|  0\n1 to 5\t| 10888.61076\t| 10888.61076\t| 54443.05382\n6 to 10\t| 13266.58323\t| 79599.49937\t| 132665.8323\n11 to 15\t| 14142.67835\t| 155569.4618\t| 212140.1752\n16 to 20\t| 11264.0801\t| 180225.2816\t| 225281.602\n21 to 30\t| 18898.62328\t| 396871.0889\t| 566958.6984\n31 to 50\t| 24906.13267\t| 772090.1126\t| 1245306.633\n51 to 100\t| 34793.49186\t| 1774468.085\t| 3479349.186\n101 to 150\t| 19899.87484\t| 2009887.359\t| 2984981.227\n151 to 200\t| 9011.26408\t| 1360700.876\t| 1802252.816\n201 to 300\t| 13266.58323\t| 2666583.229\t| 3979974.969\n301 to 400\t| 6508.135169\t| 1958948.686\t| 2603254.068\n401 to 500\t| 5381.727159\t| 2158072.591\t| 2690863.579\n501 to 750\t| 5506.883605\t| 2758948.686\t| 4130162.703\n751 to 1000\t| 3879.849812\t| 2913767.209\t| 3879849.812\n>1000\t| 7884.85607\t| 7884856.07\t| 7884856.07\nTotal\t| 200000\t| 27081476.85\t| 35872340.43\n\nUsing the results of the bins, it appears that superstonk users alone own 27.1 million to 35.9 million shares of GME. \n\n**Average share ownership of Superstonk users = 27081476/200,000** to **35872340/200,000** \n** = 135 - 179 shares/person**\n\nUsing the data provided from the poll, I predict Superstonk users own, on average, 135-179 shares per person. \n\n\n\n**Comparison to other studies**\n\nIn another sampling method using direct share input and combing these into 5 ownership bins, /u/Kalaeman used a sample size of over 2000 to predict that the average superstonk user has around 166 shares (+/- 13). Using this data to infer the population, they predicted that from 200,000 superstonk users, 33,200,000 +/- 2,668.433 shares are owned by users alone. Comparing this to prediction of 27.08M - 35.9M million, I can't help but notice the value fits exactly inside my range...  https://www.reddit.com/r/Superstonk/comments/mylv9k/1_billion_share_owned_by_retail_confirmed/\n \n/u/haydoboyo used 14A filing information to predict retail ownings and speculated that, if retail owns at least 3 shares each, the free float is owned. https://www.reddit.com/r/Superstonk/comments/mxkwlb/double_the_short_interest_half_the_anxiety/\n\n/u/InForTheSqueeze also used measurements from the GME 14A release and from brokers to estimate retail ownership. Although there are speculations in these, they support the findings of my study.  https://www.reddit.com/r/Superstonk/comments/mxrdcb/updated_dd_i_did_the_math_there_is_literally_no/\n\n /u/DiamondsApes a month ago looked at broker information to estimate retail ownership as well. https://www.reddit.com/r/GME/comments/m54vpq/serious_dd_retail_ownership_using_public_data/\n\n/u/thedav1d  1 month ago also predicted retail ownership including options. https://www.reddit.com/r/GME/comments/mduj5t/dd_why_retail_is_holding_far_more_shares_than/\n\n/u/brocaa used AI (which is a fancy word for regression analysis) to estimate the number of FTDs hidden by deep ITM options, and predicted around 140M.  https://www.reddit.com/r/Superstonk/comments/mvdgf5/the_naked_shorting_scam_in_numbers_ai_detection/\n\n/u/eastrod, building on work by /u/defj2 (https://www.reddit.com/r/Superstonk/comments/mz7c7h/put_anomalies_pt1_were_127_million_synthetic/), predicted that around 1.09 million puts were possibly used to reset 109 million FTD https://www.reddit.com/r/Superstonk/comments/mzgtvx/a_method_for_hiding_ftds_that_uses_the_109mil/\n\n\n/u/33a also shared their findings:\n\nEstimate based on comparison to other securities and general buying patterns https://old.reddit.com/r/Superstonk/comments/mwn95o/retail_is_the_whale/\n\nEstimate based on fidelity order volume and level 2 order sizes https://old.reddit.com/r/GME/comments/msyhlq/fidelity_users_purchased_about_61_million_more/\n\n\n/u/ColonelOfWisdom speculated, with relevant information, that hedge funds had plenty of opportunities to close their short positions leading up until now. However, these methods offer the *opportunity* for these events to happen, not *proof* they happened https://www.reddit.com/r/GME_Meltdown_DD/comments/mxj6a9/faqs_about_the_gme_situation/. Support for their argument came from the diminishing of reported SI% from 140% to 20-40% as of last filing. \n\nhttps://iamnotafinancialadvisor.com/GME/, who originally predicted the FTD squeeze and how uncoiling the spring is a possibility, predicts that based on current trends of reported FTDs, the FTD cycle is diminishing. However, based on information here, it is entirely possible that the FTD cycle peaks are diminishing because of FTDs being hidden. \n\nAnd lastly, SI% has been around 20 - 40% (https://www.marketwatch.com/investing/stock/gme - https://finance.yahoo.com/quote/GME/key-statistics/). However, as mentioned, SI% can be hidden in options and through other methods. \n\n\nNow, the first question on your mind is: \"can't users just mess with the results? I mean, that's what I would do. Polls are useless anyway.\" I would agree this is possible. For example, in my two polls, the percentage of respondents for each group changed a maxmimum of 2% over each bin. For large bins, this doesn't affect the results much. But over smaller bins with high underlying values (the >1000 bin, for example) the 2% is a large change. However, the underlying findings remain the same for either poll and for the other presented by /u/Kalaeman, reducing the likelihood of tampering. \n\n\n**Methods**\n\nI used a poll to estimate superstonk GME ownership using strawpoll. Original poll is available here: https://www.strawpoll.me/42979202/r and the newest poll is available here: https://www.strawpoll.me/44432640/r. The settings were such that each IP address was only allowed to vote once, and Captchas were in place to prevent bots from interfering with results. The polls had 1200 and 1598 respondents, respectively. To try and minimize observation bias, such as through trolling, manipulation, or other means, I used a frequency binning method. Bin sizes were determined based on the first study to minimize overcrowding of bins. Frequencies observed from the 1598 sub sample were used to infer the ownership from 200,000 superstonk users. Average share ownership was calculated as **predicted total shares / 200,000**. At 1598 users, the margin of error was calculated to be approximately 2%. \n\n\n**Conclusion**\n\nI don't know what overall retail ownership is (although there have been predictions), but from superstonk users alone, it seems the free float is owned. Now, the question everyone wants answered: \"Will this moon? When?\" I don't know the answer to either question. But considering that the remaining free float is predicted to be 26-30 million ish and superstonk alone owns that much, I think it's safe to assume GME is significantly oversold. What should you do? Fuck if I know. The data here isn't telling you what to do, rather providing you with information to decide for yourself what fits your investing goals best. And of course, if you have any comments or criticisms, I'm all ears to them! I'll probably argue with you, but if you convince me with a good argument, I'll (hopefully) listen to your criticisms.",
    "title": "Users of Superstonk ALONE own between 27 million and 35 million shares of GME",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mzvy41/users_of_superstonk_alone_own_between_27_million/"
}