{
    "author": "augrr",
    "created_utc": 1619537242.0,
    "distinguished": null,
    "edited": false,
    "id": "mzqzbm",
    "text_only": true,
    "flair_text": "𝘜𝘯𝘷𝘦𝘳𝘪𝘧𝘪𝘦𝘥 𝘋𝘋",
    "name": "t3_mzqzbm",
    "num_comments": 76,
    "permalink": "/r/DDintoGME/comments/mzqzbm/the_shell_game_series_ftds_clarified/",
    "score": 674,
    "selftext": "# The Shell Game Series – FTDs clarified, posted on /r/DDintoGME/ for consideration.\n\n[The Shell Game](https://imgur.com/wKBpPdI)\n\n#####[Shell Game I] (https://www.reddit.com/r/Superstonk/comments/mvvmvp/time_to_expose_the_shell_game_ftds_can_be_reset/)\n#####[Shell Game II](https://www.reddit.com/r/Superstonk/comments/mwnnmj/the_shell_game_revisited_how_etfs_work_and_what/)\n#####[Shell Game III](https://www.reddit.com/r/Superstonk/comments/myn9vn/the_shell_game_iii_lifting_the_final_cups_for/) - Posted below\n\n#🚀In my mission to continue to deconstruct months of inaccuracies regarding FTDs, I will state plainly:\n\n* ##A FAILURE TO DELIVER IS A NAKED SHORT POSITION AT THE TIME OF THE OCCURRENCE OF THE FTD.\n\n* ##1 FTD = 1 SHORT POSITION THAT NEEDS TO BE COVERED.\n\n#🚀 The following definitively points to why this is the correct line of thinking:\n\nSince I am a huge advocate of open-source data and the need for transparency in our financial institutions so we can have truly free and fair markets, I am going to link a paper that will describe the GME FTD problem better than I ever could. I implore every ape who is invested into GameStop to take the 30 minutes it takes to read this paper, and really **READ THE PAPER – YOU’LL THANK ME LATER**:\n\n#####Brooks, Robert, and Clay M Moffett. The Naked Truth: Examining Prevailing Practices in Short Sales and the Resultant Voter Disenfranchisement, The Journal of Trading, Aug. 2008, https://csbweb01.uncw.edu/people/moffettc/about/Research%20Papers/IIJ-JOT-BROOKS.pdf\n\nAs you can see, it is rather simple to create phantom shares during the ETF Redemption/Creation process. **And the ones that solely hold the keys to this practice are the MMs/Authorized Participants who manage GME ETF funds.**\n\nAlso, I want to bring special attention to PAGE 10, where we see a chain of pledges of 100 shares loaned out on promise after promise after promise. This is known in the GME ape community as “hypothecation”. To the DTC, these are “Pledged Shares” as described DTC-2021-005 that is still missing from their website due to “technical language”. https://www.dtcc.com/legal/sec-rule-filings. I have previously written my thoughts on what the 005 meant at the time, so seeing it displayed on Page 10 was quite exciting. [Click here to read that paper for a better understanding of what hypothecation means.](https://docs.google.com/document/d/1Pw4LqHrFmcd-tC6VZIkrjIxkXOF0741bD6KYVTHXRZk/edit)\n\n#🚀 GME FTDs are the catalyst that will move the market.\n\nYou read it right. [The FTDs on GME are so significant, that the market will LURCH the moment we begin lift off.](https://www.reddit.com/r/GME/comments/m6mje0/gme_beta_from_bloomberg_and_ownership_update/) \n \n[Click me: GME’s FTDs are completely out-of-whack compared to the rest of the market on a ridiculous scale.](https://imgur.com/7bVduJu)\n\n[Click me too!: If you add in the GME FTDs + the ETFs that also have GME and put them on a log scale (like the COVID curve data from last year, remember my little ape?), you see that the GME and its associated ETFs have 100x – 1000x more FTDs than the average noise of the market. THIS IS INSANE. BLACK SWAN AS BLACK SWAN GETS.](https://imgur.com/weTaZXz)\n\nTherefore, if we apply this new knowledge that **EVERY FTD = A NAKED SHORT POSITION** to GME today, the picture becomes very clear. Every red line on the graph above correlates directly with the volume of open short positions around that date in time. Repeating this for the apes in the back. **THEY MUST COVER EVERY FTD WITH A SETTLED SHARE BECAUSE EVERY FTD IS A NAKED SHORT GENERATED THROUGH OPERATIONAL SHORTING.** There is absolutely **ZERO CHANCE** that any meaningful covering has occurred, and that the severity of the problem is so significant, and so plainly out in the open, **that conclusion must be near.**\n\nWith operational shorting being a function that comes from Authorized Participants, I can conclusively state that ETF FTDs show the underlying are being shorted and that they are linked. [It is time to start looking at this problem AS THE PROBLEM.](https://imgur.com/ZFmsiTu)\n\n#🚀 It is time, Authorized Participant.\n\nI am going to go out on a limb here and speak to the Authorized Participant directly:\nI have clearly been able to demonstrate that the apes have the capability of seeing your Shell Game for what it is. With the SEC expecting all FPL programs to have concluded last Thursday, I imagine you are staring at a new fat 100%, or maybe already 200%, collateral obligation for opening of trading tomorrow (how many of your Calls/Puts expired out of the money AGAIN?).[Can you really survive another day without doubling the % on your obligations?](https://imgur.com/2X5VvFl). **Tick. Tock.**\n\nAre you going to continue the farce, or will you finally allow the American markets to be free and release your puts? The bag does not have to rest on your shoulders. I have barely touched on the potential pitfall that is the ETF Derivative market that you have us leveraged against. But the longer this goes, the more I will continue to learn, digest, and then spit back out until everyone sees this for what it is. People will start to literally believe that $420,690,000 is the floor once that information comes out. Think you can delta hedge your way to that #?\n\n[It is time to cover, Authorized Participant. Do not make the same mistake of those from 2008. Have courage to do the right thing.](https://imgur.com/d6TpIP4)\n\nForecast: **Frothy.**\n\nMoon Soon.\n\n#🚀 I ask that my work be judged on the merits of the text and respectfully ask for any assistance in correcting any errors. I intend to post Shell Game IV soon, but I want to make sure these are iron-clad first.",
    "title": "🚀 The Shell Game Series - FTDs Clarified",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/mzqzbm/the_shell_game_series_ftds_clarified/"
}