{
    "author": "Bye_Triangle",
    "created_utc": 1619795264.0,
    "distinguished": "moderator",
    "edited": false,
    "id": "n1vubv",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_n1vubv",
    "num_comments": 271,
    "permalink": "/r/Superstonk/comments/n1vubv/stonky_news_special_report_dr_susanne_trimbath/",
    "score": 8284,
    "selftext": "This may be our most ambitious crossover event... \n\n[ Dr. Susanne Trimbath AMA Transcription. Summaries, supporting materials, punctuation and memes brought to you by u\\/Bye\\_Triangle, u\\/Luridess, u\\/Leaglese & u\\/Cuttingwater\\_](https://preview.redd.it/c3zziltwmbw61.jpg?width=1432&format=pjpg&auto=webp&s=557fd27d4f535f9214ce7ff6b10c05900b0d53dc)\n\n**I'm Brick and I do news, I come to you with SPECIAL REPORT**\n\n[u\\/Bye\\_Triangle](https://preview.redd.it/o1raj2noqbw61.jpg?width=1200&format=pjpg&auto=webp&s=c6a2d48257078b6c63e9d741c931090e6de6bd18)\n\n**First off, I would like to say a massive THANK YOU to Dr. T. It was out of the kindness of her heart and her passion for justice that she decided to come to speak with us,** ***for free,*** **I might add. Dr. T is a busy woman, so it is an honor that she spent even an hour of her time with us. I for one, am really hoping that we get the opportunity to speak with her again because that was probably our most insightful AMA yet!**   \n**The following is the transcribed conversation between** u/atobitt **and Dr.T, accompanying it are summaries that break down the sections into more digestible pieces.** [**The video of the stream is also available on the r/superstonk official youtube channel if you cannot read.**](https://www.youtube.com/watch?v=fGVY2Kco8ng&ab_channel=Superstonk) **Thank you for being such behaved Apes while Dr.T was here, you are amazing.  💎💙**\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**INTRODUCTION**\n\n[ Kenny G trying to short our AMA less than 2 minutes in. 😂 credit: u\\/stellarEVH ](https://preview.redd.it/mnvgpiiymbw61.jpg?width=936&format=pjpg&auto=webp&s=2c686294c302e62a45916e6940b2a968fb822c58)\n\n* Atobitt:\n   * Thank you everyone for joining us, this is our first r/Superstonk live AMA. AMA stands for Ask Me Anything\n   * I’m here today with Dr. Susanne Trimbath, the author of several books, including what we’ll be covering today, [Naked, Short and Greedy: Wallstreet’s Failure to Deliver](https://www.amazon.ca/Naked-Short-Greedy-Streets-Failure/dp/1910151343)\n   * **May I call you Dr. T?**\n* Dr. T:\n   * Yes, please.\n* Atobitt:\n   * Great. How are you doing? Are you ready for this?\n* Dr. T:\n   * Yes, I’m all set. I’m very excited.\n* Atobitt:\n   * I feel like we are going to finally get this out. Finally get this in front of people that, honestly, keep asking “What’s going on?” and you’re here to provide answers.\n   * Would you go ahead and walk through a brief intro of your background and expertise?\n* Dr. T:\n   * Pretty much all my career has been in finance. I knew from an early age I wanted to study money, basically, and how money works.\n   * I’ve worked with insurance companies, federal reserve banks, stock exchanges, clearing, settlement - that was my career through the time that I went to grad school in 1994 which is when I left the DTC in New York.\n   * Did my PhD in economics at New York University and then went to the Milken Institute (Santa Monica, CA) where I did Capital Markets research for a couple of years before going out on my own. I then did independent research in finance and economics since 2003.\n   * I do want to say that I’ve probably *forgotten* more than what most people will ever know about back-office operations and all the post-trade stuff.\n   * I also worked in Russia to help them build trade clearing settlement systems when they shifted from communism to capitalism.\n   * My expertise is post-trade, not trading or trading operations.\n   * But there are a lot of other people with more expertise who can answer questions about hedge funds, dark pools, trading strategies, that kind of thing. That’s not what I really know most about. I’ve taken an investment class in college, so I know enough about it. **My expertise mostly lies in everything that happens backstage at Wall Street.**\n\n**TL:DR 🦍 Summary:** Dr. T has experience across a wide spectrum of the financial markets, including knowledge globally. More specifically, her expertise lies in everything\n\nthat happens “backstage at Wall Street”.\n\n* Link to Dr. T’s Full Bio: [https://www.gminsight.com/bio-susanne-trimbath](https://www.gminsight.com/bio-susanne-trimbath)\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**HOUSE OF CARDS / THE EVERYTHING SHORT**\n\n* Atobitt:\n   * And that’s what’s so incredible about having you on here because a lot of people are just trying to figure out and get a look inside the DTC.\n   * We’ve been talking and posting about what’s going on, but having you here to actually help us explain that and to dive into the follow-up to [House of Cards](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/?utm_source=share&utm_medium=web2x&context=3), which you generously spent time reviewing, as well as [The Everything Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/?utm_source=share&utm_medium=web2x&context=3).\n   * **A lot of people want to know, just high-level: How close were we? Are we trying to shout the same message?**\n* Dr. T\n   * HoC is a lot more of what I know\n   * Everything Short - there’s a lot of stuff in there that I’m not as experienced with. I offered you some comments on that, but I don’t think I can be as helpful there.\n   * On HoC, some things you caught on to.\n   * For example:\n      * DTC rule changes about not allowing issuers to say “I don’t want to be in the depository”.\n      * Most people would have missed that because that really came about as a result of one issuer telling their shareholders to pull their certificates out of the system\n      * So rather than leaving their shares with their broker, to get them registered in their own name.\n      * That had been done on a small scale before.\n      * But for this issuer, a lot of people/investors were organized, and pretty much everything came out.\n      * At that point, the DTC said issuers can’t request this.\n   * Now, an individual can still ask to have their shares registered in their name.\n   * Gamestop has a direct stock purchase program where you can buy your shares directly from them, I think the minimum purchase is $25 for a one-time buy.\n   * So you can still do it, but finding that example in HoC showed me:\n      * **you’ve done a lot of background research;**\n      * **you came up with a lot of things people missed**\n   * There were a few problems with HoC in there.\n   * The big problem for me is when you said Cede & Co is a company.\n      * In fact, Cede & Co is a **nominee name**. Think of a Trustee/Custodian relationship.\n      * All banks/brokers have a nominee name they use for securities registration.\n      * Any shares registered with a nominee name signals to the issuer that those stocks are not held for the company, that they’re actually held for someone else.\n   * Trivia about Cede & Co. name origin:\n      * short form of **‘Central depository’**\n      * They started out as a department at the NYSE\n      * And when they needed to get a nominee name to hold securities for trade settlement, they used Cede & Co.\n* Atobitt:\n   * Thank you for clearing that up and for the compliment.\n   * I heard some theories from others but your version is like hearing the Gospel because it’s coming from a credible source.\n* Dr. T: \n   * Yes, “Central” because that’s where all of the NYSE members could deposit shares/certificates there\n   * And Cede & Co would hold it for them so they could use it for trade settlement because in the late 1960s there was a paperwork crisis on Wall Street.\n   * They couldn’t get shares transferred or re-registered from one name to the next when you sold securities, in time for the two-week settlement cycle.\n   * So imagine as you’re trying to go from T+5, T+3, T+2, how difficult it became.\n\n**TL:DR 🦍 Summary:**\n\n* Cede & Co is a nominee name, banks and brokers have custodians they use for securities registration, any shares registered with a nominee signals the stocks are being held for someone else.\n* Cede & co came about owing to a paper crisis as trades increased, and they became the nominee to hold a majority of securities.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**THE BIG ISSUES**\n\n* Atobitt\n   * I know you’ve drilled in a couple of really big points in your book about your personal feedback on some T+10 settlements\n   * Our main focus:\n      * There are these shares that are just kind of floating around, being borrowed and being lent and lent again. It creates this problem where nobody knows exactly what is going on or who owns what.\n      * We just know there are more shares out there than the company originally issued\n   * **In a perfect world, how would a naked short sale be held in account/ kept accountable? How would that go in a perfect world?**\n* Dr. T:\n   * **In a perfect world there would be no naked short selling. PERIOD.** That’s really an exception. In most Market Maker underwriting agreements, there’s a little clause where the issuer agrees that the underwriter in the remarking agents can in fact sometimes sell more shares than they actually have in order to keep the market flowing, in order to meet demand.\n   * In a perfect world, if I was an issuer I wouldn’t agree to that\n   * **In a typical short sell situation:**\n      * The retail customer puts in an order to short sell the stock.\n      * The broker finds somewhere to borrow it so they can make delivery.\n      * They either pre-borrow or borrow at least within 2 days of executing the trade.\n      * Borrowed shares are then delivered to the buyer, who then gets all the rights, including dividends and voting rights \n* Atobitt:\n   * So the rights are being transferred right along with the shares that are being borrowed and that shares may be borrowed multiple times, correct?\n* Dr.  T:  \n   * It can, it’s not supposed to be, but it certainly can be. Because the buyer often doesn’t know they are getting a borrowed share-- right?\n   * There was a time, in the 70s, when broker friends, of mine would tell me they would not accept borrowed shares at settlement, because of the chance that they were borrowing a borrowed share. Basically, they would not be the buyer in a short sale.\n   * This is where it starts to get into the ‘not-so-perfect world’\n* Atobitt:\n   * The perfect segue!\n* Dr.  T: \n   * In a not-so-perfect world… the short seller, even one who borrows, may or may not “mark the trade”. I say “mark the trade” that's old school. You actually used to have a piece of paper, you would write short on that piece of paper and say “I’m sell 100 shares of something-or-other\n* Atobitt:\n   * Are there the short sale indicators that we are seeing on FINRA reports? Ex - “Failure to mark as short sale..” \n* Dr.  T: \n   * Yeah, yeah, it used to be that you’d actually write it on paper and now it's electronic, so there is something in there. So, If the short seller knew that buyers would not accept borrowed shares, they might in fact *“forget”* to mark it short*,* right? \n   * So there is no record of a short sell anywhere, not at the exchange level, and certainly not… there is no indication to the buyer that they are going to be receiving borrowed shares. \n* Atobitt:\n   * Really quick, there, so I can understand; That is, in essence, a way for them to say “Okay, The system wouldn’t typically allow for someone to take a share that’s marked as short or marked as borrowed, and by excluding that, it doesn’t give the indicator and allows it to go through the system.“ \n* Dr.  T:\n   * Right… the buyer is the one who wouldn’t allow it. It’s not that the system doesn’t allow it.\n* Atobitt:\n   * But the buyer doesn’t know the difference? \n* Dr.  T: \n   * The buyer doesn’t know the difference. But, at the brokerage level, broker to broker, \\[the short sellers\\] know when they put that trade together, that they are selling short. If they don’t turn on the indicator, that's where the violations come in. Especially, post Regsho, in the ‘04 period. That became a MAJOR issue, because the number of shares circulating was so much greater than the short sales.  \n\n   * So that’s one problem that occurs, the other one is that;  you mark the sale short and you ***pinky-promise*** that you’re gonna deliver the shares… but then you... “Forgot” to borrow them, Didn’t borrow them, thought you could get them but then you couldn't get them, and maybe someone promised they’d lend them to you and then at the last moment they didn’t.  \n\n   * So that's another problem that occurs, right? Even if you marked it short, you may or may not be able to get the borrowed shares to deliver. \n\n**TL:DR 🦍 Summary:**\n\n* **In a perfect world, there'd be no naked short selling.**\n* In underwriting agreements, **MM or agents can sell** ***more*** **shares than they have** to **meet market demand**. When a share is borrowed, the rights of the share borrowed are also distributed with it\n* Brokers can know whether something purchased is borrowed if it is marked, but often **direct buyers (retail) don’t know that they are buying short, borrowed shares.** \n* There have been m**any cases of violations of brokers 'forgetting' to mark shares as short** just so they can open the short position, even if this later has a high likelihood of becoming FTD because shares without this designation are more likely to be bought by brokers.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**BYRNE AND OVERSTOCK**\n\n* Atobitt:\n   * So on that point, I think it's a great time to segue into-- You spent a lot of time in your book, talking about Patrick Byrne and Overstock.\n* Dr.  T:\n   * Yeah\n* Atobitt:\n   * I think it speaks volumes… you were using words that I think were *very* generous, like “accidentally” or “*may not* have”, or “we left out something that we should have covered by sorry we forgot”\n   * Would you mind giving us an overview of what happened with Patrick and Overstock?\n* Dr.  T:\n   * Yeah, so that was really interesting… Patrick was very active, this crusader-- self-declared crusader against naked short selling. \n   * So there is this group called the **North American Securities Administrators Association (**[**NASAA**](https://www.nasaa.org/)**).** Every state has a securities admin, someone who takes care of the rules in their organization. \n   * Well, I may get some dates and names wrong..\n   * This whole thing was coming out, companies and investors were complaining at the state level regarding Naked Short Selling, stock loans, and all that.\n   * They called a panel discussion in Washington DC at the end of 2005. I was one of the people on that panel. \n   * I didn’t know Patrick at the time but knew that there were people like him, investors and CEOs of companies, in the audience. I stunned them by presenting a report from the Securities Transfer Association that indicated that **of the 285 proxy vote cases examined** (votes at corporate annual meetings of shareholders), **all 285 have over-votes**\n   * **Over-vote is when there are more votes than shares available**\n   * And this happened in all cases, sometimes by a large amount\n   * To be clear, the problem is a little better now, **only 85% of the test cases** had over-votes but it’s far from fixed.\n   * So, they were really shocked…\n   * I put out a challenge to all the CEO’s in the audience, and I said: After this seminar **buy 10k shares of your own company** and at that time, three days later the broker is going to take money out of your account and will tell you that you have your shares.\n   * But go ask them if you actually received your shares. Now, if **you or I went to a retail broker and asked that question, they would say “yes, it’s right here in your account”**\n   * But if you’re a purchasing power or a corporate CEO, you have tighter connections and they will really dig into it to make sure.\n   * Eventually, **his broker confirmed to him that he did not get the shares** and that multiple attempts to purchase the shares to replace what he didn’t get failed. **There were simply not shares available to meet his purchase.**\n* Atobitt:\n   * You’re talking $50 million worth of shares\n* Dr. T:\n   * They’re happy to keep his money, but t**hey knew they didn’t have the shares for him.** \n   * But **it took him two months**, as CEO of the company that he’s trying to buy shares from, took him **two months** to get his shares\n   * It’s a prime example of how **retail brokers don’t know what’s going backstage**. Retail brokers know what’s going on in front of them, on the record, but not what’s going on backstage behind the scenes.\n   * This got a lot of attention.\n   * Bob Drummond from Bloomberg Magazine wrote a multi-page article called [**The Proxy Voting Charade**](https://web.archive.org/web/20060421085925/http://www.rgm.com/articles/FalseProxies.pdf)**,** which was inspired by his attendance at that meeting in 2005 where I was a panelist, where there are people voting as shareholders in matters of corporate governance which are so important, and yet their votes aren’t counted because there are too many votes coming in\n* Atobitt:\n   * Exactly and we’re actually dealing with that right now with Gamestop - dealing with the proxy voting and Gamestop\n   * And tying that back in there, we had a volume chart - before we got into the peak here before the run-up we were having upwards of 180 million shares traded per day\n   * 197 million  was the peak there - we’re talking about circulating the same stock four times\n* Dr. T:\n   * In one day, their entire capital - so that number of shares outstanding, that’s their capital statement, that’s on their balance sheet, that’s what they report to the Secretary of State in the state where they’re incorporated about what their capitalization is like\n   * And in 1 day… that’s crazy\n* Atobitt\n   * That’s incredible, a really good point.\n\n**TL:DR 🦍 Summary:**\n\n* This problem of naked shorting, and by extension, overvoting is not restricted to GME at all, in fact, it appears to be a major issue industry-wide.\n* Even the CEO of the company Overstock, purchasing their own stock, couldn't have their broker find the actual shares purchased, it took 2 months before they did.\n* The fact GME traded nearly 4x its float in 1 day is insane.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**ETG LAWSUIT AND NAKED SHORTS**\n\n* Atobitt:\n   * And just a couple of other points on top of that:\n      * That wasn’t the only lawsuit that we’re talking about here as well\n      * In addition to Patrick, in 2006 lawsuits were filed against 11 prime brokers for allegedly doing the same thing, and according to your book, they were conspiring to do this.\n* Dr. T:\n   * ETG filed a lawsuit think it was settled out of court\n   * I don’t think there’s any public information about the resolution\n   * This is a really important point though because we want to talk about 65 million shares that the company issued and yet 180-210 million shares outstanding\n   * ETG’s complaint:\n      * their financial model was for shorting a particular stock included the fact that the shares were borrowed and would eventually have to close the short and replace them\n      * if the prime brokers were giving their funds/trade orders to a group, and that group is not borrowing the shares to deliver, then that ruins their financial model\n* Atobitt\n   * Can you segue from this into the Triumvirate Trouble, because I feel like that’s kind of what you’re touching on here?\n   * So it’s not just the naked short selling, but we have these other additional factors - can you please elaborate on that?\n* Dr. T\n   * **the triumvirate of trouble is:**\n      * **shorts (naked or otherwise);**\n      * **FTDs; and** \n      * **loans** \n   * even shorts covered by a borrowed share will increase the number of shares in circulation\n   * While that share is out on loan, there are actually two people claiming ownership, but only one person owns it and the other “kind of\" owns it, like they have a marker and then eventually the shares will be delivered back to them and they’ll have their ownership right”\n   * **So even a short covered by a loan is a problem**\n   * And when you throw in fails to deliver, which means that long or short, you just don’t show up at settlement with shares, all of those add to the increase in “the Denominator”\n   * I don’t want to get too “math-y” on you but I noticed some highly educated and technical persons in your audience: so the denominator in the financial ratios is shares outstanding\n      * ½ is bigger than ⅓ \n      * So as you increase the denominator you decrease the values\n      * That just throws all the financial ratios out the window\n* Atobitt\n   * High level - are the incentives for these companies to Fail to Deliver instead of just covering their shorts like they’re supposed to?\n* Dr. T:\n   * that's a trade type question, but what I can say is up until recently there was no penalty for FTD\n   * It was only recently that the NSCC and others have started to put in penalties: there is flat fee penalty, per dollar penalty, daily interest penalties\n   * There was a paper done in the early 2000s by a researcher at the SEC that talked about **strategic fails to deliver**, i.e. they give me money and I give you nothing and I pay a little fee to whomever I failed to deliver to, in the meantime, I have your money so, for two months, Patrick’s broker had use of his money that they could use freely do to as they wish for their own benefit and interest - free available capital\n   * this is incentive enough, having the cash of someone else, it's only a little fine you have to pay and they can earn enough to make the cash back and more so that it's worthwhile to pay the fine\n\n**TL:DR 🦍 Summary:**\n\n* ETG filed a lawsuit that was settled outside of Court to keep things hush-hush, but it was based on their shares outstanding vastly exceeding their float.\n* You will likely never hear publicly about successful cases if settled.\n* Penalties have only recently been introduced for FTDs. \n* What's the incentive for them? Money. It's always money. \n* Before, they would take someone's cash via FTDs, to then make more cash and only get a slap on the wrist for doing so. \n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**DTC COMPLAINT PROCESS**\n\n* Atobitt\n   * Let’s segway into DTC oversight incompetence and their involvement\n   * What did the DTC do when complaints were received?\n   * Can you walk through how that management info system kept track of these issues?\n* Dr. T\n   * I worked in troubleshooting in DTC, dealt with all the operational-- everything that didn’t balance in operations\n   * We’d send something to a transfer agent to have it re-registered in Cede & Co’s name, from Merryl Lynch or whatever, and a month later it hasn’t come back yet\n   * So that item appears on a list for the supervisors in the morning\n   * There’s a similar activity in the vault - for example, they get a break list every morning, and it says “this is what is on the shelf and this is what we’re supposed to have\"\n   * In other words, this is what the system says is on the shelf vs this is what we’re supposed to have, and we need to figure out why there is a different settlement amount between the two numbers.\n   * The only one who doesn’t get this list is money, because on the money side if you don’t deliver your money by 4 pm someone’s on the phone calling you to get your money in, so that’s a whole different issue.\n   * In this scenario, we’re just talking about shares on the lists\n   * So those lists, and I know from my work in troubleshooting those lists… Those lists are sorted by VALUE.\n   * So we have aged fails, aged transfers, and they always come out by value and you always hit the big value items first\n   * u/StonkU2 **and I spoke about this as well: as the brokers continue to short, or naked short a stock, they continue selling more than buying to push the price down, and as they push the price down they can in fact keep dropping that item further down on the priority list for investigation at the DTCC because now it has a lower value**\n\n**TL:DR 🦍 Summary:**\n\n* DTC has a list of issues to rectify sorted by value alone.\n* By driving the price down, the short seller not only drives the price to the ground and makes money, but because investigations are dealt with on a value basis by the DTC, the further the price goes down, so does the priority level of the issue, in the DTC’s books. \n* *\\* Editor’s note: Mind-blowing.*\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**NAKED SHORT ENDGAME**\n\n* Atobitt\n   * So, you’re intentionally lowering and reducing the priority of a stock.\n* Dr. T\n   * And I think a related question came up in the AMA that I read.\n   * I can’t remember who it was from but it was along the lines of “what happens when the company goes out” right?\n   * So the End Game in naked shorting is that you **deny the issuer access to capital by pushing down the stock price**, so the only way they can raise capital was if they come out and issue new stock, so now you’re getting bigger and bigger shares of equity for less and less money\n   * So if your stock price is up that’s when you want to issue more equity because you’re getting the interest and capital\n* Atobitt\n   * Gamestop is taking advantage of that right now too -market price is high, it’s a good time to make some cash\n* Dr. T:\n   * That’s the time to do it because if they need capital if they want to raise capital, that’s the way to do it\n   * By pushing the stock price down they are denying the issuer access to capital if the capital is really important -for example if you don’t have money to expand your business, buy new equipment, capital purchases, eventually, they can drive the company out of business\n   * Once they do that, then all of the fails, shorts, loans-- everything is erased because the stock’s declared worthless\n   * Technically, if you can’t get a share transferred, re-registered from one name to another for two years then the DTC can declare the stock worthless\n   * At that point, they just archive the records and shred the certificates\n   * One of the AMA questions that came up is related to this - **there’s so much damage done,** not just to the investors-- of course the investors suffer\n* Atobitt\n   * Would you say about 7500 companies have been put in a coffin because of activity like this?\n* Dr T:\n   * It’s hard to say.\n* Atobitt:\n   * I just remember something similar to that in the book\n   * It’s just mind-blowing that this is that systematic.\n* Dr. T:\n   * There are companies that get started, fail, and go out of business. That does happen, so DTC has a procedure to do this\n   * But the idea of it - it’s just very official\n   * If you can’t make a transfer in two years, it’s worthless, your broker shreds the certificates, and then that’s the end game for that asset grab in particular.\n\n**TL:DR 🦍 Summary:**\n\n* Driving a stock price down restricts the availability of capital, which in turn assists in running the company out of existence as they can't issue to generate capital.\n* The ultimate goal of naked short sellers is to make the company worthless, at that point, every action they’ve taken to manipulate the stock price and hinder the DTC investigating disappears into shredders and archives. BRRRR.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**FTD’S, BANKS, SEC EXAMINERS** \n\n* Atobitt\n   * Yeah… I mean that story to me, about having the option, in audit, and all these internal controls, where do you have the incentive/opportunity to cheat the system? *that is a red flag* on top of some of these points that you have.\n   * In 2008 the banks that were the source of these FTDs began to see their *own* shares FTD and so to protect them the SEC stepped in **and stopped short sales against these securities but JUST the securities of those banks**.\n* Dr. T\n   * Exactly, and that was the ?? went to congress and said they’re “Help me help me they’re shorting my company now!” but, they’re the perpetrators!\n* Atobitt\n   * It just sounds way too familiar with what happened with Robinhood not too long ago.\n* Dr. T\n   * And then on the other side of that coin is that, and I do need to mention this, in Europe and Asia when they stopped naked short selling they stopped it in *all* the stocks it wasn’t just the banks in the US they only protected the banks.\n   * That’s a really big red flag, why stop it just for the banks when they were the ones causing most of it?\n\n**TL:DR 🦍 Summary:**\n\n* Evidence and history have shown that the SEC will step in to help the FTDs of the *banks*, but they historically will **not** help other stocks such as GME. \n* The evidence is that the SEC prevented naked short selling of the **bank** stocks and **no one else’s**; whereas in Europe and Asia they protected *all* stocks from naked short selling.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n* Atobitt\n* And so when a lot of these SEC examiners would come over to the DTC, people that are behind the scenes and outside of this we have this impression that these people are being parented. Like mom and dad are making sure the kids aren’t breaking the law, but when they would come and see you, generally the first question out of their mouth was?\n* Dr. T\n   * What does DTC do?\n* Atobitt\n   * What does the DTC even do? And when you mention another point in here “it is easier to pass a FINRA exam in order to become a broker than it is to get your *barber’s license*.”\n* Dr. T\n   * In most states, yeah. Yeah.\n* Atobitt\n   * That is just *mind-blowing* to me.\n* Dr. T\n   * It’s not that difficult to do. A lot of times a lot of people will get hired and trained on the job *whilst* they are passing their series 7 license. \n   * So it’s not, look they just have to know some fundamentals there are things like a certified financial analyst right, CFAs (*Atobitt agrees*) right because that’s an official designation beyond I understand the mechanics of stock trading, it’s I know something about financial analysis behind it.\n* Atobitt\n   * And to that point you were, I think you said 73% of the exam was basically them telling people which stocks to invest in as opposed to what the process of this is, it was like advising almost in that exam.\n* Dr. T\n   * Yeah and that FINRA exam there’s, you can see some of the questions and sample questions, you know it’s pretty ‘accessible’\n* Atobitt\n   * \\*sigh\\* unreal. So to kind of group this in, I feel this is a good time to bring this in, what we’ve done is taken a list of questions that were pertinent to this conversation and I’ve grouped them into about 20 relevant questions like FTDs or regulation or compliance and oversight and as we’re having this conversation I’m trickling these questions in.\n   * And then afterward when we post the follow up which will be posted after this these people will be able to see these questions and shout those people out but we had a lot of questions on this with the regulation and I think a lot of people don’t know that these people are SROs, Self Regulatory Organisations and they don’t fall under the realm of things like the Dodd-Frank and some other regulatory acts \n   * So, it is just overwhelming the things you have put in your book to address this, like the triumvirate of trouble but how this is allowed to be this pervasive and the system actually *allows these people to* fail to deliver which is something, as you mentioned, we need to raise the pitchforks about.\n\n[u\\/mortz232 Pitchfork Army is here ](https://preview.redd.it/5mg0z9k4qbw61.jpg?width=1156&format=pjpg&auto=webp&s=6f8bbe7bd0b7b19f1f4ef17dc1e796a86bde5d62)\n\n**TL:DR 🦍 Summary:**\n\n* Historically SEC examiners would approach the DTC and just ask, what do you do? (these are supposed to be professional examiners keeping brokers in check)\n* Dr. T then clarifies a lot of these people (brokers) ‘learn on the fly’ and the qualifications they hold are less difficult to obtain than *a barber’s license in most states*\n* The fundamental understanding of brokers is therefore suspect \n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**COMMUNITY QUESTIONS**\n\n* Dr. T\n   * Yeah, the pitchfork moment you have to find that point where you say enough is enough and I really need to do something.\n   * Um, there was a question from, I just need to go back (*go for it! Ato*)\n   * I don’t really speak emoji \\*laughs\\* Is it auto-bit? Right? I don’t know how to pronounce your handle I’m sorry\n* Atobitt\n   * You’re not the first! It’s fine!\n* Dr. T\n   * u/HappySheeple3 asked the question what can you do? I had a similar question from Rower like what can we do and so I need to go back and it was [**NASAA.org**](https://www.nasaa.org/)\n   * They put together that, a panel discussion in Washington where you know a lot of conversations took place like Overstock and NYSE was there and they had to admit some of the things they did on the proxy **so** [**NASAA.org**](https://www.nasaa.org/) **they have a button at the top of their homepage that says contact your state securities administrator right, so they are the people who are the most interested in the complaints you have about corporate governance, and what’s happening to the company in the state where you are so I did want to mention that**\n   * And then just on the voting itself what do you do? Like you said right now GME is in proxy season? And then there’s the story about Overstock in the book as well like what happened at their annual meeting when they got more votes in and they knew for a fact that members of Patricks’ family did not receive their proxies and so were unable to vote\n   * There’s a guy/website inspectors-of-election.com \n* Atobitt\n   * We’ll link this down below\n* Dr. T\n   * Yeah, you can, the company has to do this, the investors don’t, the company hires an inspector of elections, so like Carl Hagberg, For example, who will actually go in and try to figure out like what if you get, in my view and this is Carls’ view as well and he is much more experienced on that side of the business than I am, if you’re an issuer and you got more votes in than you have shares outstanding you should **not accept** those elections results, you should stop and get this thing straightened out\n   * This will help to reveal evidence if there *is* naked shorting, FTDs can be revealed like that is, there are few things that bubble up there is a lot about FTD and naked shorting that you will never find about public information.\n* Atobitt\n   * *Intentionally* I’m arguing, intentionally too\n* Dr. T\n   * Yes, and even *issuers* have a hard time finding out exactly what is going on with *their own stock,* this is a **long-term** problem. But there a few things which bubble up and one of them is during the annual meeting when it comes to voting\n   * Now after we raised this issue in 2005 there was Broadbridge, who processes a lot of this electronically, put in a service to the brokers, they can pay that if they report more shares to be voted, **THAN** they have held at DTC, then Broadbridge will tell them to ‘fix it’ *before* they tell the issuer\n   * And that is probably how 15% of the overvotes down, right, so they went from 100% of the test cases (Leaglese edit: being over-voted) to only 85% of the test cases, because Broadbridge will tell DTC, of the 1,000,000 million shares, 100,000 are held by Goldman, Merryl etc. So Broadbridge goes to Goldman and says you have 100,000, who does the vote go to?\n   * Goldman then says we have 200,000 or 150,000, Broadbridge will say sorry, you only have 100,000 so you need to fix this. Goldman then has a system where they have retail investors, within their accounts that they have more shares than actually existed.\n* Atobitt\n   * Gamestop is bouncing between 100-200%, institutional ownership is over 100%\n* Dr. T\n   * A really important point is the institutions have to get up in arms about this, proxy voting charade, Bloomberg magazine has a lot of details about how anybody wants to understand that issue in more detail\n\n**TL:DR 🦍 Summary:**\n\n* Actionable steps that could be taken include, visiting [https://www.nasaa.org/](https://www.nasaa.org/) and contacting their local securities administrator as *they* will pay attention, as her friend Patrick did. These are the people that want to know about this stuff.\n* Dr. T’s position is that overvoting is a huge problem, and it is ***not*** solely confined to stocks such as GME. In fact, even now 85% of stocks are over-voted and that’s because of the influence of a company who deals in trying to fix it, before, 100% of stocks in 200+ test cases were regularly overvoted.\n* Where a stock is over-voted, this provides *proof* the stock is naked short sold and/or has a high number of FTDs. A problem prevalent throughout the industry.\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**AUDIOBOOK - NAKED, SHORT, AND GREEDY**\n\n* Atobitt\n   * By the way, you have a huge demand for an audiobook right now too. Maybe we can talk a bit more about that offline?\n* Dr. T\n   * So, I just wanted to say I have talked with the publisher and he is in London so he is, in contact with the Royal National Institute for the Blind, and that’s not an audible book, for commercial purposes, but we are trying to make it available for those who are sight-impaired\n* Atobitt\n   * You heard it here first, so got that in the works, that is incredible, that is excellent\n   * Would you mind if we went ahead and transitioned into looking at the evidence? So we’re trying to lay out the groundwork of what has happened here we have these shares that are just rehypothecated to oblivion.\n   * We have the DTC that is not really… doing a whole lot to kind of, or any sort of agency that is in charge of, they’re more incentivized to keep the problem going and we’re trying to blow the lid off of it but looking at the evidence going forward I am going to be writing a lot of the stuff we talk about here in HOC 2.\n   * You mentioned a bunch of stuff in the book about a bunch of these numbers that I’d like to go over at a high level and we can discuss what the implications of some of those might be.\n\n**TL:DR 🦍 Summary:**\n\n* Dr. T and Atobitt think it is a great idea to make this information available to apes who are sight-impaired, and the mods of r/Superstonk think so too.\n* Ato prepares to dig into the evidence to support the position.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nSee part two here (too many characters for one post): \n\nPart two includes: \n\n\\-**THE EVIDENCE**\n\n\\- **GET OUT OF JAIL FREE**  \n\n\\- **PUTTING THE** ***FAIL*** **IN FAILURE TO DELIVER**\n\n\\- **NEW RULES, AND HOW WE MAKE A DIFFERENCE**  \n\\- **HOW THE EURO-APES SAVE THE DAY**\n\n\\- **FOR NOW, IT’S GOODBYE** \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_",
    "title": "🚨📺 STONKY NEWS ~SPECIAL REPORT 📺🚨 Dr. Susanne Trimbath AMA Transcription and summary, with supporting materials (and memes)",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n1vubv/stonky_news_special_report_dr_susanne_trimbath/"
}