{
    "author": "WillyTheKid007",
    "created_utc": 1627368393.0,
    "distinguished": null,
    "edited": 1627374890.0,
    "id": "oshnoh",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_oshnoh",
    "num_comments": 188,
    "permalink": "/r/GME/comments/oshnoh/moass_is_going_to_happen_with_the_new_rules_the/",
    "score": 1810,
    "selftext": "12:39 am Tuesday Morning, July 27.  Shitadel is lit up like a christmas tree.  Again...\n\nLet me take an aside for a moment. Writing on these forums puts you out there for the public to see. You will encounter so many different people... and so many different reactions. I'm fine with that. Not everyone will agree, and that's really good for me. If the world were full of 'yes' people, life would throw me for a loop. No one asking questions? No one thinks I'm crazy? No one has another opinion? Really? As long as I can help one person expand their lines of thought and awareness, and lead them to ask their own questions, I can say I made people think.\n\nOnwards...\n\nThe MOASS will happen. I am 100% convinced of it. Essentially when you boil it down, the latest documentation from the Federal Government is an attempt to impose 'conditions' on a firesale regarding actions done by the SHF’s. Translation: the Federal government admits the MOASS. It admits that the odds are impossibly favored for GME. And they will control the MOASS when it happens. Yes, this is as head-shaking as it sounds. But many predict that they will exert some form of control over the event. To use an analogy, earthquakes, the very destructive ones, can be caused by ‘grinding’ of tectonic plates (the one continents sit on – yeah, don’t tear me apart, I only took a beginning Earth Science course). They are preparing to unleash controlled massive explosions on the ocean floor to ‘help’ the plates move in a ‘controlled’ manner rather than one monstrous destructive motion as nature intended. So they will help it move in intervals of time, rather than one big destructive MOASS. Though the time frame for when it will begin is unknown, the length of the ‘government controlled MOASS’ could be one month; could be several months; could even be a year or longer. We just don’t know. For sure they want to prevent the destruction of their financial sector. The do not want a financial Chernobyl on their hands, or a 2012 movie type tidal wave. So the MOASS will happen. Money will change hands. I will get wealthy. So will others. But it if does move veeeeeeeery slowly, just hold on, especially if there is heavy government interference as they let the MOASS gradually go.\n\n*Edit 1: Please do not take this to be certain.  The NSCC are supposed to be under the watch of the SEC... hmmm ... are swinging their 'CONTROL' bat at the MOASS.  It will happen.  They are gonna flex their muscle and will to try and control the ungodly damage the MOASS will cause.  But in the end, the MOASS may prove to be far too powerful to control.  Then of course, do not forget about RC...*\n\nOf course, you are all already a part of history. Your kids will probably learn about this in school.  Or their kids kids.  To my knowledge, a Short Squeeze has never had this much attention or interference before. I hear Netflix has bought the rights to The Big Short II.  The one question on everyone's mind: what does Gamestop and RC have planned?\n\nNow, as one person mentioned, they would not feel good if they didn't spread the knowledge they learned to help fellow apes.\n\nIn my last post I mentioned key families that are entrenched, for better or worse, into the fabric of the Ultra Wealthy. It is from mostly these families and their friends/bankers/SHF's + the Fed where we will be receiving our wealth. But winning this wealth, or receiving a sum of money that is life-changing, or generational wealthy changing, is only Step One. Step Two must be managing it.\n\nI've received a great deal of feedback stating my beliefs are FUD when exploring the danger of having such wealth in our hands. I don't believe it is FUD, not if a person has the knowledge that will lead to the capability of handling the great responsibility of becoming a new millionaire, or even billionaire. Heck, I bet there will be some trillionaires out of this. Thing is, having all this sudden new wealth will be new to most of us. Me included. And like putting a weapon in the hands of the untrained, it can be harmful.\n\nEven if you gamble wrong and end up paperhanding early (not suggesting you should at all... but shit happens, and woe to me to harp on your about your own personal situation), there are ways that you could/should do to research how to grow wealth. But if you do try and grow it, do NOT trust others with your money unless they come from an official certified institution and have the official certification to be of service to you. This bit is beyond my knowledge, but there has been plenty written here about doing so, by people versed in this Service. But if your good friend or family member brings to you a Joe Shmoe that they somehow ‘know to be a money expert’ and he/she says 'hey bud, trust me, I'll make you a billionaire. Just gimme your millions!'... back off carefully while saying 'no' and get away from them...\n\n*Edit 2: This is not altering the MOASS or nerfing the wealth.  The NSCC working under the DTCC working under the 'watchful eye' of the SEC, is attempting to limit the damage of the MOASS.  When the SHF's get destroyed (and some corrupt psychopaths go to jail.  PLEASE!!!), their Insurance is up.  When the Insurance gets destroyed, the next is up.  Then the next.  And the next.  Till the MOASS comes crashing down on the wall put up by the NSCC through the DTCC.  It's there that pretty much most SHF's have stored their liquidity (for safekeeping <chuckle>), or stocks that make up who they are.  In theory, the wall the NSCC has erected is powerful enough to withstand the MOASS.  Their latest 'rules' are to prevent a Market Crash.  The NSCC is supposed to sell the stocks in a 'controlled fashion/rate' at the prices we set.  It's not preventing a squeeze.  It's not controlling how the squeeze will happen.  But they want to try and reduce Armageddon The End of All American Financial Markets to a manageable 'really horrible' earthquake where the system is brutally damaged but can be rebuilt.*\n\n*Riiiiiiiight.  You telling us to all get in an orderly line - or you won't get anything if you misbehave - and we will deal with you one at a time, inside an isolated room away from everyone else, until all of you are dealt with.  Oh?  This will take months?  Years to work our way down the line?  Well, yeah.  Then, we will go back to the way things were before you guys caused this big ol' ruckus...*\n\nTo that, I say 'HELL.  NO.  Y'all made some impressively fucked up decisions.  How deep a hole you digging yourselves?  I'm here to get paid.  Now, pay me.  Quite screwing around.  I ain't going nowhere.'\n\n*Edit 3: I have received multiple people asking if they can still hold out for their amounts, or still set their same floors for the MOASS.  Green candles, etc... The MOASS will still happen just like before.  Only it will happen with a* ***possible*** *change.  If, hypothetically, Shitadel gets hit by the MOASS, they will burn through their money and get destroyed.  They will NOT be selling all their Tesla stock, all their Amazon stock, all their Apple stock, etc.  Because if they did that, those companies would probably crash and burn.  They own so much of that company!  But they park their shares at the NSCC/DTCC, and through them, they are given the same amount of cash those stocks are worth.  Remember, because of the sheer fuckery they committed, they still carry and Infinite Risk.  No change at all.  We can hold out for I n f money (I won't put the word since it's sometimes flagged - don't know why...).  But my floor hasn't changed.  When the MOASS happens, the green GME line will still climb like before.  Shitadel HYPOTHETICALLY will still try to offer to buy my shares at $100.  $499.  $69,420. $100,000.  I ain't selling.  The green line will need to climb to at least $30 million before they start seeing sells.  I am a firm believer in Infinite Risk.  Then they go bankrupt quick.  Green line goes red.  Dips.  Sure.  Onto their Insurance.  Green line climbs again.  I sell for higher.  Insurance gets destroyed.  Red dip.  Onto the next.  Green line climbs again.  Repeat.  Disclaimer: cannot guarantee that's how the line will go.  But you get the picture.  Then finally we get to the NSCC/DTCC.  That's where they may try to stretch out the timeline of the MOASS.  And that's where we may have to be patient.  So that's equivalent of you being a multi-millionaire already.  But now you gotta wait to be.. a billionaire!  Oh well... Bora Bora is good this time of year.  And their resorts have a solid internet connect.  Time to try out that Solar Silent 80 catamaran and work on my tan sipping cold tropical drinks while my crew slips my ship through tropical waters.  How's that 5 million doing building new schools?  Gonna facetime some peeps...*",
    "title": "MOASS is going to happen. With the new rules the government has green-lighted the MOASS. But whether it will be a ELE or controlled over time by them, that's still up for debate. But Money will come from the Ultra Wealthy. It will be yours. Be safe and please use it wisely",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GME/comments/oshnoh/moass_is_going_to_happen_with_the_new_rules_the/"
}