{
    "author": "GlitteringZucchini",
    "created_utc": 1615373302.0,
    "distinguished": null,
    "edited": 1615385992.0,
    "id": "m1uv6q",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_m1uv6q",
    "num_comments": 864,
    "permalink": "/r/GME/comments/m1uv6q/if_you_are_getting_ready_to_hit_your_first/",
    "score": 7014,
    "selftext": "The higher this price goes, the more of you here in the 20's and 30's will be hitting your first million, and you'll be STOKED AS FUCK!!!\n\nThis is life advice from someone who's been there, I've made and spent over 7 figures, mistakes I've made, and what I've learned. I'm not telling you what to do, just trying to give advice from a friend who's been in your shoes.\n\n1. Taxes. Please don't forget about taxes, you will have to pay them for your gains this year. If you make a million dollars on GME and blow it on a house and 3 cars and a $100k video game room, you will still owe the government money come next tax season. The exception however is if you reinvest it in things during the rest of the year, some of those things can be written off, I won't get into it in detail, but you should look more into this if you're looking to reinvest your money. Couple hundred bucks some meetings with good accountants are nothing when you just made over a million.\n2. Fair weather friends / relationships. If you tell people \"I just made a million dollars\" guess who's going to suddenly have a lot more \"friends\"? They won't be your real friends. Your real friends and the people who really love and care about you, are the ones that had your back when you had nothing, DO NOT FORGET ABOUT THEM. Just because some hot girl wants you this week for your fat wallet doesn't mean you need to forget about the girl who took care of you when you were down on your luck and lost your job. Also don't always be the guy who's \\*got the tab\\* buys everyone dinner, rounds of drinks on a regular basis, etc. These things add up. $500 to buy everyone dinner 2x a week is $50,000 a year. That's 5% of your net worth. I knew a guy that did this, he's on disability and government assistance right now, he has nothing. Great guy, bad with money.\n3. Philanthropy. It's great to give, but take care of yourself first. Make sure you're set for taxes, set yourself up a cushion for the future first. YOU are important, YOU should come first, and then give charitably (also a tax write off). Also some charities are scams (yes, scummy), I like to use sites like Charity Navigator to see where the money is actually going, the last thing you want is to bankrupt a hedge fund and turn around and give it to a greedy charity scamming CEO that's even worse.\n4. Investing. Reinvest in your future, but do it smart. $1mil isn't that much money, if you don't work, don't invest, and just spend you'll be out in several years. Whether you invest in passive income (real estate you rent out, more stocks (please remember GME is once in a lifetime, this thing doesn't happen every week don't get scammed), starting a small business, or you just invest in yourself by going back to school for something you couldn't afford before, reinvest at least some of it so you're set for the future. YOU can answer this better than I can, you know what you love, but don't get so passionate about something that you fail to see the numbers indicating poor ROI and invest poorly, sometimes passion projects (like starting an indie studio, for you gamers) can be money pits that fail. Invest, but make sure it's a financially sound investment, not just all passion project.\n5. It goes fast. Really I can't stress this enough. In the 50's, a million dollars was worth way more than it is now, you don't realize this until you have it, spend it, and say \"wait what the F\\*\\*K where did all the money go???\". If you're at 5-10 mil you should be pretty set to afford some mistakes along the way, just always keep that little guy in the back of your head that goes \"hey, you're burning through this too fast, slow down and think smarter\"\n\nSorry if I seem \"preachy\", again it's going to be YOUR money do what you want, I just don't want to see my new friends (you) make mistakes and wind up in the poorhouse again, because that's what the 1% is betting is going to happen. They've underestimated us once, and I'm hoping we prove them wrong again, when we don't wind up in the poorhouse in 5 years but instead become the new rich.\n\nI'm out, have a good rest of your day :)\n\nEDIT: Thank you for the awards and upvotes, I am honored and hope that this helps some of you make sound financial decisions and enrich your life going forward. <3",
    "title": "If *YOU* are getting ready to hit your first MILLION - life advice - (Please Read)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m1uv6q/if_you_are_getting_ready_to_hit_your_first/"
}