{
    "author": "bobsmith808",
    "created_utc": 1625156828.0,
    "distinguished": null,
    "edited": 1625168026.0,
    "id": "obpevg",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_obpevg",
    "num_comments": 19,
    "permalink": "/r/Superstonk/comments/obpevg/update_ftd_data_with_weighted_etfs_for_june_2021/",
    "score": 182,
    "selftext": "Hi everyone, bob here.\n\nJust updating my update with more updated information.  Doing a post this time with words so I can update things as requested...\n\nEdit: I cannot believe I forgot to thank all the apes that reached out to make this possible.  thanks to all you guys for sharing information, and special thanks to u/catsinbranches for the etf weighting data he's been tracking.\n\n**TADR at the bottom.**\n\nHere's a quick overview of FTD data for the first half of June 2021\n\nEdit: Fixed Summary for clarity:\n\n&#x200B;\n\n[FTDs net increased in first half of June 2021 for GME and net decrease for ETF](https://preview.redd.it/3v0daskaln871.png?width=903&format=png&auto=webp&s=506d2efb53740aa630bd74820ede7aa1212e0e2b)\n\nRemember, from the SEC Data:\n\n>The values of total fails-to-deliver shares represent the aggregate net balance of shares that failed to be delivered as of a particular settlement date. If the aggregate net balance of shares that failed to be delivered is less than 10,000 as of a particular settlement date prior to September 16, 2008, then no record will be present in the file for that date even if there are fails in that security.  \n>  \n>[https://www.sec.gov/investor/pubs/regsho.htm](https://www.sec.gov/investor/pubs/regsho.htm)\n\nI'm not sure what these numbers mean yet, but I know we have some wrinkles that might want this data, so here ya go u/dentisttft u/criand u/homedepothank69\n\nPlease note, the numbers for GME shares in ETFs is an educated guess, and I'm missing some weighting data, so the totals are omitting shares found in these ETFS.  If anyone has the weighting information, please let me know and I'll update accordingly.\n\n* UWM (Russell 2000)\n* URTY (Proshares trust)\n* SYLD (Cambria Shareholder YLD)\n* SAA (Proshares Ultra Smallcap 600)\n* HDG (Proshares Trust - Proshares HE)\n* DFAU (Dimensional ETF TR)\n\nTogether, those ETFS account for 358,021 ETF FTDs.  With an average weight across all ETFs, that would be about 4550.45 FTD GME, but I'm omitting that number in the data until we have the actual information.\n\n# To the data!\n\nI found a cool website that doesn't require a login to share excel data, so I posted the source there.\n\n[Here's the link.](https://ethercalc.net/563b6j1dmvxr)  I have a much larger dataset available on google drive, but I know there's concerns about doxxing yourself there, so I thought this might be better for sharing specific datasets to the mass of apes in here.\n\nHere's an image of the information in case you don't want to click over, or it gets changed by some fat fingered ape.\n\n[Far right is estimated FTDs for GME, given weight of ETFs](https://preview.redd.it/dd52pn2lwm871.png?width=1123&format=png&auto=webp&s=96eb7a2f5df4f9cf10fbdf6775154e18f2d0a129)\n\n**TA;DR:**  Lots of FTDs are still happening on a daily basis for GME, and theres a lot of ETFs that contain GME with FTDs as well.  We speculate that these are being shorted in order to suppress the price of GME through phantom shares.  [Here's a great DD on how this works](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/) (buckle up, it's a 3 parter) that was originally posted by u/leavemeanon and revived by u/voxumbra after the OP deleted the account.",
    "title": "UPDATE: FTD Data with Weighted ETFs for June 2021 First Half",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/obpevg/update_ftd_data_with_weighted_etfs_for_june_2021/"
}