{
    "author": "Blanderson_Snooper",
    "created_utc": 1627567231.0,
    "distinguished": null,
    "edited": false,
    "id": "oty1f2",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oty1f2",
    "num_comments": 252,
    "permalink": "/r/Superstonk/comments/oty1f2/quick_simple_game_that_explains_how_shfs_are/",
    "score": 5773,
    "selftext": "A lot of questions in [this post about a million missing puts](https://www.reddit.com/r/Superstonk/comments/otn94a/can_anyone_explain_the_over_one_million_put/) reference what I call the Voltron Fund and its machinations. Here's my original post (launched it on mod drama day, bad timing for visibility, but now the technical wizards are starting to find the machinations behind the fund):\n\n[Ultimate Wargame Theory: The Beginning - Total Return Swaps, RRPs, and the Voltron Fund](https://www.reddit.com/r/Superstonk/comments/ojh2eh/ultimate_wargame_theory_the_beginning_total/)\n\nhttps://preview.redd.it/c68byuqfp5e71.jpg?width=486&format=pjpg&auto=webp&s=01846f87ad99690ff0dc83402176615292b83779\n\nPut simply, we now know the game isn't against a single entity (Shitadel), but against a global financial network with ties that go far outside the financial world. It means that we're in this until margin call wipes them all out, and they're going to balance the books for as long as they can until one side breaks.\n\nThere is no \"sending risk back to the original firms\" really, just a massive, ongoing shell game that moves assets between (potentially) hundreds of companies in order to control margin. \n\n# Analogy in a Game\n\n[Responding to this comment](https://www.reddit.com/r/Superstonk/comments/otn94a/can_anyone_explain_the_over_one_million_put/h6x5hdn?utm_source=share&utm_medium=web2x&context=3)\n\nThink about it like this: you and three friends (Swill, Joe, Nancy, and Rohit) have 25 pennies each.\n\nEvery minute, The Great Marge comes and takes five pennies from the group at random. If anyone drops below 16 pennies, everyone loses. The only exception is if a player reaches 0 pennies, the game can go on.\n\nPlayers can freely trade and give pennies amongst themselves.\n\n**Turn 1**: The Great Marge comes and takes five pennies from Joe. All good. \n\nSwill 25, Joe 20, Nancy 25, Rohit 25.\n\n&#x200B;\n\n**Turn 2:** The Great Marge comes and takes five pennies from Joe again, bad luck! That would put Joe at 15 pennies and the game would be lost. So Rohit gives Joe one of his pennies\n\nSwill 25, Joe 16, Nancy 25, Rohit 24\n\n&#x200B;\n\n**Turn 3:** The Great Marge takes 3 pennies from Swill and 2 from Nancy. Easy turn, and Joe even adds a couple of pennies from his pocket (illegal, but allowed).\n\nSwill 22, Joe 18, Nancy 23, Rohit 24\n\n&#x200B;\n\n**Turn 4:** The Great Marge comes and starts to take 5 pennies from Joe again. Joe is out of illegal pennies, and Marge seems fixated on him, so the rest of the group tells Joe to take a hike. Joe distributes all his pennies among the remaining players BEFORE Marge takes them and issues an angry press release about stupid reddit traders. The game continues, with one less player.\n\nSwill 28, Nancy 29, Rohit 30\n\n&#x200B;\n\nNotice how the remaining players are even stronger than when they started, despite there being less overall pennies and players in the game? Voltron Fund was designed like this just like an end boss should be. It gets stronger as you hit it, not weaker, until finally you break through and defeat it.\n\nNotice how there have been 4 turns, which should have been a loss of 20 pennies, but in reality only 13 are missing? SHF tricks, delays, loopholes.\n\nHowever, the game goes on, and the Great Marge will continue to come and take pennies. The players can't find new pennies fast enough to cover for Marge, but they can whittle down the players one by one to delay the end of the game. They're hoping to find a save point before the last pennies are taken.\n\nThe most powerful save point would be retail selling their shares, which is why they put so much focus on making that happen. As long as Apes hold, though, that door is locked and the game continues.\n\nWhat the Voltron Fund research shows is that this is a long, rich battle that isn't going to be won by share recalls or other mechanical closing catalysts. This is, and always has been, a technical short squeeze against the largest portfolio in history. The bad guys (bag guys?) thought they were squeeze proof because of their vast network and resources, but there's always one weakness in any castle wall.\n\nWe are the uruk-hai running the mine at those walls.\n\n&#x200B;\n\nhttps://preview.redd.it/1xkt0wj7p5e71.jpg?width=488&format=pjpg&auto=webp&s=bd6d06edd4ce84f844130c3fca8e826192df5241\n\nThis is why zen and patience are necessary. There could come a day when all these funds are all exactly one penny above margin call, and that day will be just like any other. They'll borrow and short attack, they'll shill, we'll party. But the NEXT day they will collectively only have a four penny balance, and The Great Marge will come asking for five. We will know that day when it comes. \n\nUntil then, it's just Buy and Hold.\n\nHope this helps.\n\nLove,\n\nBlanderson",
    "title": "Quick, Simple Game that explains how SHFs are staying alive and spreading risk to avoid margin calls, and why the MOASS will likely be very obvious when it happens",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/oty1f2/quick_simple_game_that_explains_how_shfs_are/"
}