{
    "author": "PowerRaptor",
    "created_utc": 1627589662.0,
    "distinguished": null,
    "edited": 1627596352.0,
    "id": "ou5c0q",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_ou5c0q",
    "num_comments": 47,
    "permalink": "/r/Superstonk/comments/ou5c0q/time_to_bring_back_deathspiral_for_shorts_to/",
    "score": 622,
    "selftext": "**This is a theory on GME's price action, not financial advice, enjoy the dip while it lasts**\n\nThe price action we're seeing since the last public offering of GME still falls in line with my price action theory, that I titled Deathspiral, so I'm gonna' post it again in clearer terms to get more eyes on it.\n\n___\n\nI propose the price action may be adhering to a loop like this:\n\n1) The basic idea is that since shorts keep shorting, the SI% grows.\n\n2) The more the SI% grows, the greater their debt and margin requirements.\n\n3) This forces shorts to manipulate the price down, which lowers their debt (being SI%*$GME price)\n\n4) This accelerates buy pressure, which increases SI% - repeat from step 1.\n\nhttps://imgur.com/8LOAf3V **Illustration**\n\n___\n\nFor this reason, it makes sense to expect shorts to artificially drop the price, when the SI% gets so high it puts their solvency in peril - perhaps a market crash is looming that could make their collateral worth less - they'd be the first to know - or retail just bought that much more GME.\n\nEither way, enjoy the dip, I'm gonna use it to average down and get some more Jimmy. And let me tell you, my Jimmy is as long as it needs to be to reach moAss.\n\n____\n\n**TL;DR** Hedgies are still fucked / Buy and Hold has no counterplay\n\n____\n\n...the lower they manipulate the price the more fucked they'll be - the more fucked they are, the lower they have to manipulate the price. They might still have assets to enter into margin, and they *could* go for another margin increase (and price spike up to 250-350) or two before MOASS. This *could* take months or even years (as past short squeezes have). My play is still either long GME while Cohen builds it into a leading online retailer, or short squeeze.\n\n**That said - any other catalyst (Dividend or depository change or market crash) could ignite MOASS immediately at this point, I think.**\n\n___\n\n**This is not financial advice. It's just a theory... a Gamestop theory.**",
    "title": "Time to bring back Deathspiral - for shorts to remain short, the price of GME must fall",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ou5c0q/time_to_bring_back_deathspiral_for_shorts_to/"
}