{
    "author": "ORaNGeTechPB",
    "created_utc": 1626817843.0,
    "distinguished": null,
    "edited": false,
    "id": "oobzlu",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oobzlu",
    "num_comments": 85,
    "permalink": "/r/Superstonk/comments/oobzlu/can_we_please_stop_it_with_this_fake_squeeze_fud/",
    "score": 796,
    "selftext": "They are terrified of $350, the one time we went over it Robinhood and other brokers did any number of combinations of turning off the buy button or sell button.\n\nReferring back to the \"Citadel has hostages\" DD in that case it looked like RH pulled it because they didn't have the shares they had \"sold\" retail buyers and were being forced to deliver them. Citadel being their market maker had hit the T+35 limit and with the new DTCC rules in place RH was going to be responsible for buying those shares and they would have gone bankrupt hence they pulled the plug on the buy button.\n\nI don't at all doubt there was pressure from multiple hedges, MM's etc. to shut shit down though given multiple parties did variations of limited or shutting down trading.\n\nThe next 3 times we reached this level it was knocked down in flash crashes (though ever declining) the moment we were reaching $350.\n\nSo, now with intraday margin checks, daily margin checks at open and 1 hour to settle their books if they should fail a margin check and immediately begin getting liquidated.\n\nWHY IN THE FUCK would they make the conscious decision to say \"Herpa derp let's let it run to $1-10k and then shut it down! Fake squeeze! We're saved!\"\n\nThe stock ran up to $483 on FOMO buys.\n\nIt would have kept going on FOMO alone.\n\nDo you really think they want that much attention? I'd be willing to bet that past $500, and much more likely at $1k the SHF's will be dead and liquidated and it'll then be the prime brokers who are closing positions and as they fall off (it seems BOA and Wells Fargo are likely candidates for scavenging) and the DTCC is forced to start closing positions shit will be on a long burn rocket ride.\n\nFor those pushing the idea of a *fake squeeze* even if that were the case what qualifies you to call it or advise on it? \n\nIt's FUD, straight up dick ass FUD.\n\nBuy, hold and watch the fucking show as life changing money is raked in.\n\nThis is bigger than all of us.",
    "title": "Can we please stop it with this \"Fake squeeze\" FUD?",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/oobzlu/can_we_please_stop_it_with_this_fake_squeeze_fud/"
}