{
    "author": "Ornery_Valuable45",
    "created_utc": 1621937241.0,
    "distinguished": null,
    "edited": 1622028540.0,
    "id": "nkm5cd",
    "text_only": true,
    "flair_id": "681d08c4-85f9-11eb-a69c-0ecac3178a19",
    "flair_text": "Question ❓",
    "name": "t3_nkm5cd",
    "num_comments": 446,
    "permalink": "/r/Superstonk/comments/nkm5cd/attention_petition_to_create_a_flair_for_post/",
    "score": 7537,
    "selftext": "Ok we seriously need a place where we can all learn where to go and how to keep our wealth till we can get our minds straighten and our emotions under control post MOASS, i keep book marking all the post i come across that are educational in this matter but the flair is to wide and most of them repeat themselves since there isnt a base where to build this subject, I'm a engineer by trade not and accounts, banker or anyone who works with money and I'm sure a bunch of us are in the same situation, the last thing we want is vultures taking away our precious tendies and seeing apes loose it all for lack of KNOWLEDGE.\n\nEddit:Wow the engagement is serious on this subject i knew i wasn't the only one scratching it's head on this matter.\nFor the record I'm not asking for fanancial advise but rather awareness as to where to start searching and asking the right questions, just as many great wrinkle brained apes thought us how to do our DD and where to look for info so i hope this gets the same.\n\nEdit: thanks for the awards, i just hope we can get something that can benefit us all post this one event in history.\n\nEdit: for those apes who don't like to see post like this i can understand where they come from but right now we have time to educate ourselves infact we should be doing the\n\" BUY HOLD VOTE and LEARN\"\nBecause I personally feel when this things burst i won't be able to learn for a few weeks or maybe months and I'll feel drown and overwhelmed with what to do.\n\nEdit: mod contacted.",
    "title": "!!!!!Attention !!!!! PETITION TO CREATE A FLAIR FOR POST MOASS MONEY MANAGEMENT EDUCATION I'm sure there are apes that needs this, i know I'm one of them.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nkm5cd/attention_petition_to_create_a_flair_for_post/"
}