{
    "author": "2gudtrumpetsolo",
    "created_utc": 1621635724.0,
    "distinguished": null,
    "edited": 1621693120.0,
    "id": "ni4gzk",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_ni4gzk",
    "num_comments": 461,
    "permalink": "/r/GME/comments/ni4gzk/today_was_my_last_day_of_hodling_before_the_moass/",
    "score": 3137,
    "selftext": "I'm not paperhanding, but I am leaving. After this weekend, I'll be on my way to Army Basic Training for the entirety of the summer. I bought in and have held since the 1st of February and lurked the subreddits since the end of January. During that time I've seen the growth of these communities and it's been an absolute honor to call myself an ape amongst you all. The sheer concentrated will of a hivemind of differing people such as this is really something to behold. Many have joined in with differing reasons, but through it all we have a common goal.\n\nWhile it pains me that I'll most likely miss the MOASS, I'm proud of the people here and will have this community in my heart this summer as I HODL through my own trials. If millions of people worldwide have joined this movement and held through the valleys, I can certainly push past this summer.\n\nAll this to say, even though I won't be able to contact the outside world much, there's no way I'm missing out on my well-earned tendies. This XX ape has been educating his girlfriend and her boyfriend for the last few months of the movement as I've learned too. However, I'd appreciate if people wanted to drop some of their favorite posts from the last few months in any of the subreddits to help confirm my girlfriend's bias even more this summer and ensure she's mentally strong enough to hodl also. Whether it's your most tit-jacking DD you've read, your favorite memes, or even your own reasons for hodling, it'd be great to see.\n\nIf we moon before I'm back, I'm excited to see what kinds of change you apes start making in this world for the better.\n\nEdit: formatting\n\nEdit 2: WOW, tons of support and my first awards, warming my heart fellow apes. I'll be sure to do a follow up when I'm out and we've all got our lambos. Think I wasn't clear with my initial post but I'll be trusting selling to my gf and also look at conditional sells to see if I can check in and set some limits when I get phone time here or there over the summer. Again, thanks for all the support!",
    "title": "Today was my last day of HODLing before the MOASS",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/ni4gzk/today_was_my_last_day_of_hodling_before_the_moass/"
}