{
    "author": "MrAaronBaron",
    "created_utc": 1619415534.0,
    "distinguished": null,
    "edited": 1619444919.0,
    "id": "myql7i",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_myql7i",
    "num_comments": 397,
    "permalink": "/r/GME/comments/myql7i/anyone_else_having_a_hard_time_trusting_anything/",
    "score": 2429,
    "selftext": "I mean, I used to try to take everything with a grain of salt, but now I just straight up can't trust anything I read anymore. Each side is so well worded its no wonder we have such a divide between us.\n\nLearning about the trillions of dollars that were given from FED to the banks when covid started, learning about the constant market manipulation, about the political members who \"adjusted\" their portfolios when they caught wind of covid lockdown, and seeing the news outlets side with the hedgies has me empowered to see this flip in our favor.\n\nEdit: notice how reddit and Twitter are really the only apps talking about the stock manipulation. Meanwhile, my Instagram is FLOODED with investing brokerage ads and \"make millions fast\" ads. Again, I'm talking about the news/politicians from a general sense. I've been aware of things being \"twisted\" to sound one way, but now I see that it's just straight up formulated to get us all worked up.\n\nEdit 2: I don't want to ruffle any ape's fur here. I'm trying to approach this in the most unbiased way that I can. I'm sick of these shitbag boomers taking advantage of every terrible event that happens, and I can't wait for this b*tch to enter orbit so we can pop banana flavored champagne and eat chicken tendies under their towers. 🚀🍌",
    "title": "Anyone else having a hard time trusting ANYTHING the media outlets say anymore after learning about all the collusion and manipulation of our beloved meme stonks?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/myql7i/anyone_else_having_a_hard_time_trusting_anything/"
}