{
    "author": "woodyshag",
    "created_utc": 1625166952.0,
    "distinguished": null,
    "edited": 1625167140.0,
    "id": "obsyo1",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_obsyo1",
    "num_comments": 1498,
    "permalink": "/r/Superstonk/comments/obsyo1/feds_seize_robinhood_ceos_phone_in_gamestop/",
    "score": 36915,
    "selftext": "[Feds Seized Robinhood CEO's Phone in GameStop Trading Halt Investigation (vice.com)](https://www.vice.com/en/article/wx5p8z/feds-seized-robinhood-ceos-phone-in-gamestop-trading-halt-investigation)\n\nLooks like Vlad is feeling some heat right now!  Maybe another 12M for clients and 58M for the lawyers...... /s\n\nIn its filing, Robinhood states that the fallout from these restrictions still have the potential to be disastrous for the company. “We have become aware of approximately 50 putative class actions … relating to the Early 2021 Trading Restrictions. The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims. Several complaints further allege federal securities claims, federal and state antitrust claims and certain state consumer protection claims based on similar factual allegations,” the S-1 states.\n\n  \nThe best part:\n\n The company said that the incident was bad for the company and “resulted in negative media attention, customer dissatisfaction, litigation and regulatory and U.S. Congressional inquiries and investigations, capital raising by us in order to lift the trading restrictions while remaining in compliance with our net capital and deposit requirements and reputational harm. ***We cannot assure that similar events will not occur in the future.”***\n\nIf this last statement is not a sign to get out of Robbing the Hood, I don't know what would.",
    "title": "Fed's Seize Robinhood CEO's phone in GameStop Trading Halt Investigation",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/obsyo1/feds_seize_robinhood_ceos_phone_in_gamestop/"
}