{
    "author": "Alert_Piano341",
    "created_utc": 1620349004.0,
    "distinguished": null,
    "edited": 1620398295.0,
    "id": "n6mj3h",
    "text_only": true,
    "flair_text": "𝘜𝘯𝘷𝘦𝘳𝘪𝘧𝘪𝘦𝘥 𝘋𝘋",
    "name": "t3_n6mj3h",
    "num_comments": 57,
    "permalink": "/r/DDintoGME/comments/n6mj3h/knight_capital_groupthe_precursor_to_citadel_part/",
    "score": 601,
    "selftext": "&#x200B;\n\n[The past and the Future](https://preview.redd.it/zb2rs9811lx61.png?width=299&format=png&auto=webp&s=685679bf13dba98aeb620bfec8d7c4c0ffa719be)\n\nEveryone should Read up on Knight Capital Group or KCP\n\nKCP was Citadel before Citadel was a thing\n\n[https://medium.com/dataseries/the-rise-and-fall-of-knight-capital-buy-high-sell-low-rinse-and-repeat-ae17fae780f6](https://medium.com/dataseries/the-rise-and-fall-of-knight-capital-buy-high-sell-low-rinse-and-repeat-ae17fae780f6)\n\nFounded in 1996, it became a leading Market Maker and its Electronic Trading group handled a fair amount of the US market by 2012.\n\nAlong the way they were fined for various violations, just like Citadel.\n\nThey are known for the Stock Market disruption in 2012 that caused them to loose over 440 million dollars.\n\n[https://www.reddit.com/r/wallstreetbets/comments/8jbk3b/can\\_we\\_make\\_knight\\_capital\\_group\\_the\\_official/](https://www.reddit.com/r/wallstreetbets/comments/8jbk3b/can_we_make_knight_capital_group_the_official/)\n\nThey were also Citadel and Susquehanna before they were Cool\n\nThey literally blew up because of a Failure of their computer system (read about it ) but they were also net short at the time in 74 companies to the tune of 3.15 Billion.  They ended up blowing up and eventually bought by Virtue Capital.\n\n**They also had multiple short selling violations where they never actually bought the underlying securities and had to pay fines to the tune of 12million back in 2012.**\n\n[**https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/**](https://theintercept.com/2016/09/24/naked-shorts-cant-stay-naked-forever/)\n\nThis article lays out how one small companies thought that they were being Naked shorted by KCG but couldn't prove it because there is no accounting of the short position.\n\n**FROM THE ARTICLE**\n\n\"DiIorio believed Knight accounted for its aged fails in the “sold not yet purchased” liability on its balance sheet. That’s supposed to be an inventory of stocks for use in future market making, which goes up and down as orders are filled. But DiIorio says it was a hiding place for a billowing structural liability.\n\nAnd consider this: According to its [own financial reports](http://www.zonebourse.com/KINGSPAN-GROUP-1412393/pdf/299641/Kingspan%20Group_SEC-Filing-10K.pdf), Knight’s “sold not yet purchased” liability jumped from $385 million at the beginning of 2008 to [$1.9 billion](http://www.secinfo.com/d14D5a.q6JC3.htm#1r02) by mid-2011.\n\nJim Angel, the business professor, said there could be other explanations — such as Knight’s growth as a company during that period — for why the “sold not yet purchased” liability ballooned. But, he said, market makers are typically “in the moving, not storing, business, and like to keep their inventories as small as possible.”\n\nDiIorio had no such doubts. He saw the fact that Knight was blowing a hole in its own balance sheet as undeniable evidence of the naked shorting play.\"\n\n**RECAP**\n\nOk so a company thought they were being Naked shorted....they looked at the MM balance sheet and say that their \"Sold not yet Purchased\" skyrocked.....\n\n**Present Day**\n\nlets look at some balance sheets!\n\n&#x200B;\n\n[Sold Not Yet Purchased](https://preview.redd.it/u4k15um2hlx61.png?width=936&format=png&auto=webp&s=b8af255dbf27a095371b1fcae4a30e21f699b0a5)\n\nOk we expect these to be increasing as there is more money in the market.\n\nOk Virtue learned their lesson from the KCP days, Jane Streets are increasing but not going crazy.....\n\nHOLLY SHIT SUS AND CITADEL ARE HAVING A FIELD DAY WITH SOLD NOT YET PURCHASED.\n\nCitadels doubled.......but SUS said hold my Beer\n\nok lets break them down\n\nSUS first\n\n&#x200B;\n\n[Sus Sold not yet purchased end of 2020](https://preview.redd.it/x74pxffjhlx61.png?width=1083&format=png&auto=webp&s=573887c72fb562621d57355ddd7a5b4daa24c31f)\n\n&#x200B;\n\n[SUS Sold Not yet purchased end of 2019](https://preview.redd.it/4k1x4tpnhlx61.png?width=1055&format=png&auto=webp&s=8a8d11f1784515148a270112bb1ce403bc7e590e)\n\nLarge increase of selling options without purchasing them\n\nNow Citadel\n\n&#x200B;\n\n[Sold Not yet Purchased end of 2020](https://preview.redd.it/9sqxnvsthlx61.png?width=775&format=png&auto=webp&s=c4578c7cb2d09662d60f08fe61f8573b44d1de1b)\n\n[Sold not yet Purchased 2019](https://preview.redd.it/k5xk6rkyhlx61.png?width=1376&format=png&auto=webp&s=8bf5cbcfbff516c08d07af727da192fb9c036f2f)\n\nLarge increase in US government securities being sold and not paid for....I believe others have covered this.  Most of the increase(over 20B) is in selling options and not purchasing them.\n\n**Oh So Naked**\n\nBetween SUS and Citadel they have a combined 138 Billion Sold not yet purchased on the books as of 12/31/2020\n\nCitadel had an increase of 125% while Sus increased 151%\n\n**DISCLAIMER- balance sheets are a snapshot in time**\n\ngiven that this is still a large increase, even though these line items are part of doing business as a market maker we do have evidence that points to this line item being used to hide **NAKED SHORTING.**\n\nI think given this data that it is reasonable to assume they were NAKED SHORTING many stocks on January 1\n\nas the article points out Market Makers are in the moving not storage business.....both of these companies Liabilities have BALLONED and everybody is looking the other way because they are making money......but once they music stops\n\nEDIT#1 adding Citadels balance sheet from 2020 and 2021 \n\nPart TWo.......",
    "title": "Knight Capital Group....the Precursor to Citadel (Part 1)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n6mj3h/knight_capital_groupthe_precursor_to_citadel_part/"
}