{
    "author": "TheAutistcMilyonar",
    "created_utc": 1617512964.0,
    "distinguished": null,
    "edited": 1617519672.0,
    "id": "mjpmps",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mjpmps",
    "num_comments": 188,
    "permalink": "/r/GME/comments/mjpmps/the_nscc_and_the_dtcc_have_swiftly_proposed_a/",
    "score": 4083,
    "selftext": "\nRepost:\n\nNeither legal nor financial advice – this is my opinion based on the analysis of information available to me. My goal is to provide an opinion based on facts that are verifiable through credible sources.\n\nFirst and foremost, we do not have a smoking gun when it comes to confirmation of the squeeze because that would require us to have the hedge fund’s actual short positions traded on the U.S. Markets – we don’t have it, no one has it.\n\nThe purpose of this DD is to discuss the facts that we do have that in my opinion confirm we are on the verge of the biggest fucking squeeze of assets which will likely destabilize the U.S. Markets by causing insane volatility.\n\nTo understand and gain knowledge of the current state of the U.S. Markets please read and consume everything that u/atobitt has published. He is the author of Citadel Has No Clothes & The Everything Short. His DD is prolific of the current state of the U.S. markets and how and why the U.S. Markets are in danger of major volatility due to 1) the reckless over-leveraging of positions by Hedge Funds like Citadel and 2) the failure of our current market system to control the over-leveraging caused by short-selling and the catastrophic impact of lack of oversight.\n\nAfter reading and listening to u/atobitt I had questions because I could not believe that we could possibly be on the cusp of a market crash like we experienced in 2008 – I needed to look into this further to see if I could find corroboration, other information that would support this proposition.\n\n**WHERE DID I** **LOOK – NSCC & DTCC ACTIONS:**\n\nI did not have to look any further than the actions of the NSCC and DTCC from the beginning of March 2021 to now. The NSCC and the DTCC have swiftly proposed a flurry of amendments to their rules which I’ve outlined in very brief manner below. After reading each of proposed amendments it is 100% clear that those responsible for insuring the stability of the U.S. Markets are just now recognizing they are in deep deep shit of our market becoming extremely volatile and as a result they are trying to clean up a absolute mess with these amendments but it’s more likely than not a little to late.\n\nMy description of the purpose does not include the entire purpose of the proposed amendments, but what I understand as the main purpose of the proposed amendments. It is no coincide that these amendments look as though the NSCC and DTCC are trying to get a hold of what we have been saying along – Hedge Funds like Citadel are naked shorting assets and until March 2021 nothing had been done to minimize the risk it could have on our markets if a bunch of diamond handed apes held their stonks.\n\nAs you will see two of the rules have been made effective and we are currently waiting on 3 rules to be made effective – see below.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/o43ey07z70r61.png?width=1414&format=png&auto=webp&s=a37bb37bde9111d286609e617958913a4fbd9e49\n\nRegarding the  above  proposals -003 -004 (already effective) and -005 are all proposals that the DTCC should have in place already – that is these are basic fucking functions and procedures that any entity securing and handling asset transactions should have in place, especially after the 2008 market crash which was fueled by transactions that lacked transparency. For those reasons I anticipate -005 will be passed swiftly as -003 and -004 because lets be fucking honest – if you’re exchanging assets through the DTCC you should 1) have to own the asset you’re pledging and 2) once the asset has been pledged, the same asset cannot be pledged to someone else.\n\nI believe -801 and -002 are taking longer to pass because they are being stalled by SEC – look at the rules they are essentially margin calls –    requiring hedge funds to 1) come up with adequate liquidity to cover their positions; and 2) calling back any lines of credit for hedge funds that don't have adequate collateral. We will have to wait  and see but  I see rules -801 and -005 being the two biggest catalyst to a squeeze. \n\n**I ALSO LOOKED AT EUROPEAN** **MARKETS FOR FURTHER VERIFICATION -**\n\nFurther confirmation that we are likely heading for major market volatility and thus numerous bananas being deposited into our accounts – I started reading about the European Markets to see what if anything they have done or implemented to address market stability in the face of short selling. (All links to sources are below)\n\nFirst off, since 2008 the European Markets (“EM”) restricted and even banned short selling altogether. However, EM found it difficult to impose bans on short selling altogether due to varying rules and regulations across the various countries on the European continent. Therefore as a way to safeguard the EM from abusive short selling EM adopted rules in **2012**\\*\\*,\\*\\*  that (1) increased transparency by requiring short sellers to declare their short positions; (2) gave regulators the power to stop the shorting selling of an asset in exceptional circumstances; and (3) established a centralized clearing service to ensure assets that were shorted could be purchased and a system to remedy failure to delivers.\n\nSecond and probably most significantly in March of 2020 EM began heavily restricting and evening banning short selling of assets to minimize risk of increased volatility and concerns about market confidence caused by the Coronavirus Pandemic. Much of those restrictions were lifted in June of 2020, but many countries in the EU continued short selling restrictions and bans through 2020 and into 2021. Even now, the EM has imposed greater reporting requirements to protect their markets from the volatility of short selling. \n\n**CONCLUSION:**\n\nWe are about to see some serious shit go down and all there is to do is HODL the fuck on. The US regulators have failed to assess and manage the risk of short selling to a reckless degree. Combine the reckless lack of oversight with the free money that is being printed and funneled to hedge funds which has enabled them to take insane risk by over-leveraging their positions and trading and selling asserts they don’t even fucking own – we have ourselves a god damn financial crisis that is about to come to light and a fucking rocket with a bunch of apes shooting to Mars.\n\nJust take for example the measures that the EU took **NINE (9)** years ago to make sure their regulators could at least view what assets were being shorted and then implementing a ban when the pandemic hit to prevent greedy banks from shorting to hell companies and injecting volatility into heir markets. The damage that unregulated short selling can have on a market is fucking obvious but not obvious enough for US regulators until **MARCH 2021** or in other words – too fucking late.\n\nEverything points to a major squeeze of many assets in traded on the US Markets and we are all going to witness it when we lift off to fucking Mars.\n\n**TLDR** – Squeezes are coming, just fucking HODL!\n\n**Definitions:**\n\n1. NSCC – The National Securities Clearing Corporation provides clearing, settlement, risk management, central counterparty services and a guarantee of completion for certain transactions for virtually all broker-to-broker trades involving equities, corporate and municipal debt, American depositary receipts, exchange-traded funds, and unit investment trusts.\n2. DTCC – The Depository Trust & Clearing Corporation is the post-trade financial services company providing clearing and settlement services to the financial markets.\n\n**LINKS to Reddit DD:**\n\n1. Citadel Has No Clothes - [https://www.reddit.com/r/GME/comments/m4c0p4/citadel\\_has\\_no\\_clothes/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/?utm_source=share&utm_medium=web2x&context=3)\n2. Everything Short - [https://www.reddit.com/r/amcstock/comments/mgzim2/the\\_everything\\_short/](https://www.reddit.com/r/amcstock/comments/mgzim2/the_everything_short/)\n\n**Links to European Market News**\n\n1. EU Rules on Short Selling [https://ec.europa.eu/info/business-economy-euro/banking-and-finance/financial-markets/securities-markets/short-selling\\_en](https://ec.europa.eu/info/business-economy-euro/banking-and-finance/financial-markets/securities-markets/short-selling_en)\n2. EU Lift Bans on Short Selling [https://www.thetradenews.com/short-selling-bans-lifted-in-europe/](https://www.thetradenews.com/short-selling-bans-lifted-in-europe/)\n\n(Credits: u/this-understanding85)",
    "title": "The NSCC and the DTCC have swiftly proposed a flurry of amendments to their rules which I’ve outlined in very brief manner below",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mjpmps/the_nscc_and_the_dtcc_have_swiftly_proposed_a/"
}