{
    "author": "ScalpelUser",
    "created_utc": 1617553237.0,
    "distinguished": null,
    "edited": 1617569744.0,
    "id": "mjzd6b",
    "text_only": true,
    "flair_text": "DD 📊",
    "name": "t3_mjzd6b",
    "num_comments": 394,
    "permalink": "/r/GME/comments/mjzd6b/were_about_to_be_public_enemy_1_and_you_have_to/",
    "score": 4018,
    "selftext": "[Apes of Wall Street, 2021, colorized](https://preview.redd.it/hj7pz420c6r61.jpg?width=320&format=pjpg&auto=webp&s=ee358aec18a2226bb4ea903f6ee725d344367d5f)\n\nNot financial advice, that would be an easier topic. Brace yourself for a read but I used small words for you.\n\n**Edit:** This post is meant to emphasize what we'll likely experience in some capacity; hatred. I don't know how this will end, I don't know how quickly people will learn the truth, I don't know what media or the government will do. But when the chips are down and the chaos first unfolds, we're the easiest target. We benefit while the economy tumbles.\n\nHearing your name or a group you're emotionally invested in getting dragged through the mud, possibly by the whole world, will hurt. I hope it doesn't come to that, but if history is anything to go by, we're in for a wild ride. Hopefully a brief one.\n\nWatch this and come back, it’s 1 fucking minute: [https://youtu.be/7eYcWpgCb7o](https://youtu.be/7eYcWpgCb7o)\n\n&#x200B;\n\nEdit: In case you come here from the [crosspost mentioning FUD](https://www.reddit.com/r/GME/comments/mk3gnn/is_the_new_fud_making_you_feel_like_youre_the_bad/?utm_source=share&utm_medium=web2x&context=3), this is my response from that post. I wanted to further clarify the reason I made this in case there was any confusion. \n\n&#x200B;\n\n>Hi, OP here!  \n>  \n>So, the point of this post is to draw some attention to the fact that, in the short term, we're likely going to see some shit. Currently, we're the easiest party to blame for the MOASS; THIS IS ENTIRELY UNTRUE. Everyone here who has read the DD knows the truth of that matter.  \n>  \n>The problem is, society as a whole does not know what we know. Additionally, what is about to happen is something that should never have happened. One day, out of the blue, people will be asked to change their entire worldview; they'll likely be scared or mad.  \n>  \n>Depending on how this unravels, the country or even the world may have to admit that our financial system is broken. That's their lives, their futures, their everything.  \n>  \n>IT WOULD HAVE BROKEN NO MATTER WHAT.  \n>  \n>But we're the unique aspect in all of this. Apes are the ones who made a stand, we're new and unique; this makes us easy pickings for mass media. We've already seen it.  \n>  \n>I wanted to express this to people so they can prepare for what may be a terrible outcry against a genuinely good community. People I believe we're all emotionally attached to. On an individual level that can be psychologically damaging, especially once the outcome of this event on society is clear.  \n>  \n>We have NOTHING to feel guilty about. We did not do this and, in fact, we're likely a saving grace of the MOASS. If DFV didn't find it someone else would have and it likely would have ended the way the '08 crisis did. A few people pocketing the money, the economy crashing, and a single person in jail.  \n>  \n>Now there's a force who is aware of the manipulation and driven to do good. Even the most average ape is a boon because their money will be put back into the economy and not hoarded.  \n>  \n>My post isn't intended to make anyone feel guilty, it's to give you time to mentally prepare for what you may see.  \n>  \n>**TL;DR** You should NOT feel guilty for benefitting from this situation. Apes did nothing wrong, the hedge funds and banks screwed the economy yet again. However, we do have to be mentally prepared to be accused, to be slandered, and to potentially feel attached to the falling out.  \n>  \n>Humans are emotional creatures and my post is a forewarning. You need to remember that nothing wrong happened because of apes, just buying and holding, but you should prepare for mass media to tell the world it's retail's fault.\n\n&#x200B;\n\nBack to your regularly scheduled programming.\n\n&#x200B;\n\nAlright apes, I feel it, you feel it, Citadel feels it; the situation is getting hot. The [DTCC has been on fire](https://www.reddit.com/r/GME/comments/mg4o2q/nscc_filing_today_this_is_actually_insane/?utm_source=share&utm_medium=web2x&context=3) creating new rules to send to the SEC with yet another closed-door meeting this coming week.  [(ELIA)](https://www.reddit.com/r/GME/comments/mg4o2q/nscc_filing_today_this_is_actually_insane/gsr7oma?utm_source=share&utm_medium=web2x&context=3)\n\nNobody knows when, nobody knows how, but the catalyst is boiling away and we’re all hype. I’m hype! I can’t fathom a life without constant financial fear, who wouldn’t be excited to experience that?\n\nWe’re going to be on that rocket but that blast is going to leave wreckage behind. Wreckage that needs a cause, a villain, a scapegoat.\n\nThat will be us.\n\nWhether it’s for a day or a week, or a long-running rederick we will be blamed. There’s no avoiding it. For at least a point in time, if not for the remainder of history, we will be condemned for an economic crisis of astounding proportions.\n\nYou have to understand this, you have to be prepared for this.\n\n**THIS IS SERIOUS**\n\nIf you aren’t knowledgeable about the fallout of the '08 mortgage financial crisis, now’s the time. You don’t even have to read; [The Flaw](https://www.amazon.com/Flaw-David-Sington/dp/B073X95VWC) is free on Amazon Prime and is a good overview of some of the personal hardships people experienced. I also suggest [Inside Job](https://www.amazon.com/Inside-Job-Matt-Damon/dp/B004NOCCEG), 2.99 (in American bananas) to rent with Prime or check your local digital library.\n\nLook at this fucker at least:  [https://www.investopedia.com/financial-edge/1110/5-consequences-of-the-mortgage-crisis.aspx](https://www.investopedia.com/financial-edge/1110/5-consequences-of-the-mortgage-crisis.aspx)\n\nWorldwide fallout. Lost homes. Unemployment. Suicide. Ruined investments. Failing retirement accounts. Increased national debt.\n\nAll of this has happened before and all of it is possible again.\n\n&#x200B;\n\n**\"But we didn’t cause the problem!\"**\n\nProblem, you say? No, the system is working exactly as intended; DFV didn't find a bug, it's a feature. THAT’S how it will be presented to the people. Guess what, everything was going just fine until the hole was found and who found that hole? Us.\n\nSure, that takes out a lot of details but guess who’s going to do that? Hedge funds, mass media, maybe even the government.\n\nNobody is going to give a damn that it was inevitable. We pointed it out sooner rather than later and ignorance is bliss.\n\n&#x200B;\n\n**\"But we’re the little guy!\"**\n\nAnd? Sounds like you just admitted our biggest weakness. We don’t have PR teams, we don’t have lawyers on retainer, we don’t have the power to inform the people. Even with our tendies, we won’t have the same reach as these banks.\n\nWe’re still considered ‘young people’, ‘the youth of America’, ‘the NEXT generation’. We’re belittled for not doing better with the system we were given. A belief that’s ingrained in those with power, individuals who benefited from capitalism, and even hardworking people who need someone to blame.\n\n**Edit:** I'm addressing 'young people' within the realm of the traditional 'you damn millennials' argument. The dichotomy between those who want to see the system change vs those who grew up benefiting and want it to remain. Unfortunately, that often becomes a generational fight. We have plenty of older apes among us, myself included!\n\nWe're the easy target. We're the people seen every day. We're a bad guy that's easy to digest.\n\n&#x200B;\n\n**\"It’s fiiiiiine, they’re already blaming us, no big deal!\"**\n\nFuck yes it’s a big deal. They’re blaming us now and we find it funny but it isn’t front-page news yet. There hasn't been a public fallout. The situation is known but it isn’t mainstream and it sure as shit isn’t understood.\n\nRight now, this is a blip on the general consciousness. This is water cooler talk. This is ‘let’s roll our eyes at the stupid kids and hope they stop it’ territory.\n\nCurrently, we’re blamed for one [hedge fund losing some money](https://www.bloomberg.com/news/articles/2021-03-06/the-biggest-players-in-the-short-selling-game-are-getting-a-pass) that they *apparently* already started to recover from. Many articles written about GME are in the past tense already.\n\nPeople don’t know what’s happening and they definitely won’t know why it’s happening.\n\n&#x200B;\n\n**‘Just read the DD!’**\n\nOh shut up.\n\nRemember when you first heard about GME? Truly, close your eyes and think about that initial headline; that little smile and smirk, a single laugh, clicking on the post hoping to have some brief entertainment at the expense of the rich.\n\nRemember how ridiculous it felt.\n\nRemember that first step down the rabbit hole.\n\nRemember the freefall when it all finally began to click.\n\n&#x200B;\n\n[Credit: u\\/Sawkin8or](https://preview.redd.it/zj0hz5a6f6r61.jpg?width=480&format=pjpg&auto=webp&s=c2a10769385dd6490628c51948972962dd133375)\n\n*That* is what the world will feel and it won’t be in the relaxed comfort of a long reddit session while your wife’s boyfriend goes at it with her in the background.\n\nPeople will see a concerning news ticker across updates of a deadly pandemic, they’ll listen to flailing TV investors demonize retail, they’ll watch solemn bankers appeal for understanding. Hell, they might see big, bold, headlines in newspapers if they’re into that.\n\nEven today, after all these weeks, the MOASS can feel surreal. As many crayons as we eat we know that, logically, it shouldn’t be this way. This isn’t how a good system is supposed to work. And dammit, it’s a good system, that’s what they tell us! Capitalism is the way, best country in the world, leaders, innovators, yadda yadda.\n\n[People don't handle change well](https://www.forbes.com/sites/erikaandersen/2019/09/17/why-change-is-so-hard-and-what-to-do-about-it/?sh=689f457a3e0a), we handle it even worse when the media piles on to hide facts.\n\n[Apes learned about this as individuals. Society won't get that luxury.](https://preview.redd.it/j9tu0293g6r61.jpg?width=508&format=pjpg&auto=webp&s=41f6ee8d00019f95b2c7a91e090a07599bd517f2)\n\n&#x200B;\n\n**We DO have a few things on our side.**\n\n*People are mad.* We all know why; sickness, violence, inequality, etc… but this post is negative enough already. Exposing that the world's largest financial system is a farce will be one more nail in the coffin.\n\n*People have time.* As sad as it is; quarantines and job losses have given people the chance they need to mobilize. I truly believe the government wouldn’t be seeing as much determined pushback by the people if it wasn’t for the pandemic. We have nothing but time and anger.\n\n*People are connected.* None of this could have happened without the internet. We have a free exchange of knowledge; educating yourself and others has never been easier.\n\n&#x200B;\n\n**So what the fuck do we do?**\n\nHonestly, I don’t know and I’m a fucking copywriter. I’m paid to hype up a company’s rhetoric, and I don’t fucking know.\n\nWe have reddit. This place is a goldmine of knowledge and proof of the goodness of apes but not everyone uses it. Many people disregard the site as a cesspool. r/GME doesn’t even show up in standard Google searches about the stock. Go on, try it.\n\nOur SEO is shit and we don’t have an audience, we have each other.\n\nAs it currently stands, our options are limited. We can educate those around us but it has to be done as if we're a third party; otherwise, we risk direct attacks and financial abuse.\n\nMaintaining our positive atmosphere here on r/GME is imperative. We’re a fantastic community full of great DD and lovely people. We aren’t perfect, we can be an echo chamber, but we aren’t rude assholes.\n\n[Thanks u\\/rensole](https://preview.redd.it/y1xq3v21i6r61.jpg?width=554&format=pjpg&auto=webp&s=ac711b46d41b2c3b2cd03904bf277355d70d6602)\n\nr/GME is a record of our behavior during this event, it’s a testimony in the making and extremely valuable. Don’t forget it.\n\n&#x200B;\n\n**And that's that.**\n\nI can't handle any more doomsday writing.\n\nI want to be wrong and I sure as shit could be! My ape brain is too small to begin to calculate the moves of all of the players involved. Even within our community, you never know what changes a single person can make.\n\nMaybe everyone will understand, maybe this is the final straw and accountability finally goes in the right direction. I want to believe that's possible. In the meantime, mentally prepare for what you'll hear and what you'll see.\n\nYou don’t speak out freely against capitalism and we're about to learn that the hard way.\n\n&#x200B;\n\nEdit: Forgot my TL;DR!\n\n**TL;DR:** Hedge funds, bankers, and even the government have every reason to blame us apes. We're easy pickings. There will be A LOT of blame to go around ranging from the fallout, look at the '08 mortgage crisis for reference. Be prepared to be hated be it temporarily or forever.\n\nSomeone will be defined as the catalyst and there's no guarantee accountability will go to the right source.",
    "title": "We’re About to Be Public Enemy #1 and You Have to Be Ready",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mjzd6b/were_about_to_be_public_enemy_1_and_you_have_to/"
}