{
    "author": "LassannnfromImgur",
    "created_utc": 1619391662.0,
    "distinguished": null,
    "edited": false,
    "id": "myjx9m",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_myjx9m",
    "num_comments": 264,
    "permalink": "/r/Superstonk/comments/myjx9m/keep_in_mind_that_gme_is_the_most_bought_least/",
    "score": 6763,
    "selftext": " So the only reason it hasn't squeezed yet is not due to any selling but solely to all the shorting. Pure, unadulterated shorting from billion-dollar HFs. That's the only reason we aren't on Pluto yet.\n\n**THEY CAN'T KEEP THIS UP FOREVER, BUT WE CAN HODL FOREVER. FOR AS LONG AS IT FUCKING TAKES.**\n\nYou've been poor your whole life. You can wait a few more months.\n\nAlways go back to these 4 simple rules:\n\n1. The price is academic\n2. It's only a loss if you sell\n3. **Shorts must cover**\n4. Hold until 🚀🚀🚀🚀🚀🚀\n\nEverything else is noise.\n\nI will post this once a day to keep spirits up and heads in the game.\n\nEveryone and his brother knows Ryan Cohen is turning Gamestop's business model completely around from a brick and mortar retailer into an online retailer with similarities to amazon and steam.\n\nEveryone in the world knows new, fresh talented skill is being hired for key positions to effect this change. Everything about GME is coming up roses, and yet the stock continues to fall.\n\nWhat does that tell you besides that fact that evil HFs that STILL wanna see the company die out are stubbornly refusing to give up the fight and cut their losses?\n\n**SO I SAY WE STUBBORNLY REFUSE TO SELL, REFUSE TO QUIT HODLING, AND JUST BITE DOWN HARDER AND NEVER LET GO!!!**\n\n**WE WIN THIS BY BEING PATIENT!!! GO OUTSIDE AND DO SOMETHING FUN! TAKE YOUR MIND OFF THE STOCK TICKER! IT'LL BE A WHILE YET, BUT WE HAVE ALREADY WON!!!**\n\nGiven that we currently hodl well over 100% of the float, possibly as high as 1000%, we, even we here, the Ape Army, essentially own Gamestop! We own the company! That means that when the squeeze happens there's no need to panic sell for a little profit at $500 or $1k or $10k per share.\n\n**It will go as high as we want it to go precisely because we own the company several times over! That means we get to decide what the stock's highest floor will be!**\n\nPlease let that sink in.\n\n**DO NOT SELL UNTIL YOU NO LONGER HAVE TO WORK FOR A LIVING AND CAN ALSO LIVE THE HIGH LIFE! YOU WANT A LAMBORGHINI** (I don't; they're ugly...) **JUST HODL UNTIL IT'S $10 MILLION A FUCKING SHARE!! IT CAN ACTUALLY BE DONE!!! 10 MILLION A SHARE IS NOT A MEME! IT IS A REAL WORLD POSSIBILITY!!!**",
    "title": "Keep in mind that GME is the most bought, least sold, most talked about stock in the world right now. The whole world is watching and all the working class apes are looking to get rich and retire young.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/myjx9m/keep_in_mind_that_gme_is_the_most_bought_least/"
}