{
    "author": "Stonkinator3000",
    "created_utc": 1625712359.0,
    "distinguished": null,
    "edited": 1625715318.0,
    "id": "ofy8jp",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ofy8jp",
    "num_comments": 175,
    "permalink": "/r/Superstonk/comments/ofy8jp/these_guys_have_no_choice_now_but_to_try_to_tank/",
    "score": 5261,
    "selftext": "They’ve created an aura of power and invincibility by design but you better believe they’re on the clock. Because Cohen and company aren’t wasting any time transforming the company. \n\nEverybody talks about the catalysts needed to take us over the top. The simplest one is the same here as with all other plays. The real world improving outlook and earnings of the company create too much interest and buy pressure and they wash over whatever short interest exists like a tidal wave.\n\nSo they can’t let it run up big or they face liquidation and they can’t let it trade sideways or they give management time to do its thing, creating too much buy pressure and forced liquidation.\n\nThat leaves pushing it down, even though they know that most apes see a lower price as a fire sale. Regardless there’s no other option for them. They have to put everything they have into this final fud campaign and tank the price daily to try to create a real selloff.\n\nIt’s literally the only road left to them and it’s why I’m banking on the price continuing to fall for the rest of this week and into next week before possible crypto dividend news or other news like an acquisition. And if it does keep tanking then paradoxically it means we’re tantalizingly close to victory. Because it means they’re not covering their ftds anymore, it means they’re willing to give their adversaries better and better deals on shares, it means they’re willing to engage in visible behavior that might end up landing them in prison later.",
    "title": "These guys have no choice now but to try to tank the price by any means necessary. If it runs up big again it’s likely forced liquidation. If it trades sideways they’ll bleed while continued positive catalysts and improved earnings prove irresistible, creating the buy pressure to make it run up big.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ofy8jp/these_guys_have_no_choice_now_but_to_try_to_tank/"
}