{
    "author": "admiral_asswank",
    "created_utc": 1619177475.0,
    "distinguished": null,
    "edited": false,
    "id": "mwt6ml",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_mwt6ml",
    "num_comments": 1256,
    "permalink": "/r/Superstonk/comments/mwt6ml/so_here_we_are_again/",
    "score": 14206,
    "selftext": "TLDR: I've been studying cyber security for a LONG time, it's my job to be skeptical. You don't get a TLDR. You need to read this and think smarter.\n\n..........................................................................\n\nSo it's all over our front page, a coordinated attack. Yep. RadioAtBlossoms is NOT an ally. Let's get into it, but first apes need a lesson.\n\nSo what is the purpose of disinformation?\n\nIt is to give the gentlest of pushes to cause the maximum amount of disruption. That word is *key*. Not destruction. Not damage. *Disruption*.\n\nIn destruction, there is rebuilding.  \nIn damage, there is recovery.  \nIn disruption? There is *only chaos and confusion*.\n\nThis is precisely why Foreign State Threat Actors ... simultaneously promote AND condemn American Domestic issues such as:\n\n- Immigration\n- Gun rights\n- BLM\n- ... and QAnon.\n\nIf you weren't aware, two large foreign entities (nonspecific to avoid triggering their bot detection) were **heavily** involved in the distribution of QAnon. It isn't that it is directly harmful, it is that swimming through an ocean of debate about an issue is disruptive. It prevents people seeing the **real truth**.\n\nOh look what we've seen in our subreddit...\n\nTWO exoduses.\n\nMultiple instances of huge subreddit wide bickering about non-issues.\n\nSpam about DFV selling. Spam about DFV buying more.\n\nSpam about the price going to infinity and to $0.\n\nSpam about AMC, Silver, RKT, CLOV.\n\nIt goes on, and on... and this is where it really comes together now. You have been GROOMED and PRIMED to be suspicious of **everyone and everything**. Isn't that just the **perfect time for an anonymous actor to come in and give you that... teeniest of nudges?**\n\nRadioAtBlossoms presents the following:\n\nNO FACTS.\n\nNO IDENTITY.\n\nNO AGENDA.\n\nNO EVIDENCE.\n\nI absolutely insist that IT SHOULD BE IGNORED. It is dangerous to our group. He was BANNED from gme because the threads he was posting were being **brigaded by accounts spreading baseless lies**.\n\nWe have people saying that hedge funds are assassinating people. We have people saying Kenny is a pedophile. We have people saying that the deep state is behind GME.\n\nWhy? Because it causes the MAXIMUM disruption from the LEAST amount of effort.\n\nHe comes in, posts vague comments that **anyone could have made** and ...\n\nHE ISNT CONFIRMING WHAT YOURE SAYING. HE IS CHOOSING COMMENTS THAT LOOK THE MOST DISRUPTIVE.\n\nWHAT????\n\nWith my some ten years of experience, I didn't see QAnon unfold in person. I saw it from the sidelines. I read reports, articles and 2nd hand recounts of it... \n\nBut I'm here right now. I'm seeing this. And it *frightens me* at how effective it is. It is IDENTICAL.\n\nDon't you think it is absolutely bizarre how ALL these posts about ONE irrelevant person are ALL over the front page all at the same time?\n\nHow all these comments about hitmen, pedophilia and deep state all appear out of nowhere AT THE SAME TIME.\n\nIT.\n\nIS.\n\nAN.\n\nATTACK.\n\nYou want to know the truth about GME? It's in the ACTUAL DD's posted by ACTUAL APES.\n\nBrothers... the GME story is: They got greedy. You don't need someone vagueposting that, to whip your emotions.\n\n**They're being punished.** They thought they had free money - they don't. **We do**. Because we saw through their bluff. We saw through their lies. We did *research*. We learned regulations. We wrote ACTUAL DUE DILIGENCE.\n\nThat's the story of GME. There is absolutely NO VALUE to us in discussing or entertaining fanfiction at this time.\n\nDo it **AFTER** we squeeze. Go wild with your imagination **AFTER** we squeeze.\n\nIf our subreddit repeatedly promotes known members of society as breaking the law (not SEC laws lol), when we have NO PROOF... our subreddit can be *poofed*. We also let ourselves vulnerable to FURTHER fracturing.\n\nPeople who are *pro* blossom and people like me, who are *anti blossom*.\n\nIt all plays into the disinformation handbook of division, disruption and chaos.\n\nI warned /u/rensole about blossom before, back in /r/gme .My prediction hasn't been wrong about him. It's only getting worse. You deal with it, or it will consume the subreddit. Free speech is only as valuable as the intelligence and quality of information in the group.\n\nHonest speech? That is worth more than gold. It uplifts the group. It forces us to be smarter. That's what we need to win this. To be **smarter than those who tried to steal from us.**\n\nUphold the integrity of truth. Blossom is not an ape.",
    "title": "So here we are... AGAIN.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/mwt6ml/so_here_we_are_again/"
}