{
    "author": "Suspicious-Singer243",
    "created_utc": 1626141408.0,
    "distinguished": null,
    "edited": false,
    "id": "oj5qfd",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oj5qfd",
    "num_comments": 40,
    "permalink": "/r/Superstonk/comments/oj5qfd/the_march_to_zero_liquidity_volume_or_bust/",
    "score": 809,
    "selftext": "**TL;DR:** Ken and Co. are Captain Hook and the ticking is getting louder and louder. The debt established to escape their demise in January continues to show it's presence when volume gets too low. It seems challenging for the shorts to significantly withdraw buying pressure from the market (thereby reducing volume) while continuing to fight the laws of supply and demand. We are currently at the lowest volume ever compared to January highs that caused the first sneeze. Historically, they can only withdraw volume for so long before they need to add it back. And, when that happens... wooosaaaaa.\n\n[Ken.... Melvin?](https://preview.redd.it/n7turnx5zva71.png?width=679&format=png&auto=webp&s=0fafa6bd03432c845140ca2699734d46011eb447)\n\n# 0. Introduction and Rewind\n\nTwo months ago I wrote about [The March to Zero Liquidity: Volume or Bust](https://www.reddit.com/r/Superstonk/comments/n3ehw0/the_march_to_zero_liquidity_volume_or_bust/).\n\nWhile you’re welcome to read up on the backstory, I’ll give you the sparknotes:\n\n* Low liquidity in the market on a security makes it thinly traded\n* Thinly traded securities are susceptible to slippage, which is when the bid-ask spread widens and green or red crayon markings have lots of space between them. One share goes for $200 and the next for $203\n* That space creates a highly volatile environment, which is prime for a security to have substantial moves up or down.\n* We’ve been here before – two times in the last six months \n\nFor those in the back of the classroom, here are some **quick definitions:**\n\n* Bid-Ask Spread: the space between the lowest seller and highest buyer, which facilitates the market.\n* Liquidity: the degree to which an asset can be quickly bought (bid) or sold (ask) in the market at a price reflecting its intrinsic value (spread). If there is a big gap between the bid and ask, $95-$105, it’s hard for a trade at or near the mean of $100 to happen.\n* Volatility: how bigly a security can move around its mean value.\n* Thinly Traded: a security that cannot be traded without significant change in price.\n* Slippage: the difference between the expected price of a trade and the point at which the trade is executed. This can occur when a large order is executed and there is not enough volume to maintain the current price range within the big-ask spread.\n\n# 1. Purpose and Old Wounds Festering\n\nThe purpose of this data|education post is to refresh some old DD I posted with new data to test it against upcoming price movement to see if we have a pattern. **The essential argument is that while GME was massively shorted prior to January, they took actions that substantially worsened the problem by massively shorting GME more in January and they must fix.**\n\nTo illustrate, I’ll risk stupidly quoting myself from two months ago for your ease of reading only one post rather than referencing two.\n\n&#x200B;\n\n>In life, and certainly when it comes to the tale of naked shorting $GME, **sometimes one problem creates another.** That’s exactly what Citadel is experiencing **with** their well-documented **movement of buy orders to dark pools.**  \n>  \n>During this brief Ted Talk, I’ll venture to prove that **Citadel’s strategy of selling in the open market while buying in dark pools is marching GME toward Zero Liquidity**. Tick tock. Tick tock. The motive behind removing buying from the open market is to limit buying pressure and balance with selling to stabilize the price. O**ver time, this action has reduced liquidity with a trajectory of it being near zero.**\n\nWow… for two months we’ve been talking routinely about egregious dark pool activity in our “free” market. And, for at least two months we’ve been debating T+X cycles, FINRA/SEC legalese, calendar vs settlement vs Juneteenth days, and TA. **Vomit**. \n\nMy intention is not to settle how or when they must settle up. It’s simply to affirm our agreement that they are still massively short due to limited liquidity and demonstrate that their window is closing on their mission to avoid the laws of supply and demand which would require the price to increase based on our circumstances.\n\n# 2. Time is running out. Tick tock... tick tock...\n\nSurely Ken and Co. knows how close to the sun they are flying.  \n\n\n>**Ever since mid-January, volume moved on a decreasing slope.** I downloaded historical quotes ( [https://www.nasdaq.com/market-activity/stocks/gme/historical](https://www.nasdaq.com/market-activity/stocks/gme/historical)) to begin my research here. Sure, we’ve had spikes that likely are instances resulting from the well-documented FTD Cycle. However, **when charting a 5-day trailing average of volume by percentage of the mid-January squeeze, the number of shares traded** according to NASDAQ historical volume **is declining significantly.**\n\nSo, I've updated the chart for your pent up viewing pleasure:\n\n \n\n[Volume as a percentage of Jan 13th volume. Pretty much at zero, yes?](https://preview.redd.it/wl66h4d6xva71.png?width=983&format=png&auto=webp&s=2c9ccc9eaf45075e8063004d26823745871143af)\n\nAnd.... **here's the data to go along for you beautiful Apes that have trust issues:**\n\n[Numbers + a #DIV\\/0!](https://preview.redd.it/5j7f9sn1xva71.png?width=661&format=png&auto=webp&s=7d5bbe527944a46a5d1a71d1afb552813e8fd60c)\n\n# 3. Onward to Neverland.\n\n1)\t**GME is trading below 2% of the January volume highs.** Even if we assumed they shorted less shares than the Ape who did a trick with his banana since that day, there’s not nearly enough volume to close their positions. \n\n2)\t**GME is most certainly a thinly traded stock**. While January was absurdly high volume comparative the float, GME is still trading well below a reasonable number of shares in the open market. More fuckery continues than the last time we checked in on volume two months ago making the stock we like highly susceptible to slippage.\n\n3)\t**The 5-day trailing average volume compared to Jan 13 has never been as low as it is today.** Essentially, they are flying incredibly close to the sun for an extended period of time. The last times it’s held a low percentage consecutively was likely May 5-11, which resulted in two 12%+ share price days within a week.\n\nGiven this is Data| Education, I wont say much more to limit speculation. Just know that GME is standing on a saber's edge. Let's just let the tock tick. \n\n&#x200B;\n\nhttps://preview.redd.it/dlasok5ezva71.png?width=590&format=png&auto=webp&s=8d64d6b532b2980221cf3dc8e82495b1847e0663",
    "title": "The March To Zero Liquidity: Volume or Bust (Reprised)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oj5qfd/the_march_to_zero_liquidity_volume_or_bust/"
}