{
    "author": "delicious_manboobs",
    "created_utc": 1623925655.0,
    "distinguished": null,
    "edited": 1623931066.0,
    "id": "o1tzje",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o1tzje",
    "num_comments": 378,
    "permalink": "/r/Superstonk/comments/o1tzje/it_actually_is_big_when_the_nyse_president_says/",
    "score": 9054,
    "selftext": "Smooth brain 🦍 checking in.\n\nMy first shot at something like this, please feel free to poke holes in my conclusions, I will be happy to redact my post in case I got it wrong. Also, TL;DR at end.\n\nu/brachr8 shared this [wonderful article](https://www.reddit.com/r/Superstonk/comments/o1inbj/nyse_president_admits_to_off_exchange_price/) about the NYSE President admitting that price in some stock does not properly reflect supply and demand.\n\nAs a January HODLER I am very tired of reading all this FUD in MSM and many apes in the comment section of the post were pointing out that this is just another article that should be mistrusted.\n\nOk, ok... I agree that Reuters should not be trusted blindly, but the fact the NYSE makes such statement is big. And I believe, very big. Here's why:\n\nSo, when somebody says: The price does not reflect demand and supply they are really saying: the price is manipulated. And if it's the president of the NYSE saying that: wtf?\n\nImagine the following: Every week, you go to a vegetable market, like thousands of others, to buy your vegetables. And one day you hear the owner of the market say: \"Hey guys, the prices of some of the vegetables in here like ~~salad~~ carrots are manipulated.\" What do you expect to happen? Even if you hate ~~salad~~ carrots, you will still be worried about the price of your favorite vegetable to be manipulated too, right? You might consider going to another vegetable market the next time, until you know, that this market has resolved the problem.\n\nI mean, this sub (thanks to smarter apes than me) has figured this out already a long time ago and also, it's true what I read in the comment section: It's not just PFOF that is manipulating the price. It's naked short selling + FTDs, dirty plays in the option market and you know.. all the stuff you can read up in here.\n\nThe NYSE also stated, that the price manipulation is systemic, by relating it to PFOF. Even if it is maybe not the most import factor and surely not the only factor, this says: The price of some stocks is systematically manipulated. Well, if it's systemic, the systemic possibility of price manipulation is applicable to all vegetables in the market, not just ~~salad~~ carrots. If this statement gains traction and trickles into the heads of all retail investors (not just apes), this will shake the confidence into transparent price finding massively. And I really doubt that this would be a good thing for the American financial system.\n\nAnd here is another thing implied in that statement.\n\nStock prices is one thing. But now consider the plethora of derivative products around stocks. So, if the price of stock can be systemically manipulated and according to the opinion of the NYSE is being systemically manipulated for some stock, what does this mean for the value of derivative products?\n\nIf the NYSE says GME price is manipulated and you had 250c calls in April, which now have expired worthlessly, I guess you could say that somebody found a way to take away your money. Again, apes know that, but I think that some wrinkly brain retail investor that have never heard of this sub might be able to come to that conclusion as well. So, if all of this means that in the worst case, many of derivatives around stock are just a way to take away your money and in the best case, you're lucky that nobody actually took it away and you might have a shot on profiting from your investment, I guess this might change the view of some people on the derivative market substantially.\n\nNow that the cat is let out of the bag by the statement published in the article, I think that authorities need to act fast in order to avoid that trust in the price finding mechanism of stock in the market vanishes, spilling over the derivative products.\n\nI actually think that this remark by the NYSE will mark the beginning that we actually hear about concrete steps being taken to address the price manipulation we have been seeing for months now.\n\nTL;DR:\n\nIt's big that the NYSE acknowledges that prices are not reflecting demand and supply properly, this cannot be left standing in the room, so I believe we will see some action being taken to eliminate price manipulation.\n\nEdit 1: Not financial advice of course and I forgot the most important part: 🚀🚀🚀🚀\n\nEdit 2: TIL: Salad is not a vegetable. Also, the German word \"Salat\" only roughly translates to the English word \"salad\", because it also means \"lettuce\". Changed to a vegetable now lol.",
    "title": "It actually is big when the NYSE president says \"prices may not properly reflect demand\"... here's why",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1tzje/it_actually_is_big_when_the_nyse_president_says/"
}