{
    "author": "guillaume21",
    "created_utc": 1623962129.0,
    "distinguished": null,
    "edited": 1623979455.0,
    "id": "o275mi",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o275mi",
    "num_comments": 782,
    "permalink": "/r/Superstonk/comments/o275mi/one_of_the_best_confirmation_bias_is_how_msm_now/",
    "score": 11071,
    "selftext": "**TL;DR** : The way the stock market MSM is talking about AMC but specifically avoiding to talk about GME is, for me, one of the biggest confirmation bias. Because when the stock market MSM guys avoid talking about a stock is exactly when you should look into said stock. They're not there to help you with your investments, they exist to push the stocks that their daddies want them to push. This is part of their strategy for a « controlled demolition » regarding the MOASS.\n\nHave you noticed how MSM suddenly have no problem mentioning AMC or « meme stocks » but they never ever mention GME? There’s clearly an unspoken rule at the moment within MSM that says « Do not, in any case, mention GME. As far as you're concerned, it doesn't fucking exist. ».\n\nWhy?\n\nBecause they want us to forget about GME.\n\nBecause they are trying to make people jump ship from GME to AMC by pushing it down our throats every day so that we end up believing that AMC was the true play all along.\n\nBecause GME is the elephant in the room of the whole economy, and there’s already enough retail interest to make the market implode, so they must avoid more people buying it at any cost to reduce the impact of the inevitable MOASS.\n\n\nHave you seen the face that Charles Payne made in that interview with the two brothers that are making a documentary about apes? His expression totally changed the second one of the brothers mention GME and he seemed uncomfortable and distressed for the rest of the interview. The face he makes says it all. (I'm unable to find the post with the interview right now...)\n\nEDIT: [here is the clip](https://youtu.be/C73MBeMhfeE) thanks to u/ZoeMameth. Also, u/albanak, one of the Mulligan brothers, commented on this post himself saying he also thinks they are avoiding talking about GME and that’s why he mentioned it in the interview. It’s about 3 minutes into the video, notice how Charles nervously checks his glasses and completely changes his tone and demeanour for the rest of the interview.\n\n\nThere is only one true MOASS and it's GME.\n\nI believe the MOASS is inevitable, and that right now it’s all about stalling it as long as possible to find ways minimize it’s impact and back their asses up as much as they can, and one way they found for this is to push AMC over GME. You’re crazy if you think they’re going to let this happen without finding some way to make it profitable for them. Sure, Citadel and the others that shorted GME are fucked, but others are going to feast on this.\n\nThat being said, I’m just a smooth brained ape and I don’t know shit, I just like the stock.\n\nAll I know is that if they think they can distract us from GME they're fucking wrong. Today I sold all my remaining AMC shares for a nice profit (from 9$ to 62$, thanks for the push guys) and used it to buy more GME. My portfolio is now 100% GME and I'm not selling a single share until the price looks like a phone number or I'm literally dead.\n\nTO THE FUCKING MOON AND BE PREPARED TO HOLD THROUGH ANYTHING 🚀 🚀 🚀 🚀 🚀 🚀",
    "title": "One of the best confirmation bias is how MSM now has the green light to talk about AMC and other meme stocks but specifically avoid talking about GME",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/o275mi/one_of_the_best_confirmation_bias_is_how_msm_now/"
}