{
    "author": "Blast_Wreckem",
    "created_utc": 1617493996.0,
    "distinguished": null,
    "edited": 1617517593.0,
    "id": "mjkfa4",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mjkfa4",
    "num_comments": 463,
    "permalink": "/r/GME/comments/mjkfa4/the_new13f_fillings_just_proved_melvin_is_still/",
    "score": 3935,
    "selftext": "Tl;dr: recent 13F Fillings show 82 orgs holding 66M shares at $14.52 and how that could be the shorts cover target, and it may have gone unoticed...\n\nWhat's up guys? \n\nAfter a day of banana harvesting and leisurely ass-picking, I had just ran out of my last crate of crayons I'd been sticking in my ears and mouth, and decided to hop on Reddit and see what was up with my fellow apes.\n\nWith a pipe full of banana leaves in one hand, and a fifth of Xactly in the other, I sat down to look for literally anything worth reading...\n\nRight about the time I was going to give up because I couldn't find a damn thing to read, I ran across a very lackluster and underwhelming post (no fucks given OP) about the recent 13F/13G filings and decided to take a quick look-see at em.\n\nAs I sat there scrolling through loads of excel puke, I decided to take a look at the number of shares reported vs the number of shares from other sites.\n\nLong story short, I got stuck in an ADD loop and almost wrote a DD, but instead stuck a crayon in my eye, like the good little ape that I am, and remembered to stay focused on the holdings data or I'd never get anything done, and drafted a Discussion instead.\n\nFirst, I noticed that a large portion of the reported data was locked because I'm too poor to afford the Preminum Package and don't work in this completely fucked up and morally corrupt industry where I assume someone else pays for this data-vomit, so I focused on the [data] that was available to me.\n\nWith a little bit of Excel wizardry (really just copy pasta and some Sum functions), 37 Crayola-brand nicotine patches, and little speculation, I found the following detail(s):\n\nCitadel listed 200K+ shares with locked Call/Puts\n\nMelvin Capital still lists locked Puts as was the case back in Dec\n\nUsing the wrapper from my nicotine patch container, I made a tin-foil hat, used it to role-play that I was king of DK's Island, and began to speculate the following delusions:\n\nFor Citadel, it confirms what we already know. They are still heavily involved with GME in all aspects and it would not be absurd to speculate that the listing for their average price per share of 14.52 is likely the price they purchased someone's short position at, and may be what their target short share price is to break even...\n\nAs a matter of fact, there are 82 other institutions/funds who hold 66M shares at $14.52. For comparison, there are 19 institutions/funds that hold only 665K shares at 14.51 and 14 institutions/funds that hold 736K shares at 14.53.\n\nWhy in the hell are there 66M shares held by 82 organizations with the same average share price (14.52)? \n\nSomething seems to be all too telling that the equivalent of the entire pool of outstanding shares are held by these 82 organizations at the $14.52 mark.\n\nCould this be the list of organizations that bought the short shares during a specific time period, all for the same price and may be in on or victim's of purchasing hypothecated shares? \n\nMaybe\n\nCould some of the listed 82 organizations be on our side?\n\nPossibly\n\nI gave up my imaginary throne which proved to just be my printer desk, and decided to take a break as I had to go take a massive dump.\n\nAfter I got back from shitting 15 lbs of crayons and offending the neighbors as I've continued to use their swimming pool as a toilet, I continued to look at the mess of bullshit they call a Fintel report.\n\nYeah, I didn't come up with much else except for that Melvin still holds Put options as of 2/16 (can't tell you how many...poor, remember). If I remember correctly, which hurts like a son of a bitch if I do it for more than the time it takes to pull my fingers out of my own ass, they held 5,000,000 shares [likely] allocated in married PUTs which could prove that they did not cover back in January as they professed to you, me, Congress, Barak Obama, that Sham-Wow guy, and the rest of the main street America if the next filing has them holding a similar position.\n\nWe'll have to see what that number looks like after the data with the true number is rooted out...or the MOASS happens and we forget all about it like I forgot to take my TV dinner out of the dishwasher.\n\nAnyways, back to some personal insight(s):\n\nI love the speculative nature of this saga because there is SO much open-source information available to the public that we can use to find, wipe our asses, cover up piles of beautiful crayon infused effluence, or speculate with in hopes we can find the lost city of El Dorado's only Wendy's. \n\nIf there is any significance to the 14.52 price point, and it's indicative of the short sale prices at the time of sale, it could be that it stems from the organizations that were infinity-shorting GME at the time. And so long as GME stays above that mark, the shorts lose.\n\nI mean, they've already lost...they just haven't gotten the call yet!\n\nAnyways, thanks for making it this far and giving me a moment of your valuable rage-filled time that you would've used to actually accomplish something in life...or if you were like me, you'd probably just be sitting in the corner of your living room throwing crayon-filled shit at your dog because he doesn't understand why the US treasury bond is now the reserve currency of the US financial market, u/attobit might just be the next Steven Hawking, and DFV has a more loyal fan base than Nostradamus.\n\nAnyways, tune in next time for another exciting episode of, \"Power to the P's!?!\" <guitar riffs>\n\nBUY + HODL = 🚀\n\n[UPDATE]\n\nu/elgee55 asked if there was any correlation with the share price and the timing of RC's letter to the board. He added his speculation that some of the larger HFs at that time could've seen an opportunity to corner the market and buy up all the shares for 14.52. \n\nThat seemed plausible, so I took a look and came up with the following info:\n\nRC's letter was submitted on Nov 16th. The stock closed at $12.06 that day and remained below $15 until Nov 27th. It dipped back below $15 between Dec 8-9th and remained sub-$15 until the 18th. It has remained above $15 since then.\n\nThe fact that there was so much fuckery surrounding the Jan 28th mini-squeeze indicates that the aforementioned periods proved to be irrelevant for some of the short holders as liquidity issues stemming from the increased share-price were observed.\n\nIf the large HFs cornered the market at that point and held strong, and then retail joined the rally, then ANY one who was short gameatop lost the day RC sent that letter.\n\nSince we already know that to be an evident [and assumed] truth, we may have found ourselves in an even better position as there haven't been many, if any real shares available to purchase since mod Dec.\n\nThat further aids in the understanding that each share retail (or any one else for that matter) purchased after mid December, has likely resulted in and FTD...each and every one of them.\n\nIt's mind-blowing to consider!\n\nEdit: For the one guy who doubted the validity of the usage of the word \"New\" in the title:\n\nhttps://fintel.io/so/us/gme\n\nThe report contains up-to-date data from just a week ago for those of you (that one guy) who may be confused.\n\nHats off to you for taking the time to keep me honest! I'll go back to free basing my Fuzzy Wuzzy colored crayons I'd been saving since Toys R Us banned me from the store.\n\nEdit 2: updated Melvin's previous holdings from 600K to 5M shares because...we'll, I'm a smooth brained ape who listed this as a discussion and that's what I wanted...to think how bare my ass would be had I ALSO flagged this as DD...\n\nEdit 3: added some verbiage to clarify that the current holdings listed on the report for Melvin represents a file date of 2/16 for holdings as of Dec 31st. We will have to wait until the current quarters data is reported in the coming weeks to confirm if they still have skin in the game...I am but a humble ape who may have drank one too many crayola 🍸's.",
    "title": "The New13F Fillings Just Proved Melvin is Still in the Game, and the Shorts Likely Target to Cover is $14.52",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mjkfa4/the_new13f_fillings_just_proved_melvin_is_still/"
}