{
    "author": "johnnyz321",
    "created_utc": 1617487890.0,
    "distinguished": null,
    "edited": 1617580560.0,
    "id": "mjij7s",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mjij7s",
    "num_comments": 959,
    "permalink": "/r/GME/comments/mjij7s/the_confirmationbiasechochamber_problem_after/",
    "score": 5212,
    "selftext": "\\*\\*mods I will gladly delete this if it violates any sub rules\\*\\*\n\n\n&#x200B;\n\n&#x200B;\n\n**$10,000,000+/share is not a meme.** \n\n&#x200B;\n\nEverything I have read here and elsewhere has pointed to a squeeze that will rock the financial world to its very core. The problem with that is that **I (and many others here) now have a relatively clear understanding of how the MOASS will play out, but have no knowledge of anything that would point in the other direction.** \n\n&#x200B;\n\nThis sub is home to some of the greatest financial minds in the world, who generously share their work with us entirely for free. The sheer abundance of quality DD posted here every day is enough to convince anyone that the MOASS will happen, and is looming over the horizon any day now. This is not a fully realistic way of thinking, and simply creates more paper-hands when the price drops, or when bad news is revealed. **Nothing is guaranteed** and the game is rigged against us.\n\n&#x200B;\n\nI think it would be beneficial for us to read and consider any counter-DD that exists (if any even does, I haven't seen a single post disproving any of the God-Tier DD posted on this sub). We need to understand every card that can be played along the way, every blindside or trick in the bag if we are going to win this game against the shorts.  **This sub should not be a place where opposing views are discouraged from being shared, as long as they are based in facts and not baseless speculation.** \n\n&#x200B;\n\nI am not asking to try and be convinced that the MOASS is not happening, at this point nothing will convince me otherwise. I will be holding my shares until the day I die, if that's how long this plays out. I'm just worried that this sub is becoming over-confident in something happening that has never happened before. **I don't like the fact that I am 100% certain of selling my GME for $10,000,000 a piece.** I am not a shill, I don't work for shitadel, I don't want to spread FUD. I just want to be informed of all sides of what is happening, good and bad. And when the squeeze happens I want to be able to go to those people who doubted it and laugh in their faces. \n\n&#x200B;\n\nTLDR; \n\n$10,000,000/share is not a meme. \n\nEcho chambers are never good. \n\nWe need to consider all possibilities of how this can play out. Good and Bad.\n\nHealthy discussion and understanding your enemy is vitally important.\n\n***KNOWLEDGE IS POWER***",
    "title": "The Confirmation-Bias/Echo-Chamber Problem. After spending a bit of time on this sub, and reading an avalanche of incredible DD, I am fully convinced that the M.O.A.S.S. will launch any day. $10,000,000/share is honestly what I expect at this point. That is not entirely a good thing.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mjij7s/the_confirmationbiasechochamber_problem_after/"
}