{
    "author": "eddiethelock",
    "created_utc": 1617382924.0,
    "distinguished": null,
    "edited": 1617409906.0,
    "id": "mioj4p",
    "text_only": true,
    "flair_text": "Hedge Fund Tears 😭",
    "name": "t3_mioj4p",
    "num_comments": 678,
    "permalink": "/r/GME/comments/mioj4p/pretty_fair_to_say_the_consensus_is_that_over_80/",
    "score": 7297,
    "selftext": "See a few threads now and then that talk of the possibility of the govt stepping in.. Not unfathomable. As much as it will hurt the free market in the future, this is a horse of a different color. what if, everyone said one billion? It's a gimme if it was 100% followed. The number is infinite!  It's not just shitadel and the dtcc, this is world wide shit. Credit Suisse took a hit and how many dominoes are gonna follow. The magnitutde of this makes it almost imperative that the govt steps in.. and looking at the majority here, who by the way probably hold the float, are at the 1 mill floor, I'm in if it's offered up by the feds and up for a vote, and if they get cute with a 1k offer we jump to 1.5 mill.. but think the HF's learned that lesson from their last fucktarded move that pissed everyone off.. Not like i give a fuck if they go under, it's gonna be biblical. We mathematically could bankrupt the world.  This Doesn't Suck!\n\nedit: yes and as mentioned below by ok-release, the mill is tax free so the feds will have to jump it up to 1.4 mill for their cut.\n\nedit: edit after one minute but now i'm gonna roll one up and enjoy the next three days.. cya Monday.. Happy Easter\n\nedit: i had to throw this in, it's part of another post about day three of the moass i did other day but makes me laugh:\n\nWhat are the odds? Kids in Europe looking at numbers they never  expected to see in their wildest dreams. Their parents are saying \"sell,  sell, sell\". The kid comes back with \"not a fkn chance, when DFV gets  out I'll get out\". \"Now sit down and stfu or I'm not payin off your  mortgage and I'm gonna be outta here like that kid in \"Home Alone\"  ending up at the Plaza Hotel in NYFknCity\".  HF's found another card to  play to try and save their asses. \"Major halt!! Two hours.. Lame excuse  (like a power failure or some shit like that) but all of wall street is  now shut down. Panic setting in. 300% increase, price is 118,000. You'll  have to shut your phone off cause everyone that you know is trying to  call you to see if you are watching..   Hedge Fund workers getting fired  left and right for telling every family member to buy the hell out of  GME. They're clearing out their desks and all are leaving in limousines.  Limo driver: \" Where To Sir?\" Unemployed Hedgefucker, (now turned ape): \"The  Plaza Hotel Please\".\n\n&#x200B;\n\nhey thanx for the awards you guys\n\nhey kates xo",
    "title": "Pretty Fair To Say The Consensus Is That Over 80% Here Demand At Least a Million A Share.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mioj4p/pretty_fair_to_say_the_consensus_is_that_over_80/"
}