{
    "author": "moonski",
    "created_utc": 1625230502.0,
    "distinguished": null,
    "edited": 1625231176.0,
    "id": "oc9i87",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oc9i87",
    "num_comments": 79,
    "permalink": "/r/Superstonk/comments/oc9i87/s3_partners_ihor_back_at_it_again_with_some_hot/",
    "score": 1019,
    "selftext": "Your boy is back. No not me  /u/moonski aka casual.\n\nI'm talking about the OG of Short Interest.\n\nThe man, the myth, the cabbage loving Ihor Dusaniwsky aka  Ihor aka  1 of the 3 S3 partners ™  aka @ ihors3 on Twitter  aka the iHorse ™  is back with some hot new Hedge Fund Approved ™  DD.\n\nHe was lighting up twitter like a banks office at 3am on a Saturday night yesterday, motherfucker blowing up phones like Gabe Plotkin blows up assets under management. I swear he tweeted what like every single ticker on the NYSE's short interest.\n\nBut that's not why smashing the keys of my mechanical Cherry Red RGB Wireless Blockchain enabled gamer approved turtlebeach 360 audio keyboard, using my 1990 IBM 5150 to right click on spelling errors and put my trust in my autocorrect addon that it can do English better than me.\n\nI'm writing this shit because in between tweeting RNG based Short Interest calculations, Ihor has been a busy boy.\n\nIhors home office has been \"busier than usual\" on google maps.\n\nIhor been using his unlicensed copy of excel 2003.\n\nIhor be doing some motherfucking Due Diligence.\n\nAnd maybe some of you follow s3 or saw his DD. Well Have I got news for you.\n\nBut in case you are reading this like \"who the fuck is Ihor?\" what the fuck is an S3 partner? Let me quickly explain who the iHorse is and who employs him.\n\n&#x200B;\n\n[Hi I'm Ihor. I like tweeting.](https://preview.redd.it/twvrzvulur871.png?width=400&format=png&auto=webp&s=5ebda3e709eee5a8c994cd1b756b94c0957278e3)\n\n**>Who the fuck is Ihor and what is an S3 Partner.**\n\nS3 partners are, according to their linkedin, \" A Data Power Company.\" Whatever that means. What does the S stand for? Dunno. Who are the s3 partners? Dunno. Well, actually, one of them is IHOR. The other 2? Probably made up like his short interest data.\n\nIhor Dusaniwsky aka iHor aka @ Ihors3 on twitter aka the iHorse, has been there since 2003. He's now an MD. Ok enough about fucking ihor for now.\n\nFounded in 2003, S3 Technologies aka S3 Partners a market data and analytics firm, who among other things, seem to have carved a bit of a niche in short interest reporting. Great. S3 Partners tweet a lot, often Short interest info & charts.\n\nWell they did tweet a lot, until GME turned Melvin Capital into Citadel Securities in January 2021. Now S3 Partners never tweet, and only the man himself Ihor Does.\n\n**Ihors D FUCKING D**\n\nSo Ihor tweeted dis - his fire new DD - [https://research.s3partners.com/u-s-short-selling-recap/](https://research.s3partners.com/u-s-short-selling-recap/).\n\nIhor says the most shorted stocks on the NYSE are as follows;\n\n&#x200B;\n\nhttps://preview.redd.it/at2h1wt2yr871.png?width=540&format=png&auto=webp&s=c1bcde85be26358e7830365a1ff6d582a4da33c2\n\nS3 \"shortsight\" still to this days says it's these bad boys  [https://www.shortsight.com/the-most-shorted-stocks/](https://www.shortsight.com/the-most-shorted-stocks/) \\- different to Ihors hot off the press DD, but iHor hasn't had time to open his copy of  photoshop CS1 and update the picture I guess.\n\n&#x200B;\n\n[They did a picture cause they know people can't fucking read.](https://preview.redd.it/lhzf1m99yr871.png?width=1212&format=png&auto=webp&s=385ac18392c423a5c5868d815b7633d4864f7b43)\n\n&#x200B;\n\nI could just end the post here because... well look at those companies. They're using value of the short position as a metric for \"most shorted\" which is, well, kinda retarded and not very fucking useful, since market cap will determine who's the most short.\n\nI mean they literally say, at a whopping 0.67% of the float, Apple is one of most shorted stocks on the market...  (cause 0.67% of apple is still 15 billion lol). So is Berkshire Hathaway. Yeah. Course it is. At a whopping 0.05% SI but ok it's definitely up there.\n\nAnyway, wut do with gme I hear you ask? Wut Ihor say about GME in his DD I hear you also ask?\n\nIhor says these are  stocks that had the largest reduction of short exposure over the last thirty days.\n\n&#x200B;\n\n[oh there's GME - at #1 in case you can't read](https://preview.redd.it/235y0nlazr871.png?width=564&format=png&auto=webp&s=0e3c61d97847b24e1fea82b44e018f2ab29742aa)\n\nIhor says these stocks had the most shorts covering, which is different from the above metric, somehow. I didn't research what the difference is because\n\n1: it doesn't matter.\n\n&#x200B;\n\nhttps://preview.redd.it/h6q22f7izr871.png?width=562&format=png&auto=webp&s=a8127c7a933d1cdf2f57e3805c8a5243148985a7\n\nagain I could just end the post here because... well we all know why. I mean obviously apple is #1 again... cause reasons. With GME Ihor must be correct as covering shorts = buying shares = price goes... not up? kk\n\nHow is that possible?\n\nMagic? Of course\n\n[yer a wizard ihor](https://preview.redd.it/oxrjc57cms871.png?width=300&format=png&auto=webp&s=b0b428ef115d06a9f0eed2406613b7d92290fc35)\n\n&#x200B;\n\nOr maybe s3 are telling lies telling sweet little lies. Also using the 30 Day metric is a nice way to mould the data into whatever sculpture Ken Griffin demands.\n\nOh yeah btw citadel own s3 or at least part of it... cause fucking of course they do.\n\n1. S3 securities was a subsidiary of S3 partners and partially owned by Knight Capital Group (KCG)\n2. 2013 KCG and Getco merged to form KCG Holdings\n3. KCG has 75% indirect interest ownership of all of Virtu holdings\n4. KCG turns into VIRTU KCGM\n5. Virtu KCGM was one of the dark pool traders\n6. Virtu bought KCG programs in 2011\n7. Citadel bought S3 Partner data and services in 2013\n8. KCG was bought by Citadel in 2016\n\nAnyway back to the DD - My favourite is his Crowded Score & Squeeze score he invented about a month ago - how they calculate it is a secret. Like you know \"secret sauce it's proprietary bro trust me its legit and totally accurate.\"\n\nhttps://preview.redd.it/f02y32wrzr871.png?width=476&format=png&auto=webp&s=6fc4a8bab13be34bb20d44d967d21b7f9464e8e6\n\nWut. No GME? Oh well. Must have forgotten GME.\n\nThe fuck is a crowded short anyway?\n\nWell Ihor say's a short is crowded if;\n\n* there are large amount of dollars at risk on the short side,\n* a large proportion of a stock’s float is being shorted,\n* there is illiquidity in the stock loan market\n* and\\\\or there is illiquidity in the trading market.\n\nI mean that description really sounds like GME. Like literally ask Alexa / Siri / Google Assistant / re-enable cortana on windows and ask her to \"define GME\" and you'll be told the above.\n\nBut no, GME isn't crowded. GME isn't shorted. GME covered. Forget GME.\n\nThere's also a squeeze score list which GME isn't on, and a \"Most unprofitable shorts last 30 days\" which GME isn't on either obviously, cause S3 forgot GME (and also again used some nice metrics to make sure they forgot GME).\n\nSo basically, Ihors DD is that we are to believe that the short side of GME Covered 226% of the float short all the way to down to 12%, in 5 months, \\*after\\* the gamma run in January.  You telling me HFs have bowed to retails power and admitted defeat? My sides.\n\n***Also btw the 226% isn't just from that Robinhood court case paper - here's a screenshot from FINRA on Feb 2nd 2021 - in case y'all want more sauce.***\n\n&#x200B;\n\nhttps://preview.redd.it/06uuz5qf0s871.png?width=960&format=png&auto=webp&s=d3203d911854ac92826c8e7f38ea222e4c42c878\n\nSo why am I writing this? Oh right yeah. Ihor. GME.\n\nSo here's why S3 and Ihor say what they do. They ain't deliberatly lying - probably.  S3 aren't actually wrong. Ihor isn't actually wrong either.\n\nWUT. u/rensole get in here shill ban\n\nYes I know. Allow me to explain.\n\nS3's data is likely correct. The problem is, S3's data doesn't cover anything out of the ordinary. They aren't reporting things like, I dunno, naked short selling or reverse conversions, or however else THE GOD DAM HEDGIES are manipulating their short reporting & positions.\n\nWhy I know this? Well for one there's god knows how many fines for Market Markers reporting short sales as long so that would break their data.\n\nAlso do you think the S3 data on Short interest covers things like what that fucking Pomeranian u/criand posted ?\n\n[https://www.reddit.com/r/Superstonk/comments/oc4f79/well\\_there\\_it\\_is\\_more\\_mathevidence\\_pointing\\_to/](https://www.reddit.com/r/Superstonk/comments/oc4f79/well_there_it_is_more_mathevidence_pointing_to/) ?\n\nNo I don't think so either. Cause that isn't technically \"short interest.\"\n\nYou think they take in account fraud & illegal activity that is *constantly* being fined? No I don't think so either because those aren't traditional short selling transactions either are they.\n\nOh also there is this magnificent PDF from 2009 about S3 and their belief that the market is 100% fraud free farm to table organic everyone plays by the rules.\n\n[https://www.sec.gov/comments/s7-08-09/s70809-407a.pdf](https://www.sec.gov/comments/s7-08-09/s70809-407a.pdf)\n\nI wont go over this in detail, but here's the cliff notes™. ^((BTW here a GSE is referring to Freddie Mac and Fannie Mae))\n\n[\\(a GSE is Fannie Mae \\/ Freddie Mac\\)](https://preview.redd.it/visfrq622s871.png?width=842&format=png&auto=webp&s=9f764c813fe8601e3ee70b2e4f2cd2122a8352ff)\n\nhttps://preview.redd.it/pbm3uoa32s871.png?width=845&format=png&auto=webp&s=5ca48834f0fd31c812b20bff6c449fdb8267e6a0\n\nBut wut do with w3 & GME? Well look what s3 said happened during this time\n\nhttps://preview.redd.it/2qj4ohd52s871.png?width=1170&format=png&auto=webp&s=b370f67982ee06abe1546d633adedd7d33635790\n\nSo S3 weren't \"technically wrong.\" Legitimate Short selling did likely drop by 90%. Problem is illegal short selling went to the god dam moon ™. Also does this not remind you of a stock today? One that starts with Game ends in Stop? Yeah me too. Sounds familiar.\n\nI mean look at what happened to Fannie Maes share price *after* \"shorting selling was banned.\" Weird huh? I mean shorting dropped 90% so why price drop to almost 0?? Seems weird. That also reminds of a ticker I keep being told to forget.\n\nhttps://preview.redd.it/py92p4t72s871.png?width=976&format=png&auto=webp&s=b1ccec18f45236e6968af5456b276cdfd7572b0c\n\n&#x200B;\n\nAnd yet here we are 12 years later. Same shit different stock. The market is being told Short interest has dropped 90%, forget GME go long on some fuckin shiny rock, \"We specialise in short interest we know best.\"\n\nif you wanna read more about that PDF and how it stinks of GME read this [https://www.reddit.com/r/Superstonk/comments/mo2811/let\\_me\\_tell\\_you\\_the\\_tale\\_of\\_s3\\_partners\\_a/](https://www.reddit.com/r/Superstonk/comments/mo2811/let_me_tell_you_the_tale_of_s3_partners_a/)\n\n&#x200B;\n\nIhors tweets yesterday riled me enough to write this incoherent ramble. These are the companies that specialise in Short Reporting. It's literally their job. And yet even they can't get it accurate when fuckery is afoot. The Regulator can't do it. The Self Regulator (lol) definitely won't do it.  And Ihor definitely can't fucking do it.\n\nIt's just preposterous the shit being spewed as fact from \"reputable sources\", as if people are to believe GME is done and dusted.\n\nIf you were to believe their, or any company like s3's data, then no one is short GME, everyone's short fuckin Apple.\n\nIf you read this far well done, here's the iHorse.\n\n&#x200B;\n\nhttps://preview.redd.it/7p83nuha3s871.png?width=128&format=png&auto=webp&s=8900050145fd202c5f57d78475943e9074a0e0b1",
    "title": "S3 Partners & Ihor Back at it Again with Some Hot New Hedge Fund Approved™ Short Interest Reporting.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oc9i87/s3_partners_ihor_back_at_it_again_with_some_hot/"
}