{
    "author": "Parsnip",
    "created_utc": 1625723701.0,
    "distinguished": null,
    "edited": 1625731202.0,
    "id": "og14vj",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_og14vj",
    "num_comments": 349,
    "permalink": "/r/Superstonk/comments/og14vj/diamantenhände_german_market_is_open/",
    "score": 3626,
    "selftext": "Guten Tag to all of you Great Apes around the world! 👋🦍\n\nAnother great day to HODL GME! German apes started yesterday off with a near-perfect demonstration of 'sideways trading', setting up a vicious pre-market and regular market short attack and the highest volume yet in July! I don't know about your friends and family, but mine are all *very* supportive of my decision to HODL the stock I like, and understand that these dips on good news and large volume are just proof that the SHFs are desperate. Identifying FUD campaigns is starting to feel like second-nature, and it's great to know that Apes continue to patiently buy, HODL, and await the MOASS.\n\nDid you hear? Today is July 8th, the penultimate day of trading this week, and you know what that means! Join apes around the world to watch low-frequency updates from a single German exchange!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- ⬜ 120 minutes in: **$185.42 / 156,83 €**  *(volume: 2218)*\r\n- 🟥 115 minutes in: $185.42 / 156,83 €  *(volume: 2218)*\r\n- 🟥 110 minutes in: $185.55 / 156,94 €  *(volume: 2008)*\r\n- 🟥 105 minutes in: $185.59 / 156,98 €  *(volume: 1920)*\r\n- 🟥 100 minutes in: $185.60 / 156,98 €  *(volume: 1907)*\r\n- ⬜ 95 minutes in: $185.61 / 156,99 €  *(volume: 1881)*\r\n- 🟥 90 minutes in: $185.61 / 156,99 €  *(volume: 1881)*\r\n- 🟥 85 minutes in: $185.63 / 157,00 €  *(volume: 1795)*\r\n- 🟥 80 minutes in: $185.70 / 157,07 €  *(volume: 1681)*\r\n- 🟥 75 minutes in: $185.70 / 157,07 €  *(volume: 1679)*\r\n- 🟩 70 minutes in: $185.77 / 157,13 €  *(volume: 1521)*\r\n- 🟩 65 minutes in: $185.76 / 157,12 €  *(volume: 1495)*\r\n- ⬜ 60 minutes in: $185.76 / 157,11 €  *(volume: 1488)*\r\n- 🟩 55 minutes in: $185.76 / 157,11 €  *(volume: 1488)*\r\n- 🟥 50 minutes in: $185.75 / 157,11 €  *(volume: 1453)*\r\n- 🟩 45 minutes in: $185.77 / 157,13 €  *(volume: 1421)*\r\n- 🟥 40 minutes in: $185.77 / 157,13 €  *(volume: 1416)*\r\n- 🟥 35 minutes in: $186.08 / 157,39 €  *(volume: 1003)*\r\n- 🟥 30 minutes in: $186.09 / 157,40 €  *(volume: 992)*\r\n- 🟥 25 minutes in: $186.18 / 157,48 €  *(volume: 740)*\r\n- 🟥 20 minutes in: $186.18 / 157,48 €  *(volume: 739)*\r\n- 🟥 15 minutes in: $186.63 / 157,85 €  *(volume: 397)*\r\n- 🟥 10 minutes in: $187.23 / 158,36 €  *(volume: 122)*\r\n- 🟥 5 minutes in: $187.27 / 158,40 €  *(volume: 109)*\r\n- 🟥 US close price: $190.66 / 161,26 €   *($187.10 / 158,25 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from a single German exchange and converting to USD. Today's euro -> USD conversion ratio is 1.18229164. There are sometimes small differences in price that are below the rounding error to two decimal places, which can lead to colorful boxes without obvious price change. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Over a week ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/og14vj/diamantenhände_german_market_is_open/"
}