{
    "author": "hmhemes",
    "created_utc": 1627785812.0,
    "distinguished": null,
    "edited": false,
    "id": "ovk7yy",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ovk7yy",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/ovk7yy/whatever_your_expectations_shorts_still_have_not/",
    "score": 1455,
    "selftext": "There's a lot happening right now, both within the sub and without.\n\nHype about Monday being the beginning of the next big run-up, eviction moratorium predictions, debt ceiling auspices, shilling, etc. Its a lot of stuff all at once. And I just want to say that whatever happens going forward, nothing really changes, since shorts still have not closed.\n\nExpecting a big run-up on Monday because the TA suggests it will happen? Nice, hope it works out. Though it doesn't *really* matter if nothing happens, since shorts still have not closed.\n\nExpecting margin calls and liquidations from a market crash triggered by the debt ceiling and evictions? *Might* happen, but it will take time. Doesn't *really* matter though, since shorts still have not closed.\n\nWill the debt ceiling be increased? No guarantee, but its likely to happen if history is any indicator. Are shills out in force? Sure they are, but that's nothing new. None of this *really* matters though, since shorts still have not closed their positions.\n\nThat's the beauty of holding. And I know you know this. All the drama and intrigue and speculation about immediate developments are just something to muse over to pass the time. It doesn't *really* matter, at least not to me, since immediate developments are not a deciding factor in my investment decision.\n\nWhat are my deciding factors in going long on GME?\n\nI like the leadership. I like the company's cash position. I like the investment in their distribution networks and streamlining of their storefronts. I like the focus on e-commerce. I like the prospects of e-sports and NFTs. I like that GME is a leader in the growing gaming industry and backed by shareholders that believe in the company's ability to deliver.\n\nAnd the cherry on top of this cake, is that the institutions that bet on the company's downfall are yet to close their short positions.\n\n*Short sellers are eventual buyers, its just a matter of timing. And when you are long on a stock, time is on your side.*\n\nEnjoy the ride, folks.",
    "title": "Whatever your expectations, shorts STILL have not closed their positions",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovk7yy/whatever_your_expectations_shorts_still_have_not/"
}