{
    "author": "hello-world-foo-bar2",
    "created_utc": 1614430264.0,
    "distinguished": null,
    "edited": 1614453439.0,
    "id": "ltnhij",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_ltnhij",
    "num_comments": 67,
    "permalink": "/r/GME/comments/ltnhij/gme_ultimate_guide_cheat_code_inside/",
    "score": 586,
    "selftext": "*Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt. I love the stock.*\n\nIn this post, I’ll provide context to this week events and continue a discussion on the financial engineering game happening around GME. Moreover, I’ll describe how the jump in the 10 year Treasury yield (risk parity trade) severely weakened the short position.\n\nThe game will continue but retail holding no matter what *underpins* the entire game framework and mechanics.\n\nRetail holding GME shares and buying the dip with shares or fractional shares is the cheat code.\n\nThe Retail Assisted Hedge Funds (whales) will do the heavy work of financial engineering.\n\nArmy of Quants in other hedge funds have analyzed the markets structure, positioning, market participant’s move and counter move, and have concluded shorts are F%#Ked. They see the market mechanics in retail's favor and they are sided with retails for easy profits.\n\nYou are not alone.\n\n# Background\n\nFirst, let’s define the market participants and their role in the market. The market participants are describe in 4 groups:\n\n1. Retail – (Millions) - Reduces liquidity by buying up millions of shares\n2. Retail Allied Hedge Funds (RAHF) – Gamma squeeze Vikings – Provides leverage\n3. Market Maker – Defines the cost of options/moves in the game – Delta/Gamma hedge buyer\n4. Shorted Hedge Funds (SHF) – Participants that have shorted GME shares.\n\n# The Allies\n\nRetail -- HOLDING no matter what -- play a pivotal role in this financial engineering game. A single or fractional share is meaningful and crucial. Each and every retails plays a vital part. Each share is a vote against the system that led to the Great Financial Crisis.\n\nRetail are the lodestone because have bought up millions of GME and by holding no what happens they have effectively removed millions of shares from the float. This is crucial because it creates a condition in which GME shares are very illiquid, so any *natural (non shorted/manipulated) volume weighted* move in prices tend to explode higher. In these natural volume weighted moves, GME share prices, moves in dollars and not pennies. This rate of change in share price, creates a **volatility monster.**\n\nThe illiquidity in GME shares is needed by the Retail Allied Hedge Funds (RAHF) to set up gamma squeezes. The illiquidity created by retail, and the buying of OTM call options by RAHF, caused the gamma squeeze this week (February 24, 2021).\n\nIn the week of February 24, 2021, RAHF bought up 60C OTM and 70C OTM options. The initial 100,000 contracts (10M notional shares) which cost about $10-$16M for the RAHF, led to a gamma squeeze that caused $664M in mark to market losses for shorts \\[1\\].\n\nAt this point let us highlight the volatility monster. Retails holding no matter what and the very high short interest, has created a highly illiquid float. *High volume weighted buys in this system causes the share price to move* ***in dollars not pennies***\\*.\\* *This high volatility (volatility monster) quickly runs up the share price and very far out OTM call options quickly become ITM*. The rapid gamma convexity is an inherent attribute of this system/game so long as retails hold no matter what. Again, retails are the vital participants in this game as all subsequent RAHF financial engineering moves are predicated on them holding.\n\n**Tldr;**\n\nRetail and Retail Allied Hedgefund (RAHF) created a market force of low liquidity and high leverage that can quickly cause far out of the money (OTM) call options to be in the money (ITM). This force can cause massive moves and gap up in share price.\n\n# The Axis\n\nThe axis consist of Hedge funds shorting GME. They have a very high short interest in GME and want to prevent the mother of all short squeezes (MOASS).\n\nIn order to prevent MOASS they have 3 main moves:\n\n1. Synthetic longs\n2. Arbitrage\n3. Market manipulation\n\n## Synthetic Long\n\nAn explanation of synthetic long can be found on youtube.\n\nBasically, Short can create a long share using options (synthetic long share) but this share has an expiration date based on the option used. In other words, after an expiration date, this synthetic long share disappears.\n\nWhat they have likely done is this:\n\nThey have used options to create synthetic longs to hedge against their short position. So they are covered, but only for a certain amount of time because of options expiration.\n\n*Someone on reddit analyzed the put-call parity for GME, and deduced that shorts had created synthetic long with options up to the* ***beginning of April 2021***. This is the likely date in which the synthetic longs disappear and short position are no longer hedged. Thus short interest should jump again once the synthetic long expire and Hedge Funds do not rehedge.\n\nShort are in a precarious situation again if they do not rehedge.\n\n***The gamma squeeze of Feb 24, 2021 has spiked implied volatility, so it's now very expensive for the shorts to build synthetic longs and roll over their hedges in the options market.***\n\n## Arbitrage\n\nThis manoeuver consists of creating shorts and synthetic longs in ETFs which contain GME shares as a proxy \\[2\\].\n\nAn example of this manoeuver is if either bought or borrowed GME shares from XRT to drive down the share price with the goals of invoking weak hands to sell off GME.\n\nThe Arbitrage trade allows the Shorted Hedge Funds (SHF) to maintain a neutral-game positive position and delay the MOASS.\n\n## Market Manipulation\n\nLegal market manipulation is the only value add that Shorted Hedge Funds provides to their wealthy clients.  The Shorted Hedge Funds are skillful at market manipulation and not portfolio construction. Market manipulation becomes a business cost for them.\n\nLegal frameworks are set up to allow for market manipulation and Shorted Hedge Funds know and have exploited them to drive down GME share price. The markets are rigged against you, dear retail. And ***now you are woke***.\n\nThere have been numerous stories of odd events happening with GME share blocks in dark pools and aftermarket trading.\n\nThe mere fact that of unusual activity in GME shares is a data point to support the claim that GME shares are still heavily shorted because if it wasn’t the case, these market participants would not need to manoeuver in such extreme ways to maintain a neutral-game positive position.\n\n# The Game\n\nThe invariants of the game consists of liquidity and leverage. Each market participant's moves are aimed at shifting those global system values.\n\nRetail continue to buy up millions of shares, creating a low effective float. Retail Allied Hedge Funds continue to set up gamma squeezes. The low liquidity and leverage creates a volatility monster that can quickly cause far OTM call options to be ITM.\n\nIt'll be interesting to see what happens when 1400 stimmy checks are mailed out.\n\nShorts continue to arbitrage, hedge with synthetic longs (likely until April 2021), and manipulate markets to prevent the MOASS.\n\nThe Mother of All Short Squeeze starts around GME share price of $800. *There is a hedge fund out there with assets under management (AUM) of 60B that has shorted GME*. GME @ 800 would have a market cap of 56B. The mark to market losses for that hedge fund could be 70% of its AUM.\n\nIt may happen sooner than than expected, if the Retail Assisted Hedge Funds can gamma squeeze GME to $800/share.\n\n***But***, Risk Parity enters the Arena\n\n## Risk Parity\n\nA description of the risk parity can be found here [https://www.investopedia.com/terms/r/risk-parity.asp](https://www.investopedia.com/terms/r/risk-parity.asp)\n\nBasically, Risk Parity allows hedgefunds to *leverage* position. The lower the 10 year treasury yield, the move leverage that can be applied on any position.\n\nNow that the 10 year treasury yield is moving higher, leverage has to be unwind (deleverage).\n\nThis deleveraging also applies to positions to suppress moves in GME. This can be disastrous for shorts but creates a favorable condition for the Allies.\n\nYou can think of the risk parity as how much margin you can get.  As the yield curve decline everyone was able to access cheap credit.  But now that yields are steepening, its costing more to hold into leverage positions.  Remember, these are highly leveraged positions, like 20:1 or 30:1, so a 3% moved can wipe them out.  \n\nObviously the 10 year didnt move 3% but a .05% move higher on leverage can be a 10% decline in the risk parity part of your portfolio construction. It depends how much are your leveraged.  \n\nSo now, let's assume that hedge funds are highly levered on their positions (syntheric long with options, shorts, naked shorts) agianst leveraged treasury yields in a risk parity trade , a higher yield implies a certain percentage of deleveraging to maintain risk parity.\n\nThat deleveraging is the unwind of some positions.\n\nThis is why you are seeing massive market sell offs in the overall bubble markets with long positions, but applies to short positions.\n\n\nSo keep an eye on the 10 year treasury yield. As it continues higher, you’ll see the entire market go red, as hedge funds deleverage all their bubble plays but it also helps GME longs because it'll make leveraged naked short positions more costly to hold.\n\n# GME Virtuous Cycle\n\nGME is transforming into a gaming cloud company. Numerous reports came out this week that they are now selling computer graphic cards, and PC gaming rigs. The shorts had valued GME as a brick and mortar but their investment thesis has changed while they hold a dangerous high short interest. GME is a cloud company and the valuation metric should shift to account for this change in business model.\n\nThe implication is that as the markets finally starts to value GME as a cloud company, its share price will continue to climb, squeezing out shorts. Interspersed with this move to cloud valuation -- that can take up to a couple of years -- will be numerous gamma squeezes as Retail Allied Hedge Funds take advantage of the virtuous cycle to set up more gamma squeezes.\n\n# End State\n\nThe end state is either MOASS or GME inclusion in the SPX500.\n\nWhen GME is included in the SPX500, shorts will be against tens of millions of passive investors. At that point they have lost, ***but before then, MOASS***.\n\nThe Mother of All Short Squeeze starts around GME share price of $800. *There is a hedge fund out there with assets under management (AUM) of 60B that has shorted GME*. GME @ 800 would have a market cap of 56B. The mark to market losses for that hedge fund could be 70% of its AUM.\n\nMOASS may happen sooner if the Retail Assisted Hedge Funds can gamma squeeze GME to $800/share.\n\nOver the next months, expect many more gamma squeezes and lower share prices but as long as the virtuous cycle holds, we will approach GME at $800/share. That is the process. Believe in the process.\n\n# Cheat Code\n\nThe cheat code is just to HOLD and buy the dip with shares or fractional shares. Tell a friend. That’s it. As long as retail do this, MOASS will likely happen as the virtuous cycle takes hold.\n\n# References\n\n\\[1\\] [https://markets.businessinsider.com/news/stocks/gamestop-short-sellers-billions-losses-reddit-traders-wallstreetbets-rally-gme-2021-2-1030125873](https://markets.businessinsider.com/news/stocks/gamestop-short-sellers-billions-losses-reddit-traders-wallstreetbets-rally-gme-2021-2-1030125873)\n\n\\[2\\] [https://www.reddit.com/r/GME/comments/lp37ll/short\\_selling\\_etfs\\_what\\_it\\_does\\_how\\_it\\_affects/](https://www.reddit.com/r/GME/comments/lp37ll/short_selling_etfs_what_it_does_how_it_affects/)",
    "title": "GME | Ultimate Guide | Cheat Code Inside",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/ltnhij/gme_ultimate_guide_cheat_code_inside/"
}