{
    "author": "WhatCanIMakeToday",
    "created_utc": 1628129436.0,
    "distinguished": null,
    "edited": 1628129828.0,
    "id": "oy7wl8",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oy7wl8",
    "num_comments": 53,
    "permalink": "/r/Superstonk/comments/oy7wl8/a_gamestopping_opportunity_38b_in_avg_daily_ftd/",
    "score": 1036,
    "selftext": "The average daily value of Failure-To-Delivers (FTD) each day this year is **$3,853,138,714 ($3.8 BILLION)**.  That's represents a **HUGE Opportunity** for GameStop!\n\nWhen GameStop issues their \"special dividend\", they're going to be able to eliminate all of the naked shorts during MOASS.  As awesome as this is for GameStop, it turns out there are **16,597** other companies that GameStop could help.\n\n**Lemme back up a bit... to the FTD data**\n\nThe SEC posts FTD data ([https://www.sec.gov/data/foiadocsfailsdatahtm](https://www.sec.gov/data/foiadocsfailsdatahtm)) twice a month.  Normally, we care only about the FTDs for *the* one and only idiosyncratic risk stock: $GME.\n\nBut then I started thinking, what about the whole set of FTDs?  How's that data look?  So, I wrote a  little script that would, for each day this year, sum up the FTD value for every single company that had a FTD in the SEC data.  In essence, I now have a total value of FTDs (# of FTDs x share price) across all companies (including GameStop) for Jan 4th, 5th, 6th, ... June 28th, 29th, & 30th.  With some Excel magic, uhh... Average(), I got the average daily value of FTDs this year.  A whopping $3.8 BILLION dollars!\n\nImagine if Amazon delivered orders, but then $3.8B worth of merchandise just simply wasn't delivered each day.  Yeah, sometimes the delivery company says \"don't worry, it'll come tomorrow!\"  Still!  That's one helluva lot of undelivered goods!  I WANT MY STUFF!  You probably do too!\n\n**Do you hear that?  That's the sound of** ***OPPORTUNITY!***\n\nWhen $3.8B worth of shares aren't showing up each day, that's an opportunity for an enterprising company to fix the problem!  Especially when one of those companies *\\*cough\\** GameStop *\\*cough\\** happens to have a lot of FTDs and naked shorts themselves!\n\nApes already know that GameStop is planning on issuing a \"unit dividend\" comprised of probably a preferred share coupled to a NFT crypto token.  The idea here is that when the shares are uniquely tied to a unique crypto token, the shares are unique and authenticated.  No amount of Xeroxing these into naked short shares will ever be possible.  Thus, MOASS.\n\nAs GameStop manages to solve their naked short problem themselves, it turns out the SEC FTD data is basically a future client list.  GameStop can literally take that FTD data from the SEC, calculate the amount of money the FTDs are hurting the other **16,597 Companies in that list,** sort descending on FTD value, and *Excel-magically* GameStop now has a list of potential customers who might also want to **shake their shorts**!\n\nYes, **16,598 companies** are in the SEC FTD list, including GME.  I counted (with the help of a script).  So yeah, the SEC publishes a customer list twice a month for GameStop!  😂\n\nCan you guess what the best way to ensure traded shares are never ever naked shorted?  You build your own clearing house.  Kinda like the DTCC, *except* honest.  Every share traded in this clearing house guaranteed.  Imagine how big of a business that could be.  *Actually*, *we don't have to imagine*.  [Wikipedia says DTCC's 2018 revenue was $1,784,368,000 and they settled $1.7 quadrillion (2011)](https://en.wikipedia.org/wiki/Depository_Trust_%26_Clearing_Corporation) in value worldwide.\n\n**Thank you SEC for providing GameStop a list of 16,597 potential clients with over $3.8B of FTDs each day.  IMO, GameStop has a** ***tremendous*** **opportunity worth HODL-ing for post-MOASS just in helping those companies shake their naked shorts. 🚀🌝**",
    "title": "A GameStopping Opportunity: $3.8B in Avg. Daily FTD Value",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oy7wl8/a_gamestopping_opportunity_38b_in_avg_daily_ftd/"
}