{
    "author": "boskle",
    "created_utc": 1626218780.0,
    "distinguished": null,
    "edited": false,
    "id": "ojrpjy",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ojrpjy",
    "num_comments": 609,
    "permalink": "/r/Superstonk/comments/ojrpjy/the_price_may_drop_until_the_next_major_catalyst/",
    "score": 6823,
    "selftext": "Here's what I think is happening. \n\nDTCC has everything set (via new rules) to vaporize Citadel et al. but they haven't. \n\nBecause they are waiting to see if apes crack first.\n\nThe price has been steadily dropping. As other apes have pointed out, when volume is low, Citadel has strong influence over the price of the stock. \n\nThey know about the hype for this week. They know what the TA indicators are saying. \n\nThey also know that if they can drop the price despite all this, some will paper hand. They hope it will be enough to trigger a sell-off.  They hope to survive another day. \n\nBut deep down, they also know it won't be enough.  The price could drop to $40 again and enough diamond handed apes will hold. \n\nEventually there will be a catalyst. Likely very soon. The next T+X cycle or an announcement from GameStop. The price will start to rise. FOMO crowd will jump in. DTCC will say enough is enough. Prepare for lift-off.\n\nIf you're tired of holding. I get you. \n\nIf you're pissed at the recent price action, I get you. \n\nIf tomorrow you are disappointed that the 14th might be a dud, I get you too. \n\nBut look. What apes are doing? This has never been done before. And will likely never happen again. The opponent is formidable, but not all powerful. They have a breaking point and it will be found. The only question is will you be there when it happens. \n\nRemember. Through all the fuckery so far apes never left. \n\nAnd for whatever fuckery happens ahead, apes aren't leaving.\n\nApes aren't leaving until fuckery is punished and apes get paid.\n\nApe price or no price.\n\n💎 🚀",
    "title": "The price may drop until the next major catalyst. Don't lose sight of the end game. Apes are close. IF YOU ARE FEELING DISAPPOINTED AT THE RECENT PRICE ACTION, READ THIS.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ojrpjy/the_price_may_drop_until_the_next_major_catalyst/"
}