{
    "author": "JessasaurusJames",
    "created_utc": 1623938118.0,
    "distinguished": null,
    "edited": 1623938387.0,
    "id": "o1xtry",
    "text_only": true,
    "flair_id": "7fabe5b2-8cbd-11eb-968a-0eaf84b82885",
    "flair_text": "Shitpost 👾",
    "name": "t3_o1xtry",
    "num_comments": 428,
    "permalink": "/r/Superstonk/comments/o1xtry/confirmation_bias_alert_dfv_tweeted_julia/",
    "score": 1681,
    "selftext": "DFV tweeted Julia Louis-Dreyfus twice yesterday. [Here's the second tweet that featured her](https://twitter.com/TheRoaringKitty/status/1405258938543742976?s=20).\n\nAnd the screenshot:\n\nhttp://imgur.com/a/EYSu4t3\n\n**It stood out to me that the gif DFV tweeted is watermarked Seinfeld/Hulu. So I searched to see what was up with Seinfeld and Hulu, and there's something big happening in stream land. Seinfeld is leaving Hulu for Netflix. When? June 23rd.** \n\n[Here's an article that talks about the June 23rd move](https://www.mediaplaynews.com/netflix-begins-exclusive-seinfeld-streaming-access-on-june-23/). From the article: \n\n>Netflix is getting one of the more popular (and lucrative) sitcoms, beginning **June 23 with exclusive streaming access to former NBC hit “Seinfeld.”** \n\nAnd is Seinfeld leaving Hulu? Fuck yeah. It's Netflix exclusive now and [here's another article that talks about the transition](https://decider.com/2021/06/15/is-seinfeld-leaving-hulu/); this article says, \n\n>**Seinfeld will be gone from Hulu on June 24.** Actually, it’ll leave on June 23 at 11:59 p.m., to be precise. \n\nAnd what else is Julia Louis-Dreyfus doing? [She's staring in a show called \"Tuesday.\"](https://deadline.com/2021/05/julia-louis-dreyfus-a24-tuesday-1234759834/) \n\nTuesday!?! My smooth brain looked at that info and found a calender to confirm that Tuesday of next week is the 22nd... so 22nd through 24th. I have no idea what this mean, but I'm buying more GameStop today. Just in case. \n\nI'd personally be quite pissed if we moon next week because I want to moon this week, but that [share offering RC did](https://twitter.com/TheRoaringKitty/status/1405340821520592896?s=20)... How close is it to being completed? And when can it be announced after it's completed? \n\n[Here's an ape detective discussion about that on a post by u/Goldjunge_Chriz that shows new GME float numbers populating this morning in Germany](https://www.reddit.com/r/Superstonk/comments/o1tt0b/5000000_shares_offering_almost_completed_the/?utm_medium=android_app&utm_source=share). \n\nThe share numbers this post implies only 300k shares to go in the offering. So when can RC make the announcement? \n\nu/hammurabi3244 asked: \n\n>Smooth brain question: When they are finished with the offering, can they break the news after hours on transaction date or do they need to wait until settlement date? \n\nu/melt_in_your_mouth replied: \n\n>**Tuesday I believe. T+2 would be t=today, +2=tomorrow and Monday. Tuesday AM at the earliest if it's done today.** Full disclaimer, I don't know what I'm talking about. \n\nu/melt_in_your_mouth commented this after u/Spirited_Squash_1535 reminded: \n\n>T+2 minimum is what was said when speculation of ATM arose last Thursday \n\nHmmmm.\n\nFull disclaimer, I don't know what I'm talking either and this is just technical tweet analysis shitposting, not financial advice. I just know that my tits are very jacked and, [despite wanting to moon on quad witching day this Friday](https://twitter.com/TheRoaringKitty/status/1403041813431263232?s=20), I will accept next week moon, Ken. \n\nThat's why I just bought more shares of my favorite stock this morning. Just in case. \n\nTo the moon, apes. This is not financial advice. I just want us all to have as many moon tickets as possible.\n\nP.S. I'm actually going to go deeper into these tweets this weekend. Why? There's another connection to [130/30 fund scammers](https://www.investopedia.com/terms/1/130-30_strategy.asp) in the data. Let's go. 🚀🚀🚀🚀🚀🚀🚀",
    "title": "CONFIRMATION BIAS alert: DFV tweeted Julia Louis-Dreyfus twice yesterday and MY TITS are so jacked. Here's why. 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/Superstonk/comments/o1xtry/confirmation_bias_alert_dfv_tweeted_julia/"
}