{
    "author": "j__walla",
    "created_utc": 1628544845.0,
    "distinguished": null,
    "edited": 1628547861.0,
    "id": "p1b2g1",
    "text_only": true,
    "flair_text": "Theory DD 🤔",
    "name": "t3_p1b2g1",
    "num_comments": 189,
    "permalink": "/r/GMEJungle/comments/p1b2g1/gme_should_run_up_this_week_dip_next_week_and/",
    "score": 541,
    "selftext": "Hi everybody! this is pure speculation, and I would like to have a discussion about this theory I have.  This is not financial advise.\n\nFrom a TA perspective shit is going to pop off, look at any indicator and you can see that.  I'm not going to go into TA.\n\nI've posted this before and I get shilled out and downvoted.  Market Makers like shitadel control the options games. They literally can control the price, and they use options to rip retail off. (here come the shills) Shills don't like when you say Market makers use options to rip retail off.\n\nAs the title says, I believe we will see a run up this week, a dip next week, and the following week 8/23-9/10 we can potentially see the MOASS.\n\nFor some reason reddit doesn't let me post unless I revert back to the old format so I can't upload screen shots.\n\nThe call options for this week are 325, next week it goes back up to 680, and from 8/27-9/10 you can't buy higher then 325 calls.  after that you can buy up to 680. Normally you can buy call options up to 800. Please don't buy option unless you are skilled in that game\n\nBased off of KNOWING they use options to get free money from retail, I speculate we see a run this week, dip next week, and potentially the MOASS after that.\n\nI'm going to say something else that will lead to shills getting upset and downvoting.  the fact that you can't buy call options higher then usual tell me that the price will be higher then normal. Sure, people will say stuff on how MM's make options, but my 7 months of investing experience has taught me that every week they have 800 calls ( I lost a shit ton of money getting those, cuz I got too jacked) and now that shit is about to hit the fan, strikes are so low.\n\nNow I could be wrong, Maybe Market Makers like shitadel set up the options fair and retail has a good shot of making money.\n\nI don't think that's the case.  I believe options are set up like this because A. they can make money still B. if they have strikes higher then 325 they can loose money (for those dates mentioned above)\n\nNow here is a thought that leads to shills commenting.  YOU CAN'T BUY ANY OPTIONS FOR DECEMBER. But you can buy 1k options in Jan.\n\nSo that tells me, market makers like shitadel don't even want to write contracts cuz A. they will lose money B. at risk for going bankrupt.\n\nThat fact that shills don't want apes to know this information is very telling.  I speculate, they are still betting against retail and they are hoping to not go bankrupt.  Here is the interesting thing, even though tomorrow is July 41st and a potential announcement is made.  IF the DTCC doesn't pay the dividend (all speculation) during the 8/27-9/10 gme can go to it's own block chain at which point the DTCC has 90 days to comply.... which is DECEMBER.\n\nSo I think they are planning a fake squeeze (tons of DD on this in the past) we have to remember, we're going against the rich that OWN the fed.  That's who we are going to take money from in the end.  Stay diligent, buy and hold is the way.  I'm open to discussion, but I just want to get this thought out.  The fact that every time I mention this theory, shills come out in full force.  That confirms my bias that this could mean something... or i'm just retarded and the U.S markets are a totally fair system.\n\nMy theory is based off of the Hedge funds, government, and banks all being apart of a crime syndicate.  So you have to think like an evil criminal to understand their game plan.  It's simple, they want money and have no morals.  They use their tools to rip retail off.  PFOF, trading ahead to get better buy/sell orders, naked shorting companies into bankruptcy, and options.  So reading into how they are using options, and the fact that it's not that high for certain dates, tell me that the price should be high on those dates. and the fact that you can't buy any in December tells me that they don't think they will make any money (probably cuz they will be bankrupt) but what do i know.\n\nEither way, this will be an eventful month! buckle up!!! And the MOASS could start 8/27 cuz apes can diamond hand this stonk to infinity and the \"power at be\" can't control it.\n\nTo be clear: I'm not saying to buy options. I'm wanting other apes opinions on this. Buy and hold is the way. Date's don't matter, but for those date's something is up. Also, everyday is the day!\n\nTLDR: Market makers are expecting something this week and the week of 8/23-9/10. buckle up!\n\n&#x200B;\n\nEdit: this post is getting heavily downvoted.  only confirms my bias\n\n&#x200B;\n\nEdit 2: u/CitronBetter2435 pointed at that Market makers could be having low strikes of 325 to avoid a gamma squeeze.\n\nIf I remember correctly, 350 was game over right? makes sense to me that they wouldn't have options that high if they weren't expecting a run up on those dates\n\n&#x200B;\n\nEdit 3: here is some TA ( I couldn't help my self) it lines up with the option theory\n\n&#x200B;\n\n&#x200B;\n\n[This is the one day chart for GME.  This is what I think could happen and we see a squeeze 8\\/27-9\\/10](https://preview.redd.it/ddg90nq2qeg71.png?width=1017&format=png&auto=webp&s=d1e4fa309aa9529468b0969db4d084e6cf4d9aab)\n\n&#x200B;\n\nI actually think the lego theory could hold true and this is what could happen\n\n&#x200B;\n\n[This is what I think could happen, based on the fact that you can't buy any options in december. Lego prophecy](https://preview.redd.it/dp6cxszhqeg71.png?width=757&format=png&auto=webp&s=67d647443fe6ee1f9b025fb6bbb51079e0534e45)\n\nlooking a spy, there is a huge correction coming.  Fed money printer go brrr, but they can't do that forever\n\n&#x200B;\n\n[this is the one week spy, markets like to crash in October right? line up with the chart](https://preview.redd.it/e2es59t9reg71.png?width=1026&format=png&auto=webp&s=57e2b865ce04ce192f17b073cd8328cf4ccfac11)\n\n&#x200B;",
    "title": "GME should run up this week, dip next week and MOASS the following week! buckle up apes",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p1b2g1/gme_should_run_up_this_week_dip_next_week_and/"
}