{
    "author": "DONT-TREAD",
    "created_utc": 1628538151.0,
    "distinguished": null,
    "edited": 1628549356.0,
    "id": "p18ur6",
    "text_only": true,
    "flair_text": "Theory DD 🤔",
    "name": "t3_p18ur6",
    "num_comments": 53,
    "permalink": "/r/GMEJungle/comments/p18ur6/the_shorts_have_about_3_weeks_to_cover_beforei/",
    "score": 503,
    "selftext": "As a full-time graduate student, full-time employee, and full-time ape:\n- I earn $XX,XXX in salary,\n- I finance my grad school with $XX,XXX in student loans, and\n- I owe $XX,XXX in student-loan debt.\n\nWhile my salary would be enough to cover the majority of my grad school tuition and living expenses, I still accept the maximum amount of federal student loans that I am eligible for.  Under normal circumstances, this allows me to fully fund my tuition and related living expenses with these loans, defer most of my debt payments, and direct my salary to paying off my outstanding, higher-interest debt one at a time.\n\nBut these aren’t normal circumstances; there is an opportunity at play here to 1) pay off all of my student loans, 2) never have to work again, and 3) have more money than I ever dreamed of.  All I have to do is **BUY** and **HOLD**.  That sounds like a bargain to me.\n\nWith federal student loans disbursing at the end of the month, essentially this leaves me—and, *probably*, other like-minded student apes—with the opportunity to live comfortably from the end of August through May, all the while dumping **up to** my entire $XX,XXX salary into $GME and GameStop merchandise.  **If the shorts can kick the can down the road, so can I.**\n\nWill this increased buying pressure ignite the MOASS?  Maybe.  Maybe not.  HOWEVER, I can say with the utmost certainty: **Hedgies are SO fucked.**\n \n \n***Disclaimer:*** *I am not educated, certified, or otherwise authorized to provide financial advice, and nothing in this—or any other posts or comments made by me—should be misconstrued as such.  The content in my postings and comments is strictly my own beliefs, my own opinions, and is not meant to influence the actions of others.  Everything posted or commented by me here—or elsewhere—should be interpreted as purely hypothetical, and is not an admission of any action taken by me or of my intent of action.*  ***I just like the stock.***\n \n \n**Edit 1 (4:25 PM):** “cover” in the title should actually read “close”.\n \n \n**Edit 2 (6:32 PM):** Some apes appear to be misunderstanding.  I certainly don’t intend to dump my ***entire*** salary into $GME. That’s why I said I will have the ***”opportunity”*** to dump ***“up to*** *my entire … salary.”*  Emphasis on “opportunity” and “up to.”\n\nI’m merely stating that student loan disbursements at the end of this month provide myself—and the **many** other apes that I assume came to this same conclusion—the **opportunity** to dump portions of their student loans or salaries (now that they have student loans to cover their living expenses) into $GME or GameStop merchandise.  And I believe that the aggregate will cause increased buying pressure.\n\nAgain, I’m not advocating for anyone to do anything; I’m making an observation and hypothesizing on its impact.",
    "title": "The shorts have about 3 weeks to cover before—I believe—they’re faced with a surge of buying pressure funded (directly or indirectly) by low-interest, federal student loans.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p18ur6/the_shorts_have_about_3_weeks_to_cover_beforei/"
}