{
    "author": "righttoplay",
    "created_utc": 1624584745.0,
    "distinguished": null,
    "edited": 1624589713.0,
    "id": "o7dnhf",
    "text_only": true,
    "flair_text": "Shitpost 👾",
    "name": "t3_o7dnhf",
    "num_comments": 189,
    "permalink": "/r/Superstonk/comments/o7dnhf/ryan_cohens_tweet_the_actual_meaning_from_south/",
    "score": 2505,
    "selftext": "u/prsmike has correctly pointed out that the above scene from the tweet is different.  [https://twitter.com/GMEdd/status/1407901613424054276?s=09](https://twitter.com/GMEdd/status/1407901613424054276?s=09)\n\nGood evening apes,\n\nGather round. Finally I can contribute to something here that I know about. Too smooth brained for FTD cycles but just wrinkled enough for South Park references. As a Canadian I understand Terrence and Phillip since we speak with the top halves of our heads.\n\n~~This is the full scene to Ryan Cohens tweet:~~  [https://www.youtube.com/watch?v=NF0J8dFy2gE](https://www.youtube.com/watch?v=NF0J8dFy2gE)\n\nJump to 0:40 if you can't spend 39 seconds of your lives watching quality content. Notice anything? Kenny farts on a match and DIES. KENNY DIES. Further, Kenny died in every episode until [Season 5](https://www.cbr.com/why-south-park-doesnt-kill-kenny/):  Kenny's death was a running gag in every episode.\n\nWhat other related South Park related tweet is there?  How about this one:\n\n&#x200B;\n\nhttps://preview.redd.it/2s5zbh79db771.jpg?width=400&format=pjpg&auto=webp&s=b128f327e55543b35bc82a1a9cbe5d0c094aa19b\n\nReference:  [pissing off south park kids with fart dolls - YouTube](https://www.youtube.com/watch?v=dVEAA8NWIGA)\n\nI FART ON YOUR GRAVE. That's a direct quote from the show and game. Hmmm.. What else? Cartman says DUMB ASS a lot. Ryans been hitting the South Park binge, a man of excellent taste.\n\nI don't believe the fart tweet was related to T+21 at all. Our very own RC has been hitting us with a lot of South Park references in his tweets and I intend to investigate this further.\n\nThe only thing left is for Ryan to tweet \"OMG THEY KILLED KENNY\" but that would be too blatant. My bias is confirmed and my tits are jacked.\n\n**RYAN IF YOU'RE WATCHING HIT US WITH A TWEET ABOUT SATAN AND SADDAM.**\n\nhttps://preview.redd.it/cci4coaneb771.jpg?width=307&format=pjpg&auto=webp&s=3b468385eeb5399c99528ac280a61eca26e38dd0\n\nWhat a glorious day for Canada...and therefore the world.\n\nEdit 1: How did I miss RUSSELLS SALT at 1:00. Tits even jackder\n\nEdit 2: u/SanchoUSA has pointed out the clip is exactly 4:20!!\n\nEdit 3: Tits literally at 3:20\n\nEdit 4: Buckle Up Buckeroo  [Buckle Up Buckaroo - YouTube](https://www.youtube.com/watch?v=GL-kcDm6uzs) \n\n&#x200B;",
    "title": "🔴 Ryan Cohen's tweet THE ACTUAL MEANING from South Park! TITS JACKED 🔴 🚀🚀🚀",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7dnhf/ryan_cohens_tweet_the_actual_meaning_from_south/"
}