{
    "author": "Quelcris_Falconer13",
    "created_utc": 1627360195.0,
    "distinguished": null,
    "edited": 1627376577.0,
    "id": "osfxgk",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_osfxgk",
    "num_comments": 382,
    "permalink": "/r/GMEJungle/comments/osfxgk/jp_morgan_chase_closes_mortgage_backed_securities/",
    "score": 2379,
    "selftext": "Forgive me as I’m on mobile and I already accidentally lost the whole post  draft once navigating away to look for something… this is gonna be fast and dirty (the best way, really) of doing some DD. \n\nI was cross checking some DD on my own regarding GME being placed on the “chill list” idk what that means but considering it’s like 90+ degrees outside and humid AF, it sounds like a nice list to be on. \n\n\nAnyways I’m sure most of us remember this from April [JP Morgan chase sells 13bn in bonds in largest bank deal ever](https://www.bloomberg.com/news/articles/2021-04-15/jpmorgan-to-sell-13-billion-of-bonds-in-largest-bank-sale-ever)\n\nNow if you KNOW your gonna have to help some little hedge funds with all their computers that earned PhDs or whatever un-fuck themselves from the royal fuckening they gave themselves; wouldn’t it be smart to have, say, 13 billion in cash on hand? \n\nSo if you’re big bank and you know you’re gonna have to help others cover cuz you’re a member of the DTCC, wouldn’t you be looking to pull out of the corporation that is making you responsible for a mess that (for fucking once) you’re not responsible for ASAP? I certainly would cuz fuck that shit! \n\nSo anyways I’m reading the important notices and as I’m scrolling I come across [this…](https://www.dtcc.com/-/media/Files/pdf/2021/7/22/MBS1006-21.pdf)\n\nJP Morgan Chase will\nNo longer trade mortgage backed securities thru the DTCC\n\nI’m sure you can tell by now my brain is smoother than a baby’s ass so can someone with more wrinkles please translate? Am I interpreting this right? What’s re the implications of a big bank leaving the DTCC? \nI should say it refers ONLY to mortgage back securities trading… with how fucked the housing market is right now (we all know it is, if not, go check out the real estate pages on Reddit, they’re fucking bleak!)  do y’all think this is actually another sign of the MOASS approach or is chase covering themselves from the potential housing market collapse?",
    "title": "JP MORGAN CHASE CLOSES MORTGAGE BACKED SECURITIES TRADING ACCOUNT WITH DTCC.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/osfxgk/jp_morgan_chase_closes_mortgage_backed_securities/"
}