{
    "author": "BrokeAsFuck-WSB-APE",
    "created_utc": 1618348759.0,
    "distinguished": null,
    "edited": 1618414664.0,
    "id": "mqbu5a",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_mqbu5a",
    "num_comments": 431,
    "permalink": "/r/GME/comments/mqbu5a/gme_possible_overstock_20_overstock_issued/",
    "score": 3794,
    "selftext": "Nothing written here is financial advice. I mean read my username. \n\n\nEdit just found this, how do you categorize that as a mistake? This don’t make any sense to me.... sounds like something is odd\n\nhttps://www.coindesk.com/us-judge-u-turns-on-ruling-in-overstock-digital-dividend-lawsuit\n\nNow I’m even more confused, so they are gunna fight in court again it seems.\n\nMy Counter to the above: game stop has the rewards program and game coin, they historically have always used exchange of value of games in trades like an exchange. So I would think they should be more than fine, it’s always been in their business model and GameStop previously paid a dividend so it’s not new grounds for them to enter into. However with overstock it was something completely brand new to them, so I could see it as kind of an issue. But companies are meant to grow and evolve, if you don’t you get replaced. They can’t stay a certain way just cause the guy shorting the stock says “oh but your company only does this” business is always chAnging, you either pivot and survive or you stay the same like a fool and die. My opinion.\n————————————-\n\nCould GME be the second coming of dividend issue resulting in short squeeze\n\nWhat do you all think?\n\nMaybe Ryan will give us a crypto dividend like overstock did For their shareholders \n\nLink provided by Rem in comments below\nThanks Rem u/reminiscetoy\n\nhttps://www.coindesk.com/overstock-short-sellers-fall-short-as-judge-gives-digital-dividend-claims-short-shrift\n\n\n\n\nLink provided by Walk, apes Walk presents to you all u/walkingdadjokes Thanks Walk\n\nGAME-COIN\n\n1 coin = 1 dollar\n\nhttps://www.gamestop.com/collection/game-coin\n\n\n\nLink provided by Dia thank you Dia\n\nu/diamondseeker2020\n\nCoin on crypto pro (you can search it on there as GME)\n\n(Link Deleted) Yekim has mentioned this coin is actually a fake ‘shitcoin’ that took the GME name in 2013. It isn’t the official one. Thank you\n u/teamyekim \nYou are more then welcome to search it to see for yourself, however keep in mind it appears to be a fake. Writing this here so we keep it transparent and correct. Should you feel the need to question no biggie just post below.\n\n\nApes this is who I found out about Overstock from Furn u/furnitureman80085\n\nLook at Furns post\nAlmost 5 months ago thank you Furn\n\nhttps://www.reddit.com/r/wallstreetbets/comments/jgfa1m/ostk_and_gme_a_quick_story_about_my_first/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf\n\nalso Tesla incorporated as well crypto today and their stock jumped \nLink provided by u/daronjay thanks Daron\n\nhttps://www.thestreet.com/crypto/bitcoin/tesla-stock-token-binance\n\n—————\nCounter Argument asked poster if I could post they said yes so long it’s anonymous \n\n“just an opinion\n\nThey can make a token\nThey can give you that token\nBut holding that token isnt mainstream\nSpending, saving it isn’t ubiquitous \nIf it’s a cash equivalent it can add complexity\nSo you go from everyone with cash being a potential investor, you go to folks that understand this and are willing to do this — possibly risking a stigma \nSo a stock that could go to 10, looms at 5\nthe banks just said fuck it — cash equivalent is fine\nThey don’t need to go around the whole system —\n\nMoreover — given the press; it may not even be necessary — because it’s much easier for a short seller to do just target another stock if they’re not playing by the rules\n\nAt their size and scope — let someone else be the pioneer, that’s big enough to facilitate change. It’s really really hard to drive this kind of user adoption, those resources are better used elsewhere “\n———————-\n\nThought it would be fair to post another view point. Which has its points as well.\n\nAnyways in conclusion\nI then just connected the dots like an ape following bananas \n\n\nPlease place your opinion below it’s very important, so we can get a general idea of everyone’s view points\n\nThank you to everyone who helped with the info \nI kept updating as different info tied to it came up",
    "title": "GME POSSIBLE OVERSTOCK 2.0, overstock issued dividend and the stock sky rocketed due to short squeeze.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mqbu5a/gme_possible_overstock_20_overstock_issued/"
}