{
    "author": "SunnyGrassBeachRelax",
    "created_utc": 1628157139.0,
    "distinguished": null,
    "edited": 1628199814.0,
    "id": "oyeal2",
    "text_only": true,
    "flair_text": "Theory DD 🤔",
    "name": "t3_oyeal2",
    "num_comments": 219,
    "permalink": "/r/GMEJungle/comments/oyeal2/what_the_ethereum_update_in_23_hours_could/",
    "score": 1207,
    "selftext": "Take this with a grain of salt as I'm no expert, just a developer making sense of this all and collating my thoughts.\n\n**What is minting?**\n\nIn case anybody is unaware minting is defined as the computer process of validating information, creating a new block and recording that information into the block-chain. e.g. Imagine stamping something to say it's authentic\n\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n**London ETH update and what it means for me as an APE ooga booga?**\n\n\nThe new Ethereum update **could** mean that GameStop will **potentially** issue a NFT/GMEcoin as a DIVIDEND for every single GME share you own. \n\nThen if the NFT's/GMEcoins you received as a dividend for each share you own were able to be minted on this platform (this can be done automatically I believe). You then have a massive blockchain of all the authentic shares of GME for all to see. \n\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Great, but what does this mean for YOU/the MOASS?**\n\nAs the GME data feed is added to the LINK oracle network. The current update will allow the ethereum network to read data from the stock market which in turn lets GameStop have a valid reason/ability to see data like  who owns the stock, and at what date, time, price, whether it was synthetic etc. because to issue out these NFTs/GMEcoins as a dividend to the correct shareholders this will be needed. Could this also force shorts to close? I'm not too sure tbh. Probably?\n\n\n**^ Let me know if this is correct, if I made any mistakes etc, I'm also okay with the mods marking this as shitpost if I'm wrong**\n**TL;DR Hedgies R fuk**\n\n\nUpdate from twitter gamestop lead nft designer:\nhttps://twitter.com/nftspike/status/1423266286109294596\n\n**Context: EIP-1559 – improves the transaction fee market**",
    "title": "What the Ethereum update in 2-3 hours could potentially mean for GameStop, the MOASS and me?",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oyeal2/what_the_ethereum_update_in_23_hours_could/"
}