{
    "author": "cagreene",
    "created_utc": 1627828559.0,
    "distinguished": null,
    "edited": 1627870471.0,
    "id": "ovt861",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ovt861",
    "num_comments": 399,
    "permalink": "/r/Superstonk/comments/ovt861/consider_telling_those_who_know_you_are_in_gme/",
    "score": 2487,
    "selftext": "Edit: for those saying FUD 😂 I don’t plan on selling for any less than GMEfloor.com. I just want a plan to buffer the attention until I can emerge from my cave of tendies since I’m a young ape in my twenties.\n\nEdit 2: yo dis be my most popular post I think; hi mum, I wanna thank god, me mum, and DFV. but srsly thanks for the awards. I actually read every single comment and commented where I wanted. Y’all some funny mofos.\n\nknow for one that I may or may not have told personal acquaintances along this 8 month journey that I was in GME; dad, step-mom, brother, a few friends, etc.\n\nAs time has gone on, and the seriousness of the MOASS has become more and more real, I’ve become less and less confident in the imaginary, idealistic reality, that my family members/friends would not view me different, grow to resent me, expect things, maybe even do some shady shit. Certainly, NOTHING will be the same.\n\nSo, I encourage everyone who is in the same boat as me - where close associates are aware of your poison in GME and intention to sell at $55M+ — to lie when the MOASS happens. \n\nWhen they blow up your phone during MOASS telling you to sell and “make back your investment” at $10,000 a share like a 📄 🙌🏼 just tell them you did.\n\nIt’ll be better that your close associations think you made $100k then for them to know you have $100M+.\n\nIt’s okay to lie. \nIt’s okay to think of yourself.\nPower to the Players.\n\n💎 🙌🏼",
    "title": "Consider telling those who know you are in GME that you sold at $10k",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovt861/consider_telling_those_who_know_you_are_in_gme/"
}