{
    "author": "youngsteveo",
    "created_utc": 1614745723.0,
    "distinguished": null,
    "edited": 1614765109.0,
    "id": "lwl5tq",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_lwl5tq",
    "num_comments": 105,
    "permalink": "/r/GME/comments/lwl5tq/circle_the_wagons_because_the_hedgie_shills_are/",
    "score": 502,
    "selftext": "Everyone knows that /r/wallstreetbets has some serious bot/shill/FUD issues–hell, it makes sense: they're being crushed by the weight of their own subscriber count, and there's truckloads of money on the line.\n\nBut I've spent the last hour browsing this sub, and I think the rats are here and they are evolving.\n\n(Shout out to the mods, I'm not calling y'all out. These fuckers are just sneaky and I'm either justifiably paranoid, or I'm shedding light on the stink. I'm fine with either reality, because I'm tryna turn 💎👐 into 🍌.)\n\nThere are several breeds of bullshitters, and I think we all easily recognize the first three:\n\nA) FirstName5609 I have  -100 comment karma: \"GME is dead. The shorts have left. You are going to lose a LOT of money.\"\n\nSuuuure.\n\nB) ILikeLegosAndStocks, account age 1month: \"I dunNo guise, sEeMs lik it's oVeR. Should I sell for a LoSS??\"\n\nYes you should; fuk outta here.\n\nC) GME2thaFuckinMo0n: \"That was fun guys. We fucking did it. I made LOTS of money. Let's all go buy $RKT and keep sticking it to the man!\"\n\nHmmm.\n\nHere's the thing: we've been calling these dipshits out left and right, and although they are dumb, they are not infinitely dumb. They are learning that we're not so easily swayed.\n\nTonight I have seen a lot of accounts with very little karma simply making nice posts and comments about GME. Never any substance, just \"yeah! I bought 2 more shares.' or something like that. Six apes upvote, maybe comment \"this is the way.\" You check the comment history on these accounts and they used to post about Yu-Gi-Oh or dankmemes a year ago, went dormant with no posts for a long time, and then their first post after all that time is \"Am ape. Eat crayon. Buy GME.\"\n\nThey are farming karma so that they build reputation and relevance. It will be much harder to sniff them out in the coming weeks, as they accumulate cred with fluff.  It's happening right in front of us. When they inevitably flip and start casting FUD, the 💎👐 among us may not be easily swayed, but the cubic zirconia hands will click through to the profile, see a \"legit\" user, and think twice about what they just read.\n\nI don't really have a solution for this, I just hope y'all are keeping you're head on a swivel.\n\nWhen in doubt, zoom out. Remember the thesis. The price is irrelevant.\n\n🚀🌕\n\nPosition: 350@$27\n\nEdit 1: Focusing on account age alone is missing the point. Watch for substance. Does the history seem organic, or does it seem flat and only farming for karma?\n\nEdit 2: So many \"Hey, I fit the profile but I'm no shill!\" comments. No, most of you aren't; you're just insecure. You also don't *really* fit the profile. There's no simple formula like X days on reddit + % comments on sub = bs detected. It's easier than that, really, to sniff out the bs. It may come down to experience, but it has everything to do with substance, and organic content. You'll know it when you see it, just look past raw karma values.",
    "title": "Circle the wagons, because the hedgie shills are here in this sub, and they're getting smarter.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lwl5tq/circle_the_wagons_because_the_hedgie_shills_are/"
}