{
    "author": "Big-Bedroom8783",
    "created_utc": 1628272131.0,
    "distinguished": null,
    "edited": 1628352661.0,
    "id": "ozbr2t",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ozbr2t",
    "num_comments": 391,
    "permalink": "/r/GMEJungle/comments/ozbr2t/god_tier_gamestop_direct_stock_purchase_plan_drs/",
    "score": 920,
    "selftext": "Edit and Preface: This post was written deliberately is such a way to draw attention to the topic of Direct Registration and it’s benefits. Yes, it comes off to be aggressive and sarcastically insulting, but I did this deliberately in hopes to get the public to start a real discussion on a logical approach to the situation. I never made it through college as I’m a alternative learner in nature but my approach apparently is a thing called LOGOS (thank you internet) see below,\n\nLOGOS is a rhetorical or persuasive appeal to the audience's logic and rationality. Examples of logos can be found in argumentative writing and persuasive arguments, in addition to literature and poetry (blah blah blah big words and stuff)\n\nAlso: I want to thank everyone for the kind awards and all comments no matter if we agree or disagree. Let’s just try to keep this discussion going. Sometimes it’s best to look for the easiest solution to solving a problem first. This is where my Keep It Simple Stupid approach to using DRS as a solution to get the shorts to start covering comes in to play here. Thanks in advance for reading my post.\n\n\nHELLO MY FELLOW RETARDS** AND ***FUCK OFF TO YOU FLOATING FUDDERS AND SHILLS!!!***\n\nHERE'S A SIMPLE, EASY TO READ POST WITH THE INFORMATION COMING DIRECTLY FROM COMPUTERSHARE ABOUT ***GAMESTOP'S DIRECT STOCK PURCHASE PLAN***.\n\nIN MY OWN OPINION, ANYONE WHO ISN'T BUYING STOCK DIRECTLY FROM ***GAMESTOP'S DIRECT STOCK PURCHASE PLAN*** TRULY IS A FUCKING MORON AND I WILL PRAY FOR YOU BECAUSE YOUR IQ ISN'T GOING ANY HIGHER ANYTIME SOON.\n\n**HERE'S SOME EASY Q&A SO BUCKLE THE FUCK UP.**\n\n**Q:** CAN INTERNATIONAL APES PARTICIPATE?\n\n&#x200B;\n\n[HEY LOOK 👀 INTERNATIONAL APES CAN BUY GAMESTOP STONKS DIRECTLY!!!](https://preview.redd.it/81brtv61irf71.jpg?width=2906&format=pjpg&auto=webp&s=ddb0a3e34dec22b004a44a102c7cef7091d968a3)\n\n**A:** YES!!! HERE ARE THE COUNTRIES LISTED ON COMUTERSHARES WEBSITE\n\n1. AUSTRALIA\n2. CANADA\n3. CHANNEL ISLANDS\n4. HONK KONG\n5. GERMANY\n6. DENMARK\n7. SPAIN\n8. IRELAND\n9. ITALY\n10. NETHERLANDS\n11. NEW ZEALAND\n12. SOUTH AFRICA\n13. UNITED KINGDOM\n14. UNITED STATES\n15. SWEDEN\n16. SWITZERLAND\n17. CHINA ( I DON'T KNOW WHAT AREA BECAUSE I DIDN'T TRANSLATE THE WRITING)\n18. SOMEWHERE ELSE IN CHINA (I ALSO DON'T KNOW WHAT AREA BECAUSE I DIDN'T FEEL LIKE TRANSLATING IT SO LOOK IT UP IF IT'S YOU)\n\n**Q:** I'M A POOR, SO CAN I BUY FRACTIONAL SHARES OF DIRECT REGISTERED STOCK?\n\n&#x200B;\n\n[HEY LOOK 👀 ALL OF US POORS CAN SETUP RECURRING FRACTIONAL PURCHASES OF GME DIRECT STOCK FOR AS LOW AS $10 !!!](https://preview.redd.it/odn9mjfpirf71.jpg?width=2631&format=pjpg&auto=webp&s=d2d2a60ad0515e122726545ba77dbacbfa2dbea1)\n\n**A:** ***YES!!! MINIMUM INVESTMENTS START AS LOW AS $10 FUCKING DOLLARS!!!*** REMEMBER, IF YOU TRANSFER SOME OR ALL OF YOUR SHARES BROM YOUR BROKER THEN YOU ARE AN EXISTING SHAREHOLDER. MINIMUM SHARES TO ENROLL IS ONLY **ONE (1)** FUCKING SHARE!!! ***FOR NEW SHAREHOLDERS THE FIRST TIME MINIMUM INVESTMENT IS ONLY $25!!*** **FUCK ME, COME ON GUYS!!!** WHERE RICK OF SPADES AT? 🍌🍌🍌💋\n\n**Q:** I'M USED TO NOT PAYING FEES SO DOES THIS COST ME MONEY? LIKE FEES AND SHIT?\n\n**A:** FIRST OF ALL YOU FUCKING IDIOTS, *NOTHING IS REALLY FREE*, SO GET THAT OUT OF YOUR SMALL ASS, PEANUT SIZE BRAINS 🥜🧠!!! LOOK BELOW AT THE CHEAP ASS FEES TO HAVE **DRS (DIRECT REGISTERED STONKS)**\n\n&#x200B;\n\n[HEY LOOK 👀 SOME TRANSPARENT FEES. NOT PFOF DUMB SHIT!!!](https://preview.redd.it/jzb5yxeikrf71.jpg?width=2881&format=pjpg&auto=webp&s=0bf4d7e74b581d997184b8f602cc6b7e36a1b5e0)\n\n**Q:** EVERYONE SAYS YOU'LL MISS OUT ON **MOASS** BECAUSE THE STONK IS HARD TO SELL AT COMPUTERSHARE AND CAN TAKE FOREVER ***BLAH BLAH BLAH*** IS THAT TRUE?\n\n**A:** ***NO, YOU STUPID FUCKS!!!*** THIS IS A MOTHER OF ALL **FUD** TACTICS BULLSHIT NARRATIVE GOING AROUND!! **MOASS** IS GOING TO TAKE A WHILE, PLUS THE SHORTS WILL NEED TO COVER WITH ***REAL SHARES***. YES, THAT'S RIGHT!! THE SHARES THAT **YOU** WILL HAVE IN **YOUR** COMPUTERSHARE ACCOUNT!!! THEY'LL BE CALLING YOU *(NOT SURE IF THAT'S TRUE, BUT IT'S POSSIBLE)*. THESE SHARES ARE **NOT WITH THE DTC** AND ARE ***REALZ AS FUCK!!!*** THE FLOAT SEEMS TO BE REDUCED IF THE SHARES AREN'T HELD WITH THE DTC **RIGHT?** ***DUNNO, IT FEELS LIKE MATH...***\n\n&#x200B;\n\n[HEY LOOK 👀 I CAN SELL MY DRS SHARES IN THE COMPUTERSHARE INVESTOR CENTER WITH LIMIT SELLS DURING MARKET HOURS LIKE ANY OTHER FUCKING BROKER!!](https://preview.redd.it/2x1kkozplrf71.jpg?width=2146&format=pjpg&auto=webp&s=2036d8c3fad9cab4b57855b712c4d541252af8f6)\n\n**Q:** I'M SMOOTH, WUT IS SO GREAT ABOUT DRS STONKS?\n\n**A:** A FEW THINGS THAT MAKE SHARES OF DIRECT STOCK SUPERIOR TO THE *SYNTHETIC LOANERS* FLOATING AROUND IN YOUR ACCOUNTS ARE..\n\n1. THESE ARE **REAL** SHARES THAT CAN BE VERIFIED\n2. THE SHARES ARE IN YOUR NAME (BOOK ENTRY) AND NOT IN YOUR BROKER'S NAME (STREET ENTRY). ***DUNNO BOUT' YOU, BUT I LIKE SHIT I OWN IN MY NAME AND NOT SOME GUY THAT SAYS \"DON'T WORRY ABOUT IT, I GOT YOU WEN TIME COME\"***\n3. **DRS** SHARES (IN THEORY) REDUCE THE FLOAT SINCE THEY ARE REMOVED FROM THE DTC, PUT IN YOUR NAME, AND HELD BY COMPUTERSHARE\n4. ***VOTING! VOTING!! VOTING!!! FUCKERS!!!!***\n\n&#x200B;\n\n[HEY LOOK👀MY SHARES GIVE ME \\(PARTICIPANT\\) THE SOLE RIGHT TO VOTE \\(IT'S IMPORTANT TO TAKE NOTE OF THE WORDS \\\\\"SOLE RIGHT\\\\\"\\). IN MY NAME!! NOT THE BULLSHIT THE BROKER NON VOTES DO!!! ](https://preview.redd.it/d6w88p05orf71.jpg?width=2792&format=pjpg&auto=webp&s=a85488e8052d063d58880bf200ebdc1a66fbf308)\n\nALSO, AND I DON'T KNOW WUT THE FUCK THEY ARE GOING TO DO ONCE ALL OF THE REAL SHARES ARE ACCOUNTED FOR AT COMPUTERSHARE. THEY WON'T SELL OR HOLD MORE DRS SHARES THAT EXIST. ***WUT DO WITH THE LESS REAL SHARES AT BROKERS THEN?*** IT'S POSSIBLE THAT WE MIGHT GET STUCK WITH SOME INSURANCE COVERAGE OR SOME SHITTY ASS LOOPHOLE HIDDEN SOMEWHERE BECAUSE I HIGHLY DOUBT THAT THE DTCC IS GOING TO JUST SHELL OUT ALL THEY'VE GOT AND ALLOW THE ENTIRE WORLWIDE FINANCIAL MARKETS TO IMPLODE. THEY HAVE NO SOUL AND ARE TOO GREEDY.\n\n***DISCLAIMER:*** NOTHING IN THIS POST IS FINANCIAL ADVICE AND SHOULDN'T BE CONSTRUED AS SO. I'M MOSTLY HIGH AND HAVE A VERIFIABLE IQ OF 40 THE MAJORITY OF THE TIME. I ALSO TAKE LOT'S OF CALCULATED RISKY DECISIONS SO I'VE WON SOME AND LOST SOME. THIS IS JUST A LITTLE BIT OF FUCKING EDUCATION ABOUT SOME FACTS AND THE REST IS MY OWN, INDIVIDUAL, PERSONAL OPINION. ***EVERYONE SHOULD DECIDE ON THEIR OWN WHAT IS RIGHT FOR THEM.*** I'M NOT SAYING PULL ALL OF YOUR SHIT OUT OF YOUR BROKERS EITHER. I'M PERSONALLY HEAVILY DIVERSIFIED WITH MANY DIFFERENT BROKERS BUT ***MY HEAVIEST POSITION IS HELD WITH DRS SHARES AT COMPUTERSHARE (BECAUSE I'M EITHER FUCKING RIGHT OR MOSTLY NOT WRONG).*** I ALSO PLAN ON KEEPING SOME OF MY SHARES ALL THROUGHOUT THE MOASS FOR SENTIMENTAL REASONS. KINDA LIKE A 1ST ADDITION OF AIR JORDAN'S OR WHATEVER PEOPLE COLLECT.\n\n**THANK YOU IN ADVANCE FOR YOUR TIME AND BROKEN ATTENTION SPANS!!!**\n\n***POWER TO THE FUCKING PLAYERS!!!***\n\n💎🙌🧱🧱🚀🍌🍌\n\nEDIT: LINKS\n\nLINK TO MAKE A PURCHASE\n\n[https://www-us.computershare.com/Investor/#DirectStock/Index](https://www-us.computershare.com/Investor/#DirectStock/Index)\n\nLINK WITH DROP DOWN MENU FOR DIFFERENT COUNTRIES SITE LINKS\n\n[https://www.computershare.com/us#](https://www.computershare.com/us#)",
    "title": "GOD TIER GAMESTOP DIRECT STOCK PURCHASE PLAN (DRS) INFORMATION AND EDUCATION!!!",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ozbr2t/god_tier_gamestop_direct_stock_purchase_plan_drs/"
}