{
    "author": "Matador3364",
    "created_utc": 1627493879.0,
    "distinguished": null,
    "edited": 1627529645.0,
    "id": "oteukr",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_oteukr",
    "num_comments": 96,
    "permalink": "/r/DDintoGME/comments/oteukr/short_version_of_my_recent_deep_dives_removed/",
    "score": 549,
    "selftext": "I posted a short and concise version of my recent deep dives on r/Stocks this morning. It was removed after it began getting some traction. I am also now permanently banned from that subreddit. Other posts and comments of mine have been removed, deleted, or just completely wiped from this site with no warning or notification at all.\n\nI have been asked by multiple people to repost this so they can check my profile history to read it.\n\nAt this point, I'm fucking over this shit and am going to contact a lawyer. I am also going to see if I can speak to someone in law enforcement about these issues. \n\nSilencing this information is not okay.\n\nThis is what I posted:\n\nI feel like I have the moral obligation to share this with as many people as possible. If you do not trust me I implore you to do the research yourself.\n\n\nI have spent the past days scouring over public information on business acquisitions, art sales, news articles, and stock trends. I have shown a clear pattern of manipulative and insider trading tactics that are being used on all sectors of free trading markets, including the stock market, the art market, and collectable items market. These tactics specifically point to Kenneth Griffin of Citadel and Steven Cohen of Point72 as two of the main perpetrators. I used reputable sources to back up my claims. I promise I am not a conspiracy theorist, nor strive to validate the legitimacy of any conspiracy theories, nor push any political agenda. This is just what the numbers and facts point to.\n\n\nMy full report, which is insanely long with my own exposition, can be found in my profile split over 3 posts. I recommend starting with part 3. I know GameStop gets a bad rep, but it was the perfect company to prove this on. It is not limited to just video games though, collectable shoes, hand purses, NFTs, and almost any auctionable item is being price spiked by hedge fund managers to create a frenzy of buying and selling items for higher than their actual market value. These hedge fund managers profit off of the sales by personally owning multiple companies that facilitate these types of trades.\n\n\nShort version related to GME = Hedge funds short GameStop stock while simultaneously pumping the prices of collector video games and trading cards. This rises the price of used games and trading cards in general. Hedge fund managers personally purchased Collectors Universe, along with Weta Games, to sell used video games and trading cards at arbitrary appraised prices. The plan was for GameStop to fail so that they can have easier entry into this market. \n\n\nShort version related to Art/NFTs = A clear pattern of market manipulation is present in the art market by the same hedge fund managers. Pre-agreed upon record breaking prices are bought and sold at auctions, for the purpose of raising the overall price of art. This increased price benefits the auction houses, which have established business relationships with the hedge fund managers. It also makes it a more lucrative market for money laundering.\n\n\nI will not give out financial advice, but I think it is imperative that you take a hard look at the legitimacy and state of our trading markets today. I want you to be safe out there. I want our markets to be free.\n\nEdit: link to removed post. https://www.reddit.com/r/stocks/comments/ot9bnq/research_and_auditing_proves_market_manipulation/?utm_medium=android_app&utm_source=share\n\nEdit: Part 1 https://www.reddit.com/r/DDintoGME/comments/opc8le/a_dd_on_how_shfs_are_manipulating_the_art_market/?utm_medium=android_app&utm_source=share\n\nEdit: Part 2. I removed this on my own consideration.\nfile:///r/DDintoGME/comments/opev9e/a_dd_on_how_shfs_are_manipulating_the_art_market\n\nEdit: Part 3\nhttps://www.reddit.com/r/DDintoGME/comments/oqpiha/a_dd_on_how_shf_are_manipulating_the_art_world_a/?utm_medium=android_app&utm_source=share\n\nEdit: Part 4\nhttps://www.reddit.com/r/DDintoGME/comments/oslvp5/a_dd_on_how_shf_are_manipulating_the_art_and/?utm_medium=android_app&utm_source=share",
    "title": "Short version of my recent deep dives (removed from r/stocks)",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/DDintoGME/comments/oteukr/short_version_of_my_recent_deep_dives_removed/"
}