{
    "author": "WillyTheKid007",
    "created_utc": 1627542121.0,
    "distinguished": null,
    "edited": 1627542556.0,
    "id": "otsfwo",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_otsfwo",
    "num_comments": 76,
    "permalink": "/r/GME/comments/otsfwo/war_we_are_right/",
    "score": 684,
    "selftext": "[https://www.reddit.com/r/GMEJungle/comments/otghan/nearly\\_1t\\_rrp\\_suspension\\_of\\_state\\_local\\_treasury/](https://www.reddit.com/r/GMEJungle/comments/otghan/nearly_1t_rrp_suspension_of_state_local_treasury/)\n\nCredit to Mellotramp\n\nNearly $1T RRP\n\nSuspension of state & local treasury bonds\n\nBeginning of a potential credit crunch\n\nTumbling Asian markets\n\nConference today with Powell about the economy, stuttering very badly, messing his words up, stating they are having trouble reaching their goals\n\nPowell admitting that inflation on the rise and trying to calm us (read: lying) that it will be temporary, then results coming out that it is here to stay way longer than they thought\n\nCrypto forming final shoulder of a Wyckoff distribution and ridiculous pumping and dumping\n\nFederal forbearance ending for 2 million borrowers July 31\n\nMassive amounts of new rules and regulations being slammed into place\n\nIncreasingly desperate-sounding new Regs coming out every. Single. Day.  Quick revisions to said rule the day after, DTCC, NSCC, etc…\n\nEB Games in Canada is being re-branded GameStop\n\nMore brokers every week beginning to move GME to a bullish buy\n\nFidelity Prediction Engine has GME at a 33% chance of reaching value of $16,000 very soon.  No other stock has this crazy potential\n\nGME moving to the S&P MidCap 400 on Aug 4\n\nZoom out to beginning of Jan 2021. Volume HUGE then going down like crazy, meaning supply has never been this low, but demand has always been high with people always buying. Economics 101, Supply and Demand. In an alternate universe where the market works correctly with active enforcement, GME should be shooting for the stars and shareholders rejoicing. Instead the stock gets slammed down even more. Too suspicious to be legit.\n\nAug 4 GME moves onto S&P MidCap 400, large buy pressure from that, constant buy pressure from GME shareholders, volume will be the lowest on record, meaning massive demand with little supply, meaning the value of the stock if based on fundamentals of economics MUST GO UP. But if the stock goes downward *yet again, it will be 100% pure illegal action right in front of the new SEC enforcement agent.* *And he’s already got a Wyatt Earp rep…*\n\n*They are destroying the world for the worst and hoarding wealth.*\n\n*We will take their wealth.  We will learn to manage our wealth, not hoard it but spend it.  We will fix the world and leave it a much better place for our children and all the others that share this planet.*\n\nAnd we will be ever vigilant and do our best to guard against this every happening again.\n\n*WAR.* *We.* *Are.* *Right.*\n\n***HODL***",
    "title": "WAR: We. Are. Right.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/otsfwo/war_we_are_right/"
}