{
    "author": "Gussamuel",
    "created_utc": 1621026190.0,
    "distinguished": null,
    "edited": 1621051259.0,
    "id": "nciy36",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_nciy36",
    "num_comments": 51,
    "permalink": "/r/Superstonk/comments/nciy36/reminder_to_be_a_greedy_as_fuk_during_the_moass/",
    "score": 994,
    "selftext": "READ THE WHOLE FUCKING THING.\n\nI don’t care if you only want $1k because you’re already a millionaire at that price. (After the peak) If your floor isn’t AT LEAST 10 million, you need to get some shit straight.\n\nIt doesn’t matter if you are only holding for the X apes, it doesn’t matter if you’re only holding until the last second to just become a millionaire. IT DOESN’T MATTER!\n\nInstead of only taking what you feel that you deserve, take MORE than what you deserve and DONATE IT. Being greedy doesn’t always have to be about YOU! It can be about being greedy for your family, your friends, the people who love you. Give back to your teachers who inspired you, the community that raised you, the hospitals that nursed you. GIVE BACK. Be GREEDY AS FUCK SO YOU CAN GIVE BACK. \n\nAlso, if there are any apes who want to talk with others who are like minded, my DMs are open. I understand that it’s difficult feeling like you’re the only one who knows what’s going on. We will need each other more than ever during the MOASS. Find a trusted ape buddy to talk to and set your heart straight!\n\nI love you all. 🤤🥴🦍💎🚀\n\nEdit: had a few DMs come in and you guys are awesome. Keep em coming! I’ve got nothing to do but enjoy life :)",
    "title": "🚨Reminder to be a GREEDY AS FUK during the MOASS🚨",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nciy36/reminder_to_be_a_greedy_as_fuk_during_the_moass/"
}