{
    "author": "6moonbeam9",
    "created_utc": 1627154844.0,
    "distinguished": null,
    "edited": false,
    "id": "oqwhpg",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oqwhpg",
    "num_comments": 56,
    "permalink": "/r/Superstonk/comments/oqwhpg/to_anyone_who_feels_like_the_sec_is_sitting/",
    "score": 553,
    "selftext": "I happened upon this book at a used store, and the first page I turned to was detailing Gabe Plotkin being investigated for insider trading. Ofcourse I bought it and read it over the next few days, mostly on the toilet.\n\nIt is a fantastic ride with so many details about Stevie C, inner workings of hedge funds, manipulation, fraud, SEC and FINRA actually doing something (of course the tips were investigated years later, but there were only a handful compared to the people demanding change now) and I believe every HODLer should have this information in their brain. \n\nMarket fraud cases on this level TAKE TIME, and the government bodies investigating and prosecuting do not speak publicly until they are certain they can actually prosecute who they want, or at least get a few fish if they’re desperate. \n\nLook at your local bookstore first, but thriftbooks.com is also a great place to look. Please don’t buy from Amazon.\n\nI’m so proud of what HODLers have been able to accomplish so far in such a short period, and I know the people in here can and will change the world. For a few it will be easy to get a check and forget all about working towards a better earth for the non elites, but I won’t rest until I see change in the world. And I will spend a good deal of money making sure people can eat and have a place to sleep and feed their families, while the bezos’ of the world can go fuck off to space and stay there. \n\nBut seriously, read this book. It will change the way you look at this whole saga.",
    "title": "To anyone who feels like the SEC is sitting around on PHub, I urge you to read ‘BLACK EDGE’ by Sheelah Kolhatkar.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqwhpg/to_anyone_who_feels_like_the_sec_is_sitting/"
}