{
    "author": "Lolly_Jaw",
    "created_utc": 1619343102.0,
    "distinguished": null,
    "edited": 1619433994.0,
    "id": "my4u0t",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_my4u0t",
    "num_comments": 338,
    "permalink": "/r/Superstonk/comments/my4u0t/morning_news_and_obligatory_memes_from_mediape/",
    "score": 3370,
    "selftext": "**What an Apexcellent Sunday!**\n\n**Nurse Mimi the medi-ape is here for your daily run down!**\n\n[That's right. Nurse Mimi will take your wife away from your wife's boyfriend. And take Citadel\\/Shorts\\/Bears out, all at the same time. How do she do it? She buys shares and lives in tendieland.](https://preview.redd.it/us7pxnme3av61.png?width=611&format=png&auto=webp&s=bc78fb5b8bcda5701f57bfd1b2ec3399441d4a25)\n\n&#x200B;\n\n[\\*beep beepity beep\\*](https://preview.redd.it/1e7ayxh24av61.png?width=634&format=png&auto=webp&s=066ae3ca71f71dc0473924df1966f83a39e52c8d)\n\nu/redchessqueen **Announced:**\n\n*Welcome new mods!*\n\n* [*u/pinkcatsonacid*](https://www.reddit.com/u/pinkcatsonacid/) *(standard permissions) - already added, our new anchorwoman, and all around awesome addition that has full support from the rest of the team*\n* [*u/leaglese*](https://www.reddit.com/u/leaglese/) *(limited permissions) - generally a brilliant mind with legal know-how who will be helping with questions and DD across the subreddit*\n* [*u/catto\\_del\\_fatto*](https://www.reddit.com/u/catto_del_fatto/) *(limited permissions) - general moderation*\n* [*u/Cuttingwater\\_*](https://www.reddit.com/u/Cuttingwater_/) *(limited permissions) - DD review and moderation*\n* [*u/jsmar18*](https://www.reddit.com/u/jsmar18/) *(limited permissions) - DD review and moderation*\n\n***Update to Posting/commenting:***\n\n*Starting tomorrow, we will be updating the automod's karma and age filter to the following:*\n\n* ***Posts - 60 days old, 500 karma*** *(prev: 30d/200k)*\n* ***Comments - 30 days old, 250 karma*** *(prev: 7d/100k)*\n\n*Please note that award karma does NOT count toward this limit. You will need to make comments and posts on other subreddits to get your karma up.*\n\n[(1) CODE RED - Subreddit Weekend Update : Superstonk](https://www.reddit.com/r/Superstonk/comments/mx887u/code_red_subreddit_weekend_update/)\n\n**Warm welcome to all the new mods!**\n\n\\---------------------------------------\n\n\\---------------------------------------\n\n**Contents:**\n\n**Section 1- GME TA/Float Calcs**\n\n**Section 2 - HF's/Banks**\n\n**Section 3 - Motivation**\n\n\\-----------------------------------------\n\n\\-----------------------------------------\n\n**Section 1- GME TA/Float Calcs**\n\n\\-----------------------------------------\n\n[**u/Mvxlacy**](https://www.reddit.com/user/Mvxlacy/) **Posts:**\n\n[TA of GME](https://preview.redd.it/l1jb956s4av61.png?width=1862&format=png&auto=webp&s=c4c46d37689fc639fadee5ee1c8497b1ce9cc3d5)\n\n\\- Currently we are breaking out of a descending triangle to the upside and the price target for that is 348$\n\n\\- I then noticed if we hit the price target of 348$ we are creating a W pattern which has a higher high base. The realistic price target of the W pattern would be 476$ but a 560$ could happen as well!\n\n\\- Currently volume overall in MA deviation rate, MACD and the volume bars is very low and stable which indicates a rise in Volume and Volatility soon. This can link to the fact that we are breaking out of a descending triangle.\n\n\\- Soon enough with George Sherman stepping down as Chief Executive we can hope the next candidate can sustain GME as a company better than Sherman did.\n\n\\- Last but not least, I have to mention the breakout to the downside price target which is 40$ however I think it is highly unlikely for that scenario to play out.\n\n[(1) $GME Technical Analysis (Repost from WSB) : GME (reddit.com)](https://www.reddit.com/r/GME/comments/mx7zj8/gme_technical_analysis_repost_from_wsb/)\n\n\\---------------------------------------\n\n[**u/Maleficent\\_Original7**](https://www.reddit.com/user/Maleficent_Original7/) **Posts:**\n\n*\"Now taking a closer look at the pendants themselves.*\n\n*When drawing a pendant I exclude the overextensions of the stock and focus on confirmed trends. In Figure 2 the resistant line is very clear leaving me with high confidence in it's position.*\n\n*The dashed support is at a minimum, a very heavy support line that hasn't been broken after February unless GME was oversold.*\n\n*The solid yellow support is difficult to define with only two solid contacts and the stocks tendency to hug the resistance. However the two points it does contact have a strong correlation.*\n\n[GME TA](https://preview.redd.it/s9idf80a5av61.png?width=547&format=png&auto=webp&s=fb1a849100a7655acb0909fd12b3e36612aed552)\n\n*Assuming the validity of the triangle, how high should we expect the stock to jump when the break the pattern?*\n\n*Using a starting price of $4.20 and a peak of $420 we can expect the price to reach upwards of $800. Typically the rally is a little less than the increase of the runup. If you are a believer in Fibonacci, I would tell you that $680 is more likely.*\n\n*The ONLY way to confirm the pattern is to see an increase in both price and volume. Due to the longer than average length of the pendant, without a significant push the pendant's prevalence will fade and should be looked at as a consolidation moving forward. We are nearing the end of the pendant and that is exciting, however I think it is far more likely the resistance line will continue to persist without a catalyst. \"*\n\n**ELIA: we might break out of big triangle and go up. But triangle is very big so we need more volume.**\n\n[(1) Pendant Technical Analysis : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mwp2gy/pendant_technical_analysis/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/gherkinit**](https://www.reddit.com/user/gherkinit/) **Posts:**\n\n*\"We are definitely in or moving into a zone of low volatility that favors a Bullish move. This allows long whales to set up potential gamma squeezes. It allows opens an opportunity for retail to leverage their positions. This looks promising ideally it would be a little bit lower, but it looks to be low enough for a move.*\n\n[ These plays require a lower implied volatility \\(IV\\) in order to be possible, as it drastically lowers the price of options. ](https://preview.redd.it/6ktluff8cav61.png?width=1101&format=png&auto=webp&s=bd507a1ef4aebd7a6978fb9769879734e9e04293)\n\n*This is a manipulated stock, in that sense technical indicators are only as good as the extent of the perceived manipulation. So if we account that our breakouts to the upside tend to have heavy short pressure (although I do believe that short pressure to be much weaker than it was in February or March, more on this later) applied we can look at this formation like this. \"*\n\n[ Breakout manipulated short pressure applied Bull Run \\(Moon? possibly\\)](https://preview.redd.it/myv97n3hcav61.png?width=1303&format=png&auto=webp&s=e4edc78969efd68b18527f0a64762200c3235958)\n\n**Green pickle tasty. Like green crayon but saltier.**\n\n[(1) What's Coming, Some DD for the week of 4/26/21-4/30/21, Crayons, Charts, and Future Predictions : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mx8nit/whats_coming_some_dd_for_the_week_of_4262143021/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/Cuttingwater\\_**](https://www.reddit.com/user/Cuttingwater_/) **Posts:**\n\n*\" With extremely low volumes 💎✋ this week and 2 of the last 3 days ending within $0.01 of the previous day's close, this seem like the stock price is purposely being kept in stasis, until the time is right for it to 🚀.*\n\n\\---------- Fancy Data Table:\n\n*Below you will find a summary table of all the volume and price data since the start of 2021.*\n\n*I have updated the GME float size to 26.7 million based on the work done by several apes. Here is one example* [*https://www.reddit.com/r/Superstonk/comments/mwgyfw/free\\_float\\_is\\_267\\_million\\_didnt\\_count\\_cohen\\_twice/*](https://www.reddit.com/r/Superstonk/comments/mwgyfw/free_float_is_267_million_didnt_count_cohen_twice/)\n\n[Liquidity is drying up. As you can see, the last 4 days have been extremely low volume days.](https://preview.redd.it/aq2qjmt37av61.png?width=1168&format=png&auto=webp&s=59bc9d696b79c02f714a3e9de827c0ce5a7f2e66)\n\n***Today was the second lowest volume day in 2021*** *with only 100k more than wednesday which was the lowest at 3.8 million.*\n\n*Despite such low low volume, you can see that there has been almost no shares available to short through IBKR.* ***In fact, today they shorted ALL 500,000 available shares, which equates to 13% of all volume!\"***\n\n[(1) Of the 5 lowest volume trading days in 2021, 4 of those happened this week! 💎✋ Two of those days (Today and Wednesday) the price closed within 1 CENT of the previous day's closing. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mx7zo4/of_the_5_lowest_volume_trading_days_in_2021_4_of/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/TheCaptainCog**](https://www.reddit.com/user/TheCaptainCog/) **Posts:**\n\n*\"According to this calculation and after removing anyone with more than 500 shares, at minimum, Superstonk users alone own 9 million shares upwards of 37 million. If we extrapolate this again to all of retail (which is hard to know), we get a minimum of 282 million shares owned. I assumed 6 million was the number of retail at minimum for two reasons. Firstly, it fits within the number of people at WSB. Second, it fits with the data of US-based retail investment found in a yahoo poll:* [*https://ca.finance.yahoo.com/news/gamestop-amc-reddit-investing-213609595.html*](https://ca.finance.yahoo.com/news/gamestop-amc-reddit-investing-213609595.html)*.*\n\n*If the number of people who responded to owning more than 500 shares IS accurate, then superstonk alone owns 38 - 74 million shares, and retail (assuming they buy just like superstonk) owns 1-2 billion shares.\"*\n\n[(1) Users of Superstonk own, at MINIMUM, 9 million shares, with retail owning a possible 270 million : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mwziwn/users_of_superstonk_own_at_minimum_9_million/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/j901719**](https://www.reddit.com/user/j901719/) **Posts:**\n\n[The float might be even less, according to some DD.](https://preview.redd.it/rdomnxse6av61.png?width=750&format=png&auto=webp&s=2cec830259f298efdfa0023fe39c7ac408e25a4e)\n\n[(1) So how did GME manage to trade 150M shares a day if the remaining float is only 26M? ⬆️🌚 : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxkoti/so_how_did_gme_manage_to_trade_150m_shares_a_day/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/Bradduck\\_Flyntmoore**](https://www.reddit.com/user/Bradduck_Flyntmoore/) **Posts:**\n\n*\" I like to play with numbers for funzies, just to give myself a variety of options to consider. It helps me think. Today, I'll take a crack at the multitude of possibilities of worldwide retail ownership of GME. I'll be using round numbers, cuz easy, and I will be assuming the available float is 25mil shares. Grab your favorite color crayon and join me, won't you? \"*\n\n**For apes who need some help visualising the maths involving calculating the possible float, please see more in the link below!:**\n\n[(1) Napkin Math: Worldwide Retail Ownership Edition - Take Two : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxc2uy/napkin_math_worldwide_retail_ownership_edition/?utm_medium=android_app&utm_source=share)\n\n[(3) Shit Soup 💎🙌🦍🦍🦍🚀🚀🚀 : GME (reddit.com)](https://www.reddit.com/r/GME/comments/mxzs4c/shit_soup/)\n\n\\---------------------------------------\n\n[**u/haydoboyo**](https://www.reddit.com/user/haydoboyo/) **posts:**\n\n\"*We originally were speculating based on Darkpool share trading data that \\~440million shares have been synthetically created and are being used to trade within darkpools.* [*Estimates around these numbers have appeared in quite a few older DDs.*](https://www.reddit.com/r/GME/comments/m7x2gq/dd_i_did_the_math_there_is_literally_no_doubt/)\n\n*We used this information (based on the original count of \\~50million shares available for public trading) to estimate that SI was over 900%.*\n\n*THEN YESTERDAY:* [*According to Gamestop's 14A, there is only 26.7 Million shares available for trading to the public, not including ETFs or institutions under 5% ownership.*](https://preview.redd.it/1pqbq8iuzsu61.jpg?width=354&auto=webp&s=0b76796d2033adadffdcaa149f25287e66f6e3ab)\n\n*Meaning that based on the pre-existing information of a 440 million share synthetic float, and the NEW information that the public float is supposed to be 26.7 million shares, the short interest is roughly double our original estimates, at \\~1800%*\n\n*And that was based on darkpool data gathered a MONTH ago!*\n\n*APES HAVE BEEN BUYING THE ENTIRE TIME, AND HEDGIES HAVE NOT STOPPED MANUFACTURING SHARES.*\n\n*THIS NUMBER IS ABSOLUTELY HIGHER NOW.\"*\n\n[You know how I feel.](https://media.tenor.com/images/c883d2b9b94e0af0ce8e03a57a5f2c0f/tenor.gif)\n\n[(1) Double the short interest, half the anxiety. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxkwlb/double_the_short_interest_half_the_anxiety/)\n\n&#x200B;\n\n[ u\\/Spazrow314 ](https://preview.redd.it/d36c0nkfmav61.png?width=640&format=png&auto=webp&s=c62c1e52aa4f160ee6a5193cc1e70d1b3d2fee2a)\n\n\\---------------------------------------\n\n[**u/AlternativeNo2917**](https://www.reddit.com/user/AlternativeNo2917/)  **posts:**\n\n*\"Now lets focus on the FINRA data as that gives us the short/long ratio. FINRA reports* ***1,293,673,781*** *shares traded since the beginning of the year and* ***610,188,947*** *of those trades are short positions, that's a staggering* ***47.17%*** *of all trades coming through FINRA. Why is FINRA different to NYSE data? Simply they don't report on all exchanges it's likely just trades via the NASDAQ, whereas the NYSE is reporting all trades.*\n\n*Using the FINRA data again, since the start of the year (4th Jan)* ***16,800,958*** *is the average volume and* ***7,924,532*** *is the average short volume. Now there is no way to accurately tell what the total short volume is with the NYSE data but for speculation let's use the 47.17% that we have from FINRA. I must emphasis that this is speculation it could be more or it could be less.*\n\n*47.17% of 2,904,446.487 = 1,370,027,407.92 short shares*\n\n*That leaves us with a potential 1,534,419,079.08 long shares since the start of the year.*\n\n*So once again I just want to remind everyone that the float is 16,164,355 because 1,534,419,079.08 is 9492.6% of that. So IF every ape from 4th Jan bought and hodl until today then retail would own 9,492.6% of the actual tradable float. That hasn't happened we know that BUT using this information in my opinion speculating that retail owns more than 1,000% of the float is very conservative.*\n\n*Let's say half of the 1.5B orders have been made by diamond apes, 767,209,539.54 shares.. that would be 4,746.3% of the float that is actually accessible to retail. Once again I am not saying that Apes own 767.2m shares all I'm saying is I think 1,000% ownership of the float is a very conservative estimate when you look at this data.\"*\n\n[(1) GME Float is less than 16.1m and retail owns more than 1000% easily. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxu7lj/gme_float_is_less_than_161m_and_retail_owns_more/?utm_medium=android_app&utm_source=share)\n\n[ u\\/MattiasMolndal ](https://preview.redd.it/ngqntn6vaav61.png?width=500&format=png&auto=webp&s=195aaa9440bf9f927b40c3effc83a186d9a6b5f7)\n\n[(1) GameStop Stock (reddit.com)](https://www.reddit.com/r/GME/?f=flair_name%3A%22Memes%20%F0%9F%98%B9%22)\n\n\\---------------------------------------\n\n[**u/jakksquat7**](https://www.reddit.com/user/jakksquat7/) **Posts:**\n\n**There are FALSE PROXY VOTING sites being pushed here. Go to gamestop.com to find the correct one.**\n\n[(1) \\*URGENT\\* Pay attention! There are FALSE PROXY VOTING sites being pushed here. Go to gamestop.com to find the correct one. : GME (reddit.com)](https://www.reddit.com/r/GME/comments/mx0rb6/urgent_pay_attention_there_are_false_proxy_voting/)\n\n\\---------------------------------------\n\n[**u/stellarEVH**](https://www.reddit.com/user/stellarEVH/) **Posts:**\n\n*\" Why does this matter for GME and its inevitable MOASS?*\n\n1. *We all know wall street is shorted to oblivion, and their evading the MOASS by slowly covering their margin calls over time by buying time through shady shit like (1) deep ITM stock options, (2) dark-pool trading, (3) SPAC and Crypto P\\&amp;D schemes, and (4) god knows what else.*\n2. *What perpetuates the corruption is their capacity to buy more time. To trip the MOASS, we must disable the proverbial snooze button on their margin calls. Voting as a common shareholder may be the way.*\n3. *When retail investors purchase whole GME share(s) from their stockbroker, depending on which broker, it is unclear whether they purchased a real share from some other investor selling theirs, or if they purchased a synthetic/fake share that was created from corrupt actions by hedge funds (e.g. deep ITM stock options)*\n4. *Does it matter which stock we have?* [*No*](https://imgur.com/z01I0jJ)*. A whole share, real or synthentic, entitles you to a vote.*\n5. *Why this matter is that* [***stock options***](https://www.investopedia.com/articles/active-trading/061615/how-stock-options-are-taxed-reported.asp) ***DO NOT*** *convey ownership of a company,* ***but exercising them to acquire the stock does.***\n6. *Given GME share(s) are likely synthetic because GME has been shorted to oblivion,* [*voting*](https://www.proxydocs.com/branding/962080/edocs/2021/issuer/) *for GME’s annual meeting will force your stockbroker to obtain real GME shares from those who have it on margin to submit your vote on your behalf because they need to own the share at the time of submission.*\n7. *In other words, your vote will margin call the hedge funds that were too reckless in trading shares they didn’t own. Cumulatively, our votes may be enough to be the catalyst for the MOASS.\"*\n\n[(1) GameStonk - \"Power to the Investors\". Go vote and margin call Ken. Here's a series of logic steps to understand why you should exercise your right as a common shareholder and vote. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mx6m2r/gamestonk_power_to_the_investors_go_vote_and/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n**Section 2 - HF's/Banks**\n\n\\---------------------------------------\n\n[**u/bitterbottles**](https://www.reddit.com/user/bitterbottles/) **Posts:**\n\n*\"My SPECULATORY hypothesis of a WORST CASE SCENARIO: It's possible that shitadel and friends would use this 5 day gap to fake the squeeze. Imagine this: Hedgie A gets margin called -> assets liquidated 5 days later and gme jumps XXX% -> other hedgies get margin called and price is currently in the 1000s -> shitadel n friends short the living shit with everything they've got in hopes of dropping the price to sub 100 -> five days later, GME drops enough to be within the threshold for shitadel n friends to not have their assets liquidated -> repeat until only diamond handed apes are left -> price goes to the tens of thousands but ceiling is limited.*\n\n*HOWEVER, if we BUY & HODL the price would never drop below the margin call threshold. Which will shoot the price to Andromeda.*\n\n*OUR JOB IS SIMPLE! BUY AND HODL!!\"*\n\n[(1) The SQUEEZE may take WEEKS. Hedge Funds have 2 - 5 days to meet their MARGIN CALL. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxgzvw/the_squeeze_may_take_weeks_hedge_funds_have_2_5/?utm_medium=android_app&utm_source=share)\n\n[ u\\/rrezonfrangu ](https://preview.redd.it/g3xm0f4ebav61.png?width=640&format=png&auto=webp&s=3e8f9c989c73516077ceafe3872f11710c983a47)\n\n\\---------------------------------------\n\n[**u/stocktawk**](https://www.reddit.com/user/stocktawk/) **Posts:**\n\n*\"*[*Multiple Hedge Funds Blew Up This Week*](https://www.reddit.com/r/Superstonk/comments/mwzv9f/timeline_of_what_we_know_so_far_multiple/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n*If you need to catch up to speed. Here the link above is a compilation of everything crowdsourced on this situation all week.*\n\n*Credit Suisse legit says this, in this article:*\n\n*Credit Suisse, which said it has exited about 97% of its exposure to Archegos -*\n\n*yet it's that 3% that remains problematic as the nominal value of its exposure to Archegos keeps rising and late last night hit $20BN according to the news sources -*\n\n*said it expects a 600 million-franc ($654 million) loss in the second quarter, taking the total hit from the collapse to about $5.5 billion.*\n\n*Moving forward. We keep getting this story in pieces and credit Suisse losses have gone up by about $800mil. Per week, In the press. And they still have $20bil in just 3 different Archegos assets that are LOSING MONEY DAILY... how much is the interest in that contract?! Did some Archegos yolo options go bust and credit Suisse is holding the bag?*\n\n*Recently JPM sold a MASSIVE position in Academy Sports and Outdoors - Look who else is on the books with them:*\n\n*\\&amp;amp;amp;amp;#x200B;*\n\n[*JPM's Liquidation of $9bil Worth of ASO*](https://preview.redd.it/hjmciw0vj8v61.jpg?width=1125&format=pjpg&auto=webp&s=8810a1d20fce23c1eda3f2fd13a5e781ecfe8a62)\n\n*all the big banks were up all weekend. Were creating record numbers of bonds to sell back to themselves? Which they all then flipped to credit Suisse in the form of this newfound loan credit Suisse just got, “from investors,” of $2bil, “in the form of convertible notes?”*\n\n*\\&amp;amp;amp;amp;#x200B;*\n\n*number 24 in ownership is: Philadelphia Trust Co/The .. so the pensions in Philly??*\n\n*number six is Tiger Global.. you remember them right? if not, see the link to my other post, to catch yourself up to speed with the absolute shit show that is going down behind the scenes.*\n\n*this is the shit show of all shit shows guys.*\n\n*Tiger Global of course is a tiger/tiger cub and was this a part of this ASO in anyway? Since they all follow each other in trades, i bet they're all over these ownership reports. smooth brain. but...*\n\n*about the 3 positions credit suisse is still in that are a $20bil loss...... WHAT ARE THOSE THREE TICKERS CREDIT SUISUIS????\"*\n\n[(2) Credit Suisse Surprises With $2 Billion Capital Raise, Still Has Exposure To Archegos In \"Three Distinct Positions\" ... : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxz0eb/credit_suisse_surprises_with_2_billion_capital/)\n\n&#x200B;\n\n[ u\\/pinkcatsonacid ](https://preview.redd.it/3jhons01eav61.png?width=640&format=png&auto=webp&s=248ddac96040fa689426ce82970333494d6d9d68)\n\n\\---------------------------------------\n\n**DEUTSCHE BANK WHISTLEBLOWER STILL MISSING!**\n\n[Missing 45-Year-Old Male NR21113ti - Los Angeles Police Department (lapdonline.org)](https://www.lapdonline.org/home/news_view/67485)\n\n*Los Angeles:* *The family of Valentin Broeksmit and the Los Angeles Police Department are requesting the public's assistance in locating him.*\n\n*Valentin was last seen on April 6, 2021 around 4 p.m., at Griffith Park on Riverside Drive in the City of Los Angeles. He was last seen driving a 2020 red Mini Cooper. The vehicle has been recovered but he has not been seen since and his family is concerned.*\n\n*Valentin is described as a 45-year-old male White with Brown hair and Blue eyes. He stands six feet one inch tall and weighs around 200 pounds.*\n\n*If you have seen, or have any information regarding his whereabouts please contact the Los Angeles Police Department, Missing Persons Unit, at (213) 996-1800. During non-business hours or on weekends, calls should be directed to 1-877-LAPD-24-7 (877-527-3247). Anyone wishing to remain anonymous should call Crime Stoppers at 800-222-TIPS (800-222-8477). Tipsters may also contact Crime Stoppers by texting to phone number 274637 (C-R-I-M-E-S on most keypads) with a cell phone. All text messages should begin with the letters \"LAPD.\" Tipsters may also go to LAPDOnline.org, click on \"webtips\" and follow the prompts.*\n\n\\---------------------------------------\n\n**Section 3 - Motivation**\n\n\\---------------------------------------\n\n[**u/Mj0lnir1**](https://www.reddit.com/user/Mj0lnir1/) **Shared:**\n\n[Elon Musk's Tweet](https://preview.redd.it/7v0z1dhceav61.png?width=960&format=png&auto=webp&s=9008480e1b5e158b51ba5fdafb93c1c8765bdeea)\n\n[HODL!! 🚀🚀🚀 : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxgvbi/hodl/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/bandrews091**](https://www.reddit.com/user/bandrews091/) **Writes:**\n\n*For real. Get off the drugs cut back the drinking build/fix meaningful relationships before you cant trust people to like you for anything but your money. If you needed a sign THIS IS IT! Happiness is key and it is true when they say \"mo money, mo problems.\" So start planning NOW ways that you can stay healthy and happy and live a long meaningful life to enjoy your tendies to the fullest.*\n\n[(2) You're about to be rich, clean up your life. : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxjxz3/youre_about_to_be_rich_clean_up_your_life/?utm_medium=android_app&utm_source=share)\n\n\\---------------------------------------\n\n[**u/Jamie-Vu**](https://www.reddit.com/user/Jamie-Vu/) **Shares:**\n\n[I love this. Apes strong together.](https://preview.redd.it/5e12pyileav61.png?width=960&format=png&auto=webp&s=f582054b9546350e990d8a6a17d88a095997ae61)\n\n\\---------------------------------------\n\n[**u/youngsteveo**](https://www.reddit.com/user/youngsteveo/) **Posts:**\n\n[So true.](https://preview.redd.it/3gekjylreav61.png?width=960&format=png&auto=webp&s=74cf8e0e89c64edc610eed2634a4097a20b2f5b2)\n\n\\---------------------------------------\n\n\\-----------------------------------------\n\n**Thank you for reading.**\n\n**I hope you all have a lovely day, although I cant reply to every comment I do read them and upvote, thank you for your continuous support, kind messages and encouragement!**\n\n**Now I have to encourage you!**\n\n**Please apes look after yourselves. Eat healthy. Lots of green like green crayons. Exercise! it's great for your cardiovascular system.**\n\n**Don't do this to look a certain way, you are perfect the way you are. Do it because you love yourself and you want to take the best care of yourself. You want to live a long time and tell your grand-apes about how you fought in the war of '21.**\n\n**Also, kitty is doing good - he made it!**\n\n\\-----------------------------------------\n\n**If you need a prescription for memes, please follow the link below:**\n\n[MEME Compilation - 22/04/21 - Nurse Mimi's Prescriptive Memes (Daily Dose). : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/mw5j43/meme_compilation_220421_nurse_mimis_prescriptive/gvg5ghd/?context=3)\n\n**If you want to read yesterdays news, please follow the link below:**\n\n[MORNING NEWS (And obligatory memes) from Medi-ape Mimi. 👨‍🚀 24/04/21 : Superstonk ](https://www.reddit.com/r/Superstonk/comments/mxidiw/morning_news_and_obligatory_memes_from_mediape/)[(reddit.com)](https://www.reddit.com/r/Superstonk/comments/mxidiw/morning_news_and_obligatory_memes_from_mediape/)\n\n**If you want to read tomorrows news, please follow the link below:**\n\n[MORNING NEWS (And obligatory memes) from Medi-ape Mimi. 👨‍🚀 26/04/21 : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/myuu35/morning_news_and_obligatory_memes_from_mediape/) \n\n**Lots of love,**\n\n**Nurse Mimi**\n\n🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀",
    "title": "MORNING NEWS (And obligatory memes) from Medi-ape Mimi. 👨‍🚀 25/04/21",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/my4u0t/morning_news_and_obligatory_memes_from_mediape/"
}