{
    "author": "Worried-Yogurt-4204",
    "created_utc": 1616885550.0,
    "distinguished": null,
    "edited": false,
    "id": "meoqgw",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_meoqgw",
    "num_comments": 341,
    "permalink": "/r/GME/comments/meoqgw/citadel_headed_toward_hiring_freeze_deep_dive/",
    "score": 5953,
    "selftext": "Hey everyone! I love the saying \"actions speak louder than words\", and today I am going to show you how Citadel's changes in employment prove that they are a shit company and know they are FUCKED.\n\nFirst things first, this is not financial advice. \n\nNow, every company worth a damned is very strategic regarding the size of their staff. HR Directors will have a strategic plan and optimal employee count planned out for months based on the CEO/Board's estimated future needs. It takes time and resources to hire and train new employees so  changes in current employment and hires/terminations can tell us what management thinks of the future. \n\nLinkedin has a cool feature called \"Insights\". This tab provides monthly data on employee count and new hires. Through looking at this data I came to a couple conclusions:   \n\n1) They are a shit company that treats employees as completely expendable. \n\n2) Management does NOT have a positive outlook for the future of Citadel.\n\n&#x200B;\n\nOkay for number 1. A feature of this insights tab is a calculation for median tenure, which tells us how high turnover is AKA how much working there sucks. \"That sounds boring\" you might say, or \"why do I give a fuck?\". Well I'll tell why you fuck givers. If we can see this data for Citadel, we can also see it for Citadel's competitors... I looked at the median tenure of 7 of Citadel's direct competitors with active linkedin pages. Want to guess who had the highest turnover? That's right. Shitadel.\n\nhttps://preview.redd.it/je6rl0hc4np61.png?width=398&format=png&auto=webp&s=7dc32a89f72ce88ddf7325f689a5bbfcc547d1c7\n\nEmployees quit or are terminated almost a FULL YEAR earlier than at any of these competitors. Now we all have heard that working in Finance can be grueling and these numbers show this. Average turnover of these 8 is 4.5 years. But Citadel's is 1.6 YEARS below that! I mean no one else even compares to them. This is textbook example of a company that gives no fucks about their employees, works them to death, and then spits people out when they are \"no longer providing value\". Fuck them.\n\n&#x200B;\n\nNow that we know how shitty these assholes are, lets move on to number 2... lol. Below are the last 24 months of Citadel's Employee Count, New Hires, Terminations and Net Change. \n\nThe first thing I would like to point out is that there are only 3 months in which workforce decreased: March 2021, August 2020 and August 2019. Now these two August reductions appear to be cyclical and based on a large number of new hires in June. I am going to speculate that these are probably summer interns, or new hires that didn't make the cut. \n\nNow lets focus in on the only month left with a negative change. March 2021 change does not mirror changes in March 2020. Additionally, the changes in employment for all 2021 months break away from a consistent trend of workforce increases. **For these reasons I believe that Citadel Management has rewritten their Workforce Strategic Plan to prepare for a negative future outlook.**   \n\nhttps://preview.redd.it/51oboikc6np61.png?width=533&format=png&auto=webp&s=5fd54a4e2f89da1a7b0b6f54015d74a5159d7d29\n\nBelow are charts showing 1) the number of new hires over time, and 2) Total Employee Count by month. Note in number 2: 6 month growth is dramatically lower than 1 year and 2 year growth.\n\n1)\n\nhttps://preview.redd.it/7dfwvwaahnp61.png?width=823&format=png&auto=webp&s=fbcba1285ab721fe6726bca2b336b937ee5dc332\n\n2)\n\nhttps://preview.redd.it/x6oq4x2qgnp61.png?width=800&format=png&auto=webp&s=e35f9cd74d387861b9f7a2592ee57265e6a861c5\n\nAdditionally, I looked at every single Citadel job listing on Indeed and every single one had been posted more than 30 days ago. THEY ARE NOT HIRING! \n\n[https://www.indeed.com/cmp/Citadel/jobs](https://www.indeed.com/cmp/Citadel/jobs)\n\nIf they had truly covered their short position and everything was \"business ass usual\" then we would expect to see continued workforce increases and regular new job postings. \n\nTLDR: Shitadel does not care about its employees and Management has changed their workforce strategy because they know shit looks bad.\n\n All of this data is personal speculation and opinion. It is not meant to be used as any financial advice.",
    "title": "Citadel Headed toward Hiring Freeze - Deep Dive into Linkedin Data",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/meoqgw/citadel_headed_toward_hiring_freeze_deep_dive/"
}