{
    "author": "king_tchilla",
    "created_utc": 1622487130.0,
    "distinguished": null,
    "edited": false,
    "id": "npahjk",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_npahjk",
    "num_comments": 80,
    "permalink": "/r/Superstonk/comments/npahjk/micheal_burry_letter_to_gamestop_2019/",
    "score": 944,
    "selftext": "How we got here...\n\nAugust 16, 2019\n\nDear Members of the Board,\n\nScion Asset Management, LLC and its affiliates (“Scion”) own approximately 2,750,000 shares, or about 3.05%, of GameStop, Inc. (“GameStop”) common stock.\n\nAs mentioned in our previous letter to the board, we have concerns regarding capital management at GameStop. Given recent GameStop common stock prices under $4 per share, we must re-state that GameStop complete the remaining $237,600,000 share repurchase at once and with urgency.\n\nGiven the market capitalization of GameStop at $290 million at the close on August 15th, completing the authorization would retire over 80% of GameStop’s outstanding shares. Depending on the timing and quality of execution, such a repurchase would increase earnings per share dramatically - far more than any other possible action on a per share basis.\n\nThe numbers are striking and demand action. We estimate that GameStop now has in excess of $480 million of cash, more than enough to complete the share repurchase authorization and still invest in the business and pay down debt.\n\nThrough August 15th, a total of 11 trading days, 50,399,534 shares have traded. At this rate, for the month of August and for the third month in a row, the number of shares traded will exceed the total number of shares outstanding. Because of such high volume, we maintain that GameStop could pull off perhaps the most consequential and shareholder-friendly buyback in stock market history with elegance and stealth.\n\nShareholders staring at all-time lows in GameStop stock see little evidence that GameStop has effectively leveraged its elite position in the gaming universe as the new paradigm came into clear view over the last five years.\n\nThe unfortunate reality is that Amazon, not GameStop, bought Twitch in 2014. Instead, in 2014, GameStop started buying wireless store assets. And in 2017, Amazon, not GameStop, bought GameSparks - while less than a year ago GameStop reversed course and sold its wireless store assets. Shareholders are right to worry.\n\nWe expect GameStop’s business will perk up a bit during 2020 and 2021 as the new console cycle, with associated software updates and introductions, finally gets underway. But what is happening now in the stock is about more than late cycle doldrums or even the streaming paradigm – shareholders do not have faith in current management, and have not been inspired by new leadership policies.\n\nNotably, as of July 31st, 2019, Bloomberg reports short interest in GameStop stock at 57,226,706 shares – this is about 63% of the 90,268,940 outstanding GameStop shares at last report.\n\nWe submit that when share prices are at or near all-time lows and more than 60% of the shares are shorted despite cash levels much higher than the current market capitalization, lack of faith in management’s capital allocation is the default conclusion.\n\nAll of this creates the opportunity to enter 2020 with a dramatically reduced share count along with multi-fold greater impact per share for every single other achievement of management. Consider as just one example that if the turnaround is successful, and if GameStop were able to shrink its shares outstanding to 30 million through the share repurchase, the $157 million dividend that was just eliminated would pay out around $5.25 per share.\n\nThe Board deemed up to $6.00 per share a good price for a buyback less than two months ago, and the price of the stock today is nearly half that amount.\n\nWe again advise the Board to represent shareholders well, and to ensure the execution of the remaining repurchase authorization in full.\n\nSincerely,\n\nDr. Michael J. Burry",
    "title": "Micheal Burry Letter to GameStop 2019...",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/npahjk/micheal_burry_letter_to_gamestop_2019/"
}