{
    "author": "Tribune-Of-The-Plebs",
    "created_utc": 1620937083.0,
    "distinguished": null,
    "edited": 1621011925.0,
    "id": "nbqbrc",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nbqbrc",
    "num_comments": 149,
    "permalink": "/r/Superstonk/comments/nbqbrc/the_hedge_fund_cabal_steve_cohen_citadel_and/",
    "score": 2040,
    "selftext": "**G**ood **~~M~~**~~orning~~ afternoon **E**veryone! (this took longer to write than anticipated)\n\nI want to get the eyes of some of the more wrinkled-brained Apes on this **comment letter to the SEC from 2009**: [**https://www.sec.gov/comments/s7-08-09/s70809-4614.pdf**](https://www.sec.gov/comments/s7-08-09/s70809-4614.pdf)**.**\n\nYou know those important comment letters to the SEC written by folks like our recent guest Carl Hagberg that apparently just go ignored? ***I think this might be one of those.***\n\n*(Please Note: this is a very long post. I’ve done my best to create a* \\****TL;DR at the bottom***\\*, *but please try to read both this post, and the linked source materials, in their entirety. They are fascinating and informative.)*\n\nThis 2009 SEC comment letter was written by Mark Mitchell, a **Deep Capture** investigative journalist. Deep Capture is the website created by Patrick Byrne, former CEO of Overstock.com, who waged a very public war against the naked short selling by Wall Street after his company fell victim to it. For his efforts, Patrick faced ridicule and dismissal from the mainstream media (we know something about that here). Patrick of course was ultimately vindicated by the events of 2008, when the SEC and Congress finally admitted the seriousness of the naked short selling issue as it threatened to destroy Lehman Brothers and Bear Stearns, and the whole financial system along with it. The SEC temporarily banned all naked short selling during the 2008 crisis.\n\nPatrick Byrne was also vindicated through Overstock’s  lawsuits against various short seller hedge funds and market makers who had targeted Overstock. Many of these lawsuits eventually settled out of court without admissions of guilt... but I think we can all read between the lines. I encourage you to read some of the juicy details on one of those lawsuits here, as reported by the BASED Matt Taibbi on Rolling Stone: [https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/](https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/)\n\nI also encourage you to watch this very interesting documentary from 2012 that has been posted to this subreddit a couple times before: [https://www.youtube.com/watch?v=Kpyhnmd-ZbU](https://www.youtube.com/watch?v=Kpyhnmd-ZbU).  Along with Overstock CEO Patrick Byrne, it prominently features lawyer **Wes Christian** (upcoming AMA), reporter **Lucy Komisar** (upcoming AMA), and **Dr. Susanne Trimbath** (Queen Kong!). Hot damn! What an all-star cast: [https://www.imdb.com/title/tt2281529/](https://www.imdb.com/title/tt2281529/)\n\n# Anyways, back to the SEC comment letter:\n\n# Wow.\n\nAs Gamestop's Twitter would say: ***there’s a lot to unpack here.***\n\nThis comment letter is a long-winded but fascinating read. 80 pages. I had to pop a whole bottle of adderall (kidding) and munch through an entire pack of crayons (not kidding) to plow through it all. But I’m glad I did. It is essentially an investigative journalism article covering the naked short seller campaign from 2007 onward against a cancer research company called **Dendreon**.\n\nThe details of the illegal and coordinated attacks on this fledgling prostate cancer research company are sickening enough in their own right, and show the depths these Wall Street sociopaths will go to make a profit, but there are also some interesting takeaways from this story which seem applicable to our favorite stock, as laid out below:\n\n# Key Takeaways:\n\n1. The “married puts / bullets” and “market maker exemption”\n2. The “flash crash / bear raids”\n3. The “Players”\n\n\\---------------------------------------------------------------\n\n# 1. The Married Puts, or “Bullets”:\n\nThe Dendreon naked short sellers used a “proprietary” trading strategy called “married puts” to create phantom shares and wreck havoc on Dendreon’s share price, resulting in millions of shares of Dendreon failing to deliver every day. At one point there may have been 90 million phantom shares of Dendreon circulating in the market, in a company that had only 100 million shares outstanding **(page 4-5 of Comment Letter)**\n\nHmm. Sounds familiar right? Some of the more wrinkle-brained apes here have previously speculated the same tactics could be in play to explain GME’s obvious naked shorting, Failure To Deliver numbers, and the price action.\n\nLet’s have Mark Mitchell explain how it works:\n\n\\--------------------------\n\n(Page 6/80):\n\n>“*As mentioned, we do not know who was responsible for the illegal naked short selling of Dendreon. The SEC keeps that a secret. But while the SEC is of no help, most any Wall Street broker can describe several “proprietary” strategies that are popular with unscrupulous hedge funds.*  \n>  \n>*One such strategy is known as a “married put.” Normally, a hedge fund buys from a market maker a certain number of put options—the right to sell a stock at a specified price at a specified date. If on that date the stock has lost value to the point it is below that specified price, the buyer of the put option (the hedge fund) makes money, and the seller (the market maker) loses money. To hedge the risk that he might lose money, the market maker, at the same moment that he sells the put option, also short sells the stock.*  \n>  \n>*This is perfectly legal. But some market markers conspire with hedge funds to drive the stock price down. Instead of merely shorting the shares into the market, the market maker naked short sells the shares, and, importantly, sells those phantom shares to the same hedge fund that bought the puts. As a result, the hedge fund manager winds up with the puts and a matching number of shares (actually phantom shares that are never delivered to him, but about which he never complains, or forces delivery, as that would create upward pressure on the stock, the precise opposite of what he wants).*  \n>  \n>*Because the puts and the phantom shares are equal in number and arrive together at the hedge fund, they are known as \"married puts\". Once in possession of the phantom shares, the hedge fund manager proceeds to fire them into the marketplace. But he is able to say that he never naked shorted because all he has done is sold the shares that he bought (wink wink) from the market maker. Either way, the effect is to flood the marketplace with phantom stock. The hedge fund makes money. And the market maker is rewarded with more business selling married puts.*  \n>  \n>*Incidentally, the fee charged for such puts do not follow any normal option model pricing (in fact, the exchanges search for married puts by looking for options that are mispriced in relation to Black-Scholes, the standard formula that prices options). That is because their pricing is not really a function of any math or statistics, but is a function of the willingness of the hedge fund to pay the option market maker to help him break the rules against naked short selling. And that willingness is a function of how difficult it is for the hedge fund to use other loopholes to break those rules.*  \n>  \n>*In the slang of Wall Street, these married puts are known as “bullets.” Through their manoeuvrings, the option market maker and hedge fund manager synthesize a naked short position that puts “bullets” into the hands of the hedge fund. The hedge fund fires those “bullets” at the stock to make it collapse, timing the last “bullet” to fire as the hedge fund’s put option expires profitably. If the option position nears expiration and looks like it will expire at a loss (“out of the money”), the hedge fund manager goes back to the option market maker, and together they reload by synthesizing more “bullets.”*  \n>  \n>*Until recently, this behaviour flourished owing to the “Madoff Exemption” – a rule that the SEC named after a “prominent” market maker and investor named Bernard Madoff. Mr. Madoff had considerable influence at the SEC, and helped the commission write the rule that carried his name. This was before Mr. Madoff became famous for orchestrating a $50 billion Ponzi scheme...*  \n>  \n>*...the “Madoff Exemption” permitted market makers (e.g. Madoff) to sell stock that they did not possess, so long as they were doing so temporarily to “maintain liquidity.” Abusing that exemption in order to facilitate naked short selling in cahoots with hedge funds looking to drive down stock prices was blatantly illegal, but the SEC looked the other way, even as market makers failed to deliver shares for weeks, months, and even years at a time. If anyone raised a fuss, the hedge funds would say that the phantom shares didn't originate with them, the SEC would say that stock manipulation is hard to prove, and the market makers would say that they weren’t breaking any rules. After all, they had a “Madoff Exemption.”*  \n>  \n>(Page 16/80): *“As of the end of March, 2007, a hedge fund called Perceptive Advisors held more than 600,000 put options in Dendreon. Perceptive Advisors is run by a man named Joseph Edelman... SEC filings show that at the end of March, 2007, Perceptive Advisors not only held puts, but also held call options on a whopping 6.2 million shares of Dendreon. Call options are usually a bet that a stock will increase in value. But don’t let this fool you. According to brokers familiar with his strategy, Edelman worked like this: He bought massive numbers of call options at rock-bottom strike prices. When Dendreon’s stock began to soar in value, Edelman exercised the calls, at which point his broker had to sell him an equally massive number of shares at the rock bottom price. These Edelman would quickly dump, flooding the market with massive selling volume and putting downward pressure on the stock. Meanwhile, according to the brokers, Edelman sold short massive amounts of Dendreon’s stock, profiting from all the selling volume.*  \n>  \n>*I called Edelman and asked him if he was short selling Dendreon while flooding the market with stock from his call options. He did not deny that he was short selling the company, but he hung up on me before I could ask any more questions. In any case, the strategy I describe above is technically legal. It’s legal so long as Edelman was not colluding with other hedge fund managers, all of whom happened to be generating massive selling volume at precisely the same time. And it’s legal as long as he was not engaged in naked short selling, or, equivalently, conspiring with a market maker to create married puts to synthesize those phantom stock “bullets” that unscrupulous hedge funds spray into the market to drive down stock prices.*  \n>  \n>*As to whether Edelman was in fact either directly naked short selling, or indirectly generating phantom stock by colluding with his option market maker, the brokers are staying mum. The SEC is unlikely to say much either. Remember, as far as the SEC is concerned, illegal naked short selling is a big secret – a “proprietary trading strategy.”*\n\n**My question for those with many brain wrinkles**: does the options data, fails to deliver data, and other trading activity on Gamestop thus far align with the Dendreon naked shorting strategy of using married puts as bullets to create phantom shares, as described above? If so... keep reading and see what other similarities there are with Gamestop!\n\n\\--------------------------\n\n# 2. The Flash Crash / Bear Raid:\n\n\\--------------------------\n\nOn April 28, 2009, Dendreon’s stock was the target of a massive, coordinated “bear raid”. Its share price plummeted from **$24 to $8, or** **-65%,** **in** ***75 seconds!*** Wow! Interesting! Where else have we seen similar “unprecedented” and jaw dropping attacks on the share price of a company? Perhaps... on GME? For instance on **January 28, 2021** when the share price dropped from **$483 to $112** in minutes? Or on **March 10, 2021**, when it plummeted from **$348 to $172** in minutes?\n\nLets have Mark walk us through this one too:\n\n(Page 1/80):\n\n>“*This story, like too many others, begins with Jim Cramer, the CNBC personality, making “a mistake.”*  \n>  \n>*On September 26, 2005, Cramer announced to his television audience the sad news (punctuated by funny sound effects – a clown horn, a crashing airplane) that Provenge, an experimental treatment for prostate cancer, had flopped. Thousands of end-stage patients had been pinning their hopes on Provenge, but according to Cramer the treatment had just been rejected by the Food & Drug Administration. It would never go to market. This seemed odd, because Dendreon (NASDAQ: DNDN), the company developing Provenge, had not yet submitted an application for FDA approval. As everybody in the biotech investment community knew, in fact, Dendreon had only recently completed Phase 3 clinical trials and probably would not face scrutiny from an FDA advisory panel for at least another year. As for the likelihood that the advisory panel would eventually vote in favor of Provenge, the odds looked good. The Phase 3 trials had demonstrated that Provenge significantly increased patient survival with only minimal side-effects, such as a few days of mild fever. Moreover, Provenge was an altogether different sort of treatment – one that fought tumors by boosting patients’ immune systems rather than subjecting them to the ravages of chemotherapy. Provenge was not a magical elixir of life, but Dendreon was doing more than just developing a new technology. It was pioneering a treatment that could revolutionize the way that doctors fight prostate cancer. By some conservative estimates, the market for Provenge alone could reach more than $2 billion a year. If the treatment could be applied to other cancers, the market would be even larger.*  \n>  \n>*The morning after Cramer declared Dendreon and Provenge to be dead in the water, Mark Haines, the anchor of CNBC’s “Squawk Box” program, apologized for Cramer’s “mistake.” That afternoon, at an important UBS investor conference, Dendreon presented still more promising data. This would normally have given a significant boost to the company’s stock price, but the value of Dendreon’s shares stayed flat for the day, and then began a gradual decline. This had partly to do with Cramer. The next evening, on his “Mad Money” program, the journalist (or entertainer, or self-confessed criminal, or… whatever Cramer is) acknowledged that the FDA had not yet rejected Provenge, but drawing upon his medical expertise, Cramer maintained that Provenge was not effective. In characteristically level-headed fashion, he announced that Dendreon shareholders were drunken, carousing, gambling Falstaffs who “might as well take their money to Vegas.” Dendreon, Cramer added (rather ominously), was a “battleground stock.”*  \n>  \n>*What Cramer meant by “battleground” has since become all too apparent. For the past four years Dendreon has been one of the most manipulated stocks on NASDAQ. During some periods the volume of trading in the shares of this little company has exceeded the trading in America’s largest corporations – a good sign that hedge funds have been churning the stock to move the market. And with every burst of good news, the company has faced waves upon waves of naked short selling – hedge funds illegally selling millions of shares that do not exist to flood the market and drive down the stock price.*  \n>  \n>*Along with the phantom stock, people seeking to diminish Dendreon have deployed false financial research, biased media, bogus class action lawsuits, internet bashers, dubious science, and other familiar weapons of the “battleground.” The denouement of this stock market “battle” occurred recently, on April 28, 2009, when Dendreon was to present all-important results at the American Urological Association’s annual meeting in Chicago. Some days prior, Dendreon’s CEO, Mitch Gold, had announced that the results of an Independent Monitoring Committee study were “unambiguous in nature…a clear hit” for Provenge. If a CEO uses language like that and does not produce the data to back it up, he is guaranteed a visit from the Securities and Exchange Commission. Unless the CEO or his allies have juice with the SEC, the commission will usually charge the CEO with making false statements to pump his stock. Gold was unlikely to take that risk, so it was clear to most people that the meeting in Chicago was going to be a triumph for Dendreon. And it indeed it was. The data presented that day showed that Provenge lowers the risk of prostate cancer death by 22.5 percent, with little or no toxicity. With a few notable exceptions (some of whom are to appear as prominent characters in this story), nearly every medical professional on the planet now concurred that Provenge was a blockbuster drug – one that should receive FDA approval and make Dendreon a highly profitable company.*  \n>  \n>*But the hedge funds weren’t finished. In the days following Gold’s announcement, short sellers piled on with a vengeance, returning Dendreon to the leagues of the world’s most heavily traded stocks. The firm once again found itself on the SEC’s “Reg Sho” list of companies whose stock was “failing to deliver” in excessive quantities –a sign of illegal naked short selling. On CNBC, meanwhile, Cramer had hammered Dendreon. On April 6, 2009, amidst ear-rattling sound effects -- dogs fighting, and (inexplicably) a baby crying -- Cramer had said “I don’t like Dendreon.” He had shouted that Provenge had no chance of getting FDA approval and Dendreon shareholders should “SELL! SELL! SELL!”*  \n>  \n>*Then, on April 28, at 10:01 am Central time -- just hours before Dendreon’s triumph in Chicago – an anonymous message board author on Yahoo! Finance posted this message: “HIGH PROBABILITY OF MASSIVE BEAR RAID…DNDN \\[Dendreon\\] could easily drop 50% on a massive bear raid…its coming today@12:30 pm central.” Just minutes before 12:30 pm central, Dendreon’s stock price began to fall. It didn't just fall--it nosedived from $24 to under $8 … in 75 seconds. During a period of 75 seconds, more than 4,000 trades were placed, totaling 3 million shares, or about 50% of Dendreon’s (spectacularly high) average daily volume.*  \n>  \n>*Given that the message board poster knew what was coming more than two hours beforehand, and predicted the timing almost precisely, it is a safe bet that this was a coordinated, illegal naked short selling attack. And just in case you still didn’t get this – it caused Dendreon’s share price to lose more than 65% of its value – in just 75 seconds flat.*  \n>  \n>“*My desk was floored,” one trader wrote on a message board. “We all just stood up swearing, headsets and other assorted desk items being thrown at monitors…I haven’t heard that much swearing in years…*  \n>  \n>*It was, say others, one of the strangest occurrences in Wall Street history.”*\n\n\\--------------------------\n\n# 3. The \"Players\":\n\n\\--------------------------\n\nOkay, so this is where my confirmation bias *really* gets... stroked hard. Guess who was present, and seemingly the ring leader, in the hedge fund “cabal” which was allegedly naked shorting Dendreon to death in 2007-2009? None other than our good pal Steve Cohen, now of Point72, then of SAC Capital. And guess who was involved in the \"death spiral\" PIPE financing which Dendreon was forced to seek out for its survival after its share price was destroyed through naked shorting? None other than Suspecthanna. Oops – I meant “Susquehanna.” Oh by the way – Jim Cramer and the corrupt financial press make prominent appearances throughout the Dendreon narrative as well. Because of course they do.\n\nLets have Mark walk us through the details of the key players who were allegedly naked shorting Dendreon, and working together to see its demise:\n\nRegarding “Steve Cohen” - (Page 75/80):\n\n&#x200B;\n\n>“*As should be clear by now, it is significant that a preponderance of the hedge funds that bet big against Dendreon, and a preponderance of the hedge funds that were invested in the three Milken-promoted companies – Cell Genesys, Novacea, and Cougar Biotechnology – were part of the same network. And it is significant that much of this network seems to be centered around Michael Milken and Steve Cohen, who became the “most powerful trader on Wall Street” some years after he was investigated by the government for trading on inside information provided to him by Milken’s shop at Drexel Burnham.*  \n>  \n>*Permit me to repeat a few facts: Cohen was once the top earner for Gruntal & Company, which was simultaneously employing several traders who were later tied to the Mafia. When Gruntal was indicted for embezzling millions of dollars, many of its former employees went on to fill the ranks of White Rock Capital, run by the alleged Russian mobster Felix Sater (he of the broken wine glass). Cohen, meanwhile, had left to start his own hedge fund empire. Cohen’s hedge funds have helped pump stocks promoted by D.H. Blair, which was eventually indicted on 173 counts of securities fraud and implicated in a Mafia stock manipulation scheme that was orchestrated by White Rock Capital. Lindsay Rosenwald, who is the son-in-law of D.H. Blair’s founder and a former top executive of D.H. Blair, was not only the controlling shareholder of Cougar Biotechnology, but also the proprietor of a hedge fund called Paramount Capital.*  \n>  \n>*The vice president of Paramount was formerly a top trader for Steve Cohen’s SAC Capital. The vice president of the above mentioned Millennium Management is also a former top trader of SAC Capital. And Cohen, who is maniacal about his working relationships, is on close terms with Schonfeld Securities, run by the former employee of Blind’em and Rob’em. Cohen has employed Schonfeld’s traders, including Anthony Bassone, who was until recently assistant controller of SAC Capital; and Rob Cannon, who is Cohen’s top personal trader at SAC. Another “Russian whiz kid”, Michael Orlov, created the computerized trading infrastructure at both SAC and Schonfeld Securities. And, as mentioned, Cohen shares employees and trading strategies with that other “Russian whiz kid” -- Dmitry Balyasny, who was once Schonfeld’s biggest earner. All of which I mention only because I fancy myself a biographer of a particularly destructive network of Wall Street personalities.*  \n>  \n>*It may be of no significance that out of Planet Earth's 11,500 hedge funds, there were only ten hedge funds with large numbers of Dendreon put options at the end of March, 2007. There may be no significance to the fact that of those ten hedge funds, seven were in the same network -- Millennium Management; Balyasny Asset Management; WS Capital (the successor to Gryphon Partners); Perceptive Advisors (whose manager was simultaneously working for Paramount Capital); Bernard Madoff Investment Securities; Pequot Management; and SAC Capital (managed by Steve Cohen, who is said to be maniacal about maintaining working relationships with people in his network).*  \n>  \n>*And it could be purely coincidence that these hedge funds were the largest holders of put options on Dendreon shares right at the time that Dendreon was getting clobbered by massive amounts of illegal naked short selling – and right before Dendreon’s treatment for prostate cancer was stymied by an unprecedented lobbying effort led by FDA-contracted doctors and government officials tied to Michael Milken.*\n\nRegarding “Susquehanna” - (Page 65/80):\n\n&#x200B;\n\n>“*In the late 1980s, a fellow named Jeffrey Yass and his two friends, Eric Brooks and Kenneth Brodie, set up a partnership to place bets at horse racing tracks across the country. On one single day at Sportsman Park in Chicago they pulled in winnings of more than $600,000. This seemed somewhat excessive, so Sportsman Park banned the three friends from its premises. The punters filed a lawsuit claiming that Sportsman Park had violated their rights to visit a public facility. It’s not clear from public documents who won this case, but the court noted, “The proprietor wants to be able to keep someone off his private property even if they only look like a mobster. As long as the proprietor is not excluding the mobster look-a-like because of his national origin (or because of race, color, creed, or sex) then the common law, and the law of Illinois, allows him to do just that.” There is no evidence that Yass, Brooks or their friend were engaged in illegal activity. I merely note as point of biographical interest that these fellows began their careers betting on the ponies.*  \n>  \n>*At any rate, Jeffrey Yass and Eric Brooks eventually abandoned the business of betting on horse races and instead pursued careers on Wall Street. Now they are “prominent” investors, the proprietors of a midsized investment and trading house called Susquehanna International. In the spring of 2008, Susquehanna was introduced to Dendreon by a placement agent, Lazard Capital Markets. It is not clear why Dendreon would want to do business with Lazard. After all, Lazard was home to the singing Joel Sendek, who had been busily trashing Dendreon in his research reports. Sendek had also been trumpeting Dendreon’s competitor, Cougar Biotechnology, as the next big thing in cancer treatment. In turn, Cougar Biotechnology (the company then controlled by Milken crony Lindsay Rosenwald, formerly of the Mafia-affiliated pump-and-dump shop D.H. Blair) had been quoting Sendek in its SEC filings. Sendek’s endorsement, Cougar seemed to be suggesting, was evidence that the company was making progress toward bringing its prostate cancer treatment to market. This was odd, because most pharmaceutical companies use data collected from clinical trials to demonstrate this, not quotes from singing Wall Street analysts.*  \n>  \n>*Meanwhile, it was widely understood that Lazard’s stock loan department was one of the go-to shops for hedge funds looking to short sell Dendreon’s shares. We cannot say that Lazard was loaning phantom stock to the short sellers (if it were, that would be a big secret), but Lazard’s coziness with short sellers ought to have given Dendreon pause. There was also the fact that Lazard Capital had only recently been spun off from Lazard Ltd. Given that the two operations remained closely affiliated (sharing business and so forth), it might have been of some concern that the chairman of Lazard Ltd. was Bruce Wasserstein, a close associate of Michael Milken.*  \n>  \n>*In “Den of Thieves,” James Stewart, the Pulitzer Prize winning author, quotes a criminal named Denis Levine as saying that Wasserstein was “owned” by Milken’s famous co-conspirator, Ivan Boesky. Given that Denis Levine was indicted for participating in Boesky’s insider trading schemes, one would think he knew of what he spoke, but there is no hard evidence to support his allegation. In any case, Dendreon followed Lazard’s advice, and did a “registered direct offering” with Capital Ventures International, an affiliate of Susquehanna, the firm founded by Yass and Brooks. A “registered direct offering” is similar to a PIPE, the difference being that the securities sold to the investor are registered with the SEC and immediately tradeable.*  \n>  \n>*For most of March 2008, naked short sellers were failing to deliver less than 500,000 shares per day. As negotiations for the “registered direct offering” were underway, the amount of phantom stock gradually increased. And on the day the deal was signed, April 3, at least 1.6 million phantom shares had been sold into the market and remained undelivered. For the next two months, more than one million Dendreon shares remained “failed to deliver” every day. This despite (or perhaps because of) the fantastic news, on March 12, 2008, that the FDA had agreed to an amended \"Special Protocol Assessment,\" which would enable the company to release, one year ahead of schedule, the results of an \"IMPACT\" trial that seemed likely to confirm the company's Phase 3 trials showing substantial evidence that Provenge was safe and effective.”*\n\nWow. What a great summary. These guys all sound sketchy as fuck!\n\nOf course, I would be remiss if I failed to mention that several years after this SEC comment letter was written, Steve Cohen’s SAC Capital was convicted of the largest(?) insider trading fine in history in 2013 – $**1.8 billion,** and subsequently shut down in 2016. Steve Cohen then started Point72 as a separate family office in 2014: [https://en.wikipedia.org/wiki/S.A.C.\\_Capital\\_Advisors](https://en.wikipedia.org/wiki/S.A.C._Capital_Advisors).\n\nIts also interesting to note that Steve Cohen, he of the “manically close working relationships” with his colleagues, once employed a certain **Gabe Plotkin** at **SAC Capital**. Gabe Plotkin is now of course with **Melvin Capital** (or is he... does Melvin even exist anymore???). Guess where else our pal Gabe Plotkin worked? Why, he started out his trading career at none other than **Citadel LLC**, working for **Mr. Kenneth Griffin**!!! [https://en.wikipedia.org/wiki/Melvin\\_Capital](https://en.wikipedia.org/wiki/Melvin_Capital).\n\nWhat a nice, tight-knit little hedge fund group you’ve got over there guys!\n\nDo you see how the pieces are starting to fit together? Could this be the very same hedge fund cabal now targeting Gamestop that drove Dendreon into the ground? Boy... *it makes you wonder.*\n\n**One last little tidbit I discovered and wanted to share:** remember that Rolling Stone article I linked at the start? Well guess who shows up as an eager client of Goldman Sachs partaking in their offer of naked shorting and intentional fails to deliver as a trading strategy? Lets have a look shall we:\n\n&#x200B;\n\n>“*The process of how banks circumvented federal clearing regulations is highly technical and incredibly difficult to follow. These companies were using obscure loopholes in regulations that allowed them to short companies by trading in shadows, or echoes, of real shares in their stock. They manipulated rules to avoid having to disclose these “failed” trades to regulators.*  \n>  \n>*The import of this is that it made it cheaper and easier to bet down the value of a stock, while simultaneously devaluing the same stock by adding fake supply. This makes it easier to make money by destroying value, and is another example of how the over-financialization of the economy makes real, job-creating growth more difficult.*  \n>  \n>*In any case, this document all by itself shows numerous executives from companies like Goldman Sachs Execution and Clearing (GSEC) and Merrill Pro talking about a conscious strategy of “failing” trades – in other words, not bothering to locate, borrow, and deliver stock within the time alotted for legal settlement. For instance, in one email, GSEC tells a client,* \\***Wolverine Trading**\\*, “We will let you fail.”  \n>  \n>*More damning is an email from a Goldman Sachs hedge fund client, who remarked that when wanting to “short an impossible name and fully expecting not to receive it” he would then be “shocked to learn that \\[Goldman’s representative\\] could get it for us.”*  \n>  \n>*Meaning: when an experienced hedge funder wanted to trade a very hard-to-find stock, he was continually surprised to find that Goldman, magically, could locate the stock. Obviously, it is not hard to locate a stock if you’re just saying you located it, without really doing it.”*\n\nBoy oh boy... could... could that be the same **Wolverine Trading LLC** that is one of the largest options holders of GME as per the latest Bloomberg Terminal data dump, with 23,459 options contracts???\n\n[https://www.reddit.com/r/DDintoGME/comments/nb063p/12052021\\_gme\\_bloomberg\\_terminal\\_information/](https://www.reddit.com/r/DDintoGME/comments/nb063p/12052021_gme_bloomberg_terminal_information/)\n\nI don’t know about you guys. But I’m **JACKED TO THE TITS** by all these weird “coincidences”.\n\n\\--------------------------------------------------\n\n# TL;DR:\n\n\\--------------------------------------------------\n\n\\- **Dendreon**, a cancer research company, was apparently shorted to death between 2005-2010ish by a close knit group of hedge funds working in coordination.\n\n\\- These hedge funds likely used a naked shorting strategy called “married puts” to create “bullets”, or phantom shares, that flooded the market and wrecked havoc on Dendreon’s share price. The hedge funds worked in concert with corrupt market makers to pull of this scheme, using the “market maker exemption” loophole.\n\n\\- On April 28 2009, Dendreon was the victim of a massive bear raid that caused its share price to crash from $24 to $8 in *75 seconds*, a drop of 65%. An unprecedented event on Wall Street.\n\n\\- Due to its share price being shorted to the ground, Dendreon was eventually forced to seek “death spiral” PIPE financing to stay alive and continue funding its cancer research to bring a prostate cancer drug to market. Dendreon was seemingly infiltrated by evil actors who introduced it to **Susquehanna** for said \"death spiral\" financing. Dendreon eventually went bankrupt, and its research and drug patents were snapped up by a major pharmaceutical company. Picked over by the vultures for scraps, I'd say.\n\n\\- The hedge fund coalition coordinating the short attack on Dendreon appear to have been a tight knit group linked to Steve Cohen’s trading empire (SAC Capital / **Point72**)\n\n\\- **Gabe Plotkin** (**Melvin Capita**l) got his trading career started at **Citadel LLC** working for **Ken Griffen,** and later worked for **Steven Cohen** at **SAC Capital.**\n\n\\- Melvin received a $2.85 billion bailout from Point72 and Citadel in January 2021 during the gamma squeeze. I wonder why...\n\n\\- **Susquehanna** is a major institutional player in the GME saga... check out their various GME holdings in the latest Bloomberg terminal data - [https://www.reddit.com/r/DDintoGME/comments/nb063p/12052021\\_gme\\_bloomberg\\_terminal\\_information/](https://www.reddit.com/r/DDintoGME/comments/nb063p/12052021_gme_bloomberg_terminal_information/)\n\n\\- **Susquehanna** was the institution who objected to the new **OCC rule 2021-003** and is holding up implementation of the same...\n\n\\---------------------------------------\n\n# My Conclusions:\n\n1. This exact same group of hedge fund *motherfuckers* who naked shorted cancer research company Dendreon to death from 2005-2010 using married puts, market maker exemptions, and death spiral PIPE financing were attacking Gamestop from 2016-2020.\n2. These hedge funds have CLEARLY been using similar naked shorting tactics again on Gamestop, likely in concert with a corrupt market maker... maybe even the **designated market maker** for Gamestop... **Citadel Securities** anyone???\n3. Susquehanna is also likely up to some shady shit, given their past involvement with the destruction of Dendreon, their current involvement in Gamestop, and their objection to the new OCC rule 2021-003.\n4. From this I can conclude there have **almost certainly** been phantom GME shares flooding the market due to naked short selling. How many of these phantom shares does retail currently own? Good question, I don't know. What can be done about the problem? This I believe I do know: **BUY. HODL. VOTE.**\n\n**Disclaimer**: I fact-checked Mark Mitchell’s SEC comment letter as best as I could as I read through. I could not find anything that was obviously untrue, and many of the stories and facts within appear to be substantiated by news reports of the day. I cannot, however, vouch for the authenticity of anything/everything that Mark Mitchell has written in his comment letter without a deeper dive.\n\nI THEREFORE INVITE YOU ALL TO READ THE LETTER AND DO YOUR OWN FACT CHECKING / DUE DILIGENCE\n\n**Additional Disclaimer**: I am not a financial advisor. None of the above should be considered financial advice in any capacity. Do not BUY, HODL, or VOTE unless you conduct your own due diligence and confirm that those such activities fit within your risk analysis and financial comfort level.\n\n**Additional Additional Disclaimer/Disclosure**: I am net LOOOOOONG GME. I will continue to BUY, HODL, and VOTE. Why? *I just like the stock.*\n\n\\-----------------------------------\n\nWould love to hear your thoughts, feedback, and critiques regarding the above!",
    "title": "The Hedge Fund \"Cabal\": Steve Cohen, Citadel, and Susquehanna have been playing this game for decades. Will the Game be Stopped this time?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nbqbrc/the_hedge_fund_cabal_steve_cohen_citadel_and/"
}