{
    "author": "AndiCat",
    "created_utc": 1620934636.0,
    "distinguished": null,
    "edited": 1622328897.0,
    "id": "nbpboy",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nbpboy",
    "num_comments": 205,
    "permalink": "/r/Superstonk/comments/nbpboy/the_house_of_fraud_the_biggest_corruption_scandal/",
    "score": 3219,
    "selftext": "Hello, I want to share with you my research this months and why this is the biggest fraud on history.\n\nI’m holding since the start of february GME and AMC, for the purpose of this post, I’ll touch in one or another but the facts apply on both, I’ll cover the fundamentals since this community has grown pretty fast, but first of all, *this is not financial advice*.\n\nI also hope congress people inform themselves a little. all the congressional hearings I’ve seen, were a complete disappointment, they didn’t seem to understand the concepts ([or they prefer to ignore it because they were bribed](https://youtu.be/vX2X8xxHEns?t=3241)) ([source2](https://twitter.com/dog_shill/status/1392848634916507648)) and when important questions were asked “your time is up”, we are talking about the whole economy, should not be taken lightly, and that they were being lied in their faces.\n\n&#x200B;\n\n[Nobody seems to see the elephant on the room](https://preview.redd.it/yr9tw1fsrxy61.jpg?width=1080&format=pjpg&auto=webp&s=6680d3cb11fb85b89ce207e04439ce1ae94eac8c)\n\nHow the economy has been carried by financial terrorist or the gravity of the actions that have been committed by predatory hedge funds and MM for years benefiting just themselves at the expenses of hard-working people which later are the ones paying the consequences for their gambling.\n\nDo you know that types of persons who blame on others what they really are, “gambling”, “inexperienced”, “how do we protect them”. When we are the ones being robbed billions every year, nobody says nothing.\n\nThis time we know what they are doing.\n\n&#x200B;\n\n**Ownership**\n\nAs you heard from the own [AMC CEO Adam Aron](https://www.youtube.com/watch?v=XjqCaNKsSbc), retail investors (**diamond hands apes**) have almost the whole ownership of AMC, on the case of GME, there’s most friendly whales who want to see Citadel going down (whales battle) for the money they made them lose on TESLA between other facts, but let’s be real, with the billions of naked shorting we probably have the whole ownership of both several times, and we are not selling, neither them, instead the data show that we all are **buying** and **holding** and the buying power is skyrocketing with all the bullish sentiment.\n\nBut why do I think we are at more of 100% ownership? Maybe even several times the shares outstanding, well first of all we were on a **87.5% ownership** 2 months ago as I disclose on [my first post](https://www.reddit.com/r/Wallstreetbetsnew/comments/lke7pg/a_message_from_deepfuckingvalue_and_me_all_gme/), and we have been doing nothing different than **buying** and **holding** [my broker](https://capital.com/trading/signup?c=mqfvq5bc&pid=referral) graph hasn’t changed at all, and with more apes joining as AMC shareholder as the months have passed.\n\nAt the time writing this post the data shows we are on a **79.3% ownership** in the case of AMC so let me understand, we lost an **-8.2%** ownership while buying and holding, doubling down and new apes joining all this time? that does not make any since, without considering the fails to deliver, these days, I’ve seen apes post dropping **$20k**, **$50k**, **$100k** one even drop almost **a million**.\n\n&#x200B;\n\nhttps://preview.redd.it/7jnv8ua5sxy61.png?width=1800&format=png&auto=webp&s=b169e160b9aab8eec9f0d472a958c8856e781599\n\n**Fraud**\n\n*Wrongful or criminal deception intended to result in financial or personal gain.*\n\nIs not surprise than the financial system is rigged to benefit the 1% while the 99% get robbed but let’s dig a little more on the fundamentals.\n\n*(First person analysis)*\n\nWhen you go **long** all that you can lose is your investment if you close your position or the business goes bankrupt, when you go **short** since you should buy back the shares if the value goes up the loses can be **infinite** so, as you love to profit from fraud and as a professional market manipulator, you’ll do all the possible to make the value go on your profit, if you bankrupt the business, better for you, you get free *no tax* money, the investors lose all their investment and employees loses their jobs, so their income to sustain their families, but you don’t care about that, you now can buy an expensive new mansion.\n\n&#x200B;\n\nhttps://preview.redd.it/dpkkmad9sxy61.png?width=603&format=png&auto=webp&s=d8347f4ea509896d656c3a13de912b238c0e8735\n\nLet's disclose the illegal tactics predatory hedge funds are using and had been using for years to manipulate the market in their benefit making billions in the process:\n\n**1. Payment for order-flow and Frontrunning**\n\nYou pay millions to brokers like robinhood to redirect their users order-flow for trade execution (a penny for each transaction), but you aren’t losing money, that’s not how it works, you want to steal most of it, so you start front-running those trades, is illegal and unethical but is “*business*” so then you’ll use that data on your advantage, as the daylight robbery is profitable, you keep buying that order-flow from different brokers, is like farming money without moving a single finger, HFT do the dirty work.\n\n**2. Massive shorting**: You see a company having a hard time to survive cause the pandemic or any other reason, and they are trying hard to avoid bankruptcy, there’s a lot of employees who income depends on that job, as the greedy parasite you are, you borrow millions of shares and sell them short, on a short period of time, making the value of the stock aggressively drop, investors get scared and sell, so the sell pressure plus your short pressure send the stock price of those companies to the ground and you gain millions / billions, in the best scenario for you, the company goes bankrupt cause then you get free *no tax* money.\n\nThe orders get executed all at once doing the candles to have an abnormal behavior (like happen on january), almost all of the time are corrupted hedge funds behind it, and investors have no other option than suffer loses, almost all of them gets scared and sell at lose, this is the “cleanest” way benefit you, still market manipulation but hey is “*business*”.\n\n**3. Media Manipulation**: *Series of related techniques to create an image or argument that favors their particular interests. Such tactics may include the use of logical fallacies and psychological manipulations.*\n\n&#x200B;\n\nhttps://preview.redd.it/ix64kfvksxy61.png?width=1280&format=png&auto=webp&s=15dcdad77acd94cdd29f494f4c210d98a71ce77d\n\nSo, if the plan is not working like you expected since the investors know the company can recover and the price is rising, now you are losing, better call your puppets on the media to push your agenda it works almost all the time, they’ll say the company is the worst and they going to bankrupt for bad management, push fake investigations against the company, media articles, etc.\n\nDon’t forget your puppets on CNBC and Marketwatch (they’ll remove those companies from the high short list), but let’s also call your professional push and dump pupped [Jim Cramer to disclose that to you ](https://www.youtube.com/watch?v=W90V_DyPJTs&t=3s)(***They’re not confessing, they’re bragging***) legal or illegal it does not matter, the important is that this affect the market for your profit, the SEC?, those are your dogs and you pay the penalty (bribery) and you have green light to  keep doing “*business*” (robbing the smaller institutional investors and retail investors)\n\n&#x200B;\n\nhttps://preview.redd.it/0gnqwcw4txy61.jpg?width=1200&format=pjpg&auto=webp&s=9438dfb1a807a92f7484fe2c9fe20637b96faaa1\n\nhttps://preview.redd.it/ba6bnjposxy61.png?width=600&format=png&auto=webp&s=29b7842eb0e723b0e8c0aa3e942ef0416ac622ef\n\nSEC will go away happy with the pennies sitting in their ass [checking porn](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwivzuGw_MbwAhWpVTABHUjHCUQQFjAAegQIAhAD&url=https%3A%2F%2Fwww.reuters.com%2Farticle%2Furnidgns852573c4006938800025770e005fc355-idUS217604535120100423&usg=AOvVaw2sYc7Bqu_rprwkqGrL2XWx) and WSB [post the whole day](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwip_cGxz8bwAhVNdt8KHUzYAygQFjACegQIAxAD&url=https%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Flc941y%2Fthey_want_to_investigate_wsb_the_sec_are%2F&usg=AOvVaw00eVvgQ6lzmexnS2dSfp_b) and then [clamming market m](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwj-3_TE_MbwAhVgQTABHfFMBe8QFjAAegQIBBAD&url=https%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Flc941y%2Fthey_want_to_investigate_wsb_the_sec_are%2F&usg=AOvVaw00eVvgQ6lzmexnS2dSfp_b)\n\n[anipulation](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwj-3_TE_MbwAhVgQTABHfFMBe8QFjAAegQIBBAD&url=https%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Flc941y%2Fthey_want_to_investigate_wsb_the_sec_are%2F&usg=AOvVaw00eVvgQ6lzmexnS2dSfp_b) at a bunch of middle / poor class people investing who are the ones being robbed, calling themselves retards and sharing memes.\n\n&#x200B;\n\nhttps://preview.redd.it/l2mkqkfatxy61.jpg?width=500&format=pjpg&auto=webp&s=158a40f488b175894f1ce9de092acb4d14e549b1\n\n**4. Spread Misinformation** If media is not working like you expected you can open your rat cage and send a bunch of shills and bots to spread FUD and misinformation, you can also offer money to corrupt the mods on WSB like you did on February to delete DD post and ban OP with a bit of rotten cheese, they will follow your orders.\n\n&#x200B;\n\n*Looks like the rats are ready to go:*\n\n*SILVER…WEED …SNDL…DEAD CAT. GME $48, AMC $5 AND IT’S GOING DOWN. I CARE FOR YOU MONEY AND YOU ARE GOING TO LOSE ALL IF YOU DON’T SELL. SELL AT LOSE TO SAVE THE “FREE” MARKET!!*\n\n&#x200B;\n\nhttps://preview.redd.it/qpzzhtqsvxy61.png?width=606&format=png&auto=webp&s=c759017d03d9617860f3afcb49d3820e0e160761\n\n&#x200B;\n\n[this is just a few, there are dozens of data rolling on the sub](https://preview.redd.it/1mp0ccylwxy61.png?width=750&format=png&auto=webp&s=8b485fe9bc4a85e9736be7d97553a3e86a0dbbc3)\n\n&#x200B;\n\nDit it worked? Well... and don’t forget all billions are now yours, did you say new mansion?\n\n&#x200B;\n\nhttps://preview.redd.it/ysza7awctxy61.png?width=640&format=png&auto=webp&s=36cd927912beb7d2cb5f08a637233dc696bbd82a\n\nThey tried to bankrupt Elon Musk business in 2008, imagine sending into bankrupt the business of the only person who is doing something for the world, electric cars, solar panels, going back to the space and save us from a possible extinction event in a future, global internet service at fast speed, and they tried to send them out of business, just to profit, these are the type of scumbags that we are dealing with .\n\nNow AMC and GME, emblematic US business working since the last century and just because they were hit hard by a pandemic they wanted to bankrupt them, leaving thousands of people without income, but they didn’t care.\n\nFirst of all shorting was supposed to uncover fraudulent business when you think their value is higher than they are really producing and could be dark numbers going behind (money laundering, drugs, etc), also when you think other is overvalued, never was supposed to send to bankruptcy business when they are facing a bad financial situation, and upon all that on a pandemic, that’s just disgusting and inhuman.\n\nThey weren't trying to make profit by shorting AMC and GME, they were trying to send them bankrupt AMC CEO declared he was at almost [6 weeks of run out of money](https://youtu.be/XjqCaNKsSbc?t=874), so corrupted hedge funds get 100% no tax gains, that would have been like the end of a movie theaters since amc is one of the biggest one, and the end of a big part of the legendary game industry.\n\n&#x200B;\n\n*If nothing of the above worked let’s use brute force it’s highly illegal but you aren’t losing against a bunch of middle class / poor apes on reddit, pss!, did I tell you also steal investors money by doing it?*\n\n&#x200B;\n\n**5. Naked shorting**: Illegal practice of short selling shares without borrow them first so the shares don’t exist and the short pressure end up being larger than the entire shares outstanding.\n\n**6. Fail to deliver**: In the case of buyers, it means not having the cash, in the case of sellers in means not having the share, this is the next step of **naked shorting,** basically an investor has bought a phantom share that a corrupted MM / HF created to keep shorting but since that share does not exist can’t be deliver to the buyer.\n\n**7. Stock Market Glitch**: An investor buy a share, your broker with or without your knowledge lend it, in this case to a predatory hedge fund and you receive an interest bellow $0.005 or less, they sell it short, then somebody buy it again, and his broker lend it again, like a loop, this is well known by corrupted hedge funds so they use it to their advantage.\n\nWhat do we have at the end, well, the pressure of millions of shares that were shorted more than once plus the millions of naked short.\n\nCitadel have been caught several times with [this fraudulent practice](https://prospect.org/power/gamestop-mess-exposes-the-naked-short-selling-scam/), and they just receive a penny of penalty compared to the billions they gain for it a lucrative “business”, i prefer to call it by the correct name, Robbery and bribery, after that, they have green light to go and keep doing the same.\n\n**8. Short ladder**: Two corrupted hedge funds trade shares back and forth between each other at lower and lower prices in order to trick the system into “thinking” a massive sell off is going on, and get investors into panic selling. As they have advantage above others they can sell at fractional in other words spend less money while manipulating the market, if the price goes up cause people are still buying after all those phantom shares, you are digging a massive hole.\n\nAccording to [IBorrow](https://iborrowdesk.com/report/amc) on 04/15/2021 there were just 100 shares available to lend, but on [NASQD](https://www.nasdaq.com/es/market-activity/stocks/amc/latest-real-time-trades) the transactions showed there were being shorted several times that amount (hundred and thousands), and the most important, on fractional price, upon that using [HFT](https://www.investopedia.com/terms/h/high-frequency-trading.asp#:~:text=What%20is%20High%2DFrequency%20Trading,orders%20based%20on%20market%20conditions.) so every fraction of second thousands of phantom shares were being sold short, nothing different than printing counterfeit money but worse since they steal billions of poor people, send business to bankrupt, create unemployment, damage the economy, etc.\n\nAnd after all that they call retail investors “dumb money” so they think was their failure for making bad investments.\n\nhttps://preview.redd.it/xv7qa2sgtxy61.png?width=1360&format=png&auto=webp&s=97914a3e2361d1c4d9285d3927774075d4c4d546\n\n**9. Dark Pool**\n\n*Dark pools allow institutional investors to trade without exposure until after the trade has been executed and reported. Dark pools are a type of alternative trading system (ATS) that give certain investors the opportunity to place large orders and make trades without publicly revealing their intentions during the search for a buyer or seller.*\n\nThis is one of may forms why the price has been dropping even when the stats show 4 - 1 on buy vs sell, since like the brokers (like robinhood) send the order-flow for execution at citadel and they redirect them to darkpools, and on the market just gets executed the sell orders, short ladder and all those dark stuffs, we’ll never know exactly what’s going on until the flashlight point to those shady accounts.\n\nNotice how much volume is being diverted to FADF (google it - large Dark Pools), this while sell orders hit the NYSE/Nasdaq, This tactic can be used to suppress buying pressure.\n\nClosure\n\n**Why they’re doing this?**\n\nThey have been stealing people's moeny for years by sending thousands of businesses to bankrupt, remember the money is just a tool invented to avoid barter, so when somebody receive money is in exchange for a product or service, in financial case a stock, but if the market gets manipulated then people are losing their money for nothing (steal), having that in mind we can continue to the OBV.\n\n**OBV**\n\n*On Balance volume is a technical trading momentum indicator that uses volume flow to predict changes in stock price.*\n\nIf you take it on consideration, you can see an abnormal behavior of AMC and GME compared to other stocks, we have seen AMC and GME massive drops while people are buying, ally whales buying, and nobody selling, since the price has been manipulated the price of AMC could be on the hundreds and GME over a thousand, could be even more since the market manipulation has been aberrant that probably all estimates could fall short.\n\n&#x200B;\n\n**False Testimony in congressional hearing**\n\nOn the first congressional hearing while they were still doing all the manipulations tactics mentioned above while they declared to have covered their shorts by their own dirty mouth and sending the script to  media and shills, but we didn’t because we know the truth, we aren’t leaving AMC Teathers and GameStop at the mercy of greedy parasites, we are tired of this corrupted financial system where a few ones play with the economy and all the hard-working people. and the world end up paying the consequences, and on top of that they profit with billions instead of go to prision.\n\n*I’ll read the script on that teleprompt a team of lawyers are writing... when I was a boy in Bulgaria…* a buch of nosence to burn time.\n\n&#x200B;\n\n**What to do then?**\n\n**BUY, HOLD AND USE SOCIAL MEDIA TO SPREAD THE TRUTH.**\n\nOur voice has been silenced for months by most of the mainstream media (puppets), the important part here is that they need to cover, that’s our only tool here, the beauty of this is that we didn’t fall for all the market manipulation techniques describe above, millions of people online saw the truth and they clung to it, that’s historic.\n\nWe together have a power bigger than any other fund in the world such that the value of the stock have been going up even when they have been using powerful machines in their advantage to illegally manipulate the market, excepts we are completely decentralized and entirely democratic. I’m not going to say r/wallstreetbets cause you know they sold us like a piece of meat for money to corrupted Hedge funds, that sub now is just bots, HF interns as mods, shills talking with themself their script (cringe), push and dump.\n\n**What we have been using unlike them?** Our hard work money, some people their retirement funds, some people their live savings, loaned money, some have sold items as cars, bikes, etc, to support AMC and GME.\n\n&#x200B;\n\nThe government need to stop saving those market manipulators at the cost of the people, they didn’t use their power to create new business / stimulate the economy as should, instead they use it in their own benefit, friendly whales can do a better job, without stealing people’s.\n\nAnd if they don't they know they better don't betrayal the world like the corrupted ones are doing right now, cause apes also will be there, to protect those business.\n\n&#x200B;\n\nhttps://preview.redd.it/8tyz1d1ktxy61.png?width=603&format=png&auto=webp&s=78b0f1ea3ef3358dea65412377c4f91a1c59153a\n\nThis is probably not going to happen again in the history, we diamond hands know that so don't sell all for less than we deserved for [years of market manipulation](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/), for all those businesses that were driven into bankruptcy, for 2008, 2011, securities fraud, wire fraud, perjury, war financing, money laundering and I could keep going.\n\nRegulations are coming at record time, you know why? cause the SEC knows when this fraud start coming to light eyes are going to look at them too since they were the ones that supposedly should have protected the market but they didn’t, instead allow it and receive bribery in exchange.\n\nNow keep going.\n\nFintel claims Si at on AMC 32%, then they change it at 12%,  it does not matter we know all those numbers are fake, we know the amount is on the billions on GME and AMC, so is several times the shares outstanding due to naked shorts, so we are talking on a SI, of 100% + the counterfeit, that could be 2, 3, 5, times, we’ll never know until those numbers start coming to light, also we don’t know how may apes and ants are out there, but we know are millions.\n\nSo if Volkswagen squeeze was with a **12.8%** and the price reached almost $1k, here we are talking of 100% + the counterfeit, that’s why the floor is more than real, this is an unprecedented situation, they are on a blackhole, and they know it, so they have no more than keep naked shorting, until they are forced to cover or go bankrupt.\n\nBut let’s be real they deserve bankrupt and prision, and the federal reserve must print our tendies, why? cause the are part of the biggest scam of history, FINRA, NYSE, SEC, CONGRESS, DTCC are on bed, they allowed this or are bribed, remember that, so don’t accept less than you deserve.\n\n&#x200B;\n\nNow that you all can see what I see months ago as i disclosed on one of [my first post](https://www.reddit.com/r/Wallstreetbetsnew/comments/lke7pg/a_message_from_deepfuckingvalue_and_me_all_gme/), we are on a different situation, not just that but the situation behind was even worst, I didn’t know in that time that the [whole system was a scam](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/).\n\nIn conclusion when they start covering the value will rise on the thousands, without counting the fails to deliver so if all diamond hands and friendly whales hold $**X's**\n\n&#x200B;\n\nWith the biggest wealth redistribution on history, we diamond hands apes, will invest on start up’s that help the planet (plastic pollution, climate change, world hunger, water, create business, etc), pay debt, help our families, parent’s debt, buy on local business, so push the economy, things that wall street / corrupted hedge funds have never done, just benefiting themselves for years.\n\nI am not going to buy a Lamborghini or million-dollar houses, that will put me on the same level that **corrupted Funds and market manipulators.**\n\nWe will d\\*e some day when older and that car is not going to the other world with me, I want to leave something for the world, put my name on history books, but with the current corrupted financial system is hard to climb that ladder.\n\n&#x200B;\n\nhttps://preview.redd.it/u3hkd5q9uxy61.jpg?width=700&format=pjpg&auto=webp&s=a2e310ba3822885f27f765508e080e82b79dc070\n\nCitadel, Melvin and his corrupted ally’s which together are on the trillions can’t pay? well, then they’ll go bankrupt (in first time they should never have existed and be allowed to manage our money, that’s just absurd obviously they are going to steal our money).\n\nWe have been focusing on Citadel and Melvin but isn’t just them, there’s also a lot of hedge funds (big and smaller, banks) who are behind this, just to mention Susquehanna International Group is like 2 times the size of Citadel, both made huge bets during the pandemic and gained big while the world lost it, where do you think those trillions went? right, to those 1%.\n\n&#x200B;\n\nhttps://preview.redd.it/zrcaauhcuxy61.jpg?width=284&format=pjpg&auto=webp&s=3266301b16d395adbe53acefbd33cedf9599488a\n\nThe SEC and \"regulators\" has failed to provide a fair market and protect the little guy, instead they were all in bed, we were being robbed for years, the working class, the ones who make this country what it is, corrupted hedge funds just go to the office start the computers to do HFT, steal our money, send startups and business to bankrupt, create unemployment, keep everything to themselves then buy luxury and absurd expensive things while the people’s die from hunger and contamination send the world to burns  in hell, **THIS PLANET IS OUR ONLY HOME ALSO** **THAT’S OUR STOLEN MONEY AND BANKRUPTED COMPANIES / STARTUP MONEY.**\n\n&#x200B;\n\n[let's gamble with the economy, get a bailout with the working class money and finally we'll laugh at them](https://preview.redd.it/4jckzcv2vxy61.png?width=653&format=png&auto=webp&s=120f5fac110a9037906851168e2a9a8f6d6db897)\n\n&#x200B;\n\nThe question is, will this be the first domino piece?, look the repo market, look the leverage, they have been playing with the economy again like 2008.\n\n&#x200B;\n\nhttps://preview.redd.it/3nlwm4t6vxy61.png?width=520&format=png&auto=webp&s=bac90c9a2b52c7079bee3f487d3a21e8e901f778\n\n&#x200B;\n\nProbably fake media will try to push their fake agenda to left us like the bad ones again, when we simple play by the rules of a corrupted game,\n\nThe reality is that we saved business from bankruptcy with our hard-work moeny, what they have been contributing for the society apart of steal?\n\n**Fake media already tried to left us like villains.**\n\nDo you remember those articles on the first *newborn* squeeze on January saying: we were Russians, the same responsible for the Capitol Attack, we have been posting racist post against black people (also racist), antisemitic stuff (more racism), and other dozens and dozens amounts of BS.\n\n*Like, I’m sorry I asked for a home loan of $300k and not $500B in leverage to gamble, All we did was buy a stock we like, If that’s all it takes to hurt the market. The market is broken on the first place, we are holding a stock and air (countherfeit shares), the 1% are holding the money that the the 99% does not have by committing fraud.*\n\nFake media have been for months leaving us like villains and I’ve seen years of [script to brainwash people. ](https://www.youtube.com/watch?v=QxtkvG1JnPk)\n\nWe are common people, students (*I’m a college student and freelancer artist*), nurses, essential workers, etc. people that run thE country.\n\nAlso if they go away with this future investors will suffer the same, we have the tools now to stop them and this situation might not repeat on the history since they’ll keep robbing people’s money and don’t get caught with the pants down again, don’t be a paper hand, diamond get created under pressure, why get pennies when you can get a lifechanging.\n\n&#x200B;\n\n**On 04-17-2021** and this days have you seen the synchronized crypto crash? (push and dump), if you think this is retail, you are living in another reality, as you can see they are manipulating also the crypto market to steal people's money, again this are the thieves we're dealing with, we are fighting against greedy parasites committing the biggest fraud in history.\n\nhttps://preview.redd.it/w29duvgcvxy61.jpg?width=640&format=pjpg&auto=webp&s=e0ace54f69d5c317e6ab27839009177f1c7ff889\n\nBy the liquidity issues, and the crypto crash looks like hedge funds have been also playing over leveraged, no just that but this time the mortgage bonds are treasury bonds shorted to oblivion, in other words, they gamble hard with the US economy like they did on 2008.\n\nSo Citadel and friends have shorted the treasury bond market to oblivion using the repo market. Citadel owns a company called Palafox Trading and uses them to **exclusively** short and trade treasury securities.\n\nParafox manages one fund for Citadel – Citadel Global Fixed Income Master Fund LTD.\n\nTotal assets over $123 Billion and 80% are owned by offshore investors in the Cayman Islands. Their reverse repo agreements are **entirely** rehypothecated and they **cannot** pay off their own repo agreements until someone pays them of, first. The **entire** global financial economy is modeled after a fractional reserve system that could beginning to experience the mother of all margins calls.\n\n&#x200B;\n\n**Final**\n\nThere were heroes who were fighting against corruption and fraud alone, others that were victims of it whose voices were silenced, and all the John Doe and Jane Doe we never knew about, don’t forget them.\n\n&#x200B;\n\n[Alex Kearns](https://preview.redd.it/ngt9bftjvxy61.jpg?width=1908&format=pjpg&auto=webp&s=fb3d78b48dab0b96ada4d2241237e2c9cf428cf8)\n\n&#x200B;\n\n[ Daphne Caruana Galizia ](https://preview.redd.it/w60tygelvxy61.jpg?width=640&format=pjpg&auto=webp&s=31722f78555c5b29fd433eeddc7715b55b10a9c8)\n\n&#x200B;\n\nhttps://preview.redd.it/34qq1o0635271.jpg?width=400&format=pjpg&auto=webp&s=ef23113c132b5274ed203de2a051452e90fe114b",
    "title": "The House of Fraud - The Biggest Corruption Scandal on History",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nbpboy/the_house_of_fraud_the_biggest_corruption_scandal/"
}