{
    "author": "onlydumbopinions",
    "created_utc": 1627784576.0,
    "distinguished": null,
    "edited": 1627787883.0,
    "id": "ovjxnx",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ovjxnx",
    "num_comments": 108,
    "permalink": "/r/Superstonk/comments/ovjxnx/on_otc_derivatives_gme_and_the_global_market/",
    "score": 1645,
    "selftext": "Works cited at bottom, citations in footnote format.\n\n\n# OTC Derivatives\n\n\nSimply put, an OTC derivative is tradable financial contract tailor made for the lenders, borrowers, and potential counterparties. They are not traded on exchanges, unstandardized, and incredibly dangerous.\n\nRead more background on OTC derivatives [here](https://www.investopedia.com/ask/answers/052815/what-overthecounter-derivative.asp)\n\nOTC derivatives can be used as an insurance policy of sorts, protecting against unfavorable price movement in a stock. For example, two parties can enter into what is called an \"interest rate swap,\" where the counterparty pays variable interest rates on a security borrowed from a lender. With relatively secure assets, these are fairly straightforward and common agreements. However, not all assets are stable and tradable. In such a situation, the second investor can offset risk by involving another counterparty in their own OTC derivative swap^1.\n\nInterest rate swaps [visualized](https://i.insider.com/4be9a4527f8b9a342d560200?width=500&format=jpeg&auto=webp)\n\n# OTC Derivatives Market Up to 2008\n\n> \"By  far,  the  overwhelming  majority  of  derivatives  are  traded  on  the  OTC  market  around  the \nworld. As can be seen in Figure 1, as of June 2008, the OTC market was USD$684 trillion in \nnotional  value,  with  exchange-traded  derivatives  amounting  to  USD$84  trillion\" (Salifu, 2018)^2.\n\nTake a second and appreciate this staggering number. I'll wait. Now, remember that ***this was the market size in 2008.*** How big is the market now? Many estimate well over 1 quadrillion. For perspective, the combined GDP of the world is about 93 trillion.^3\n\nOTC derivatives are the bread and butter of financial institutions. They are their playground away from the public facing data and metrics of retail-accessible exchanges. They are pernicious, dangerous, and will result in the collapse of the entire financial system.\n\nA 1998 attempt at regulation was rejected by then Chairman of the Federal Reserve, Alan Greenspan^4. 10 years later, Lehman Brothers failed, resulting in a shockwave reverberating through their counterparties^5. Remember, OTC swaps allow institutions to either push financial risk onto other institutions, or assume the risk themselves (for interest payments). \n\nSpecifically, the interest rate derivatives market nearly doubled in size leading up to the 2008 crisis . In Figure 1, please note the 2006 vs 2008 columns for comparison. Numerically, the gross market value for interest rate swaps increased 105% (8.1 to 16.6tn) -- in the US market, the GMV for interest rate swaps increased 201.2% to 9.3tn. Interestingly, the volume of credit default swaps actually decreased 27% during this time frame.^6 The full numbers are listed in Table 1, in billions USD.\n\nThis isn't even the first time this has happened.\n\n> \"Derivatives  have  been  associated  with  a  number  of  high-profile  corporate  events  that  ruled \nthe  global  financial  markets  over  the  past  two  decades.  To  some  critics,  derivatives  have \nplayed  an  important  role  in  the  near  collapses  or  bankruptcies  of  Barings  Bank  in  1995, \nLong-term  Capital  Management  in  1998,  Enron  in  2001,  Lehman  Brothers  and  American \nInternational Group (AIG) in 2008.\" (Salifu, 2018)^2\n\n# OTC Derivatives Now\n\nAfter the 2008 financial crisis, regulators world-wide were clutching their pearls as if they didn't fucking already kno exactly why what happened happened. In the European Union, the European Market Infrastructure Regulation was passed (EMIR), coming into effect 2013.^7\n\nMost notably about it was the new requirements for derivatives reporting:\n\n> \"Since the European Securities and Markets Authority (ESMA) requires the use of the ISO 20022 format and schema, and there are over 150 fields, every firm now needs to convert its internal SFT data to this format and add pre-reporting checks.\"^8\n\nIn order to maintain coherence across domestic and foreign markets, the DTCC graciously stepped in to centralize reporting. Thus was created the \"Global Trade Repository service\" (GTSS). Coincidentally, the GTSS also satisfies the requirements laid out in the Securities Financing Transactions Regulations (SFTR).^9 Plenty of DD has been done on how SFT's are used to conceal FTD's for GME, so I will not repeat it here. More on FTD's below.\n\nIn the meantime, the OTC derivatives market was doing very, very well. The gross (\"real\") market value of OTC derivatives was 15.5tn in June 2020 (see Figure 2) Total (\"notional\") market size was 606.8tn at the end of June 2020, up 8.6% from 2019 year-end (see Figure 3). The actual value of the derivatives was a mere 2.55% of the notional traded value.^10 Read that again.\n\nLet's revisit those interest rate swaps, or Interest Rate Derivatives (IRDs). IRD alone accounted for a global notional value of 495.1tn, 81.6% of total notional outstanding in June 2020 (see Figure 4). In gross value, IRD alone accounted for 11.7tn, or 75.7% of total gross outstanding in June 2020 (see Figure 5). Remember Credit Default Swaps? CDS notional outstanding increased 16.2%, from 7.6tn to 8.8tn from end-year 2019 to mid-year 2020 (see Figure 6).\n\n# OTC Derivatives and GameStop\n\nOTC market information is heavily pay-walled. This is the walled garden of institutions and governments, and the bourgeois is not allowed in. However, we can see some clues in the FTD data made public by the SEC, albeit in a very inconvenient format (.txt delimited by '|'? Seriously??).\n\nHere's how I found out that our favorite idiosyncratic stock wasn't so unique after all. I took the FTD data from November and December 2020 (four txt files), in the hopes of finding other stocks being exchanged with it in swaps. The top 20 FTD's for each half of the month are listed in Table 2. Some are listed twice for having stupid high numbers in multiple weeks.\n\nI have subdivided these stocks into categories based on their behavior. Stocks marked with an asterisk are traded OTC exclusively.\n\n##### Spiked with GME:\n*[HYSR](https://finance.yahoo.com/quote/hysr)\n\n*[LLKKF](https://finance.yahoo.com/quote/llkkf)\n\nSAVA (mentioned by Dr Burry, added by me)\n\n##### Spiked after GME:\n*[ENZC](https://finance.yahoo.com/quote/encz)\n\n*[ALYI](https://finance.yahoo.com/quote/alyi)\n\n##### Spiked with and after GME:\n*[OPTI](https://finance.yahoo.com/quote/opti)\n\n*[OZSC](https://finance.yahoo.com/quote/ozsc)\n\n##### Dropped after GME:\n[RYCEY](https://finance.yahoo.com/quote/rycey)\n\n*[GCGX](https://finance.yahoo.com/quote/gcgx)\n\n*[HTZGQ](https://finance.yahoo.com/quote/htzgq)\n\n##### Low Share Price After High Volatility Ending in 2015-2018:\n*[BBRW](https://finance.yahoo.com/quote/bbrw)\n\n*[RBNW](https://finance.yahoo.com/quote/rbnw)\n\n*[MYDX](https://finance.yahoo.com/quote/mydx)\n\n*[ARSN](https://finance.yahoo.com/quote/arsn)\n\n*[BLUU](https://finance.yahoo.com/quote/bluu)\n\n*[GRLT](https://finance.yahoo.com/quote/grlt)\n\n*[MSTO](https://finance.yahoo.com/quote/msto)\n\n*[CFGX](https://finance.yahoo.com/quote/cfgx)\n\n*[TWOH](https://finance.yahoo.com/quote/twoh)\n\n*[WSGF](https://finance.yahoo.com/quote/wsgf)\n\n*[BLSP](https://finance.yahoo.com/quote/blsp)\n\n\n\n### Speculation:\n\nOther stocks have traded closely to GME on NYSE and NASDAQ, and have been covered by other DD. They include Invesco, Koss, etc. Bucket Short and others go into this very well.\n\nWhy are all these biotech and energy companies on OTC trading so closely with GME? I believe it is due to these interest rate derivatives being actively traded on the OTC market, and there are sure to be more if someone digs past the top 20.\n\nThis is what Dr Burry was talking about when he [tweeted](https://preview.redd.it/r9cnzt4sdc371.png?width=960&format=png&auto=webp&s=b2e08f32a36128bf71dc67a2a538ae9a6c0fb276) the correlation between SAVA and GME. These Institutions are trading IRDs with assets on different markets entirely, swapping risk from companies like GameStop with cheap OTC stocks with floats in the high billions, providing vast amounts of liquidity for these options.\n\n\n#######START EDIT:\nI think [this](https://theotcspace.com/content/ladder-option) is specifically what he refers to when he says \"building stair cases and knocking castles down.\n\nIf Citadel purchased a tailor made OTC derivative created that was similar mechanism to this, but in a short position, this would have a chain of losses moving step-wise (hence the stairs) to the insolvency of the company (knocking castles down).\n#######END EDIT\n\n\nRetail kicked down the door on this back-room poker game, but can't turn the lights on to see what's really going on. The players are scrambling and trying to get their cash off the table before the roof blows the fuck off, but time is running out. The entangled web of derivative liabilities risks the security of the entire global financial market. The United States is only a small portion of the international market on OTC derivatives.\n\nIn the tables below, one can see that total notional exposures is often far higher in Euro traded markets. This could explain how institutions are using their international branches to write off some of these risky positions, trading \"forwards\" (the OTC equivalent of futures) and other tailor-made derivatives.\n\nI'll even take it a step further and assert that they may not even know what their true exposure is on these positions, only knowing that it is \"incredibly fucking high.\" The inner workings of these algorithms are oft known by a literal handful of people (sometimes under five), and they perform countless transactions faster than you can spell GameStop.  \n  \nIn a way, we're all like frogs in a pot, unable to notice that the water is about to boil until it's too late.\n\n\n\n# Appendix\n\n[Figure 1](https://i.imgur.com/IrPPsxg.png)^6\n\n[Figure 2](https://i.imgur.com/aHNPNUc.png)^10\n\n[Figure 3](https://i.imgur.com/5y8N4g6.png)^10\n\n[Figure 4](https://i.imgur.com/NPNz71g.png)^10\n\n[Figure 5](https://i.imgur.com/QEZzalw.png)^10\n\n[Figure 6](https://i.imgur.com/E1BL8q1.png)^10\n\n[Table 1](https://i.imgur.com/CCEvMea.png)^6\n\n[Table 2](https://i.imgur.com/oteQchN.png)^11\n\n# Works Cited\n^1 https://www.businessinsider.com/bubble-derivatives-otc-2010-5\n\n^2 https://www.eajournals.org/wp-content/uploads/The-Role-of-Over-The-Counter-OTC-Derivatives-in-Global-Financial-Crisis-and-Corporate-Failures-in-Recent-Times-and-Its-Regulatory-Impacts.pdf\n\n^3 https://www.statista.com/statistics/268750/global-gross-domestic-product-gdp/\n\n^4 https://www.cftc.gov/sites/default/files/opa/press98/opamntn.htm\n\n^5 https://archive.nytimes.com/screenshots/www.nytimes.com/interactive/2008/10/01/business/20081002-crisis-graphic.jpg\n\n^6 https://www.bis.org/publ/otc_hy0905.pdf\n\n^7 https://en.wikipedia.org/wiki/European_Market_Infrastructure_Regulation\n\n^8 https://www.dtcc.com/dtcc-connection/articles/2020/august/12/addressing-sftrs-challenges-with-tools-to-transform-the-trade-reporting-process\n\n^9 https://www.dtcc.com/repository-and-derivatives-services/repository-services\n\n^10 https://www.isda.org/a/ZGNTE/Key-Trends-in-the-Size-and-Composition-of-OTC-Derivatives-Markets-in-the-First-Half-of-2020.pdf\n\n^11 https://www.sec.gov/data/foiadocsfailsdatahtm",
    "title": "On OTC Derivatives: GME and the Global Market Implosion",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovjxnx/on_otc_derivatives_gme_and_the_global_market/"
}