{
    "author": "rensole",
    "created_utc": 1615285064.0,
    "distinguished": null,
    "edited": 1615303535.0,
    "id": "m13lxb",
    "text_only": true,
    "flair_id": "1ef349aa-584b-11eb-816c-0e7f12300557",
    "flair_text": "News",
    "name": "t3_m13lxb",
    "num_comments": 1226,
    "permalink": "/r/GME/comments/m13lxb/synopsis_for_03092021_what_we_need_to_know_before/",
    "score": 6757,
    "selftext": "Good morning San Diago,\n\nI am Rensole,\n\nI Love the smell of Crayons in the morning!\n\n&#x200B;\n\nhttps://preview.redd.it/jknl2ymt0zl61.png?width=680&format=png&auto=webp&s=634f1a2515f239effbfc6c8c18c292cb377cdff0\n\nThis is not financial advice as it's all just my opinion, don't invest on my thoughts invest because of your own research.\n\n&#x200B;\n\n# This is not the squeeze\n\nSo after market close I've seen a lot of people saying \\*OMG ITS HERE\\*\n\nDudes chill, this isn't even a mini squeeze, we are talking about a squeeze when it hits above 10k and then it depends on where people want to get out. I know my bottom price has changed over time to be at around a 100k minimum, hell maybe even more.\n\nAs was prophesized by Domo and RC himself, they said that GME would naturally find a way to 1000 usd per share. what happened yesterday was nothing more than the market reacting to the news that RC is now officially heading the \"digital evolution\" of GameStop.\n\nit was not a squeeze, just a market reaction.\n\nJust like last time the price can go up rapidly by people fomo'ing in etc.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/ig2l4g202zl61.jpg?width=487&format=pjpg&auto=webp&s=242d2cf53d377f3789a96c4a2ec89afa6db31aa2\n\n&#x200B;\n\n# Automod\n\nwe know there are some issues with automod right now, making it so that new people can't create threads, we are currently looking into it and looking into making the current post time requirement (3 months) to be less.\n\nWe are aware of the issues and trying to fix this, please give us some time to do so.\n\nas we do have to walk a fine line between letting new members in and let everyone post but also keep all the bots and shills out.\n\n(protip: messaging me or the other mods threatening us really doesn't help you or us).\n\n&#x200B;\n\nAutomod should now allow everyone to post with an account with a minimum age of 30 days.\n\nThis is so that the new people can still post, but it keeps most of the bot's and shills out.\n\nHope this all works now!\n\n&#x200B;\n\n# The lord has spoken, all praise the lord.\n\n&#x200B;\n\nhttps://preview.redd.it/qlgjvvcr8zl61.png?width=960&format=png&auto=webp&s=64f389595a4fb581e30ea73dd69cd87ad398254b\n\nmotherfucker has balls of steel, you see that? he has 40 million and he's still going, why? because he knows just like us where this is going, UP.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/n7s8vf123zl61.jpg?width=711&format=pjpg&auto=webp&s=f2b580477cc1a1ed030d370b25fdcd3fa329008c\n\n&#x200B;\n\n# Media Blackout.\n\nAs some more astute apes have seen yesterday.... no news on GME?\n\nok that's weird, they've been saying GmE B@d for weeks now, now its in the green... \\*Crickets\\*\n\nWhat makes this more funny is that Jimmy Cramer has gone full blackout, this dude was having multiple tantrums on twitter per day and bitching about GME on \"mad money\" the entire time.\n\nBut now it seems that Jim Cramer's show \"mod money\" wont be on this week, and his twitter has gone black, this in combination with nobody else reporting on the entire thing makes me believe we may be facing a media blackout, this in order to make sure that not more people buy in.\n\n&#x200B;\n\nWord of mouth is one of the most valuable things right now.\n\nyesterdays news, nothing on GME?\n\n[https://www.cnbc.com/2021/03/08/discovery-amc-networks-heavily-shorted-huge-2021-gainers.html](https://www.cnbc.com/2021/03/08/discovery-amc-networks-heavily-shorted-huge-2021-gainers.html)\n\n&#x200B;\n\n&#x200B;\n\n[this is here to show a stock can go high, not saying this will happen or this was due to a squeeze, this was due to a reverse stock split.](https://preview.redd.it/b4e3sz4i4zl61.jpg?width=1080&format=pjpg&auto=webp&s=7fc39f25227339cce01518cb471c719926b6f76a)\n\n# Can we reach X price?\n\nYes.\n\nit all depends on a few factors.\n\n1. the shorts need to cover at some point\n2. if you're the only ones left with the stocks you set your price.\n3. but it isn't.... stfu retard it's possible look at the picture, it's possible, it wont be within 1 day, but it's possible none the less.\n4. But if you look at xxx stock, no this is a very special and specific situation, this will never happen again and this is a once in a lifetime shot.\n5. should I buy at X price, I'm not going to say when you should buy, but the best time was yesterday, but if you missed that if you want in now is the best moment.\n\n&#x200B;\n\nhttps://preview.redd.it/2qw2zux65zl61.jpg?width=640&format=pjpg&auto=webp&s=45a9a83355144b5e271d6c5fd5d98ba5a6149f81\n\n# Let's play BINGO!\n\nI saw this yesterday and realized and thought yeah we see this a lot lets cover these all.\n\nQ: Melvin already covered.\n\nA: no they shifted their shorts to ETFS which we found within a day.\n\n&#x200B;\n\nQ: But the market will crash\n\nA: cool but that has nothing to do with us seriously\n\n&#x200B;\n\nQ:Jim cramer deployed\n\nA: it seems Cramer is off the gameboard for now\n\n&#x200B;\n\nQ: convince me to buy in\n\nA: no, I don't have to convince you, I convinced myself and thats what's needed if you don't believe in this then don't get in\n\n&#x200B;\n\nQ:Cites analyst rating\n\nA: ok cool thanks for giving me more Data to go off of.\n\n&#x200B;\n\nQ: Sell and buy back in the dip\n\nA: who says this is a dip? this may as well be the start of the rocket, and daytrading negatively affects the stocks rise so I wont be doing that. (FYI I could've cashed out at 480 and didn't because I know this is pennies on the dollar)\n\n&#x200B;\n\nQ: DTCC wont let that happen\n\nA: yeah... the DTCC just covered their own ass this weekend making sure they can force people like melvin to forced close their positions and pay the DTCC in case this shit hits the fan.\n\n&#x200B;\n\nQ: I'm selling at (insert low like <10k)\n\nA: you are actually retarded huh, never go full retard.\n\n&#x200B;\n\nQ: Brick and mortar\n\nA: RC leading a digital revitalization of the company right now, so that proves it's more than just Brick and Mortar.\n\n&#x200B;\n\nQ: Hedgefunds can wait you out\n\nA: no they can't, it's costing them a lot of money being this short every day, it's costing us nothing as we've already paid for our stocks and we own them.\n\n&#x200B;\n\nQ: Retailers have no power on wall street\n\nA: Then why did they try so hard to stop us multiple times? if I were faced in a fight with someone I couldn't beat, I wouldn't try to stop them I'd try everything I could to get them to fold before I got the first punch.\n\n&#x200B;\n\nQ: It will never reach XXX$\n\nA: yeah they told us 400 was impossible, they said it would go into the high thousands if they didn't stop it, this is a waiting game. be patient and you will win.\n\n&#x200B;\n\nhttps://preview.redd.it/jaq2tbkt7zl61.jpg?width=828&format=pjpg&auto=webp&s=e1033592b076c4afc3f225492eb7e876a158a9f9\n\n# Now is the time to gain control of your emotions.\n\nSeriously I get it 200 is an awesome number, less then 2 weeks ago we where at 40, but if your goal is 100.000 K then 200 a share is nothing.\n\nAdjust your expectations and adjust your way of looking at big numbers, because if you hold like a lot of people said, then it will take some days before it gets to 100k , and if you don't adjust your baseline then you will fold early.\n\n10.000 sounds like a lot right? but if I told you you could get a salary of 100.000k its nothing.\n\n100.000 sounds like a lot, but compared to 500.000 its a lowball offer.\n\nITS OK TO BE GREEDY! but be patient.\n\nTrust the other apes, they have held for a long time (over a month) and they didn't fold.\n\nSo trust them now when you are winning.\n\n&#x200B;\n\n[a guy telling papa DFV that his investment was bad just a week ago](https://preview.redd.it/30actf4j8zl61.jpg?width=960&format=pjpg&auto=webp&s=bad3e094439b249405c5a4a3b1b1e95da0fa18e0)\n\n&#x200B;\n\n# Technical analysis\n\n[https://www.reddit.com/r/GME/comments/m0ob9u/technicals\\_show\\_gme\\_is\\_going\\_much\\_higher\\_analysis/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/GME/comments/m0ob9u/technicals_show_gme_is_going_much_higher_analysis/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\nGive it a read.\n\n&#x200B;\n\n# Twitter\n\nso DFV tweeted this:\n\n&#x200B;\n\nhttps://preview.redd.it/3o87poxb9zl61.jpg?width=960&format=pjpg&auto=webp&s=5289f0fc41ac28ccd0eb658ea45dff379ff1fcec\n\nHe doesn't let anything here be by coincidence, 69 coins 420 lives.powerup next to Gamestop logo (meaning it will be bigger?)\n\nand 0508790 sooooo 508.790.00 ? sounds like my new floor.\n\nmario was wearing a frog suit and handing the soft serve icecream to the king.\n\n&#x200B;\n\nBut later in the day after this was tweeted, Gamestop also Tweeted.\n\nhttps://preview.redd.it/mez764xm9zl61.jpg?width=960&format=pjpg&auto=webp&s=33b768e32b631c085ec807266a8df48a3674ab40\n\nout of all the things they refer it is super mario, they may be trying to say something.\n\n&#x200B;\n\nAlso March 10th Is Mario day, Mar10\n\n&#x200B;\n\n[yeet](https://preview.redd.it/lxfedqit9zl61.jpg?width=659&format=pjpg&auto=webp&s=af2f403083e45891317a6d9de48ac966c6455683)\n\nRemember we are seeing the price go up now, it can also go down. They will try everything to get people to paperhand, just ignore it and set price alerts it wont get interesting until it reaches the 10k mark.\n\n&#x200B;\n\nSo as always none of this is financial advice, it's all speculation by an actual retard.\n\n&#x200B;\n\nhttps://preview.redd.it/nvrdc7iz9zl61.jpg?width=400&format=pjpg&auto=webp&s=f5a3294a0b273b3ebd03e9213e0ac7fef03cc262\n\n&#x200B;\n\nagain if I've missed anything I'll add it in here.\n\nAnd yes we are working on the automod chill we'll try to get this bastard back up and running correctly soon.\n\n&#x200B;\n\nEdit 1:\n\n# Todays Senate hearing:\n\nDATE:   Tuesday, March 9, 2021\n\nTIME:  10:00 AM\n\n[https://www.banking.senate.gov/hearings/who-wins-on-wall-street-gamestop-robinhood-and-the-state-of-retail-investing](https://www.banking.senate.gov/hearings/who-wins-on-wall-street-gamestop-robinhood-and-the-state-of-retail-investing)\n\n&#x200B;\n\nThis may affect GME a lot, I'll be sure to be looking at this live.\n\n&#x200B;\n\nEdit 2:\n\nGreat post about managing behavior with these type of things, I honestly think it's a good read for everyone in GME\n\n[https://www.reddit.com/r/GME/comments/lzxbzm/be\\_adamant\\_some\\_reminders\\_for\\_managing\\_behavior/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/GME/comments/lzxbzm/be_adamant_some_reminders_for_managing_behavior/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\nEdit 3:\n\n# New Shill tactic\n\nOk so I noticed something in the comments today, people asking weird shit like this on mass\n\n    Ok can someone please explain how we dont care if the market crashes? \n    And even if mathematically 500k per share are likely, where will this insane \n    amount of money come from? \n    There is no way the hedgies have this much money. \n    If this flaw in the system causes a crash, who will pay us?\n\n&#x200B;\n\nlet me be very simple about this, if you sell a share the broker and clearinghouses pay you.\n\nNOT the HF.\n\nThis in itself will not cause a crash of the markets, to crash a market a lot of things need to go wrong, not just one stock shooting up.\n\nHow is the 500k per share able to exist? no clue how is Berkshire Hathaway able to be 350k?\n\nit is unknown how high this will go, if you dont understand this do your own DD and **RESEARCH**.\n\n&#x200B;\n\nEdit 4:\n\n#  DFV tweeted!\n\n[https://twitter.com/TheRoaringKitty/status/1369307339568873473](https://twitter.com/TheRoaringKitty/status/1369307339568873473)",
    "title": "Synopsis for 03-09-2021 what we need to know before the market opens DD",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/m13lxb/synopsis_for_03092021_what_we_need_to_know_before/"
}