{
    "author": "InkedEnigma",
    "created_utc": 1617084101.0,
    "distinguished": null,
    "edited": 1617086960.0,
    "id": "mg99gz",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_mg99gz",
    "num_comments": 113,
    "permalink": "/r/GME/comments/mg99gz/finished_reading_the_entire_rule_from_nsccdtcc/",
    "score": 822,
    "selftext": "But then  something magic happened.. one after the other, each person said Holy shit, fuck me running, no fucking way, etc after reading the same thing and coming to this conclusion. (Redacted due to speculation). The NSCC is actually required to liquidate it's entire holdings, if necessary to cover every single position that still exist after liquidating the assets of the firms responsible. Yes. Let that simmer. The DTCC established a plan for liquidating everything allocated to the NSCC and outlines the entire process of the steps the NSCC will take to maintain critical roles until they have to undergo bankruptcy and transfer all responsibility to another party who will takeover the entire role of clearing transactions.. So the takeaway is they planned with the expectations of liquidation of NSCC if required.. Go google the net worth of the NSCC  and lose your shit. I already have. Farewell comrades. I'm going to pray for them to get a quick death, financially speaking.\n\nHere's the text from the document.\n\nSection 17A(b)(3)(F) of the Act requires, in part, that the rules of NSCC be \r\ndesigned to promote the prompt and accurate clearance and settlement of securities \r\ntransactions.42\r\n The Recovery Plan serves to promote the prompt and accurate clearance \r\nand settlement of securities transactions by providing NSCC with a roadmap for actions \r\nit may employ to mitigate losses, and monitor and, as needed, stabilize NSCC’s financial \r\ncondition, which would allow it to continue its critical clearance and settlement services \r\nin stress situations. The Recovery Plan is designed to identify the actions and tools \r\nNSCC may use to address and minimize losses to both NSCC and its membership and \r\nprovide NSCC’s management and the Board with guidance in this regard by identifying \r\nthe indicators and governance around the use and application of such tools to enable \r\nthem to address stress situations in a manner most appropriate for the circumstances. \r\nFurther, the Wind-down Plan establishes a framework for the transfer and orderly wind-\r\ndown of NSCC’s business. It establishes clear mechanisms for the transfer of NSCC’s \r\ncritical services and membership, and for the treatment of open, guaranteed CNS \r\ntransactions in the event of NSCC’s default. By doing so, the Wind-down Plan is \r\ndesigned to facilitate the continuity of NSCC’s critical services and enable Members and \r\nLimited Members to maintain access to NSCC’s services through the transfer of its \nmbership in the event NSCC defaults or the Wind-down Plan is triggered by the \r\nBoard.\r\nAs described above, the proposed rule change would update the R&W Plan to \r\n(i) reflect business and product developments, (ii) make certain clarifications, \r\n(iii) remove provisions covering certain “business-as-usual” actions, and (iv) make \r\ncertain technical corrections. By helping to ensure that the R&W Plan reflects current \r\nbusiness and product developments, and providing additional clarity regarding the \r\nframework for the transfer and orderly wind-down of NSCC’s business, NSCC believes \r\nthat the proposed rule change would help it continue to maintain the Plan in a manner \r\nthat supports the continuity of NSCC’s critical services and enables its Members and \r\nLimited Members to maintain access to NSCC’s services through the transfer of its \r\nmembership in the event NSCC defaults or the Wind-down Plan is ever triggered by the \r\nBoard. Further, by facilitating the continuity of its critical clearance and settlement \r\nservices, NSCC believes the Plan and the proposed rule change would continue to \r\npromote the prompt and accurate clearance and settlement of securities transactions. \r\nTherefore, NSCC believes the proposed amendments to the R&W Plan are consistent \r\nwith the requirements of Section 17A(b)(3)(F) of the Act.\n\n\nStarts around pages 26 and 27 for those\n asking",
    "title": "Finished reading the entire Rule from NSCC/DTCC, that SEC approved. This shit is going to blow minds. Wet beds. Shit pants. And dry mouths. I read this with a few different people to get some cliff notes for you...",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/GME/comments/mg99gz/finished_reading_the_entire_rule_from_nsccdtcc/"
}