{
    "author": "A_world_in_need",
    "created_utc": 1617114944.0,
    "distinguished": null,
    "edited": 1617168109.0,
    "id": "mghg41",
    "text_only": true,
    "flair_id": "9fbcfdc2-6e37-11eb-85cc-0e08408b7fc7",
    "flair_text": "💎🙌",
    "name": "t3_mghg41",
    "num_comments": 536,
    "permalink": "/r/GME/comments/mghg41/in_the_coming_days_gme_is_going_to_rocket_to_8k_a/",
    "score": 6071,
    "selftext": "Not financial advice. \n\nYou have an opportunity to change the trajectory of your bloodline for centuries. This will be the greatest transfer of wealth in the history of the world and all you have to do hold.  \n\nEdit: ape no fight ape. \n\nImmediately after snorting lines of burnt sienna this morning I felt inspired to post.  I picked an arbitrary number between what’s it worth now and $1,000,000 and landed on 8k+ (see that +?) because I have seen a lot of people hop on this train who are don’t have a lot of money by their own admission who are going to be tempted to sell at $8k, $10k, $50k on its way to $1,000,000.  \n\nComing days could be any time in the future\n\nI trust the DD AND I LOVE ALL OF YOU. \n\n💎👋🦍🦍🦍🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nEdit #2 hey I made a bunch of people mad. I’m sorry I was only thinking that we gotta pass quite a few big dollars on the way to a million and trust me I know what it’s like to get a large lump sum of money the very first time. If youve never gotten a bonus or settlement of like even $20k you cannot imagine how good it feels that first time. Be ready. It will be tempting. \n\nI trust the DD. I’ve been obsessed since Jan. I’m in. I’m confident that all signs point to lift off. I have faith in your lumpy brains. I believe. I’m in this fight to win. \n\nApes we are going to blow right past large sums of money that a lot you have never experienced. It will be tempting when the rocket ignites. Be strong.  Trust in each other. This isn’t finiciacal advice. Hell I can’t even spell financial without spellcheck. I am 100% holding until this mother moons at $1,000,000 a share. Period. I will sell if it hits $10,000,000 for sure. But not I’m not selling until it hits a million and comes down. Diamond hands. We’re going close on these clowns.  It’s going to be amazing \n\nOh shit $25 [The simulation has been confirmed. ](https://www.reddit.com/r/GME/comments/mgryec/true_value_of_a_gme_share_update_25m_per_share/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) \n\n💎👋👋🦍🦍🦍🦍🚀🚀🚀🚀",
    "title": "In the coming days $GME is going to rocket 🚀 to $8k+ a share. For a lot of you, the temptation to sell will be great. Resist. IF YOU COMMIT TO $1,000,000/ share and you will receive it. It’s that simple.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/GME/comments/mghg41/in_the_coming_days_gme_is_going_to_rocket_to_8k_a/"
}