{
    "author": "Parsnip",
    "created_utc": 1625032501.0,
    "distinguished": null,
    "edited": 1625040004.0,
    "id": "oaquw9",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_oaquw9",
    "num_comments": 259,
    "permalink": "/r/Superstonk/comments/oaquw9/diamantenhände_german_market_is_open/",
    "score": 3435,
    "selftext": "Guten Tag to all of you Great Apes across the world! 👋🦍\n\nYesterday the German markets led with a surprisingly strong push to $219! Diamantenhände HODLed strong, leading to ridiculously low volume and another sideways day. Reverse-repos set a new record - with them usually rising in the last week of a quarter, we may see the first trillion-dollar day soon. Banks have boosted dividends in a move very similar to what they did ahead of the 2008 crash, and another brokerage platform has given a peek behind the curtains. Let's see where the German markets take us on the last day of June! Join apes around the world to watch low-frequency updates from a single German exchange as we prepare for the US pre-market to open!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟥 120 minutes in: **$210.13 / 176,38 €**\r\n- 🟥 115 minutes in: $213.35 / 179,07 €\r\n- 🟥 110 minutes in: $214.16 / 179,75 €\r\n- 🟩 105 minutes in: $214.18 / 179,78 €\r\n- ⬜ 100 minutes in: $212.16 / 178,07 €\r\n- 🟩 95 minutes in: $212.16 / 178,07 €\r\n- 🟩 90 minutes in: $212.13 / 178,05 €\r\n- 🟩 85 minutes in: $211.59 / 177,60 €\r\n- 🟩 80 minutes in: $210.97 / 177,07 €\r\n- 🟥 75 minutes in: $209.39 / 175,75 €\r\n- 🟥 70 minutes in: $209.42 / 175,78 €\r\n- 🟥 65 minutes in: $209.81 / 176,10 €\r\n- 🟥 60 minutes in: $210.61 / 176,78 €\r\n- 🟩 55 minutes in: $210.85 / 176,97 €\r\n- ⬜ 50 minutes in: $210.82 / 176,95 €\r\n- 🟩 45 minutes in: $210.82 / 176,95 €\r\n- 🟥 40 minutes in: $210.76 / 176,90 €\r\n- 🟩 35 minutes in: $210.82 / 176,95 €\r\n- ⬜ 30 minutes in: $210.76 / 176,90 €\r\n- 🟥 25 minutes in: $210.76 / 176,90 €\r\n- 🟩 20 minutes in: $210.79 / 176,93 €\r\n- 🟥 15 minutes in: $210.67 / 176,82 €\r\n- 🟥 10 minutes in: $210.76 / 176,90 €\r\n- 🟥 5 minutes in: $210.79 / 176,93 €\r\n- 🟩 0 minutes in: $210.91 / 177,03 €\r\n- 🟥 US close price: $210.88 / 177,00 €   *($210.50 / 176,68 € after-hours)*\r\n\n\n***\nFAQ: To generate this data, I'm capturing current prices in Euros at https://www.ls-tc.de/de/aktie/gamestop-aktie and converting to USD. Today's EUR -> USD conversion ratio is 1.1914052. I created a simple C# application that assists me in scraping this data and updates the post automatically.\n\nToday I am testing an alternate method of fetching data, using quote data from Yahoo Finance APIs to calculate an average of 7 German exchanges and volume. Those results will be posted in the comment section.\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Over the weekend, DerGurkenraspler appears to have deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oaquw9/diamantenhände_german_market_is_open/"
}