{
    "author": "Arkayb33",
    "created_utc": 1625086164.0,
    "distinguished": null,
    "edited": false,
    "id": "ob68wi",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_ob68wi",
    "num_comments": 227,
    "permalink": "/r/Superstonk/comments/ob68wi/find_a_lawyer_they_say_great_do_you_just_call/",
    "score": 3062,
    "selftext": "There's been lots of advice since January about \"lawyering up\" after MOASS. Sadly, you can't just dial 1-800-lawyers and ask the answering service to connect you to a...money(?) attorney. So I spoke to my uncle who is a district judge in the great state of...well, one of the great states in these United States. International apes, this might still apply, but your kilometrage may vary.\n\nAnyway, I asked him, hypothetically if someone were to win a bunch of money in the lottery, like a hundred million or so, what kind of attorney should they get? He replied with some helpful ideas I wanted to share because it's not like you just walk into a law office and say \"I'd like 1 lawyer, please!\"\n\nHe said to get a tax attorney who is also a CPA that can provide estate planning. A large firm should also be able to provide the following services and may be of interest to the \"newly wealthy\"\n\n*  Wealth management\n* Estate management\n* Tax planning\n* Multi-generational trusts\n* Wills\n* Living trusts \n* Asset protection\n* Charities\n* Private foundations\n\nThis helped me narrow down what to look for and where. And something I didn't know, attorneys are licensed by state, so don't think you need to fly to New York or LA to get a \"national\" attorney. The bigger firms in your state's largest cities should have all of this available. Also, don't gift money or assets (stocks, cars, etc) worth more than $15k per recipient per year or else you'll have to deal with the IRS over gift tax. Set up a trust for this kind of stuff if you want to take care of/help out family and friends.",
    "title": "\"Find a lawyer\" they say. Great, do you just call 1-800-lawyers?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ob68wi/find_a_lawyer_they_say_great_do_you_just_call/"
}