{
    "author": "Legio-V-Alaudae",
    "created_utc": 1624588280.0,
    "distinguished": null,
    "edited": 1624623491.0,
    "id": "o7ek0q",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o7ek0q",
    "num_comments": 267,
    "permalink": "/r/Superstonk/comments/o7ek0q/a_lot_of_apes_are_forgetting_about_the_details_of/",
    "score": 2696,
    "selftext": "Ok everybody. There's a shit ton of impatience going on here lately.  \"We demand Papa Cohen launch this bitch into space now! Arggjhghghhggh!\"\n\nImpatient apes. Did you guys read the offer letter to the CEO? It's in investor relations under SEC filings. He is awarded $16,500,000 shares based on the average closing price of gme in June. Launching the rocket now wouldn't be very cash money to the bloke that just moved to Texas from Australia. \n\nLook, I desperately want to see the light at the end of the tunnel and quit worrying about money and just spend time with my family.  \n\nDid anyone here read the most recent perspectus that was released? It specifically lays out how a non-cash dividend is possible.   \n\nThat said, let's think out loud together. The NFT token launches July 14th. Nasdaq rules require at least 10 days notice of a dividend. It's called the declaration  date. \n\nLet's count backwards 10 from 14, we get 4. Imagine the fireworks if the declaration is dropped after hours on the 3rd?  Holy shit batman!  What a holiday weekend that would be! \n\n\n*edit* according to u/1gnik \n\n\nIt's just 10 calendar days. Since the market is closed on the 5th, that would be one less trading day to cover, while playing by the rules.\n\nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://listingcenter.nasdaq.com/assets/rulebook/nasdaq/rules/Issuer_Alert_2008-002.pdf&ved=2ahUKEwj6z8fdgLLxAhVcIDQIHVJhCwYQFjABegQIBBAG&usg=AOvVaw3R-I9lPe0UlMK3vRgSt3k\n\n\n\nClearly, I'm just some idiot on the internet and if it doesn't happen on thetime line I just laidout, I'll just hodl and buy more as I can. \n\nBottom line: We believe in Ryan Cohen and his team to transform gamestop into a tech company. Let's give them the opportunity without being a bunch of whiney bitches for another week or two.",
    "title": "A lot of apes are forgetting about the details of Mr. Furlong's shares",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7ek0q/a_lot_of_apes_are_forgetting_about_the_details_of/"
}