{
    "author": "Horror_Ad_3140",
    "created_utc": 1624541362.0,
    "distinguished": null,
    "edited": 1624577763.0,
    "id": "o70w7z",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o70w7z",
    "num_comments": 906,
    "permalink": "/r/Superstonk/comments/o70w7z/beware_of_uncle_bruce_he_either_does_not_know/",
    "score": 5886,
    "selftext": "Reasons why I think Uncle Bruce is likely to be a shill.\n\n\\- He endorses Jim Cramer.  \n\\- Earlier today, Uncle Bruce was trying to convince his viewers to write GME call options at $500-$600.   \n\\- Months back he was preaching about how GME's price could explode as margin calls take place.  \n\\- He has restricted comments to paid members only so there is no way to warn his viewers.  \n\\- He is constantly trying to convince his viewers to buy lesser known SPACs.  \n\\- He constantly says that GameStop should release more and more share's into the market whether or not it damages the MOASS.  \n\\- His background story makes no sense.\n\nIt was hard for me to write this as I generally don't like to publicly question peoples character but this dude is visible and it would be a shame for new apes to miss out or be mislead because of poor advice. Us seasoned apes already know to be very weary of these YouTube actors.\n\n\\----------------------------------------------------------------------------------------------------------\n\nEDIT:  Thank you for all of the upvotes and awards. Even though I know similar has been discussed before without much coverage, I wanted to make sure that any new apes who stumble across Bruce (or any other YouTube actor) receives the necessary warning as it looks like we are fast approaching the MOASS.",
    "title": "BEWARE OF UNCLE BRUCE - HE EITHER DOES NOT KNOW WHAT A MOASS IS OR IS A SHILL",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/o70w7z/beware_of_uncle_bruce_he_either_does_not_know/"
}