{
    "author": "Ok_Entrepreneur_5833",
    "created_utc": 1624561233.0,
    "distinguished": null,
    "edited": 1624581752.0,
    "id": "o77jm5",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o77jm5",
    "num_comments": 1015,
    "permalink": "/r/Superstonk/comments/o77jm5/i_had_a_thought_it_really_hurt_but_what_if_i_told/",
    "score": 10585,
    "selftext": "Although the market was open, the SEC was not open.  It took me a minute to find this;\n\n[https://www.reddit.com/r/Superstonk/comments/nksg03/t21\\_ftd\\_cycle\\_may\\_2526th\\_if\\_we\\_can\\_break\\_through/](https://www.reddit.com/r/Superstonk/comments/nksg03/t21_ftd_cycle_may_2526th_if_we_can_break_through/)\n\nWhere the distinction was made between \"Calendar Days\" and \"Trading Days\".  Full read if you want to understand all that, I won't bother trying to shorten it to a TLDR.  Did I mention it hurts when I think?\n\nThere is a holiday chart on that post and a pretty deep dive into the associations with holidays as they relate to T+21 FTD delivery.\n\nSo I want to put this out there for anyone that can use their brain without reaching for the bag of frozen bananas to put on their head.\n\nAs per FINRA 7140 rule;\n\n>**(3) Automatic Lock-in**Any trade that remains open (i.e. unmatched or unaccepted) at the end of its entry day will be carried over for continued comparison and reconciliation. The System will automatically lock in and submit to DTCC as such any carried-over T to **T+21** (calendar day) trade if it remains open as of 2:30 p.m. on the next business day. The System will carry over any T+22 (calendar day) or older \"as/of\" trade that remains open, but such trade will not be subject to the automatic lock-in process.\n\nSo my question really is, did the new Juneteenth Federal Holiday move the goalpost up +1 or nah because of the lock in date.\n\nKeep in mind I'm just as willing to have this debunked as I am to have it...umm...bunked?  And I don't mind being called a tinfoil hat person at all.  I'd sell that hat on Etsy if I had one and buy a fractional share with it anyway.\n\nEDIT\\*  Here's a great follow-up from u/ShipwreckDD! \n\n[https://www.reddit.com/r/Superstonk/comments/o79c4i/t21\\_is\\_tomorrow\\_i\\_do\\_believe/](https://www.reddit.com/r/Superstonk/comments/o79c4i/t21_is_tomorrow_i_do_believe/)\n\n Thanks everyone for taking the time to further look into this!",
    "title": "I had a thought, it really hurt! But what if I told you that Juneteenth was a Federal Holiday this year on the books and it may have moved the FTD cycle up +1 day?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/o77jm5/i_had_a_thought_it_really_hurt_but_what_if_i_told/"
}