{
    "author": "halflistic_",
    "created_utc": 1624533087.0,
    "distinguished": null,
    "edited": 1624580922.0,
    "id": "o6yqkp",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o6yqkp",
    "num_comments": 71,
    "permalink": "/r/Superstonk/comments/o6yqkp/idiosyncratic_risk_its_better_than_you_think/",
    "score": 1669,
    "selftext": "I’ve been seeing a few posts about the recent language in the RH law suit that points out that a certain security (stock) has “idiosyncratic” character. In other words, there is a stock with idiosyncratic risk. \n\nMany of you are looking up the general definition of idiosyncrasy, which will give you a general idea of what this means…but if you really want to J them T’s, look into the specific definition of idiosyncratic securities/stocks. \n\nOne particularly interesting point made on good ol Wiki, states, “According to one macroeconomic model including a financial sector,[6] hedging idiosyncratic risk can be self-defeating as it leads to higher systemic risk, as it takes on more leverage. This makes the system less stable. Thus, while securitisation in principle reduces the costs of idiosyncratic shocks it ends up amplifying systemic risks in equilibrium.”\n\nDo you get this? MM are principally forced to hedge against short positions they take. So, if a certain security, cough cough, which has been shorted beyond imagination, cough cough, has idiosyncratic risk…AND if the MM are securing themselves agains the idiosyncratic shock…this ends up amplifying systemic risk. You know what stock price is based on? …systemic risk. \n\nLook it up. I’ll wait. Then J your T’s and meet me on the moon whenever all this decides to comply with the laws of economic physics. T+ whenever is coming…\n\nEdit: systematic * (aka aggregate) risk rather. \n\nAnother interesting point made is that systematic risk is invervesly related to a securities beta value. \n\n“An important concept for evaluating an asset's exposure to systematic risk is beta. Since beta indicates the degree to which an asset's return is correlated with broader market outcomes, it is simply an indicator of an asset's vulnerability to systematic risk. Hence, the capital asset pricing model (CAPM) directly ties an asset's equilibrium price to its exposure to systematic risk.”",
    "title": "Idiosyncratic risk. It’s better than you think",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6yqkp/idiosyncratic_risk_its_better_than_you_think/"
}