{
    "author": "Kintsugi2",
    "created_utc": 1624469454.0,
    "distinguished": null,
    "edited": 1624469793.0,
    "id": "o6hplw",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_o6hplw",
    "num_comments": 35,
    "permalink": "/r/Superstonk/comments/o6hplw/what_does_the_fannie_mae_freddie_mac_ruling_mean/",
    "score": 550,
    "selftext": "**This is just a short post. It's not complete - but to inform those who are reading these other posts assuming things. I can do a deeper explanation in the future and expand on the topics if it's of interest. For now, hopefully what I typed below will suffice.** \n\nEntities like Fannie Mae (FNMA) are GSEs (Government Sponsored Enterprise). They are quasi-government entities meant to enhance the flow of credit. After the housing market crash in 2008, the government had to bail out these entities to ensure the mortgage backed securities in their portfolio wouldn't collapse ENTIRELY. By bailing out these entities, they expected to be paid back for it. Up until 2012, FNMA was once again on the brink of bankruptcy as the money the government demanded was more than their net income. FNMA was also delisted from the exchange and instead traded OTC (Over the Counter)\n\nAfter 2012, the government decided that instead of requiring a certain amount to be paid to them, they would ask that ALL NET INCOME be paid to them, essentially making it so FNMA would no longer be at risk of bankruptcy. This opened up investors to buy FNMA again as it was relisted and their hopes they'd be able to participate in future net income dividends gained traction. It's been a bet that hasn't paid off in nearly 10 years - the current FHFA (Federal Housing Finance Agency) was once deemed to be making strides in freeing itself from the obligation to pay net income to the government, and instead to shareholders. However, the Supreme Court ruled that the current makeup is unconstitutional. Biden has the right to appoint a new head of FHFA and the net income will not be paid to investors - subject to other lower court rulings.\n\nThis means that there is no reason to invest in FNMA because you have no call to the equity or income of the company. It's only priced higher because of speculation that it will, in the future, change to benefit investors.\n\nTHIS ALL MEANS THAT THE GOVERNMENT IS NOT RELINQUISHING CONTROL OF FNMA ETC. It's a gain for progressive ideology and a blow to conservative beliefs of privatization. The people complaining about this are investors and those who wanted to privatize the secondary mortgage backed security market (which would lead to less regulation of these markets).\n\ntldr: As most things are in finance/economics, this is a simplified explanation of a much deeper story - There is a consolidation of these entities into the public sector, hurting the goal of privatization of these entities.",
    "title": "What Does The Fannie Mae, Freddie Mac Ruling Mean?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6hplw/what_does_the_fannie_mae_freddie_mac_ruling_mean/"
}