{
    "author": "catsinbranches",
    "created_utc": 1623434080.0,
    "distinguished": null,
    "edited": 1623501430.0,
    "id": "nxm1ju",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nxm1ju",
    "num_comments": 180,
    "permalink": "/r/Superstonk/comments/nxm1ju/holy_shit_i_think_i_found_something_really/",
    "score": 2246,
    "selftext": "Last night, I posted about my theory on the vote count total and how it has nothing to do with the float count. Some comments pointed out that my theory had a fundamental flaw, and they were absolutely right, and that's cool I can admit when I'm wrong, but the core of the issue remained.\n\n&#x200B;\n\nINSIDERS CAN VOTE. THEIR VOTES COUNT TOO. Saying that the vote count = the float count means that none of the insiders (Ryan Cohen, George Sherman, etc) voted any of their shares.\n\n&#x200B;\n\n\\---- Edit: apparently I wasn't clear enough here because there's some confusion. What I'm saying is that insiders can vote, so all those posts that are celebrating that the number of votes = the number of shares in the float are spreading some pretty fundamental misunderstandings. The float = total shares *minus* insider shares. You can bet Ryan Cohen and other insiders voted their shares... so the gap between max theoretical votes (70,771,778) and actual votes (55,541,279) is NOT because the votes were trimmed to match the float, but rather that float shares weren't voted, and below I talk about possible hedgie fuckery to make that happen so they could try to spread FUD among apes. The insider shares that were voted are included in that 55M votes. End of edit. ----\n\n&#x200B;\n\nIt's been bugging me, my theory was wrong, but I know I'm right about the insiders being able to vote and that the number of shares in the float nearly matching the vote count is irrelevant. u/Hiftee mentioned that the only thing that would really make sense is if a bunch of the big boys didn't vote their shares which got me thinking and googling, and I think I found something major.\n\n&#x200B;\n\nAbout a decade ago, the SEC started talking about investigating something they called **Empty Voting** ([source](https://www.institutionalinvestor.com/article/b150qg2zl5904b/sec-to-address-empty-voting)), which is essentially amassing voting power without actually exposing yourself financially, or greatly minimizing your financial stake in the company. There are a lot of different strategies in which this is used, but one in particular is called **Record Date Capture** which is describe as \"*borrowing shares in the share lending market for a limited period around the record date*\" or \"*an investor can buy shares just before the record date and sell them soon after*\" (quotes are from page 23 and page 26 of this massive 99 page [PDF](https://poseidon01.ssrn.com/delivery.php?ID=118071094081103011120087005021006120051002022033030034120117018109121072005102031106002028029055022035011114092089086113007026005095045051030001087090000117076095039015024082110089003001088127022083098120083005112100026086029075121108072075093021&EXT=pdf&INDEX=TRUE)).\n\n&#x200B;\n\nUsually Record Date Capture / Empty Voting are used to sway a shareholder election in a certain direction, but what if they just... Don't vote. Doesn't that seem like a great tactic for a FUD attack? Get a bunch of shares and then just... Don't vote. Create confusion. Make the apes think that there were fewer votes than shares and no over-voting. Plus, bonus, you have a bunch of ammo to sell off and drive down the price after the record date.\n\n&#x200B;\n\nAlright well, do we have any proof that this happened? I don't know. Maybe my tinfoil hat is just screwed on too tight. This is where I need some help from those of you with a lot of wrinkles. Below is what I've got so far, followed by some questions I can't answer.\n\n&#x200B;\n\nIn GameStop's Proxy details ([source](https://investor.gamestop.com/node/18846/html)), they listed some institutions with large amounts of voting shares, including\n\n&#x200B;\n\n|*Institution*|*Shares*|\n|:-|:-|\n|BlackRock, Inc.|9,217,335|\n|RC Ventures LLC|9,001,000|\n|The Vanguard Group|5,162,095|\n|Senvest Management, LLC|5,050,915|\n|Maverick Capital, Ltd.|4,658,607|\n|Susquehanna Fundamental Investments, LLC|4,409,467|\n|Dimensional Fund Advisors LP|3,934,919|\n\n&#x200B;\n\nAlright, and so what? I decided to compare that to some recent screenshots from a Bloomberg terminal ([source](https://www.reddit.com/r/DDintoGME/comments/nqvbv0/02062021_gme_bloomberg_terminal_information/)) to see what institutions were reporting as of 03/31/21 (the date up to which their most recent 13F filings would cover).\n\n&#x200B;\n\n[This is a screenshot from June 2nd 2021. Why is Susquehanna's File Date still from 12\\/31\\/20?](https://preview.redd.it/mius6y0mrn471.png?width=2854&format=png&auto=webp&s=efb26b67e40598b3a848ef1ceb2fb58e1116a6eb)\n\nA couple of things jump out here. Why aren't Senvest, Maverick, or Dimensional on this Bloomberg list? Why is Susquehanna's filing date still showing Q4 data, and why is it a different \"branch\" of Susquehanna? The terminal seems to indicate that Susquehanna International Group LLP hasn't filed their Q1'21 info, but fintel has their Q1'21 13F filings listed ([source](https://fintel.io/i13f/susquehanna-international-group-llp/2021-03-31-0)) and this is what it shows for GME:\n\n&#x200B;\n\n[As of 03\\/31\\/21, Sus International only has 146K shares](https://preview.redd.it/otrj7tc99o471.png?width=1762&format=png&auto=webp&s=6685d5e74cb09c9232c9fbaac18c176a7641563d)\n\n&#x200B;\n\nBloomberg had Sus International at 4.4M shares at the end of Q4'20, but their most recent 13F for Q1'21 (which they filed on 05/17/21 - [source](https://fintel.io/i13fs/susquehanna-international-group-llp) \\- so I don't get why it's not on the bloomberg terminal) shows them at 146K shares. Maybe they just transferred their shares to Susquehanna Fundamental Investment LLC? Well, here's what Sus Fundamental's Q1 13F ([source](https://fintel.io/i13f/susquehanna-fundamental-investments-llc/2021-03-31-0)) shows for GME:\n\n&#x200B;\n\n[Nada. Zip. Nothing. Zero shares of GME held by Sus Fundamental as of 03\\/31\\/21. They sold all of their previously held 79,701 shares of GME.](https://preview.redd.it/tlv91vyt9o471.png?width=1764&format=png&auto=webp&s=96187a40677073da646c55b93b922b7db0d4ae87)\n\n&#x200B;\n\nErrrrr... ok... so as of 03/31/21, Sus had nowhere near the number of shares that GameStop is reporting for them, so they must have re-obtained the exact same number of shares they had in Q4'20, under a different branch of Sus, sometime in the first 2 weeks of April? That's... fucking weird...\n\n&#x200B;\n\nLet's move on to those who were missing from the Bloomberg list but GameStop reported as having a large position.\n\n&#x200B;\n\nWe'll start with Senvest Management, LLC. Their Q1'21 13F ([source](https://fintel.io/i13f/senvest-management-llc/2021-03-31-0)) shows\n\n[As of 03\\/31\\/21, Senvest Management, LLC owned 0 shares. In Q4'20 they had owned the same number of shares as what they are reported by GameStop to have owned on 04\\/15\\/21.](https://preview.redd.it/20991fo6ao471.png?width=1760&format=png&auto=webp&s=91696e88bc3cdd64bacbe3f2871158e49dae7830)\n\n&#x200B;\n\nAlright... Them too??? What the fuck. **WHAT THE ACTUAL FUCK.**\n\n&#x200B;\n\nMaverick Capital, Ltd. 13F for Q1'21 ([source](https://fintel.io/i13f/maverick-capital/2021-03-31-0)):\n\n[Same shit. As of 03\\/31\\/21 they had zero shares of GME.](https://preview.redd.it/iw5gykcpao471.png?width=1762&format=png&auto=webp&s=da0d9084724b59b64e1dacb7e34d3b40992aa38d)\n\n&#x200B;\n\nDimensional Fund Advisors LP 13F for Q1'21 ([source](https://fintel.io/i13f/dimensional-fund-advisors-lp/2021-03-31-0)):\n\n[As of 03\\/31\\/21, Dimensional retained only a very small portion of its previously held shares.](https://preview.redd.it/lp0mdfi0bo471.png?width=1762&format=png&auto=webp&s=be2dc26e1d243f9e2e4cb74e29b04072b4e7edea)\n\n&#x200B;\n\nCombined, those 4 funds held 18M shares for voting. More than enough for the FUD campaign I mentioned above using Record Date Capture / Empty Voting.\n\n&#x200B;\n\nBut now, some important questions that I don't have enough wrinkles to answer. If there was over-voting but one or many of the specific entities called out by GameStop on their proxy document didn't vote, would they need to trim votes to \"make space\" for the votes of the institutions whose votes are missing? Is there any connection between these funds? Is it common for institutions to sell off their entire position and then a quarter later buy back in at exactly the same number of shares?\n\n&#x200B;\n\nAs a comparison, here's BlackRock, Inc's Q1'21 13F details ([source](https://fintel.io/i13f/blackrock/2021-03-31-0)) for GME:\n\n[BlackRock has a very minor change in GME ownership from Q4'20 to Q1'21](https://preview.redd.it/xqdazd9zbo471.png?width=1762&format=png&auto=webp&s=60c9d94a87cb17c7bc0cf1381e02935d3644dcfc)\n\n&#x200B;\n\nSo... yeah, I need some wrinkle brains to help and peer review this please! Is this something? Is this nothing? Paging u/criand u/HomeDepotHank69 u/atobitt u/jsmar18 u/rensole u/bye_triangle if any of you can take a look, it would be greatly appreciated!\n\n&#x200B;\n\nEdit: to clarify, I'm not suggesting that the hedgies actually prevented over-voting in any way, just that they wanted to cause FUD and panic among apes by making it LOOK that way. They knew how hyped everyone was for the vote count. If the FUD tactic I described above was actually used, that would imply that EVERY SINGLE OTHER SHARE was voted (and probably way more than that, but trimmed down). We know that not all retail shares were actually able to vote due to broker limitations, so there must have been over-voting by retail to still manage to need to be trimmed down (as is implied by Larry Cheng's mismatched vote total, which likely occurred due to rounding adjustments while the vote count was trimmed down).\n\nAlso, great top-up from u/greysweatseveryday :\n\n>If Computershare would correct any over-voting, it would do it on a shareholder-by-shareholder basis (not just remove all of the excess votes to get to the maximum). If Computershare knows that 15 million shares held by certain institutions have not voted (and have not assigned their voting rights to any other person to be voted by proxy or otherwise), then those 15 million shares will not be represented in the vote.\n\n&#x200B;\n\nEdit 2: u/Bit-corn pointed out that:\n\n>[The SEC](https://www.sec.gov/divisions/investment/13ffaq.htm) states that filers of Form 13-F should report securities that they own and have loaned to a third party.  \n>  \n>Question #42 in the link above  \n>  \n>Now, whether or not that is enforced…🤷‍♂️\n\nSo in theory, even if the institutions I mentioned above had loaned out all their shares, they should still include those shares in their 13F forms and it would not show them reducing / selling off their position.\n\n&#x200B;\n\nEdit 3: another question to address based on all the discussion below... If GameStop's proxy data shows a vote count that is \"stale\" because the Q1'21 13Fs hadn't been filed yet and they use that info rather than being able to get an accurate count of shareholders on April 15... what happens to all those shares that are no longer ACTUALLY held on April 15 (as shown in the 13Fs? Does the vote count still need to keep those vote spots \"empty / unvoted\" since they were reported as shareholders of record in the proxy? ---- Edit to the edit: if they're using the Q4'20 13F data since the Q1'21 data wasn't available yet, how did they end up with the wrong branch of Susquehanna on the list?. End of edit to the edit ----",
    "title": "HOLY SHIT. I think I found something REALLY IMPORTANT about the votes, but I need some wrinkle brain support to put all the pieces together.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/nxm1ju/holy_shit_i_think_i_found_something_really/"
}