{
    "author": "Kidette",
    "created_utc": 1617462451.0,
    "distinguished": null,
    "edited": 1617492842.0,
    "id": "mjaasi",
    "text_only": true,
    "flair_text": "Shitpost 🎱",
    "name": "t3_mjaasi",
    "num_comments": 200,
    "permalink": "/r/GME/comments/mjaasi/my_mom_has_been_living_out_of_her_car_for_the/",
    "score": 4079,
    "selftext": "My mother and father divorced when I was born, after she found out he was cheating on her. After they left my fate up to the flip of a coin (seriously), my mom packed our things and moved to the states with me. I've only known life with her.\n\nMy mom has SEVERE paranoid personality disorder. I'll give some examples of how bad it had gotten when I was nearing the end of high school. Whenever she went to the grocery store, she wouldn't tell me which one she was going to because she thought I was notifying the employees so that they could put up new signs with higher prices before she got there. When our cats scratched at her closed door while we were sleeping, she thought it was me getting up in the middle of the night and doing it to keep her awake. When my cat came home with scratches on her face (I urged my mom not to let our cats out, but she always insisted they were sad being stuck inside - she let them out one day when I wasn't there), she thought that a \"bad guy\" had cut her face up on purpose to make her upset. She has never been able to hold a job for more than a month and has never felt safe living in one place for more than a year. At her worst, she quit nursing school after two weeks (yes, she paid thousands of dollars in tuition) because she thought the teacher was giving her mean looks.. The list goes on, but for the sake of time, I'll stop there. You get my point. Her PPD was serious.\n\nOn the day of my 18th birthday, I came home to an empty house. When I finally got in contact with my mom, she told me she couldn't trust me anymore. That she knew I had turned into \"one of the bad guys\". No matter what I said to her, she was not coming back. I know what you're thinking. Why didn't I get her help or call the police? I had. I called the police and nothing was done because she assured them that she was completely fine and that I was just being a defiant teenager. I tried multiple times to get her free medical help (we didn't have money so I couldn't afford to hire a therapist), but she either turned it away or it just made her PPD even worse. And honestly, at a certain point, I stopped trying because I just didn't think anyone could help her and anything I did would only exacerbate her paranoia.\n\nAfter she moved from room to room, studio to studio on her own for a couple years, she decided the only way she would finally be content was by living out of her small sedan. Where she didn't have to be around people, she could move locations freely, and she could save whatever money she had left in her savings account. She's been living in her car for approximately 3 years now.\n\nBecause of the sudden shift at age 18, I had given up the idea of going to college and had no choice but to work 3 jobs to support myself. I eventually got my own apartment and was doing alright so I would have gladly taken her in at any point or given her some money had I been able to contact her, but I knew she wouldn't accept my help anyway.\n\nI never held any resentment toward my mom because I knew it was her mental sickness controlling her actions. So when she called me out of the blue a few years later, I welcomed whatever conversation she wanted to have. She ended up telling me that she put me in her will many years ago and asked me to come see her so I could take it from her. This concerned me at the time, but she assured me that she wasn't going to do anything, just that I should keep it in case anything did happen to her. But the thought of having her will in my possession keeps me concerned she's going to run out of money and do something unspeakable and I'll never hear from her again.\n\nI was shocked when I saw her. She had shaved her head, lost at least 40 pounds (she was already skinny before we separated), and smelled like.. well someone who hadn't taken a shower in a long time. I found out later that day that she was taking showers, but only by dumping gallons of water over herself in the privacy of her storage unit. I was heartbroken.\n\nWe still talk sometimes. Maybe twice a year. I know she's still suspicious of me being \"one of the bad guys\" so she tries to keep the catching up to a minimum and she usually keeps her phone off as to not waste battery, but whenever I leave her a voicemail and she hears it, she usually calls me back to let me know she's okay. I try to see her at least once during Christmas or on her birthdays but 95% of the time, she declines my invitations. When I do get to see her, I try and provide her with as many necessities as possible, like canned foods and toilet paper.\n\nNo one is gonna see this, but the point of me posting this is so that I can look back at this moment, before my mom's life changed for the better. I can't express how happy I am to have found this community. It sounds stupid to say that I found solace in a subreddit, but you guys have truly given me so much hope. I know I'm not supposed to get too excited before anything comes to fruition and I also know I'm not supposed to put more money into this thing than I can afford, but my entire life savings is in Gamestop right now. I'm not one to waste my money or spend frivolously, as I know very well the value of a dollar having not grown up with much, but I truly believe in this. I have read all the amazing DDs and am confident and excited in going to the moon with all of you wonderful apes. I KNOW that this squeeze is going to happen. And when it does, the first thing I'm doing is getting my mom a house away from the city, a new car, a few million dollars to retire with, and two kitties (she loves cats and I know she misses our late cats).\n\n&#x200B;\n\nI thank you all for holding. 💎🙌\n\n&#x200B;\n\nEDIT: I really didn't expect this post to get so much attention! I appreciate you all for the awards and kind words. They've made my day.  \nI do feel like some of you may have overestimated how \"unstable\" my mom might be and want to clear a few things up. My mom is a good person. She's not a liar, she's not lazy, and she's not sketchy in any way. She's really good at saving money, same as me - so there's no need for me to worry she's gonna go spending all the money I give her on non-necessities. We're both givers (the type to fight over which one of us gets to pay the dinner bill for 15 minutes), so I already know she's gonna have a hard time taking all these things from me, but with enough encouragement, I believe she will accept them, especially after I tell her how it's just a portion of the millions I've made 😉 I do appreciate the concern, but outside of her trust issues, she's a warrior!",
    "title": "My mom has been living out of her car for the past 3 years. I can't wait to give her a house, a brand new car, and a few million dollars to retire with.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/mjaasi/my_mom_has_been_living_out_of_her_car_for_the/"
}