{
    "author": "draygon_media",
    "created_utc": 1620843188.0,
    "distinguished": null,
    "edited": 1620848485.0,
    "id": "navdxu",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_navdxu",
    "num_comments": 122,
    "permalink": "/r/Superstonk/comments/navdxu/infinite_loop_part_2_and_part_3/",
    "score": 1660,
    "selftext": "[The beast is growing!](https://preview.redd.it/om4eohkucqy61.png?width=1534&format=png&auto=webp&s=704017fd96e28f8e3e54d81cf7e14ca3b7c0c16a)\n\n**Thank you everyone for the love and support!!! I am so happy to see people are able to understand the mess we are seeing!!**\n\n&#x200B;\n\nThe Infinite Loop pt. 2 and 3!\n\n\\*The regular stuff: this is not financial advice, I am not an advisor, please take this with a grain of salt, research it more yourself… yadda yadda.. On to the good stuff\\*\n\nHere it is guys… most of part 2 and some of part 3!\n\n\\*If you have not read Part 1 here it is- [https://www.reddit.com/r/Superstonk/comments/n4j3zo/a\\_mind\\_map\\_to\\_help\\_follow\\_the\\_money/](https://www.reddit.com/r/Superstonk/comments/n4j3zo/a_mind_map_to_help_follow_the_money/)\n\n\\*\\*LINK TO THE MAP\\*\\* [http://go.bubbl.us/b7f901/25d0?/The-Loop](http://go.bubbl.us/b7f901/25d0?/The-Loop)\n\nTLDR: Bearish Side is pretty difficult to find! I put in what I could of Citadel, and people really don’t seem to want to do much with them! Housing Bubble is growing… take a look! Other than that.. you know the drill! Reading holds the key to the map! (Starting to feel like Charlie… “Who is Pepe Silvia?”)\n\nAs I said previously, this is an ongoing mind map, and the more I research and dig around, the more will be added to this!\n\nLet’s dive in!\n\nThe good news:\n\nI have been able to lock down Citadel, and where they are at in the map. I have found quite a few institutions have 13F filings for Citadel, but no one actually wants to have any ownership of them. So far Wells Fargo, JP Morgan and Bank of America are the ones that are taking a chance on them ( at least from what I have found..). I have also found the 17 broker/dealers that utilize APEX Clearing as their clearinghouse! Interestingly enough, Robinhood does not fall on this list. I will be adding the other broker/dealers and their clearing houses soon.\n\nSome of the names that stuck out to me are M1 finance, Webull, WealthSimple, Ally, and Firstrade\n\nI have not completed the ones who have a PFOF with Citadel, but it’s coming. (I am only 1 person).\n\nIf you cruise on up to the purple/red bubbles you will see that Citadel has not only shares bought in Vanguard and Blackrock, but they have also decided to place options on them as well. Doing what hedgies do best, I guess.\n\nMoving on up to the north side of Citadel’s bubble, we see 1 13 D/A filing (there are more, but not relevant to this…). I found that they have a little bit of control ownership in Susquehanna! The same one that is up with our good friend GAMESTOP!\n\nCitadel is truly the only one I could pin down to being at the center of the mess going on, and the other hedge funds do not have any major link to them.\n\nTHIS IS A GOOD THING!\n\nThe more I tried to find the bearish side against AMC and GME, the more I found that they had even MORE backing on the bullish side.\n\nAt the very top, where my random banks were, we see Charles Schwab has 1.23 Million shares of Gamestop and 1.77 Million shares of AMC. They also have 13F filings for Vanguard and BlackRock. Moving over to the left I found that Bank of America had 13 G/A filings from Berkshire Hathaway (a whopping 1.032 BILLION Shares), Vanguard, and BlackRock. BofA also had investments in BlackRock and Vanguard (along with Citadel and Point72). There are others, but this map would NEVER end.\n\nDeutsche Bank had a 13 D/A filing from BlackRock and had a 13F filing for Citadel.\n\nFrom what I kept seeing, MOST of the banking institutions have some form of investment into Citadel! Concerning? Not really… Because the almost all that has been invested is so tiny that the banks may only feel a slight pinprick from their investment, in the event Citadel ceases to exist.\n\nThe powerhouses are proving to be on the right side of history this time, which is good for economic purposes.\n\nOr are they?\n\nPart 3.\n\nIf you notice, there are two new bubbles coming from Vanguard: Invesco and BlackStone.\n\nWe know Invesco Kenna… But who is BlackStone?\n\nI am SO happy you have asked that question! Let’s head down to the Housing Bubble that is forming.\n\nI am so thankful for my husband for helping to piece a lot of this together! His background? He is a realtor himself and enjoys tracking the market! He started noticing some dangerous trends within the market itself and wanted to dig more into it! He started this research a couple months ago and found that we are gearing towards ANOTHER 08 situation.\n\nPeople are taking out more subprime mortgages recently, and the fascinating thing is… that it is for rentals! Rental homes have a little more leniency on borrowing since it is for income, and the big investment institutions figured that out. BlackStone SOLD the FIRST single family rental securitization in 2013 for $479 Million!\n\nI Could do an ENTIRE write up, but my husband did an EXCELLENT job dictating his points ON the map… So, I will leave you be for a moment to follow the chart!\n\nThe only Key you need for that section:\n\nSubprime Mortgages:\n\nGreen- STILL AVAILABLE (one way or another, it could be tricky… but there are lenders for these)\n\nRed- NO LONGER AVAILABLE\n\n\\-\n\n\\-\n\n\\-\n\nWelcome Back!! Hope you found that interesting!\n\nThe last thing for this DD is the Housing Insurance Bubble!\n\nA few months ago, we saw whispers of notable names from the ‘08 era looking into a bubble revolving around homeowner’s insurance. The idea was that Climate Change affected zip codes would see an increase in their premium costs. In turn, the monthly cost would be substantially higher than what the owner originally agreed upon. Between the pandemic, and people normally taking out the max they can borrow, their shoestring budget becomes even thinner! Therefore, while interest on the mortgages were low, people in areas where fires, hurricanes, floods and/or tornados occur would see their payments fluctuate drastically! The unfortunate side effect will be people being unable to make their payments, and we could see more people being foreclosed on!\n\nIf you will go to the bubble just south of the CDO/BTO web, you will find my area where I am starting to gather article and will be posting stats for updating purposes!\n\nPlease note: ALL OF THIS APPLIES to commercial real estate as well as residential!\n\n\\------------------------------------------------------------------------------\n\nThank you for taking the time to read through everything and follow along! As far as I can see we are heading towards something pretty incredible… and history books will talk about this for centuries!\n\nBe kind to one another!\n\nLastly… TO. THE. MOON!!",
    "title": "Infinite Loop Part 2 and Part 3",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/navdxu/infinite_loop_part_2_and_part_3/"
}