{
    "author": "hell-mitc",
    "created_utc": 1620873032.0,
    "distinguished": null,
    "edited": 1620902872.0,
    "id": "nb6ayd",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nb6ayd",
    "num_comments": 49,
    "permalink": "/r/Superstonk/comments/nb6ayd/theory_that_citadel_susquehanna_are_internalizing/",
    "score": 1076,
    "selftext": "Ok, I guess it isn't really a theory. I've kind of proved it here. But didn't want to come off too strong.\n\nI'm going to try to touch on a few things here that might seem unlinked at first, but a lot more is occurring behind the scenes. Because I get the feeling GME has become the battle ground for more than just bankruptcy and naked shorts.\n\nI am creating a hypothesis that we are watching a battle for data and who gets to control the flow of orders in the overall market.\n\nThere are several major players at this time:\n\n* NYSE (Technically the Intercontinental Exchange).\n* NASDAQ (The first electronic fund, is overseen by FINRA, and stands for National Association of Securities Dealers Automated Quotation).\n* DTCC (More so sees the flow of data and operates in a clearing capacity, and a consolidation capacity to help assist disputes of data \\[OTCs would play a big role in this\\]).\n* The banks (Large institutional banks) are most definitely the major drivers at this point regarding what is occurring in the market.\n\nIn my last post, I got into something I did not fully understand thinking I was on the right track, and a couple guys managed to call me out (which I appreciate because it led me down the path of derivatives and lending, and how we are watching GME get manipulated daily). \n\nI've come across a nice web of how everything has been functioning (competing maybe?), I have tied Citadel to the bankruptcy of Sears through a major REIT company, and something we have all been neglecting the whole time which leads to how we can connect Suspecthanna to Citadel. This also connects to our borrows and returns. Every. Single. Day. \n\n&#x200B;\n\nhttps://preview.redd.it/m42li74kosy61.png?width=786&format=png&auto=webp&s=19d0664d11fea309841c4424a8b12aeb03e64c99\n\nRemember this scene from The Big Short when they are pumped that they’re going to get an ISDA membership (International Swaps and Derivatives Association)? And they don’t even know what you need to get an ISDA because they're just so horny for one? I’m pretty sure this has been us for the last few months. And I am going to tie this back to an ISDA and ISLA eventually.\n\n&#x200B;\n\nhttps://preview.redd.it/h7htk16rosy61.png?width=491&format=png&auto=webp&s=14a428b5a0e6134710366279f3b614302a5004ba\n\nNot FUD and you'll see why, I think there is just so much information that we are all coming up with hypotheses that are actually correct (more or less). I am sure (through my own confirmation bias) that this is going to happen, and the moon is actually mad that is hasn’t in this case. Anyway, here we go, some more fucked up info that leads to a nice pyramid scheme (I actually want to submit the below meme for the contest, I call it Madoff’s Hierarchy of Pyramid Schemes \\[personally I think it’s like, a tier 4 meme between the Maslow reference, Madoff ponzi/pyramid scheme, what’s going on with GME and our own self-fulfilling need to be right, and of course how billionaires having a 4th yacht is more important to us psychologically while we work our asses off than our own skills providing for ourselves\\]). \n\n&#x200B;\n\nhttps://preview.redd.it/wo5kmpswosy61.png?width=442&format=png&auto=webp&s=8acdfedb83a3b777f46bef83b64b99365df7dd8f\n\nSo. In reading about derivatives, regulations, everything else we are dealing with through citadel and friends, I just kind of started clicking to get a handle on where we are and how we got here; what I found is fucked.\n\nI think the first thing we need to understand is that derivatives have only really been trading since 1970. We are still in uncharted territory. And as we saw in today’s AMA, the HISTORY (thanks for asking the question attobit\\[I don’t want to tag him I am sure his tags are blown the fuck up and they'll tag this inconclusive until they can read all my references\\]) of shorts is them *not having to cover* ([https://www.reddit.com/r/Superstonk/comments/nazyz3/shorts\\_must\\_cover/](https://www.reddit.com/r/Superstonk/comments/nazyz3/shorts_must_cover/)). At this point, we are under the assumption that they HAVE to cover – and they should, this is a **free, fair market, equal for all, baring no poorer or billionaire**.\n\nNow, here is the web and I hope you guys can follow or point out where I am off. Because I think we are losing sight of the fact that if they don’t (for some financial fuckery or this continues to drag on), this goes to a systemic issue, and I want to make sure we have an understanding of how we can call them out – because they will fuck with our tendies if they need to.\n\nFirst off, I think this has a more than with options than anything else. Options began on the Chicago Board of Options Exchange (CBOE) and the Chicago Mercantile Exchange (CME); competing entities for options on stocks (Options, Futures and Other Derivatives, 5thEd, John Hull \\[[https://fac.ksu.edu.sa/sites/default/files/options\\_futures\\_and\\_other\\_derivatives\\_5th\\_ed.pdf](https://fac.ksu.edu.sa/sites/default/files/options_futures_and_other_derivatives_5th_ed.pdf)\\]). Just a side note, READ THIS FUCKING BOOK. I am still working on it but there is so much info.\n\nSo let’s start by looking at when a company goes public, how they want to do it. NYSE vs NASDAQ. \n\nNASDAQ is typically tech, bio, etc. companies looking to increase their growth. The NASDAQ tiers their exchanges and has cheaper fees to list. The NYSE typically carries our fave blue chip stonks. Value, going to keep innovating, buying up smaller entities to increase their own IP. So where is the real difference? \n\nNASDAQ is new. The name itself kind of shows that. National Association of Securities Dealers Automated Quotation. Doesn’t have a physical floor. FINRA oversees their regulations. Basically what you might consider a free and fair market. Not that NYSE isn’t. Their regulations helped form FINRA ([https://www.investopedia.com/articles/basics/03/103103.asp](https://www.investopedia.com/articles/basics/03/103103.asp)).\n\nNYSE is old school. From the Buttonwood Agreement. 1792. Almost as old as the US itself. Kind of speaks to the generational stocks that would file with them.\n\nNow comes the real difference. How their trade desks work.\n\nNASDAQ operates as a Dealers Market. “A dealer market is a transparent financial market mechanism in which multiple dealers post the prices they are willing to buy or sell a specific security.” \n\n* This would imply that when one of us (depending on our broker) sets a price, that price needs to find someone to buy at. The Bid/Ask spread would be cheaper potentially depending on how many brokers it is sourced from\n* NASDAQ uses 260 market making firms ([https://www.investopedia.com/articles/basics/03/103103.asp](https://www.investopedia.com/articles/basics/03/103103.asp))\n\nNYSE uses an auction method where the market participants set the price. \n\n* The NYSE uses specific **Designated Market Makers** that maintain the status quo, as they are they main human contacts for selling/buying securities. They provide liquidity and assist the NYSE in daily business\n* The NYSE participants are as follows ([https://www.nyse.com/markets/liquidity-programs](https://www.nyse.com/markets/liquidity-programs)):\n\n· **Approved NYSE Supplemental Liquidity Providing (SLP-PROP) Firms**\n\n1. HRT Financial LLC\n\n2. IMC Chicago LLC\n\n3. Latour Trading, LLC\n\n4. Tradebot Systems, Inc.\n\n5. Virtu Financial BD LLC\n\n· **Approved NYSE Supplemental Liquidity Providing (SLMM) Firms**\n\n1. Citadel Securities LLC\n\n2. Goldman, Sachs & Company\n\n3. Virtu Americas LLC\n\n· **Other Liquidity Sources**\n\n* There is another link ([https://www.nyse.com/market-model](https://www.nyse.com/market-model)) but I don’t see how it lists their other liquidity providers\n\nOdd that the NASDAQ uses 260 and NYSE uses 7. But here is the next point.\n\nThe NYSE uses two Classes of Market Participants:\n\nRetail Member Organizations (RMOs) who are eligible to submit certain retail order flow (Retail Orders) that is eligible for price improvement.\n\nRetail Liquidity Providers (RLPs) who provide price improvement for Retail Orders in the form of non-displayed interest priced better than the best PBBO. RLPs received economic benefits in exchange for meeting performance obligations. RLPs that miss obligations do not receive enhanced economics. The Exchanges have the right to revoke RLP status. \n\nMy favorite part of this is the “price improvement for Retail Orders” because they definitely have our best interest at heart after all this. \n\nAnyway. Let’s chat about the NYSE a bit more and a free and fair market. Because I said before, I thought that this was a competition for who gets to be the better data whore. \n\nSo in 2018 the NYSE attempted to source recommendations to remove their FINRA overseer. As a Self Regulating Organization that pretty much wrote the rules on overseeing their own books, why wouldn’t you want to lose your daddy who keeps bugging you about enforcement issues? ([https://www.legayelaw.com/nyse-finra-membership-requirement/](https://www.legayelaw.com/nyse-finra-membership-requirement/) & [https://www.sec.gov/rules/sro/nyse/2018/34-83740.pdf](https://www.sec.gov/rules/sro/nyse/2018/34-83740.pdf)) \n\nThey legit filed to change the rules. And by the Level Two data from [https://www.level2stockquotes.com/market-makers-list.html](https://www.level2stockquotes.com/market-makers-list.html), they succeeded as the NYSE is not listed as a FINRA participant. So as of now, the NYSE operates as an SRO, no oversight except if the SEC has a whistleblower, and Citadel is one of their liquidity partners. Haha ok, anyway nothing to see here, lets look at FINRA rules & Guidance for the NYSE. What’s that you say? There are no rules or guidance?\n\n· [https://www.finra.org/rules-guidance/rulebooks/incorporated-nyse-rules](https://www.finra.org/rules-guidance/rulebooks/incorporated-nyse-rules)\n\n* I keep running into a loop of rules and guidance on this site. Let me know if anything is different for you.\n\nLets look into ISDAs now. Because this kind of sums up a couple things, but isn’t the be-all-end all. And my own eyes are glazing over so I want to get through this.\n\nAn “ISDA fosters safe and efficient derivatives markets to facilitate effective risk management for all users of derivative products.” Who might be a member of these communities? NASDAQ Oslo (Associate member), ICE (Associate member), all the major banks are primary members. Who isn’t? The NYSE. Citadel is only a subscriber. Suspecthanna is a subscriber. Weird, but not a smoking gun. I want to come back to the ISLA membership after this because “Securities Lenders” also brings some interesting information.\n\nFor now, lets touch on the fact that I can connect Shitadel and Suspecthanna in another aspect, and how I can tie Citadel to the Sears bankruptcy, and how they are still trying to make money off that REIT (hint: Motley Fool is pumping articles out lol).\n\nIn 2016, Shitadel and Suspecthanna tried to sue CBOE, NASDAQ, International Securities, and NYSE (as market-makers). This was apparently for charging them for PFOF when they state that they didn’t have the right to ([https://www.sec.gov/litigation/opinions/2016/34-78340.pdf](https://www.sec.gov/litigation/opinions/2016/34-78340.pdf)). \n\n· This is actually a pretty straight forward brief, you don’t need to be a lawyer to read it – but this is the first time we can link Shitadel and Suspecthanna of being mad at the system. Note the timeline because it becomes important in the grand scheme of the hypothesis (2016).\n\nThe courts basically said they can’t award money because these are all SEC matters and not all administrative avenues had been exhausted. And it seems that the SEC doesn’t actually have parameters to financially compensate them anyway, because of the nature of the business. \n\nThe hypothesis starts here. Because it would line up with Citadel then starting to use Robinhood as their exchange (Robinhood popularity just started to skyrocket and go mainstream here). And this would mean they are internalizing EVERYTHING and betting against retail. Using their DMM status with NYSE to intake all the assets, then using Robinhood to bet against retail, while Kenny uses his risk tools to balance the books.\n\nThe only thing is, they got greedy like they did with Sears. Here is the connection to how they attempted to bankrupt retail stores before. \n\nIn 2015, Kenny became the owner of Surveyor Capital LTD ([https://www.sec.gov/edgar/search/#/dateRange=custom&ciks=0001588930&entityName=Surveyor%2520Capital%2520Ltd.%2520(CIK%25200001588930)&startdt=2015-05-01&enddt=2021-05-13](https://www.sec.gov/edgar/search/#/dateRange=custom&ciks=0001588930&entityName=Surveyor%2520Capital%2520Ltd.%2520(CIK%25200001588930)&startdt=2015-05-01&enddt=2021-05-13)). \n\nWhen 2016 started going, Surveyor Capital LTD owned >60% of **Seritage Growth Properties**. In the Sears Holdings scheme of things, Seritage seems to have been one of their main leaseholders. And has benefitted IMMENSELY from their bankruptcy (they just keep getting paid) – seriously, go look at their filings, the benefit of the bankruptcy has been massive.\n\nPart of my hypothesis leads me to conclude from this that retail stores became targets for their leaseholds (or the beneficial REITS) should they go bankrupt. What an easy way to keep getting paid if the empty outlet was just collecting money from bankruptcy. How does this relate to GME? What a bigger FUCK YOU than to build a 700,000 sq ft facility to house all your merchandise should your leasehold decide to up the rent in an unfair business practice (I actually emailed GME relations to see if I could get a copy of this but I am not holding my breathe lol). Should you get fucked over and you need to liquidate (like sears), why not just move all your stock to a warehouse and go full ecommerce? Anyway, speculation, but that’s how far along I am. \n\nSo, that is how the exchanges connect to shitadel and suspecthanna, how shitadel was part of bankrupting and ongoing downfall of Sears, and how GME could potentially say lmao fuck you fam should something similar be attempted.\n\nSo let us go back to the ISLA for a second. And this ties it all together (for me anyway in relation to the moass). The International Securities Lending Association (lol almost fucking perfect to what is going on).\n\nISLA is also a membership organization that keeps track of borrowing and lending of shares (and the respective ones that do it). Check the list out for yourself, and why I think Shitadel and Suspecthanna are trying to push FTDs through rewriting options into future naked calls, while constantly borrowing and selling stock short EVERY DAY on the NYSE.\n\n[https://www.islaemea.org/wp-content/uploads/2021/05/ISLA\\_Member\\_List\\_May2021.pdf](https://www.islaemea.org/wp-content/uploads/2021/05/ISLA_Member_List_May2021.pdf)\n\n&#x200B;\n\nhttps://preview.redd.it/0hrht4tfrsy61.png?width=720&format=png&auto=webp&s=0793e855e656944334472813f805159a8686112f\n\nhttps://preview.redd.it/3o5m54tfrsy61.png?width=766&format=png&auto=webp&s=949442ec97b30dc21986a136f7c88c1e52d0f867\n\nhttps://preview.redd.it/cygnh3tfrsy61.png?width=757&format=png&auto=webp&s=a5e15429187be5bc768c77aa0ad364832045d78e\n\nWe might be in for a long fight, but Kenny Boi got a lifetime achievement award, so I am curious if his risk management strat fell under the category of rewriting options constantly and tricking the exchanges with volume, price, shorts, etc. Oh, and how do theyre allowed to? Because SEC laws state it so. \n\n&#x200B;\n\nhttps://preview.redd.it/nu34dr2mrsy61.png?width=467&format=png&auto=webp&s=62e49cecbda2103640b175135b75e77fed916aec\n\nAnd OTCs work in a capacity against us. \n\n&#x200B;\n\nhttps://preview.redd.it/wsn4n9tnrsy61.png?width=1107&format=png&auto=webp&s=efbea001642bca467d9aa51338a8cf1af0b4718b\n\nThis is not attractive for us, only the large entities. We need to remember that all of these guys only knows what they have, and the others are hiding their cards. Only holding and voting can help us. If this GME doesn’t have enough votes to now to prove the float is manipulated, they will at the next one. \n\nCheers everyone, I hope we keep winning and can fuck these guys, they seem to deserve it. The rules are not in our favor, and people have bent them to their own for generations. It is our turn.\n\nHow I feel writing this:\n\n&#x200B;\n\nhttps://preview.redd.it/7agu707ursy61.png?width=493&format=png&auto=webp&s=b268622efad04560a0caed9a00e0311db8de12aa\n\nHow I feel reading this:\n\n&#x200B;\n\nhttps://preview.redd.it/zzvztquwrsy61.png?width=491&format=png&auto=webp&s=cc976a2d399772aee8e2cefa032596bf068852c5\n\nReferences:\n\n1. [https://fac.ksu.edu.sa/sites/default/files/options\\_futures\\_and\\_other\\_derivatives\\_5th\\_ed.pdf](https://fac.ksu.edu.sa/sites/default/files/options_futures_and_other_derivatives_5th_ed.pdf)\n2. [https://www.isda.org/membership/isda-members/](https://www.isda.org/membership/isda-members/)\n3. [https://www.nasdaq.com/solutions/european-commodities](https://www.nasdaq.com/solutions/european-commodities)\n4. [https://www.islaemea.org/our-members/](https://www.islaemea.org/our-members/)\n5. [https://www.islaemea.org/wp-content/uploads/2021/05/ISLA\\_Member\\_List\\_May2021.pdf](https://www.islaemea.org/wp-content/uploads/2021/05/ISLA_Member_List_May2021.pdf)\n6. [https://www.investopedia.com/terms/m/marketmaker.asp](https://www.investopedia.com/terms/m/marketmaker.asp)\n7. [https://www.level2stockquotes.com/market-makers-list.html](https://www.level2stockquotes.com/market-makers-list.html)\n8. [https://www.legayelaw.com/nyse-finra-membership-requirement/](https://www.legayelaw.com/nyse-finra-membership-requirement/)\n9. [https://www.sec.gov/rules/sro/nyse/2018/34-83740.pdf](https://www.sec.gov/rules/sro/nyse/2018/34-83740.pdf)\n10. [https://www.finra.org/rules-guidance/rulebooks/incorporated-nyse-rules](https://www.finra.org/rules-guidance/rulebooks/incorporated-nyse-rules)\n11. [https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/naked-call/](https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/naked-call/)\n12. [https://www.investopedia.com/terms/n/nyse.asp](https://www.investopedia.com/terms/n/nyse.asp)\n13. [https://www.nyse.com/markets/liquidity-programs](https://www.nyse.com/markets/liquidity-programs)\n14. [https://link.springer.com/chapter/10.1007/978-3-540-85711-2\\_21](https://link.springer.com/chapter/10.1007/978-3-540-85711-2_21)\n15. [https://i.redd.it/q4cythnt8jf61.jpg](https://i.redd.it/q4cythnt8jf61.jpg)\n16. [https://www.investopedia.com/articles/basics/03/103103.asp](https://www.investopedia.com/articles/basics/03/103103.asp)\n17. [https://www.sec.gov/litigation/apdocuments/3-17189-event-9.pdf](https://www.sec.gov/litigation/apdocuments/3-17189-event-9.pdf)\n18. [https://www.sec.gov/edgar/search/#/q=seritage&dateRange=custom&ciks=0001310067&entityName=SEARS%2520HOLDINGS%2520CORP%2520(SHLDQ)%2520(CIK%25200001310067)&startdt=2015-05-01&enddt=2021-05-13](https://www.sec.gov/edgar/search/#/q=seritage&dateRange=custom&ciks=0001310067&entityName=SEARS%2520HOLDINGS%2520CORP%2520(SHLDQ)%2520(CIK%25200001310067)&startdt=2015-05-01&enddt=2021-05-13)\n\nTLDR: Read the title.\n\nMods, let me know how you feel about this, I think it ties A LOT of our theories together, but if something is off, let me know (or anyone for that matter).",
    "title": "Theory that Citadel & Susquehanna are Internalizing Trades Through OTC, Borrowing & Lending Through Themselves to the NYSE.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nb6ayd/theory_that_citadel_susquehanna_are_internalizing/"
}