{
    "author": "pdwp90",
    "created_utc": 1616248013.0,
    "distinguished": null,
    "edited": false,
    "id": "m97df5",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m97df5",
    "num_comments": 36,
    "permalink": "/r/GME/comments/m97df5/disproving_claims_published_in_cnbc_using_data_on/",
    "score": 613,
    "selftext": "Yesterday, CNBC and Market Watch published [articles](https://www.cnbc.com/2021/03/19/stimulus-checks-unlikely-to-spur-another-gamestop-mania-says-bofa.html) on research concluding that we shouldn't expect people to use stimulus money to buy GameStop stock. One of the main justifications they gave for this conclusion was that “the number of recent conversations \\[on Reddit\\] including both GME and stimulus is low.”\n\nAs some of you know, I’ve been collecting data on WSB discussion for quite a while now, and can quantitatively show that to be false.\n\nI'll try to keep this brief, as I know attention spans here are short. Please don't hesitate to ask questions below.\n\nTo start with, here is a graph of the total number of comments in my data mentioning \"stimulus\" or \"stimmy\" over time:\n\n[Stimulus comments](https://preview.redd.it/zm345ypdt6o61.png?width=1730&format=png&auto=webp&s=82f0806559dc94b6269e1bc173d4c8080b8c810c)\n\nHere is a graph of the number of comments in my data that mention BOTH stimulus & GME over time:\n\n[Visualization](https://preview.redd.it/54s7birft6o61.png?width=1730&format=png&auto=webp&s=3370b81da07fef88f25ffa5181e4e2188c4ea34f)\n\nThe drop off at the end reflects the fact that it was 3:00pm as I am writing this and the day is only partially completed. One could argue that these numbers should be normalized based on the total of number of comments per day and, while I'd disagree, I'll include that graph below as well:\n\n[Visualization](https://preview.redd.it/g1roip7it6o61.png?width=1730&format=png&auto=webp&s=df9cefd4b36fea588e54ed9d1c599d5cb61a2c01)\n\nFrom both of these graphs I see no indication of the number of recent conversations including both GME and stimulus being low, as a matter of fact it has hit all time highs over the last few days Here's a chart of the top 5 days in which stimulus was mentioned the most in my data of WSB daily discussion.\n\n|**Day**|**Stimulus & GME mention count**|\n|:-|:-|\n|3/15/21|124|\n|3/14/21|103|\n|3/16/21|74|\n|3/13/21|69|\n|1/14/21|67|\n\nTo take it a step further, we can look at what % of comments mentioning different stocks also mention stimulus, as I did recently in the graphic below. A larger proportion of comments mentioning $GME on WSB also mention stimulus than for any other major meme stocks, save for $TSLA.\n\n[Table](https://preview.redd.it/7oxjt2ukt6o61.png?width=1072&format=png&auto=webp&s=f9a1d42a27108bbc1d90253bb36ab05a843d6e77)\n\nI don't know how the conclusion was reached that the number of recent conversations on reddit including GME and stimulus is low. Assuming that this is an honest mistake, I'd encourage BofA, Market Watch, CNBC, or any of the other parties involved to get better data. There are a lot of people out there who have started collecting data on WSB, but not many who do it well and with good intentions. I've been doing it for a while now, and I like to think I fit both those criteria which is why I feel qualified to write this post.\n\nNote:  I don’t have stake in $GME and don’t actively trade a portfolio, in order to avoid perceptions of bias in my analysis. This is not financial advice, or a recommendation to buy or sell any stock.",
    "title": "Disproving claims published in CNBC using data on Reddit discussion",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/m97df5/disproving_claims_published_in_cnbc_using_data_on/"
}