{
    "author": "VaseaPost",
    "created_utc": 1616260476.0,
    "distinguished": null,
    "edited": 1616284105.0,
    "id": "m9bfp0",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m9bfp0",
    "num_comments": 657,
    "permalink": "/r/GME/comments/m9bfp0/naked_short_selling_the_truth_is_much_worse_than/",
    "score": 8629,
    "selftext": "There is a massive threat to our capital markets, the free market in general, and fair dealings overall. And no, it’s not China. It’s a homegrown threat that everyone has been afraid to talk about. \n\nUntil now. \n\nThat fear has now turned into rage.\n\nHordes of new retail investors are banding together to take on Wall Street.  They are not willing to sit back and watch naked short sellers, funded by big banks, manipulate stocks, harm companies, and fleece shareholders. \n\nThe battle that launched this week over GameStop between retail investors and Wall Street-backed naked short sellers is the beginning of a war that could change everything.  \n\nIt’s a global problem, but it poses the greatest threat to Canadian capital markets, where naked short selling—the process of selling shares you don’t own, thereby creating counterfeit or ‘phantom’ shares—survives and remains under the regulatory radar because Broker-Dealers do not have to report failing trades until they exceed 10 days.  \n\nThis is an egregious act against capital markets, and it’s caused billions of dollars in damage. \n\nMake no mistake about the enormity of this threat: Both foreign and domestic schemers have attacked Canada in an effort to bring down the stock prices of its publicly listed companies. \n\nIn Canada alone, hundreds of billions of dollars have been vaporized from pension funds and regular, everyday Canadians because of this, according to Texas-based lawyer James W. Christian. Christian and his firm [Christian Smith & Jewell LLP](http://www.csj-law.com/index.html) are heavy hitters in litigation related to stock manipulation and have prosecuted over 20 cases involving naked short selling and spoofing in the last 20 years.  \n\n*“Hundreds of billions have been stolen from everyday Canadians and Americans and pension funds alike, and this has jeopardized the integrity of Canada’s capital markets and the integral process of capital creation for entrepreneurs and job creation for the economy,”* Christian told Oilprice.com.\n\n**The Dangerous Naked Short-Selling MO**\n\nIn order to \\[legally\\] sell a stock short, traders must first locate and secure a borrow against the shares they intend to sell. A broker who enters such a trade must have assurance that his client will make settlement.  \n\nWhile “long” sales mean the seller owns the stock, short sales can be either [“covered” or “naked”](https://www.mcmillan.ca/Short-Selling-in-Canada-Regulations-are-Weak-and-a-New-Path-Forward-is-Needed-to-Reduce?utm_source=Mondaq&utm_medium=syndication&utm_campaign=LinkedIn-integration). A *covered short* means that the short seller has already “borrowed” or has located or arranged to borrow the shares when the short sale is made. Whereas, a *naked short* means the short seller is selling shares it doesn’t own and has made no arrangements to buy. The seller cannot cover or “settle” in this instance, which means they are selling “ghost” or “phantom” shares that simply do not exist without their action.\n\nWhen you have the ability to sell an unlimited number of non-existent phantom shares in a publicly-traded company, you then have the power to destroy and manipulate the share price at your own will. \n\nAnd big banks and financial institutions are turning a blind eye to some of the accounts that routinely participate in these illegal transactions because of the large fees they collect from them. These institutions are actively facilitating the destruction of shareholder value in return for short term windfalls in the form of trading fees. They are a major part of the problem and are complicit in aiding these accounts to create counterfeit shares. \n\nThe funds behind this are hyper sophisticated and know all the rules and tricks needed to exploit the regulators to buy themselves time to cover their short positions. According to multiple accounts from traders, lawyers, and businesses who have become victims of the worst of the worst in this game, short-sellers sometimes manage to stay naked for months on end, in clear violation of even the most relaxed securities laws. \n\nThe short-sellers and funds who participate in this manipulation almost always finance undisclosed “short reports” which they research & prepare in advance, before paying well-known short-selling groups to publish and market their reports (often without any form of disclosure) to broad audiences in order to further push the stock down artificially. There’s no doubt that these reports are intended to create maximum fear amongst retail investors and to push them to sell their shares as quickly as possible. \n\nThat is market manipulation. Plain and simple. \n\nTheir MO is to short weak, vulnerable companies by putting out negative reports that drive down their share price as much as possible. This ensures that the shorted company in question no longer has the ability to obtain financing, putting them at the mercy of the same funds that were just shorting them. After cratering the shorted company's share price, the funds then start offering these companies financing usually through convertibles with a warrant attachment as a hedge (or potential future cover) against their short; and the companies take the offers because they have no choice left. Rinse and Repeat.\n\nIn addition to the foregoing madness, brokers are often complicit in these sorts of crimes through their booking of client shares as “long” when they are in fact “short”. This is where the practice moves from a regulatory gray area to conduct worthy of prison time.  \n\nNaked short selling was officially labeled illegal in the U.S. and Europe after the 2008/2009 financial crisis. \n\nMaking it illegal didn’t stop it from happening, however, because some of the more creative traders have discovered convenient gaps between paper and electronic trading systems, and they have taken advantage of those gaps to short stocks. \n\nStill, it gets even more sinister.  \n\nAccording to Christian, “global working groups” coordinate their attacks on specifically targeted companies in a “Mafia-like” strategy. \n\nJournalists are paid off, along with social media influencers and third-party research houses that are funded by what amounts to a conspiracy. Together, they collaborate to spread lies and negative narratives to destroy a stock. \n\nAt its most illegal, there is an insider-trading element that should enrage regulators. The MO is to infiltrate a company through disgruntled insiders or lawyers close to the company. These sources are used to obtain insider information that is then leaked to damage the company. \n\nOften, these illegal transactions involve paying off “informants”, journalists, influencers, and “researchers” are difficult to trace because they are made from offshore accounts that are shut down once the deed is done. \n\nLikewise, the “shorts” disguised as longs can be difficult to trace when the perpetrators have direct market access to trading systems. These trades are usually undetected until the trades fail or miss settlement.  At that point, the account will move the position to another broker-dealer and start the process all over again. \n\nThe collusion widens when brokers and financial institutions become complicit in purposefully mislabeling “shorts” as “longs”, sweeping the illegal transactions under the rug and off of regulatory radar. \n\n“Spoofing” and “layering” have also become pervasive techniques to avoid regulator attention. Spoofing, as the name suggests, involves short sellers creating fake selling pressure on their targeted stocks to drive prices lower. They accomplish this by submitting fake offerings in “layers” at different prices to create a mirage. \n\nFinally, these bad actors manage to skirt the settlement system, which is supposed to “clear” on what is called a [T+2 basis](https://www.investopedia.com/ask/answers/what-do-t1-t2-and-t3-mean/). That means that any failed trades must be bought or dealt with within 3 days. In other words, if you buy on Monday (your “T” or transaction day), it has to be settled by Wednesday. \n\nUnfortunately, Canadian regulators have a hard time keeping up with this system, and failed trades are often left outstanding for much longer periods than T+2. These failing trades are constantly being traded to reset the settlement clock and move the failing trade to the back of the line. The failures of a centralized system…\n\nAccording to Christian, it can be T+12 days before a failed trade is even brought to the attention of the IIROC (the Investment Industry Regulatory Organization of Canada)…\n\n**Prime Brokers and Banks are Complicit**\n\nThis is one of Wall Street’s biggest profit center and fines levied against them are merely a minor cost of doing business. \n\nSome banks are getting rich off of these naked short sellers. The profits off this kind of lending are tantalizing, indeed. Brokers are lending stocks they don’t own for massive profit and sizable bonuses. \n\nThis layer of what many have now called a “criminal organization” is the toughest for regulators to deal with, regardless of the illegal nature of these activities. \n\nPrime brokers lend cash account shares that are absolutely not allowed to be lent. They lend them to short-sellers in order to facilitate them in settling their naked shorts. \n\nIt’s not that the regulators are in the dark on this. They are, in fact, handing out fines, left and right—both for illegal lending and for mismarking “shorts” and “longs” to evade regulatory scrutiny. The problem is that these fines pale in comparison to the profits earned through these activities. \n\nAnd banks in Canada in particular are basically writing the rules themselves, recently making it easier (and legal) to lend out cash account shares.\n\nNor do law firms have clean hands. They help short sellers bankrupt targeted companies through court proceedings, a process that eventually leads to the disappearance of evidence of naked shorts on the bank books.\n\n“How much has been stolen through this fraudulent system globally is anyone’s guess,” says Christian, “but the number begins with a ‘T’ (trillions).”\n\nThe list of fines for enabling and engaging in manipulative activity that destroys companies’ stock prices may seem to carry big numbers from the retail investor’s perspective, but they are not even close to being significant enough to deter such actions:\n\n\\- The SEC charged Citigroup’s principal U.S. broker-deal subsidiary in 2011 with misleading investors about a $1 billion collateralized debt obligation (CDO) tied to the U.S. housing market. Citigroup had bet against investors as the housing market showed signs of distress. The CDO defaulted only months later, causing severe losses for investors and a profit of $160 million (just in fees and trading profits). Citigroup paid [$285 million](https://www.sec.gov/news/press/2011/2011-214.htm) to settle these SEC charges.\n\n\\- In 2016, Goldman, Sachs & Co. agreed to pay [$15 million](https://www.sec.gov/news/pressrelease/2016-9.html) to settle SEC charges that its securities lending practices violated federal regulations. To wit: The SEC found that Goldman Sachs was mismarking logs and allowed customers to engage in short selling without determining whether the securities could reasonably be borrowed at settlement.\n\n\\- In 2013, a Charles Schwab subsidiary was found liable by the SEC for a naked short-selling scheme and fined [$8.2 million](https://www.law360.com/articles/744936/sec-mulls-schwab-unit-s-naked-short-sale-sanction-appeal).\n\n\\- The SEC charged two Merrill Lynch entities in 2015 with using “inaccurate data in the course of executing short sale orders”, fining them $11 million.\n\n\\- And most recently, Canadian Cormark Securities Inc and two others came under the SEC’s radar. On December 21, SEC instituted [cease-and-desist orders](https://www.sec.gov/litigation/admin/2020/34-90740.pdf) against Cormark. It also settled charges against Cormark and two other Canada-based broker deals for “providing incorrect order-making information that caused an executing broker’s repeated violations of Regulation SHO”. According to the SEC, Cormark and ITG Canada caused more than 200 sale orders from a single hedge fund, to the tune of more than $660 million between August 2016 and October 2017, to be mismarked as “long” when they were, in fact, “short”—a clear violation of Regulation SHO. Cormark agreed to pay a [penalty of $800,000](https://www.sec.gov/enforce/34-90740-s), while ITG Canada—one of the other broker-dealers charged—agreed to pay a penalty of $200,000. Charging and fining Cormark is only the tip of the iceberg. The real question is on whose behalf was Cormark making the naked short sells?\n\n\\- In August 2020, Bank of Nova Scotia (Scotiabank) was fined [$127 million](https://www.wsj.com/articles/scotiabank-fined-127-million-for-price-manipulation-false-statements-11597877100) over civil and criminal allegations in connection with its role in a massive price-manipulation scheme.\n\nAccording to one Toronto-based Canadian trader who spoke to Oilprice.com on condition of anonymity, *“traders are the gatekeeper for the capital markets and they’re not doing a very good job because it’s lucrative to turn a blind eye.”* This game is set to end in the near future, and it is only a matter of time.\n\n*“These traders are breaking a variety of regulations, and they are taking this risk on because of the size of the account,”* he said. *“They have a responsibility to turn these trades down. Whoever is doing this is breaking regulations \\[for the short seller\\] and they know he is not going to be able to make a settlement. As a gatekeeper, it is their regulatory responsibility to turn these trades away. Instead, they are breaking the law willfully and with full knowledge of what they are doing.”*\n\n*“If you control the settlement system, you can do whatever you want,”* the source said. *“The compliance officers have no teeth because the banks are making big money. They over-lend the stocks; they lend from cash account shares to cover some of these fails … for instance, if there are 20 million shares they sold ‘long’, they can cover by borrowing from cash account shares.”*\n\n**The Naked Truth**\n\nIn what he calls our “ominous financial reality”, Tom C.W. Lin, attorney at law, details how “millions of dollars can vanish in seconds, rogue actors can halt trading of billion-dollar companies, and trillion-dollar financial markets can be distorted with a simple click or a few lines of code”.\n\nEvery investor and every institution is at risk, writes Lin.  \n\nThe naked truth is this: Investors stand no chance in the face of naked short sellers. It’s a game rigged in the favor of a sophisticated short cartel and Wall Street giants. \n\nNow, with online trading making it easier to democratize trading, there are calls for regulators to make moves against these bad actors to ensure that North America’s capital markets remain protected, and retail investors are treated fairly. \n\nThe recent GameStop saga is retail fighting back against the shorting powers, and it's a wonderful thing to see - but is it a futile punch or the start of something bigger? The positive take away from the events the past week is that the term “short selling” has been introduced to the public and will surely gather more scrutiny.\n\nWashington is gearing up to get involved. That means that we can expect the full power of Washington, not just the regulators, to be thrown behind protecting the retail investors from insidious short sellers and the bankers and prime brokers who are profiting beyond belief from these manipulative schemes. \n\nThe pressure is mounting in Canada, too, where laxer rules have been a huge boon for manipulators. The US short cartel has preyed upon the Canadian markets for decades as they know the regulators rarely take action. It is truly the wild west.\n\nJust over a year ago, [McMillan published](https://www.mcmillan.ca/Short-Selling-in-Canada-Regulations-are-Weak-and-a-New-Path-Forward-is-Needed-to-Reduce?utm_source=Mondaq&utm_medium=syndication&utm_campaign=LinkedIn-integration) a lengthy report on the issue from the Canadian perspective, concluding that there are significant weaknesses in the regulatory regime. \n\nWhile covered short-selling itself has undeniable benefits in providing liquidity and facilitating price discovery, and while the Canadian regulators’ hands-off approach has attracted many people to its capital markets, there are significant weaknesses that threaten to bring the whole house of cards down. \n\nMcMillan also noted that “the number of short campaigns in Canada is utterly disproportionate to the size of our capital markets when compared to the United States, the European Union, and Australia”. \n\nTaking Wall Street’s side in this battle, [Bloomberg](https://blinks.bloomberg.com/news/stories/QNLPZ6T0G1KW) notes that Wall Street has survived “numerous other attacks” over the centuries, “but the GameStop uprising could mark the end of an era for the public short”, suggesting that these actors are “long-vilified folks who try to root out corporate wrongdoing”. \n\nBloomberg even attempts to victimize Andrew Left’s Citron Research, which—amid all the chaos—has just announced that it has exited the short-selling game after two decades. \n\nNothing could be further from the truth. Short sellers, particularly the naked variety, are not helping police the markets and route out bad companies, as Bloomberg suggests. **Naked short sellers are not motivated by moral and ethical reasons, but by profit alone.** They attack good, but weak and vulnerable companies. **They are not the saviors of capital markets, but the destroyers.** Andrew Left may be a “casualty”, but he is not a victim. Nor likely are the hedge funds with whom he has been working. \n\n[In a petition](https://blogactionday.change.org/p/u-s-securities-and-exchange-commission-sec-enforcement-to-investigate-andrew-left-of-citron-research?original_footer_petition_id=23189747&algorithm=promoted&source_location=petition_footer&grid_position=3&pt=AVBldGl0aW9uAAff1wAAAAAAYAoOkIbS1NoyZmQyYjJmNQ%3D%3D) initiated by Change.org, the petitioners urge the SEC and FINRA to investigate Left and Citron Research, noting: “While information Citron Research publishes are carefully selected and distributed in ways that do not break the law at first sight, the SEC and FINRA have overlooked the fact that Left and Citron gains are a result of distributing catalysts in an anticipation of substantial price changes due to public response in either panic, encouragement, or simply a catalyst action wave ride. Their job as a company is to create the most amount of panic shortly after taking a trading position so they and their clients can make the most amount of financial gains at the expense of regular investors.”\n\nOn January 25th, the [Capital Markets Modernization Taskforce](https://savecanadianmining.com/save-canadian-mining-congratulates-ontarios-capital-markets-modernization-taskforce-on-addressing-predatory-short-selling-in-final-report/) published its final report for Ontario’s Minister of Finance, noting that while naked short selling has been illegal in the United States since 2008, it remains a legal loophole in Canada. The task force is recommending that the Ministry ban this practice that allows for the short-selling of tradable assets without first borrowing the security. \n\nThe National Coalition Against Naked Short Selling - Failing to Deliver Securities (NCANS), which takes pains to emphasize that is not in any way against short-selling, notes: “Naked short-selling transfers the risk exposure and the hedging expense of the derivatives market makers onto the backs of equity investors, without any corresponding benefit to them. This is fundamentally unfair, and must stop.”\n\nAcross North America, the issue is about to reach a fever pitch over GameStop. For once, regular retail investors have a voice to use against Wall Street. And for once, Washington appears to be listening. The House and Senate both have [hearings scheduled](https://nypost.com/2021/01/28/congress-announces-hearings-on-reddit-fueled-gamestop-trading/) over the GameStop saga. \n\nParadoxically, the same company that basically started the retail investor coup—zero-fee trading app Robinhood—is now under fire for pulling the rug out from under the same democratic movement. \n\nAfter retail investors joined forces against Wall Street short-sellers to push GameStop stock from $20 to a high of over $480 in less than a week, Robinhood made the very unpopular move of instituting [a ban on buying](https://www.mercurynews.com/2021/01/28/gamestop-stocks-brokerages-limit-trading-sparking-outcry/) for retail investors. Under the rules, Wall Street could still buy and sell, but retail investors could only sell. This new band of investors—which includes pretty much all of Robinhood’s clientele—are up in arms, with customers now suing. They won’t go away, and they have Washington’s ear … and Twitter and Reddit’s social media power. This is shaping up to be an uprising.\n\nWhat happens with GameStop next could end up dictating a new form of capital markets democracy that levels the playing field and punishes the Mafia-like elements of Wall Street that have been fleecing investors and destroying companies for years. \n\nRetail investors want to clean up capital markets, and they just might be powerful enough to do it now. That’s a serious wake-up call for both naked short sellers and the investing public.\n\nViva la Revolucion.\n\nJames Stafford\n\nPublisher [Oilprice.com](https://Oilprice.com)\n\n&#x200B;\n\nLink to the article:[https://oilprice.com/Energy/Energy-General/Naked-Short-Selling-The-Truth-Is-Much-Worse-Than-You-Have-Been-Told.html](https://oilprice.com/Energy/Energy-General/Naked-Short-Selling-The-Truth-Is-Much-Worse-Than-You-Have-Been-Told.html)\n\n&#x200B;\n\nShout out to u/Accomplished_Shock46 **who posted this in a WSB comment.**\n\n&#x200B;\n\nEdit: I didn't do the DD, i just found it. Don't forget to click and support the author who is sharing these thoughts/comments if you agree with them- traffic and social media is very important to Google/Bings algorithms on their search engine. Thanks u/[YourDraftDay](https://www.reddit.com/user/YourDraftDay/) for this idea.\n\nNot financial advice.\n\nEdit 2: I posted it on r/Stocks and receive this response:Let me say this, I was a broker from \\~1988-2002 and in the '90s on Naked Shorts was an issue. I was on a conference call talking to regulators (along with \\~30 other folks) debating the pros and cons, even though it probably least understood Shorting is essential for the markets to work correctly, however, Naked Shorting is a huge threat to individual cos., market makers, and the brokerage firms, very much on the discount brokers. With wirehouses they will find a borrow before they'll execute a short, in fact at one time for several years you had to call stock loan, make sure shares were available, and put the Auth # given to you by stock loan on the ticket!! Then with discount brokers who had a skeleton back office you place a trade and the Short Sale it's immediately filled and nobody sees if there are borrows available now or when the trade was placed. As much as so many dislike the BIG FIRMS this is primarily a disc. firm issue. On that call, the regulators said \"we'll keep a close eye (via Stock Watch) and as we see naked shorts we'll call and make sure they have shares to borrow. Over the next 10+ years, I've never spoken to anyone that had heard from the SEC ever!!\n\n&#x200B;\n\nGo to the article source to check the cliff notes.\n\nEdit 3: My post from r/stock was deleted because of me advocating for donation to the author. Like wtf, they literally don't have such a think. Can someone message they moderator team, i don't have any free time left as im at work now, and i didn't do shit all day. Here is the link to the post: https://www.reddit.com/r/stocks/comments/m9d549/naked_short_selling_the_truth_is_much_worse_than/?utm_medium=android_app&utm_source=share\n\n&#x200B;\n\nTLDR:🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "Naked Short Selling: The Truth Is Much Worse Than You Have Been Told",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/m9bfp0/naked_short_selling_the_truth_is_much_worse_than/"
}