{
    "author": "Squashua1982",
    "created_utc": 1616261490.0,
    "distinguished": null,
    "edited": false,
    "id": "m9bsjl",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_m9bsjl",
    "num_comments": 712,
    "permalink": "/r/GME/comments/m9bsjl/shorty_vs_whale_for_200_and_why_the_rocket_wasnt/",
    "score": 5434,
    "selftext": "This is my first DD and I am, by no means, a smart ape. I have skin in the game but will not post my position due to info that came out this week saying we shouldn’t. I am no shill, or intern, or troll. I teach and have a small Barbecue business on the side to make ends meet. \n\nThis post is based on multiple posts across multiple subs and articles I have read obsessing over GME. I have been obsessively searching for answers on why closing above $200 on yesterday was so important, and why it looked like to rocket was suppressed (not by short Hedgies). I dived head first down the Delta Hedging rabbit hole along with others. Oh yeah... insert obligatory this is not financial advice or whatever black magic voodoo witch words I need to write that keeps me off the SEC’s shit list. \n\nWTF is Delta Hedging?? Delta hedging is when a seller of a call hedges the risk associated with that call immediately at buy. So if the stock price is $150 when you buy a call with a $160 strike then they would more than likely purchase the 100 shares to cover that call at sell. OR they will hedge it with other assets or calls or puts or whatever so long as it brings the delta risk to neutral.\n\nThis is how my smooth brain understood it. Let’s say someone buys a call that is far from being in the money (extreme out of the money calls, OTM) like my dumbass did on Wednesday when I bought 4 $800 calls. The Delta (or risk) on that call would be very low to the seller of that call. So if they hedged at all it might be like 5 shares of the 100 contract call they buy at sell. HOWEVER as the stock price increases the Delta (risk) increases, and they would buy shares (or other assets) to keep the Delta neutral. If the stock price decreases they sell shares or other assets, once again to keep the Delta neutral. \n\nThis is explained EXTREMELY well by /u/Agamenc in the comments section of a related post on Gamma Squeezes. I highly suggest you take the time to read all the questions people ask and his responses. He may have put a wrinkle on my brain... \n\nhttps://www.reddit.com/r/options/comments/l9rdrt/lets_clear_up_a_few_misconceptions_about_gamma/gljwkzu/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nDelta Hedging is very very typical behavior for all Market Makers as they are not in the business of losing money on high risk gambles. \n\nSo.... bad news yeah? No huge buy orders to cover Fridays ITM calls next week because they already covered right? Possibly. \n\nAs it is very typical behavior for Market Makers who typically don’t take high risk chances, it is not typical behavior for hedge funds. \n\nHedgies, like to gamble. After all this is the biggest casino in the world. \n\nThat being said, there’s no way to know for sure if shorties delta hedged the calls from March 19th until we see, or don’t see, an inflation of the stock price due to large buy orders next week. \n\nSo what was that epic Shorty vs Whale battle for $200 then?\n\nIt was to cut the financial legs out from the shorties because they bought an assload of PUT’s that expired worthless if the price was over $200. \n\nhttps://www.reddit.com/r/GME/comments/m81nei/analyzing_options_oi_for_tomorrow_puts_calls/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nCredit to /u/Dwellerofthecrags who pointed to the significance of $200 for both sides before the day began. \n\nSo you ask yourself, why didn’t the long whales just fucking fire the rocket then??? Higher stock price only means good things for us and fucks over the shorties even more right? \n\nWrong. I believe the shorties bought fucktons and fucktons of calls with a strike price from $250-$800 which expired on the 19th. Credit to /u/CM_MOJO for a brilliant, albeit very long, write up backing this theory. \n\nhttps://www.reddit.com/r/GME/comments/m584h0/how_i_see_the_gme_end_game_playing_out/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThey did it last week and the buy orders were so large and so retarded (we are talking ape lev retardation on steroids here) even the media screamed market manipulation. \n\nhttps://www.streetinsider.com/dr/news.php?id=18113374\n\nSooooo..... if the price is below $200 shorties get paid. If the price went over $250 it would have rocketed with the amount of retail buyers buying in because of FOMO. AND the Market Makers who would be placing massive buy orders gobbling up shares to delta hedge the calls THEY sold to keep their delta (risk) neutral. Which would result in a Gamma Squeeze that would have ended the day WELL above $800. Which in turn would have meant the shorties got paid an insane amount on their call purchase orders. \n\nSo we had some very fucking smart long whales who literally landed a fatal blow to the shorties and people don’t even know it yet. \n\nI don’t know if we will see a huge buy of shares early next week or not, and honestly it doesn’t matter. However, I fully expect the shorty attacks to be less in number and much weaker because it’s very hard to climb a ladder with gimp legs. I also expect them to start dumping other assets to avoid being margin called on their shorts due to lack of liquidity. \n\nTLDR: Long whales intentionally kept the price as close to $200 as possible without going under. This financially knee capped the short Hedgies as both their PUTS and CALLS expired worthless.",
    "title": "Shorty vs Whale for $200 and why the rocket wasn’t launched yesterday. DD",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m9bsjl/shorty_vs_whale_for_200_and_why_the_rocket_wasnt/"
}