{
    "author": "easy_like_squeezy",
    "created_utc": 1616607481.0,
    "distinguished": null,
    "edited": 1616618397.0,
    "id": "mcbo0e",
    "text_only": true,
    "flair_text": "Fluff",
    "name": "t3_mcbo0e",
    "num_comments": 515,
    "permalink": "/r/GME/comments/mcbo0e/fuck_this_gme_is_what_occupy_wallstreet_should/",
    "score": 13178,
    "selftext": "My Ape🐒\n\nI'm so happy you are here! You dont know me, I'm easy\\_like\\_squeezy, its awesome to meet you!\n\nToday I got angry, really angry at the hedgefucks and the rest. I got angry not for me but for you. I was sitting and worrying about the price etc because I'm so tired of struggling. I have Major Depressive Disorder, my testosterone is that of a 65 year old, I'm alone, my therapy and pills mean its a choice sometime between that or food etc etc et fucking c. Im tired of denying myself. Im tired of earning little for 16 hr days.\n\n**Im so tired of everything HAVING to be so hard** because some fuck in Connecticut cant think beyond himself\n\nAnd then it hit me and I wanted to weep a little because I thought of how many of you and us feel like that or for whom its hard, too hard.\n\n&#x200B;\n\n**SO. Now Im FUCKING pissed!** Im in South Africa the Dollar to Rand is 15:1 ie the tendie gains from is generation changing. Ive been holding from 350 down to 40 and back. I thought about what the tendies could mean for me **BUT FUCK THAT!**\n\n&#x200B;\n\n**NOW I HOLD FOR YOU! 💎🐒💎🐒💎**I hold and will be the last one holding even if its the bag because I love you and I will do my best to protect you and change YOUR life\n\nI HAVE DIAMON LOVE 💎❤💎❤💎❤\n\n&#x200B;\n\n*Edit: I have diamond hands to hold you and a diamond heart because you are my brothers*\n\n*Edit 2: To those calling me cringe etc and just negativity, please know this: I love you . If your holding GME or not I want the best for you - you are my brother no less.*\n\n*To the shills, bots: I hope you see the amount of love and strength here; you didnt stand a chance from the start* ",
    "title": "FUCK THIS!! GME is what Occupy WallStreet should have been! For the first time I'm angry and I WILL be the LAST of all you beautiful primates to Sell !!💎🙌 Why? Because DIAMOND LOVE🐒💎 💎❤",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mcbo0e/fuck_this_gme_is_what_occupy_wallstreet_should/"
}