{
    "author": "22khz",
    "created_utc": 1621553425.0,
    "distinguished": null,
    "edited": 1621554349.0,
    "id": "nhem60",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nhem60",
    "num_comments": 34,
    "permalink": "/r/Superstonk/comments/nhem60/bank_of_canada_financial_system_review_released/",
    "score": 508,
    "selftext": "Hey all,\n\nJust took a gander on BoC’s hot of the press released Financial System Review. \n\nThe major alarm bells *surprise surprise* being rung with this year’s review is the over-leveraged and extended housing market. If any of you Apes aren’t familiar of how insane the housing market here in Canada is, a simple google search will leave you a bit disconcerted as most of us are. \n\nBut this publication also mentioned liquidity concerns from asset classes. Interesting to note as I did not know how much non-banking asset management has doubled from 2008 to present day. \n\n*I honestly tend to wash out titles and posts by not being too exuberant, but there are a few points on vulnerabilities and risks outlined in the report and this is one of them. It is not just a casual mention.*\n\nhttps://www.bankofcanada.ca/2021/05/financial-system-review-2021/#v4\n\nFixed-income market liquidity\n\nThe ability of the fixed-income market structure to support liquidity provision under stress has not kept pace with the asset management sector’s potential demand for market liquidity (Vulnerability 4). Beyond the sheer size of the COVID‑19 shock, this structural trend partly explains the unprecedented speed, scope and size of the interventions that were required to maintain liquid markets in spring 2020. Given the potential for market liquidity demand to spike, particularly during periods of stress, the implications of this long-term structural shift will persist well beyond the pandemic.34\n\nThe robust growth of the asset management industry over the past two decades means that more credit risk is intermediated and held outside the banking sector. Asset managers include institutions such as pension funds and insurance companies; they also include the managers of mutual funds and exchange-traded funds that manage the pooled investments of private investors. By aiming to meet the investment goals of their investors, asset managers help channel funds to borrowers and provide a valuable alternative to traditional banking. The growth of the asset management industry, from $2.4 trillion in assets under management in 2008 to $5.7 trillion in 2020, has been driven in part by:\n\ndeclining interest rates\nfinancial innovations\ndemographic changes\nstricter banking regulation after the global financial crisis",
    "title": "Bank of Canada Financial System Review Released today mentioning vulnerability to a spike of demand for liquidity",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhem60/bank_of_canada_financial_system_review_released/"
}