{
    "author": "chomponthebit",
    "created_utc": 1621508115.0,
    "distinguished": null,
    "edited": 1621526350.0,
    "id": "ngx2ag",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_ngx2ag",
    "num_comments": 877,
    "permalink": "/r/Superstonk/comments/ngx2ag/hypothesis_robinhood_is_currently_buying_the_gme/",
    "score": 6692,
    "selftext": "TL:DR at end\n\nI’m just a smooth-brained ape, but here’s the limited evidence I’ve gathered thus far:\n\n1. Apes that transferred their shares from RH to Fidelity, etc, are seeing their shares arrive as fractions that add up to their total *purchased* (ahem) shares;\n2. Apes report pages upon pages of fractional shares bought at prices they obviously didn’t pay (I.e., u/AssRanch69 bought 10 shares on RH at $130 but when they arrive at Fidelity it shows .3 of a share was bought at $186, .6 of a share at $481, etc);\n3. Thus we may assume that AssRanch69 didn’t actually have 10 GME shares in his original account and RH was forced to cobble together 10 shares upon Fidelity’s transfer request;\n4. Since RH has shut down trading of stonks and crypto on at least 3 occasions, when it was in their best interests (but not their users’), we can assume they are shady as fuck and these jigsaw puzzle shares ought to be examined extremely closely.\n\nHypothesis: when investors buy shares on RH they are in fact buying an IOU, as RobinHood either 1. does not have the shares, 2. does not have enough shares so they pilfer fractional bits off other users accounts that actually contain some, or 3. has so few they have to purchase them from other entities willing to part from them on dark pools for prices far exceeding the market (which explains those fractionals over $300-400).\n\nTL/DR: RH never owned the majority of shares its members “bought”. RH either 1. Didn’t buy their shares on the market; 2. Is cobbling together fractional shares from remaining members’ accounts to transfer to Fidelity; or 3. Buying shares at way higher prices from dark pools from entities who will only part with them for prices way higher than the actual market’s. Or probably all three. \n\nI’m but a dumb ape slinging unrefined poop at the audience, so, please, wrinkle-people, make smart of this?\n\nEdit: I’m currently editing grammatical errors, not susbstance at 4:58am MST. Be done in a min\n\nEdit 2: Apparently some people are seeing fractional shares that were purchased for over $500. Where were they purchased if GME’s reported high is $483?\n\nEdit 3: u/Spimany says one of his fractionals was bought for $700. Someone explain...?\n\nEdit 4: u/Dirty_Epoxide just shared [this image](https://imgur.com/XBWcLK4) of some shares he transferred. He definitely didn’t buy shares for $911-$963, so...? Are these wash sales? Someone explain?",
    "title": "Hypothesis: Robinhood is currently buying the GME shares they have to deliver to Fidelity for higher prices in dark pools",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ngx2ag/hypothesis_robinhood_is_currently_buying_the_gme/"
}