{
    "author": "StrifeLover",
    "created_utc": 1621538539.0,
    "distinguished": null,
    "edited": 1621699299.0,
    "id": "nh913m",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nh913m",
    "num_comments": 464,
    "permalink": "/r/Superstonk/comments/nh913m/the_european_bank_issues_financial_stability/",
    "score": 5387,
    "selftext": "Hello everyone. It’s me again. This time I’m not telling you about Sluggs or Snakes. I want to talk about something that was just released by The European Bank yesterday, May 19th and is flying under the radar EVERYWHERE for some reason. I’m not a financial advisor. I manage a warehouse for a construction company and I’m really stupid but the following information, I feel, is very important to review. If I’m wrong or stupid ANYWHERE. Let’s discuss! Let’s get brain juices flowing!\n\nThe European Bank, of which 19 countries are members, just issued a Financial Stability Review - [Financial Stability Review, May 2021 (europa.eu)](https://www.ecb.europa.eu/pub/financial-stability/fsr/html/ecb.fsr202105~757f727fe4.en.html) \\- which I only caught because of this very minor article on Barrons - [European Central Bank Warns on Heightened Risks to Financial Stability | Barron's (barrons.com)](https://www.barrons.com/articles/european-central-bank-warns-on-heightened-risks-to-financial-stability-51621439308) The Barrons Article is a great TLDR – Basically everything fucked. HODL. (Edit: This article has now been paywalled)\n\nBut let us dive a tad further PAST that into the actual report released by The EB. I’m just going to write my general thoughts, I’m not smart enough to do an extreme breakdown but I encourage EVERYONE to read the article and grow a few wrinkles. \n\nThe beginning part of the article explains that risks because of the pandemic remain high and that corporates and banks need continued protection in order to prevent insolvency issues. You see, many of these banks and corporates or hedge funds would have gone bust in 2020 because of how over leveraged they were if it weren’t for the help they got from their respective Federal Reserve (US) or the European Bank (EU). Basically, the can got kicked down the road, money printers went BRRR. The day is saved. So far.\n\nThe VERY first crayon munching picture that everyone can understand is presented. Look it over. What is being predicted going into 2022?\n\nThen the article discusses the US yields and Bonds. Basically, how the US kept itself afloat and the risks associated with it in Charts 1 and 2. Chart 3 discusses what we already know. Many Hedge Funds are overleveraged and exposed to failure which leads to increased risk to those lending to them. This has caused a decrease in liquidity. Quote “Cash buffers and liquid asset holdings are now below PRE-PANDEMIC levels and approaching NEW LOWS, leaving the sector highly vulnerable to fire sales of assets in the event of large-scale redemptions.” (DANGER ZONE by Kenny Loggins)\n\nChart 4 – More leverage, more vulnerabilities, more insolvencies. Look at the right chart and it’s cliff notes. It’s projected that since 2019 more and more corporate insolvencies will occur.\n\nChart 5 discusses how this will affect everyday Europeans oh, and the real estate sector is going to go boom if a financial crisis does happen. (In a VERY bad way. 🔥 🔥 🔥)\n\nThe report continues that while the Market overall has been doing great! Banks are not making a profit. What is going on? They claim they don’t really know but because of this Banks are not willing to loan as much suddenly anymore despite how good they all should be doing. Quote “Early signs of rise in loan impairments are becoming increasingly visible.”\n\nThen it starts breaking down many things of which I’m going to generally gloss over but please read it in your spare time. The next Chart we should look at is 1.12 – how a backlog of insolvencies will cause challenges in the EU. The expected default frequency is forecasted in this chart and compared to the 2008 Financial Crisis.  Shit is FUCKED.\n\nThe report goes on into how the US Markets are affecting Euro Markets. To quote “At the end of January 2021, groups of retail investors (THAT’S US) bought several US small cap stocks where leveraged investors had large short exposures. Their actions, coordinated on social media, pushed those stock prices to high levels, thereby imposing substantial losses on short sellers such as hedge funds that were forced to buy the underlying shares to close their positions.” READ THIS ENTIRE SECTION. It’s uncessary for me to quote the whole thing but READ IT. They specifically talk about options and how their unwinding will have spillover into the broader marker. They cite Archegos specifically. Going on they state again “…That bank asset quality is likely to deteriorate further over 2021.”\n\nChart 4.5 – Funds’ cash buffers continue to fall while liquid asset holdings remain stable. (In my mind, this is like the part in The Big Short where Steve Carell and his buddies are being asked to pony up more money for their shit even though their shit was literally FULL of shit.)\n\nThe report even addresses ‘Zombie’ firms. Aka Shell Companies and how they are gonna fuck shit up if not addressed AND SOON.\n\nOk. That’s all I can fit into this post because my lunch break is over and hopefully smarter people than me will pick up on this and explain more. Guys. This is “I GOTTA CALL MY MOM” kind of a big deal. The news is NOT reporting this information but the banks can’t hide it anymore. Shit is going down. Keep Holding. I love you all and good luck going into our new future. Do good. Use this information for good and all gains you may possibly get for the betterment of all. Be excellent to each other!\n\nObligatory Rockets - 🚀🚀🚀\n\nEdit 1: just before I go back to work. I googled to see if the US Government has reported anything similar to this. Holy Shit. They have. Back on the 6th. Why has nobody noticed this? Why is the Media not sounding the alarm???\n\nhttps://www.federalreserve.gov/publications/may-2021-purpose.htm\n\nI don’t have time to do anything more than glance over it but guys. The Federal Reserve is saying basically the same thing but with way more bullshit and “Don't worry about it!” Language. But the underlying message, if you read past it. Is the same. Shit. Is. Fucked.\n\nEdit 2: u/attobitt u/heyitspixel or u/rensole help bringing more eyes on this?\n\nEdit 3: Apparently Zombie Funds 🧟 are MUCH more dangerous than just a shell company.  u/RedMageMood sent this to me. \n\n“read the paper you shared about financial stability.\n\nZombie firms aren't shell companies, they're much worst. They're companies that aren't profitable at all yet still run, these companies carry large debt and are planned to NEVER turn a profit. They are true full blown ponzie schemes where they start off by collecting a round of investors in some new tech or idea, make a prototype, have a press release, then have another round of funding and collect new investors. That new funding is then used to pay off the initial investors, but after expenses, expansions, salaries and other payments nessessary they are still in the hole.\n\nThese companies do this forever, another word for them is GROWTH companies or growth sector. https://finbox.com/ideas/zombie-companies-list , a lot of these companies are actually in large ETF's such as SPY and NASDAQ. These aren't just venture capital endeavors, some are major corporations such as Mattel inc., other famous zombie firms are UBER, Doordash, and most tech darlings.\n\nThe problem with them is what happens when funding stops for even 1 round, and then debt is carried over to the next fiscal year. Also what happens when their \"growth\" is already priced in and invested on by major hedge firms and ETF's, except most positions are on MARGIN.\n\nWhat will happen when the growth companies stop growing, yet people spent money on it to grow with fake overleveraged money?“",
    "title": "The European Bank Issues Financial Stability Warning",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nh913m/the_european_bank_issues_financial_stability/"
}