{
    "author": "Stonkinator3000",
    "created_utc": 1621522892.0,
    "distinguished": null,
    "edited": 1621523119.0,
    "id": "nh2ih9",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nh2ih9",
    "num_comments": 229,
    "permalink": "/r/Superstonk/comments/nh2ih9/the_longterm_price_suppression_and_media_wide_fud/",
    "score": 5832,
    "selftext": "It hasn’t felt like the best thing because your frustration and your sense of injustice were both strongly activated, and those are two of the most painful psychological states to bear.\n\nIn behavioral terms frustration is the result of not getting the expected reinforcement from a repeated behavior. In this case smashing the buy button repeatedly is supposed to make the price go up. In training circles when a behavior stops being reinforced in any way it’s called extinction, and it’s the most effective way as a trainer to make an undesirable behavior from the subject disappear.\n\nBut in the GME case a deep seated sense of injustice rose up at around the same time as buying behavior was being subjected to extinction, because anyone with open eyes saw and continues to see the market manipulation.\n\nSo we had two potent psychological forces at work, one behavioral and one existential. While these forces both evoke painful feelings they actually worked in opposition to each other since repeated frustration compelled giving up, non-buying behavior while that sense of injustice compelled continuing the struggle buying behavior. I guess their sophisticated quants weren’t able to capture that duality.\n\nObviously the buying behavior won out, and as we stand here on the precipice of the moass it’s worth remembering that while the emotions evoked may have been painful at times, rationally speaking what the opposition has put us through has only strengthened us and put the vast majority of shares directly into the hands of diamond handed apes. That knowledge should evoke joy and hope, not frustration or despair.",
    "title": "The long-term price suppression and media wide fud has been the absolute best thing for the apes. Would you rather have a bunch of paper handed bitch normies accumulating shares over the last four months or diamond handed ape warriors accumulating shares over the last four months?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nh2ih9/the_longterm_price_suppression_and_media_wide_fud/"
}