{
    "author": "digibri",
    "created_utc": 1618540337.0,
    "distinguished": null,
    "edited": false,
    "id": "mrtynw",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_mrtynw",
    "num_comments": 33,
    "permalink": "/r/Superstonk/comments/mrtynw/officials_subpoena_former_massmutual_supervisors/",
    "score": 226,
    "selftext": "Man, they're really running him through the ringer.\n\nHang in there, Roaring Kitty, we support you!\n\n&#x200B;\n\n[Officials subpoena former MassMutual supervisors of Keith Gill, local investor known as ‘Roaring Kitty’](https://www.bostonglobe.com/2021/04/15/business/state-regulators-subpoena-former-massmutual-supervisors-keith-gill-local-investor-known-roaring-kitty/)  \nBy Anissa Gardizy Globe Staff,Updated April 15, 2021, 6:13 p.m.\n\nMassachusetts regulators have subpoenaed the former MassMutual supervisors of Keith Gill, the Wilmington resident known for his astronomical gains during the GameStop stock rally.\n\nKnown on YouTube as “Roaring Kitty” and on Reddit’s Wallstreetbets forum as “Deep\\[expletive\\]Value,” Gill amassed a large following of investors interested in following his trading strategy, which included betting on stocks like GameStop, a brick-and-mortar video game store that had many investors and hedge funds betting on its failure.\n\nThe news is the latest development in an ongoing state effort to determine whether Gill’s investment-related activity online conflicted with his day job as a director of financial wellness education at the Springfield financial services company. Gill resigned from MassMutual in January. State regulators subpoenaed Gill in February to investigate the matter, and he testified remotely on March 3 in a private teleconference with securities regulators.\n\nRelated: Brockton track star becomes stock market millionaire: an unlikely Wall Street success story\n\nThe office of Secretary of State William Galvin said Gill’s former supervisors are expected to testify privately in late April or early May. A spokesperson for MassMutual said the company continues to “fully cooperate with all regulatory reviews.”\n\nGill’s lawyer could not immediately be reached for comment.",
    "title": "Officials subpoena former MassMutual supervisors of Keith Gill, local investor known as ‘Roaring Kitty’",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/mrtynw/officials_subpoena_former_massmutual_supervisors/"
}