{
    "author": "Mr_Ohsajang",
    "created_utc": 1627845875.0,
    "distinguished": null,
    "edited": 1627875725.0,
    "id": "ovyi28",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ovyi28",
    "num_comments": 191,
    "permalink": "/r/GMEJungle/comments/ovyi28/how_to_check_gme_and_amcs_short_squeeze/",
    "score": 659,
    "selftext": "I am a Korean stock investor.\n\nI love gme jungle.   🦧🦍🐜💎🙌💎🚀🚀🌕🌑\n\n&#x200B;\n\nUsing the accumulated difference between trading volume and trading valueLet's see if the current stock is short squeezing\n\nhttps://preview.redd.it/a5na7rqdqse71.jpg?width=452&format=pjpg&auto=webp&s=9b6ed403dc108beb2ad7924ca09335b9a5cc1201\n\nFirst if we pull out a chart with GME’s closing price, volume, and trading value\n\n&#x200B;\n\nhttps://preview.redd.it/75ouxyi9qse71.png?width=1475&format=png&auto=webp&s=41d2566e2c4e03597d9d7d4185d6b59c44c4cf66\n\n&#x200B;\n\nhttps://preview.redd.it/rx6vr3j9qse71.png?width=2000&format=png&auto=webp&s=7922f8a0a99bf0875a94b9f8c6092900656c58c7\n\nYou can get these graphs.\n\nWhat’s important here is that the amount of volume and trading value pulled out from security firm HTS are volumes and trading value which is calculated by average share prices. The closing price is the price provided due to the time limit.\n\nThe closed price due to time is fixed.The changeable figure is the average share price.If you compare this average share price to the fixed closing price,It will be possible to compare the numbers by dividing them into positive and negative numbers.And if you accumulate those numbers, there will be a pattern of accumulation when the stock price rises and falls in one direction.In that cumulative pattern, you can conclude that there is this pattern when the stock price goes in any direction.\n\nThen let’s do some simple math.\n\nAverage share price\\*volume = trading value. However, the figures provided are the amount of volume, trading value calculated by trading at the closing price and average share price.If you divide the volume from the trading value the average stock price traded at the daily wage will come out.\n\nI'll call it the divided closing price for convenience.\n\nhttps://preview.redd.it/nihrspi9qse71.png?width=1745&format=png&auto=webp&s=e82b4eb5136b40c0ac313a21eb352b977d5d224c\n\nIf you look at the divided close price it looks similar with the provided close price, but you can see there is a bit of difference\n\nParts that look very different\n\nFeb 24TH  Feb 25TH May 5TH\n\nDivided close prices are much higher\n\nThis also means that the average share price was traded more or there was a different route of transactions than the provided close price.\n\nhttps://preview.redd.it/ovo0c6j9qse71.png?width=1817&format=png&auto=webp&s=0b29da3127aa0af6ddff319efdf7c8d53572c702\n\nYou can't simply say that the price has increased or decreased, so it has changed like this. The types and figures of transactions of average shares traded internally were different with the closed prices due to time.\n\nIn general, it was quite different from the average value that had been flowing.\n\nIt is impossible to specify what this is.It will be hard to know that. But I knew there was a difference.\n\nDivide the trading value by the closed prices due to time. I'll say it's the divided volume for convenience.\n\nI'll multiply the closed price due to time with the trading volume. For convenience I’ll say it as multiplied trading value.\n\nhttps://preview.redd.it/3xj9shj9qse71.png?width=1678&format=png&auto=webp&s=eb56fc43d738fdb7c198220770d36e6eeb806e55\n\nhttps://preview.redd.it/bll8mri9qse71.png?width=1970&format=png&auto=webp&s=b66b892d97ef5ecef5a2697709201c042d5bdc60\n\nThe trading volume and trading value are mixed with the closing price and that makes a difference. You can make a positive and negative volume and trading value with this.\n\nNow if we compare the volume provided from security firms and the divided volume. Also compare the trading value provided and the multiplied trading value. Divided volume and multiplied trading value I have explained it above what I made for convenience. If one is subtracted from each other than the average and the closed price have a difference between them so it’s comparable.\n\nI'll talk about this for convenience as loss volume, loss trading value.\n\n&#x200B;\n\nhttps://preview.redd.it/x38wzxi9qse71.png?width=1742&format=png&auto=webp&s=7730ea18513841dfd68e772433804a0f40a6c2f7\n\n&#x200B;\n\nhttps://preview.redd.it/5cyjrwi9qse71.png?width=1594&format=png&auto=webp&s=28c654d0273bc574a018c9839932309d14782b93\n\nOn the daily graph of loss volume and loss trading value we accumulate these numbers. The direction of the cumulative figures is important.\n\nhttps://preview.redd.it/pwlk9ki9qse71.png?width=1422&format=png&auto=webp&s=9807362840d1a1c4d4e4abe8c8d7ecec0e73d3bf\n\nhttps://preview.redd.it/zm93rwi9qse71.png?width=1756&format=png&auto=webp&s=912ee3bf3050542b2e3b7dc4548530b25aa0c56f\n\nThe characteristics shown in the accumulation of loss volume and loss trading value are from the day of Jan 28TH when the buy button was removed by many brokers.\n\nLoss volume is going down.\n\nLoss trading value are going up.\n\nIf you interpret this at this time, you’ll be able to know that they shorted the stock with high intensity and the direction of the short sale is trading volume goes down and trading value goes up.\n\nSo, we’re going to divide the accumulated amount of volume and trading value and draw out the loss average. (Here is a mix of close prices closed due to time)\n\nI'll call this the squeeze line for convenience.(The squeeze line is not a cumulative one. Applies to daily figures.)\n\nhttps://preview.redd.it/hjhl6mi9qse71.png?width=1945&format=png&auto=webp&s=91368dac0a296c9d3ae8d6045818b21ffb7d11bb\n\nhttps://preview.redd.it/52wpf3j9qse71.png?width=2000&format=png&auto=webp&s=11ad99ab9558cc46966b33ec84cd10255430723b\n\nIf you look at the graph,\n\nOn January 28th, January 29th.The squeeze line has surpassed the closing price.You can see that it went up and down.So if the squeeze line is located on the positive side, not negative,It shows that there is a transaction that affects the short sale.To be more precise, the squeeze line is located higher than the closing price.But you can't just judge everything simply by the squeeze line.\n\nLet me put everything togetherIf we put together all the data from GME so far\n\n1. Accumulation of loss volume decreases,\n2. Accumulation of loss trading value increases\n3. If the squeeze line is negative and is lower than the current closing price,\n\nWe can conclude that there is a strong short selling going on.\n\nSo, if you look at the characteristics of these accumulations the other way around\n\n1. Accumulation of loss volume increases.\n2. Accumulation of loss trading value decreases,\n3. If the squeeze line is positive and higher than the current closing price\n\nIt means the short sale intensity is coming down and is ready to squeeze.\n\nNow let's apply this to AMC which is actually rising.It's actually going up significantly so if this is the case.\n\n1. Accumulation of loss volume Increase\n\n2. Accumulation of the loss trading value decreases\n\n3. The squeeze line must go from negative to positive and must be higher than the current closing price.\n\nSince the volume and trading value method are the same, we will only look at the important accumulation and squeeze line.\n\n&#x200B;\n\nhttps://preview.redd.it/g4g1jti9qse71.png?width=1630&format=png&auto=webp&s=5f5c348e26a33fe24e610d9cf40ffdf063d444dc\n\nhttps://preview.redd.it/107avui9qse71.png?width=1786&format=png&auto=webp&s=ae40fcb6ec07b41865e0bc26fcddb1fd20a6f360\n\nhttps://preview.redd.it/ql9v0oi9qse71.png?width=1784&format=png&auto=webp&s=b91a2b0e0bf6849594a8109af11f68a4e375999b\n\n(amc squeeze line)\n\n(The two axes are the default axes. The two axes are the same.)\n\nIt's not so perfect as the characteristics as I said before.But losses are now bottoming out and rising.Loss transaction amount are already falling.Squeeze line has already maintained the positive value for half a year.It is much higher than the AMC’s closing price.\n\n&#x200B;\n\nhttps://preview.redd.it/83ti8n0erse71.jpg?width=500&format=pjpg&auto=webp&s=c06e8704760c0ecf29fbe489cf4d085adf9ae949\n\nAll three things put together AMC is right before the short squeeze.If the loss volume accumulation rises a little more and the three conditions match then the perfect strong short squeeze is expected to start and there will be a sharp price increase from then on.\n\nThat's right.Hedge funds are bleeding from AMC.They are shorting while bleeding like hell.\n\n&#x200B;\n\nSo GME, AMC's conclusion is...\n\n1. GME's short squeeze was stopped on Jan. 28 and has yet to begin.\n2. I don't know what the trigger will be when GME's short squeeze starts.Loss volume will rise, loss trading value will fall, and squeeze lines will rise to positive numbers, which will be larger than the current closing price.\n3. If the gme goes up, it must be a huge increase. The GME is a really great nuclear missile.\n4. AMC is just before the start of the short squeeze.\n\n&#x200B;\n\nNow, it’s the stage for longs to whether squeeze AMC or not.\n\nThe last thing I want to say is\n\nhttps://preview.redd.it/9d6pzo0erse71.jpg?width=526&format=pjpg&auto=webp&s=ab95bb51002d9c098bf2a744ecc32d5fd80d202e\n\nThis isn’t a financial advice\n\nAND this I just wrote down my personal thoughts.\n\nNow we're experiencing great history which will be written in textbooks in the futureI'm not going to be weighed down by the history. I want to survive this journey with everyone, and I hope we can finish it safely.\n\nI reiterateThis situation and the figures may be correct or wrong.\n\nAnd GME and AMC’s short-selling section is so clear that the cumulative amount we get around there has effect. Applying this on other stocks? We don't know the short selling period, so I think it's gonna be hard.\n\nThat’s why I like this stock.\n\nI also love our Apes and the Ape community\n\nBYE THEN\n\nMY BELOVED APES\n\n\\+ Thanks to krakener and the Korean GME community for translation.\n\n&#x200B;\n\n\"GME 거대양봉마진콜울트라그레이트메가쓰나미숏스퀴즈위험하고거친몸의대화전율의허리케인타노스핑거스냅NFT아폴로11호뜨거운액면분할질서있는강제청산사랑출발\"\n\n\"오늘 심상치 않다\"\n\n💎🙌💎🐒🚀🚀🚀🦧🦍\n\n&#x200B;",
    "title": "How to check GME and AMC's short squeeze",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/GMEJungle/comments/ovyi28/how_to_check_gme_and_amcs_short_squeeze/"
}