{
    "author": "Vic18t",
    "created_utc": 1616834695.0,
    "distinguished": null,
    "edited": 1616836055.0,
    "id": "me9yjg",
    "text_only": true,
    "flair_id": "041e7fc8-584b-11eb-bcb3-0e263fdab45f",
    "flair_text": "DD",
    "name": "t3_me9yjg",
    "num_comments": 476,
    "permalink": "/r/GME/comments/me9yjg/a_little_disturb_that_incorrect_dd_is_being/",
    "score": 6469,
    "selftext": "I am all for positive news around GME but if we haven’t learned from the past, it’s that bad DD can be destructive. Please remember DD stands for due diligence; not a bra size.\n\nI am not a shill, and mean no disrespect to the OP of this DD:\n\nhttps://www.reddit.com/r/GME/comments/me59wg/gme_annual_shareholder_meeting_agm_recalling_the/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf\n\nBut he is completely wrong and glosses over many facts like **a company cannot initiate a shareholder recall! It’s never been done before because it can’t happen!** (See below DD for why).\n\nMeanwhile, I posted similar DD a few days ago that has gotten little attention on the very same subject matter:\n\nhttps://www.reddit.com/r/GME/comments/mbw22d/how_ryan_cohen_can_trigger_a_guaranteed_squeeze/\n\nHowever it has less than 50 upvotes.\n\nI’m happy to debate why one DD might be right or wrong, but it’s ultimately up to the community to decide. \n\nI’m not surprised this is happening, but am a bit sad after all we have been through with bad DD and dates, I would expect the community to get more critical of DD. \n\nAgain, no offense to the OP. I’m sure he meant well, but there’s no way in hell what he wrote makes any sense or is fact. It’s a lot of writing...and it seems if someone writes a big post then they must have spent a lot of time on their DD. No, a big post is just that - a big post.",
    "title": "A little disturb that incorrect DD is being upvoted 2k+ while correct DD remains buried",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/me9yjg/a_little_disturb_that_incorrect_dd_is_being/"
}