{
    "author": "thisonedudeyouknow",
    "created_utc": 1616906488.0,
    "distinguished": null,
    "edited": 1616908780.0,
    "id": "meumz4",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_meumz4",
    "num_comments": 60,
    "permalink": "/r/GME/comments/meumz4/lets_discuss_elliot_waves_to_understand_the/",
    "score": 529,
    "selftext": "first off... this is GME... nothing about this is normal and shit could change at literally any moment due to shares being recalled or other hedge fund tactics' fuckin everything up.\n\nseriously though, let's talk about Elliot Waves. This is starting to pop up more and more for me and I am trying to figure out which wave we are in.\n\n**lets begin you fucking idiots...**\n\n&#x200B;\n\nokay, what is an Elliot Wave? [Here is a link](https://www.investopedia.com/articles/technical/111401.asp) that goes more in depth and I am simply summarizing from that article.\n\n**Market Predictions Based on Wave Patterns**\n\n\"Elliott made detailed stock market predictions based on reliable characteristics he discovered in the wave patterns. An [impulse wave](https://www.investopedia.com/terms/i/impulsewave.asp), which net travels in the same direction as the larger [trend](https://www.investopedia.com/terms/t/trend.asp), always shows five waves in its pattern. A [corrective wave](https://www.investopedia.com/terms/c/corrective-waves.asp), on the other hand, net travels in the opposite direction of the main trend. On a smaller scale, within each of the impulsive waves, five waves can again be found.\"\n\n\\- Basically 1,2,3,4 and 5 are apart of the Impulse Wave (up trend)- A,B and C are apart of the Correction Wave (down trend)- 5 is the peak of the Impulse Wave and will make up the **1** of a **larger scale** wave.\n\nElliot Waves are made up of smaller Elliot Waves and also contribute to larger Elliot Waves.\n\n&#x200B;\n\n[Elliot Wave Example](https://preview.redd.it/uufs805hzop61.png?width=2773&format=png&auto=webp&s=f4214ba07c9527813b87ec87d527bde564ec432d)\n\nOkay, now how does this relate to GME?\n\nBelow is a screenshot of GME price action where each candle is **1 day**\n\n&#x200B;\n\n[Daily Price Action of GME where January 28th is the 5 & 1 of the Elliot Wave Theory](https://preview.redd.it/uioh2mfu0pp61.png?width=2389&format=png&auto=webp&s=b3e11ad326729f3a3a70ee4e4f2a7607e7929069)\n\nAs we can see on January 28th we hit an all-time-high. This would mean - correlating to the Elliot Wave Theory that the peak of the Impulse Wave is the **5 and also the 1** (Red Theory) of a new **Larger Scale Impulse Wave**.\n\nIf the peak is truly the **5** (Yellow - my first theory) then we can assume that **A** **B** and **C** (Yellow) have already happened **OR** that **A** and **B** (Orange) have already happened and we are waiting for the **Final Dip - C** to take place (as shown in Orange).\n\nSo - what I am trying to say - if this is still making sense - is that we are **either** waiting for another dip (Orange C) to complete the Correction Wave\n\n**OR** that we have completed the Correction Wave (Yellow Theory) and we are on our way up to the next peak (**5**) which has yet to appear.\n\nIn short -  Yellow Theory is assuming that we have been correct in our analysis so far and we are on our way up currently to the next peak.\n\n&#x200B;\n\nOrange Theory suggests that there is a final dip as apart of the Correction Wave still needing to complete itself.\n\nRed Theory plays apart of Yellow Theory and suggests we are right up to this point and that we are about to find **3** in the coming week. (Yellow/Red Theory is clearly the most bullish sentiment)\n\nIf Yellow/Red Theory is where we are - then we need to close GME price **ABOVE $344** in the following days. If we do not, then we can assume we are about to dip and find **C** which is apart of the Orange Correction Wave. To verify that we are in Orange Theory the price would need to fall below **$39**.\n\nI don't know about you but this doesn't seem very likely. So based on my assumptions I am going to say \"fuck Orange Theory\".\n\n**Back to Yellow/Red Theory**\n\nWe need to see consistent Green Days to know that the Elliot Wave Theory and my shitty analysis is correct that we are in another Impulse Wave and will be seeing new short-term highs over the coming week.\n\nWe are looking for price to be **above $344** to find **5**. If price gets above **$477 (jesus please)** then we can assume and label the next peak as **3** (Red Theory).\n\nIf price does **not** get above **$477** but **does climb over** **$344** then we can assume that the current Impulse Wave will end and we will see a Correction Wave (A, B, C)\n\n[Same Picture \\(Just another placement for you lazy-old-fucks\\)](https://preview.redd.it/vu8q5fh57pp61.png?width=2389&format=png&auto=webp&s=4f930944a18dd6976caf975024b5d69d7ffb4bd3)\n\nTL;DR - strap in apes, the rocket has already departed but we have a few pit stops to make to refuel\n\nSynopsis -Keep holding you dumb fucking apes\n\n(rockets, monkeys and banana emojis)\n\n(do not give me awards that cost you money - I will cut your dick off, eat it, shit it out and then proceed to smear it on Citadel and Mervin's firm walls)\n\n**Edit 1**: this may not age well or get much attention due to me posting it at Midnight on a Saturday  \n\n\n**Edit 2**: 91% Upvoted? Jesus fuck, okay, either **A)** I am dumb af and have something wrong here **B)** this is being downvoted by bots or **C)** y'all don't want to offer any advice and just think it's garbage - either way let me know where I can improve - I am here for the HODLers - talk to me bros",
    "title": "let's discuss Elliot Waves to understand the volatile movement of GME during this MOASS and where the fuck we are in this trillion-dollar-wealth-transfer-shit-storm-hedge-fund-take-down",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/meumz4/lets_discuss_elliot_waves_to_understand_the/"
}