{
    "author": "polypolipauli",
    "created_utc": 1627037355.0,
    "distinguished": null,
    "edited": 1627037811.0,
    "id": "opzvst",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_opzvst",
    "num_comments": 592,
    "permalink": "/r/Superstonk/comments/opzvst/infinite_money_glitch_explained_my_thoughts_on/",
    "score": 9579,
    "selftext": "This is the infinite money glitch as I see it, explained for 🦧retard apes like me.\n\n[Thanks to Criand's explanation of how SFTs facilitate the reseting of FTDs.](https://www.reddit.com/r/Superstonk/comments/opuziu/visual_of_the_sft_trades_to_prevent_shorts_andor/)\n\nThe basic premise is that mommy and daddy both balance their books, but mommy and daddy don't talk to one another, so you can scam the system by kicking the can between them.  If you can reset an FTD  (failure to deliver), you can make infinite money from nothing.\n\n👩Mommy = Market Makers\n\n👴Daddy = DTCC (Clearing house)\n\n😈Child = Hedgefunds (aka dirty fucking assholes)\n\n🍌GME Shares\n\nWhen 😈SHFs sell a 🍌share they don't have, 👴daddy basically gives them a month to locate it or else they label it a FTD and it becomes belt whooping time.\n\n>*Child, ya can't sell a promise. Go make good on that promise or I'll bend you over and beat ya raw*\n\nWell, the 😈 did sell that promise. Sold it for 💲. And for a whole month, the 😈 SHF is walking around with pockets full of 💲 all for doing nothing! But the month is coming to a close, and 👴daddy is begining to reach for the belt.\n\nWell 😈 has never had any 🍌to sell and can't find any, so he goes to 👩 mommy.\n\n>*What's that? You spent your allowance already? You need some 🍌to go buy ice cream? You promise you'll pay it back? Oh, don't worry honey, mommy loves you.*\n\n👩Mommy 'poofs' an imaginary 🍌share into existance and gives it to the 😈 SHF. That's what mommy is for, to smooth things out between allowances. But don't be fooled, mommy isn't a pushover, it's not a gift and she wants that 🍌share back soon. She's raising a responsible little child and won't let them run a debt.\n\nWell the 😈 SHF takes that 🍌and gives it to 👴daddy. Daddy checks it off. It took a month but their child sold a 🍌 and they delivered a 🍌. 👴is proud of their honest child. But here's the thing - 👴Daddy DTCC can't tell the difference between a real 🍌 and an imaginary fake one that 👩Mommy Market Maker created. ***They look the same to him.***\n\nWell now all 😈has to do is make mommy happy. He goes into a dark spot on the playground and buys a 🍌from another 😈 friend of theirs using his 💲 from his sold 🍌. It isn't a *real* 🍌 they are buying (their friend is running a scam too) but the fake share will fool mommy.\n\nAnd so 😈 takes that 🍌and gives it back to 👩Mommy. Mommy is so proud of their child. She 'poofs' that 🍌out of existance, and zeros out the loan. But here's the thing. That banana was *sold* but hasn't cleared the other 😈's Daddy yet. Mommy can't tell the difference between a real 🍌and one that hasn't been located and settled with 👴Daddy DTCC yet. ***They look the same to her.***\n\nMommy and Daddy don't talk to each other.\n\n\\-------------------\n\nWait you say, but the 😈 didn't make any money! He kicked the can back and forth between the DTCC and a Market Maker (like Citadel), but what's the point?? He sold a 🍌for 💲 ... but a month later he just spent a 💲 for a 🍌so nothing changed in the end!!\n\nWell, for **29 days** 😈had a pocket full of 💲. And for **one day** his pocket was empty. If they naked short sold 1x🍌 each day, then every single day of the month, their pocket would have 29x💲 in it. Their pocket would ALWAYS be full.\n\nMaybe they take 1x💲 out of their pocket to buy a 🚢 yaht with. No big deal. Each day they only need a single 💲 to reset that day's scam, and after reseting the just naked shot again and get the single 💲back! And they still have 💲x28 left! Let's buy some 🚢🚢🚢s!\n\nAnd you know what, this works so well, I think I'm going to start naked short selling 2x🍌🍌 every day now. **Infinite money glitch**. All because 👩Mommy Market Maker and 👴Daddy DTCC can't recognize each other's fake temporary asset from a real one.\n\nThat's the beauty of this. The DTCC has a system to prevent naked short selling, and Market Makers also have a system, BUT ONLY IN ISOLATION. If you can kick it back and forth between them, because you have a month before FTD, you can pocket the spread *in time*.",
    "title": "Infinite Money Glitch Explained - My thoughts on how Criand's latest comments blow the scam wide open",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/opzvst/infinite_money_glitch_explained_my_thoughts_on/"
}