{
    "author": "Skyman69420",
    "created_utc": 1622625207.0,
    "distinguished": null,
    "edited": false,
    "id": "nqhl63",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nqhl63",
    "num_comments": 449,
    "permalink": "/r/Superstonk/comments/nqhl63/if_the_squeeze_starts_happening_this_week_it_is/",
    "score": 7204,
    "selftext": "Now I will admit, I am a very smooth brained ape that has been holding GME for nearly 6 months (what a ride, right?).\n\nI'm sitting here having my cup of coffee and I've been seeing an awful lot of talk saying \"this could be it\" or \"it's happening\", the thought then popped into my head that if any form of squeeze happens within the next week then I assume its because the Hedgies want as many people to take profit and sell their shares before the MOASS actually starts.\n\nThe sittuation with GME has been minorly predictable since I invested back in December, well, the Hedgies tactics have been anyway.\n\nIm not saying any sort of squeeze will start before the meeting, all I'm saying is if the squeeze does infact start withing the next 3 days then it is because the Hedgies wanted it to, not because its time.\n\nBuy, Hold and for the love of all things good in the world, if you havnt voted but you can, please do it! Voting honestly takes less than 3 minutes to do, it's super easy and every single vote counts so please do your bit.\n\nIf your friend drives you around 24/7 because you don't have a car and you never offer them petrol money then you are taking advantage of someone trying to help, your just tagging along for the ride without offering anything in return, this is what having the ability to vote but choosing not to do it looks like. So again I say please vote!\n\nThis is in no way financial advice, I'm literally just sitting here with a cup of coffee and a cigarette venting my thoughts and my opinion to a community I truely love and who has already changed my life.\n\nApes together strong! 🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍\n\nOh, I almost forgot:💎🙌💎🙌💎🙌🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀💎🙌💎🙌💎🙌",
    "title": "If the squeeze starts happening this week it is because the hedgefunds want you to paper hand before the shareholders meeting HODL",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nqhl63/if_the_squeeze_starts_happening_this_week_it_is/"
}