{
    "author": "DaddysHairyNutsack",
    "created_utc": 1622665376.0,
    "distinguished": null,
    "edited": 1622695693.0,
    "id": "nqvd6f",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nqvd6f",
    "num_comments": 800,
    "permalink": "/r/Superstonk/comments/nqvd6f/stop_posting_im_up_30k120k_and_im_not_selling_its/",
    "score": 26372,
    "selftext": "Look. There is literally no need for anyone to post their \"gains\" with posts like \"I'M UP 50K, 100K, 200K AND IM NOT SELLING!!!!\". It's almost as a way to bypass the \"no gain post\" rule to me.\n\nWe DO NOT need to know how much gains you have in your account. It honestly feels like the FUD a couple of weeks ago where shills were posing as XX,XXX or X,XXX holder to create a divide between the apes.\n\nJUST SIMPLY BUY AND HODL. 💎🙌🦍🚀\n\nEdit: For those that are wondering where are these \"gain posts\" I am talking about? I made this post immediately after seeing a highly upvoted post titled something like \"wife telling me to sell after up 36k\", checking the comments I noticed multiple comments talking about the same thing \"I'm up 100k\", \"up 240k as a college student.\". I knew instantly this wasn't right and here's this post to bring attention to this issue.\n\n&#x200B;\n\nFurthermore, I have never been so happy and honoured to be a fellow ape 🦍, I really mean it. Therefore, I wish for everyone to stay vigilant and help each other by downvoting and reporting any *potential FUD* before it has the chance to spread. 🚀🚀🚀\n\n\nNot financial advice, just a smooth brained ape here who happens to love the stock.",
    "title": "Stop posting \"I'm up 30k/120k and I'm not selling!!!\", it's basically the same bypassing the \"gain post rule\". We DO NOT need to know how much you are up in your GME. Just buy and HODL.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/nqvd6f/stop_posting_im_up_30k120k_and_im_not_selling_its/"
}