{
    "author": "bbbhavane",
    "created_utc": 1622662200.0,
    "distinguished": null,
    "edited": false,
    "id": "nqu4ty",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nqu4ty",
    "num_comments": 219,
    "permalink": "/r/Superstonk/comments/nqu4ty/what_i_think_their_plan_was_and_why_i_think_they/",
    "score": 1646,
    "selftext": "We've seen that the movie stock increased in price in the last week or so, and I believe this is the result of a well thought plan by the HF. Let me put it this way, but don't quote me on this, I'm just a dumb ape who happened to THINK?! for a second:\n\n&#x200B;\n\n1. About 3 weeks ago, we've seen an influx of posts about the movie stock on our sub, causing a little bit of a divide between apes. We even had our mods intervene to sort things out.\n2. Last week the price of the movie stock started increasing, but I believe all this movement is and was controlled by HF (because we've seen multiple posts which stated that Shitadel had a huge position in a.m.c)\n3. Paid MSM (tv and internet articles) covering a.m.c a lot, always mentioning that it was better than our beloved GME.\n4. All of these happened in a span of two or three weeks, because, guess what, next week we have our Shareholders meeting, where hopefully a lot of things will be revealed! Shitadel and friends fear 6/9 (nice) and I believe everything that is happening now with the a.m.c stock, including the media coverage, is orchestrated in order to make GME apes sell due to FOMO. This is one of Shitadel's last desperate 'attacks' to make apes sell GME.\n5. But guess what, the movie stock has its own apes and they only buy and hold. I don't think Shitadel thought of this, so now things are getting harder and harder for shitadel and friends. I believe they are fighting for survival, knowing that 6/9 will reveal a lot of stuff and will probably trigger the MOASS. But as we've seen, Kenny is ready to fight till the last breath. Your wish is granted kenny, ook!?\n6. Moreover, GME apes are actual bonobos, they don't care, they only buy and hold GME, 'we' didn't FOMO into the movie stock and thus, GME holds strong! \n7. 5+6 is why their plan failed\n8. But I'm dumb af, so idk. \n\nBTW my plan is to sell only one share at 25 milly, keep the rest for the infinity pool, make these bitches bleed. Not financial advice!\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "What I think their plan was and Why I think they failed",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nqu4ty/what_i_think_their_plan_was_and_why_i_think_they/"
}