{
    "author": "anonfthehfs",
    "created_utc": 1624976160.0,
    "distinguished": null,
    "edited": 1624976782.0,
    "id": "oa95k8",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oa95k8",
    "num_comments": 88,
    "permalink": "/r/Superstonk/comments/oa95k8/open_letter_to_thosethem_at_the_top_we_see_you_we/",
    "score": 2108,
    "selftext": "# \n\nhttps://preview.redd.it/6adu92jvq7871.jpg?width=550&format=pjpg&auto=webp&s=5b88e4fdc53311f6341d673e9e48a62f5cd63f00\n\n# Dear \"THEM\" at the top,\n\n&#x200B;\n\nI'm a simple Ape.  You all most likely went to the best schools and got a job in the world of finance/governance.  You likely worked hard and learned the ropes.  You have been rewarded with excellent pay and your families have benefited from the system that is currently in place.   Some of your colleagues, maybe a member of your DTCC family, maybe it's someone your supposed to catch (SEC), maybe it's a rival, maybe it's someone your supposed to oversee (Politicians) etc.....well some people in YOUR system have been breaking the rules......\n\n\"Hey, Hey, you think. That's on them......this system has been going like this for a long time without too many problems for us.\n\n# \n\n# GUESS FUCKING WHAT........THE POOR'S ARE STARTING TO WAKE UP AND WORD IS SPREADING.\n\n&#x200B;\n\nWe see your system for the rigged carnival game that the market has become.  You all have been allowing OPEN manipulation for years to tilt the game in your favor and more people are learning about it each day.   **Everyday that you allow this charade to continue in plain sight, allowing power players in the market to openly manipulate things to get themselves out of trouble, is a day the fire inside every retail trader burns hotter.**\n\n&#x200B;\n\n&#x200B;\n\n# YOU ALL FUCKED RETAIL BACK JANUARY 28th.   YOU OPENLY MANIPULATED THE SYSTEM TO PROTECT YOURSELVES.  WE SEE YOU, YOU FUCKING SNAKES.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nThe people you fucked over in Jan were Dads, Moms, Brother's, Sister's, Uncles, Aunts, working class/middle class, **people who actually needed that money for bills, unpaid debts, hospital bills, to buy their first homes, to just fucking breathe without the constant fear of crushing money problems and you FUCKING SNAKES DID IT TO PROTECT THE ONES WHO HAD THE MOST**. \\*\\*(***FUCK YOU AND YOU SHOULD BE ASHAMED.)\\*\\****\n\n&#x200B;\n\n&#x200B;\n\nSeriously, you all fucked over the people who needed help the most.  I'm waiting on a fucking 3% raise at my lower middle class job when inflation is running over 5%.   So next year I'll be making less money than I am now.  You all transferred all this wealth from us working poor to yourselves at the top.  You have no idea what is coming.  The anger I feel is spreading each day.  Apes are starting inform people and soon you are going to have way more than 400k eyes looking at your corrupt system lookin for answers.   When your average American learns you snakes have been stealing their retirements to line your pockets, they are going to be sharpening their pitchforks.\n\n&#x200B;\n\n&#x200B;\n\n# Keep allowing the can to get kicked.  Keep lying.   See what happens.\n\n&#x200B;\n\n&#x200B;\n\n# SEC, Please don't get off Pornhub to fix this problem.  Don't show retail traders that you all are toothless little imps suckling on the tits of greedy money pigs as your real masters.  I swore an oath to protect this nation years ago.  I'm curious, if you also had to do the same oath, you know, to uphold the rules and laws.....\n\n&#x200B;\n\n&#x200B;\n\n# You think you are going to get away with this, but I'll dedicate my entire life getting back what you stole from me in Jan.  I'll HODL and teach my kids to HODL for generations.  FUCK YOU AT THE TOP.  I'M NOT GOING ANYWHERE.\n\n&#x200B;\n\n&#x200B;\n\n# MIC DROP AND MIDDLE FINGERS TO YOU!!\n\n&#x200B;\n\nLOL:  I'm not actually that angry.  I'm passionate and sick of the corruption.  Some of you know my writing style.  I'm that angry Marine.  lol.  I know they read our stuff, I want them to know that WE FUCKING KNOW!  :)",
    "title": "*****Open letter to \"THOSE/THEM\" at the top. WE SEE YOU: We see your lies, your corruption, your back scratching, your rule changes, your control of the media, your attempts to spin, your attempts to distract, and guess what, WE AREN'T LEAVING. Every day this problem grows bigger..... *****",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/oa95k8/open_letter_to_thosethem_at_the_top_we_see_you_we/"
}