{
    "author": "neoquant",
    "created_utc": 1627858907.0,
    "distinguished": null,
    "edited": 1627890482.0,
    "id": "ow2etp",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_ow2etp",
    "num_comments": 48,
    "permalink": "/r/Superstonk/comments/ow2etp/archegos_and_credit_suisse_approx_2mio_shorted/",
    "score": 688,
    "selftext": "So I had another read of the exact wording in the CS report:\n\nPage 107: „In late January, CRM queried the Credit Control group as to why Archegos’s PE had climbed so dramatically, from approximately $32.5 million on January 6, to $331.3 million on January 26, to $721.3 million on January 27.“\n\nPage 110: „You’ll recall they took an $800mm+ PnL hit in CS portfolio during “Gamestop short squeeze” week [at the end of January]. We were fortunate that we happened to be holding more than $900mm in margin excess on that day, so no resulting margin call. Since then, they’ve pretty much swept all of their excess, so think the prospect of a $700-$800mm margin call is very real if we see similar moves (also why $500mm severe stress shortfall limit not only reasonable, but also plausible with more extreme moves).“\n\nSo let‘s do some math:\n\n800mm potential margin call for CS itself during „gamestop short squeeze week“ would be 1.7m shares at 480 bucks and 2.7m shares at 300 bucks. We do not know when exactly the margin call potentially would have occurred in this week, so let‘s assume a short position of just 2mio shares.\n\nViacom and Discovery were only slightly volatile during Jan and actually with increasing share price which positively impacted Archegos long positions, so we can assume all other mentioned PE (Potential Exposures) are also largely based on GME.\n\n32m Jan 6 - GME opening price 17$\n\n331m Jan 26 (10x) - GME max price 147$ (9x)\n\n721m Jan 27 (22x) - GME max price 380$ (22x)\n\nLines up pretty much, right? Incredible evidence here.\n\nThen on the same page in the footnote they say the PE sharply decreased in mid February. Oh, I am wondering when GME hit rock bottom at 40 bucks per share? Feb 19th.\n\nEdit: Some commenters noted that Archegos fulfilled 500m additional margin coverage in February. So actually the PE did drop to 500something million only. The only reason for that could be additional short positions during January/February or an additional highly leveraged position on the longs with Discovery and Viacom.\n\nSpeculation: one of the biggest banks in the world still holds the short positions and is admitting a margin call of 700-800m can happen again if we see similar price movements.\n\nOne of the biggest banks in the world is in trouble of a measly short position of approx. 2mio shares initiated by an almost unknown family office. Just imagine the shitstorm brewing with bigger short positions hidden in similar swaps somewhere else. OMG 😱",
    "title": "Archegos and Credit Suisse. Approx 2mio shorted shares bring one of the worlds biggest banks into trouble?",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ow2etp/archegos_and_credit_suisse_approx_2mio_shorted/"
}