{
    "author": "Firetorpedos",
    "created_utc": 1616649640.0,
    "distinguished": null,
    "edited": false,
    "id": "mcqr1d",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_mcqr1d",
    "num_comments": 44,
    "permalink": "/r/GME/comments/mcqr1d/data_almost_no_swedish_holders_are_selling_their/",
    "score": 579,
    "selftext": "At my exchange (Avanza, largest in Sweden beyond comparison), yesterday 21700 had one or more GME on account. Today, 21500 have one or more GME on acc. Shows two things:\n\n1. (Minor) People dont take opportunities.\n2. (Major) Almost no one is paperhanding. If they keep this price, net result will be that more shares are acquired than paperhanded.\n\nFurther, short attacks are considered very successful if tanking price -20% in a day or -35% in a week. GME tanked -33% just yesterday. We are looking at -60% or so since last thursday.\n\nTwo things to note:\n1. 22mm volume may look much, but to get anywhere near -35% they need to short ladder attack VERY hard. This method consumes very high volumes rapidly. From 22mm, very little of that could be actual persons/institutions intentionally paperhanding. Its hedgies trading down with themselves.\n2. Considering the intensity of the attack this week, they are truly making an effort. This is no play, or half-assing. They are giving all they have, and quite interestingly, they want it to happen very fast. If the shills saying \"there are no catalysts after Q4\" were right, if GME longs truly are out of ammo, why are hedgies making this enormous effort?\n\nTwo interesting things:\n1. Study graphs of squeeezes. They always, no exception, come next day-day after hard attacks.\n2. The most accurate predicator of squeeze incoming is interest rates for shorts. Yesterday we got first data point showing this, an increase by about 160%. If this interest persists or even accelerates, we find ourselves finally, by the feet of the mountain.",
    "title": "Data: almost no Swedish holders are selling their GME.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mcqr1d/data_almost_no_swedish_holders_are_selling_their/"
}