{
    "author": "fusionnnnnnnha",
    "created_utc": 1616669711.0,
    "distinguished": null,
    "edited": 1616671861.0,
    "id": "mcvi9l",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_mcvi9l",
    "num_comments": 442,
    "permalink": "/r/GME/comments/mcvi9l/we_dont_negotiate_with_terrorists_threatening_one/",
    "score": 12119,
    "selftext": "Holding strong with pixel. I can’t sell now and neither should you. This is more than just about stock or a share price now. This is your livelihood under a corrupt system. You’re not holding for just money, holding is fighting for your freedom and we’re all here holding with you from around the globe. Hold fast apes.\nI’ll sell once we win this battle and citadel and fucks are liquidated. These fucks forget that we outnumber them 1000000:1. They can act like kings but even kings bleed. \n\n\"First they ignore you, then they laugh at you, then they fight you, then you win”\n\nThe game has changed. This isn’t about dd anymore. Anyone of us could be in pixels position right now but he isn’t alone and we’re all there with him and for each other. The stock may have been what led us here but the reason we’re all holding is for a deeper and more profound reason. For our independence and for a better tomorrow. Knowing that, I can’t sell in good faith until these monsters are properly done with and erased and I know everyone here feels that deeply. \nFrom their fuckery in 2008 and fucking over everyone and collapsing the economy till now, we may never have another chance at destroying corruption with the leverage we have now. We hold fast and hold strong.\n\nThe DD was right all along, this truly is a once in a lifetime opportunity and I’m glad to be here with everyone of you in this fight right now. There’s no where else that I’d rather be and there’s a reason we’re here in this moment in time. It’s bigger than all of us. It’s the whole world. People from everywhere trying for a better tomorrow for their family and friends. \nWe’re making history, holding fast.\n\n\nThreats on pixels life: https://www.reddit.com/r/GME/comments/mctnn7/the_psychological_warfare_is_in_the_end_phase_and/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
    "title": "We don’t negotiate with terrorists. Threatening one of us is like threatening all of us. The floor is now 10 million hedgefuck.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mcvi9l/we_dont_negotiate_with_terrorists_threatening_one/"
}