{
    "author": "BellaCaseyMR",
    "created_utc": 1624233594.0,
    "distinguished": null,
    "edited": false,
    "id": "o4ie63",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o4ie63",
    "num_comments": 290,
    "permalink": "/r/Superstonk/comments/o4ie63/blackrock_is_not_our_friend_hopefully_they_decide/",
    "score": 4080,
    "selftext": "BlackRock had over **$8.68 trillion** in assets under management \\[[December 31, 2020 financial statement](https://www.blackrock.com/corporate/literature/annual-report/blackrock-2020-annual-report.pdf)\\] in more than 100 countries across the globe. \n\nBlackRock has a division called the BlackRock Investment Institute (BII).  [See Here](https://www.blackrock.com/us/individual/insights/blackrock-investment-institute) .  The BlackRock Investment Group's job is to tell BlackRock what is going to happen around the globe and direct BlackRock where to invest money by predicting political events \n\nThe Chairman of the BlackRock Investment Institute is **Tom Donilon.** A former National Security Advisor and advisor to current President of the United States\n\n* Tom Donilon’s brother, **Mike Donilon** is also A Senior Advisor to our President {[link](https://nypost.com/2020/11/20/joe-biden-names-white-house-personnel-legislative-chiefs/)} providing guidance on what policies should be implemented within the administration.  Mike Donilon guides the focus of spending, budgets, regulation and white house policy.\n* Tom Donilon’s wife, **Catherine Russell**, is the White House Personnel Director {[link](https://nypost.com/2020/11/20/joe-biden-names-white-house-personnel-legislative-chiefs/)}.  In that position Donilon’s wife controls every hire in the Office of the Presidency.\n* Tom Donilon’s daughter, **Sarah Donilon**, who graduated college in 2019, now works on the White House National Security Council {[link](https://www.dailymail.co.uk/news/article-9702887/Obamas-ethics-chief-criticizes-Biden-string-family-related-hires.html?ito=social-twitter_dailymailus)}. Out of college for 1 1/2 years and she is on the NATIONAL SECURITY COUNCIL.\n\nSo BlackRock's Tom Donilon’s job description is to: “*leverage the firm’s expertise and generate proprietary research to provide insights on the global economy, markets, geopolitics and long-term asset allocation,*” and he is a Presidential Advisor, his wife is in charge of White House personnel, his brother is Senior Advisor to the President, and his daughter is on the National Security Council. \n\nWatch where BlackRock puts their money and you can predict what might be happening soon in the world. It is very dangerous to have such a huge corporation with so much control in the government. I am sure they have many Senators and Congress Critters from both parties in their pocket also.\n\nThis is the company buying up Real Estate all over the country and I have seen articles coming out advocating for people to not own property but to be RENTERS. \n\nSo hopefully they help with MOASS, but will probably gain much more moeny and power. I plan on putting my moass money into off the grid living and convert it to things other than USD currency.",
    "title": "BlackRock is NOT our friend. Hopefully they decide to help GME rocket but they definitely are not our friend and may be dangerous in long run",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o4ie63/blackrock_is_not_our_friend_hopefully_they_decide/"
}