{
    "author": "Decent-Individual747",
    "created_utc": 1627926344.0,
    "distinguished": null,
    "edited": 1627928374.0,
    "id": "owjpwr",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_owjpwr",
    "num_comments": 143,
    "permalink": "/r/Superstonk/comments/owjpwr/lets_just_take_a_step_back_take_a_breath_and/",
    "score": 3153,
    "selftext": "The last time Fargo Wells cut lines of credit with immediate effect was 2008.\n\nThe last time we hit 5.4% inflation was 2008. (Expected to be higher for July)!\n\nAs of January…Almost 8 months ago, SI over 240% probably much higher. Maybe 1000%!? \n\nSHF haven’t covered and continue daily to short the shit out of the stock. \n\nRental moratorium expired sat leaving millions in arrears without help. \n\nExponential rental increases in 2021. \n\nDelta variant exponentially increased with another lockdown in discussion. \n\nDebt ceiling not extended. \n\nGME is negative beta. \n\nReverse repo hits OVER $1 TRILLION. \n\nHistory confirms every crash is result of too much fake money flooding the markets. \n\nNo more free money coming in the post anytime soon. \n\nGME NFT’s coming. \n\nYou couldn’t ask for any other Chairman than RC. The man is a legend and he will build Game Stock into a BEAST! I guarantee he won’t fuck Apes over. I trust that man. \n\nWhen you see the fuckery on the price, remember the FACTS. It cost nothing to hold, but it’s costing them billions. And soon, very soon, the world we know that we aren’t members of a cult, we are just average Jo’s not a stupid as some would like to make us out to be! \nBe Patient \nHODL\nAnd sell after the peak to cause max pain and max tendies. \n\nIf I’ve missed anything feel free to share! \n🚀🚀🚀🚀🚀🚀🚀",
    "title": "Let’s just take a step back take a breath and remember this…🚀🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/owjpwr/lets_just_take_a_step_back_take_a_breath_and/"
}