{
    "author": "Piece-Friendly",
    "created_utc": 1623518447.0,
    "distinguished": null,
    "edited": 1623576740.0,
    "id": "nybmng",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nybmng",
    "num_comments": 144,
    "permalink": "/r/Superstonk/comments/nybmng/a_stock_lending_conspiracy_equilend_project/",
    "score": 1358,
    "selftext": "Good morning, good afternoon and good evening all you lovely apes. My name is u/piece-friendly and I’m a crayon eating apetard.\n\nY’all ready for some of that sweet, sweet DD? \n\nBuckle up…\n\nSo let’s get started at the beginning…\n\nAs a quick intro, I’ve been an investor in GME since January, I’ve seen the rips and I’ve seen the dips. In February, when u/deepfuckingvalue doubled down, I also did too. I have incredible faith in the turn around of GameStop, the new leadership team and their drive to give value to shareholders - this wonderful community I’m proud to be in.\n\nDuring March and April I went fully tinfoil. I went down rabbit hole after rabbit hole, sponging everything I read, learning about new terminology, new processes and expanding my smooth brain and grew some wrinkles.\n\nSince May, I’ve really taken a bit of a back seat and chilled out a bit, taking time to concentrate on my job, my pregnant gf, and a life I nearly blanked out through absolute commitment, some would say obsession, for the stonk.\n\nQuite recently I’ve seen the likes of u/dlauer, Wes, Trimbo talking about the serious issues with the stock lending market, and I wanted to draw to your attention to some of the research I gathered some time back that should be known and more widely recognised. It’s not something that I’ve seen covered in many of the DDs from the likes of u/atobitt u/heyitspixel u/rensole u/criand u/sharkbaitlol or others, but totally forms another part of a big ol’puzzle.\n\nSo firstly for the smooth brains that don’t read good, what’s stock or securities lending?\n\n“Securities lending is the practice of loaning shares of stock, commodities, derivative contracts, or other securities to other investors or firms. Securities lending requires the borrower to put up collateral, whether cash, other securities, or a letter of credit.\n\nWhen a security is loaned, the title and the ownership are also transferred to the borrower. A loan fee, or borrow fee, is charged by a brokerage to a client for borrowing shares, along with any interest due related to the loan. The loan fee and interest are charged pursuant to a Securities Lending Agreement that must be completed before the stock is borrowed by a client. Holders of securities that are loaned receive a rebate from their brokerage. \n\nSecurities lending provides liquidity to markets, can generate additional interest income for long-term holders of securities, and allows for short-selling.” (https://www.investopedia.com/terms/s/securitieslending.asp)\n\nWe’ve heard this is a trillions of dollar industry where prime brokers are absolutely cleaning up. Lending securities for fees, rebates, interest fees, then using the securities against investors playing both sides of the court. Giving with one hand, taking with the other.\n\nAfter Burry released the collateral rehypothecation document in feb (https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm) it got me really interested in the failing system, so I dug in to find out what dodgy dealings could have been going on. For anyone looking to add a wrinkle, have a read. It’s essentially why the repo and treasury markets are completely fucked, as the same toxic sludge gets lent, and re-lent, and re-borrowed, again and again, creating epic collateral chains and systemic risk, whilst making the books look just lovely.\n\nSo on my path in the securities lending market, I came across Equilend… \n\nhttps://www.equilend.com\n\n“EquiLend is a securities lending platform started in late 2001[2] by a consortium of leading financial services institutions. Founding members include Barclays Global Investors, Bear Stearns, Goldman Sachs, JPMorganChase, Lehman Brothers, Merrill Lynch, Morgan Stanley, Northern Trust, State Street, and UBS Warburg.” - wiki.\n\nNow that got me interested. Some familiar faces there right? Some that might have blown up a bit in the 2008 financial meltdown?  Something not quite right here even to a complete retard.\n\nA consortium? So what’s that exactly? \n\n“A consortium is a group made up of two or more individuals, companies, or governments that work together to achieving a common objective”\n\nSo what’s the common objective here guys? Because from what I know now I think it’s probably to make as much money as quickly as possible at the expense of a fair and free market… Fuck everyone else right?\n\nThere is relatively no information about this company, their wiki is like 3 paragraphs and guess what’s in the last one?\n\n“EquiLend and its prime broker owners are currently being sued in the Southern District of New York for antitrust violations. The case survived motion to dismiss in 2018”\n\nYep, that’s rights they’re in the doghouse for antitrust issues. Pretty big ones I’d say.\n\nDave Lauer and Wes’ interview was a real eye opener and sort of drove me to make this post. Because this is bigger than Melvin, it’s bigger than Kenny Mayo. They are getting a lot of shit, and quite rightly because the whole Citadel set up is a fucking scam. This goes beyond them and to the Prime Brokers (PBs). The banks. Yep it’s likely those fuckers again that are going to burn the house of cards again. As we saw in that lovely bit of DD that goes by that name.\n\nSo are they too big to fail again? That we will soon see, I believe.\n\nAnyway, back to Equilend. \n\nSo what kind of shit have they been getting up to you ask? \n\nWell, I came across a class action from 2018 that I think y’all gonna like. It’s a pretty damning report. \n\nTo summarise it see the following exert on the case background:\n\n“On August 17, 2017, Cohen Milstein Sellers &amp;amp;amp;amp;amp;amp;amp; Toll PLLC and Quinn Emanuel Urquhart &amp;amp;amp;amp;amp;amp;amp; Sullivan LLP filed suit in the Southern District Court of New York alleging collusion among six of the world’s largest investment banks to prevent modernization of the $1.7 trillion stock loan market. Plaintiffs, including the Iowa Public Employees' Retirement System, the Orange County Employees Retirement System and the Sonoma County Employees' Retirement Association, allege that Bank of America, Credit Suisse, Goldman Sachs, JP Morgan, Morgan Stanley and UBS conspired to overcharge investors and maintain the power they hold over the stock loan market, obstructing multiple efforts to create competitive electronic exchanges that would benefit both stock lenders and borrowers. \n\nThe stock loan market is a critical component of a strong economy, enabling trading activities like short selling and hedging while also ensuring that financial systems operate efficiently. The plaintiffs in this lawsuit(…)—claim that investors who borrowed and lent stock through the stock lending market were and are being harmed because six investment banks took collective, illegal action to boycott, attack and acquire multiple entities who tried to increase competition and lower costs in the stock loan market.\n\nThe banks named as defendants in this suit routinely took steps together to block the development of competitive exchange platforms like AQS (in the United States) and SL-x (in Europe) and the impact of government regulatory reforms. For example: When the investments banks learned that Bank of New York was using AQS for stock loan transactions, Goldman Sachs threatened to return billions in collateral and never do business with BONY again. BONY promptly abandoned its plans. Various defendants took similar steps with well-known hedge funds too, including SAC Capital, Renaissance Capital, and others – telling them they would not connect them to an AQS, and, if they did not like it, they could take their business elsewhere.\n\nAs AQS’s executives made the rounds of the stock lending industry and meeting with the organizations that would be part of the re-engineering of critical market infrastructure, one such institution openly stated that the AQS plan, “[sounded] great, but who’s going to start [your] car in the morning?”\n\nWhen SL-x met with two Goldman Sachs executives to introduce them to an emerging product – one which would have threatened Defendants’ dominance of the stock loan market – the Goldman executives were frank: if they were to allow a central trading platform with counterparty clearing, it would encourage other competitors to enter the stock lending market. “I ain’t supporting this,” said Goldman Sachs Managing Director William Conley. “You ain’t going to get this done,” echoed Brad Levy, then Global Head of Goldman Sachs’ Principal Strategic Investments Group.\n\nStock lending involves the temporary transfer of a stock from one investor to another, typically from large institutional investors who hold large amounts of publicly-traded securities (pension funds, mutual funds, university endowments, etc.) to entities who want to sell stock short. It is a common practice that helps both the borrowers and lenders of stock generate additional income in their portfolios.\n\nThe stock loan market has not kept pace with the technological progress that has improved other financial markets. Stock lending remains an opaque, over-the-counter (OTC) trading market in which there is no central marketplace for stock borrowers and lenders to trade directly with one another or see real-time pricing that could help secure better financial terms. Instead, stock lenders and borrowers must transact through intermediaries, also known as “prime brokers,” who take a massive cut of nearly every stock loan transaction. The six investment banks named in today’s lawsuit are the dominant prime brokers in the U.S., effectively controlling the stock loan market and gobbling up approximately 60 percent of the revenues.\n\nThis suit alleges that, in order to protect their profits, these large investment banks have been conspiring since at least 2009 through a company called EquiLend, which they control, to prevent participants from accessing marketplaces where they could benefit from direct, all-to-all trading and thereby secure themselves the best prices. (All-to-all trading means that stock lenders can offer a stock to every other stock borrower in the market and select the best price.) Denying others this level of access forces trades in the market to go through their prime brokers, which is how the banks are able to reap tremendous financial benefit. In 2016, for example, these six institutions skimmed approximately 60 percent of the $9.15 billion in stock lending revenue alone, despite performing a service for which they bear virtually no risk. Any other arrangement would have substantially reduced the need for their services, and the premiums that they charge would have been untenable.\n\nThe coordinated effort by the prime brokers to stymie their competition in the stock lending market took numerous forms. After boycotting securities lending participants who participated on other platforms —AQS in the U.S. and SL-x in Europe—the banks either purchased the intellectual property underlying those exchanges (SL-x) or the exchange itself (AQS), effectively shelving the efforts to improve stock lending for investors. The purchase of AQS by bank-controlled EquiLend, which the last piece of the conspiratorial puzzle as it gave Defendants complete control over all gateways to central clearing in the U.S., even had a secret code name at Morgan Stanley – Project Gateway.”\n\nhttps://www.cohenmilstein.com/case-study/stock-loan-antitrust-litigation\n\nIt really is a fascinating case and rings all sorts of alarm bells in my mind. Collusion? Antitrust? Monopolisation? Competition law? These banks are literally running the show, boycotting and driving competition into the ground before buying up their tech and IP. Skimming huge profits from the stock lending (60% reported at the time of this case in a $1.7trillion lending market), rehypothecating securities possibly over and over and over again.\n\nDude, why the fuck can this be allowed to happen? \n\nMy only answer can be it’s the power that they own, the money they move that can pay anyone off and put governments and federal reserves in their back pocket.\n\nI advise you to read the class action linked here - https://www.cohenmilstein.com/sites/default/files/2017-11-17%20Amended%20Complaint%20dckt%2073_0.pdf\n\nThe language used and the detail is actually quite shocking. \n\nWhistleblowers have come out and spoke. In the case that these banks call themselves the ’five families’, likening themselves to a mafia style operation:\n\n“Remarkably, in numerous private conversations, multiple personnel from the Prime Broker Defendants used the same phrasing to describe the stock loan operations of the Prime Broker Defendants collectively. \n\nSpecifically, these personnel characterized the Prime Broker Defendants as “the five families” of the stock loan market—a reference to the five major New York City organized crimes families of the Italian American Mafia.\n\nFor example, during a February 26, 2013 meeting with SL-x executives, one Credit Suisse director who was also an EquiLend board member explained that EquiLend was like “the mafia run by five crime families,” and proceeded to explain that, as a result, nothing would happen in the market with regard to SL-x’s platform unless the Prime Broker Defendants jointly allowed it to happen.”\n\n“On April 10, 2014, Credit Suisse managing director Shawn Sullivan recommended “get[ting] all the members of the five families together” to discuss AQS and related stock loan issues that had emerged in the wake of a recent regulatory development. \n\nOn another occasion, the head of securities lending at Bank of America similarly expressed an intent to convene a meeting of “the five families.” The fact that multiple Prime Broker Defendants used the same mafia reference to describe themselves collectively shows that they knew they had formed an illegal cartel. Indeed, it indicates they were proud of it.”\n\nYeah that’s right, our ‘trusted’ banks are no better than a crime gang, monopolising and manipulating the market because they’re ‘too big to fail’.\n\nNow re-read that paragraph with the quote about “yeah it’s great (AQS), but who’s gonna start your car in the morning” - sound threatening to you?\n\nI won’t cite the case anymore. It’s 144 pages of gold dust that you should all have a look through it you’re interested. But was enough for me to add another piece to this saga of the corrupt system we are living in. \n\nBut now we’re all learning about it and the fucks won’t get away with it for much longer. GGensler is coming in and I have faith that he’ll bring about some reformation, it seems that’s already begun.\n\nThis whole thing ties to the volume of dark pool and OTC trading we’re seeing that’s growing in recent years. That’s routing trades unfairly and enabling MMs to manipulate and move markets to their benefit, whilst Main Street bends over and gets fucked. \n\nAnd what’s more, we know the treasury market is fucked right?\n\nWell guess what?\n\nhttps://www.pionline.com/ja/node/520076\n\n“EquiLend adds Treasuries to lending portfolio” in 2005. \n\nSo these mafia cocks are fucking it all up, pissing on our pensions and education and welfare, all for profit and control.\n\nAnd apparently the case against them has been dropped… hmmm (see links at the footer)\n\nNow if this ain’t cause for a revolution then I don’t know what is…\n\nQuite a lot of info here guys, and I’ve more to add and will be adding when I have time to further this research. I welcome others to get in touch and add or share comments and feedback. Please share this with your comrades. Education and exposure is everything.\n\nYou can get me on Twitter too ‘@PieceFriendly’ that I’ve just set up and where I’ll try and post interesting updates as we change the fucking world. \n\nThe system needs to change. \n\nWe are the catalyst.\n\nBuy and hold.\n\nSee you on the moon 🌙 🚀🦍🤲🏼💎\n\n\nTLDR: the stock and treasury lending market is being run by a ‘mafia’ collective of big banks (no surprises who they are), who are controlling, monopolising and manipulating the market.\n\nThis post details my own views based on research that I’ve carried out and information I’ve gathered. None of this is financial advice.\n\nEDIT 1: the downvoters are out! Please don’t let them win. The sources of information presented in this post are real and are out there for you all to see. \n\nEDIT 2: this started off with so much traction in the first hour, but seems to be dying big time. Are people able to bury this post or something, so no one can see it? \n\nEDIT 3: adding some other DDers in to nudge them and to help share this\n\nhttps://www.google.co.uk/amp/s/mobile.reuters.com/article/amp/idUSKCN1M72XG\n\nhttps://www.securitiesfinancetimes.com/securitieslendingnews/regulationarticle.php?article_id=223277&amp;amp;amp;amp;amp;amp;amp;navigationaction=regulationnews&amp;amp;amp;amp;amp;amp;amp;newssection=regulation\n\nhttps://finadium.com/judge-dismisses-qs-holdco-lawsuit-against-prime-brokers-based-on-claim-ownership/\n\nhttps://finopsinfo.com/trading/equilend-prime-brokers-sued-collusion-or-fair-game/\n\nhttps://www.globalcustodian.com/securities-lending-lawsuit-wall-street-banks-dropped/",
    "title": "A stock lending conspiracy - Equilend, Project Gateway and ‘The Five Families’",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nybmng/a_stock_lending_conspiracy_equilend_project/"
}