{
    "author": "Nalifi",
    "created_utc": 1623521983.0,
    "distinguished": null,
    "edited": 1624850987.0,
    "id": "nycuk4",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nycuk4",
    "num_comments": 780,
    "permalink": "/r/Superstonk/comments/nycuk4/cohen_has_reached_the_same_conclusion_as_ucriands/",
    "score": 9677,
    "selftext": "*This is not financial advice. I am a retard who always lets one banana in the bunch he buys go bad because I can’t time eating the bananas correctly.*\n\nUPDATE WITH LATEST RC TWEET:\n\n[https://www.reddit.com/r/Superstonk/comments/o6tax3/hi\\_all\\_its\\_ryan\\_cohen\\_t21\\_tweet\\_guy\\_im\\_losing\\_my/](https://www.reddit.com/r/Superstonk/comments/o6tax3/hi_all_its_ryan_cohen_t21_tweet_guy_im_losing_my/)\n\nTL;DR: CHANCE THAT THIS IS RANDOM IS NOW 0.0069543%!\n\nAnd another edit now that June 24th has passed:\n\nSo we are clear that T+21 did not happen Thursday, and probably not Friday either (due to the Juneteenth speculation). I reiterate that the main purpose of the post is to demonstrate that Cohen is aware of the mechanics behind this situation and price movement, and that shareholders are in good hands. However, I am inclined to present two main alternatives theses:\n\nA) SHF were able to reach the 100% net capital requirement, moving payment to T+28;\n\n[https://www.reddit.com/r/Superstonk/comments/o7g9mn/net\\_capital\\_and\\_t21/](https://www.reddit.com/r/Superstonk/comments/o7g9mn/net_capital_and_t21/)\n\nSpeculating that injection of 5 million shares through the offering allowed shorts to have enough money to pass the 75% net capital requirement. If that is the case we will see on July 5th/6th (Mon/Tues, depending on Juneteenth). Personally, I don't think dates are an issue. The public has a limited amount of information to work with and this is the best apes can do. Up until now, net capital cycles have been the best way to predict price movements, aside from T+35 day-per-day FTD's (refer to [u/dentisttft](https://www.reddit.com/u/dentisttft/) 's posts)\n\nB) SHF covered not only the previous cycle, but also the current cycle in the runup to 340.\n\nThe fact is, apes are going to buy and hodl anyways; many are immune to the dips at this point. I've already gotten hateful comments from gme\\_meltdown users trying to spread FUD in this forum (talk about brigading, huh?). Apes give constructive feedback, alternative theories, and support; remember this. And there is plenty of good news to come out of this week - I mean, Cohen *did make the tweet on supposed T+21*. And the price didn't go up; that's proof enough that the price movements are not due to his tweets but due to underlying mechanisms. \n\n# And the original post ---\n\n**This post will re-analyze Cohen's tweets and Gamestop's positive price movements in relation to** u/Criand's new T+21 net capital thesis.\n\n&#x200B;\n\nFirst of all I would like to lead you to Criand’s new post, “Revisit to Net Capital”.\n\n[https://www.reddit.com/r/Superstonk/comments/ny2ov4/a\\_revisit\\_to\\_net\\_capital\\_what\\_is\\_truly\\_driving/](https://www.reddit.com/r/Superstonk/comments/ny2ov4/a_revisit_to_net_capital_what_is_truly_driving/)\n\nI believe that TA does not apply to our favorite stock (but look forward to Elliot Wave guys proving me wrong), but the initial T+21/T+35 cycles were unique in that they don’t rely on normal stock behavior, and instead analyze the unique situation GME is in (excessive shorting, FTD’s). Additionally, it has had almost a 100% success rate at predicting price movements.\n\nI believe the net capital requirement thesis ties this together by eliminating loose ends in the previous theory, such as the shaky T+35 price movements, in addition to providing a solid explanation as to *why* these movements occur.\n\n**I decided to take this opportunity to revisit speculation on Cohen’s tweets/Gamestop major news**, their timing, and analyze if these were the causes of price movements (and thus not the actual cycles). I decided to investigate by going full retard on my only day off and investigating each news report compared to the net capital cycle. The result has my ***tits absolutely, indescribably jacked***\\*\\*:\\*\\*\n\n&#x200B;\n\n# If you’d like to follow along, let’s open Criand’s beautiful chart -\n\n[https://preview.redd.it/xh4u2ugmfs471.png?width=1438&format=png&auto=webp&s=85188eccc2bf3841bb98e37e5be98b8badcc01c7](https://preview.redd.it/xh4u2ugmfs471.png?width=1438&format=png&auto=webp&s=85188eccc2bf3841bb98e37e5be98b8badcc01c7)\n\nand take a look with some positive Gamestop news catalysts and tweets from our favorite Ryan Cohen. I’ll keep this area to data only and leave speculations for the end.\n\n&#x200B;\n\n# 1. The Ice Cream Cone\n\n[https://twitter.com/ryancohen/status/1364650709669601289](https://twitter.com/ryancohen/status/1364650709669601289)\n\nRyan Cohen tweets the famous ice cream cone on Feb 24, **lining up perfectly with the T+21** net capital requirement date. The price rockets that day. Edit: The tweet was at 1:57PM. A large influx of buying volume began in the morning (9:30, 10:30), and the spike came at 2:30PM. The tweet may have exacerbated the T+21 cycle, but did not cause it.\n\n&#x200B;\n\n# 2. Voluntary redemption of senior notes is announced.\n\n[https://news.gamestop.com/news-releases/news-release-details/gamestop-announces-voluntary-early-redemption-senior-notes-0](https://news.gamestop.com/news-releases/news-release-details/gamestop-announces-voluntary-early-redemption-senior-notes-0)\n\nGME announces a voluntary early redemption of senior notes on April 13th. Price spike is April 13 AH – T+14 date is April 15th. The positive news does not correlate with price movement.\n\n*Side note:* DFV Final Yolo update: April 16th\n\n&#x200B;\n\n# 3. Cohen train tweet.\n\n[https://twitter.com/ryancohen/status/1386485746916380673](https://twitter.com/ryancohen/status/1386485746916380673)\n\nApril 25th: Cohen tweets a train coming. South Park. **This is** **one day before the T+21** or 75% Net capital cycle. Additionally:\n\n# 4. Gamestop announces completion of the At-The-Market equity offering program.\n\n[https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program#:\\~:text=GameStop%20disclosed%20on%20April%205,time%20through%20the%20ATM%20Offering](https://news.gamestop.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program#:~:text=GameStop%20disclosed%20on%20April%205,time%20through%20the%20ATM%20Offering).\n\nThis news is **placed directly on the T+21** date. *Price spikes.*\n\n&#x200B;\n\nMay 3rd; Gamestop completes voluntary early redemption of senior notes, leading them out of debt.\n\nT+7 is May 5th, no price movement on this announcement. They also announce acquisition of a 700,000 sq. ft fulfillment center, resulting in *no price movement*.\n\nMay 11; Gamestop tweets man on the moon, T+14 is May 14th,\n\nMay 12, Gamestop Esports twitter profile is launched.\n\n**None of these announcements** result in significant price movement. Neither do Cohen's tweets in between T+21 dates. These should go to show that his tweets are not the *cause* of the price movements.\n\n&#x200B;\n\n# May 25, Ryan Cohen tweets “Don’t try this at home” at 12:32 AM, midnight before market open on the T+21 cycle the next day.\n\n[https://twitter.com/ryancohen/status/1397047791889879041](https://twitter.com/ryancohen/status/1397047791889879041)\n\n*Price spike.*\n\n&#x200B;\n\nLater that day, the Gamestop NFT is found. It has a launch date of July 14, 1 day before June 24 T+14 cycle.\n\n&#x200B;\n\nMay 29, Cohen tweets “R.I.P. dumb ass”, noting that the T+21 cycle has been figured out and the Hedgies. Are. Fuk.\n\n&#x200B;\n\n# Speculation:\n\nCohen is *fully aware* of the T+21 net capital loop that the hedge funds are trapped in. Given that both good news and hype tweets are clearly insufficient to result in a positive price movement (See: May 3rd, May 11, May 12, April 13), I am highly doubtful that an ice cream cone tweet is enough to drive up the price by over 100%.\n\nI believe that Cohen has had this figured out since very early on, and that’s clear in his tweet behavior on later T+21 dates.\n\n**This can also explain why Gamestop made the choice to conduct a share offering on 6/9 -**\n\n6/9, the Gamestop shareholder meeting, as meme of a date as it may be, is *not* on a significant net capital requirement date, and thus Cohen and friends were well aware that the price would fall again. To counteract negative sentiment, he announces the share offering; effectively, FUD immunity, because any negative movement can be attributed to it. Additionally, it provides *1 billion dollars* in capital for future positive announcements, which he can place on the T+21 dates; for example, the June 24 T+21, which is in close proximity to the Russel rebalancing. Note: So far, only Cohen tweets have lined up with T+21 dates. If positive Gamestop news; an acquisition, a dividend, NFT’s, esports deals lines up… oh god. No dates, but those with shares have nothing to worry about - they're in good hands. *Only up.*\n\n&#x200B;\n\n**Tl;dr:** Cohen is well aware of the T+21 dates and has lined up his own tweets *in clear indication* of it. The 6/9 ATM market offering, although I know many apes including myself were disappointed by, is basically FUD immunity as the price falls in between T+21 cycles. Furthermore, it raises capital for positive corporate announcements which can be lined up with T+21 dates, which so far, only Cohen tweets have lined up with. Positive news and RC tweets that are *not* on T+21 dates do not result in price movement, indicating that they are not the catalyst themselves, but may compound them.\n\n&#x200B;\n\n*We’re in good hands. If you hodl shares, there’s nothing to worry about. HODL!*\n\n&#x200B;\n\nEdit: formatting. If anyone has criticisms, announcements, or additional news that I missed, please comment below.\n\n*Not financial advice.*\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nEDIT: Guys I fucking missed one.\n\n# On March 25, Cohen tweets our smoky teddy,\n\n[https://twitter.com/ryancohen/status/1375159657166209031](https://twitter.com/ryancohen/status/1375159657166209031)\n\n**Lining up with the T+21** date on March 25th.\n\nWith this, out of 18 Cohen tweets since his activity in Gamestop, 4 of them line up with the 5 T+21 cycle days thus far, missing only the first one on January. While it is *possible* that this is a coincidence, given that there's about 180 days since the beginning of all this I don't think it's very likely. If anyone is a statistics legend and could calculate the probability that this is random it would be much appreciated. Also, I don't think there's much of another reason why he would tweet an ice cream cone.\n\nedit: Reached out to friend who is a statistics major. He just graduated and doesn't want to do math but his response was - \"Pretty sure though just from inspection it'll be statistically significant\".\n\nedit 2: Update - math wrinkle brain messaged me with:\n\n\"I can't post bc of karma but the probability of having at least 4 right dates on 5 while picking 18 out of 180 is **0.0339%**  It's an hypergeometric law.\"\n\nIn basically any statistical research model this is ***significant***. As always if anyone has any corrections to this please comment or message me. Tits jacked!\n\n&#x200B;\n\nFAQ: When is the next T+21?\n\nJune 24 (it says in chart)",
    "title": "Cohen has reached the same conclusion as u/Criand's T+21 Net Capital thesis: An analysis of tweet activity and corporate announcements",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nycuk4/cohen_has_reached_the_same_conclusion_as_ucriands/"
}