{
    "author": "DracoFinance",
    "created_utc": 1622659386.0,
    "distinguished": null,
    "edited": 1622724435.0,
    "id": "nqt026",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_nqt026",
    "num_comments": 82,
    "permalink": "/r/DDintoGME/comments/nqt026/the_dip_machine_and_the_62_spike/",
    "score": 507,
    "selftext": "The \"Dip Machine\" tweet seemed a little odd to me.  Most likely it was a reference to the ever-broken McD's soft-serve machines.  But maybe it wasn't.  \n  \nWhat if the tweet meant that GameStop (RC) knows that someone or something was going to be actively fighting the dips?  \n  \nWe saw this morning (6/2) that the expected dip wasn't as bad as we thought it might be due to the number of shares borrowed that morning.  Then, throughout the morning the price climbed rather than fell.  If I were fighting against someone, and I thought they were weakening or putting up a false front, I'd give them a hard PUSH to see how they react.  \n  \nThe 12:25ET spike.  The price went from 260 to 290 in just a few minutes.  The dip machine responded, but could only get it back down to $270.  \n\nAnd as I'm writing this, there was another spike at 14:15ET that pushed the price from 270 to 280, and the Dip Machine only brought it back to $275.  \n  \nThis is rampant speculation, but it really feels to me like the Dip Machine is indeed broken and someone is poking it with a stick to be sure.  \n  \nEDIT:  Thanks to /u/NinjaLip for pointing out the DD by /u/myplayprofile , [I got what you Quant](https://www.reddit.com/r/Superstonk/comments/nqzo1o/i_got_what_you_quant_6221_trading_analysis_and_a/?utm_medium=android_app&utm_source=share) that shows a solid causation between the spike and AMC's halt.",
    "title": "The \"Dip Machine\" and the 6/2 spike..",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/nqt026/the_dip_machine_and_the_62_spike/"
}