{
    "author": "ultrasharpie",
    "created_utc": 1618490091.0,
    "distinguished": null,
    "edited": 1618538232.0,
    "id": "mrdq66",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_mrdq66",
    "num_comments": 74,
    "permalink": "/r/GME/comments/mrdq66/tldr_imho_dont_buy_options_period_and_why_we_will/",
    "score": 874,
    "selftext": "Edit: imho= In My Honest Opinion\n\nEdit: please see link posted below by [u/diskodik](https://www.reddit.com/user/diskodik/)\n\nEdit: This was my first Real post, and what I learned is that 1 set of people understand what im saying and have learned through their own experience and appreciate it; and the 2nd set of people told me that i dont know what im talking about while I also respectfully do Not believe they know what they are talking about.\n\nOptions is the reason we keep seeing the price stay stuck in this price range. Because BOTH LONGS AND SHORTS make money here.\n\nThink of the Options market as the casino, it is literally designed that way. THE HOUSE ALWAYS WINS.\n\nEvery time we get a huge build up of call options, for instance like right now at $200c, the LONGS and SHORTS are going to be at a loss if they let those options be ITM.Institutions don't make their money on HODLING, they make their Money From OPTIONS by slowly moving the stock over longer periods of time. It jumps and it drops and the volatility gets expensive and they sell options and then they kill the volatility, and BOTH LONGS AND SHORTS MAKE MONEY.\n\nTHIS IS WHY LONGS ARE NOT YOUR FRIENDS.\n\nBut I can tell you one thing, LONGS are in CONTROL. Shorts have their nuts in a vice but they still take their money from poor suckers buying options in both directions.THIS IS WHY GOING BELOW 100 IS EXTREMELY UNLIKELY, because there are TOO MANY PUT OPTIONS there on EVERY DATE.\n\nYou think you are buying a lotto ticket because the price jumped, but you will LOSE.I know apes might be thinking, BUT DFV's options made him a ton of money. Yea, he definitely either knew the timing or he got really really Lucky.Yes you are right, there might be a Gamma squeeze, but not likely. The longs would lose too.But you could  buy another couple of shares instead of a $200c for $400.\n\nNow here is the way the price will move for the next two days because it gets the best premiums.You will see a Dip to <160, maybe 155 maybe 150, and they will sell a ton of put options for about $1000 each, and then the price will move up towards 190 but WILL NOT CROSS 195.\n\nWhat you will see is that when the $200c options start to cost about $1000 (which is $10 for the price) then the momentum will die. The price at that point will continue to slowly go up and then it will go back down until the $160p start costing about $1000. By the end of the week the MAX PAIN will be about 160 to 170, I cant narrow more than that right now.\n\nThey will avoid getting near $200 like the plague. Even if it gets to $200, it will have to stay there for a long time, possibly until tomorrow, to have a chance at the gamma squeeze.\n\nThis is all PURE SPECULATION, except maybe the part about institutions making money on options whether they are long or short.\n\nJUST BUY THE DIPS, DONT BUY OPTIONS.\n\nPS im just a poor ape with diamond hands and a semi wrinkle in the brain.",
    "title": "TL;DR imho DONT BUY OPTIONS. Period. And why we will never go below $100 again.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/mrdq66/tldr_imho_dont_buy_options_period_and_why_we_will/"
}