{
    "author": "CoastalHotDog835",
    "created_utc": 1615386559.0,
    "distinguished": null,
    "edited": false,
    "id": "m1yp2o",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_m1yp2o",
    "num_comments": 268,
    "permalink": "/r/GME/comments/m1yp2o/gme_news_over_240_million_shares_are_in_the_money/",
    "score": 4487,
    "selftext": "*HiHi, Before I get down to showing the data I just want to state that I'm taking on a new approach in posting and will uploading daily options flow data, as well as comparing it to the previous day. This is intended for informational purposes and acts as more news than DD.* \n\n# Yahoo Options Chain Data\n\n *Open interest gives you key information regarding the* *liquidity* *of an option, it reflects upon the number of contracts that are ACTIVELY held by investors and traders (These are the positions that have been opened and not closed yet).* \n\n**Recent data shows there are well over 24k calls still waiting to be exercised (Open Interest) that are In the Money (ITM)**, where the strike price is below the stock price. At its core, open interest paints a picture of how much capital is being injected into a given market. Keeping an eye on open interest is vital to identifying trends**, in that growing open interest signifies that an influx of money is likely to stimulate action and aid price extension.** \n\n# Calls\n\n[A brief snippet of the options chain. Blue highlight ITM calls](https://preview.redd.it/yf4kg5a4i7m61.png?width=1337&format=png&auto=webp&s=07c54bfec21171cea39237c3a5812d1d36f94b62)\n\n* **Over 24k calls are still open** \n* **24k calls = 2.40 million shares (1 option = 100 shares)**\n* **11.3k calls (1.12 million shares) between $250-$300 stock price**. **These are currently out of the money but if the pre-market price withholds and we open at $278, the strike prices between $250-$275 will be ITM as well.** \n\nStrike Price :\n\n*$200- 538,200 shares = $107million* \n\n*$225-116,100 shares=$26 million*\n\n*$240-143,200 shares=$34.4million*\n\n*$250-323,100 shares=$80.7 million*\n\n*All are ITM.*\n\nIf you compare the options chain with my DD from last week, you'll see a significant increase in open interest for the strike prices above $200. Oh boy, these hedgies are really fucked.\n\n# Put/Call Ratio\n\n&#x200B;\n\n[Barchart.com](https://preview.redd.it/y4ximnuam7m61.png?width=847&format=png&auto=webp&s=d4b62222bd6b78173abb7dd4c46eca8741279f01)\n\nFor the apes who don't understand, the lower the put/call ratio, the more bullish(strong buying) sentiment there is.  This is a significant decrease in value when compared to last week of over 4 (bearish)\n\n*Disclaimer, I've tried really hard not to post this as  DD lol, therefore it lacks info on what this data means and the sole purpose of this post is to provide information and the underlying prices/trend.*\n\n**TLDR: Do you retards still need a TLDR for such a short post? I guess I'll play on the safe side-**\n\n**I really don't see how the hedgies can escape from this, any analysis tool you pick up shows a strong buying sentiment from the market. I've covered Technical Analysis (Chart indicators) as well as fundamentals and they all show we're stoked to the fucking tits for the moon. 🚀🚀🙌💎**\n\nLike Always,\n\nLambos or Instant noodles, baby.🚗🚗",
    "title": "$GME News: Over 2.40 Million shares are In the money (ITM) 🚀🚀",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/GME/comments/m1yp2o/gme_news_over_240_million_shares_are_in_the_money/"
}