{
    "author": "pepsodont",
    "created_utc": 1616037397.0,
    "distinguished": null,
    "edited": 1616039911.0,
    "id": "m7hust",
    "text_only": true,
    "flair_text": "DD",
    "name": "t3_m7hust",
    "num_comments": 264,
    "permalink": "/r/GME/comments/m7hust/definitive_proof_of_cnbc_fuckery_video_from/",
    "score": 6213,
    "selftext": "If you wanted a definitive proof about who CNBC plays for, we got ya, retards. Thanks to eagle sight of u/Luxieto and help from u/HalinxHalo we got not one, but two pieces of evidence that CNBC doesn't shy from raw and pure manipulation.\n\nOriginal video: [https://www.youtube.com/watch?v=imRzHXRq80I](https://www.youtube.com/watch?v=imRzHXRq80I) \\- duration 04:37:06\n\nCNBC video: [https://www.youtube.com/watch?v=d2DU6DXfGPM](https://www.youtube.com/watch?v=d2DU6DXfGPM) \\- duration 04:17:58\n\nWe're missing about 20 minutes.\n\n\"Ahh, you crayon-eating poop-brain, they edited out all the cuts, breaks and stuff like that\" I hear you saying. Yep! But also, CNBC fucks also did some extra shillwork on it.\n\nAt 02:38:19 (original video) - French Hill comes on and during his 5 minutes, he has doubts about separation of Citadel's businesses. **In the CNBC version THERE IS NO FRENCH HILL. ERASED.**\n\nAt 02:45:59 (original video) - Cindy Axne comes on and during her 5 minutes asks about RH and Citadel's spreads, business practices. **CNBC keeps about 5% of her time in their version of the video, EVERYTHING ELSE GETS CUT.**\n\nYou can go check it out yourselves, it's there for everybody to see.\n\nWe already knew they weren't clean, but tampering with a congressional hearing video? Is it just me or do you also smell desperation?\n\nHODL monkey-brains, the end is near. 🚀🚀🚀🚀🚀🚀\n\nEDIT: I'm a Euroape, so enlighten me somebody please - isn't media manipulation a crime in US?\n\nEDIT2: Tweeted at Rep. Hill and Rep. Axne!\n\nEDIT3: Domo Capital noticed the same: https://twitter.com/DOMOCAPITAL/status/1372392637857169409?s=20 ",
    "title": "DEFINITIVE PROOF OF CNBC FUCKERY: Video from congressional hearing removed French Hill and Cindy Axne who asked uncomfortable questions about Citadel & friends",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m7hust/definitive_proof_of_cnbc_fuckery_video_from/"
}