{
    "author": "Rejectbaby",
    "created_utc": 1627080370.0,
    "distinguished": null,
    "edited": 1627098072.0,
    "id": "oqdfcw",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oqdfcw",
    "num_comments": 210,
    "permalink": "/r/Superstonk/comments/oqdfcw/after_moass_do_not_pay_outrageous_professional/",
    "score": 2432,
    "selftext": "1st Edit: the wash sale below comment is likely wrong according to other apes. I am no market expert. \n\nSo you did it, you won. Its after MOASS and you are now scared about your newly earned fuck-you money. The last thing you want to do is let predators separate you from your wealth because you are not used to dealing with \"professionals\".\n\n**Taxes:** You are going to have to pay taxes. Do not hire the first CPA that you find. Look for recommendations and shop around. I always advise talking to 3 firms. Speaking of firms, do not go to \"tax preparers\" who are just tax preparers. I know I will get a lot of hate for this, but stick to CPA firms. You are looking for firms who specialize in high-net-worth individuals. Of course they are all going to claim they do that, but ask around first. Ask beforehand what tax strategies they recommend and what makes them different.\n\n**Fees** should never be based on how much you have earned. The firm you are hiring should have a standard fee structure. Highly complicated returns with multiple state nexus issues can cost a lot of money. Most of you are not going to be in that category. Don't misunderstand, you are making a lot of money but your return is relatively very simple. You will receive a brokerage statement, with your earnings listed on the statement. That gets entered onto your schedule D. If you have no itemized deductions (house, real estate taxes, donations...) you are going to get the standard deduction which will make your return even more simple. So paying thousands of dollars for a relatively simple return does not make sense. **This if of course a hypothetical situation, and your situation is going to be unique to you. I AM NOT ADVOCATING THAT YOU FILE YOUR OWN RETURN BY YOURSELF.** You are free to do what you feel is best for you. I am simply pointing out that your return may not be that complex and should not cost as much as the moon. Get quotes from multiple CPA firms/Law firms in-terms of their expected fees.\n\n**Tax strategies**: okay this is where the CPA firm can really help you out, ***possibly***. Keep in mind, most tax strategies are BEFORE you earn your money/losses for the year. Few strategies work AFTER the fact. I am not going to go into strategies here because everyone's situations and goals are different. Is it possible for you to donate a large portion of your wealth? yes it is, but it's also possible to get in trouble for doing it wrong. Can you set up a charitable foundation? yes you can, but you need to make sure you have a good CPA to advise you on how to go about setting it up properly.\n\n**Basic forms:** Do not pay someone thousands of dollars to set up simple LLCs. You can do it yourself on websites like HUBCO or other services for a few hundred dollars. A lot of legal forms can be found on [legalzoom.com](https://legalzoom.com) and asking other apes is highly recommended. I am **NOT** saying to not get advice from an attorney, but just try and avoid predators who are going to drool over your wealth when they realize you are inexperienced. Again, look for reputable firms and talk to a few before you settle with any particular firm. There are subs on reddit for legal advise and tax advise. r/tax, r/legaladvice.\n\nWhy am I making this post? because I read a post on here where someone said to blindly pay $20,000 for a tax return once the MOASS was completed. I almost spit out my coffee when I read that. Can a tax return be that expensive? yes it absolutely can, it can cost even more possibly, but that's going to be based on the complexity of the return, not based on how much someone has in dollars in revenues.\n\n~~By the way, hypothetically speaking, if you were to take your gains after MOASS and (within the allocated time period allowed by the IRS) re-invest those gain back into GME, you would most likely have a wash-sale. A wash-sale is basically an increase/decrease in your basis and does not produce a taxable gain or loss. So hypothetically speaking, if you were to hold those delicious tendies as GME stock for a period of 1 year, any amount which was to be sold after that period would be subject to LONG TERM capital gains.~~ This part was wrong on my part. Wash sale rules will not apply. Thanks to great apes who make corrections. \n\nhttps://www.investopedia.com/terms/w/washsalerule.asp\n\nand since we are hypothetically speaking, if you were to acquire a lot of real estate assets and look into being classified as a \"real estate professional\", you could potentially do what the rich people do currently, which is to depreciate your assets using bonus depreciation in the year of acquisition, which would lower your capitals gain tax, again depending on your situation. This could potentially and theoretically decrease your tax liability to zero.",
    "title": "After MOASS, do NOT pay outrageous professional fees!!! here is a simple guide into what to expect.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oqdfcw/after_moass_do_not_pay_outrageous_professional/"
}