{
    "author": "nimrod8311",
    "created_utc": 1624888838.0,
    "distinguished": null,
    "edited": 1624903570.0,
    "id": "o9kucj",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o9kucj",
    "num_comments": 312,
    "permalink": "/r/Superstonk/comments/o9kucj/systems_disconnect_rule_nscc2021007_dtc2021011/",
    "score": 3439,
    "selftext": "**\\*This is not advice, legal, financial or otherwise. All views expressed are strictly personal ape opinions which should not be relied on.**\n\n*In my previous counter DD* [*https://www.reddit.com/r/Superstonk/comments/mwqkmu/interstellar\\_interdiction\\_counter\\_dd\\_on\\_potential/*](https://www.reddit.com/r/Superstonk/comments/mwqkmu/interstellar_interdiction_counter_dd_on_potential/)\n\n*I covered potential tactics which may be attempted to slow down or halt the MOASS. This counter DD post continues in that vein to analyse the new amendments DTCC has proposed in NSCC-2021-007, DTC-2021-011, and FICC 2021-004. All 3 filings are the same in substance.*\n\n*Please check out the other posts that have discussed this topic as well:*\n\n[*https://www.reddit.com/r/Superstonk/comments/o81bsl/lets\\_look\\_at\\_the\\_new\\_dtcc\\_regulatory\\_rule\\_filings/*](https://www.reddit.com/r/Superstonk/comments/o81bsl/lets_look_at_the_new_dtcc_regulatory_rule_filings/) *(credit:* [*u/ThrilHouse83*](https://www.reddit.com/user/ThrilHouse83/)*)*\n\n[*https://www.reddit.com/r/Superstonk/comments/o7vfvs/dtcc\\_update\\_submission\\_of\\_rule\\_filing/*](https://www.reddit.com/r/Superstonk/comments/o7vfvs/dtcc_update_submission_of_rule_filing/) *(credit:* [*u/Dismal-Jellyfish*](https://www.reddit.com/user/Dismal-Jellyfish/)*)*\n\n# Introduction\n\nNSCC-2021-007 / DTC-2021-011 proposes three areas of amendment to the relevant NSCC / DTC rules: a. Amending the confidentiality principles\n\nb. Amending the Force Majeure and Market Disruption clauses (Rule 60 of NSCC rules and Rule 38 of the DTC rules) to include the Chief Information Officer and the Head of Clearing Agency Services on the list of officers who can make a determination that a Market Disruption or Force Majeure event has taken place.\n\nc. Adding a new \"Systems Disconnect\" Rule (proposed new Rule 60A of the NSCC rules and Rule 38A of the DTC rules)\n\n***TA;DR 1***\n\n***DTCC has proposed a new Systems Disconnect Rule. Based on my experience in commercial litigation, the language for the proposed Rule is broader than necessary and could leave potential loopholes to be exploited if the DTCC wishes to act in bad faith. The loopholes can be closed off with better drafting of the proposed rule, which I will cover in this analysis as well.***\n\nBefore jumping in to analyse the \"Systems Disconnect\" Rule, it is important to understand the context behind its proposal: it looks to extend the Market Disruption & Force Majeure rule that already exists in Rule 60 of the NSCC rules and Rule 38 of the DTC rules.\n\n# Force Majeure\n\nForce Majeure is a legal term that first year law students learn in contract law:\n\n[Legal definitions of force majeure](https://preview.redd.it/hndcb02pd1871.png?width=1344&format=png&auto=webp&s=27cf89a20be59b9c1fa24f733d89bafdd4d1dcb1)\n\nEssentially, Force Majeure provides for a \"no fault\" situation when a party is unable to perform its obligations due to circumstances outside its control. Examples of force majeure include what is commonly termed as acts of God, such as earthquakes, tsunamis, pandemics (the Covid-19 pandemic was relied on in many litigation cases last year), and war. Generally, the application of this rule is very limited in its application.\n\nIn addition to the general force majeure events, the NSCC and DTC rules also refer certain other events, any of which will qualify as Market Disruption Events:\n\n[Rule 60 sec 1 of NSCC Rules; Rule 38 sec 1 of DTC Rules](https://preview.redd.it/09t8jksrd1871.png?width=1066&format=png&auto=webp&s=656bdbe50fa6dd6f5f81c36e18eded2ea5d2abd9)\n\nUnder sec 3 of this Market Disruption & Force Majeure Rule, the DTCC has broad discretion to suspend its services or order its Members refrain from or take action to \"prevent, address, correct, mitigate or alleviate the event and facilitate the continuation of services\".\n\nThe most important part of any force majeure clause is the \"no fault\" language in the clause. This is set out at sec 5 of the rule:\n\n[Rule 60 sec 5 of NSCC Rules; Rule 38 sec 5 of DTC Rules](https://preview.redd.it/j3md31btd1871.png?width=1118&format=png&auto=webp&s=1899e83e63a5bca605921c269b8f76e309fc0a2e)\n\nIf you find this clause familiar, that's because it has been replicated in the \"Systems Disconnect\" Rule as well. In effect, what this clause means is that any actions taken by DTCC under sec 3 that arises from a Market Disruption Event cannot be faulted and DTCC will not be liable for any consequences as a result. **Generally, such exclusion of liability should be acceptable to counterparties dealing with DTCC, because its scope of application is very limited: it only applies in the instances of force majeure (in this case Market Disruption Events) events, which should be rare, and in any case, outside of DTCC's control.**\n\n# Purpose of the Systems Disconnect Rule\n\nThe purpose of the Systems Disconnect Rule is very clear:\n\n[page 7 of 56 of SR-NSCC-2021-007](https://preview.redd.it/ko03mqyud1871.png?width=1062&format=png&auto=webp&s=b8696eca6d9081a8c0c4aa8edf9a65d07af5714e)\n\nIt is to allow DTCC to disconnect its Members' systems from DTCC's system in the event of an issue arising in its Members' systems which would disrupt DTCC's system. Specifically, the examples used by DTCC of cyber incident or system disruption implies that it is limited to technical issues, such as viruses or cyber-hacking or any other technical issue which may disrupt DTCC's system as a result of its Members' systems being connected to DTCC's system. This appears straightforward and benign enough.\n\n# Proposed Language of the Systems Disconnect Rule\n\nDTCC states in the next paragraph after the above quote (at p 7 of the SR-NSCC-2021-007): \"***The proposed Systems Disconnect Rule would be structured similarly to the Force Majeure Rule***\". Indeed, when comparing Rule 60 and the proposed 60A of the NSCC Rules (or Rule 38 and the proposed 38A of the DTC Rules), it is clear that they are almost the same, save for a few exceptions which we will cover next.\n\nAs a lawyer amending rules or clauses in an existing contracts, the aim is always to make as minimal amendments as possible but capture the essence of parties' intention in making the amendment. Therefore, on first reading, it was curious to me that, instead of amending the Force Majeure Rule to include \"System Disruption\" as one of the possible events that would give DTCC the rights to take action, DTCC chose to create a whole new rule instead.\n\nThe proposed language of the new Systems Disconnect Rule is set out at the end of the filings (p 54 of NSCC-2021-007 and p 52 of DTC-2021-011). In my view, the only reason why DTCC would choose to create a whole new rule instead of amending the Force Majeure Rule is because, despite their similarities, the Systems Disconnect Rule has additional aspects DTCC do not want included in the Force Majeure Rule.\n\n&#x200B;\n\n**1. THE DEFINITION OF \"MAJOR EVENT\"**\n\nIn the Systems Disconnect Rule, a \"Major Event\" is the equivalent of a \"Market Disruption Event\" in the Force Majeure Rule. It is the triggering event which gives rises to rights and powers of DTCC to take action to ensure the continuation of services.\n\nHowever, there is one key difference: a \"**Major Event**\" is defined as the \"**happening of one or more Systems Disruption(s) that is** ***REASONABLY likely*** **to have a** **significant** **impact on the \\[NSCC's / DTC's\\] operations**...\"\n\n\"Market Disruption Event\" in the Force Majeure Rule does not use the term \"***REASONABLY likely***\", only \"**likely**\". Why is this important?\n\nAs law students would learn, \"**reasonable**\" and \"**likely**\" are terms which carry their own legal meaning. \"**Likely**\" is straightforward enough - it simply means **more than a 50% chance of happening**.\n\n\"**Reasonable**\" however, is less straightforward, and is a term made famous by the law of negligence:\n\n[Source: https:\\/\\/www.lexology.com\\/library\\/detail.aspx?g=d59a11b6-0296-48b6-8251-7684586430fa](https://preview.redd.it/ifb0613zd1871.png?width=1512&format=png&auto=webp&s=c288381722dfae26f6dc3f248e6ba0d2c3c91c90)\n\nA test to decide what is reasonable is that of a hypothetical ordinary person in the shoes of the person who had acted - what would such a hypothetical person do?\n\nAs you can see, the determination of what is reasonable can often be difficult, and often it is only what is **very clearly unreasonable** that would be found to have breached this standard of reasonableness. **In other words, in this case, the use of the \"reasonableness\" term creates even more of a gray area for DTCC to say that a Major Event has occurred.**\n\n**2. WHEN DTCC CAN EXERCISE ITS POWERS**\n\nWe discussed how the use of the term \"**reasonable**\" can create a gray area for DTCC to operate in. Guess what, DTCC does it again when its officers determine when a Major Event has occurred.\n\nAt section 2 of the Systems Disconnect Rule: \"**The determination that \\[NSCC / DTC\\] has a** ***REASONABLE BASIS*** **to conclude that there has been a Major Event and shall be entitled to act**...\"\n\nBearing in mind also that a \"Major Event\" already has a \"***reasonably likely***\" standard already built into its definition, it expands the gray area for DTCC to act in even more. **In other words, as long as DTCC has** ***REASONABLE BASIS*** **to conclude that the happening of one or more Systems Disruption(s) is** ***REASONABLY likely*** **to have a significant impact on the \\[NSCC's / DTC's\\] operations, then DTCC can exercise its powers.** **It is the reasonableness standard to the power of 2.**\n\nThis second instance of \"reasonable basis\" is not present in the equivalent section of the Force Majeure Rule either.\n\n**3. DTCC'S (TOO) BROAD POWERS**\n\nBased on the above comparison to the Force Majeure Rule, we can see already that there is much greater gray area for DTCC to conclude that a triggering event that allows NSCC / DTC / FICC to step in and exercise their powers under the Systems Disconnect Rule.\n\nCompounding this further is the fact that the proposed language goes beyond what is necessary to achieve the purpose of the rule, i.e. to protect DTCC systems from any technical disruptions or cyber attacks.\n\nAgain, going back to the definition of a \"Major Event\":\n\n[p 54 of SR-NSCC-2021-007](https://preview.redd.it/atqj0z91e1871.png?width=1060&format=png&auto=webp&s=f22ef51385414c184e79f971d906ab18ee6b758a)\n\nDTCC Systems is defined as:\n\n[p 54 of SR-NSCC-2021-007](https://preview.redd.it/br26mlg2e1871.png?width=1078&format=png&auto=webp&s=f25208c1ac113cafcee7dad22df54aaf6dd18ba1)\n\nYou can see that the definitions of \"**DTCC Systems**\" and \"**Systems Disruption**\" all refer to systems, equipment and technology networks of DTCC or the Participants' own systems. It is all technical in nature.\n\nHowever, the definition of \"**Major Event**\" goes ***beyond*** just technical systems: **it is any Systems Disruption that is reasonably likely to have** ***significant impact*** **on DTCC's OPERATIONS** (***including*** **the DTCC Systems) THAT AFFECT THE BUSINESS, OPERATIONS, SAFEGUARDING OF SECURITIES OR FUNDS, OR PHYSICAL FUNCTIONS of \\[NSCC / DTC\\], Members or market participants.**\n\nThe use of the word \"including\" is also another legal term of art. It basically means one example, but is not the only possibility. So an event affecting the technical systems is only one possibility of a Major Event - in other words, **any Systems Disruption event that is reasonably likely to affect DTCC's operations can be a Major Event, even if they do NOT affect DTCC Systems**.\n\n**Illustration:**\n\na. GME prices goes up, Shitadel claims that its systems are not able to function properly and there is failure of its systems. **This is a Systems Disruption**.\n\nb. DTCC now has to decide whether that this Systems Disruption is reasonably likely to have significant impact on NSCC's / DTC's operations. If there is potentially MOASS, with NSCC / DTC on the hook for any losses which Shitadel or the other SHFs cannot pay, then yes, it is reasonably likely to have significant impact on their operations. **DTCC claims that a Major Event has occurred.**\n\n**c. What can DTCC do once a Major Event has occurred?** It can (a) disconnect the Participant's systems from the DTCC Systems, (b) suspend file transfers or communications between the Participants and DTCC, or:\n\n[p 55 of SR-NSCC0-2021-007](https://preview.redd.it/6b9lcsm9e1871.png?width=1072&format=png&auto=webp&s=4671f6cdde6cd34f873454c8e336a476e2c373a2)\n\n**Essentially, DTCC can take any and all action that it consider appropriate to address the Major Event and facilitate the continuation of services.**\n\n**4. EXCLUSION OF LIABILITY**\n\n**Crucially, similar to the Force Majeure Rule, any action taken by DTCC, its Affiliates or officers under the Systems Disconnect Rule is excluded from liability, since the Systems Disconnect Rule also incorporates a similar exclusion of liability clause in section 5 of the Systems Disconnect Rule.** **Therefore, at least under this proposed Rule, they will not be held liable for the consequences of their actions.**\n\n# Conclusion\n\n**There have been several posts on this filing, including** u/Criand **'s comment in this post:** [**https://www.reddit.com/r/Superstonk/comments/o7vfvs/dtcc\\_update\\_submission\\_of\\_rule\\_filing/h3301r4/?context=3**](https://www.reddit.com/r/Superstonk/comments/o7vfvs/dtcc_update_submission_of_rule_filing/h3301r4/?context=3) **that this new amended clause is nothing to worry about.**\n\nI agree that if DTCC sticks to its stated purpose of the Systems Disconnect Rule, there should be nothing to worry about. However, if DTCC wishes to fulfil the stated purposes of the System Disconnect Rule, then it does not need to have the \"gray areas\" or such unfettered broad powers. Of course, there may also be a counter interpretation which is that DTCC wants to be able to step in to ensure that Shitadel does not take any further illegal action, and having these \"gray areas\" and broad powers benefits the apes if DTCC's interests are aligned with the long interests.\n\nHowever, since the amendment is now at the comment stage, and there is opportunity to query DTCC on this issue, it may be worthwhile to provide comments such that the language of the proposed Rule does not go beyond its intended purpose. Some of my own comments would include:\n\n1. If the stated purpose of the Systems Disconnect Rule is to protect DTCC Systems, then the Systems Disconnect Rule should be limited to just technical systems issues which may affect the DTCC Systems.\n2. The references to \"***reasonably likely***\" and \"***significant impact***\" in the definition of \"**Major Event**\" are unclear and unnecessary. \"**Reasonably**\" should be deleted and \"**significant**\" replaced by \"**material**\" to be consistent with the Force Majeure Rule.\n3. \"**Major Event**\" should only be limited to events which affect DTCC Systems, therefore this phrase \"***the Corporation's operations, including the DTCC Systems,*****\"** should be replaced by \"**the DTCC Systems**\" only (i.e. to delete \"**the Corporation's operations, including**\")\n4. It would also be helpful to state categorically at the end of the \"**Major Event**\" definition that \"**For the avoidance of doubt, a 'Major Event' does not include any events which occur only due to the operation of normal market forces.**\"\n5. The reference to \"***reasonable basis***\" at sec 2 of the Systems Disconnect Rule is unclear and unnecessary, and the word \"**reasonable\"** should be deleted.\n6. It would be appropriate to include the \"**reasonable**\" criteria at sec 3(c) of the Systems Disconnect Rule rather than the other parts of the Rule. Proposed amendment to this phrase at **line 2 of sec 3(c)**: \"**any and all** ***reasonable*** **action\"**.\n7. For sec 5 of the Systems Disconnect Rule, DTCC should also include an **exception** to the exclusion of liability **in the event of negligence or fraud**. This is a standard exception of exclusion of liability clauses.\n\nIf DTCC adopts the above comments, I believe it would achieve the stated purpose of the Systems Disconnect Rule without the potential of using it beyond its stated purpose.\n\n***TA;DR 2***\n\n***There are potential loopholes in the proposed Systems Disconnect Rule, and it may still be prudent to use this period of commentary to the filings to propose that certain changes be made to the proposed Systems Disconnect Rule to ensure that the language used is clear and these loopholes are minimised.***\n\n&#x200B;\n\n**Edit 1: I'm getting a lot of comments on Force Majeure and how DTCC can invoke it during MOASS. To be clear, this post is not on the Force Majeure Rule (which is already part of the NSCC and DTC Rules). I do not believe that it will be that easy for DTCC to invoke Force Majeure under the present rules, and that may be why they are attempting to pass this new Systems Disconnect Rule to recreate a force majeure rule with lower thresholds. This post is about the Systems Disconnect Rule and its potential loopholes, and how we should use the opportunity to provide our comments to SEC at this commentary stage.**\n\nEdit 2: I've got some questions on how apes can submit comments to DTCC / SEC. There are three ways of doing it: (a) the formal way is to submit comments on SEC's website (but I don't see this amendment on the SEC website yet so may have to wait a little), (b) the second way is to email SEC and (c) to send it hard copy comments to SEC. You can check out any of the proposed rule filings - there is a couple of pages at the end which set out instructions for sending in comments. \n\n**Edit 3: ALSO TO BE VERY CLEAR IM NOT PROPOSING FLOODING DTCC AND SEC WITH THE ABOVE COMMENTS. It would be strange if a lot of people start messaging the same comments to DTCC and we don't want to be accused of manipulation or acting in concert. Please read my DD and if you understand and agree with it, you can make your own choice on what to do next.**\n\n**Edit 4: There are a number of comments where people are becoming unduly worried and creating FUD as a result. Please remember that at the end of the day, buy and hodl still remains the trump card. Shitadel, the SHFs, DTCC may create backdoors or try to resort to other tactics but any action that they take also comes along with risk such as subsequent civil and criminal litigation. The bigger the action, the bigger the risk of consequences. So if you believe in the stock, nothing has changed. Buy and Hodl.**",
    "title": "Systems Disconnect Rule: NSCC-2021-007, DTC-2021-011 & FICC 2021-004",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9kucj/systems_disconnect_rule_nscc2021007_dtc2021011/"
}