{
    "author": "B1rdBear",
    "created_utc": 1627849266.0,
    "distinguished": null,
    "edited": 1627854950.0,
    "id": "ovziwv",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_ovziwv",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/ovziwv/campaign_contributions_to_the_representatives_who/",
    "score": 1814,
    "selftext": "Continued listings of political contributions from benefactors of the current unequal market structure to the Reps on the Financial Services Committee who voted AGAINST the Short Sale Transparency and Market Fairness Act. See part 1 for additional context: [https://www.reddit.com/r/Superstonk/comments/ovz88q/campaign\\_contributions\\_to\\_the\\_representative\\_who/](https://www.reddit.com/r/Superstonk/comments/ovz88q/campaign_contributions_to_the_representative_who/)\n\n&#x200B;\n\n**Bryan Steil**\n\nhttps://preview.redd.it/hqlp3k8pzse71.png?width=484&format=png&auto=webp&s=27e6221a01b09d6b2080c8314b8231d9b8354084\n\n**William Timmons**\n\nhttps://preview.redd.it/mmqyinsyzse71.png?width=484&format=png&auto=webp&s=612359c139ae7b94904ebc22244a0aeb68016cd2\n\n**Van Taylor**\n\nhttps://preview.redd.it/0xknrk650te71.png?width=484&format=png&auto=webp&s=70192dd0c9a1b634a06532810e160002fb57c0f1\n\n&#x200B;\n\nTLDR Summary;\n\n* **Every single one** of the politicians who voted against the Short Sale Transparency and Market Fairness Act has received campaign contributions from some combination of hedge funds, big banks, \"family offices\" (another type of HF), or other investment group that benefits from the current market structure.\n* Blackstone Group has their name all over these politicians.\n* Bk2 Holdings is a weird shell \"dark money\" company linked to a billionaire HF manager and has their hand in a lot of these pools.\n* UBS and Bank of America are other VERY COMMON names on these lists. Wells Fargo to a slightly lesser extent also.\n* The **DTCC** and other clearinghouses are on some of these lists. Yes, that DTCC!!!!!\n* Remember this is only the Reps on the Financial Services Committee who voted against this bill. The bill will at some point go to the House floor for a full vote. Call, email, tweet at, do everything to contact your Reps that may be on this list and request an answer to why they voted against a bill that goes against the best interests of their constituents. Demand answers!\n\nedit 1: some of you have also pointed out that the **OCC (options clearing corp)** is also on this list, yikes!\n\nedit 2: u/probablyannsaplant pointed out that you can use [opensecrets.org](https://opensecrets.org) to do the inverse and look at where, for example, Ken Griffin donated money. It really is a great tool for seeing the corruption that permeates the system.\n\nedit 3: u/deal_ambitious made an excellent suggestion of cross referencing these institutions with those that fund the politicians who voted in favor. Summarized findings:\n\n* Blackstone is common on the yes voters as well.\n* The DTCC is actually **more commonly** found on the yes voters top 20 lists than the no voters.\n* UBS is less common on yes voters, but still on some of their lists. Same with Wells Fargo\n* Bank of America is **nowhere to be found** on the lists of yes voters! Nor is Bk2 Holdings.\n* I want to re-emphasize that last point. **Bank of America is an extremely common donor to the No voters, and non-existent in the top 20 lists of yes voters. BK2 holdings as well**",
    "title": "Campaign Contributions to the Representatives who voted against the Short Sale Transparency and Market Fairness Act - FOLLOW THE MONEY - Hedge funds, big banks, and family offices get these crooks elected - PART 2",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ovziwv/campaign_contributions_to_the_representatives_who/"
}