{
    "author": "bobsmith808",
    "created_utc": 1622908815.0,
    "distinguished": null,
    "edited": 1624590642.0,
    "id": "nsyw3k",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nsyw3k",
    "num_comments": 115,
    "permalink": "/r/Superstonk/comments/nsyw3k/ftd_cycle_mapping_into_the_future/",
    "score": 1538,
    "selftext": "Hi everyone, bob here. I know we have been watching the FTD cycle a lot lately and it's looking like a solid predictive tool, so I thought I'd map it out for the next 5ish cycles to see if we can make some predictions since I have only seen this done retroactively so far.  If it already exists, please let me know and i'll remove the duplicate content.\n\n**Edit**:  If anyone has identified any cycles not on here, please let me know and i'll add them and update the post.\n\n**Edit**: adding data sources and prereq reads & formatting\n\n**Data Sources**:\n\n* [T21 FTD Cycle](https://www.reddit.com/r/Superstonk/comments/nksg03/t21_ftd_cycle_may_2526th_if_we_can_break_through/) by  [u/ihatedmyboss](https://www.reddit.com/user/ihatedmyboss/)\n* [T+35 Option Delivery (MM) to T+21 Infinity Cycle](https://www.reddit.com/r/Superstonk/comments/nf22qz/theory_on_the_ftd_loop_missing_link_a_t35_surge) by u/criand\n* omnieq\\[.\\]com (reddit blocks this)\n\n**Historical Option Data**: look it up at omnieq(.)com.  Reddit blocks any posts linking to that website for some reason... Very sus if you ask me.\n\n**Disclaimer**: This is not financial advice, I don't know what I am talking about, and I just had a block of time I should have been working at my day job, but instead decided to map this out **by hand**. I am a moron, but am learning since taking a deeeeeeep dive into our beloved stonks and our fuckery-filled markets beginning last year. So, I'd obviously be the last person you'd want to listen to for financial advice.\n\n**So... Dates**\n\n&#x200B;\n\nhttps://preview.redd.it/39fd4y2i6x571.png?width=1407&format=png&auto=webp&s=877f1ff2c74c56b6e10c785403507f9381ecbee1\n\nI know we don't' do dates, but I like dates and wish I had could get one... my wife doesn't seem to have this problem. The best I can do with dates is this:\n\nhttps://preview.redd.it/cj917ypz4x571.png?width=567&format=png&auto=webp&s=2e48a9517d95ed3486290b69b8c4708aefbac01f\n\nIf I screwed up the count, please let me know and I'll update the post. I did to my best - I used all my fingers and toes, and other things I could count to track this - the +21 was less tricky than the +35 though!\n\n**Edit**: Updated the dates, which were a day off from my counting method.  Now I've enlisted the help of robots, which are infallible and will be our masters in the future, so I'm trying to make friends now.\n\nWhen we plug these dates into a matrix, it looks like this:\n\n&#x200B;\n\n[Bolded dates = wambo combo possibility](https://preview.redd.it/3c9bcz7iwb771.png?width=645&format=png&auto=webp&s=544ab41cd55e68d6d53e6060e9d94b0e3c238953)\n\nWhen things line up closer, we seem to get bigger jumps, historically speaking in the price, but there's been more than enough DD on this, and I'm a forward thinking kind of ape at the moment so we'll do dates but no prices. In the words of our forefather, [u/deepfuckingvalue](https://www.reddit.com/user/deepfuckingvalue):\n\nhttps://preview.redd.it/otswbcw8d2471.png?width=356&format=png&auto=webp&s=64e013126afe0a011c5f59ec8f134458736b7f8c\n\nThe point of this exercise is to be looking to predict possible market action based on the cycles that seem to be really, *really,* reliable since January.\n\nIt did occur to me that if RC hits the launch button, all of this information might be kind of worthless, but with the fuckery afoot, it might still be useful – like in the case of a long squeeze like TSLA did last year. You could still predict the bumps and stair stepping action we’ve been seeing until now.\n\n**Obligatory**: 🚀🚀🚀🚀🚀",
    "title": "FTD Cycle mapping into the future.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nsyw3k/ftd_cycle_mapping_into_the_future/"
}