{
    "author": "Vipper_of_Vip99",
    "created_utc": 1620395499.0,
    "distinguished": null,
    "edited": 1620424472.0,
    "id": "n6yz3l",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_n6yz3l",
    "num_comments": 193,
    "permalink": "/r/Superstonk/comments/n6yz3l/fed_signals_trouble_ahead_buckle_up_not_setting/",
    "score": 3051,
    "selftext": "Many of us have assumed that the MOASS will be paralleled by a broad and significant market downturn.  Given that the SEC, FED, DTCC and other agencies and institutions know roughly how GME may play out, it would not be surprising to see the FED telegraph the MOASS (and accompanying market correction/crash) in advance. Thus, I have been keeping an eye out for signals from the FED.\n\nLet me assume for a minute that the quotes CNBC pulled for this article are accurate:\n\nhttps://www.cnbc.com/amp/2021/05/06/fed-warns-of-possible-significant-declines-in-stocks-as-valuations-climb.html\n\nThese would be statements by the FED in their semiannual Financial Stability Report. I haven’t had a chance to find the original source. **Edit see source link below**.  🐻 Bear with me. Here are some quotes from the FED:\n\n“High asset prices in part reflect the continued low level of Treasury yields. However, valuations for some assets are elevated relative to historical norms even when using measures that account for Treasury yields,\" the report states. \"In this setting, asset prices may be vulnerable to significant declines should risk appetite fall.\"\n\nThis is bearish for the markets.\n\n“In an accompanying statement, Fed Governor Lael Brainard said the situation bears watching and points out the importance of making sure the system has proper safeguards. She specifically mentioned having banks increase their capital requirements during economic expansions as a buffer against downturns.”\n\nOk....warning banks about capital requirements/liquidity....\n\n“Vulnerabilities associated with elevated risk appetite are rising. Valuations across a range of asset classes have continued to rise from levels that were already elevated late last year,\" Brainard said. \"The\ncombination of stretched valuations with very high levels of corporate indebtedness bear watching because of the potential to amplify the effects of a re-pricing event.\"\n\nOk now basically straight up warning of a “re-pricing event”. I think they mean correction? The above is a clear warning about “corporate indebtedness” (read: LEVERAGE). Don’t believe me? \n\n“The Fed goes into a few specific scenarios that show potential risks to the system. It specifically talked about the Archegos Capital Management episode, when the firm could not meet margin calls, causing several large banks to take big losses.”\n\n\"While broader market spillovers appeared limited, the episode highlights the potential for material distress at [nonbank financial institutions] to affect the broader financial system,\" the report said.\n\nOk this is basically a straight up warning that “non bank institutions” (read: HEDGE FUNDS) could affect stability of the financial system.\n\nDoesn’t get more bearish than that! And you know what that means for GME! 🚀🚀🚀\n\nEDIT: here is the link to the report source \n\nhttps://www.federalreserve.gov/publications/files/financial-stability-report-20210506.pdf\n\nBig thanks to u/Purple-Artichoke-687 for helping me with that.",
    "title": "FED signals trouble ahead. Buckle up. (Not setting dates, this is not a hype post).",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n6yz3l/fed_signals_trouble_ahead_buckle_up_not_setting/"
}