{
    "author": "pinkcatsonacid",
    "created_utc": 1628516867.0,
    "distinguished": "moderator",
    "edited": 1628543312.0,
    "id": "p11sk7",
    "text_only": true,
    "flair_text": "👍 Court of Public Opinion 👎",
    "name": "t3_p11sk7",
    "num_comments": 579,
    "permalink": "/r/GMEJungle/comments/p11sk7/icymi_new_rule_no_qanon_illuminati_deep_state_etc/",
    "score": 3493,
    "selftext": "This deserves a standalone post after this past weekend.\n\n&#x200B;\n\n**ABSOLUTELY NO POLITICAL QANON BULLSHIT IN THIS COMMUNITY.**\n\n&#x200B;\n\nThere are tons of other dark corners of the internet to discuss, keep it out of the Jungle.\n\n&#x200B;\n\nNo one is trying to silence you. The topic simply isn't welcome here. ✌\n\n&#x200B;\n\nIt's written in the rules to avoid political name dropping whenever possible to avoid skewed political discussion in this forum. Example: when discussing a president or other political office, try to refer to their office title and years of their term instead of their name. It helps throw off bots searching to stir up trouble.\n\nEdit: Political discussion in relation to GME i.e.- Senate Committee Meetings, Treasury and Fed talk, etc... is ofc still allowed. You can't talk stocks without a little politics. It is expected to stay non-partisan. \n\n&#x200B;\n\n**THIS IS NOT AN EXTREMIST GROUP IN ANY WAY. WE JUST LIKE THE STOCK.**\n\n# \n\n# [Read the Jungle Update to catch up on more.](https://www.reddit.com/r/GMEJungle/comments/p056p1/jungle_update/)\n\n&#x200B;\n\nEdit: This includes sweeping generalizations about groups sharing a last name. From a comment below regarding Rothschilds:\n\n>If there's a well researched and resourced DD about someone directly tied to GME that happens to have that name, then that's no different than any other name being DD'ed. But the throwing around of names and lumping entire groups together because they share a last name, that's the definition of ~~racist~~ discrimination.  \n>  \n>We wouldn't allow someone to make general statements here about how all Cohens are evil and trying to take over the global market just because of Steve Cohen. Remember our chairman shares that last name, as do thousands, possibly millions of others who have never met Steve.  \n>  \n>TL;DR- Yeah that includes Rothschilds. Specific DD on a specific person is the only acceptable entry in that regard.",
    "title": "ICYMI- New Rule- No Qanon, Illuminati, Deep State, Etc. Conspiracies. This is a $GME sub!",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GMEJungle/comments/p11sk7/icymi_new_rule_no_qanon_illuminati_deep_state_etc/"
}