{
    "author": "cleareyeswow",
    "created_utc": 1625590885.0,
    "distinguished": null,
    "edited": 1625593420.0,
    "id": "oez4wy",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oez4wy",
    "num_comments": 86,
    "permalink": "/r/Superstonk/comments/oez4wy/shfs_losing_the_psychology_war/",
    "score": 1091,
    "selftext": "How’s this for FUD; I’m **bored**, **tired**, **impatient**, **frustrated** and occasionally **doubtful**. As I watch my parents age and feel the fire of mortality on my asscheeks, I wonder if I should take my GME gains and start another venture so at *least* they can buy a house to retire in. Captain Hook has long been a pile of reptile shit and Tick-Tock the Croc is back on the clock.\n\nThere’s only *one* thing that could make me feel worse about this whole situation and that would be **SELLING**! It’s painful even to consider. The thing hedgies want most is the last thing I’d consider a *solution* to my problems. Funny how that backfired on them eh?\n\nThere is, however, a *long* list of things that make me feel *better*:\n\n**1.** **BUYING MORE** 😅 Every time I buy more it unlocks a new level on my favorite mobile game, *Calculator*.\n\n**2.** GME *consistently* **dips** on *good news*. (Who *didn’t* see today’s dip coming after announcing west coast fulfillment?) This shit is all the confirmation bias I *need* to see we are **right**.\n\n**3.** GameStop’s constant improvement with customers, their website, product expansion, etc. (watch what we do, not what we say)\n\n**4.** **THE VIDEO GAME & TECH INDUSTRY**. This is the future of entertainment and convenience. It’s everything. We know it, RC knows it. Barring an apocalyptic, grid-destroying event- this shit ain’t goin’ nowhere and it’s only going to get better and better. If you know, you know.\n\n**5.** And finally you fucking **APES**. Who knew there were so many *decent* degenerates in the world? How could I leave this community? Why would I subtract this level of chaotic positivity from my life? I can’t afford to.\n\n**Isn’t it ironic? Don’t ya think?**\n\nEvery SINGLE tactic SHFs have used and continue to use to shake us off does *exactly* the opposite. It’s an infuriating and hilarious dance.\n\nIf GME had slowly climbed from $40 with little bumps on good news I probably would have believed shorts had covered bc the stock was behaving somewhat normally. I probably still would have invested, but not as heavily and with such conviction. *They. Fucked. Up.*\n\nWe are *pacified* by the shares we buy during the dips they hope will shake us.\n\nWe are *emboldened* by downward movement on positive news.\n\nThe serpent continues devouring its tail in a negative feedback loop unwittingly optimized for apes 🙂\n\nIt’s amazing what people can adapt to and I’m adapting to this. I can buy and hodl *indefinitely*, let’s see who runs out of money first.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "SHFs LOSING the Psychology War?",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/oez4wy/shfs_losing_the_psychology_war/"
}