{
    "author": "dbx99",
    "created_utc": 1625557735.0,
    "distinguished": null,
    "edited": false,
    "id": "oeqc0q",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oeqc0q",
    "num_comments": 167,
    "permalink": "/r/Superstonk/comments/oeqc0q/we_think_of_the_moass_starting_when_hf_get/",
    "score": 3792,
    "selftext": "Does a tree exist when the first shoot emerges from the surface of dirt into the air?   Or does it begin deep below ground when the seed, hidden from the sun germinates and starts sending its sprout toward the surface?  What about fungus - does it exist when the mushroom appears? Or is that just the fruiting body and the real work of life happen as the mycelium spreads to develop its growing network of multi celled colonies?\n\nThis is a semantic exercise but it is also substantive.  \n\nThe MOASS did start.  But it did not end.  So it is somehow suspended in a weird frozen state - having lifted off the launchpad but hovering above the surface and not gaining altitude.  \n\nIt is of course an unnatural state.  We all know it through data. But more than that, we can even feel it on a instinctual level - we can detect that the price is wrong, the price isn’t moving despite the buying and buying and the not selling.  \n\nSo I’m saying MOASS has been happening all along.  We just haven’t been able to reach the moon yet.  \n\nAnd so much of this feels familiar.  \n\nLet me tell you a short personal story.  \n\nMiddle class workers in the animation industry found themselves in a weird predicament back in the early 2000s.  Talented hard working artists noticed that we couldn’t move from our jobs.  No other studio would hire us from one studio to another.  Upward career movement depend a lot on moving from one job to another.  But strangely most of us just could not get hired despite good performance and proof of competency. \n\nThe secret ingredient was crime. \n\nhttp://animationlawsuit.com/\n\nThis suit proved it was happening. As well as tech industry folks as this class action stemmed from the Google antitrust class action case. \n\nWhat was uncovered was the existence of an informal gentlemen’s agreement that all the major animation studios would not hire from each other. A blatant violation of anti trust laws and labor practices. This suppressed our wages for at least ten years and hamstrung many of our careers.  \n\nIt was a coordinated attack by the very powerful against the least powerful.  \n\nFeel familiar?  Just like this stock, the very powerful conspire to exploit the weak.  It is a reality of our system.  \n\nSo don’t doubt the accusations.  It is the way of the wealthy.  It has been happening everywhere for generations.  \n\nWe were given some settlement cash to fuck off and they got off easy and enjoyed being able to deny having done the crime by settling out of court with no admission of wrongdoing. \n\nSo MOASS ?  It is happening. It’s just that there’s still malice and fight left in them.  \n\nBut the many who are weak can still win against the few that are powerful.   I am a genX who is old enough to have gotten fucked more than once or twice in my life by such conditions.  \n\nSo it means a lot to me to see this MOASS moon.  I believe in it.  Shorts must cover. HF must collapse.",
    "title": "We think of the MOASS starting when HF get liquidated and shorts are covered by machines following an automated process but I believe the MOASS started in January and is happening now in a fight to delay the launch",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/oeqc0q/we_think_of_the_moass_starting_when_hf_get/"
}