{
    "author": "bloodhound1144",
    "created_utc": 1624115541.0,
    "distinguished": null,
    "edited": 1624159775.0,
    "id": "o3i7j5",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_o3i7j5",
    "num_comments": 191,
    "permalink": "/r/Superstonk/comments/o3i7j5/big_money_started_runnin/",
    "score": 2468,
    "selftext": "Edit 2: Thank you for all the awards. They really aren't necessary. Also, reddit is a little screwy today. I like to say thank you to everyone who sends me an award. Some awards that I've been given didn't come with a notification. So, I will say Thank You here.\n\nEdit/correction: The FED is paying the banks to hold the cash, not the banks paying the FED. I'll leave this like this to avoid editing the original post.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nIn order to gauge what's going to happen, or to see what's about to happen, the quote has always been \"Follow the money\". Basically, that means, what are the rich doing? The whales have always moved the markets. Either by buying, or by selling.\n\nThursday and Friday showed that the \"big money\" is running. They aren't making their exits quiet either. In their case, holding the bag could mean billions of dollars and years of waiting. Extreme losses are not something they're fold of.\n\nThe first few start a chain reaction that others always follow. FOMO is very real when it comes to the big players. From their actions, the peaks and valleys are determined simply by how they feel.\n\nThey also have a much larger view of what is happening, or about to happen and their emotions do take over eventually.\n\nThe cascading effects have big implications for everyone that doesn't react.\n\nI looked at some Financial ETF's, indexes and the two Berkshire Hathaway stocks (BRK-A and BRK-B).\n\nThe game of dominoes has begun....\n\nLet's look at the top banking ETF's first.\n\n(The top 35 are listed here: [https://etfdb.com/etfdb-category/financials-equities/](https://etfdb.com/etfdb-category/financials-equities/) )\n\n&#x200B;\n\n[Top 5](https://preview.redd.it/xsexo9rib8671.png?width=766&format=png&auto=webp&s=ffb111ceacbfc8ac586762160dfe2ba785fece21)\n\n\\#1 on the list with a total asset value of $44,428,000,000. XLF:\n\n[An 8.18&#37; loss in 2 weeks](https://preview.redd.it/f9muh69ob8671.png?width=1228&format=png&auto=webp&s=c5308bc1d05cd0cf9458328321cb1e948caa5406)\n\n&#x200B;\n\n[With that barcode comes a 6.36&#37; loss in 1 day.](https://preview.redd.it/8qlwnvnub8671.png?width=1240&format=png&auto=webp&s=20965a3a7d6b048ef58e566e8090bd0e623c5d1b)\n\n&#x200B;\n\n[6 year chart](https://preview.redd.it/q08pua03c8671.png?width=1228&format=png&auto=webp&s=49fd52820dc809a0c7d5486aaf6280f498ae7dee)\n\nAfter hitting an all time high this week, a sharp drop followed Thu. and Friday. It's still sitting at 2X the low of spring 2020 but you can see that sharp drops like this don't happen very often.\n\nOn to #2 is VFH with a total asset value ¼ that of XLF:\n\n&#x200B;\n\n[VFH 4 year chart](https://preview.redd.it/2s9a9ruzc8671.png?width=1224&format=png&auto=webp&s=cd5a32f27c1b75ab62be41b75ab501117daabaea)\n\nAgain, a sharp drop Thu. and Fri. and sitting at 2X the low of spring 2020.\n\n\\#3 is KRE with a little over ½ the asset value of VFH:\n\n&#x200B;\n\n[KRE 4 year chart](https://preview.redd.it/4fnaw24nd8671.png?width=1222&format=png&auto=webp&s=8b9fe244bc3e0bfdd9decba924c4419e20d2de03)\n\nSharp 2 day drop but still over 2X from last spring.\n\n\\#4 is KBE with an asset value 1/11th of XLF:\n\n&#x200B;\n\n[KBE 4 year chart](https://preview.redd.it/wzjx98l7e8671.png?width=1228&format=png&auto=webp&s=fa28829aad80566a6ff3a2c85a3d1125b86ede3b)\n\nAnother sharp 2 day drop but still over 2X from last spring.\n\n\\#5 is IXG with an asset value of roughly $3 mil.\n\n&#x200B;\n\n[IXG 4 year chart](https://preview.redd.it/fkel6orhe8671.png?width=1234&format=png&auto=webp&s=61677d4ca39bec5169c4c7d9d19b07402c4ca915)\n\nAbout 2X last spring but the 2 day drop is showing once again.\n\nFrom these alone, we can see that the cracks are showing and the big money is starting to run. Confidence in banks is beginning to wain. I believe this has a lot to do with the insane debt crisis that is currently looming. With the end of June fast approaching and housing about to become a huge issue for millions of people, defaults will turn these ETF's into penny stocks in a very short time frame.\n\nWe can see from the RRP's that banks currently have too much cash on hand. Rather than lend it out in the form of more loans, they're choosing to pay the FED to hold it for them.\n\nWhen the commercial real estate and housing bubbles burst YET AGAIN, banks are going to become the major holders of a considerable amount of real estate. They're also going to be the proud owners of a lot of vehicles they definitely don't want.\n\nNormally, this isn't that bad for them if someone defaults. They have a house to sell but this time the numbers will be out of hand and no one is handing out loans to buyers. Many people have had their incomes cut down considerably in the past year. When that happens, it shows that they don't meet the minimum requirements for a mortgage. Or a car loan....\n\nLet's take a look at how the OG of diamond hands' stock is doing. Warren Buffett. The man who gave up on Wells Fargo after 31 years.\n\n[https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-sells-31-year-old-investment-in-wells-fargo/articleshow/82727758.cms](https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-sells-31-year-old-investment-in-wells-fargo/articleshow/82727758.cms)\n\n(Not sure if a paywall is required for that article. I have a paywall bypass extension. If so, just search \"Buffett sells Wells Fargo\".)\n\nBRK-A and BRK-B have have 1 major drop in their history. Spring 2020. Here we are, just over 1 year later.\n\n&#x200B;\n\n[BRK-A 4 year chart](https://preview.redd.it/6c8qvibgh8671.png?width=1238&format=png&auto=webp&s=6befd29dd1a2b51a69a26f59c1cd14e6c46b7a98)\n\nWith an all time high (ATH) of almost double the spring of 2020 low, we can still see that sharp drop at the end of the week. In the bottom right corner, that red volume spike shows that more than one person is \"taking the money and running\". For a stock that normally trades 50-100 shares a day, I would certainly say that 1,141 shares being sold in 1 day is a big deal. In recent weeks, there's been some major buying and selling up in the 3,000 shares range after hours. We just can't see it on this chart.\n\nLet's take a look at BRK-B\n\n&#x200B;\n\n[BRK-B 4 year chart](https://preview.redd.it/je9ndq3fi8671.png?width=1232&format=png&auto=webp&s=22baa010e10f3209d3eba97af721f8d55a30d0cc)\n\nNot quite twice the high of the spring 2020 low but a recent ATH. The volume actually looks pretty stable. Keep in mind, this is the retail version of Berkshire Hathaway. The price is more fitting for small whales and those who want to ride on the coat tails of long whales.\n\nNow to something a little more fun. Let's check out some indexes and see what's going on.\n\n&#x200B;\n\n[Index List](https://preview.redd.it/mghpvyq2j8671.png?width=801&format=png&auto=webp&s=44ffa036222e8366b67ce56db25ca88a7c9fbaf4)\n\nThis week wasn't pretty. When anything in the above list moves more than 0.5% in a week, something big is going on, or about to happen. Above shows just Friday alone. It might not seem like much but those are pretty big numbers.\n\nThe top 4 show a pretty recent ATH. From Wednesday on, the losses have been fairly significant.\n\nWhat does all this mean? It means buckle up and hold tight. You're on the back of a whale and you're in for a ride. There's going to be some deep diving, breaching, death rolls, fights and it's going to end with,\n\n\"So long and thanks for all the fish.\"\n\nThe killer whales are about to attack and the dolphins are about to head for space. All you have to do is hang on and enjoy the show.\n\nTLDR: This week showed the beginnings of an epic shit show. The losses will be unlike anything we've ever seen and once it concludes, we'll finally be paid. Dancing is NOT recommended. Up your floors and your ceilings. There will be a lot of people in need of help when this is over.\n\n&#x200B;",
    "title": "Big Money Started Runnin",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o3i7j5/big_money_started_runnin/"
}