{
    "author": "BeanDaddyMac",
    "created_utc": 1617931302.0,
    "distinguished": null,
    "edited": false,
    "id": "mn6eye",
    "text_only": true,
    "flair_text": "Education 👨‍🏫",
    "name": "t3_mn6eye",
    "num_comments": 306,
    "permalink": "/r/Superstonk/comments/mn6eye/why_rocket_no_boom_boom_after_catalyst_calm_your/",
    "score": 4912,
    "selftext": " \n\nCohen securing the chairman's seat was widely applauded as good news- so why didn't we launch today?\n\nThe answer is simple: our institutional holders didn't want to launch quite yet. Face it, even if retail owns the entire float, we can't generate the kind of trading volume needed to launch this 🚀 . We're hodling but we're not mission control. We don't get to push the big red button. Why? Because we simply can't generate the volume.\n\nOf the last 60 days of trading, we've had 29 days in the green and 31 days in the red. Of those 60 days, only 9 of them have had a volume under 10 million. Of those 9 days, **six occurred over the last 7 trading days.** Volume is lower than my wife's standards (after all, she married an ape!).\n\nAs Chad Kroeger might sing, 🎶LOOK AT THIS \\[photo\\]-GRAPH🎵\n\n&#x200B;\n\nhttps://preview.redd.it/nl9e3xopu1s61.png?width=987&format=png&auto=webp&s=79ff223bcc09988f515acf091d394e80343a5f63\n\n&#x200B;\n\nhttps://preview.redd.it/drfvdfcru1s61.png?width=985&format=png&auto=webp&s=625a373fdcdbb45f2a4a4b2dc4a86096a37945fb\n\nIs it sinking in yet? There may be 10 million of us apes out there holding tight but we're not the ones driving the volume needed to take us to the moon. Not all of us can buy more shares, and many of us who are buying the juicy dip can only afford a handful of additional shares at a time. It's not our job to drive up volume to over 50 million. **We literally can't do it.** So what **is** our job then? You know the answer.\n\n&#x200B;\n\nhttps://preview.redd.it/bnz3vxvtu1s61.png?width=735&format=png&auto=webp&s=89464a0c729a6597d6c0ef331dd8b36d00c78db5",
    "title": "\"WHY ROCKET NO BOOM BOOM AFTER CATALYST?\" Calm your tits, the whales are waiting",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mn6eye/why_rocket_no_boom_boom_after_catalyst_calm_your/"
}