{
    "author": "C2theC",
    "created_utc": 1627590787.0,
    "distinguished": null,
    "edited": 1627597309.0,
    "id": "ou5pb7",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_ou5pb7",
    "num_comments": 163,
    "permalink": "/r/DDintoGME/comments/ou5pb7/i_predicted_180_last_week_and_165_this_weekhere/",
    "score": 659,
    "selftext": "# Intro\n\nLast week Wednesday 07/21, in my [Fuzzy Technical Analysis Showing a Reversion to a Mean Around 180](https://www.reddit.com/r/DDintoGME/comments/ooxmbp/fuzzy_technical_analysis_showing_a_reversion_to_a/), I made the following statements:\n\n* **the mean is around 180.00**: Friday 07/23 closed at 180.36, a 0.1996% margin of error\n* **We may visit the mid and low 160's again**: and here we are, closing on Thursday 07/29 at 164.86\n* **GME will have a tendency to consolidate around 180, and will move up and down until the end of August**: still within my channel and AVWAPs, and yesterday there was even an attempted rally for 177.12, which I would argue is pretty close to 180.00\n\nThat post above has more details on how I came to this conclusion. In reviewing what has transpired in one week:\n\n# Pattern Continuation\n\nThe analogous chart pattern statistically continues to develop. When placed next each other (vertically), we get an eerily similar shape, that has a statistical correlation, as written by [u/PWNWTFBBQ](https://www.reddit.com/user/PWNWTFBBQ/).\n\n&#x200B;\n\n[Pattern as of 07\\/29](https://preview.redd.it/sa7mrjh4p7e71.png?width=2441&format=png&auto=webp&s=72fcfbaf70ae9963f9e7fa770bf5a6c38a6caff6)\n\nWhen overlaid over each other, we see how similar these chart patterns are to each other. One observation I have is that the chart seems to have shifted over by one day, where the drop on 05/03 seems to match up to the drop 07/28. This may mean that we will get another drop on 08/04 or 08/05, to be discussed below.\n\n[Overlay](https://preview.redd.it/0d25nyg8p7e71.png?width=2441&format=png&auto=webp&s=7876cdae102b0b85fe8cbd167894c19dc79a0b04)\n\n# Delta Neutral\n\nGME seems to have gone below the DN, as written by [u/yelyah2](https://www.reddit.com/u/yelyah2/). I believe the GME will stay around the DN, until around the end of August, as a reversion to a mean.\n\n&#x200B;\n\n[Delta Neutral](https://preview.redd.it/ohru3rv9p7e71.png?width=910&format=png&auto=webp&s=43e3835ad664dca0012790ddb0b0055ec63969a4)\n\n# AVWAP & Parallel Channel\n\nOne AVWAP that I didn't include last week was the 02/02 AVWAP @ 152.72. It just happens to coincide with the lower channel (in white) that I drew, and defines the bottom of the current trading range. Support is at this AVWAP, resistance is at the 02/26 AVWAP @ 189.20, and the 02/19 AVWAP @ 174.03 seems to be the current midpoint. Based on learned experience, I will stick to my original assessment that GME seeks to revert to a mean of 180.00.\n\n[AVWAP & Parallel Channel](https://preview.redd.it/x5u5nhgbp7e71.png?width=2437&format=png&auto=webp&s=70cb5333b8674c40ba3cc503bf02ffc4c1d0b521)\n\n# Buy Zones\n\nGME is on sale 5 days a week, 52 weeks a year. However, I would like to help apes buy as many shares as possible. In looking at the Bollinger Bands, we can see the GME is nearing its Standard Deviation of 2, and has not yet cross this, to mark a fantastic buy, like it has previously.\n\n[Bollinger Bands](https://preview.redd.it/nvd9ibgbp7e71.png?width=2437&format=png&auto=webp&s=647c2260620f4cc4df929e0bcb67c5097e33c2c3)\n\nWhen the BB is placed with the AVWAP, and showing a buy zone I have drawn in blue, we see that we are in a price range that can be a proper entry. However, I would say that we are not quite there yet, based on the BB 2SD not being touched and the chart pattern.\n\n[Buy Zone](https://preview.redd.it/l47e0fgbp7e71.png?width=2437&format=png&auto=webp&s=0defdb86dc031ab03052a0d0c1b8755994b1ed08)\n\nLooking at the first chart of this post, it appears that GME still has a little more room for the shorts to push it down, midweek next week, around 08/04 or 08/05. Shorts will be interested to push GME down towards the 02/02 AVWAP @ 152.72, so this means it is possible that GME prices bottom out around 156.00. If we get a big drop, with the big drop being day 1, wait until day 2 or day 3, and that should be the bottom, and it should be closing in on the 02/02 AVWAP @ 152.72. This is what I think would be the true buy zone.",
    "title": "I Predicted 180 Last Week and 165 This Week—Here Is Where We May Be Next Week",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/DDintoGME/comments/ou5pb7/i_predicted_180_last_week_and_165_this_weekhere/"
}