{
    "author": "ringingbells",
    "created_utc": 1624897471.0,
    "distinguished": null,
    "edited": 1624897576.0,
    "id": "o9nr7e",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o9nr7e",
    "num_comments": 64,
    "permalink": "/r/Superstonk/comments/o9nr7e/cnbc_is_a_dumpster_fire_since_they_live_edited/",
    "score": 2840,
    "selftext": "The latest one (3 hours ago) which holds the top spot on google for a gme news search is titled [\"Baird suspends GameStop stock coverage, citing continued Reddit influence and lack of company plan\"](https://www.cnbc.com/2021/06/28/baird-suspends-gamestop-stock-coverage-reddit-influence-lack-of-plan.html) RESIST CLICKING IT!\n\nRemember what they did during the US Congressional hearing!\n\nOrdeal Summary:\n\n>- [**Here**](https://www.youtube.com/watch?v=d2DU6DXfGPM&t=2h32m25s) **is a link to the CNBC coverage** - 2 seconds - before the moment the video has a jump cut.\n\n>- [**Here**](https://www.youtube.com/watch?v=imRzHXRq80I&t=2h37m32s) **is a link to the source Government live stream** with the missing 10 minutes and 18 seconds starting where the CNBC video cuts off. The edit was made between timestamps 2:37:34 and 2:47:52.\n\n>- [Side-by-side videos playing simultaneously for comparison](https://np.reddit.com/r/GME/comments/m7vbli/video_proof_cnbc_edited_the_hearing_to_protect/)\n\n\n>- [**Here**](https://www.youtube.com/watch?v=d2DU6DXfGPM&t=2h32m25s) is a direct youtube clip with the missing CNBC footage.\n\n\n>- [**Here**](https://youtu.be/NkFyy-5MGSM) is the full context to what is being talked about in the beginning. **Is Citadel Too Big To Fail?\"** Of course I put the Jojo meme at the end.\n\n>Conjecture & Hypothetical Analysis: Now, if this were to have occurred on purpose during the live feed, there would need to be complaints of an interuption in the CNBC live stream feed, and people watching have reported on reddit that this occurred. \n\n\n>Allegedly, if CNBC did this live, then, hypothetically speaking, they would need to use a staggered start in order to maintain a buffer and then someone on the kill switch. A combination may have also been possible.",
    "title": "CNBC is a dumpster fire since they live edited the GameStop Congressional hearing live. It's just one bullshit article backed by a investor after the next.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o9nr7e/cnbc_is_a_dumpster_fire_since_they_live_edited/"
}