{
    "author": "3for100Specials",
    "created_utc": 1626134867.0,
    "distinguished": null,
    "edited": 1626261178.0,
    "id": "oj3wtr",
    "text_only": true,
    "flair_id": "7e448d04-7a0d-11eb-9ed0-0e313ed76f11",
    "flair_text": "God Tier DD",
    "name": "t3_oj3wtr",
    "num_comments": 403,
    "permalink": "/r/GME/comments/oj3wtr/a_castle_of_glass_game_on_anon/",
    "score": 2467,
    "selftext": "**\\*\\*\\*Imperative top of post edit\\*\\*\\*:** For anyone who's ***already read this post***\\*\\*,\\*\\* please go to the bottom and tell me to **edit 3 isn't saying what I think it's saying**...that info is a bit out of my field so I **need help verifying this,** but I deduced to the best of my ability...**if I'm right in reading that.*****.69420D chess has been played by RC and Gamestop..*****.**\n\n**Preface:**\n\nThe game that is being played is not simply *just* a House of Cards. I’d argue that it's ***far larger*** *(no heat towards attobit, luv ur material, wouldn’t be here without it, truly <3).* The massive entities we call the Big Banks, the Market Makers, the Short dicked Hedge-funds, The Fed, etc, do not simply fall down over the course of a day. No...I’d argue that when they fail..they come crashing down from their **Castle of Glass.** One that has been forming cracks throughout its structure ***since the day it was conceived.***  A deteriorating castle which can **no longer be unseen, nor..undone. Only, replaced.**\n\nBefore we get to the **solution** though, you must first understand the **core aspect of the problem. To highlight this problem, I’ll be referring to a post that is an** ***absolutely essential read*** **so the second half of this post makes sense.** (You’ll find it below in a minute)\n\nI’ll break everything down in the simplest way I can so you have an idea of what you’re walking into. Just know we’re going to be discussing ***everything*** **from the OP, his** ***name***, ETFs, RRPs, NFTs, and the glorious three words, which may very well tie them all together. ***Game on, Anon.***\n\nSo without further ado,\n\n\\---------------------------------------------------------------------------------------------\n\n# Part I: The Crux\n\nThis post is a follow-up to my previous. I had attempted to shine some light onto a DD that was flying far too under the radar for the God-Tier level of information contained within it. It was posted roughly a month ago. It was unlike any I had read before it and till this day, continues to be unlike any I have read since. I’m talking thermonuclear level of information here.\n\nThis is the case for a few reasons. I’ll outline them below so you have a brief understanding to start. (I’ll also be quoting/referencing myself from my other post a few times to save time, so if you see similarities, just know I’m a lazy fuk).\n\n1. **The author:** The OP behind this DD went by the name, u/leavemeanon. Shortly after dropping this thermonuclear analysis on ***HOW*** the shares have been suppressed and ***WHERE*** they are most likely located. He vanished, but unlike the Avatar’s flake ass, his job was done.\n2. **The Job:** ***exposing the primary methods of fuckery utilized by the short gang, the Big Banks, and even the Fed...down to the BONE.*** The depth of analysis here is ***still*** astounding, but that’s not even the kicker..its the fact he drops a God tier DD and makes a claim like this:\n\nhttps://preview.redd.it/d8jzjtoabva71.png?width=704&format=png&auto=webp&s=f9ccf8a5566e11d5888fd341d6e166f7b7abd40e\n\nu/leavemeanon's DD:   [https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip\\_uleavemeanon\\_where\\_are\\_the\\_shares\\_part\\_1/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/Superstonk/comments/nt8ot8/rip_uleavemeanon_where_are_the_shares_part_1/?utm_medium=android_app&utm_source=share)\n\nThe profundity of the statement in yellow is something that you will ***only understand if you read his post.*** The likely realization you’ll come to once you do is that there is absolutely **no way that someone making** ***this claim***, drops a DD with this kind of analysis, then just goes off and deletes his account.\n\nSelf quote: “When asking myself, why tf would someone go this far into a DD analysis and delete their account shortly after? Along with going by the name u/leavemeanon, I found myself coming to the same conclusion each time:\n\n***This. is. what. this. guy. does. He might as well be an unofficial whistle-blower who wanted no traces back to him, bc the info contained in his DD is PRECISELY what is occurring right now.”***\n\nI wrote this statement on my previous DD just over a month ago. I want you guys to pay special attention to that last sentence because if you read through that post, you’ll realize one more thing.\n\n**It’s not only** ***still*** **dead on, but becoming even MORE relevant in relation to the events it had described a whole-ass** ***month back.***\n\nNow if you haven’t read the post for some dingle reason..I’ll provide you OP’s ELI5 to give a snippet of the **problem**, b/c if we do not understand the ***problem,*** **then the** ***solution*** **will not make sense.**\n\nhttps://preview.redd.it/n5ip59aebva71.png?width=701&format=png&auto=webp&s=40195985c771721e9bee3991756ce5c50fc418ab\n\nSo where does the problem truly lie? Based on OP’s post. It’s none other, than **the fuckin ETFs.**  OP explains the inner workings of the ETFs in a way I’ve never seen anyone do before. He even links this video for us real special apes, to understand.\n\n[https://www.youtube.com/watch?v=iX7fOx5G40A&t=323s](https://www.youtube.com/watch?v=iX7fOx5G40A&t=323s)\n\nSo assuming you now understand the problem, here’s an idea of the **severity**, as disclosed within part 3 of OP’s post. Spoiler alert,\n\nhttps://preview.redd.it/m5n89zofbva71.png?width=707&format=png&auto=webp&s=ca519452d537ca0351a7629bddd9999c5baad4c1\n\nWe’re not done yet, remember..only once you understand the ***full extent of the problem, will the solution make sense.*** So to add even more juice to the flame, here’s a video by **Charlie Vid’s**, which he released on July 10th. It shows how all those **RRPs**...you know..those multi-fuckin billion dollar funds being moved around on a **daily basis...are likely piled** ***right into the fuckin E T F’s.***\n\n[https://www.youtube.com/watch?v=NhS5FgfO6Jg](https://www.youtube.com/watch?v=NhS5FgfO6Jg)\n\nThis video has only stood to further validate the point u/leavemeanon **made a whole ass month back.** The information he’s discussing is still pretty novel and needs more eyes, but the connection he makes in that video is hard to argue against. Even if you don’t fully grasp wtf that shit means, and let's be honest, most of us still don't b/c RRPs are the most absurdly convoluted thing on this planet. Nonetheless, the big picture is pretty evident. From this video, it seems almost entirely plausible that these transactions between the Fed and the other end of the parties involved (the Big Banks) are being done illegally at historic levels, to ***keep the entire market from collapsing.***\n\nTo provide a better idea of what *may* be going on here, I'm going to refer to someone who seems to have a far clearer grasp on these transactions than myself. I'm fine with speculating on most things but these RRPs though, I'm way too smooth-brained for that and the last thing I need is to be throwing a 69th definition of what they mean into the mix.\n\nhttps://preview.redd.it/mekm0acibva71.png?width=1121&format=png&auto=webp&s=b8f9d7886b1e931915999abfb6c7122d45a71567\n\nThis may also explain why most of the rules released in relation to the derivatives market seem to have only slowed down recent events, but not much more. I'm saying this because the way some of those rules were written, they sounded like they would dice up the short's plan of approach completely. Though there does ***seem*** to be a clear impact on how GME has been trading since most of the rules were implemented, ***they haven't ended the game.*** To me, this likely means that the greatest source of fuckery held by Shortgang and Co. lies elsewhere.\n\nThe Married-puts, the dark pools, or whatever else method of manipulation these limp-dick cum-dumpsters have up their sleeves may be *some* of the better-known gears behind their scheme, but I'm willing to be ***it's the ETFs, which are the true source of their Fuckery.*** **These transactions described in the video above, and further theorized upon by the comment attached, are occurring** ***through the entire ETF market.***\n\n# Part II - The Connection\n\nNow that you understand the problem, we are *almost* cleared to move onto the solution. Before going further, I need to provide some context here.  My previous post, as mentioned earlier, was intended for a single purpose: Shedding light on u/leavemeanon’s DD. Shortly after dropping it though, I received a comment and message from a few users who sent me down one hell of a rabbit hole. As in that post, I was making some tin-foil hat connections to the meaning behind u/leavemeanon's username. Though this part may not necessarily even be linked, it's important I mention it because had it not happened, I would not have discovered what I believe to be the ***solution***.\n\nMoving forward from here, we’re going to be **treading over some speculative waters** and more than likely, be testing that 4-hour erection window before you need to call your doctor. They might have to raise the bar on that one if the following of what I’ve found is ***even remotely correct.***\n\nThis part may sound absurd at first, but I only ask you to trust me until you reach part 3. For most of part 2, I'm explaining because I feel it important to clarify *how I came to my conclusions.* My thoughts in this section don't necessarily *have* to be true, and I wouldn't be surprised to find out if this ends up being the case in the future.\n\nThat being said, ***their relevance in this DD is that of an intermediate***. They are what helped me discover what I believe to be **the** ***solution for the problem described above.***\n\nMy speculative journey would lead me down an immense rabbit hole roughly a month ago. It would begin with a fascination with Anon's DD but soon evolved to also include **the method of its deployment (OP deleting his account shortly after dropping it), the technical but extremely concise language utilized, and the structure of its writing,** as I began to ponder the ***meaning behind OP's name***.\n\nThe now-deleted user, who went by the name of **'leavemeanon\"** would ring a few bells for another ape, that would comment the following on my post:\n\nhttps://preview.redd.it/0rwrrm8vv5b71.png?width=660&format=png&auto=webp&s=88f2280068428934deb7ab23481023decb0560fc\n\nIt was at this point that I began to speculate whether there was a connection between Anon's name and the phrase above found on Gamestop's NFT website. Now I cannot state that there is a direct relation between the two, but I find it necessary to shed light on the connection I theorized (with the help of some amazing apes), regarding what ***I believed it to be.***\n\nwhat if, the now-deleted OP's name was in reference to more than just 'leave me anonymous'? What if...OP's name was an attempt to send us a message about the material covered in his post in regard to the ETF market?\n\nHere is the likely-to-be unlikely link: the word Anon is defined as \"soon, shortly\". OP went by the name LeaveMeAnon. I.e leave me '***soon, shortly'.*** So naturally, I went full tin-foil mode and chased the idea further down the hole. I made the following assumption in doing so, what if OP was telling us,\n\n\"the material I'm covering, the current ETF market as we know it, is to be ***left behind soon/shortly, and let me explain why\"***\n\nWhereas '**Game on, Anon',** a phrase located throughout Gamestop's NFT website, if used under the same pretense, could refer to ***\"Game on, Soon/shortly\".***\n\nSo the link that would bring me to the absurdly coincidental connection that may, or may not have been fueled by an unhealthy amount of confirmation bias at the time:\n\nAnon's post is created with knowledge equitable to damn near Burry himself, with the sole purpose of exposing where the ***true problem lies*** in the GME saga. He mentions married-puts, high-frequency trading, and ETFs in-depth to show this. Yet, it is the **latter most issue that gets the largest emphasis placed on it. Why do I believe that?**\n\n**Primarily because the more I looked into this situation, the more I began to see that the institutions involved on the short side of GME aren't the Castle of glass, they simply** ***live in it***. The Castle itself...is the entire ***ETF market.*** A structure which throughout and within it have become increasingly prevalent by the passing of each day. They are quite literally, ***a legal method of naked shorting***.\n\nWhere Anon takes the time to reveal the problem, it's **Gamestop**, the company itself, that has quite literally been showing us the ***solution to this problem.*** All of which it has been doing through its ***actions, not its words.***\n\n# Part III - The Solution\n\nIf you made it this far, just know I'm proud :')\n\nPart II is certainly the most tin-foil section in this post, but as you proceed through part III, you'll soon realize why I found it necessary to provide all that information. This is certainly my favorite part. Stick through to the end and you'll see why we save the best, for last.\n\nMoving forward right where we left off - If you go onto that same NFT website, copy the link which is posted on their NFT page, paste it into google, and open the first tab from the etherscan website and click on the ‘contracts tab’, guess what you’ll find there...\n\nhttps://preview.redd.it/jxoamqoubva71.png?width=700&format=png&auto=webp&s=8cfd14b858ebc799988785f0d3027a396fa882c0\n\nStill, think it’s a simple coincidence? It's alright, I mean \"it’s not it actually means anything…***” right Anakin?”.....\\*zooms in closer\\*.....” right..?\\****\n\nLol don’t actually try to zoom in, there isn’t shit there if you do that. **But… third time’s a charm, right? what if there's more to that phrase than just some random ass meaning?**\n\nTo find out, I did some more digging around that term after finding the above which would lead me to find the following tweet:\n\n[https:\\/\\/acceleratedcapital.substack.com\\/p\\/the-metaverse-index-](https://preview.redd.it/cd98leowbva71.png?width=553&format=png&auto=webp&s=ea0407b3e9d5604fc6ac1d7b60cbbb6fc87a9eb4)\n\nThat phrase...look familiar? Yeah...we’re about to enter solution territory...and for you “I only believe after a 4th, 5th, 6th coincidence” apes, don't worry. I’ll get there anon ;)\n\nThe link above will take you directly to the page they’ve shown. Upon finding this tweet, I looked into what exactly these guys were talking about. After reading in-depth about what exactly this ‘Metaverse’ is, as well as viewing some of the other links they have posted on their website, you’ll find information about its relation to **NFTs,** ***Blackrock***, and something known as the **Index Cooperative**.\n\nNow, why exactly are these things all noteworthy? Well, if you don’t live under a rock and are a certified retarde like yours truly, you’ll remember **some hype going around with Gamestops NFT plans.** But before we get to that, let’s put this together in a cascading manner so you fully grasp what we’re looking at here.\n\nWhat is the ***Metaverse*** exactly?\n\n* Per Wikipedia: “***The Metaverse is a collective, virtual shared space, created by the convergence of virtually enhanced physical reality and physically persistent virtual space, including the sum of all virtual worlds, augmented reality, and the internet”***\n* It’s further described as a basket of 15 tokens that serve the purpose of capturing entertainment trends, sports, and business shifting to virtual reality.\n* The next absolutely fascinating find in regard to the Metaverse index is one that requires you to zoom out and view the bigger picture. By doing so, you'll begin to understand ***what it's trying to change***.  An article that goes extremely in-depth on it would provide this insight:\n\n[https:\\/\\/www.masterthemeta.com\\/business-breakdowns\\/into-the-void](https://preview.redd.it/7i3kzk8ccva71.png?width=706&format=png&auto=webp&s=3abb9f88659f7c106282ee174f6d2119e46d22c9)\n\nThis article above (absolutely excellent read btw) is what links our **topic of focus. N F Ts.**  Notice the **black-highlighted sections, primarily** ***the bottom one.***\n\nThis information takes us back to Accelerated Capitals website. Here we find a bit more relative information to ***virtual ownership via NFTs, gaming,*** ***virtual reality, and entertainment\"***, as well as the **inclusion criteria it has before an NFT can be issued under it.**\n\n[https:\\/\\/acceleratedcapital.substack.com\\/p\\/the-metaverse-index-](https://preview.redd.it/4i82x83scva71.png?width=519&format=png&auto=webp&s=08f4ec2da4a7b72dde074e547afa210db14cf240)\n\nI highlighted the 3 month period because if I remember correctly...there’s a company out there that has something to do with gaming, which was supposed to go bankrupt..but didn’t..and similarly ***issued an NFT token a few months back...what the date on that?*** **4/07, now I'm not the best at math but roughly 3 months since then would be...😎 (s/o** u/LordoftheEyez for the help on clarifying the timeframe!)\n\nBut let's get a bit more specific, **wtf** ***is the Metaverse Index really?***\n\nhttps://preview.redd.it/cjtmbdujm3b71.png?width=560&format=png&auto=webp&s=788ec0a8d53c88bbe46d0583a634abe9bb29bf9a\n\nOh boy, well now we’re getting somewhere. After looking into what exactly the Metaverse index was, I found myself directed towards something called the ***Index Cooperative (Coop Index).*** Think of this thing as the **very top of the cascade, it contains** ***other blockchain-based indices within it, such as the Metaverse Index.*** Upon visiting The Index Coop website, you get a pretty baseline idea of what it is to better explain:\n\nhttps://preview.redd.it/436meh2xcva71.png?width=670&format=png&auto=webp&s=61641ee1db870b93b3903a256d58400ca888144d\n\nJust a refresher on the cascade of terms here as I explained them a bit out of order, from the highest --> lowest level of priority. (also priority here isn't me saying least is worst lol, it's simply in relation to where they actually fall relative to one another)\n\n**Index Cooperative > Metaverse, etc > NFTs**\n\n&#x200B;\n\nBecause this cascade functions ***entirely separate from the modern-day stock market which includes modern-day ETFs as we know them, they play by COMPLETELY different rules.***\n\n* **It’d be an absolute shame if a company that was** ***shorted to high-hell...decided to jump ship and hop into this thermonuclear fueled fuckin rocket,*** and light up all the dipshits who decided to bet against it..\n* ***A shame for those dipshits, that is.*** Fkn dingles lmayo..alright back to semi-serious mode...\n\nGoing forward, I did some deep dives through other Reddit pages to learn more about this thing, and to my surprise, I got a damn good explanation of ***what EXACTLY is the Index Coop attempting to become. It is as follows,***\n\nhttps://preview.redd.it/89gttgxzcva71.png?width=351&format=png&auto=webp&s=f1fe238d385556c96a94203ddafba6fa16c01475\n\n\"**OVERVIEW OF INDEX\"**\n\n\"[Index Cooperative](https://www.indexcoop.com/) is a DeFi project that’s going after the multi-trillion-dollar \\[ETF\\]([https://en.wikipedia.org/wiki/Exchange-traded\\_fund#:\\~:text=An%20exchange%2Dtraded%20fund%20(ETF,the%20day%20on%20stock%20exchanges)](https://en.wikipedia.org/wiki/Exchange-traded_fund#:~:text=An%20exchange%2Dtraded%20fund%20(ETF,the%20day%20on%20stock%20exchanges)) (exchange-traded fund) market. At its simplest, an ETF is like a basket of assets (be it stocks, bonds, commodities, or crypto) that can be traded in a group. Companies like [Blackrock (under its subsidiary iShare) and Vanguard each have over a trillion dollars](https://www.etftrends.com/10-biggest-etf-issuers-of-2019-by-market-capitalization/) under management in the form of ETFs. ETFs have been so popular, that people like [Michael Burry ](https://en.wikipedia.org/wiki/Michael_Burry)(of [*The Big Short* ](https://en.wikipedia.org/wiki/The_Big_Short_(film))) have called it a “[passive investment bubble](https://www.etfstrategy.com/passive-investing-a-bubble-says-big-short-investor-michael-burry-10449/)”.\"\n\n[***https://www.reddit.com/r/CryptoCurrency/comments/j8i8wp/the\\_index\\_cooperative\\_defis\\_first\\_index\\_fund\\_now/***](https://www.reddit.com/r/CryptoCurrency/comments/j8i8wp/the_index_cooperative_defis_first_index_fund_now/)\n\nTwo things should stick out to you off the bat:\n\n1. “Own the ***Blackrock*** of DeFi” while stating ***Ethereum ETFs as being a business with a multi-trillion dollar upside.***\n2. *\"Index Cooperative* ***is a DeFi project that's going AFTER the Muti-trillion ETF market”***\n\nPutting these two together took a minute, I found myself asking, how tf Blackrock was thrown into the loop? so I started scavenging through a few more articles through Accelerated Capitals page and found this:\n\nhttps://preview.redd.it/3zvrt571dva71.png?width=523&format=png&auto=webp&s=c9e06df3dcad0d84587f6b98ca5456d781cba8ef\n\nhttps://preview.redd.it/nw4lwws3dva71.png?width=568&format=png&auto=webp&s=c81c6e40e93047ac7a3f3a2a500d103898251707\n\n&#x200B;\n\nhttps://preview.redd.it/nxah7ou4dva71.png?width=596&format=png&auto=webp&s=a54aaeaaa1da6dbeedf4725fcb74357642ff913f\n\n**TA:DR/conclusion:**\n\nLet's bring all this together now, because if you've made it this far, then you're likely still taking all this in. I know, it's a lot to take in and I also understand that some of my conclusions are speculative. In the end, **this is truly all we can do until the elephant in the room gets so big, that it is no longer possible to ignore or deny it.** For this reason, I ask each and every one of my fellow apes to dig into every piece of information I've provided above and **reason these things out for themselves. Follow the evidence, question the data, question the logic, and deduce the flaws. Only then can you truly justify to yourself that the investment you've made in this stock, was done so out of confidence, and genuine Due-Diligence.**\n\nWe began by introducing the problem, because, like any other problem you wish to solve, you must first **understand the problem.** The more complex and/or convoluted that problem is, oftentimes the longer it can take to ascertain the necessary information in ***properly*** learning about it. This is something we covered in part I, in which section I introduced you to the **elephant in the room, the ETF market, or as I like to call it, The** ***Glass Castle.***\n\nIn part II, I provided insight into what I like to think of as the ***intermediate,*** between the **problem and the** ***solution.*** Though I do not have high expectations for those connections to be outright true, they did not need to be. Their purpose was served the moment they led me to find everything I wrote about in part III.\n\nWithin this final part, I described to you ***the solution***. IF I'm right in my thought process here, THEN the actions being taken by RC and Gamestop are quite literally, ***pointing in a single direction***.\n\n**Changing the game and giving the** ***power back to the players*** **isn't just about changing the company, no...It's about shifting the ENTIRE damn landscape of how the modern-day economy functions.** This change, the NFT initiative currently being taken by GME is with damn near certainty moving towards one goal..before we describe that goal, let me provide one last refresher, but this time with analogy's so there is not a single ape left behind.\n\n1. At the very top, you have the largest basket: the **Index Cooperative** (**think of this as the new blockchain stock market)**\n2. Within this large basket, you have multiple medium-sized baskets: The **Metaverse Index, Defi-Pulse index, etc.** **(Think of this like the SP.Y)**\n3. And within individual *medium-sized* baskets, you’ve got **NFT’s** **(think a jet-fueled gaming company ran by a fuckin 69D chess master)**\n\nImagine an economy where there is no longer a middle man, by which I mean the modern-day banking system as we know it. Ask yourself, if you had the ability to choose a completely different system, where the ***power of decision-making and investing potential lies in your hands, and not in that of some middle-man who would rather use it for his own personal benefit at the cost of YOUR losses, would you use it?***\n\nUnlikely, I'd say. Unless you enjoy getting hoed by greedy scumbags, but you probably wouldn't have made it this far in this post had that been the case. This leaves us to the ultimate question, *what exactly is RC doing?*\n\nBased on everything I've shown you, **He's planning on cutting out the middle-man.** These modern-day Big Banks and pretty much every other financial institution from the SEC to the Fed have been laying in bed together for decades. In doing so, they thrived within their castle while the rest of humanity continued to struggle, often unable to make even our most *basic* ends meet.\n\nYet in the end, it was *this* greed that blinded them. *This* greed allowed their own naivety to consume them. Most importantly, it was their unending hunger for power and wealth that created a facade so great, that they could no longer see that karma isn't a bitch. Karma is a f**uckin mirror.** This is the true cost of their \"opportunity\".\n\nAnd those cracks? Each day that passes, they spread further and deeper. Its flaws can no longer be **unseen, nor can they be** ***undone.***\n\n**Only, replaced.**\n\nI'd argue the game isn't *about* to change...but rather,\n\nI'd argue, **it already** **has.**\n\nP.S Larry Cheng, GME board member, and  Matt Finestone, Blockchain guy.\n\nhttps://preview.redd.it/lpcrm0v6dva71.png?width=719&format=png&auto=webp&s=2a07c4976b4dcd4df2edbc6b52b43af354709a76\n\nhttps://preview.redd.it/utw1mtq7dva71.png?width=720&format=png&auto=webp&s=9f9f756e62959f3479427548bb77a3cdc39607f6\n\nNone of this is financial advice, I repeat, I still do not know how to walk on all two's. Thank you for your time.\n\nEDIT: There's a pretty fancy pants wrinkly-brained ape down in the comments who did a solid job of providing a description of the kind of changes I had envisioned while writing this DD. I didn't get around to including most of the things he's stating, but they are certainly on the same track of thought process. So, it's only right I add his comment for all apes to see. I've described the process, this is what the results, I believe, will look like,\n\n&#x200B;\n\nhttps://preview.redd.it/d36imzd6h0b71.png?width=739&format=png&auto=webp&s=879b698d6a0280d28694670c98d509e5210c6455\n\n**EDIT 2:** This post was partly inspired by this ape, I had shared my previous DD onto the post containing the video which tied the RRPs to the ETFs. Upon further conversing with this ape last night, he provided me with, what seems to be a hint and I believe, this is what he's getting at. I'm at my 20 image count but this was his statement:\n\n\"I'll drop this Easter egg on you.\"\n\n\"Simplicity. Complexity is meant to hide complexity in the markets. Also meant to distance simplicity in relationships. The most complex situations are usually handed over a simple old fashion between friends...or foes. Game on Anon\"\n\n**My response, after pondering these words:**\n\n\"simplicity...simplicity in a complex situation, is leaving the complex situation entirely. Their system and all of its cracks, cannot be unseen, nor undone. To replace a system that is so evidently flawed with its complexities requires a simple solution\\*, leaving it behind entirely, and creating something new.\\*\n\n\"This is my take on your wise words. Game on Anon\"\n\n**TIT SLAPPIN EDIT 3:** Holy fucking. **shit. Apes, I need all eyes on this.**\n\n**Please correct me if I'm wrong as this is out of my field.....but tell me this doesn't fuckin read the way** ***I think it reads...***\n\n**GME PROSPECTUS SUPPLEMENT FILING TO THE SEC, JUNE 9TH, 2021 - top of page 16**\n\nhttps://preview.redd.it/g9i0lgeeh3b71.png?width=1860&format=png&auto=webp&s=2b019c36ba22c28134a0a2e79b65bdaf76a78346\n\nEDIT 4: \n\n**Here's some insight from a pretty-wrinkled brain mode over from** ***DDintoGME*****. Truly appreciate this insight, the words of the prospectus still need to be pondered upon, but this apes assessment sounds a few steps ahead of mine, please reference his post for a better idea until we can get conclusive insight! (**As we are both in some form still speculating, I'll leave my assessment below as well, but *I like where this ape is going with this.* It's my suggested reference for anyone who sees this)\n\nu/Theta-viodance Thanks for your time in writing this out. Know that it's appreciated. \n\nhttps://preview.redd.it/vesvnnhhu5b71.png?width=726&format=png&auto=webp&s=46334842832336bd6d75807284de8f417c155fe2\n\n&#x200B;\n\n**I've read this literally 20 times over...I've even read the last two damn pages 20 times over to make sure what it's leading up to is actually** ***what I think it is...***\n\nI've highlighted it in three different colors to make the transition of statements easier to read, or harder lol idk:\n\n1. **Yellow -** ***if the DTC fails to do its job, and they are not*** ***effectively replaced within a 90-day allotted period by a succeeding depository...***\n2. **Green -** ***we will issue*** ***a different type of security different than the type already in the market, but still somewhat similar to it..***\n3. **Blue -** ***But also, one more thing you fucboys...at any given point in time, and based on our absolute SOLE discretion..***\n4. ***RED - We may decide to just say fuck it, and issue our OWN security which is COMPLETELY*** ***SEPARATE*** **from the type already IN the market, AND the same condition apply under the circumstance we swapped them earlier for the semi-similar securities** (referenced in the green highlight), ***in case you try and pull a fast one with those too...***\n\nS/o to  u/Apprehensive-Use-703 **bringing this to my attention...smart ass fkn apes out there man..**\n\nGuys....I need some serious wrinkles on this....**this is not the shit that I do lol, so someone confirm to me that I'm not geekin and that's** ***not how that fuckin reads.....because it sounds like Gamestop has literally planned for the TRANSITION step to the shit I've covered in this post.***\n\n***Power  to the Players 🚀***",
    "title": "A Castle of Glass - Game on, Anon",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/oj3wtr/a_castle_of_glass_game_on_anon/"
}