{
    "author": "deebo911",
    "created_utc": 1628336220.0,
    "distinguished": null,
    "edited": false,
    "id": "ozroj3",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_ozroj3",
    "num_comments": 336,
    "permalink": "/r/Superstonk/comments/ozroj3/gamestop_should_not_have_to_issue_an_nft_dividend/",
    "score": 7239,
    "selftext": "Sup fellow Apes, \n\nLet me first say I’m a basic AF ape. I’m only 8 months old for goodness sakes. \n\nI’m out here in the old RV, not able to sleep through the witching hour, melting crayons in my coffee and thinking about our favorite stonk.\n\nI’m not going to pretend I understand all the ins and outs of the potential ETH NFT dividend. \n\nBut I think it’s outrageous that GME or any other company would have to execute extraordinary measures, 4D chess moves or stick bananas in tailpipes in order for their value to be accurately reflected in the market. What planet are we on (for now)?!\n\nPlease do not mistake my sentiments as a lobby against GME making any such moves. Not what I’m advocating. \n\nI 100% trust in RC and the rock star team assembled at GameStop. And I imagine the NFT dividend and related technologies are integral to GME’s business plan and future. So again, do your thang RC & Co. \n\nI’m just frustrated that GameStop can’t just focus on being the best company ever; they’ve got to do that AND consider how to navigate this absurdly corrupt financial landscape and uphold their responsibilities to shareholders. As if the first isn’t difficult enough.\n\nAnd I can’t wait to one day sit back and say to myself, “those crazy MFs actually did it.” \n\nWhat I’d really like to see is the SEC and GG come out and TAKE ACTION to end all the fuckery.\n\nLike this:\n\n“Due to the ungodly amount of synthetic shares illegally created, vote count at xxx,xxx,xxx or more, blatant naked shorting, dark pool abuse and market maker privilege abuse all coupled with GameStop’s beautiful fundamentals including zero debt, movement to S&P 400, solid future and business plan, I am forcing all shorts to close by the end of 2021 to accurately reflect GameStop’s value in the market.”\n\nOk so yeah maybe that would never happen. I clearly don’t understand market intricacies. \n\nBut long story short, it should not be GameStop’s responsibility to ensure the company’s value is accurately reflected in the market.\n\nPower to the players",
    "title": "GameStop should not *have to* issue an NFT dividend nor make any other 4D chess move in order for the market to accurately reflect the stonk’s value",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ozroj3/gamestop_should_not_have_to_issue_an_nft_dividend/"
}