{
    "author": "Bufferplease",
    "created_utc": 1626644159.0,
    "distinguished": null,
    "edited": false,
    "id": "omzyi6",
    "text_only": true,
    "flair_text": "Art & Media 🎨",
    "name": "t3_omzyi6",
    "num_comments": 5,
    "permalink": "/r/GMEJungle/comments/omzyi6/shattered_glass_a_future_gme_story/",
    "score": 7,
    "selftext": "*I am not a wrinkly ape like u/criand, u/atobitt, or u/leavemeanon. I'm not a quant/statistician ape like u/possibly6 or u/earthysoup. I do, however, have a very particular set of skills, and I would like to share them with you today. I like to write.*\n\n**Shattered Glass**\n\n\n**Chapter 1**\n\n\nThe sound of the morning alarm faded into my dreams and gently nudged me from the deepest and most comfortable sleep I've had in my life. Every night is like that now. When my head hits the pillow I am immediately at ease. No more staring at the ceiling into the early hours of the morning wondering where the next paycheck has to be spent. You would think, after five years, that I would begin to acclimate; normalize this new world we live in, but the scars of wage slavery run deep. I prefer it that way. It's a burning reminder of where we were and a gleaming example of how far we have come.\n\n\nI swing my legs to the floor and find the warm carpet under my feet. I begin to marvel, once again, at the fact that I'm able to live in a place like this. Before it all, we were lucky to find a crap apartment. And even then, we scoured around and found happiness in the dark corners. Now, it seems like we no longer have to look. It's present around every bend of the journey this new life affords us. \n\n\nI meander sleepily into my office adjacent to the master bedroom and throw open the curtains. The beams of sunlight cascade across my face as another beautiful morning, free of pollution, greets every human into a new day. It seems like the sunrises have gotten more crisp and the morning air more rejuvenating. Electric cars buzz around the small community roads and sounds of landscapers litter the air. Aside from that, a quietness, perhaps even a peacefulness, envelops the small town. It is good.\n\n\nI use the vocal commands for the startup of my VR-enabled workstation. I hate calling it that. I certainly don't feel like I do work on it. It's more accurately described as a creative outlet to present my contributions to the world. Just yesterday a gentleman from what used to be Germany and I worked together on my current project: A virtual sandbox for those with debilitating diseases to create a digital world unhindered by their physical bodies. The world has made incredible advancements in medicine since the entirety of human knowledge became publicly available through the Metaverse. Now anyone can learn to be a doctor if they felt inclined to do so. That doesn't stop disease from finding ways to thrive. Suffering is non-existent, but the fragility of humanity persists. \n\n\nAs my workstation begins its prechecks before connecting to the GMErica VR SubPortal of the Metaverse Online Operating Network, my eyes wander out my bedroom window and peruse the world outside once more. This time focusing further out and entertaining my senses with the joys to behold. First of course, I appreciate the hunter green Ford GT I bought with my fiat gains from selling one of my traditional GME shares. I'm reminded I should probably give it a rinse since I haven't driven it in several months. There is simply no reason to leave the house more often than the occasional special situation. Like a signed baseball, it's a reminder of a wild and wonderful time in my life.\n\n\nNext my gaze deepens and continues to sweep outwards towards the city. It looks so different now. The gaudy skyscrapers, and web-like network of roads have all but been replaced and recycled now. Circular communities of reasonable housing pock the landscape where everyone works in their own VR workstations to produce something for their online community. This is, of course, not mandated but without the constant struggle to make ends meet 90% of the global population is motivated to use their time creatively. It's easy to find positivity and imaginativeness when you've clawed your way out from under the crushing boot of traditional capitalism. \n\n\nYour contribution to society directly correlates to your net worth on the GMErica Network. You can mine coins with your time and GPU processing power, or you can use available software to create something for your online subgroup. This can be a form of entertainment, technological advancement, philosophical ideologies, or any piece of content that could contribute to your society and, as long as your subcommunity finds value in your contribution, you get direct compensation for your hard work. No boss or CEO to benefit from the sweat of your brow.\n\n\nThe jingle indicating a successful connection to the GMErica Network brings me back from my wandering thoughts. My spouse stirs to the sound of the clacking of keys on my keyboard as I input my information to log in. Looking back, my heart warms as they smile in their sleep. Another chime and I am connected to my subgroup. I am immediately greeted by a number of messages from people already hard at work on their various projects asking for me to verify the validity of their research, to playtest their creations, or review their content. The warmness in my heart spreads to my entirety as a feeling of coming home washes over me. \n\n\nI unfold the glass overlay of my VR OcularUnit and fit the earpiece behind my ear, securing the lightweight frame to my head. A flash of light and my world fades away as I enter into the virtual domain. When GameStop announced their migration to the new blockchain \"stock market\" everything changed, and it changed quickly. Within the first year the entire traditional stock market was in shambles as everyone jumped ship to the new method of managing securities that removed the greedy middle-man and brought value directly to the investor. Investors can now contribute directly to these securities and, after being voted on by the subcommunity can gain compensation for their contribution.\n\n\nI examine the digital avatar I created that closely resembles my physical form, the easiest of my avatars to manage while performing my work. The ivory towers of those who benefitted from the misery of others came crashing down and the Castle of Glass fragmented and shattered. Citadel Securities was the first, as they were at the forefront of the Gamerenaissance. Kenneth Griffin and his cronies have been barred from accessing the Metaverse Online Operating Network. No jail time, or additional punishment is necessary because this banishment essentially ends any meaningful existence in their lives as they are cut off from all of society. Poetic justice for those who have ended any meaningful existence for so many before them. Their only options for continuing to afford food and shelter are off-network jobs, like waste management or construction. No more barbaric prisons, or useless fines. We are beyond traditional forms of punishment. Jails no longer need to exist. The entrapping cycle of prison has been broken with new forms of rehabilitation. For example, virtual rehabilitation centers allow people to stay in the comfort of their homes, away from the physical presence of others. They focus on guiding the behaviors of those being rehabilitated into impactful positive interactions with their online subcommunities. The effectiveness of finding meaning for those who felt they had none is astounding.\n\n\nI find my work group in the lobby we created to house our online avatars and our in-network workstations. We exchange enthusiastic hello's and immediately set back to work on our individual projects, collaborating as the day goes on to improve and expound on the ideas we all have and share. I dive into working on my software tools. Coding and perfecting the ability for the user to create the landscape of their dreams. The next step in my project plan is to work on the architectural tools to build virtual buildings, but I need my collaborator overseas to verify the current version is serviceable before I move on. Luckily it shows they are online and attempting to contact my avatar.\n\n\n\"I tested your program last night, nice work. The weather effects are incredibly convincing. My biggest concern is the UI, while intuitive, it doesn't allow for the level of control I would like on certain aspects of the environment. Perhaps two separate UI's. One that allows for simple changes and caters to those who would like a quick, prefab environment and another more complex set of tools for those who want greater control. \n\n\n\"That is an excellent idea. Perhaps I can put a nice skin over the tools I use to manipulate the textures and tweak specifics and make that available to the end user as well.\"\n\n\n\"Simple, elegant, and exactly what I would be looking for, I think that sounds great.\"\n\n\n\"Glad you like it, I'll work on that now. I'll let you know when I have something you can test. Power to the players!\"\n\n\n\"Power to the players!\"\n\n\n\nChapter 2 - 10 years post Gamerenaissance\n\n(if you guys want it...)\n\n\n*like any DD, I want people to pick this apart. If you find errors in my grammar, punctuation, or (something I am really bad about) tense-shifting please let me know and I'll go back and fix these things.*",
    "title": "Shattered Glass - A Future GME Story",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/GMEJungle/comments/omzyi6/shattered_glass_a_future_gme_story/"
}