{
    "author": "WallSt4MainSt",
    "created_utc": 1616778005.0,
    "distinguished": null,
    "edited": 1616785762.0,
    "id": "mdt4vi",
    "text_only": true,
    "flair_text": "Mod Announcement 🦍",
    "name": "t3_mdt4vi",
    "num_comments": 1233,
    "permalink": "/r/GME/comments/mdt4vi/official_ama_with_dennis_kelleher_president_ceo/",
    "score": 17270,
    "selftext": "Hi everyone: I'm Dennis Kelleher, President and CEO of Better Markets. Some of you might know me from my recent testimony before the House Financial Services Committee on GameStop, Citadel Securities, and payment for order flow. Thanks to all of you who have cheered us on!\n\nI have almost two decades of experience in D.C., including as a senior staffer in the U.S Senate, and have seen firsthand how Wall Street is able to influence the policy-making progress. My colleagues and I at Better Markets work to fight back against Wall Street interests and promote common sense reforms that make our financial markets more transparent and fairer. Our goal is for Wall Street to serve and support Main Street, not be a threat to it. We also want finance to be a wealth generation system, not a wealth extraction mechanism. My bio is here [https://bettermarkets.com/dennis-kelleher](https://bettermarkets.com/dennis-kelleher) and visit our website at [https://bettermarkets.com/](https://bettermarkets.com/)  for more info.  \n\n\\*\\*\\*\\*\\*\\*Thanks everyone! Fantastic questions, insights and observations. Been an honor to have the discussion.  Please stay in touch with Better Markets via [www.bettermarkets.com](https://www.bettermarkets.com), sign up for the Newsletter, follow on Twitter/FB, donate if you can and otherwise stay engaged.  There's a lot of power here that has yet to be exercised to impact policy, the SEC and our markets! ",
    "title": "OFFICIAL AMA with Dennis Kelleher, President & CEO, Better Markets – Fighter for Retail, Buy Side & Main St against Wall St/big finance",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/GME/comments/mdt4vi/official_ama_with_dennis_kelleher_president_ceo/"
}