{
    "author": "ChiefNorske",
    "created_utc": 1624347588.0,
    "distinguished": null,
    "edited": false,
    "id": "o5hejo",
    "text_only": true,
    "flair_text": "💎 🙌",
    "name": "t3_o5hejo",
    "num_comments": 94,
    "permalink": "/r/GME/comments/o5hejo/no_coincidences/",
    "score": 788,
    "selftext": "I would just like to preface this post by saying that none of this is financial advice. What you may read below could potentially make you lose braincells, and that there are No Coincidences.\n\nAlso would like to say that I am a theorist, I like connecting dots and piecing together pieces. Along with there being No Coincidences, I also believe everything happens for a reason. There's always a why. Please poke holes in anything and everything below. I am fascinated by the ideas of others and how we can hive mind why things happen.\n\n&#x200B;\n\n# Glossary:\n\n1. 002\n2. R1000, Quarter End, and T-21, T-35, T+105?\n3. Macro Economics and RRP go boom\n4. Recent White House Meeting between Biden, Yellen, Gensler, and Powell\n5. Crypto Dump and other connections\n\n&#x200B;\n\n# 1. 002\n\nWell it was fucking passed. It happened. There are certain things that you can get excited about. Those very things may be the reason defaults occur and why the end could be near. I'm talking about the glorious 002. Now everyone over-leveraged will not only get margin called intra-day, but have merely an hour to meet those new requirements. That's pretty huge. In my opinion I don't think we'll be seeing those massive pump and dumps (3/10) anymore. GME will no longer have to end the day at a certain price, but merely hit it intraday and hold it for an hour. Here's the infamous Cheat Sheet. There's lots to be excited about.\n\n&#x200B;\n\nhttps://preview.redd.it/lz4h4asptr671.png?width=960&format=png&auto=webp&s=39866817eac62a43b9b7edb2814b002bf6ae6210\n\n&#x200B;\n\n# 2. R1000, Quarter End, and T-21, T-35, T+105?\n\nI don't want to give hype for the next 2 weeks, but there are certain things that provide excitement regardless of what they are. The first is the Russell 1000. Our favorite little retail video game store is moving up in the world. From the Russell 2000, to the Russell 1000. It is known on wallstreet that the rebalancing day is the most \\*Volatile\\* trading day of the YEAR. There will be lots of volume and lots of price swings. Immense buying AND selling pressure from Index funds and ETF that are based off the Russell indexes also rebalancing. Also this week is the monthly T+21 cycle that has been happening for the last 6 months. As if on queue. I don't really have much to say about that, but the market is responding the same as it always does this time of the month. Not sure if these are proven but I've seen a couple posts regarding a T+35 and a master cycle of T+105 (hard to prove due to 105 trading days being 6 months+).\n\n&#x200B;\n\n# 3. Macro Economics and RRP go boom\n\nRecently on this sub there has been an amazing influx of Macro-Economic oriented DD. In this part of my post I am going to be referencing the most recent post from criand. [Link Here](https://www.reddit.com/r/Superstonk/comments/o4rfnu/the_fed_is_pinned_into_a_corner_from_the_2008/).\n\nLong story short, the fed is in a very tough scenario. They're in the process of having a collateral crisis where things can get very very tricky come the Quarter End.. When is that you ask? (June 30th). Next Wednesday. Referring to the Criand post, at quarter end, RRP usually reach all time highs, and hit levels 2x-4x of what the \"normal\" is pre quarter end. Criand also references the time when there was so much demand and so little supply for RRP that there was a NEGATIVE interest rate. The collateral was so valuable and they needed it so bad on their balance sheets that they would pay for it. Nuts Buts. If you're connecting the dots in the chronological order as I'm writing it, good for you, you deserve an extra cookie, but if you aren't, don't fear for I will connect them all  in the end. :)\n\n&#x200B;\n\n# 4. Recent White House Meeting between Biden, Yellen, Gensler, and Powell\n\nThere was a post saying how everyone is sick of being lied to by the government saying everything is fine and wondering how they can keep a smile on their face amidst such obvious market fuckery. I would like to present this theory. It involves being in their shoes. We can also apply it to the infamous Cramer Bear Stearns scenario from '08. The big thing here is this. Think about what would happen IF the White House had a press release saying that the markets have increased volatility and are expecting a crash, or said anything that could infer that. I would assume that there would be IMMEDIATE, IMMEDIATE, mass withdrawal of funds from everywhere. Personally, I wouldn't get my money out of the markets fast enough. I think the big takeaway from the meeting should be this: They're all meeting together. Biden isn't meeting with them individually when each is free, they're all meeting together. I'm not sure if this is precedented, would love some clarification, but just because the press release touches on some things they confirmed talked about, doesn't mean there aren't other things they didn't talk about. Take the same ideology to the Cramer and Bear Stearns scenario. IF Cramer said that they are going to fail, it would have happened that much sooner. Please remember that I am in no way sympathizing neither Cramer or the White House, just trying to give a different perspective as to why they said what they did. Below is the Press Release.\n\n&#x200B;\n\nhttps://preview.redd.it/5a7x0cmqtr671.png?width=690&format=png&auto=webp&s=2b216d6ddba29e6692a7ee1f84a650f071fcce8d\n\n&#x200B;\n\n# 5. Crypto Dump and other connections\n\nSurrounding our \"time of the month\", there are a lot of things that have been repeatedly going on in the market. Most times, if not every time. The first thing that I notice when I open my trading app/s is the usually big dump that crypto takes leading up to the 25th of every month. You can say Coincidence, but there are No Coincidences. Another connection could be that the bigger the crypto dip, the bigger GME goes up on the T+21 cycle. But regardless, just last week bank stocks dipped between 5-10%. And yet, not one article from MSM regarding it, or even giving a stupid reason. You could say that they are oblivious and that they are focusing all their power on pumping WSB stocks and tracking how many times we say WEN moon. There are so many things that are happening At. Or. Near. The. Same. Time. No Coincidences.\n\n&#x200B;\n\n# Ending Statement + Conclusion\n\nSo you're saying that there's this rule in place that can margin call people intraday AND they only have one hour to meet requirements? You're also saying this rule goes into effect days before the next T+21 cycle and the most volatile trading day of the year? ALONG with going into effect a week before quarter ends and when RRP could go negative due to demand? Yep.\n\nWouldn't the White House, Fed, SEC, have a meeting or something? Yep, they did.\n\nAre my Tits Jacked and should mine be too? Yes.\n\nIs it 2:30 AM and am I asking myself easy questions to reference my point? Yes I am.\n\nRegardless of what FUD comes out, and what the media says. Everything is connected, there are No Coincidences, and a meme stock didn't crash the economy. This is so much bigger than a \"meme\" stock. This is systemic corruption to the highest degree. This is the rich playing with money that they got through corrupted means. This is banks and HF pushing a narrative, then putting someone in power to defend that narrative. This is what happens when those in power have an agenda other than being for the people.",
    "title": "No Coincidences.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/o5hejo/no_coincidences/"
}