{
    "author": "thomas798354",
    "created_utc": 1621914508.0,
    "distinguished": null,
    "edited": 1622028905.0,
    "id": "nkgdwg",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nkgdwg",
    "num_comments": 499,
    "permalink": "/r/Superstonk/comments/nkgdwg/connecting_all_the_dots_while_dumbing_it_down_to/",
    "score": 3319,
    "selftext": "The Situation:\n\nBack in January Hedge funds called the wolfpack who aggressively short companies together on the market into bankruptcy were caught with their pants down when the companies did a full reversal due to retail investors simultaneously investing in undervalued retail stores coming out of the pandemic.\n\nKnowing the Wolfpack:\n\nIt operates as independent hedge funds that function as a hive mind, shorting the same company together to make more money.  Bailing themselves out of trouble like in January \\*cough cough\\*.\n\nWhat is a short:\n\nWhen you sell a stock and owe a share on your account but have the cash equivalent from the time you sold the security credited.  Prime brokers or banks all the popular ones in the US will allow hedge funds to short a stock anytime they ask even if there are no shares to short available to profit 1% from the transaction.  When the prime broker cannot locate a share for the short later on it is marked as an FTD and send to the DTCC who is supposed to be a regulatory authority but doesn't do its job because it is full of corrupt people that profit more from fines.\n\nThe Perfect Platform:\n\nThere was a brand new start up trading software literally called robinhood that marketed itself to retail investors and was hugely popular for obvious reasons in name as well as human factors software engineering.  The beautiful thing Robinhood did for everyone in January which was actually seen as the beacon of light for retail (when they listed every stock we shouldn’t attack) \\*Wait hold the fuck up Vlad is Actually the Good guy?\\* was when the trading platform prevented retail from buying the shorted securities in the January short squeeze and only allowed selling which gave HFs a chance to get those shorted shares back. The problem is…….No one fucking sold.  The biggest most popular two stocks are GME and AMC who have since January done big things to stay afloat and outlast the shorters.  AMC is different in the sense citadel is long, their buddy Wanda sold early, it’s almost like citadel is afraid to go short on it but wants to control the price I would be careful here apes, I was able to connect Wanda to the short hedge funds and it looks like they just told their buddy to hop out.  GME is especially being known for doing a complete business transformation involving a board of directors composed of ecommerce industry leaders from chewy and amazon.  Their Chairman, Ryan Cohen ex-CEO of chewy leading the ship to a complete turnaround in revenue, eliminate debt, improve customer service, and expanding the demographic in such a short time.\n\nFast Forward to Now:\n\nHedge funds that originally had Billions now have their cash all locked up in margin accounts with the prime brokers or banks.  The banks have given them 10-30 to 1 leverage on shorting securities as long as they can keep enough collateral in the account. The hedge funds have found lucrative ways to stave off margin calls over the last 4 months doing everything from a  textbook crypto currency Bull trap:\n\n&#x200B;\n\nhttps://preview.redd.it/rlvokkh7w6171.png?width=512&format=png&auto=webp&s=894c40073929a2297d40c72a57fc4c432f19a73b\n\nTo shorting treasury bonds:\n\n&#x200B;\n\nhttps://preview.redd.it/f5s9ox98w6171.png?width=878&format=png&auto=webp&s=43cef460f5814a8b391a62ec4d3ffbaa4516f1fc\n\nThe federal cap on reverse repo is 500B we are expected to hit that before Friday….\n\n&#x200B;\n\nhttps://preview.redd.it/h8oqv6y8w6171.png?width=1495&format=png&auto=webp&s=57d9ef780564cb3b52bcbca0fa5fe8d776235638\n\nThis is how I found out that hedge funds were using crypto to make cash to use for Margin^. u/criand recommended I add the FTD dates to this to show that the arrows are pointing to FTD spikes: \n\nJanuary 29\nFeb 25\nMarch 11\nMay 17 \n(See his post for more info on FTDs trying to keep this simple)\n\nIf you’re a numbers ape please reference this post here: https://www.reddit.com/r/Superstonk/comments/nkde38/bitcoin_address_activity_appear_to_mirror_gme/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\nOP describes tracking the address of the account stating that it is capable of perfectly timing markets and their trading strategy resembles an institutional investor or bank then further goes into its transaction history....\n\nAnother data point that can help prove my point here is the US margin debt value taken in March at 822B it’s up 72% from last year that’s 350B higher than last year think about that what event happened that required a stupid amount of cash on margin? Shorting stocks to oblivion. While not all of that number is hedge funds that number is also from March and there’s no sign of them covering, meaning it’s only gone up since then. 1T just got wiped from crypto and there’s most likely exactly 1T in margin debt of which 80-90% is probably hedge funds.  I don’t believe in coincidence…. There’s no way retail traders make up a 72% increase in margin. Margin data that was primarily used by hedge funds in the first place.\n\nAn Ape in the comments added that shills were being paid to spread FUD in crypto, completely untraceable.  It would be easy to pay in crypto when you have huge crypto wallets as well, just another clue of their illegal activities.\n\n5/24 entry: My suspicions of another member defaulting last Monday on the pivotal date of FTDs May 17th was correct.  [https://www.ft.com/content/c02a6e97-5505-4d4a-933f-a0e934ca6eda](https://www.ft.com/content/c02a6e97-5505-4d4a-933f-a0e934ca6eda)\n\nGreensill is down.   This makes HF no 5 I’ve counted so far, bank no 2 that has shorted the meme stocks another small entity.  How this one ties in: the clearing house estimated to come knocking tuesday 5/25 will be for them. They have publicly announced failure today as another bank took control of its assets.  The last step in day 5 of the self winddown next step is for the clearing house to close short positions.\n\nWhy Greensill defaulted and bringing an Italian bank down with it connected all the dots: when archegos fell a while back they almost liquidated credit suisse a pretty big bank.  Archegos was a small hedge fund.  This confirmed the banks and the hedge funds are paired up and the banks act as the prime brokers for the hedge funds and make massive amounts on share lending and Payment for order flow. This is how they were able to **beat earnings** but then ask for **record high bond sales**! The final piece of the puzzle! The smaller the hedge fund the smaller the bank they are partnered with….the bigger the hedge fund the bigger the bank! Look back two months ago. What banks sold bonds for liquidity?\n\nThis leaves many people wondering what will happen, this leads me to my next section of: I’m not a physic but I’m pretty damn sure I just read these wounded animals like a fucking book.\n\nMy Prediction of Future Events:\n\nTuesday May 25th there will most likely be a T+21 Buy, a clearing house closing Greensills positions, and major whales trying to margin call HFs…… This day will result in 1 of 2 outcomes:\n\n1. HFs give in and let us win because they know they cannot beat this buy pressure.\n2. HFs use all the remaining margin from the repo market (100B) to short our offensive one last time\n\nThe Federal banking committees (congressional and the senate) are set to meet with the biggest banks on wallstreet to what I can only assume to be them talking politely to the banks asking them:”Why the fuck have you let this get so fucking far out of fucking control you stupid fucks, I have no more cash in the repo market to lend you”\n\nMeanwhile in the stock market we cause the biggest margin call of US history.  Lets do a rough estimate of margin here: All the leverage given by banks at 10 to 1, the entire 500B in the repo market, the 1T in crypto, the HFs individual total assets…..eh maybe 2T-3T dollars short?.......\n\nOnce the reverse repo market hits a cap at 80B per party but not every party that can be involved, wants to be involved the hedge funds are done.  No more cash to pull from to maintain collateral requirements.  The government will put a cap on this if it keeps growing at this rate.  No one has enough assets to cover this fuck up.  Soooooo Bam Margin call hits Friday-Tuesday on everyone short.  This gives 5 business days for them to get their affairs in order and then clearing house buying computers will step in and rip these meme stocks to the high fucking heavens.  MOASS baby.\n\nWhy does this have to end by June 6th? If a true count of how many shares were shorted, naked shorted, rehypothecated ever got out the US financial market would be seen as an absolute fucking scam by the entire planet(if this whole story didnt already). This is why the government has put pressure on the regulatory authority to force the hedge funds out of their positions.  You think the government had nothing to do with this?  Who kicked out the old chairman and put in Gary Gensler? Who has since his appointment been dropping rules meant to squeeze hedge funds out of shorts non stop? More collateral=fast squeeze.  More available players to bid on assets=sprinkling some blood in shark infested waters. Here Blackrock come squeeze the hurt hedgey so you can take his and all his prime brokers assets! The ducks are all in a line to kick this bad boy off by the end of this week, early next week.  When banks and HFs collapse from overleveraging assets their stuff goes to auction. Meaning this event will cause the biggest stock market crash we’ve seen in possibly forever depending on how well banks manage their assets.  Just enough buy pressure, or a slow bleed across a few days and they run out of collateral.  BUY HODL VOTE.\n\nP.S. When you’re rich, set aside cash for taxes before you go dumping into very attractive companies at 50% off or a new house or a car.  And for all you assholes that don’t like dates Fuck you you’ll get over it.\n\nMay 26th edit: Well this just got spicy, lemme give ya a rundown of what most likely happened yesterday.  Short sellers lost 618M in a day and the FTD cycle will be spread out across a 2 day span.  Most likely there’s been a margin call again, meaning we have a 5 trading day winddown period before another clearing house has to buy.  Because a shit ton of options contracts just slid ITM after yesterday, expect a potential gamma on Wednesday the latest day options that are excersized can be delivered shares......Morgan Stanley booted their prime broker. Shit just got real, the chain reaction is about to run. Remember what I said up there👆 \nThe more members that default the more shares have to be force covered by a clearing house, until they get broke then the DTCC has to pay.  The same entity that let all this happen this whole time when they were skimming fines from billions of FTDs from prime brokers...... ok I’m done. \n\nSpecial Thanks:\n\nMy buddy Brian finance Major from Rowan University who has repeatedly gone to finance professors and asked questions for me he didn’t know the answers to.\n\nMy buddy Rahi, a Physics Major who helped me run some numbers on work nights.\n\nMy GF for believing in my crazy rants about GME, doubling down with me in your own brokerage account, and Supporting me while I work 3 jobs and spend more time on research and career progression than you.\n\nu/HomeDepotHank69 for convincing me to share this DD despite the Shills and No dates haters that have since swarmed my account.\n\nHere’s to being filthy fucking rich, cheers DFV.",
    "title": "Connecting all the Dots While Dumbing it down to a Third Grade level:",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nkgdwg/connecting_all_the_dots_while_dumbing_it_down_to/"
}