{
    "author": "CondorThePoet",
    "created_utc": 1621849737.0,
    "distinguished": null,
    "edited": 1621854064.0,
    "id": "nju5wg",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nju5wg",
    "num_comments": 91,
    "permalink": "/r/Superstonk/comments/nju5wg/superblood_moon_t21_and_t35_crossover_bull_charts/",
    "score": 2311,
    "selftext": "Hey guys, hope everyone's doing well. Spoiler: >!You should be.!<\n\nI would also like to give a very warm welcome to our new crypto friends! Everyone here welcomes you with open arms and I believe in each and every one of you to hodl through the ups and downs, I know you're used to volatility and this is why I'm so confident that you guys certainly come here with diamond encrusted hands.\n\n&#x200B;\n\nhttps://preview.redd.it/md15dv6wc1171.jpg?width=480&format=pjpg&auto=webp&s=c3ccdd4da006dab99ce4c84087a35afe4c002fc3\n\nI'm going to keep this post ape-friendly as there's a lot of new people joining the sub (love you guys) and not everybody will have knowledge of every term I throw at them... we were all at that stage at one point so let's *be excellent to each other.*\n\nWow! Isn't this week making your nippies >!throb!<? Mine sure are. So many things are aligning and we're all excited - rightfully so! However, do y'all remember the Zero-Coupon Bonds that were issued on May 4th with a maturity date of June 1st? I sure remember. [This post](https://www.reddit.com/r/Superstonk/comments/n19kgr/zerocoupon_bonds/) put together by u/Magistricide explains very well what these bonds mean. In a nutshell, these bonds are generally issued when expectancies are for interest rates to go down and/or **stock prices plummet.** Damn, that sent a chill through my spine. Usually bonds have a maturity (expiry) date of approximately two to five years... these Zero-Coupon Bonds have a maturity date of less than a month! \\~$40billion worth in-fact! That's correct - a '40' with *nine* zeroes after it. This means that people out there seem to be *veryyy* confident that there's to be a market crash before June the 1st - eerily close to the one and only GameStop meeting. Coincidence right? We can settle with that. Another spoiler: >!not a coincidence.!<\n\n&#x200B;\n\n[Credit: u\\/Magistricide](https://preview.redd.it/z495mx5gd1171.jpg?width=590&format=pjpg&auto=webp&s=3258abb1d412de1e3692a019ecf511fb0fbdbc94)\n\n# What does this mean for GameStop?\n\nYeah yeah, we're aware of a market crash incoming and there's been people addressing it for months now... whatever. Well, my fellow friends... there's two absolutely beautiful words that we are aware of - >!Negative Beta.!<\n\nQuick recap on negative beta...\n\nBasically, most stocks have a 'beta' value of 0 or 1 (in most cases). This means that they have the tendency to *move* with the market. If the market is going up, that stock is likely going to go up with the market. Simple right?\n\nOur beloved stock GameStop, however, has a beta value of [approximately -30 (+/- 3)](https://preview.redd.it/m7uvwde29zv61.png?width=1917&format=png&auto=webp&s=e25298ab4b37ec5ce6d46f8519f399a2b841d1e5).  Negative beta indicates an inverse relation to the market, which as you may have guessed, tends to move opposite to the market. If the market goes down, the stock has the tendency to go up.\n\nThis is absurd for a stock and to the people who say that negative beta doesn't matter - you're right (kind of). Excuse me? Let me explain.\n\nSee, you're incorrect thinking that beta values don't matter because they're an indicator of past data. It matters because it tells us how the stock is likely to move in relation to the current market - deriving from both past and current data.\n\nHowever, you're somewhat correct because as we all know, GameStop is a heavily manipulated stock and its movement simply doesn't make sense. >!Bullshit, I know.!<\n\nThe thing is... with all the rules coming in place and all the stars aligning, it's becoming harder and harder for them (HF's) to manipulate the stock and the only thing they have left is *time.* I recently made a post about this and how essentially each Hedge Fund Manager has a similar thought process even when they're royally fucked. If you'd like a read, feel free to do so (not compulsory, consent is key). [Link to the post.](https://www.reddit.com/r/Superstonk/comments/n4dep4/please_read_why_hfs_continue_to_short_more_gme/)\n\nWhen the market crashes, what do you think will happen to GameStop? Kenny and co. will lose a significant chunk of their capital value via long positions and what will the result of this be?\n\n&#x200B;\n\nhttps://preview.redd.it/yy4nsqivh1171.jpg?width=821&format=pjpg&auto=webp&s=ae4a5baefe90d3c1aed78163219a04f52e769894\n\nI would love to go more into detail but I'm a silly ape and have been indulging some of the best brew known to ape-kind - >!Carlsberg.!< Therefore, I'll leave it at that. Wrinkly apes can look more into these Zero-Coupon Bonds if they'd like to in order to see if they can find any leads. I'm gonna go pass out now. Love you all.\n\n&#x200B;\n\nhttps://preview.redd.it/fjsiaw5di1171.jpg?width=800&format=pjpg&auto=webp&s=f09c1f453326042eb06148377dc13cbac3f7e1f9",
    "title": "SuperBlood Moon, T+21 and T+35 cross-over, bull charts, NEW crypto friends! - this week is looking juicyyy! Here's another significant thing we've forgotten about that's tit-jacking (kind of) to look forward to on June 1st!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/nju5wg/superblood_moon_t21_and_t35_crossover_bull_charts/"
}