{
    "author": "perfidiousfox",
    "created_utc": 1621911683.0,
    "distinguished": null,
    "edited": 1621912463.0,
    "id": "nkfjlr",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nkfjlr",
    "num_comments": 66,
    "permalink": "/r/Superstonk/comments/nkfjlr/suspected_price_manipulation_to_move_options/",
    "score": 737,
    "selftext": "TLDR: I suspect someone is using the low daily volume to manipulate the price during market hours and buying/selling put/calls to profit on the wide intraday price changes to make millions.\n\nFirst off, Im a freaking nobody, with no experience in trading or with markets, and very few wrinkles on my brain. However, I have always been good at noticing patterns, and after watching the stock trade, day in and day out I think I found something. I threw out some comments here and there, but haven't seen anyone else talking about this, so I figured I would give this a shot and see if anything sticks.\n\nForgive my poor writing style, I havent tried to do something like this before. Anyways.\n\nToday's market was so obviously manipulated it hurts my brain. No news, nothing changed, and we had about 6% swing. I know, I know, you're thinking \"yeah no shit, short ladder, yada yada yada...\"\n\nI think there's more going on here than just pushing the price down.\n\nI don't think there is JUST competing forces of good whales/bad HF.\n\nI think there is also one or two groups (hedge funds? market makers?) pushing both up and down and taking advantage of the low volume to move prices to benefit perfectly timed options trades.\n\nHere's something I started noticing on May 12th. might be one group, or two that had similar ideas.\n\n[\\\\\"A\\\\\" drives the price down, options trade hands, then price returns. \\\\\"B\\\\\" sudden buy pressure, options trade hands then price returns.](https://preview.redd.it/u7gpmgy8j6171.png?width=1688&format=png&auto=webp&s=19c1f914f6306e4b009bf566c3bf7ea3086a02e7)\n\nBelow is my smooth brain crayon paint job of today's price.\n\nhttps://preview.redd.it/bruucudki6171.png?width=1711&format=png&auto=webp&s=b361f868fe329650fe89f14b9348ff7f129ca303\n\nThe circles are just meant to show sudden price change. Over the last few weeks I keep seeing these patterns show up. Someone buys and moves the price of the stock about 5$ in a few minutes, a large volume of options trade hands, then sells shortly after. On other days someone would short the stock, move the price about 5$, options trade hands, then repurchase and the price would return to the baseline. Today with both buys back to back, and both sells back to back, price moved 10$.\n\nOptions on GME also had a huge swing. This chart is clipped from barcharts options tracking. [https://www.barchart.com/stocks/quotes/GME/options?view=sbs\\_ohl](https://www.barchart.com/stocks/quotes/GME/options?view=sbs_ohl)\n\nIve highlighted the main ones that look appear to be used in these trades on the put side.\n\n[Small open interest, huge volume, large price changes... nothing weird about that.](https://preview.redd.it/rtbvwf5fk6171.png?width=1172&format=png&auto=webp&s=d56a1c29a4b9a6c73fd53a54edb95cc741c8ea5e)\n\nMany of these Puts had their price change from high to lows by about 4$ per contract. If this was timed correctly, napkin math puts just the ones I highlighted netting the group about 2.5m dollars.\n\nThis is happening every day.\n\nNow, I have no idea what to do with this information.\n\nMaybe it's just a coincidence, maybe its just normal movements in price... It just seems weird and probably illegal.\n\nI made this post because I want more people to look, that know what to look for.\n\nI also am only using publicly free data, and can only look at the current days trades. Not sure where to get historical data, and have no idea how to tie all the different sources together. And even more honestly I spent about 4 hours just getting this shitty post together and brain hurty, so i have to stop.\n\n&#x200B;\n\nMaybe someone with more knowledge will know that to do with this information.",
    "title": "Suspected price manipulation to move options trading... need more eyes and more wrinkles to weigh in",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nkfjlr/suspected_price_manipulation_to_move_options/"
}