{
    "author": "aLeakyAbstraction",
    "created_utc": 1614630932.0,
    "distinguished": null,
    "edited": 1614631211.0,
    "id": "lvjsrl",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_lvjsrl",
    "num_comments": 147,
    "permalink": "/r/GME/comments/lvjsrl/reverse_engineering_the_hedge_fund_agenda_via/",
    "score": 998,
    "selftext": "**TLDR:** Shills (hedge funds or institutions) are very likely responsible for pushing not only the silv\\*r and we\\*d buys, but very likely AMC as well. They’re also still heavily trying to push GME FUD and encourage stockholders to sell.\n\nI work in Paid Social/Search Media which mainly involves ads but often extends into influencers and whatnot. Out of curiosity, I wanted to see if I could reverse engineer the hedge fund agendas via their social channels (accounts, subreddits, etc.) Now you might be wondering a few things including, how would one do this, how do we verify any information, and where do we even start? If you’ve seen the Netflix documentary on Spycraft, there’s a quote that stands out that I believe is relevant to this situation (I’m paraphrasing here) “If you try and create a false identity and cover, it becomes exponentially more complex in the social media age. Because if someone begins to analyze it, certain elements start to become obvious as fabricated.”\n\nIn situations like this, it’s best to start with a suspected source you are pretty sure is accurate and then start investigating there. For example, during the initial GME liftoff, there was a sudden surge of “Buy Silv\\*r!” (using the asterisk to avoid aut\\*m\\*d just in case). We can be reasonably certain given the sudden surge out of nowhere (and coordinated media) that this is a manufactured distraction and did not originate from WSB and therefore is very likely from shills (either hedge funds or institutions). Some regular users may have profited off of it, but this wasn’t a naturally occurring event.\n\nThis is where the shills made a careless mistake, in order to push these agendas they’d want to make sure they have as much control as possible. Therefore you can reasonably assume that the moderators for subreddits related to these subjects may be shills and therefore are reliable trails to follow that will lead you to what they’re aiming at. Not 100% proof, but a good place to start. If you didn’t know, spy networks have been found out in the past because the agents only communicated with each other or only go to the same areas - I’m using a similar tactic here to see where they go and what they promote.\n\nIn my research, the following are the most suspicious subreddits for being mostly compromised via either mods or their users:\n\n1. Wallstreetsilv\\*r\n2. Silv\\*rSque\\*ze\n3. Wallstreetbet\\*Elite\n4. G\\*ldSque\\*ze\n5. GME\\_Meltd\\*wn\n\nIf you take a look at the moderators for some of these subreddits, you’ll notice a few things. One, the moderators aren’t necessarily new accounts but actually a few years old. So how do you know if they’re fake or not? Well aside from the fact that some are pretty obvious and constantly posting their agenda, usually you’ll find a large time gap between when the account used to post to all of a sudden being super active and moderating subreddits. If you take a look at [https://www.reddit.com/user/ivanbayoukhi/](https://www.reddit.com/user/ivanbayoukhi/) for example who’s a mod on Wallstreetsilv\\*r, you’ll see a two year old account that suddenly became active with an enormous number of silv\\*r posts.\n\nNow if we look at [https://www.reddit.com/user/Deuteronomy1822/](https://www.reddit.com/user/Deuteronomy1822/) who moderates Silv\\*rSque\\*ze, you’ll notice they’re also a mod for some pretty weird subreddits including wallstreetbankru\\* and G\\*ldSque\\*ze. This mod is also a mod for Wallstreetsilv\\*r.\n\nOkay, so these are pretty obvious, but what happens if we look at Wallstreetbet\\*Elite? Taking a look at their head mod it seems as though he created the subreddit a while back as an offshoot to try and move users away from WSB during the initial debacle with the WSB founder. The mods appear to be real people though. Okay, what about the users? Take a look at this user here for example [https://www.reddit.com/user/Appropriate-Ebb-2281](https://www.reddit.com/user/Appropriate-Ebb-2281) who promotes d\\*gecoin, AMC, and anti-GME FUD as seen here: [https://www.reddit.com/r/GME/comments/lt31n4/shills\\_at\\_it\\_again\\_rwallstreetbetselite\\_is/](https://www.reddit.com/r/GME/comments/lt31n4/shills_at_it_again_rwallstreetbetselite_is/)\n\nFor reference, in Social Media, it’s very rare for new users to constantly post content - most people tend to passively consume it instead. That said, many of the posts in WallStreetbetselit\\*are not only heavily pushing AMC, but also trying to get AMC to jump on the GME bandwagon. This leads me to believe that AMC is sadly likely a distraction from GME. No offense to anyone who bought AMC, but when bots/shills start promoting a stock like they did with silv\\*r, it’s probably not a good thing. The two stocks might trade similarly though so you may see slight bumps here and there, though I doubt it'll likely be on the scale of what GME is.\n\nWhat about GME\\_Meltd\\*wn? Well, let’s take a look at one of the flaired “top shitposters” [https://www.reddit.com/user/bananacakesjoy/posts/](https://www.reddit.com/user/bananacakesjoy/posts/). Here we have an account that posts nothing for 4 years (comments or posts) and then suddenly posts almost 6+ anti-gme memes/comments per day. Now keep in mind, just because there may be a human behind the account replying to you, it doesn’t mean they aren’t a shill. PR has teams of people paid to manage these sorts of things. Think of it as customer support, but out in the public.\n\nHow about WSB? Well, I actually believe the mods have been solid (even during the short uncertain time when zjz wasn’t there). I was looking at Opinion\\_Is\\_Unpopular and could see the rationale for why he would block some posts (he shared publicly) which showed me he was being impartial. That said, when it comes to users on the subreddit, the shill accounts are definitely coming after WSB. Take a look at this GME FUD from a new-ish account that suddenly knows what’s best, is worried about everyone, and is brave enough to share (WSB): [https://www.reddit.com/r/wallstreetbets/comments/lut0gi/why\\_the\\_squeeze\\_youre\\_all\\_dreaming\\_for\\_wont\\_happen/](https://www.reddit.com/r/wallstreetbets/comments/lut0gi/why_the_squeeze_youre_all_dreaming_for_wont_happen/)\n\nOkay, so what about weed? Well, I believe the explosion of interest overnight (and immediate dump afterward) was manufactured but a lot of real people likely got caught up in it. The people I saw posting memes about it seemed to come from more real accounts. You can certainly write this off as speculation, but the timing of the weed surge was certainly odd.\n\nOkay, so I’ve covered off on those, but I want to warn you guys of the biggest thing they are likely planning for the coming days. If I were in their shoes, I’d be making and buying accounts that are super heavy pro GME, posting DD, support, etc. Then, should a squeeze event start to occur and have a slight dip, get these accounts to start spreading heavy FUD that “It’s all over” “That was it” “Thanks everyone for joining in on the squeeze, hope everyone profited” \\*see screenshot here and me buying my lambo\\* Don’t believe it, we know how high this can go.\n\n**Objections:**\n\nI’m happy to see any rebuttals to what I’ve mentioned here, but your counterclaim should include evidence and not just what you think. I expect a common response will be “but how do you KNOW for CERTAIN” or something to the effect that we’re just speculating. Well, no one can say for sure who is behind what as that would require a level of omniscience, but I have provided evidence that this activity is indeed occurring. There’s also the possibility of trolls being involved, but if you were to ever uncover a shill, I’m sure they’d just use the cover of “lol I’m just trolling/karma farming.” Either way, whether it’s a shill or troll, the end result is the same - it’s just a waste of time.\n\nThat said, be mindful that the GME hype attracted a lot of attention from new people to the subreddit so a new account alone isn’t proof of something happening. It’s worth considering but is not sufficient in and of itself. You need to see a pattern or something else, in addition, to be more certain.\n\n**Final Note:** A quick note on faith. In the early days of GME, it was easy to point to the S3 numbers and have faith that the squeeze would occur. Then we looked to Finra but then found out about the ETF shorting. So now you’re probably wondering if I can’t see a number, the only one I can look at is if the stock is going up or not. For me personally, I look at it from a social media lens. There is plenty of anti-gme activity from bots, shills, etc. that show me there’s a force out there who does not want this stock to go up. That and Cramer panicking seems to be a solid tell. So based on these things, I’m going to hold and wait for the squeeze.\n\n**TLDR:** Shills (hedge funds or institutions) are very likely responsible for pushing not only the silv\\*r and we\\*d buys, but very likely AMC as well. They’re also still heavily trying to push GME FUD and encourage stockholders to sell.\n\nPlease do not give me gold for this post, I’d rather you donate $5 to autism research foundations instead.\n\nBut how do you know you can trust me? How do you know I’m not a hedge fund trying to marinate and misguide you? Or that I’m an ally institution trying to help you? Who knows.",
    "title": "Reverse Engineering the Hedge Fund Agenda via Social Media",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/lvjsrl/reverse_engineering_the_hedge_fund_agenda_via/"
}