{
    "author": "bchrzfg215",
    "created_utc": 1614653540.0,
    "distinguished": null,
    "edited": 1614674403.0,
    "id": "lvs5df",
    "text_only": true,
    "flair_text": "Discussion",
    "name": "t3_lvs5df",
    "num_comments": 687,
    "permalink": "/r/GME/comments/lvs5df/when_gme_goes_to_the_moon_the_sub_should/",
    "score": 3694,
    "selftext": "For one weekend, we could plan and host one of the most iconic and historic celebrations the earth has ever seen.\n\nWe could collectively rent out Vegas or a tropical island for a weekend for a covid-safe, Gastby-level event with music, food, cars, fireworks, a petting zoo, pools, ANYTHING and EVERYTHING you can think of.\n\nTo come you’ll have to verify screenshots of your positions, exits and gains (even if it’s just 1 share) and we’ll have in-person 24HR covid testing + a mandatory COVID test 24 hours before entry.\n\nIt will be a moment in history.\n\n\nEdit: (just adding ideas as they come)\n\n+ 24HRS free tendies stands (Wendy’s, KFC, Popeyes, you name it).\n\nWe will party under the sun, tan, jump into swimming pools and rage during the day, and at night we’ll dance under fireworks and walkways/areas lined with neon lights and tiki torches, with free 24HR access to McDonalds🍦 and a FULLY stocked supply of party catering/vendors.\n\n+ Free Tesla and Lambo rides (rented or just flat-out purchased vehicles on site).\n\n+ ALMOST FORGOT, free TATTOO artist stands all over the island/venue (which will be festival-sized!!), with pre-designed pictures of Tendies, GME, WSB and GameStop logos for your asses, faces, titties and other body parts!! Or you will be able to bring your own graphics\n\nAm I missing anything?? Comment below. This will be a party for the fucking textbooks. Covered in the last chapter of the History &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp; Economics book about the MOASS: GameStop\n\n**TLDR: If GME goes to the moon, apes should throw the biggest, most fun and ridiculous (COVID safe) celebration in the world. seriously.**\n\nedit once again:\n\nThis event, celebrating the MOASS, will be called the MOAC, *Mother Of All Celebrations*\n\nedit #3: there will be tiger petting-zoos, with tigers handled by trained professionals. this is NOT a joke.\n\nedit #4: in additions to 24 HR tendie stands, there will be 24HR tendie *taco* stands as well.\n\nedit #5: one of the main celebratory night time events will be the SAFE/CONTROLLED burning of an absolutely colossal wooden bear, which will become a bonfire centerpiece that we dance around as fireworks illuminate the sky, and festival speakers fill the air with night time party music\n\nedit #6: rubbers will be as freely available as tap water.\n\nedit #7: for our more adventurous diamond hands, there will be strippers\n\nedit #8: we want everybody to REMEMBER this historic party, but there will be loads of alcohol  available everywhere (obv if you’re 21). be rtrded but responsible\n\nedit #9: this event will not be about making money, it will be coming together to meet each other, party and fucking rage. everything will be subsidized. once you’re inside, the community has already paid for the event. tendies, tatts, music, booze, and everything else that can be pre-paid for, will be free inside of the venue. no worrying about money, just fucking raging once inside.\n\nedit #10: controversial. maybe a midget toss? will see if there’s backlash from the little people community before we commit.\n\nedit #11: During the day, as a reprieve from absolute madness and partying, Keynote speeches from the most reputable and acclaimed new wealth advisors in the world, headlined by DEEPFUCKINGVALUE (assuming he attends).\n\nedit #12: Of course there will be nerd activities as well. Gaming areas with consoles, controllers, VR setups, gaming PC rigs, Coca Cola, tendies, gamer food, etc. Call of duty, Minecraft, The Witcher, whatever you nerds want to play. Local and online\n\nwe will have airtight logistics, and big ape security to ensure everyone is r*tard*d and free, but safe.",
    "title": "When GME goes to the moon, the sub should temporarily be re-dedicated to planning an absolutely historic Gastby-style celebration event for all of the 💎✋ on this sub",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/lvs5df/when_gme_goes_to_the_moon_the_sub_should/"
}