{
    "author": "Klone211",
    "created_utc": 1627140174.0,
    "distinguished": null,
    "edited": 1627154674.0,
    "id": "oqs3i7",
    "text_only": true,
    "flair_text": "Theory DD 🤔",
    "name": "t3_oqs3i7",
    "num_comments": 102,
    "permalink": "/r/GMEJungle/comments/oqs3i7/nscc2021010_means_faster_tendies/",
    "score": 836,
    "selftext": "##TL;DR The MOASS should have less interruptions now that there’s a lower chance of a Level 3 MWCB tripping.\n\nMy post [clarifying trading halts and suspensions](https://www.reddit.com/r/Superstonk/comments/oi5vl0/the_post_about_the_10tradingday_suspension_is_not/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) led me to this small realization:\n\nIf I’m understanding the filing correctly it basically allows the MOASS to happen with less effect on the rest of the market. If that’s the case, **we may not need to worry about all-day halts** due to Level 3 market wide circuit breakers (MWCB). The filing should slow the implosion of the market, possibly allowing it to avoid all-day halts while simultaneously giving GME more time to rip.\n\nWithout this filing the whole market would very likely be halted for the rest of several trading days due to a 20% drop in the price of an index on those days. **(Note: An index can still drop 20% with the filing implemented because the chances of it happening are still there.)** In the end, it all depends on how much collateral the clearing house purchases from defaulting members. The more collateral they purchase, the more stable the market during the MOASS which lowers the likelihood of an all-day halt.\n\nAs for halts due to rapid price changes in GME itself, there will be many. However, because a Level 3 MWCB halts the entire market for the rest of the day it would automatically halt trading of GME for the rest of the day as well, forcing us to miss out on a lot of time for GME to moon. Therefore, it’s better for us if the market tanks more slowly so thanks NSCC-2021-010!\n\nFor the record, I’m not saying the SEC has our best interest in mind. With the current lineup they’re most definitely looking out for other interests. Future replacements should help with that… [Gurbir S. Grewal](https://en.m.wikipedia.org/wiki/Gurbir_Grewal) is one such replacement.",
    "title": "👀 NSCC-2021-010 Means Faster Tendies 👀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/oqs3i7/nscc2021010_means_faster_tendies/"
}