{
    "author": "CalebTGordan",
    "created_utc": 1617936828.0,
    "distinguished": null,
    "edited": 1617980171.0,
    "id": "mn80a5",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_mn80a5",
    "num_comments": 458,
    "permalink": "/r/Superstonk/comments/mn80a5/after_the_moass_rules/",
    "score": 5244,
    "selftext": "**Rule #1**: Keep your fk’n mouth shut.   \nThe biggest threat to your well being will be determined by who you tell and how many people know. There are ways to spend tons of money and not let people know you have it. Don’t let the left hand know what the right hand is doing.      \n\n**Rule #2**: Don’t buy the lambo. Pay your taxes.   \nThe taxman will take everything if you don’t give him his piece. Set the money aside, pull out what is only needed to survive for a month, pay off some debts, and just breathe while you follow...  \n\n**Rule 3**: Build that team.   \nGet an accountant, a tax lawyer, an estate lawyer, and fiduciary financial advisor. Don’t go with any old joe. Find people who already work with successful millionaires. Look for big firms. Look for people who are complete strangers but have the reputation of trust.   \n\n**Rule 4**: Be humble, don’t dance.  \nDon’t make it rain. Don’t rub it in. Don’t show off. Breaking this rule also breaks Rule 1. Remember where you came from, remember you got lucky, and remember what it feels like to survive on mushy cheap ramen that has barely any flavor for years at a time. You came from poverty, and if you fuck this up you will go right back there. \n\nEDIT: I’ve seen some good points on the matter of luck. I see how this can be a difference in philosophy and should clarify. You are not an imposter who stumbled into buying and holding. You did work, you learned hard things, and you made a decision. You will deserve what you get out of this. My philosophy on luck, though, is that while you steer this ship, it was lady fortune that made sure you found it. You could have seen the single piece of FUD that caused you to walk away, but you haven’t. You could have had a life that or interests that kept you off of Reddit. You could have been born at a time or place where participating wasn’t an option. But guess what, your here. Life’s billion little circumstances put you here and gave you a choice. Be a paperhand, or be diamond hand. You chose diamond hand. \n\nEDIT to EDIT: I also agree with Luck = Labor Under Controlled Knowledge! Good one. I learned something new and I thank you for it. \n\n**Rule 5**: Don’t mess with someone else’s money, life, or spouse.   \nMoney can be a powerful thing, but don’t let it lie to you that you can have anything you want. Don’t screw over someone to make another dollar. Don’t see people as expendable. And don’t cheat or allow someone else to cheat. Play it safe and there won’t be any reason to take you to court, sue for money, or arrest you. \n\n**Rule 6**: Be the hero people need.   \nSome of us are going to be Bruce Wayne levels of wealthy. Sure Batman is cool and all but you have an opportunity to leverage your money to improve the world, and not do it in a way that is covertly sinister. Set up UBI programs, anonymously sponsor struggling but talented creators, set up scholarships, swoop in to fix major problems at a loss. \n\nEDIT: Bruce Wayne uses his money to buy cool toys and fight the mentally ill criminals of Gotham instead of funding social reform programs that would have prevented nearly all of his rogue galley from turning to crime. Poverty is the largest driver of crime. Let’s fund some stuff to end it. \n\n**Rule 7**: Bring people along for the adventure.   \nFind ways to change the lives of family members and friends in a way that doesn’t make them reliant on you but will let them join you on your adventures. Your team will have good advice on this, but make sure that you can build relationships on love and trust, not your bank account. You have a head start by following the previous rules.\n\nEDIT **Rule 8**: Care for your health.   \nGet to the doctor you have been needing to see. Take care of that pain you have been ignoring. Talk to them about the headaches or the mole or stiffness. You can afford it now! (And yes, I get how that might not apply outside the US because only in the US do we ignore health issues due to income.) For mental health, see a professional even if you don’t think you will need one right away. A councilor at minimum will be able to help you talk through the complicated emotions you will be experiencing, but a therapist might be good if you have been ignoring your ADHD, anxiety, depression, or hallucinations due to your poverty. There is no shame in seeking unbiased, professional assistance! Also, if you are religious it wouldn’t hurt to seek spiritual guidance at this time. \n\nOverall EDIT: Grammar and Words.\n\nLas EDIT: I am blown away by the response and thank you all. I hope we can all come out the other end better people, and not just rich apes. My hope is that we all become a little more kinder, gentle, loving, patient, and caring, but also badass and ready to get shit done. Love you all, be safe out there on your own adventures.",
    "title": "After The MOASS Rules",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mn80a5/after_the_moass_rules/"
}