{
    "author": "FDAz",
    "created_utc": 1622734628.0,
    "distinguished": null,
    "edited": 1622935569.0,
    "id": "nrgdlo",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nrgdlo",
    "num_comments": 858,
    "permalink": "/r/Superstonk/comments/nrgdlo/this_is_huge_news_investment_banking_company/",
    "score": 13796,
    "selftext": "Just saw this on twitter and found the source --- huge news!\n\nThis probably will lead more banks to do the same.\n\n**Rein in those shorties !!!**\n\n**\"**\n\n**Investment Banking Company Jefferies suspends short sells on $GME and another 2 stocks!**\n\nJefferies said to block short sells in GME, and another 2 stocks from being executed.\n\nFrom a trader:\n\n\"In addition to naked options, effective immediately, we will be blocking all short sells from being executed at Jefferies. If you choose to execute away, the trade will be subject to review by Risk/Margin prior to being affirmed.\"\n\n\"\n\nOriginal tweet: [https://twitter.com/Joshuajammes/status/1400471689549520901](https://twitter.com/Joshuajammes/status/1400471689549520901)\n\n&#x200B;\n\n(**cant post the original news link because the link mentions the movie stock and gets blocked by the bot - you easily find it on google - the news source is** [https://www.streetinsider.com/](https://www.streetinsider.com/) . Just copy paste the trader quotation to google)\n\nEDIT 3:\n\n2 Apes have accused this post of being FUD because there was no link or formal announcement from the bank. **There are now articles confirming this by** **Bloomberg**, **Benzinga. Seeking Alpha is also quoting it.** According to Bloomberg the Bank has announced this to its clients today.\n\nWe cannot expect the Bank to send out a public statement about this, cmon... hush hush please, let's not expect them to tell the entire planet that the short squeeze is coming. (irony much)\n\n&#x200B;\n\n**Important note**: while the original news story only quoted an anonymous trader that works at the Bank, the story by Bloomberg states that **Bloomberg has seen the Memo that was sent to clients** with this information.\n\n\\---------------------------------\n\nEdit 1: I wrote naked shorts on the title but I meant naked options as in the quote.\n\n\\---------------------------------\n\nEdit 2:\n\nJefferies is an Investment Bank that allows corporate clients (hedgies and the like) to invest through Jefferies. According to their website, their clients are **corporate and financial sponsor clients.**\n\n\"\n\nJefferies Investment Banking is a global leader, offering deep sector expertise and broad advisory and capital markets capabilities **to corporate and financial sponsor clients**. With approximately 900 investment banking professionals across the Americas, Europe and Asia, we provide global coverage across all products and sectors.\n\n&#x200B;\n\nAlso as pointed out by [Public-Ad6926](https://www.reddit.com/user/Public-Ad6926/):\n\nit appears Jefferies has been targeted by short-sellers back in 2011. See link here:\n\n[https://www.gurufocus.com/news/153760/jefferies-ceo-issues-letter-saying-shortsellers-spreading-malicious-lies-about-company](https://www.gurufocus.com/news/153760/jefferies-ceo-issues-letter-saying-shortsellers-spreading-malicious-lies-about-company)\n\nKarma is a BITCH.\n\n&#x200B;\n\n**TA;DR: Jeffries does NOT want to be the one holding a colossal bag of** 💩 **when the short squeeze starts, so it just announced: if you want to SHORT GME - GO SOMEWHERE ELSE.**\n\n&#x200B;\n\n\\---------------------------------\n\nEdit 4: DFV posted a song about \"**JEFFREY**\" 15 minutes ago. Not sure if he reads this, but if he does let me just say: you're The Absolute Legend. No \"hero-worshipping\", just fully acknowledging and appreciating the GOAT.\n\n[https://twitter.com/TheRoaringKitty/status/1400522985375780872](https://twitter.com/TheRoaringKitty/status/1400522985375780872)\n\n&#x200B;\n\n\\---------------------------------\n\nEdit 5: This news story is now up on Zero Hedge, as well as **Yahoo Finance**. Finally, a link that is not blocked:\n\n[https://finance.yahoo.com/news/jefferies-blocks-short-sells-gamestop-174600093.html](https://finance.yahoo.com/news/jefferies-blocks-short-sells-gamestop-174600093.html)\n\n&#x200B;\n\n\\---------------------------------\n\nTADR2: To the apes asking why this is important - this Risk management stance is important because it:\n\n\\- sets a precedent that may (will) be followed by other industry players, thus reducing the amount of avenues for shorting GME. According to Seeking Alpha, there is already a second bank following this idea (Raymond James but it seems they only announced no shorting for the movie stock).\n\n\\- confirms the ape's thesis that shorting GME is a very very high-risk play, so much that it's not accepted by certain banking institutions, because guess what ----------- the Tendie man cometh.\n\n\\---------------------------------\n\nEdit 6:\n\nApe [jaypeepeeee](https://www.reddit.com/user/jaypeepeeee/) linking everyone to a post that found Jefferies was **the broker who was responsible for GME's share offerings.**\n\n[https://www.reddit.com/r/Superstonk/comments/nrm8va/was\\_reading\\_the\\_gamestop\\_10k\\_from\\_march\\_and\\_i/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/nrm8va/was_reading_the_gamestop_10k_from_march_and_i/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n&#x200B;\n\n\\---------------------------------\n\nEdit 7:\n\n24 hours have passed since my post, and the expected reality is materializing. Other banks did not waste more time and are also placing restrictions against shorting GME and other ultra-shorted stocks -  this time Goldman Sachs Group Inc., Bank of America Corp., Citigroup Inc.\n\n[https://www.bloomberg.com/news/articles/2021-06-04/wall-street-banks-rein-in-hedge-funds-short-bets-on-meme-stocks](https://www.bloomberg.com/news/articles/2021-06-04/wall-street-banks-rein-in-hedge-funds-short-bets-on-meme-stocks)\n\n**Please remember that this doesn't mean the shorting, or the naked shorting, will stop. It just means that, officially, it will be more difficult, there will be less avenues for it. This may also be used to give longs a false sense of victory.**\n\n**Nothing has changed. MOASS OR RICE NOODLES**\n\nCan apes dream of a future without naked shorting and all kinds of fuckery? Maybe not yet, but perhaps it may be moving in the right direction.\n\nNow... **rein in those wild shorters please, they've already pissed all over the market.**\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/x0x6r56uwi371.png?width=640&format=png&auto=webp&s=cdd9ce444e0e21bb7eba962a667ba5712af0982c",
    "title": "This is HUGE NEWS: Investment Banking Company Jefferies suspends short sells and naked shorts on $GME",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nrgdlo/this_is_huge_news_investment_banking_company/"
}