{
    "author": "No-Fox-1400",
    "created_utc": 1625662798.0,
    "distinguished": null,
    "edited": 1625702805.0,
    "id": "ofiev4",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ofiev4",
    "num_comments": 579,
    "permalink": "/r/Superstonk/comments/ofiev4/the_man_with_the_plan/",
    "score": 7778,
    "selftext": "In my last DD I started out with pointing out why I did not think that any of the new financial institutions’ rules will have an effect on MOASS.  I went on to loosely describe what I thought was the plan from RC and how a few concepts people have talked about come into an overall plan.  Here’s the link\n\n[The Rules Don't Matter](https://www.reddit.com/r/Superstonk/comments/ocvqlp/the_rules_dont_matter/)\n\n&#x200B;\n\n**TA;DR - RC has had a plan for the outcome of this event since before he bought his first share.  It is continuing since that time to play out exactly as he has seen it.**\n\n**\\*Edit\\*** An interesting component that may fall out of the NFT crypto.  [Who gets the dividend?](https://www.reddit.com/r/Superstonk/comments/ofiev4/the_man_with_the_plan/h4ev78r/?context=3)\n\n[Do it.  Just Do it.](https://www.reddit.com/r/Superstonk/comments/ocdhkg/my_name_is_buttfarm69_and_this_is_probably_the/) \\- courtesy of u/buttfarm69\n\n# The Actual Plan\n\nI believe that I have figured out the entire plan that RC had when he started, including how he plans to launch the MOASS himself.  I believe that when the stories are told, RC actions described below will be the backbone upon which it is built.\n\n&#x200B;\n\n[The chair man himself](https://preview.redd.it/r3y3x0ifgs971.jpg?width=420&format=pjpg&auto=webp&s=4c65745434157fe7df1509c7b875df92f5fdcb74)\n\n# Prologue\n\nIt all starts somewhere.  MB noticed that GameStop was a rare opportunity.  For obvious reasons many people follow his investments for clues on what they too should investigate and possibly invest in.  The legend, DFV, does his own DD and shares it with his first Yolo posts.  Stories have been and will continue to be told of his journey.  This is not that. The chair man himself, RC sees DFV’s DD and does his own. He comes to the same conclusion.  It’s been shorted to shit.  But the government goes out of its way to protect the status quo. Overstock to the rescue. The digital dividend causes a squeeze. He sees his next great investment.  He invests in GameStop that same month.\n\n# Chapter 1 - The Big Plan\n\nRC sees the fuckery afoot with GameStop short sellers as early as May '20.  RC works out the milestones of a turnaround of GameStop. He talks with trusted network members to see if he’s on the right track.  He gets his confirmation bias.  He makes the deepest of dives, over 9% of shares of a failing death spiral company.  And it really was at the time. It was languishing on the vine. He writes the board, not begging for a seat, but for them to get off their asses and do what should have been done years ago.  Instead, he gets chairman of the board, and all of his confirmation bias buddies from above with amazing pedigrees to join in. Bingo Bango, the board is now acting on the original letter that RC wrote.  Finally, it is not languishing, now buds are starting to form. Yeah. That’s right.  I mix my metaphors all the time.\n\n# Chapter 2 - The Mechanics\n\nRC knew the company was over shorted before he bought the stock. He saw the market mechanics that we continue to see before September ‘20. His purchase of GME was not a bet, it was a calculated move.\n\n&#x200B;\n\n* April 17, 2020 - GameStop fails to deliver 2,105,715 shares.  RC is watching at this and sees the FTD's being hidden in quarterly put options for '21.\n* May  20, 2020 - Overstock starts their actual squeeze.  The dividend has been dispersed.  The stock is around $15.\n* August 12th - Overstock Stock reached a high of $103.65.  6X the value in 3 months!\n   * This is actually bigger than the Volkswagen squeeze.  It went from $200 to $1000.  5X.\n* August 13th, 2020 - According to [Fintel.io](https://fintel.io/doc/sec-gme-gamestop-rc-ventures-llc-sc-13d-2020-august-28-18502), RC bought his first shares.\n   * RC now has the knowledge to know what’s going on and the tools to dismantle it.  And he just bought the boards ear.\n   * In between these dates below, RC filed multiple SEC filings about how he was having discussions with the Board about how to govern the company.  they get more and more aggressive.  Interesting reads.\n\n# \n\n# Chapter 3 - Time For Action\n\n* October 13, 2020 - GME has 3,210,148 FTD’s.\n* October 14, 2020 - GME has 1,02,0779 FTD’s.\n   * Over 3 million FTD’s. But look, the next day, they successfully fulfilled \\*hid\\* 2.2million shares. Probably in quarterly puts. Covered, my ass. RC was watching.\n   * I've been told I may be misunderstanding the FTD's here about hiding 2.2 million shares.  If I am i will include whoever's comment is correct into this place\n\n&#x200B;\n\n* T+35 ish days later from October 13th is November 16th - RC writes the board begging them to get off their butts and do something about all of these failure to delivers that are being hidden.\n   * A lot of people thought he meant turn the f’ing company around, but it could have also meant to perform their fiduciary duty.\n* The next two are an aside because the machine keeps moving with multiple T+35 waves. Ryan is only mainly riding one of them, but he is aware of the others)\n   * November 23, 2020 - GME has 535,217 FTD’s the most for the back half of the month, maybe the front too.\n   * T+35 days later from 11/23 is December 31st - RC tweets that an ounce of prevention (solving the problem of hiding FTD’s) is better than a pound of a cure (all of the beautifully formatted government rules)\n\n# Chapter 3 - Time for Action\n\nThe fails through December are staggering.\n\n* December 3, 2020 - 12/3 was the highest of the month  at 1,787,191 FTD’s.\n* December 4th - 999,475 FTD’s.\n   * They covered 787,716 shares that day. I bet that if you look at 1/16, 4/16, 7/16, and 1/22 you’ll see 78,772 contracts bought on 12/3.\n   * Once again, I may have this wrong.  I'll post an update if a correction comes in\n\n&#x200B;\n\n* T+35 from November 13th or 14th is December 21st - RC tries to catch the hedgies himself.\n   * He upped his investment by 30% on a T+35 day.\n      * Are you fucking kidding me!  Fucking legend.  Fucking. GodDamn. Legend.  Maybe he was testing his theory or adding fuel to the fire.  Who knows. But hedgies didn’t get caught with pants down yet.\n   * Huge spike from $15.53 to $19.46. A big jump at the time.\n   * Hedgies still won that battle and continued to put money into quarterly options.\n\n&#x200B;\n\n* T+35 from December 21st +2 holiday days is …. January 27 - Did anything illegal happen that day?  I’m not sure.  lol.  j/k  This was The Sneeze.\n\n&#x200B;\n\n* T+35 is of January 27th is March 4th - RC tweets a picture of Pets.com mascot.\n   * The Dot-Com darling pet company that failed.\n      * Here's an wayback machine article with some short details, but it was misevaluation that caused the bubble and the burst.\n\n[Investopedia Pets.com article](https://web.archive.org/web/20210305133944/https://www.investopedia.com/ask/answers/08/dotcom-pets-dot-com.asp)\n\n>Behind the fall of Pets.com, the darker story of underwriting banks and their analysts loomed during the internet boom. Even as Pets.com posted losses and the stock price dropped, the issuing firm's analyst, Merrill Lynch Henry Blodget, did not change his buy rating until the summer.\n\n&#x200B;\n\n* He succeeded where they failed with Chewy.com\n   * He knows what it takes to have a successful consumer store.  Customer Service.\n* This is also the start of the second big run.\n   * This is still riding the T+35 wave that started in at least April of ‘20. This is when the left side of our cup and handle forms.  The left side of the cup fully forms by 3/12. This is important.\n\n**Cup and Handle aside**\n\n>The main measurements in a cup are the initial run up, the depth of the cup and then reaching the same peak as the initial run up. A text book cup depth is 50% of retracement of the initial run up. There are actual market mechanics behind this that you can find here.  \n>  \n>[Archive.com link to Investopedia](https://web.archive.org/web/20210330123355/https://www.investopedia.com/terms/c/cupandhandle.asp)  \n>  \n>GME had a run from $40.59 on 2/19 to $264.50. That’s a run up of $223.91 from 2/26 to 3/12.\n\n**Back to the story**\n\n* T+35 of March 4th is April 8th - RC is the new chair man of the board and a slate of new directors.\n   * All apes rejoice while we watch the heavily manipulated stock drop.\n   * Oh yeah, 1 business day before on April 5th, GameStop also announces a new round of shares being offered that have some amazing rules.\n   * We will get to that for a little bit in Chapter 4.\n\n&#x200B;\n\n* T+35 days from March 12th is … April 16 - This should be DFV day.\n   * The man not only executed instead of selling is contracts but he bought another 50,000 shares.\n   * The diamond balls.\n   * The conviction that he and RC share is truly diamond hand producing.\n      * The secret to both of their successes is that they didn’t wait for people to follow.\n   * It’s also the day the cup formed its low at $154.69.\n      * That’s a move of $110.31.  $222.91/2 is 111.95  That close enough, (within 1.5% of price) for a  50% retracement.\n* T+35 days from April 16th is May 21st - this is the day we start a run to form the right side of the cup.\n   * Once again, both sides of our cup are formed by the same FTD bomb that went off as early as September 20th.\n   * This is also the day that nft.GameStop.com launches. This is critical to the next chapter.\n\n&#x200B;\n\n* May 27th - The run ends when we get within 10% of the original top forming the right side of the cup.\n* May 28th - Seeing this cup form knowing a handle or launch is coming RC tweets RIP Dumbass. Because now the TA even shows that hedgies r fukt.\n\n&#x200B;\n\n# Chapter 4 - The Honey Pot and Launch\n\nThe boring part is now it’s a waiting game.  Notice what is completely missing from any part of this plan so far?  There is absolutely zero reliance on the government to actually step in and fix the situation. He didn’t go whine to the SEC and tell them to fix it. He waited for them to come to him.  You can tell that RC is a student of Stoicism.  It’s in all of his metered actions. RC wants to force all shorts to cover.  The only way to force all shorts to cover is with a non fungible related digital dividend. The best way to do that? Well, run up the price before the next big options date 7/16. Turn that screw.\n\n&#x200B;\n\n**Upcoming …**\n\n* July 14 - GameStop NFT launch.  We don’t know what it is or what it will be, but my sneaking suspicion is that it will either be that each person gets a wallet with an individual NFT or that we each get a wallet with a fungible digital dividend, and all of our wallets are wrapped up into a single NFT.\n* If you read my DD [The Rules Don't Matter](https://www.reddit.com/r/Superstonk/comments/ocvqlp/the_rules_dont_matter/), I go into why the digital dividend is the only way to contractually obligate all short positions to be closed, either by Shitadel Hedge fund or Shitadel MM, and all their cronies.  Notice above that RC bought into GME the same month that the Overstock squeeze happened.  If the borrowers don’t close their positions then it is the contractual obligation of the lender to buy it on the open market and charge the borrower.   This is part of the SLA that the bank gets into when it lends its stock out for shorting.\n\n**The rest is pure speculation, but come on. I’ve put all of these other puzzle pieces together.**\n\n* July 14 - it’s possible that an announcement will come on the 14th. The 14th coincides with Bastille Day. Brick by brick, right?  10 days after that, which is a requirement of the SLA discussed in The rules don’t matter, is the day that Apollo 11 landed back on earth.\n* July 16th - it’s possible that an announcement could come on this day. It’s the day to fuck the hedgies and have the price skyrocket and put all of those puts OTM and all the married calls ITM. This is also the day that Apollo 11 launched to the moon. I think it also has a poetic feeling to it. My feeling is that it will happen on the 14th.\n\nThe countdown comes to who blinks first at this point. The hedgies can blink by closing open positions and probably get margin called and forcibly liquidated over $350 for some and more for others. Or GameStop could blink and say that the DTCC is not acting per the contract of the share offering and pull the entire dividend from the DTCC. I believe that this would follow in the steps of Overstock’s digital dividend offering. The main difference is the prospectus for the 5million share offering.  GameStop must approve of any payment in lieu of dividend.  The DTCC is not allowed to screw GameStop the same way that they screwed Overstock. In that case, the DTCC said that a certain amount of cash would be equivalent, and some share holders for pid out in cash if I’m not mistaken. At least initially.\n\nThis is why I believe that the final solution will be individual nft tokens of some kind.  A fungible item is by definition interchangeable and divisible for payment in kind. While digital tokens can be non replicable and declared that it has no street value, or whatever mechanism would make it fungible, but non transferable, the fact remains that the DTCC has a precedent of declaring that digital tokens have inherent cash value for payment in lieu of a dividend. Yes there may be workarounds like having to approve any substitute payments, but RC is not risking any of this on the effort of any other person or group to do the right thing.  This plan is doable with only the effort of RC and his team.  No one else has to be involved to cause MOASS.\n\nThis link from today I feel back up the multiple wallet theory.  1 GME NFT.  Not the one and only fungible dividends or NFT's.  [Just a little confirmation bias](https://www.reddit.com/r/Superstonk/comments/of1444/just_a_little_confirmation_bias_gamestops/)  1 GME NFT that wraps up all of the wallets.  And the DTCC won't get access to the wallet until they submit a complete list of beneficial owners all accounted for.\n\nThe End Begins on July 14th.  The dividend will be announced as the first NFT on the new platform.  The short positions will be contractually obligated to close by someone, or RC takes his ball and goes wherever he wants.  This still causes MOASS.\n\n# Epilogue\n\nTo those that say it would be bad PR to start the MOASS. Bullshit. Kenny started it. RC will have just saved the fucking market by showing every company how to fuck with the fuckers fucking with them.  The only weapon previously to combat shorting stocks was to over perform, not just regularly perform. Many stores have gone under that could have come back from their positions if they hadn’t had their financials fucked with.  Fuck 'em all.  Now there’s a fucking nuke.",
    "title": "The Man With The Plan",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/ofiev4/the_man_with_the_plan/"
}