{
    "author": "Jagsfreak",
    "created_utc": 1614200090.0,
    "distinguished": null,
    "edited": 1614215698.0,
    "id": "lrn93q",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_lrn93q",
    "num_comments": 927,
    "permalink": "/r/GME/comments/lrn93q/lets_get_this_straight_now_the_squeeze_is_not/",
    "score": 7982,
    "selftext": "Not financial advice. My brain makes marbles look like waterlogged toes.  \n  \n**EDIT: Alright y'all, I'm going to do something a bit unusual here, but it's my post, so [w/e.](https://media1.tenor.com/images/d18d3b176e82a98030191cb6ebde5a81/tenor.gif?itemid=5412482)**   \n  \nAs I was going through the comments, I saw this from u/traderbabe22 and her words really resonated with me, so I wanted to leverage the popularity of my post to spread her message. \n  \n.  \n  \nWelcome to my 2 cents, from a simple trader and a mom's perspective:  \n  \nCOVID destroyed our primary income. Fortunately, we have made it this long because of my day trading since last summer. Yes. I am a relatively new trader. I didn't know shit about all this stuff last year. But man, WHAT a ride this has been. I've made some mistakes, for sure. Learned the hard way.  \n  \nBut what has happened this last month? This wasn't a matter of just making a trade on bad DD. No, we had good DD. It wasn't just my failure as an investor. Its happened to MILLIONS of traders, seasoned traders, even DFV, not just newbies like me.  \n  \nFor Paper Hands, let me put it this way. I know you can't help but think, \"What does all this matter when they can do illegal shit to screw the little investor over anyway?\"  \n  \nI will say, RH and HFs fooked with the wrong lady! NOW I'm in it to the end.  \n  \nLet me tell you why:  \n  \nLike I said, I'm just a mom, a wife and a fairly new investor. And I did pretty well, considering.  \n  \nAnd hey....I was just day trading GME for a bit, watching with fascination the talk, and riding the wave. Not in the 'movement', per se. Made $6700 in 2 days for the first time ever.  \n  \nCool. Cool.  \n  \nBut then The HALT.  \n  \nI was completely unprepared for such an unprecedented move. I don't use RH, so I could still buy n sell, but their decision had global ramifications.  \n  \nTHEN, I saw. I SAW what these reddit guys were talking about. Watched it with my own eyes. Hell! I've never been a regular reddit watcher before! But this was the only place I could find the best info. Everywhere else I looked was full of media manipulation.  \n  \nI watched the daily ladder attacks, the media frenzy, and heard the brokerage firm excuses. Then..... the crooked politicians got in on the game. I knew if they were investigating, its not to protect US. It was to protect THEM. I was just shocked. (Did I say I was new to investing?)  \n  \nSo I woke up. And I got mad. Then I bought more GME. ;)  \n  \nI am furious at the blatant and aggressive market manipulation, the collusion with big brokers, pissed at my own broker Fidelity for helping to tank the stock at critical juncture with RH.  \n  \nI'm sick at learning just how badly WallStreet is controlled by market manipulators, and most of all by HFs who short a company stock, and then set out to smear the company they targeted and absolutely destroy businesses for personal gain. Pelosi explained it well when she admitted that politicians do the same thing. Its called the \"Wrap Up Smear\". They know they are lying, manipulating the people, but they dont care. They want to WIN. They want POWER. So they lie, slander and gossip, the media reports the lie as 'fact' and then the politicians use the media to 'prove' their own lies.  \n  \n\"See there? even the news is saying it. It MUST be true.\"  \n  \nThis is what HFs do to companies they short. They short a stock, then lie about the company's 'failures' or impending doom. They manipulate, use naked shorts, selling off shares to one another, creating the appearance of mass sell offs, to support their speculation., And most importantly, they use the media to further panic investors, tanking the stock...all the while making $$ while said company goes down in flames.  \n  \nNow...I have no problem with shorting a stock, IF its done purely on speculation, good DD, and there is no manipulation to create the downfall of that company for giggles n $$. But the illegal or crooked shit is exactly what is happening, ALL the time.  \n  \nThe retail investor is awake. We now SEE and we cant UNsee what we have learned.  \n  \nAnd I am forever grateful that my eyes have been opened. I am grateful for the reddit users who have put so much into their research for all of us. I am grateful that I feel more prepared as an investor. Even though this has been monumentally painful and a huge hit for me and my family, I know what to look for. I am no longer a sheep at the mercy of the wolves, completely unaware of their presence or their tactics. I am temporarily poorer, but I am awake. And that is priceless.  \n  \nTruth is, I'm having online garage sale to help make rent and other debts this month, because even if I sold my GME now, it wouldn't pay my bills. And that $$ would be GONE forever down the bill-hole.  \n  \nI made good money for a few days. And I went aggressive at $300 right before RH fiasco. Since then, I have bought some on the way down to lower that CB. I have no more money to sink into this after it tanked.  \n  \nI now have several dozen shares at cost basis over $200.  \n  \nHell! I've held on this long, even when it tanked to $38! Clearly, I'm not panic selling.  \n  \nSO......after all that is said....What is/will be MY GOAL/PRIZE?  \n  \nWell, I see it this way. This is a once in a lifetime chance to be part of something monumental, market changing, AND to help my family get out of the age old cycle of earn $$, pay bills, earn $$ pay bills.  \n  \nAnd yes, I also want to stick it to the criminals and end this shit. Crooked HFs too big to fail? Really?  \n  \nNah. They are going to have to cover their shorts, at some point or another.  \n  \nBut hey, if the BIG squeeze doesn't happen, I'm still holding my shares. I've moved on to making $$ other ways, and not depending on the squeeze.  \n  \nWhen it happens, it happens. And it will change my family's future forever, because I held out for top $$.  \n  \nIf it doesn't, I will let my portfolio grow organically over time, because I believe GME can become the #1 Gaming destination, online and off, IN THE WORLD. Squeeze or no, GME base price is soon going to be well over $300 with Ryan Cohen n team on board.  \n  \nSo hell yeah, I'm HOLDING.  \n  \nWhat is it Mr. Wonderful always says? Your money should have little baby dollars, and they should make more baby dollars.  \n  \nI think GME squeeze could be legacy making $$. Generational $$ MAKING $$.  \n  \nI'm riding this to the moon!!  \n  \nSqueeze or no.  \n  \nDISCLAIMER: I am a MOM, not a financial advisor. Do what you want. These are only my thoughts, NOT financial advice  \n\nTL/DR: Mom pissed, lost almost all my portfolio. Barely hanging in there, but I'm STILL holding, for my family's future and damn, just on principle. I'm sick of cheaters.  \n  \n.  \n  \nApes, **This is the mentality of the apes you have alongside you.**  \n#Hold the line.",
    "title": "Let's get this straight NOW. The squeeze is NOT happening. Your read that right, it's NOT happening. ...It's STARTING. HUGE difference in messaging. People thinking it's happening right now gets them in the mindset of selling. This is only the beginning, so let's strap in and feel those G forces!",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/lrn93q/lets_get_this_straight_now_the_squeeze_is_not/"
}