{
    "author": "H3RB28",
    "created_utc": 1622258526.0,
    "distinguished": null,
    "edited": 1622315889.0,
    "id": "nneevk",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nneevk",
    "num_comments": 438,
    "permalink": "/r/Superstonk/comments/nneevk/gme_ownership_analysis_528_hedgies_r_fuq/",
    "score": 5380,
    "selftext": "Hello fellow Apes,\n\n**Obligatory Disclaimer: I am not a Financial Advisor, and this is not Financial Advice. Always do your own homework. That being said.. lets get started.**\n\n**TL,DR:** Hedies R FuQ. I used data from FTSE Russell's own Database 'Mergent Online' to calculate the current ownership numbers for GME... and my TITS ARE JACKED.\n\nI found some very interesting ownership numbers for GME today. I am using Mergent Online as my data source, which is produced by FTSE Russell.. yes the same FTSE Russell that runs the Russell 2000 Index, which GME is *currently* a part of.  I have access to Mergent through the university I am currently at while finishing my bachelors in Finance in a few months.\n\nNow before we get fully started on a simple ownership analysis.. I'm going to take us on a trip back to middle school math class and the dreaded topic of Algebra. Proportions and Cross Multiplying are a pretty simple topic and go something like this:\n\n&#x200B;\n\n[Proportions and Cross Multiplication](https://preview.redd.it/mz00tbfuwy171.jpg?width=720&format=pjpg&auto=webp&s=8b5901da8109b43c71e29b3807a9a5637e8fb716)\n\nFor making Ownership calculations we need a base to go off of. Mergent Online (once again information reported by the index that GME is a part of)  reports the ownership of GME at the following:\n\n[GME Ownership](https://preview.redd.it/6io407b6yy171.jpg?width=3634&format=pjpg&auto=webp&s=ea4aaabfb669429f115e1adb79cfdfbb65828caa)\n\nMergent Online has **GME Shares Outstanding as 69,936,000**. We need to keep in mind that this is a number reported **as of 1/30/2021**. Since then, GME has made a secondary offering of 3,500,000 shares. This gives us an **Issuer-Stated Total Shares Outstanding of 73,436,000 or 73.436 Million shares.**\n\nNow that we know how many shares there are ***supposed*** to be, lets check out the Insider Ownership.\n\n&#x200B;\n\n[GME Insider Ownership](https://preview.redd.it/9haw4oug0z171.jpg?width=3622&format=pjpg&auto=webp&s=14a97865a44e6a912bf5246a906f1219fde92345)\n\nWe can see that the Insider Ownership is broken into two distinct categories: **Direct and Indirect Ownership**. Direct Ownership is when the shares are listed *directly* in your name, and not say.. in shelter company like **RC Ventures**. We will do two different calculations in order to display the situation correctly.\n\nMergent lists the Direct Ownership at 8,057,864 shares totaling 11.52% ownership pie (we all like pies). This leaves 88.48% left over.. ***but  how many shares is that wrinkly brained ape?*** Lets put our trusty friend **Algebra** to the test.\n\n(11.52/8,057,864) = (88.46/X)\n\n11.52X=712,798,649.44   .. now to find X we divide each side by 11.52.\n\nX=61,874,882.76\n\nNow to check our math we add the 88.46% to the 11.52% to get a total ownership number.\n\n**Previously stated ownership: 69,936,000**\n\n8,057,864 + 61,874,882.76=  **69,932,746.76**\n\nTo me.. being around 4,000 shares within the \"Stated Shares Outstanding\" checks out enough to me. To calculate the Free Float I added in the extra 3.5 million shares that were a part of the secondary offering **(total shares outstanding 73,436,000)**\n\nThis would put GME at a **Free Float of 65,378,136 shares.**\n\n**BUT APE NO INCLUDE TENDIE MASTER!!** I know, we are getting there.\n\n\\***RC Ventures WAS NOT listed on the \"Direct Ownership\" list. The Indirect Ownership is stated at 15,760,670 shares.**\n\nAdding the two 'Insider Ownerships' together gives us the following:\n\n8,057,864 + 15,760,670 = **23,818,534 for insider ownership**\n\nThis new number would give us a **Free Float of 49,617,466 or 49 Million shares.**\n\n*Up until this point this is all stuff that we have basically already known.. its about to get a little more spicy.* Next we will cover the **Institutional Ownership** side. Now the Institutional numbers have always been wacky for GME, but I believe these next calculations provide insight into **just how big of a hole hedgies have dug themselves.**\n\n**GME Institutional Ownership- As Stated by Mergent FTSE Russell:**\n\n&#x200B;\n\n[Hedgies R FuQ](https://preview.redd.it/z3kg7s9q5z171.jpg?width=3647&format=pjpg&auto=webp&s=dcd3b4b6e56200b41888ca0102fd80528de62b8e)\n\n**Two things IMMEDIATELY stand out to me: #1 Institutions own 56,158,356 shares.... AT 28.87% ownership.. WHAT?!?** This statistic is what is ***REPORTED*** to the index, these numbers definitely could be fudged.. but most likely to the downside and not the upside.\n\n***So smart Ape.. if Institutions own 28.87% of GME with 56M shares.. how many shares does everyone else (aka Insiders and Retail) own at 71.13%?*** Once again, our friend Algebra comes into play.\n\n(28.87/56,158,356) = (71.13/X)\n\n28.87X = 3,994,543,862.28   (now we divide each side by 28.87)\n\n**X= 138,363,140.36    or 138.36M shares.. GO APES!**\n\nIf we then subtract out the higher Insider Ownership number (Direct + Indirect) this gives us a ***Retail Control*** **of 114,544,606.36 shares or 114 MILLION SHARES.**\n\n***What the Fuq did hedgies get themselves into?!?***\n\nNow according to the \"Institutional Ownership\" numbers I wanted to see around about how many **Naked Shorts** the firms had rehypothecated. To get the Total Shares Outstanding we would then add Institutional Ownership with Retail and Insider Ownership stats:\n\n56,158,356 + 138,363,140 = **194,521,496 shares.. 194 million fuqing shares.**\n\nSo with the institutional numbers and the Issuer stated numbers I came to the conclusion that:\n\n194,521,496 - 73,436,000 = **121,085,496 or 121 MILLION SHARES NAKED**\n\n**What did Kenny get himself into.. well covering 121 MILLION shares he can't get his hands on because 114 MILLION are in the hands of Apes.**\n\n***Please keep in mind these are the reported numbers.. they could truly be MUCH higher.***\n\nI am always open to criticisms and questions/discussion.\n\n**Be Excellent and Rock on Fellow Apes.**\n\n\\- H3RB\n\nEdit: Here is the  screen shot from above with the dates highlighted for the base calculations:\n\n&#x200B;\n\nhttps://preview.redd.it/tr50evybjz171.jpg?width=3354&format=pjpg&auto=webp&s=8e1f8f284ff23268916cabf08369388a8b1947bd\n\nEdit 2: Full Screen Shots of Institutional Ownership Stats:\n\n&#x200B;\n\n[Institutional Ownership 1](https://preview.redd.it/nwicrfepoz171.png?width=3693&format=png&auto=webp&s=473fcf5d17515aa04e6c6cc8150696426c04bba5)\n\n&#x200B;\n\n[Institutional Ownership 2](https://preview.redd.it/dia9iacsoz171.png?width=3644&format=png&auto=webp&s=364688f6593f56bf6726ec2a440c2cc0b41877f5)\n\nEdit 3: Direct vs. Indirect Insider Ownership **RC Listed as Indirect**\n\n&#x200B;\n\n[RC Listed as Indirect](https://preview.redd.it/oz019rwsxz171.jpg?width=3668&format=pjpg&auto=webp&s=861b89415e9b82028514b010ad6e0be7189705e1)\n\nEDIT 4 (5/29 afternoon): I am doing a more comprehensive review of ownership comparing the numbers reported by Mergent and FTSE Russell to those of: GameStop Proxy, Yahoo Finance Premium, FinteliO, Whale Wisdom, Koyfin, Fidelity Research, Nasdaq, CNNMoney, and MarketBeat (I think I named them all.. may be more I'll update as needed). I am trying to match numbers to see if I can find any discrepancies in data reported.  \n\nI have also contacted Mergent & FTSE Russell to try and see if I can get any information on *how* they source their information. On their website it states they have a **dedicated data team that updates the data live daily from multiple market sources**. I am not sure how true this is, but in the data columns it did say \"as of 5/28/21\". I will updated on any information about data sources that I receive. ",
    "title": "GME Ownership Analysis 5/28- Hedgies R FuQ",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nneevk/gme_ownership_analysis_528_hedgies_r_fuq/"
}