{
    "author": "browzen",
    "created_utc": 1621616969.0,
    "distinguished": null,
    "edited": 1621617121.0,
    "id": "nhxlfs",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_nhxlfs",
    "num_comments": 863,
    "permalink": "/r/Superstonk/comments/nhxlfs/lets_be_honest_with_ourselves_so_we_dont_fuck/",
    "score": 6371,
    "selftext": "*GME hits $1000 in a day*\n\n\"OH SHIT MOASS TIME??? Fuck yeah!!!! I am so ready to be rich\"\n\n\n*GME hits $10,000*\n\n\"Hoooooollyy fuck, with my shares that is my years worth salary!!!! I could take that right now and be on vacation!!... No, no, I can't do that I need to hold for my fellow apes....To the Moon baby!!!\"\n\n\n*GME hits $100,000*\n\n\"😨😍😍😍😍🤤🤤🤤🤤🤤‼️‼️‼️🍆💦‼️‼️💎🙌🏼🚀🚀🚀🚀🌕😨😍😍😍😍🤤🤤🤤🤤🤤‼️‼️‼️🍆💦‼️‼️💎🙌🏼🚀🚀🚀🚀🌕\"\n\n\n*GME drops to $70,000*\n\n\"Oh fuck, oh fuck, it's going down ... wait, the apes told me this would happen! Hold strong!\"\n\n\n*GME drops again to $50,000*\n\n\"Uhhh this is getting low, when moon??? Is this thing really going to 10mil?\"\n\n\n*GME goes up to $150,000*\n\n\"YESSS LETS GO BABY MOON SOOOON\"\n\n\n*GME drops to $125,000*\n\n\"Uhh...\"\n\n\n*GME jumps up to $200,000*\n\n\"MOOOOOMMMM GET THE CAMERA AAAAAAAAAAHHHHHHHHH\"\n\n\n*GME drops to $110,000*\n\n\"...\"\n\n\n*GME jumps to $190,000*\n\n*panicking now* \"Shit shit shit is this really happening, I don't know, fuck what do I do, is it going to go down again, I don't know, Shit reddit is down, what do I do!!!\"\n\n\n*GME drops to $150,000*\n\n\"😰😰😰😰😰😰😰😰\"\n\n\n*GME jumps to $250,000*\n\nNow you are sweating and you haven't ate right in days. Your stomach hurts and your dizzy from the stress.\n\n\"... Fuck... fuck, what do I do... It's going to drop again, it has to. Will this really moon??? Do I really believe in the MOASS? Shit, I don't know... Maybe I should sell some shares now so when it drops I can buy more... No, I can't, my fellow apes need me!\"\n\n\n*GME drops to $175,000*\n\n\"Fuck this I'm selling, I'm not losing this chance for years salary there is no way it can go up to 10mil\"\n\n\n*GME skyrockets to $500,000*\n\n\"Fuck\"\n\n\n*$1,000,000*\n\n\"FUCK\"\n\n\n*$10,000,000*\n\n\"FFFFFFFFFFFFFFFFUUUUUUUUUUUUCCCCCCCCKKKKKKKKKKKKKK!!!!!!!!!!!!!\"\n\n\n\nNo tendies for you.\n\n\n\n**TL'DR** : Trust the DD. But also remember that you are a retarded Earth ape that is largely moved by emotions rather then logic. You will feel ALL SORTS of feelings when the rocket is taking off. Do not be fooled by dips. Do not be fooled by your own mind. Do not be fooled by the absolute avalanche of FUD that will hit us right as the MOASS begins. Always remember no matter what, when it gets as high as any of these numbers... we win.",
    "title": "Let's be honest with ourselves so we don't fuck this up. This is how 90% of us will react to the MOASS. An exercise:",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nhxlfs/lets_be_honest_with_ourselves_so_we_dont_fuck/"
}