{
    "author": "Laffingglassop",
    "created_utc": 1621090492.0,
    "distinguished": null,
    "edited": 1621109342.0,
    "id": "nd0nxf",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_nd0nxf",
    "num_comments": 575,
    "permalink": "/r/Superstonk/comments/nd0nxf/marc_cohodes_is_a_boomer_who_doesnt_understand/",
    "score": 5693,
    "selftext": "Seriously you are going to have a very hard time convincing a non gamer boomer , any of them, about gamestop and its future, they will invest based on earnings, not speculation that we are doing(smartly because most of us are gamers and know...). Ive crawled through his posts and its clear as day he thinks A. Theres no criminal activity on citadels part regarding gme. B. Gamestop is over valued C. The squeeze has sqouze. D. NAKED SHORT SELLING DOESNT HAPPEN BECAUSE ITS ILLEGAL\n........\n *HITS BONG IN INDIANA*\n....\n\n\nAll of that is BULLSHIT so why are so many accounts begging for this chicken farmers opinion just because he called out fraud that he profited from calling out in the past.  Man made a post in january saying he has all the evidience to blow up citadel and then just does nothing with itt?\nTells us our DD is missing something huge but doesnt say what so youll give him ama time to find out what \"it\" is which is likely something in a DD he just hadnt taken time to read yet.  Dr t and lucy and carl make this man look like a joke. \n\nThe dude has nothing to offer and wants his twitter to break 6 figure followers. The end\n\nIf he was really on our side hed be using the info he claims to have to help us, whether we give him a platform or not. Hes not doing that.\n\n\nIf i had info that would blow up citadel, or a missing chunk of your DD. Id get that shit out there and would not demand an AMA platform to \"unlock the secrets\".\n\nMarc, call the SEC. Not superstonks.\nWe dont need new info. Buy hold vote settles everything.\n\nPs his big reveal is going to be he thinks longs are manipulating the price up, to trap shorts. Not shorts pushing it down. This is a published opinion of his.\n Cuz hes a short, so has issues with longs more often than longs do. Its just his perspective and does nothing for us.",
    "title": "Marc cohodes is a boomer who doesnt understand gaming and just wants to tell you all that the squeeze is already sqouze",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nd0nxf/marc_cohodes_is_a_boomer_who_doesnt_understand/"
}