{
    "author": "theslipguy",
    "created_utc": 1621085069.0,
    "distinguished": null,
    "edited": 1621112478.0,
    "id": "ncyti5",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_ncyti5",
    "num_comments": 254,
    "permalink": "/r/Superstonk/comments/ncyti5/spoilers_the_big_short_to_gamestop_comparison_we/",
    "score": 2499,
    "selftext": "*SPOILER* The Big Short vs GME comparison (SKIP IF YOU DONT WANT TO SEE SPOILERS)\n\n1. Michael Burry is running some numbers, finds anomalies, and realizes that people will default on their mortgages creating a huge housing collapse. *DeepFuckingValue is browsing stocks and finds GME is way over shorted and that the stock is far undervalued and the shorts would need to cover.* \n\n2. Michael Burry puts his money where his mouth is and puts a 1.3B dollars bet based on his gut instinct and belief and buys Credit Swaps. He suffers ridicule and doubt from his colleagues and peers for a very long time. *DeepFuckingValue puts a $50,000 bet on his research and gets ridiculed beyond belief on WSB for his monthly updates for hodling GME for over a year* \n\n3. Other people begin to realize the housing market might be propped up on a bunch of bullshit loans that will never be paid back and come to the same realization as Michael Burry. *A bunch of apes start to dig and realize DFV was onto something.*\n\n4. Investors hire a realtor to drive around housing neighborhoods and find that there are neighborhoods completely vacant, or visit low paid workers who have 5 loans for 5 houses who cannot pay their mortgages but received loans. *Apes search the web and continue to find that the available GME shares to buy on the float are naked shorted at 140% and this is a scenario that shorts will HAVE to buy back the float.*\n\n5. Other investors buy credit swaps to short the housing market based on their research. *Apes pour in and buy shares of GME based on their research.*\n\n6. People begin defaulting on their loans as expected creating a huge issue for the banks. *GME begins to increase share value because of mass apes buying and the shorts can’t cover as it becomes expensive.*\n\n7. The banks tell the public and the investors that people are defaulting, but the mortgage backed securities are still rated at AA so they are still good. *The media tells investors and the public that Melvin Capital is doing impressively well even though they received a $2B dollar bailout from Citadel.*\n\n8. The banks push the narrative that the mortgage backed securities are rated AA even though the underlying securities are beyond fucked, and they push hard buy back the credit swaps from the owners of the credit swaps. *Media continues pushes the narrative that GME is dead in the water even though GameStop continually has positive news (no debt, lots of cash, decent revenue, expanding. New management), and retail needs to exit to save their money.*\n\n9. Michael Burry tries to call the banks to get his money because it is public news that the defaults have happened. They don’t answer his phone calls. They make excuses that the servers went down and their networks were down. *We’ve seen the buy button go grey, Reddit go down, brokers like RH make securities not tradeable due to server issues,  and some brokers like Schwab who said their servers couldn’t handle the traffic on Jan 27th (complete BS).*\n\n10. The banks collapse. They can’t keep it together and pay out all of the investors who bought credit swaps. *THIS IS WHERE WE ARE. THEY CANT HOLD FOREVER, WE JUST NEED TO BE PATIENT AND HODL OUR PRECIOUS SHARES. REMEMBER THE DD.*\n\nEdit: from u/ismybostonadogorapig \nI want to add to your point 9, that on 5/5 the Consolidated Tape Association (CTA) had issues and had to reset the tape, and that on and around those days 30-50% of volume was adjusted after hours. SUS\n\n11. The banks get bailed out, and only one person goes to jail. *This will be the same.*\n\nWe are at the end game fellow Apes. We will prevail if we trust the DD and hodl our shares. SHORTS MUST COVER. The credit swaps were a bet with 10:1 odds so their payouts in the 2008 housing crash were set. Our payout is determined by our diamond hands and what our average sell price will be. \n\nHodl your shares as this can’t go tits up. They’ve been fighting us, creating FUD, and trying to get us to sell our shares back to them at a cheap price. THEY WILL TRY IT AGAIN SOON. Expect a run up to $1,000 or $5,000. Expect a massive drop. Expect them to create fear. This is what they do. Hodl your shit. They are going to do anything to get our shares for cheap. \n\nPrint out everything. Print your current shares and positions. Keep track of it during the squeeze and document all you can. \n\nAs our beloved Marvel characters said in Avengers, “we are in the end game now.”\n\nEdit: remember, the credit swaps were fixed payouts of 10:1. There is no fixed payout here for GME. There is no limit to what the payout is. It is truly going to be determined by us who hodl these. Hodl for 10,000%+, 100,000%+, 1,000,000%+",
    "title": "*Spoilers* The Big Short to GameStop Comparison. We are in the end game now, don’t give up. Just keep hodling, you beautiful and magnificent apes.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/ncyti5/spoilers_the_big_short_to_gamestop_comparison_we/"
}