{
    "author": "spaceyacht1",
    "created_utc": 1623995710.0,
    "distinguished": null,
    "edited": 1623996457.0,
    "id": "o2i0al",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_o2i0al",
    "num_comments": 85,
    "permalink": "/r/Superstonk/comments/o2i0al/fuck_cnbc_it_was_all_a_fud_psyop/",
    "score": 1040,
    "selftext": "I just spent the last hour or so watching all of the CNBC interviews from today on YouTube. \n\nu/dlauer awesome job. Trey and Matt, awesome job. \n\nUnfortunately, they brought you all on to make it look like Melissa Lee is your unbiased, totally neutral friend who just interviews everyone involved including retail, and occasionally even stands up for them. \n\nThe entire thing was to make viewers feel that CNBC and Melissa are giving meme stocks a fair chance. Like they're on the side of the retail investor. Like they and their hedge fund overlords might be finally turning and shining a spotlight on the corruption we've all discovered to be true. \n\nhttps://youtu.be/QHrqEItwZWQ\n\nWatch that. This is a former SEC lawyer who's on CNBC virtually every night, Jacob Frenkel. \n\nMelissa: \"What group do you think is number one on the SEC list to investigate?\"\n\nJacob:\"The momentum traders on Reddit\"\n\nWatch the videos with Trey and Matt. Watch the video with u/dlauer. What do they talk about immediately afterwards?\n\nhttps://youtu.be/KjVM3pidH_A\n\nhttps://youtu.be/Z8be2-z-CNM\n\nFirst of all, the interviewees - u/dlauer, Trey, and Matt - are clearly handcuffed in what they're allowed to say due to threat of lawsuits or worse from evil actors. Dave Lauer almost even says as much when pressed. \"Oh no no no, that's too dangerous for me to answer\".\n\nNot one of them mentions naked shorting, all of them mention dark pools and lack of market transparency in as strong a way as they legally can, but they're obviously incredibly careful and restrained. \n\nTheir forced restraint for fear of lawsuits (or, you know, much fucking worse) is honestly reminiscent of al-Qaeda hostage videos. \n\nThe douchebags CNBC has on immediately afterwards hardly even address anything said by the guests, even when Melissa asks them directly. \n\nYou get a retail investment advocate to give an interview while totally castrated in what they may say, then you have every commenter say something along the lines of \"yeah I see where they're coming from, but honestly institutions are not trying to stick it to retail\" after literally no one tried to make that point. \n\nIn other words:\n\n\"Hey shit is fucked and we're buying the stock, but I can't legally talk about it\"\n\n\"Wow those guys were so adorable but they're so grumpy wumpy thinking the man is out to get them. Back in my day, we used to have even less transparency, we used to have to read things in the newspaper. Be grateful you're even allowed in the room, children\". \n\nThis entire hour with Melissa Lee on meme stocks was 100% pure unadulterated slightly filtered:\n\n#FUD\n\nPlain and simple. \n\nIt was all designed to make you like them, change some of your minds and calm your tits, but most of all send a message to their boomer audience that you're all cute but wrong and ungrateful.",
    "title": "FUCK CNBC - IT WAS ALL A FUD PSYOP",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2i0al/fuck_cnbc_it_was_all_a_fud_psyop/"
}