{
    "author": "AutoModerator",
    "created_utc": 1620017471.0,
    "distinguished": null,
    "edited": false,
    "id": "n3o6ng",
    "text_only": true,
    "flair_id": "02d4a642-a071-11eb-bf5d-0e4876509fbb",
    "flair_text": "AMA 🏆",
    "name": "t3_n3o6ng",
    "num_comments": 350,
    "permalink": "/r/Superstonk/comments/n3o6ng/official_ama_dave_lauer_may_5_2021_300_pm_edt/",
    "score": 6041,
    "selftext": " This is the official AMA (Ask Me Anything) post for **Dave Lauer**, who will be joining [u/jsmar18](https://www.reddit.com/u/jsmar18/) on [Superstonk Live](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA) for a one-on-one discussion, with questions influenced by and taken directly from this post.\n\n**Please make comments on this post directly, as we will be referencing this exclusively.**\n\n\\---\n\n# Please visit the [Superstonk Youtube Channel](https://www.youtube.com/channel/UCI4EET9NJPWxUuXGlG6fxPA) and subscribe and enable notifications so that you are prepared for the [live stream on May 5, 2021 @ 3:00 p.m. EDT](https://youtu.be/AYct0XX0uTU)\n\n# A message from our guest:\n\n[Dave Lauer](https://preview.redd.it/z8415vsi5uw61.jpg?width=400&format=pjpg&auto=webp&s=6c1669e7672616894f31616fb66703ef264820f8)\n\n>Hi, I'm Dave Lauer. I built low latency trading systems, and then worked as a high-frequency trader at Citadel and then Allston Trading. I left about a year after the Flash Crash (2011), disturbed at the impact of HFT on markets. I have since testified before the US Senate, worked with the SEC and CFTC, helped institutional investors understand market structure, represented them in DC, and quantitatively analyzed their brokers' order routing algorithms. I worked with IEX early on, and sit on the board of Aequitas NEO in Canada. I also sit on FINRA's Market Regulation Committee. The last 2 years I've focused on novel applications of AI, both in finance and beyond, and am also on the founding editorial board of the Journal of AI and Ethics.  \nI'm talking to the mods about doing an AMA and am looking forward to it! I've seen some questions about the effects that limit orders might have on stock price and stock loan mechanics, so I posted some thoughts here: [https://reddit.com/r/Superstonk/comments/mzpyfq/do\\_gme\\_limit\\_orders\\_impact\\_the\\_stock\\_price\\_not/](https://reddit.com/r/Superstonk/comments/mzpyfq/do_gme_limit_orders_impact_the_stock_price_not/)  \nTLDR; there's little to no impact on the stock price from limits orders that are far from the NBBO. I'm not sure about the stock loan question, but I doubt it matters.\n\nNote that Mr. Lauer will obviously not be able to answer any sensitive questions directly concerning any of his previous employers or their practices and strategies.\n\n\\---\n\n**This AMA Post will remain active until the live stream begins, at which point this post will be LOCKED.** Please note that our AMA guests have limited time, and cannot possibly answer all questions, so we encourage you to put some effort into your questions so that they can be upvoted by your fellow apes for visibility.\n\n\\---\n\n**YOUTUBE INFO**\n\nPlease note... **This channel is not monetized, nor will it ever be** (screenshot this and hold us accountable), and is strictly for education and discussion as it relates to [r/Superstonk](https://www.reddit.com/r/Superstonk/) topics and the interests of the community. The idea was approved by the mod team, and the channel was created and is administered by [u/redchessqueen99](https://www.reddit.com/u/redchessqueen99/). The stream itself will be handled through a third party service with many live-editing features (omitted for security's sake) that allows a stream through Youtube.\n\nFinally, we made the choice to create this platform because AMA guests seem to prefer the live stream method, since they don't always have a reliable platform to stream from. This allows us to offer them a choice of platform, and also a means of discussion with our members LIVE, that ultimately will cater to the interests of [r/Superstonk](https://www.reddit.com/r/Superstonk/) and this community of diamond handed apes.",
    "title": "OFFICIAL AMA - Dave Lauer - May 5, 2021 @ 3:00 p.m. EDT",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n3o6ng/official_ama_dave_lauer_may_5_2021_300_pm_edt/"
}