{
    "author": "jsmar18",
    "created_utc": 1621138694.0,
    "distinguished": null,
    "edited": 1621173673.0,
    "id": "ndg93z",
    "text_only": true,
    "flair_id": "ab9d5506-95d3-11eb-ac2a-0e4e06bdb513",
    "flair_text": "🚀 Moderator 🚀",
    "name": "t3_ndg93z",
    "num_comments": 439,
    "permalink": "/r/Superstonk/comments/ndg93z/dispelling_denouncing_wardens_fud_market_limit/",
    "score": 5554,
    "selftext": "Well, that happened quickly.\n\nI personally denounce u/WardenElite for his behavior. You don't call this epic community \"idiots\", you don't try and make money off of us, and you don't write half-assed posts that are clearly FUD when you're in a respected position.\n\nLet’s clarify the largest thing that many picked up and noted in his most recent post.\n\n# Stop Order\n\nDon’t use them, it’s as simple as that. I have no idea what mindset he was in when he was typing that up, but it’s very much talking like a day trader re the use of stop losses. Guess what we don’t do? Day trade, we buy and HODL.\n\nThe mere fact of mentioning using stop orders will exacerbate the issue he is talking about in regards to stop loss hunting. The best way to avoid the situation he describes? Don’t use a stop loss.\n\n# Limit Order\n\nThe largest negative about limit orders, add liquidity orders among others is execution risk. He mentions this and it’s not wrong.\n\nI think it’s wise that everyone knows the risk of using a limit order, but not so you don’t use it. Understanding the risk helps us know how to use it but be aware of how to better set the price of a limit order in certain market conditions.\n\n**Example**: Oh shit it’s moving fast (in either direction), i’ll make sure to set the limit so it’s further away from the spread instead of right next to it which is where the execution risk is the highest.\n\n# Market Order\n\nI’m pretty sure I was the first to ask apes to use different order types than just ye old Market Order, so i’ll say that if the market conditions are truly moving too fast as warden pointed out in his post (and really badly FUD like at that….) you could get burned using a limit.\n\n# Conclusion\n\nSo use them wrinkles, limit orders are the best option, if the market conditions are really that bad, use your judgment as it might be better to use a market order. But with your new knowledge on the execution risk of limit sells, you should be fine in my eyes.\n\nDon’t use stop orders.\n\nNot financial advice.\n\n**Edit:** Just want to say not to continue attacking him. It's all done and dealt with, so let's move on from the drama. He's young, he fucked up, he has now received a life lesson that he hopefully evolve from.\n\n**Edit:** Been seeing questions pop up re broker limitations, e.g. eTorro. When I get back home I'll add in an update regarding my thoughts on that.\n\n# Round Two\n\nBack home (and just finished handmaid's tale season 3 - recommend), sorry for the wait. There have been two themes, the first being broker limitations on order types and the second being Stop-Limit orders.\n\n# Stop-Limit Orders\n\nSimilar in name to a stop-loss order, but they are different. The main being that stop-loss guarantees execution (trade-off of price slippage, resulting in orders being filled below strike price).\n\nBetter to explain stop-limit through an example:\n\n><Random Ticker> is at $190, you wanna buy, you place a stop-limit order to buy with a **stop price** of $200 and a **limit price** of $210. If the price goes above the **stop price**, the order is activated and it's now a limit order. If <Random Ticker> gaps up, above the **limit price**, the order will not be filled.\n\nFlip it around for the sell-side logic. Execution risk again being the main thing to understand. But understanding the risks and how to use various orders is all about adding tools to your arsenal. Know when to use what and in which situation.\n\nAlso, develop that wrinkle further with some [more reading](https://www.investopedia.com/terms/s/stop-limitorder.asp). \n\n# Brokers\n\neTorro is widely being asked regarding their order types, I don't use eTorro so I'm uncomfortable commenting on them directly. But I'll give you some non-financial advice that is generalizable to **every single broker.**\n\nIdentify what order types are available to you, google their definition and understand how each functions. If you feel restricted, sure move brokers (**obviously risky**, given the squeeze feels closer than ever) to a broker that offers more order types. Else you're stuck with what you've got, learn your options, understand them and make/amend an exit plan that includes your newfound knowledge.",
    "title": "Dispelling & Denouncing Wardens Fud | Market, Limit, Stop Orders",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/ndg93z/dispelling_denouncing_wardens_fud_market_limit/"
}