{
    "author": "Parsnip",
    "created_utc": 1626933300.0,
    "distinguished": null,
    "edited": 1626940802.0,
    "id": "op7ugv",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_op7ugv",
    "num_comments": 233,
    "permalink": "/r/Superstonk/comments/op7ugv/diamantenhände_german_market_is_open/",
    "score": 3318,
    "selftext": "Guten Morgen to all of you Great Apes acroth the world! 👋🦍\n\nFirst of all, I'd like to thank you all for thicking with the thread yesterday despite the ithues that Reddit was having. I hope things go a little thmoother in today's thread, but if not I'm glad to be tharing the challenges with you delightful bunch of apes.\n\nWednesday was another great day to HODL GME. Despite a great start in the German markets, a combination of continued short-selling and low volume kept the price moving sideways. Apes proudly competed in games of \"show me your largest cost-basis\", which will of course become \"cost-basis for ants\" once the MOASS starts and the FOMO crowd buys in on the way up. u/atobitt was back with some [excellent new investigation](https://www.reddit.com/r/Superstonk/comments/ooptc3/i_aint_hear_no_bell/) of some FINRA data. It's clear at this point that we're in a waiting game, and while it's not always easy to HODL, it sure is a lot easier than the circus of tricks that the short hedge-funds have to perform daily to put off their ultimate demise. Diamantenhände will be here when that day comes.\n\nToday is the penultimate trading day this week, Thursday, July 22nd and you know what that means! Join apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- ⬜ 120 minutes in: **$182.68 / 154,93 €**  *(volume: 941)*\r\n- 🟩 115 minutes in: $182.68 / 154,93 €  *(volume: 924)*\r\n- ⬜ 110 minutes in: $181.50 / 153,93 €  *(volume: 869)*\r\n- ⬜ 105 minutes in: $181.50 / 153,93 €  *(volume: 866)*\r\n- ⬜ 100 minutes in: $181.50 / 153,93 €  *(volume: 856)*\r\n- 🟥 95 minutes in: $181.50 / 153,93 €  *(volume: 855)*\r\n- 🟩 90 minutes in: $181.52 / 153,94 €  *(volume: 855)*\r\n- 🟥 85 minutes in: $180.37 / 152,96 €  *(volume: 804)*\r\n- ⬜ 80 minutes in: $184.65 / 156,60 €  *(volume: 421)*\r\n- ⬜ 75 minutes in: $184.65 / 156,60 €  *(volume: 368)*\r\n- 🟥 70 minutes in: $184.65 / 156,60 €  *(volume: 239)*\r\n- 🟥 65 minutes in: $184.83 / 156,75 €  *(volume: 239)*\r\n- ⬜ 60 minutes in: $184.88 / 156,79 €  *(volume: 224)*\r\n- 🟥 55 minutes in: $184.88 / 156,79 €  *(volume: 224)*\r\n- 🟩 50 minutes in: $184.92 / 156,82 €  *(volume: 224)*\r\n- ⬜ 45 minutes in: $184.89 / 156,80 €  *(volume: 224)*\r\n- ⬜ 40 minutes in: $184.89 / 156,80 €  *(volume: 224)*\r\n- 🟩 35 minutes in: $184.89 / 156,80 €  *(volume: 222)*\r\n- ⬜ 30 minutes in: $184.83 / 156,75 €  *(volume: 222)*\r\n- 🟥 25 minutes in: $184.83 / 156,75 €  *(volume: 220)*\r\n- 🟥 20 minutes in: $184.92 / 156,82 €  *(volume: 210)*\r\n- 🟥 15 minutes in: $184.95 / 156,85 €  *(volume: 210)*\r\n- 🟩 10 minutes in: $184.99 / 156,89 €  *(volume: 210)*\r\n- 🟩 5 minutes in: $184.98 / 156,88 €  *(volume: 210)*\r\n- 🟥 0 minutes in: $184.92 / 156,82 €  *(volume: 0)*\r\n- 🟥 US close price: $185.81 / 157,58 €   *($185.81 / 157,58 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.17914934. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler, following their sudden disappearance after Memorial Day. I also am worried, as I had tried to make contact many times and never received a direct response. Three weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the curator of the series. I've been serving as host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/op7ugv/diamantenhände_german_market_is_open/"
}