{
    "author": "bosh023",
    "created_utc": 1626999010.0,
    "distinguished": null,
    "edited": 1627001838.0,
    "id": "opqi01",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_opqi01",
    "num_comments": 50,
    "permalink": "/r/Superstonk/comments/opqi01/dtcc_guidance_issued_unscheduled_closing_of_any/",
    "score": 546,
    "selftext": "Hmmmmm can't imagine what unscheduled event DTCC and participants may need to plan for!  Spotted this, although from June not seen it posted previous and effective immediately.\n\nPart extract from introduction below, - see link for full document on DTCC site\n\n[https://www.dtcc.com/-/media/Files/Downloads/issues/Unscheduled\\_Close.pdf](https://www.dtcc.com/-/media/Files/Downloads/issues/Unscheduled_Close.pdf)\n\nDTCC (on behalf of DTC, FICC & NSCC, the “Clearing Agencies”) has prepared the following guidelines to address processing issues that may arise due to an unscheduled closing of any exchanges, banks and/or markets (“unscheduled closing”) supported by the Clearing Agencies’ products and services. In the event that an unscheduled closing does occur, DTCC and the Clearing Agencies would work closely with the appropriate regulatory bodies, industry groups and the Clearing Agencies’ members/participants to employ the steps necessary, taking into account the market conditions and circumstances presented at the time, in order to minimize disruption to the markets. In the case of an unscheduled closing, which could occur, for example, on a national day of mourning (i.e., the death of a former President), or during an event causing significant regional impact, such as natural disaster or other similar circumstances, each Clearing Agency will continue to process data for clearance and settlement purposes by accepting transactions from any open exchanges, markets, or members/participants, as applicable, as well as the aging and staging of transactions that have already been submitted and accepted by the respective Clearing Agency for the next steps in the settlement cycle.\n\nDuring an unscheduled closing, DTCC and the Clearing Agencies would seek to minimize disruptions to the securities industry by continuing a “business as usual” processing routine and conforming as closely as practical to normal operations. Although numerous scenarios could occur in the event of an unscheduled closing, DTCC and the Clearing Agencies intend to adhere to as consistent of a plan as possible, depending on the facts and circumstances presented at that time that is readily adaptable by the industry. DTCC is issuing these guidelines to advise members/participants of the Clearing Agencies’ plan to follow in the event of an unscheduled closing, and to encourage clients to assess the impact of these procedures on their own processes in such an event. Accordingly, DTCC strongly recommends that members/participants examine their internal processing and dependencies and, where feasible, take these guidelines into account in preparation of their own procedures relating to the processing of transactions and related activity. Questions or comments regarding the topics in this paper may be directed to your Relationship Manager",
    "title": "DTCC Guidance Issued - Unscheduled closing of any exchanges, banks and/or markets",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/opqi01/dtcc_guidance_issued_unscheduled_closing_of_any/"
}