{
    "author": "KFC_just",
    "created_utc": 1620097658.0,
    "distinguished": null,
    "edited": false,
    "id": "n4em75",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_n4em75",
    "num_comments": 49,
    "permalink": "/r/Superstonk/comments/n4em75/bank_of_america_credit_suisse_and_credit_agricole/",
    "score": 817,
    "selftext": "# [Bank of America, Credit Suisse and Credit Agricole fined €28 million for role in bond trading cartel](https://www.thetradenews.com/bank-of-america-credit-suisse-and-credit-agricole-fined-e28-million-for-role-in-bond-trading-cartel/)\n\n*April 28, 2021 1:00 PM GMT  By Annabel Smith*\n\n>**Deutsche Bank blew the whistle on the cartel and so was not fined alongside Bank of America, Credit Agricole and Credit Suisse despite having traders active in the scheme.**  \n  \n>  \n>Bank of America Merrill Lynch, Credit Agricole and Credit Suisse have been fined a total of €28 million in Europe after colluding on bond trading activity as a cartel.  \n>  \n>The European Commission fined the three banks after traders in their US dollar supra-sovereign, sovereign and agency (SSA) bonds divisions participated in the cartel in the European secondary market.  \n>  \n>The traders exchanged sensitive information, coordinated on prices and aligned their trading strategies via chatrooms and Bloomberg Terminals for five years. The manipulative activity affected secondary market trading in US dollar SSA bonds for the entire European Economic Area, the Commission said.   \n>  \n>Deutsche Bank had also taken part in the cartel but was not fined alongside the other investment banks as it revealed the existence of the cartel.  \n>  \n>“Today we have issued a decision against Bank of America Merrill Lynch, Crédit Agricole, Credit Suisse and Deutsche Bank, whose traders colluded on trading strategies, exchanged sensitive pricing information and coordinated on prices,” said Margrethe Vestager, executive vice president of the Commission in charge of competition policy.  \n>  \n>“The behaviour of the investment banks restricted competition in a market in which investment and pension funds regularly buy and sell bonds on behalf of their investors and pensioners. The cartel harmed the financial markets and today’s decision sends a clear message that the Commission will not tolerate any type of collusive behaviour.”  \n>  \n>Of the €28 million penalty, Bank of America Merrill Lynch received the most severe fine of €12, 642,000, followed by Credit Suisse who received a fine of €11,859,000, and Crédit Agricole who received a fine of €3,993,000.  \n>  \n>The fine marks the latest crackdown on cartel activity within large investment banks by the Commission. In 2019, Barclays, RBS, Citi, JP Morgan and MUFG paid a [combined €1.07 billion in penalties](https://www.thetradenews.com/major-banks-fined-e1-billion-role-fx-trading-cartel/) for their involvement in a cartel that rigged FX spot prices for 11 currencies.",
    "title": "Bank of America, Credit Suisse and Credit Agricole fined €28 million for role in bond trading cartel",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n4em75/bank_of_america_credit_suisse_and_credit_agricole/"
}