{
    "author": "floodmayhem",
    "created_utc": 1624015125.0,
    "distinguished": null,
    "edited": false,
    "id": "o2mr1s",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_o2mr1s",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/o2mr1s/after_moass_i_propose_superstonk_not_be_retired/",
    "score": 598,
    "selftext": "We all know the last 3-6-8 months have been the most thrilling and captivating ride. Our community, has survived numerous events, and metamorphized into this beautiful butterfly we call SuperStonk.\n\nThe months we have all spent, addicted to the highs of research and discovery, of good-doing, whistleblowing, and just plain old observation... It's been surreal, and **WE WILL ALL SORELY MISS IT**.\n\nNow, I've seen talks and propositions to freeze or retire SuperStonk once the MOASS takes off. It makes sense. I see the upsides to having this vast trove of collective knowledge and power frozen and preserved in time. After giving it some thought though, I say, **NO**.\n\nHear me out.\n\nWhy would we retire one of the world's most powerful collective of individuals?\n\nI propose we keep SuperStonk around for good. Post-MOASS SuperStonk has the potential to be even greater, to be **THE BEST**(insert ALWAYS WAS meme). Think of it, we spent the entirety of this saga learning and honing our skills of deduction, reasoning, speculation, and vetting....\n\n**SuperStonk could be the greatest collective watchdog of global finance and trade.** \n\nThe MOASS would prove we were right about it all, would prove our worth as detectives. It would be morally irresponsible for the community to retire that efficiency and power, especially in the dark times to come with the incoming collapse.\n\nJust my two cents. I love this place and all of you apes.",
    "title": "After MOASS, I propose SuperStonk NOT be retired.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2mr1s/after_moass_i_propose_superstonk_not_be_retired/"
}