{
    "author": "shrimp_dick69",
    "created_utc": 1626981186.0,
    "distinguished": null,
    "edited": 1627062370.0,
    "id": "opku7p",
    "text_only": true,
    "flair_text": "⚠ Inconclusive ⚠",
    "name": "t3_opku7p",
    "num_comments": 1068,
    "permalink": "/r/GMEJungle/comments/opku7p/i_think_we_finish_above_1000_tomorrow/",
    "score": 2187,
    "selftext": "Hey guys! Just thought I'd get my opinion out there about tomorrow and why my titties are so damn jacked! This is not financial advise and I lick windows.\nThe 1 day MACD is going to cross tomorrow. Last time it crossed with this set up was the run in Feb. And every cross over the price went up. If you look at the options (google GME options) you will see there are way more calls the puts. From 200 and above. Honestly if you look at the options you can tell what gme is going to do for the week. That's why everyone talks about \"max pain\".\nThe only resistance I see is at 197 and that shouldn't be much to pass that spike to 187 this morning I think was a test for tomorrow. Other indicators show that it is going to explode.\nBut anyways I just wanted to call it out! I know some people don't like dates and I'm not saying the date of the MOASS. That will come when the dtcc is forced to cover. What I'm saying is that I think there is a gamma squeeze tomorrow 🚀🚀🚀 \n\nTLDR: shrimp dick 69🍤 is calling out a gamma squeeze over 1,000 tomorrow 🚀🚀🚀🚀🚀🚀🚀\n\nEdit: well fuck, looks like there is a put wall at 177 and 180. MACD still hasn't crossed. I think it starts Monday along with the beginning of a market crash.\nWell.... I'm still very jacked! I was just looking forward to the 🍌 🍑 party 😢 oh well, I guess it'll happen tomorrow 🚀🚀🚀 if not Saturday then definitely Sunday\n\nEdit 2: I hope everyone is jacked still, I was wrong about the gamma squeeze but with all the great news I hope everyone is jacked. TO BE VERY CLEAR. MOASS does not start until the DTCC is FORCED to cover. Which I'm sure has something to do with the NFT. I'm a hype every day ape and I wanted to call out a gamma squeeze. it looks like they kicked the can another day, but it looks like we will see action Monday 🚀 obviously you shouldn't take anything a guy named shrimp dick said seriously, but if I can say one thing is that DONT BUY OPTIONS. MM easily manipulate that to profit. \nBuy and hold is the way. We all like the stock, I just want to jack some titties and get some laughs in with my ape fam.\nI'm sorry if I disappointed anyone\nLove all you apes 🚀 and I hope your more jacked then every. WE ALL ARE RIGHT, AND MOASS OS INEVITABLE. Infinity squeeze incoming",
    "title": "I think we finish above 1000 tomorrow 🚀",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/GMEJungle/comments/opku7p/i_think_we_finish_above_1000_tomorrow/"
}