{
    "author": "TheMuslimMGTOW",
    "created_utc": 1622967816.0,
    "distinguished": null,
    "edited": false,
    "id": "nth0jt",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nth0jt",
    "num_comments": 194,
    "permalink": "/r/Superstonk/comments/nth0jt/dfv_becoming_the_infinity_pool_is_fud_some/",
    "score": 1572,
    "selftext": "***Disclaimer: none of this is financial advice. Just my own thoughts and opinions about a stonk I like.***\n\nThere was a [post yesterday](https://www.reddit.com/r/Superstonk/comments/nsuff2/dfv_the_infinity_pool/) which was talking about how DFV is potentially becoming the infinity pool all by himself. It was based on mostly speculation and it counts as FUD (though perhaps unintentional by the OP) in my opinion and I was surprised by how many upvotes it got.\n\nLook.\n\nIf we *truly* want an infinite squeeze, then **EVERY APE** will need to do their part. Whether you are XXXXX hodlers or X hodlers, every single share will count if we want to go [to infinity and beyond](https://www.youtube.com/watch?v=2VSYmGSJtCA).\n\nThe fact that that post got so many upvotes is telling that a lot of you are not ready to hodl through the millions. A lot of you want someone else to do the hard work for you. No-one needs that kind of pressure, least of all DFV. We all have a role to play here.\n\n**Okay, so what do we do?**\n\nA lot of people are throwing percentages around. 10% for infinity pool. 25% for infinity pool. 75% for infinity pool. Everyone is in a different situation, hodling different amounts.\n\nI believe the best thing to do, regardless of how many shares you own, is to **only sell 1 share when the time is right**. **Assume you only have 1 share to make your tendies.** If every ape hodls all of their shares, the rocket ship should keep on blasting.\n\nSo even if you are an X hodler, you can contribute a lot towards the infinity pool.\n\nRemember, you only need to sell 1 share to become a multi millionaire.\n\nSo my plan is to sell 1 and hodl the rest to the grave. Kenny will have to pry them from my cold, dead diamond hands.",
    "title": "DFV becoming the Infinity Pool is FUD | Some thoughts on the Infinity Pool",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nth0jt/dfv_becoming_the_infinity_pool_is_fud_some/"
}