{
    "author": "TenguAteMyBreakfast",
    "created_utc": 1623008781.0,
    "distinguished": null,
    "edited": 1623025892.0,
    "id": "nttvdz",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nttvdz",
    "num_comments": 262,
    "permalink": "/r/Superstonk/comments/nttvdz/melissa_may_have_given_ryan_cohen_the_blue_turtle/",
    "score": 2966,
    "selftext": "I made a post earlier about Melissa untying the hands of media then lightning struck. Please hear me out here...\n\nI can't believe it took me this long to think of it but this unchained the beast that is **RYAN COHENCurrent events...**Friday - Melissa says \"Naked Shorts yeah...\"Saturday - Naked Shorts is trending on Twitter and getting the attention of the general public.Sunday - CNBC plays CYASunday - Wes Christian gets a meeting with MSM.\n\n**Theoretical...**  \nMonday - Wes has his interview.  \nTuesday - More attention to naked shorting.  \nTuesday or Wednesday - Ryan Choen can clear his throat and raise his hand and say the following.  \n**Edit -** Sometime this week - Rule 005 drops. I figure if you are going to dream dream big. \n\n**\"My company just had their annual vote. We counted XXX millions share when there should only be 70 million total. I think my company may have been subjected to some form of naked shorting. I would like to look into this. \"**\n\nHe can say this without fear of market manipulation because it is mentioning a crime that has just been brought up in MSM. This would also eliminate any issue of backroom counting deleting votes. It would also allow Ryan to mention the vote count without someone claiming it is market manipulation.\n\n&#x200B;\n\nI'm truly retarded and it's hard to stay conscious with all my blood headed to my nethers because this idea has made me giddy as a teenager on prom night.",
    "title": "Melissa may have given Ryan Cohen the Blue Turtle shell...",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nttvdz/melissa_may_have_given_ryan_cohen_the_blue_turtle/"
}