{
    "author": "NoMoreCheeters",
    "created_utc": 1623032526.0,
    "distinguished": null,
    "edited": 1623084233.0,
    "id": "nu1pnq",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nu1pnq",
    "num_comments": 613,
    "permalink": "/r/Superstonk/comments/nu1pnq/please_remember_that_during_the_shareholders/",
    "score": 11117,
    "selftext": "They have a game plan. No doubt. They've had time to plan. They have the power to move the price anywhere they want. Up, down, or nowhere. Whatever happens, it's because they want it to happen.\n\nA couple possible scenarios:\n\n1. It spikes. $1,000 maybe. Why? Because then they can crash the price and claim that was the short squeeze. An NFT announcement, or something else in the meeting, \"pushed out the last 20% of short sellers and the squeeze is over\". Clearly, BS. Don't fall for it.\n2. They repeat the earnings call trick. Crash that son of a banana 40%. Why? They still think they can shake you. They shouldn't think this, but their egos tell them that they are smarter than you.\n3. The price stays put. Why? Wouldn't this make you question your hypothesis more than either option above? I mean, you being a diamond handed ape, this will only last .0000005 seconds. But! This is the scenario that kills the excitement. Doesn't look like manipulation (but it is). Doesn't look like you're getting what you want.\n\nThe point is simple, they are trying to get you to believe the story they want you to believe. Everything you see is fake. As for me, I might just avoid watching the ticker all day Wednesday. What I'm holding for won't play out this week.\n\nEdit 1:\n\nContacted by a shill after this became hot.\n\nEdit 2:\n\nThanks for pointing out that the shill was actually a troll.\n\n**Not financial advice. Not a financial advisor.**",
    "title": "Please remember that during the shareholder's meeting the price can be highly manipulated to tell the story the hedgies want you to believe.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nu1pnq/please_remember_that_during_the_shareholders/"
}