{
    "author": "Leenixus",
    "created_utc": 1622472305.0,
    "distinguished": null,
    "edited": 1622478179.0,
    "id": "np50w4",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_np50w4",
    "num_comments": 61,
    "permalink": "/r/Superstonk/comments/np50w4/submitted_multiple_foias_and_requests_for_info_on/",
    "score": 510,
    "selftext": "Hi all,\n\nI've submitted a few FOIAs to multiple organizations to try and get to the bottom of the missing SR-DTC-2021-005\n\n* Federal Financial Institutions Examination Council\n* SEC\n\nI've filed an FBI tip regarding the disappearance of this regulation filing and have also submitted a FINRA tip on their tipline.\n\nI am unfortunately a Euro-Ape and have no other avenues to pursue this. If you're an American ape, i wish you'd do a few google searches about FOIA requests and the relevant tip-lines to try and put some pressure on this and perhaps get it resolved.\n\nDo not spam these services. Simply contact them if you have concerns regarding SR-DTC-2021-005 and ask why it disappeared, who made it disappear and when we'll see it re-filed again. Hopefully this make a few people ask the right questions.\n\nI'm not gonna make it easy for you to contact these authorities by giving you a link here. Just google it. If you can't be bothered to google it, then you can't be bothered to spend 1hr of your life enquiring about SR-DTC-2021-005 to the relevant authorities.\n\n&#x200B;\n\n**EDIT: This is the template i used. Don't use the same one. Emails sent with the same content are automatically grouped as 1 email. Make sure your email is unique.**\n\n\\-SEC REGULATION FILING called SR-DTC-2021-005\n\n\\-OMB Number: 3235-0045\n\n\\-Description: Modify the DTC Settlement Service Guide and the Form of DTC Pledgee’s Agreement\n\n\\-Contact Information: John Petrofsky, Assistant General Counsel and Director, [JPetrofsky@dtcc.com](mailto:JPetrofsky@dtcc.com), (813) 470-2115\n\n\\-Signed by: Brandon Becker, Deputy General Counsel and Managing Director, 04/01/2021, [bbecker@dtcc.com](mailto:bbecker@dtcc.com)\n\n&#x200B;\n\nThe regulation filing was posted and promptly removed a week later sometime during the period of February-May 2021 with the excuse that it had formatting errors (which it did not have)\n\n\\-REQUESTED INFORMATION - Keywords\n\nSR-DTC-2021-005\n\nDTC-2021-005\n\n3235-0045\n\n&#x200B;\n\nI am a retail investor coming from Reddit (Superstonk in specific) from a community of retail traders. The community consists of 300 000 retail traders who's interest is a single stock who's ticker is \"GME\" (GameStop). It's come to this and many other communities attention that along with the recent NSCC, FICC, OCC, DTC, SEC regulation filings in early 2021, that all regulations were filed and passed except SR-DTC-2021-005 which DISAPPEARED from the DTC/SEC websites but not before the said reddit communities managed to archive both the DTC/SEC websites and the documents themselves (Find it attached).\n\nThis FOIA/request is to find out what happened to SR-DTC-2021-005, why it was removed, who removed it and an exact date that it will be re-filed.",
    "title": "Submitted multiple FOIA's and requests for info on SR-DTC-2021-005",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/Superstonk/comments/np50w4/submitted_multiple_foias_and_requests_for_info_on/"
}