{
    "author": "infj-t",
    "created_utc": 1614889211.0,
    "distinguished": null,
    "edited": 1614956725.0,
    "id": "lxu6nf",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_lxu6nf",
    "num_comments": 264,
    "permalink": "/r/GME/comments/lxu6nf/i_created_a_webpage_to_draw_attention_to_the_gme/",
    "score": 2671,
    "selftext": "**Last Updated: 15:00PM (GMT), 10:00AM (EST), 07:00AM (PST)**\n\nOn Wednesday I created and shared [**https://gmetruth.com/**](https://gmetruth.com/) \\- a one page overview of what's going on with GME, written in a way someone who has only seen mainstream media reports would understand and hosted on a standalone webpage so that it's easily accessible outside of Reddit.\n\nSince yesterday evening the site has been getting increasing amounts of traffic (as in 10's of thousands) and I noticed earlier that there are attempts to access files which are used for PHP, SQL and Wordpress exploits, hundreds of hits from a series of single IP addresses in quick succession (*maybe* someone trying to cause a DDOS outage) - i.e take down the website.\n\nJokes on whoever is trying to take the site down though, it's a single page raw code website and has no exploitable code, because I'm a smooth brained ape, and I don't know what a Wordpress is.\n\n&#x200B;\n\n**TLDR:** It appears that nefarious actors are trying to censor content that would challenge the media narrative which exists outside of Reddit and ~~could potentially go~~ is slowing going viral.\n\n🚀🚀🚀🚀**Buy and hold GME** 🚀🚀🚀🚀\n\nIncase there was any doubt bout what dis post means: [https://gmetruth.com/rocket.html](https://gmetruth.com/rocket.html)\n\n*This is not financial advice.*\n\n&#x200B;\n\n**Update 5th March 21:**\n\n*Thanks for the award(s) whoever you are :)*\n\nThanks for all the comments and feedback, I have made some changes to the site today, see changelog below:\n\n\\- Added detail around media silver coverage;  \n\\- Added publication timestamp;  \n\\- Added link to Jim Cramer interview;  \n\\- Added link to timestamp of Gabriel Plotkin talking about covering shorts;  \n\\- Added links relating to the supposed 20% gains for Melvin Capital;  \n\\- Added MarketWatch / Barron's to the list of biased media outlets;  \n\\- Adjusted the margin on desktop for easier reading;  \n\\- Added a 404 for any confused apes [https://gmetruth.com/404](https://gmetruth.com/404);\n\nFurther changes are coming, including a full timeline of events - future requests are welcome too.\n\n&#x200B;\n\n**Developers Note:**\n\n*Guys, this is not a circle jerk about how many hits your 'private server' gets each day, nor on the mechanics of DDOS, XSS, injections or any other kind of web/server based exploit. The point of this post is to illuminate odd activity which stands out from any other website or server I have managed over several years. There's no claim here that I know this is deliberate, simply that the error logs look suspect.*",
    "title": "I created a webpage to draw attention to the GME media and stock manipulation and I can see DDOS attempts in the site's error logs 🚀🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/lxu6nf/i_created_a_webpage_to_draw_attention_to_the_gme/"
}