{
    "author": "Region-Formal",
    "created_utc": 1628303186.0,
    "distinguished": null,
    "edited": 1628322101.0,
    "id": "ozkv5g",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ozkv5g",
    "num_comments": 77,
    "permalink": "/r/Superstonk/comments/ozkv5g/new_cboe_filing_states_march_and_june_were_the/",
    "score": 2349,
    "selftext": "**EDIT 1:** The title of this post should, in fact, start as follows: **”Both CBOE and NASDAQ filings state…”** (see EDIT 2 below)\n\nThanks to the link shared by u/Dismal-Jellyfish, there is an interesting bit of info/data shared by the CBOE (Chicago Board Options Exchange) that I picked up on. They have made a filing to the SEC regarding a reduction in the ORF - Options Regulation Fee. This is a fee to *“to assist in offsetting exchange costs relating to the supervision and regulation of the options market (e.g., routine surveillance, investigations, and policy, rule-making, interpretive and enforcement activities).”*\n\nThe filing can be found here:\nC2 (Release No. 34-92596; File No. SR-C2-2021-012; August 6, 2021) https://www.sec.gov/rules/sro/cboe/2021/34-92597.pdf\n\nPages 3 and 4 explain why the CBOE has made this filing, which in fact decreases the ORF cost for each options contract:\n\n*Based on the Exchange’s most recent semi-annual review, the Exchange is proposing to reduce the amount of ORF that will be collected by the Exchange from $0.0004 per contract side to $0.0003 per contract side. The proposed decrease is based on the Exchange’s estimated projections for its regulatory costs, which have decreased, balanced with recent options volumes, which has increased. For example, total options contract volume in March 2021 was approximately 34% higher than the total options contract volume in March 2020 and the total options contract volume in June 2021 was approximately 25% higher than the total options contract volume in June 2020.* **In fact, March 2021 was the highest, and June 2021 was the second highest, options volume month in the history of U.S. equity options industry.**\n\nNote that the CBOE are bound by SEC regulations to adjust the ORF, in line with options volumes. So even if they did not necessarily want to make this change, they have no option but to adjust the fees and provide a justification. In doing so, they have somewhat revealed the hand of what is happening overall i.e. historically high volumes of options being traded in these last few months.\n\nWhy is this significant? Because it has been conjectured by many Apes that much of the fuckery we have been seeing for hiding FTD obligations is through options trading. This filing seems to indicate there has been a huge increase in volumes *from precisely the timing that line up with this mechanism being used.* \n\nOf course that could be coincidental, but I think we have learned enough this year that there are not many coincidences in this whole saga…  And as u/Wallstreet_Owes_Me pointed out in this post - which really should have had more attention - the CBOE appears to be one of Shitadel’s main partners for manipulating the share price through dark pools as well:\n\nhttps://www.reddit.com/r/Superstonk/comments/ox93kt/citadels_connection_with_cboe_global_markets_and/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n**TL;DR**: The CBOE (Chicago Board Options Exchange) has made a filing with the SEC announcing a reduction in mandatory fees for options contracts. This is not out of the goodness of their hearts, but because they are forced to do so in order to abide with SEC regulatory costing requirements for exchange providers. The reason is that options volumes in the last 3-4 months are at historical all-time highs, and they have documented this fact within the filing. It has been conjectured that options fuckery is the central method by which Shitadel and others are circumventing their FTD requirements for shorted shares. This huge increase in options volumes, in a timeline that fits with that conjecture, seems to be very much pointing to the hypothesis being accurate.\n\n**EDIT 2:** In fact, it appears Nasdaq has made a similar change to their options fees as well! They have described the reason for the change in fees on the Nasdaq Options Market (NOM) being due to options volumes being *“at abnormally and unexpectedly high levels”* and it’s scale as an *“historical anomaly”*:\nhttps://www.sec.gov/rules/sro/nasdaq/2021/34-92600.pdf\n\n**EDIT 3:** From some of the questions and comments, I can see some of you Apes have not fully grasped the implications of what these statements from the options exchanges are pretty much comfirming. The DD is not about the costs of buying options premiums being affected for retail buyers (note: a foolish trading strategy anyway for GME...) but really showing that some of the theories about options being used to hide short positions are a distinct possibility e.g.:\n\nu/Criand posting here about Buy-Writes: https://www.reddit.com/r/Superstonk/comments/oc4f79/well_there_it_is_more_mathevidence_pointing_to/?utm_medium=android_app&utm_source=share\n\nAnd the same writer here about OTM PUTs: https://www.reddit.com/r/Superstonk/comments/on9dtz/otm_puts_are_the_passed_puck_of_short_positions/?utm_medium=android_app&utm_source=share\n\nThe huge increases in options volumes are all but confirming these hypotheses are correct IMO.",
    "title": "New CBOE filing states March and June were the highest “options volume months in the history of U.S. equity options industry” - strongly points to the options skulduggery theories being CORRECT",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ozkv5g/new_cboe_filing_states_march_and_june_were_the/"
}