{
    "author": "apegoneinsane",
    "created_utc": 1628247240.0,
    "distinguished": null,
    "edited": false,
    "id": "oz4ajx",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_oz4ajx",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/oz4ajx/why_lit_exchanges_are_slowly_dying_emfs_memx_ats/",
    "score": 1732,
    "selftext": "A lot of users asked for this post this morning so here it is.\n\n**“The Big 3” - Exchange Management Funds (EMFs)**\n\nThese are what we informally refer to as ‘lit’ exchanges - Nasdaq, NYSE, CBOE. There are 16 in total but these are The Big 3 - they accounted for 2/3 of equity transactions. They were perceived as rather oligopolistic allowing for continuous price increases for access to data feeds, which has proven lucrative. I believe the NYSE alone brought in $200m from this.\n\nThere was much consternation from Wall Street on this.\n\nUBS: “*the level of frustration was just so high for many of us that we had to go do something more proactive for us and our clients”.*\n\nWell, our financial instructions felt they needed a competitor, and so since SEC approval in 2020, we also have the MEMX (with as self-absorbed a name you can think of - The Members Exchange).\n\nFounders were BofA, Charles Schwab, Citadel, E-Trade, Fidelity, Morgan Stanley, TD Ameritrade, UBS and Virtu. Other corporations also invested to jump on the bandwagon - BlackRock, Citigroup, JP Morgan, Goldman Sachs, Wells Fargo and Jane Street.\n\nSo what do they do? Well they purport to be different by focusing on the needs of their membership, instead of the profitability of their shareholders.\n\n*“MEMX was founded to drive competition and give a voice to investors. Our rapid growth is evidence we are filling an important need in the exchange landscape,” said Jonathan Kellner, CEO of MEMX. “We are pleased to be gaining traction by the day and grateful for the active participation of our members, who represent a broad cross section of the market, including banks, institutions, market makers and retail participants.”*\n\nBasically increase competition, improve transparency, reduce costs, and simplify order execution for the interests of the founders’ clients, ie institutional and retail investors.\n\nThey also want to the final stop in PFOF. So Retail Order > Broker > HFT (PFOF) > Exchange (payment for limit orders). The argument is their fees are inexpensive and much cheaper than the Big 3 but the underlying benefit is this will allow them to bypass the other exchanges completely.\n\nThis goal will have the ultimate effect of making the traditional exchanges non-entities in the marketplace. This isn’t hyperbole either. Despite coming into existence in late 2020 and competing against 16 exchanges, they sat as the **6th largest** in April and their increase between March and April was **46%**. Wall Street is backing this one with all their might.\n\nYou guys will remember the whole '*Meme' stock prices may not properly reflect demand‘*. Stacey, the NYSE President, seemed to be referring to dark pools but I would speculate she was also pretty pissed at MEMX.\n\n**ATS (Alternative Trading System) - “Dark Pools”**\n\nThe ones we all know and love. They are private exchanges, can help with liquidity and stability but not so much with transparency allowing for abuse and conflicts of interest. They help match **large** buy and sell transactions without the stricter regulation of lit exchanges. They do have reporting requirements to FINRA and are governed by SEC Regulation ATS.\n\nYou can find a list [**here**](https://otctransparency.finra.org/otctransparency/AtsData) of the registered ATS under ATS Data. You can also use the ATS Issue Data to search for GME specifically.\n\nYou will notice that a lot of the members of MEMX have their own dark pools. That coupled with the different types of institutions on there may lead to governance issues down the line. Citadel used to have one called Apogee before they abandoned it in favour of a SDP (see below).\n\nYou may also notice OTC data, this does not fall under ATS / dark pools. Think of these like direct transactions between two financial institutions. Volume data is also available on the linked website.\n\nDark Pools have been subject to plenty of documented abuse (courtesy of **The Tokenist**):\n\n* On October 3, 2012, [SEC charged eBX LLC](https://www.sec.gov/news/press-release/2012-2012-204htm) for failing to protect the confidential information of its subscribers, allowing third parties to use the information.\n* On June 6, 2014, [SEC charged a New York broker](https://www.sec.gov/news/press-release/2014-114) for mishandling confidential information and using it for marketing purposes.\n* On January 15, 2015, [SEC charged UBS Securities LLC](https://www.sec.gov/news/pressrelease/2015-7.html) for failing to disclose an order type that it pitched exclusively to market makers.\n* On August 12, 2015, [SEC charged ITG and AlterNet Securities](https://www.sec.gov/news/pressrelease/2015-164.html) for operating a secret trading desk and misusing confidential trading data.\n* On January 31, 2016, [SEC charged Barkley Capital and Credit Suisse](https://www.sec.gov/news/pressrelease/2016-16.html) for numerous violations, among them executing 117 million illegal sub-penny orders.\n* On September 14, 2018, [SEC charged Citigroup](https://www.sec.gov/news/press-release/2018-193) for misleading dark pool users and routing orders in other trading venues.\n* On November 7, 2018, [SEC charged ITG and AlterNet Securities](https://www.sec.gov/news/press-release/2018-256) again for similar violations as the last time.\n\n**SDP (Single Dealer Platform) - ”Fucking Invisible Pools”**\n\nThis subreddit is widely familiar with Citadel Connect. These are unregistered dark pools specific to the originating company. They do not have to report volume to FINRA. They are not covered by Reg ATS or Reg SCI.\n\nGary Gensler noted that in January “*nearly half of the trading interest in the equity market either is in* *dark pools* *or is internalized by wholesalers”.* But he also further noted that only around 9% of January’s trading volume was on dark pools. So where is the missing approx 41%? It’s internalized by wholesalers, which is through SDPs.\n\nBy now, we can slowly start to appreciate Citadel’s dominance - they are a member of MEMX, they are a huge, if not the largest, MM on The Big 3 Exchanges, they have a supporting hedge fund entity and in terms of sheer volume, they just dominate from how Ken bragged about their statistics as a securities wholesaler - [47% of US-based retail trading volume](https://www.citadelsecurities.com/products/equities-and-options/) and their status as a significant part of PFOF revenue streams, such as seen in RobinHood. This wholesaler dominance is a point Gary Gensler has highlighted as a big area of concern for all the right reasons.\n\nGood reminder, Citadel Securities were given a [$22 million penalty in 2017](https://www.sec.gov/news/pressrelease/2017-11.html) for “*misleading statements suggesting that it would provide or try to get the best prices it saw for retail orders routed by other broker-dealers*“. [Citadel have also made comments on OTC and SDPs and how they should be defined.](https://www.finra.org/sites/default/files/notice_comment_file_ref/18-28_Citadel_comment.pdf)\n\n**So What Other SDPs Are There?**\n\n**Virtu** – “VEQ Link“ - [https://www.virtu.com/uploads/documents/VEQ-Execution-Protocols.pdf](https://www.virtu.com/uploads/documents/VEQ-Execution-Protocols.pdf)\n\n**Jane Street**  – “JX” - [https://www.janestreet.com/institutional-services/electronic-trading-platforms/](https://www.janestreet.com/institutional-services/electronic-trading-platforms/)\n\n**Barclays -** “BARX Book for Equities” - [https://www.tradersmagazine.com/xtra/barclays-nasdaq-launch-barx-single-dealer-equities-platform/](https://www.tradersmagazine.com/xtra/barclays-nasdaq-launch-barx-single-dealer-equities-platform/)\n\nThe thing that really sticks out is the level of fragmentation of equity trading in the US all under the guise of market efficiency and lower costs. Now even banks are trying to get into making their own SDPs.\n\n**Please feel free to form a rebuttal if you have anything to add or disagree with. I want this to be more of an open discussion based on what you guys can also find.**",
    "title": "Why Lit Exchanges Are Slowly Dying - EMFs, MEMX, ATS (Dark Pools) and SDPs (Citadel Connect - but have you heard of the others? VEQ Link, JX, BARX Book for Equities).",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oz4ajx/why_lit_exchanges_are_slowly_dying_emfs_memx_ats/"
}