{
    "author": "derfmongol",
    "created_utc": 1617404541.0,
    "distinguished": null,
    "edited": false,
    "id": "mivykk",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_mivykk",
    "num_comments": 335,
    "permalink": "/r/GME/comments/mivykk/i_quit_my_dead_end_job_today_and_i_wanted_to/",
    "score": 5731,
    "selftext": "I quit my job today. I know, I know... why the fuck didn't I wait until the squeeze happened.... I know, I'm being irresponsible... I know, I know. Just so everyone knows I was able to contact an old work buddy and have a job already lined up but this post isn't about that. It's about the Diamond Balls I learned to develop by reading r/GME posts. \n\nI was stuck in a dead end job for years and just went to work to get my paycheck. My managers kept taking advantage of my hard work and talking shit behind my back but I just never cared what they thought. I just kept my head down, enjoyed the other people I was working with and kept working hard. \n\nThen I saw a glimmer of hope last year when Covid happened and wanted to take my chances investing. I always heard to invest when a recession hits and so during the March 2020 Plunge I took my chances with some retail company stocks last year in March. I kept putting my paychecks in the stocks and just held, never sold. \n\nI was able to grow my portfolio from $0 --> $50k in one year on a $27k salary. Fucking blew my mind but I'm realizing it was because of the incredible 2020 bull run and luck had a great part in it.\n\nThen Jan. comes and I start hearing about GameStop. It hit its peak at $450 but then started going back down fast. That's when I liquidated two-thirds of my portfolio and bought 175 shares at 100 cost basis.   \n\nTHEN THE INCREDIBLE HAPPENED\n\nI began waking up from the slumber I have been in for years at my dead end job.  I started standing up to the Managers that enjoyed sucking the soul out of their employees for fun. I told them how they are the reason everyone quits and they need to learn to respect their employees more. \n\nLOL .... BOY DID THEY NOT LIKE THAT\n\nFor the last two, months I have been a target for everything bad within the organization. They say, I'm the reason the department is doing bad. \n\nTHEN TODAY..... I showed up to work and they sent me home without pay because I've been talking back. SOOOO..... I gave it couple of hours. Drove back there and went straight to HR and told them EVERYTHING on how these managers have been abusing employees for years and I'm quitting because of it. \n\nBy the time I was done talking, I had HR in tears because of the TRUTH I told them. These managers aren't supposed to send employees home with no pay. Plus I have no bad record and have been outstanding employee for years so whatever I say is GOLD. She felt so bad she paid for the day today. BASICALLY THEY'RE FUCKED. \n\nThe reason I'm sharing this is because when I liquidated my portfolio and put most of it into GME, I gained some sort of SUPERPOWER in my real life. I can't explain it but it's like I took the LIMITLESS PILL. I knew what was wrong and right and wasn't afraid to showcase it to the world. \n\nI FOUND MY VOICE BECAUSE OF GME. \n\nFUCK THE HEDGIES\n\nDIAMOND HANDS BITCHES\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "I quit my dead end job today and I wanted to thank this sub for giving me diamond balls",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/mivykk/i_quit_my_dead_end_job_today_and_i_wanted_to/"
}