{
    "author": "taranasus",
    "created_utc": 1625126961.0,
    "distinguished": null,
    "edited": 1625150143.0,
    "id": "obh3z3",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_obh3z3",
    "num_comments": 288,
    "permalink": "/r/Superstonk/comments/obh3z3/simple_ftd_math_based_on_uchriscrafttexasusa_post/",
    "score": 6584,
    "selftext": "# IMPORTANT EDIT\n\n**NONE OF THIS IS FINANCIAL ADVICE, I'm literally just talking about numbers, you do you with trades!**\n\nSome people have expressed concerns that [sec.report](https://sec.report) doesn't seem like a legit website, or that user ChristCraftTexasUSA is showing bot behavior. While I admire and encourage people to always remain skeptical and vigilant, please double check before throwing such claims around.\n\nPer the bottom portion of the [sec.report](https://sec.report) website [https://imgur.com/a/xgdUY7a](https://imgur.com/a/xgdUY7a) \\- It is just a data scraper / aggregator that presents this data from the [sec.gov](https://sec.gov) site in a more readable way.\n\nThe website is about 3 years old going by the age of its twitter account [https://twitter.com/EdgarInsider](https://twitter.com/EdgarInsider)\n\nAnd probably, most importantly, you can literally get the source data from the SEC website. Here I am showing the numbers for the June 14 date and where to find them. [https://i.imgur.com/AOIWpT1.png](https://i.imgur.com/AOIWpT1.png)\n\nFeel free to verify the other two numbers (Oct for GME, Dec for TSLA) for yourself if you like.\n\nI just want to say that while it's okay to be skeptical, and always challenge the information you are presented with, challenge it by doing some actual digging, not by just throwing accusations around. You may inadvertently hurt someone that is just trying to provide a free service to all of us. Be excellent to each other apes.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n# MAIN POST HERE\n\nThe starting point of my maths:  [(1) GME FTD shares Failed to Deliver SEC link: https://sec.report/fails.php?tc=36467W109 : Superstonk (reddit.com)](https://www.reddit.com/r/Superstonk/comments/obet09/gme_ftd_shares_failed_to_deliver_sec_link/)\n\nI think \"FUCK ME\" is an understatement here. I've been comparing **GME FTDs** with **TSLA FTDs** since TSLA is the more \"Volatile\" of the stocks out there. The numbers are mind blowing.\n\n**The very last datapoint** we have on GME is **June 14, with a FTD count of 105,712**\n\n**The highest ever** nr of FTDs in one day for **TSLA was on DEC 17, 2020, at 1,382,452 FTDs.**\n\nAt first glance, it would look like the tesla number is 10 bigger than the GME one no? Well you'd be right, however we need to remember that the number of outstanding shares for the two companies are wildly different. On Dec 17, TSLA had 905,000,000 outstanding shares, while on June 14, GME had only (assumed) 77,000,000 outstanding shares.\n\nSo if you put these percentage wise:\n\n\\- TSLA: 1382452 / 905000000 \\* 100 = **0.1527 % of total shares were FTD**\n\n\\- GME: 105172 / 77000000 \\* 100 = **0.1372 % of total shares were FTD**\n\nSo just a random day in June for GME had as many FTDs as Tesla did in its highest day ever in its history.\n\nSo then... the question on everyone's mind... what was GME's highest FTD day? Well you see everyone, **Oct 13 2020: 3,210,148**. On that date, according to ycharts, GME had 65.2M outstanding shares. I'm actually going to go with 70 mill shares as I think the 65M number is wrong. So\n\n\\- 3210148 / 70000000 \\* 100 = **4.5% of total shares were FTD. THEY COULDN'T LOCATE 4.5% OF THE GOD DAMN COMPANY!**\n\n***Flash edit:***  /u/Lilsunshyyne ***in*** [the comments](https://www.reddit.com/r/Superstonk/comments/obh3z3/simple_ftd_math_based_on_uchriscrafttexasusa_post/h3ooj12/?context=3) ***said the following \"*** *I think the 65million share number is correct because although they were authorized to sell an additional 2 mill or so shares they hadn't yet at that time (oct 2020)... (this was the first share offering they made this year, to complete their authorized sales from prior authorization). Then they notified us of an additional 3.5 mil shares that was recently completed. So all that to say I think that 65 mil number is correct. Not financial advice...just opinion based upon observation. \"* ***and I think they may be correct, so let's do the math with both 65 mill and 70 mill.***\n\n*- 3210148 / 65000000 \\* 100 =* ***4.93% of total shares were FTD. THEY COULDN'T LOCATE 4.93% OF THE GOD DAMN COMPANY!***\n\nSEC what the fuck are you doing??? Seriously who looks at these numbers and goes like \"YEP, THIS IS FINE!\". Do your god damn job!\n\nSources:\n\nGME FTD data [https://sec.report/fails.php?tc=36467W109](https://sec.report/fails.php?tc=36467W109)\n\nTSLA FTD data [https://sec.report/fails.php?tc=TSLA](https://sec.report/fails.php?tc=TSLA)\n\nGME Outstanding Share Count data: [https://ycharts.com/companies/GME/shares\\_outstanding](https://ycharts.com/companies/GME/shares_outstanding)\n\nTSLA Outstanding Share Count data: [https://ycharts.com/companies/TSLA/shares\\_outstanding](https://ycharts.com/companies/TSLA/shares_outstanding)\n\nNo fuckery going on here people....",
    "title": "Simple FTD math based on u/ChrisCraftTexasUSA post... GME appears to only have about 30 times more FTDs than TSLA... Just...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/obh3z3/simple_ftd_math_based_on_uchriscrafttexasusa_post/"
}