{
    "author": "Mokova000",
    "created_utc": 1625167021.0,
    "distinguished": null,
    "edited": 1625168229.0,
    "id": "obszj6",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_obszj6",
    "num_comments": 113,
    "permalink": "/r/Superstonk/comments/obszj6/why_the_time_of_launch_of_the_nft_is_significant/",
    "score": 1310,
    "selftext": "Tinfoil hats on everyone.\n\nFirst let’s look again at the timestamp of the NFT’s launch:\n\n[screenshot of the epoch converter of the date found in the NFT contract](https://preview.redd.it/bigfpuelhn871.png?width=682&format=png&auto=webp&s=4df9e66bce25a3a0135f63f741cf23005c3c32e7)\n\nThen, let’s look at the wiki page of bastille day (in french): [link](https://fr.wikipedia.org/wiki/Prise_de_la_Bastille)\n\n[image of wiki page of bastille day](https://preview.redd.it/2t52hjjphn871.png?width=975&format=png&auto=webp&s=8eacee869ec429c6590ec21860a9d74226383d2a)\n\nThis isn’t translated so I’ll do my best (french ape here):\n\nBastille siege:\n\n10h30:\n\nA delegation of the assembly of electors of Paris go to the Bastille. Members of the permanent comity don’t intend to take the building by force but wish to open way for negotiations. Urged by the crowd of rioters, \\[...\\], the electors send a delegation to the governor of the Bastille: Bernard-René Jordan de Launay. The governor sealed the windows, elevated the walls placed canons on the towers and behind the drawbridge. The delegation had for mission to ask for the retreat of the canons and the distribution of gunpowder and bullets to the Parisians who formed the “bourgeois militia”. Indeed, over the portal of the Bastille, was an arsenal, a shop for weapons and gunpowder. As a security measure, de Launay (the governor the Bastille) made them move the previous night towards an inner courtyard. This delegation was received with friendliness, it is even invited for breakfast, but leaves without winning the case. However, the crowd gets impatient and some imagine that the delegation is held prisoner. This misunderstanding exacerbates the tensions.\n\n11h30:\n\nA second delegation led by the initiative of Jacques Alexis Thuriot (I’ll refer to him as Jacques T. From now on), accompanied by Louis Éthis de Corny, attorney of the city, head to the fort of the Bastille. Jacques T., who wishes to avoid a fight, quickly walks past the Invalides (building to hold the handicapped of the army), inspects the area and demands warranties. The governor agrees to not take the initiative of shooting. The crowd of rioters armed with guns taken at the Invalides assemble in front of the Bastille. The crowd brings with them five canons taken the previous day at the Invalides and the Garde-Meubles \\[...\\]. They are served by soldiers rallied to the crowd and shoot on the doors of the fortress.\n\nAn explosion, interpreted by the rioters as canon shots ordered by the governor, leads to the first assaults. Rioters penetrate in the building by the roof of and attack the drawbridge with axes.\n\n&#x200B;\n\n&#x200B;\n\nWhat is the launch time of the NFT again? 11:20.\n\nWhat’s happening at 11:20?\n\nThe rioters are getting impatient. They think the delegation is being held prisoner.\n\n11:30 is when shit goes down, Jacques T. says hold on a second, something’s wrong, let’s investigate.\n\nJacques T. is merely going in to investigate. Then the rioters barge in and the rest in history.\n\nSomebody at the NFT team didn’t sleep in history class.\n\nI find it fucking hilarious that the guy’s name is literally Jacques T, we live in a simulation.\n\n&#x200B;\n\nTL;DR: 11:20 is 10 minutes before the rioters launched assault on the Bastille.  \n\n\nEDIT: formatting",
    "title": "Why the time of launch of the NFT is significant",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/obszj6/why_the_time_of_launch_of_the_nft_is_significant/"
}