{
    "author": "traditionalman16",
    "created_utc": 1624463584.0,
    "distinguished": null,
    "edited": false,
    "id": "o6fmhy",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_o6fmhy",
    "num_comments": 164,
    "permalink": "/r/Superstonk/comments/o6fmhy/fanniefreddie_supreme_court_ruling_notes/",
    "score": 1846,
    "selftext": "1. US supreme court dealt a blow to the court case for Fannie Mae and Freddie Mac investors in their challenge to the governments collection of 100 billion in profits from GSE’s (Government Sponsored Enterprises).\n   1. Threw out a big part of the investor’s lawsuit. Rejected the claim the Federal Housing Finance Agency exceeded its authority under federal law.\n      1. Implications-The profitability of owning the assets from GSE’s involved in mortgages has been substantially reduced. This is likely the cause for the dumping of the assets they back.\n   2. Court said investors might be able to win damages on a separate claim where some payments under the profit sweep (mentioned in point 1) were illegal because the FHFA director was protected from being fired by the President.\n      1. Likely not going to happen. Justices said they wouldn’t use the claim to toss out the entire profit sweep. Some losses are likely unrecoverable and will cause more investors to sell their holdings.\n   3. The Supreme Court sent the case back to the lower courts, where they will have to prove any damages made by the recent ruling.\n2. Impacted Firms\n   1. Paulson & Co.\n   2. Pershing Square Capital Management\n   3. Fairholme Funds Inc.\n3. The ruling means President Biden will be able to get rid of Mark Calabria, the FHFA director.\n   1. Implications-Cause more instability on the secondary market for MBS (mortgage backed securities) and CMBS (commercial mortgage backed securities)\n4. Implications For MOASS\n   1. Collateral for over levered hedge funds, market makers, and other institutions involved in the reverse repo market have lost a significant amount of value.\n   2. Combination with recent rule changes may lead to margin calls and the inability to meet them with cash infusions.\n\nJust some initial thoughts. If anyone wants to expand on this and add their own view, I'd be interested to hear your take on all of this.",
    "title": "Fannie/Freddie Supreme Court Ruling Notes (Translated In Ape)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o6fmhy/fanniefreddie_supreme_court_ruling_notes/"
}