{
    "author": "broccaaa",
    "created_utc": 1621294207.0,
    "distinguished": null,
    "edited": 1621347796.0,
    "id": "nev6po",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nev6po",
    "num_comments": 162,
    "permalink": "/r/Superstonk/comments/nev6po/all_new_13f_filings_data_visualised_for_all_major/",
    "score": 1366,
    "selftext": "Edit: I posted this to make the data available to everyone and start discussions around the 13Fs. The reported numbers are a bit meh but I don't see this as being FUD. Despite some funds selling, price has been supported. SI% is still likely 200%+ but can't be seen in 13Fs. Shorts remain fukd.\n\nEdit2: Updated the figures to not use scientific notation for the numbers, now in millions of shares.\n\nEdit3: We now have data for Jane Street with massive increased put positions!! I also updated and improved clarity for all the figures.\n\nThis post takes the most recent 13F filings that were finally submitted today and compares them with the previous reported positions. I mostly focus on looking at changes for funds with large short positions (predominantly puts) but also include data in the plots for the long whales.\n\nThe new positions should be accurate up until March 31 2021 provided that the funds didn't fudge their filings expecting just a small 'cost of doing business' fine..[.](https://preview.redd.it/jbqrepkbwvz61.png?width=3364&format=png&auto=webp&s=16f28d7a1b11f318a520fb6221434451236ee9fa)\n\nI might have made some errors so let me know in the comments if I missed something.\n\n***Note: some funds have not yet filed their updated 13Fs***. I'll edit the post and figures once these filings become available.\n\n# Intro and what we're looking for 'aka' show me the PUTs\n\nMany DD posts have looked into different tricks to create naked shares using options. I previously wrote [a post describing the married put naked short selling trick](https://www.reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/) and [gathered as much data as I could to detect options fuckery in GME in 2021](https://www.reddit.com/r/Superstonk/comments/mvdgf5/the_naked_shorting_scam_in_numbers_ai_detection/).\n\nThe biggest evidence for naked short selling fuckery to my mind is the massive increase in open put interest at the end of Jan that coincides with decreases in reported short interest (SI%), FTDs and GME share price.\n\n[SI&#37; and FTDs decreased at the end of Jan 2021 as a massive increase on open interest occurred for GME puts. This is suggestive of naked short selling options fuckery.](https://preview.redd.it/jy1dfqamkpz61.png?width=4500&format=png&auto=webp&s=7dc9264c12190d89d469e4a237ff37376405e3d7)\n\nAt the end of march open interest for GME puts was 1.29 Million contracts. This equals the equivalent of 129 Million shares. I checked this in 2 separate sources just to be sure. We should see close to 129 million shares in puts listed in the new 13Fs.\n\n*So who dun goofed and bought all those puts??*\n\n# Major holdings for large short/long funds - Mar 31 2021\n\nHere I've selected any firm that has at least 500K shares or 300K worth of shares in put/call options in the new filings. Any fund that has a large short position in PUTs is labelled as potentially short although more digging would be required to confirm for some of the funds.\n\n&#x200B;\n\n[Positions for Funds with large holdings in puts, calls or shares.](https://preview.redd.it/e5dkghleqvz61.png?width=5322&format=png&auto=webp&s=d420bb529bdbf39fcd7091c1270acf00a827d471)\n\nA number of the large long position holders have sold their stake in GME over recent months. Blackrock and Vanguard still hold significant positions. On the short side we have a number of the usual suspects plus some new funds with large put positions.\n\n# Total shares, put and call positions in recent 13F filings\n\nThis is a simple sum of all the shares reported by funds in the last two 13F filings separated out into shares, put or call positions.\n\n[Total summed positions across all funds in recent 13F filings.](https://preview.redd.it/vxo08agjqvz61.png?width=2164&format=png&auto=webp&s=4daee5a1ba94eb1e1221e5eeb77358e437da5aac)\n\nWe only see 25 million shares in puts reported fo far in the 13F filings. ***Where are the other 100 Million that we know were held due to the open interest on March 31 2021??!?***\n\n# Large changes in positions from Dec 31 2020 to March 31 2021\n\nThis first plot show the positions for any fund with at least 500k shares or more than 300k shares in puts or calls at either time point.\n\n[13F large fund positions for GME for the last 2 quarters.](https://preview.redd.it/jbqrepkbwvz61.png?width=3364&format=png&auto=webp&s=16f28d7a1b11f318a520fb6221434451236ee9fa)\n\nWe can see that some of the funds with medium to large holdings in GME shares have sold their positions in the last months. The big positions of Blackrock, Vanguard and RC Ventures remain the same. Changes and put/call positions can be seen easily from the lower 2 plots.\n\nNote that Fidelity (*Fmr llc*) probably didn't sell their position. u/Rehypothecator pointed out that Fidelity likely still has a vast number of shares but moved them to their mutual funds meaning they are no longer reported in the 13Fs.\n\nThe next figure shows all fund positions with a change of at least +/- 300k shares in either shares, puts or calls between time points.\n\n[Position changes for all funds with a change of at least 300k shares in either of the position types.](https://preview.redd.it/1s0ps7utqvz61.png?width=4680&format=png&auto=webp&s=8d39021e5a0ecf950a6efac6078d40eeaeab664e)\n\n# Observations from different funds\n\n## Short funds\n\n***Citadel advisors llc*** Increased their put position by more than 1 million shares this quarter. Less than we might have thought but as you'll see down below they seem to be coordinating with other funds (e.g. *Imc-chicago*). Citadel report selling off all their shares and increasing their put and call holdings.\n\n***Susquehanna international group  llp*** similar situation to Citadel with more than 1 million new shares in puts, some additional call options and all of the shares they previously owned now sold.\n\n***Melvin capital management lp*** were the biggest GME losers in Jan. They reported 6 million shares in puts at the end of Dec 2020 suggesting a massive naked short position. Since then very little has been revealed about Melvin.\n\nEdit: Melvin requested special permission to not disclose some of their positions (from a useful comment below):\n\n>THIS FILING LISTS SECURITIES HOLDINGS REPORTED ON THE FORM 13F FILED ON FEBRUARY 16, 2021, PURSUANT TO A REQUEST FOR CONFIDENTIAL TREATMENT AND FOR WHICH CERTAIN HOLDINGS WERE VOLUNTARILY WITHDRAWN FROM THE CONFIDENTIAL TREATMENT REQUEST.  \n>  \n>[https://sec.report/Document/0000905718-21-000618/](https://sec.report/Document/0000905718-21-000618/)  \n>  \n>Published: 2021-04-28 17:15:15\n\n***Maplelane capital  llc*** was the second biggest loser to GME in January. They had a massive short position of 2 million shares held in puts at the end of 2020. In their new 13F they report that they sold all of their puts and now have zero exposure to GME.\n\n***Imc-chicago llc*** has a newly created options position with a massive 2 million shares in puts, 1 million shares in calls and zero actual GME shares. [***The designated market maker business of Imc-chicago llc is owned by Citadel after it was purchased at the end of 2020***](https://www.citadelsecurities.com/news/citadel-securities-expands-leading-dmm-business/). The change in position for this fund suggests that Citadel is using it as part of the naked shorting scam to hide FTDs and suppress price.\n\n***Wolverine trading  llc*** has a similar short position as before at the end of 2020 with almost 2 million shares in puts. Given the number of expiry dates with huge numbers of put open interest expiry it is very likely that *Wolverine trading  llc* opened up new contracts to maintain their short position. The below quote if from Lucy Komisar:\n\n>In 2004, when new Reg SHO rules were being considered, *Wolverine trading  llc* argued that market makers should not be required to cover shorts. It was adopted and known, after its author and prime proponent, as “The Madoff Exception.”  \n>  \n>Later legal cases revealed that *Goldman Sachs* wrote to *Wolverine trading  llc* saying, \"\\[W\\]e will let you fail.\" We will let you fail violates SEC rules; it’s illegal market manipulation. The email was obtained in discovery in 2011 in the Overstock legal case against conspiring broker-dealers. With the fraud impossible to refute, Goldman settled with Overstock for $20 million.\n\n***Goldman sachs group inc*** have been involved in multiple naked short selling law suits. Their new 13F filing shows that they sold most of their GME puts and shares but acquired about 30k more shares covered by call contracts.\n\n***Jane street group  llc*** reports a massive 2.5 million shares in puts increase and 2 million shares in calls increase. Jane street reports that they hold more puts than Citadel.\n\n***Ubs group ag*** have cut back from a position of 4 million shares in puts at the end of 2020 down to about 1 million at the end of March 2021. Their position was definitely suspicious before but it seems like they are reducing their exposure to GME quite significantly.\n\n***Citigroup inc*** had a large position in GME calls/puts at the end of 2020 but appears to have reduced their GME exposure since.\n\n***TACONIC CAPITAL ADVISORS LP*** now owns half a million shares in puts without holding any actual shares. [Senior management at the company have a number of strong ties with Citadel employees](https://relationshipscience.com/person/clay-calhoon-3905596).\n\n***PRELUDE CAPITAL MANAGEMENT, LLC*** sold all of their 10k GME shares but is now short and owns 1.3 million shares in puts.\n\n***NOMURA HOLDINGS INC***, ***BLUEFIN CAPITAL MANAGEMENT, LLC*** and ***CAPTION MANAGEMENT, LLC*** have each newly acquired approx. 200k shares in puts and 200k shares in calls. None of these funds have any meaningful amount of real shares. Possible married-put/reverse conversions here.\n\n***GROUP ONE TRADING, L.P.*** reduced their put position by approx. 1 million shares but remain short with 2.5 million shares in puts.\n\n***SESSA CAPITAL IM, L.P.*** has opened a new 1.8 million share put position. The have no shares or call options.\n\n## Long whales\n\nHere I'll just list the funds with with 200k shares or more. DFV whale kinda size or bigger.\n\n[Shares held and change in position for all funds with at least 300k in GME shares on March 31st 2021.](https://preview.redd.it/cvg4d183zuz61.png?width=784&format=png&auto=webp&s=b8dadb242fc92b31c897e59666c7829827c267fb)\n\n# Conclusions\n\nLooking through the 13Fs has been kinda odd. There were 130 Million shares in puts open on March 31st but only 30 Million reported in the 13Fs. Who else could have that many contracts if not the large funds reporting to the SEC?\n\nAside from that we did see a number of smaller long funds sell their GME stake in early 2021 but some others jumped in. Blockrock maintained their position. Vanguard added another 400k shares. u/Rehypothecator pointed out that Fidelity likely still has a vast number of shares but moved them to their [mutual funds meaning they are no longer reported in the 13Fs](https://i.imgur.com/3MaFVXC.jpg).\n\nThe number of short funds appears to have increased with some more players entering with big put positions. Melvin requested special confidential treatment for some of their positions to the SEC which could explain why we don't see anything for them. Jane Street bought more than 2.5 million more shares in puts. Prelude and Sessa have bought in with more than 1 million shares in puts a piece. Citadel and Susquehanna have very similar positions to before. However, the Citadel owned *Imc-chicago llc* has a newly created options position with a massive 2 million shares in puts and nothing else.\n\nDefinitely some interesting details in these new 13Fs but no obvious smoking gun yet. ***What happened to those extra 100 Million shares held in puts??***\n\nShorts didn't cover in Jan. Apes own the float.",
    "title": "All New 13F filings: data visualised for all major fund position changes and the new short players in GME",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nev6po/all_new_13f_filings_data_visualised_for_all_major/"
}