{
    "author": "triteacid",
    "created_utc": 1616320184.0,
    "distinguished": null,
    "edited": 1616337673.0,
    "id": "m9tdqs",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_m9tdqs",
    "num_comments": 29,
    "permalink": "/r/GME/comments/m9tdqs/on_friday_i_put_the_rest_of_my_cash_in_gme_the/",
    "score": 1924,
    "selftext": "Do you know the movies when the astronauts strap into their seats in the rockets and effectively become human cargo with very limited control over the situation. They trust the team on the ground, the technology and each other with their lives. The ride gets shaky and the G-force piles up on their way up. 🌙🚀\n\nI’ve had the weekend to reflect and distance myself a little from the super interesting week days of watching the stock price bounce around. Before Friday GME was already my largest position. On Friday I used the last of the cash I am willing to lose and bought all GME with it. Not talking exact positions to deny Melvin und Fuckadel intel. Like Alexis Goldstein hinted at. \n\nLady-Apes and Gentle-Apes, I am now strapped into the rocket and have mentally relinquished control in that I will not sell. Either it flies, or it crashes. \n\nI am now trusting the logic, the math, the DD I’ve scrutinized from our great Apes just like the astronauts do with the rocket-tech. \n\nI can not be shaken out of my investment. I confronted my fears and doubts with facts and numbers and set them aside, because I understood enough. Smooth brained Ape got a wrinkle in the process! It’s all the little fuck you money I have, my life continues ok if it might be gone, but I don’t think it will. \n\nThe doors of the rocket have closed. My eyes close in anticipation. It will be a bumpy ride, but I trust the rocket, because I understand enough of it. When does it lift of? No idea. It’s out of my hands, but it doesn’t matter.\n\nMelvin and Shitadel can hammer on the doors as  hard as they want to. I can’t hear them. The engines begin to rumble. Better get off the Launch Pad Ken. It gets a little hot there. 🔥 \n\nTLDR: Ape in Rocket. Ape like rocket, because ape read a lot of Rocket stuff. 🙌🏻🚀🙌🏻 Ape won’t exit, because he consciously closed the doors. 🙌🏻💎🙌🏻\n\nEdit: holy shit, I just got my first awards and many upvotes. Thanks guys and gals. It’s good to have people to share my thoughts and mindset with, and even better to get an approving nod back. Good stuff folks, I feel relaxed and ready for the next exciting week with GME! All the best from Germany! 🇩🇪 🦍\n\nEdit 2: experiencing this myself These last minutes I believe that this positive Feedback is a powerful support structure for us apes. The information value with all the DD here is extremely high and powerful. I’m experiencing the psychological support frame aspect for the first time this sub provides. I underestimated it, it feels powerful to share and care. Damn. Fluffy stuff, but true. 🦍\n\nEdit 3: this is fascinating stuff shills. Thanks to you I could watch your pattern unfold. This post has been stuck between 160 and 180 upvotes for 15 minutes now. Every time I refresh the number changes by a few up, or a few down. Just like with the stock, you can not contain an upward trend. I made a new post about this Downvoting-pattern it’s really interesting to see and closely replicates the Gamestop stock price of recent weeks. \n\nEdit 4: I edited out a word. To be clear, I am an\nIndividual investor, who does his own research and likes the stock based on facts. So do the other people on this forum. Constructive criticism is of course always welcome. \n\nOh yeah: the necessary bullshit. This isn’t financial advice. I eat crayons sometimes. lol",
    "title": "On Friday I put the rest of my cash in GME. The rocket has become a state of mind for me, since then. 🙌🏻💎🚀",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/m9tdqs/on_friday_i_put_the_rest_of_my_cash_in_gme_the/"
}