{
    "author": "appleflaxen",
    "created_utc": 1623160608.0,
    "distinguished": null,
    "edited": 1623183282.0,
    "id": "nv4lmg",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_nv4lmg",
    "num_comments": 1065,
    "permalink": "/r/GME/comments/nv4lmg/remember_the_squeeze_has_not_started_until_the/",
    "score": 10681,
    "selftext": "The margin call on GME will result in forced liquidation of entire institutions. These results will cascade, and you know the rocket is lit when you see a 15+ percent drop in all the major indices.\n\nAnything prior to that point is a feint by Citadel and the hedgies.\n\n--------------\n\n**Edit**: comments have raised the legitimate point that this will be spun by the mainstream media as \"Apes were happy when the market crashed\". Let there be no mistake: **a market crash is a terrible outcome** that none of us should want. I certainly don't. \n\nBut not *wanting* it is different than not *expecting* it. And we should expect it, because hedge funds are allowed to take extremely leveraged positions. If they do this, de-leveraging will be catastrophic every time. \n\nAnd it's useful as a canary for when the hedgies are being liquidated. Are we happy the canary is dead? No! Canary is pretty birb. But you better believe I know what it means when it happens.\n\nThe only alternative is to accept the statement that \"we [HF] created a completely fucked system that you exposed by investing your capital; it was acceptable as long as you lost your money, but now that you've won, you need to walk away.\" \n\nWe tried that in 2008 with subprime mortgages, and all it did was set us up for this repeat. We need \n\n1) for long GME hodlers who lent a stock to short sale HF to be made whole. Brrrrrrr.\n\n2) a thorough investigation into whether and how many counterfeit shares were created, and how the fraud was executed\n\n3) criminal charges for any and all fraud that is found, so that wall street understands that committing fraud means jail time.\n\n--------------\n\n**Edit 2**: WTF do I do to protect myself? I have no idea; I don't give investment advice, I just like the stock. But my own investments that can't be put in individual stocks are sitting in 1-2% APR money market accounts, which are the most conservative types of investment and are unlikely to be affected by massive liquidations of bank assets (google \"breaking the buck 2008\" for what happened during the 2008 meltdown). The risk of using a MM in the short term (lost interest for ___ months) is dwarfed by the risk of a massive, systemic insolvency due to forced liquidation of institutional assets.",
    "title": "Remember: the squeeze has not started until the rest of the stock market collapses",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/GME/comments/nv4lmg/remember_the_squeeze_has_not_started_until_the/"
}