{
    "author": "_callmeatticus_",
    "created_utc": 1623194260.0,
    "distinguished": null,
    "edited": 1623212707.0,
    "id": "nvhh04",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_nvhh04",
    "num_comments": 219,
    "permalink": "/r/GME/comments/nvhh04/wtf_is_this_wendys_shit_now_am_i_the_only_one/",
    "score": 1365,
    "selftext": "GME is NOT a meme stock being pumped by a \"reddit army\", as the media  LOVES to say every goddamn chance they get. They are trying to minimize  the fact that ALL of this was brought on by a corrupt system that was  built to promise us wealth, but leave us with nothing. Then they try to  make US look like the bad guys so when the market crashes, they can  point the finger and say it's ALL because of reddit and this meme stock  nonsense. We need to be ready to defend ourselves, as we will get A LOT  of hate for this. Be sure that you can eloquently defend our entire ape  family and expose the ILLEGAL and UNETHICAL things Citadel was doing to  prove what REALLY caused all this. The greed and selfishness of the 1%.\n\nEdit: So I guess the Wendy’s thing came from algos scrubbing Reddit and thinking when we say “wen moon?” that we are talking about $WEN, ticker for Wendy’s. If this is true, they are far more disconnected than we ever imagined. \n\nA lot of commenters have said who gives af that they call them meme stocks, we just here for tendies. I do kind of agree, but I also think that the more they blame the reason that the market is becoming increasingly volatile on “Reddit armies pumping meme stocks”, it puts a worse and worse light on us. Eventually as the entire market crashes and GME moons, they will have made it look like it had nothing to do with greedy hedge fucks at all, and was 100% caused by a bunch of retail traders manipulating stock prices on Reddit. I stand by that apes being associated with meme stocks is a bad thing. They will keep spinning it until we are the evil ones and they were just trying to keep the stock markets “safe”.",
    "title": "WTF is this Wendys shit now? Am I the only one that is offended by the term \"meme stock\"?",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/GME/comments/nvhh04/wtf_is_this_wendys_shit_now_am_i_the_only_one/"
}