{
    "author": "kg9936",
    "created_utc": 1620919374.0,
    "distinguished": null,
    "edited": 1620943539.0,
    "id": "nbj59s",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_nbj59s",
    "num_comments": 699,
    "permalink": "/r/Superstonk/comments/nbj59s/we_need_a_catalyst_i_think_i_know_what_it_will_be/",
    "score": 7283,
    "selftext": "This may have been covered already, and/or I may be wrong, but I have a theory. I'm relying on this sub to poke holes in this theory or provide additional insight.\n\nGameStop's moon tweet (below) has a pretty interesting element to it. The GameStop logo... It's GS not GameStop. They created **(edited, ffs)** this image which means they had control over every detail. I've done some searching and I can't find that GS logo anywhere on any official GameStop branding.\n\nWhy did they go with GS instead of their corporate logo? There's certainly enough room on the sleeve to use their corporate logo.\n\n**I think they are going to rebrand**. Now changing a logo in itself doesn't mean anything. BUT, if the logo change comes with an official name change (GS, Corp., for example), then this would cause a change in CUSIP number.\n\n\"It is my understanding that the mechanics of the CUSIP change (with name change) would effectively **prevent trading shares of the old CUSIP # and would create an entirely new set of shares through the DTC**. By doing this, the DTC is forced to account for ALL of the old shares exchanged for the new shares. **Without the name change, the old shares would simply be renamed. With the name change, they are physically exchanged which will isolate phantom shares and force covering.**\" ^(sourced)\n\nIs this what RC is planning? If so, this could be the catalyst we need...\n\n&#x200B;\n\nEdit: they did not create the image itself, but they did edit it. And they edited it with a logo that I haven't previously seen and cannot find anywhere else.\n\nEdit 2: did not site source for my confirmation bias on legal name change / CUSIP # implications. Yes, copied and pasted. The facts remain the same though.\n\n[https://investorshub.advfn.com/boards/read\\_msg.aspx?message\\_id=82107281](https://investorshub.advfn.com/boards/read_msg.aspx?message_id=82107281) ^(source)\n\nEdit 3: I appreciate all the feedback, both positive and critical. I didn't expect this to gain this much traction. One piece I want to elaborate on is the rebranding. **Whether they decide to rebrand or not, they may make the legal name change while keeping GameStop as their trade name (DBA).** So there is merit to the point that they may not actually rebrand, but changing their legal name would require a change in CUSIP # which could be a catalyst. \n\nHave some rockets  🚀 🚀 🚀 🚀 🚀\n\n&#x200B;\n\nhttps://preview.redd.it/cpjvrnrv3wy61.png?width=2359&format=png&auto=webp&s=433b0a216c4684629c57faff509718ae0db338eb",
    "title": "We need a catalyst. I think I know what it will be.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nbj59s/we_need_a_catalyst_i_think_i_know_what_it_will_be/"
}