{
    "author": "Kruzenstern",
    "created_utc": 1622490511.0,
    "distinguished": null,
    "edited": false,
    "id": "npbprd",
    "text_only": true,
    "flair_text": "𝗗𝗶𝘀𝗰𝘂𝘀𝘀𝗶𝗼𝗻",
    "name": "t3_npbprd",
    "num_comments": 125,
    "permalink": "/r/DDintoGME/comments/npbprd/the_price_of_gme_since_february_is_completely/",
    "score": 822,
    "selftext": "The following is a prediction by [u/RocketApes](https://www.reddit.com/user/RocketApes/), posted [here in r/Superstonk](https://www.reddit.com/r/Superstonk/comments/np9a0k/the_price_of_gme_since_february_is_completely/). He asked me to post it here since his karma count is too low to do it himself. Apparently he devised a model that can predict the GME price movement. All questions should be directed to him.\n\n\\-------------------------------------------------------------------------------------------------------------------------------------------------\n\nLAPEies and GAPElemen,\n\n***I present you the final (?) solution to the GME price riddle since February***. Been leveling down this game and I stand on the shoulder of giants to finally solve it.\n\nAs explained to you in my [***last*** posting](https://www.reddit.com/r/Superstonk/comments/noih5m/i_successfully_forecasted_gme_closing_prices_for/), I developed a mathematical model to predict GME prive movements which has proven (to my big surprise!) almost completely accurate in the last two weeks (I have witnesses ;)).\n\n**You have convinced me to not share the model or any future predictions with you (and therefore the whole world). Instead I will post it with a different account in an obscure subreddit (either** [r/kennysbuttplugs](https://www.reddit.com/r/kennysbuttplugs/) **or** [r/whenIwasAboyinbulgaria](https://www.reddit.com/r/whenIwasAboyinbulgaria/)\\*\\*) and show the results to you end of the week with timestamps.\\*\\*\n\nAnyways, I figured out that I can give you the driving forces behind GMEs price development without giving away the details to actually make predictions based on it.\n\n**My first and important result is: GME stock price is extremely different from \"normal\" stock price developments and is totally and utterly manipulated (come on, a small ape with a computer can predict it?)**\n\nWith a technique called factor analysis I can extract the strength of each factor in driving GME´s price (adds up to 100% naturally):\n\n&#x200B;\n\n[ Influence factors on GME price](https://preview.redd.it/fqv2bmgsei271.png?width=786&format=png&auto=webp&s=c885b3c0ad661dac51c7636c93c85727b10fc575)\n\nThese factors, along with the \"unknown\" factors, for which my model cannot get an explanation (34%, almost nothing for models like these), can be summed up as follows:\n\n&#x200B;\n\n[The five pillars of GME price making](https://preview.redd.it/8m0xbe5uei271.png?width=808&format=png&auto=webp&s=e3b65759dc6bb37a110fd16dfb777a485410936e)\n\n&#x200B;\n\n1. **Technical factors like RSI**: These factors contribute little influence to the GME price, although some more influence like Elliott wave factors may be hidden in the unknown factors\n2. **SI-Reporting:** Based on [this](https://www.reddit.com/r/Superstonk/comments/nc1lny/ive_estimated_the_current_si_based_on_the_si/) DD by [/u/criand](https://www.reddit.com/u/criand/), Hedgies try to supress the SI interest by covering right before the SI settlement days which can be found [here](https://www.finra.org/filing-reporting/regulatory-filing-systems/short-interest) (basically every 14 days). Afterwards they short the fuck out of GME again.\n3. **FTD Cycle:** As pointed out by various posters here, every 21 days, FTD are \"renewed\", the can is kicked further down the road. This fact is INCREDIBLY visible in the data and ALONE accountable for 20% of the GME prive movement. **Fun Fact you should know: Last week, SI-Reporting and FTD Cycle (T+21) were on two consecutive days (Tuesday 05/25 and Wednesday 05/26) - this is the main reason the price exploded (plus a little FOMO). Sorry to disappoint you, nothing substantial happened. The price explosion was predicted by my model (**[proof](https://www.reddit.com/r/Spielstopp/comments/ngyrai/langfristige_kursvorhersage_von_spielstopp/)**)**\n4. **Movement with the market:** Less visible then with other stocks, but still significant:Gme moves with the market. On days without special occurances like SI Reporting or T+21, we have a **positive beta.** Market movement is accountable for 25% on average but for > 50% on normal days\n5. **Unknown factors:** \"Normal\" price drivers like Whales, Retail trading, unknown technical factors and - theoretically - shorts covering are included here. 33% influence is very little, **most of the GME price movement is completely deterministic aka manipulated.**\n\n**As my model cannot predict massive short covering or predict the MOASS, any deviation of the price from my model could show something is brewing. But until now, there are none.**\n\n**Shorts have not yet covered, they are just kicking the can down the road. I can prove it mathematically. Apes buy and hold.**\n\nIf interested, I can share the model and predictions with any mod or qualified person for review. I would love to get input and improve the model (or have someone smarter than me improve it) and question my motives but understand that it might not be strategically wise to publically share it.\n\n*That being sad, I am just playing around with numbers and am by no means any advisor for anything (says my wifes boyfriend).*",
    "title": "The price of GME since February is completely predictable: \"Kicking the can down the road\" mathematically deciphered. See what determines GMEs price. Superstonk DD by u/RocketApes",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/DDintoGME/comments/npbprd/the_price_of_gme_since_february_is_completely/"
}