{
    "author": "Parsnip",
    "created_utc": 1626414901.0,
    "distinguished": null,
    "edited": 1626422403.0,
    "id": "olaqr1",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_olaqr1",
    "num_comments": 422,
    "permalink": "/r/Superstonk/comments/olaqr1/diamantenhände_german_market_is_open/",
    "score": 3916,
    "selftext": "Guten Morgen to all of you Great Apes across the world! 👋🦍\n\nThis week has been quite the journey in GME, and as we enter the final day of trading this week let's take a moment and appreciate all that has happened. Last Friday had the lowest volume in a year, and Monday had basically identical volume - both were very much sideways days. The FUD machine kicked into high gear on Tuesday, shorting aggressively and spreading FUD copypasta on any website that would take their money. This continued through until Thursday morning, when Apes showed the strength of our Diamantenhände and bought at a 7:1 ratio. Now we've seen the FTD numbers for June, and it is *astonishing* how deep the pit that SHFs have dug themselves into is. Today there are over *436,000* Put contracts expiring OTM. The pressure is increasing, but our Diamantenhände are made to HODL mightily.\n\nToday is Friday, July 16th and you know what that means! Join apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- ⬜ 120 minutes in: **$174.48 / 147,82 €**  *(volume: 2372)*\r\n- 🟥 115 minutes in: $174.48 / 147,82 €  *(volume: 2307)*\r\n- 🟩 110 minutes in: $174.51 / 147,85 €  *(volume: 2302)*\r\n- 🟩 105 minutes in: $174.45 / 147,80 €  *(volume: 2300)*\r\n- 🟥 100 minutes in: $174.21 / 147,60 €  *(volume: 2120)*\r\n- 🟩 95 minutes in: $174.98 / 148,25 €  *(volume: 2037)*\r\n- 🟥 90 minutes in: $174.86 / 148,15 €  *(volume: 1736)*\r\n- 🟩 85 minutes in: $174.92 / 148,20 €  *(volume: 1614)*\r\n- 🟥 80 minutes in: $174.21 / 147,60 €  *(volume: 1519)*\r\n- 🟩 75 minutes in: $175.31 / 148,52 €  *(volume: 1280)*\r\n- 🟩 70 minutes in: $174.77 / 148,07 €  *(volume: 1008)*\r\n- 🟩 65 minutes in: $174.27 / 147,65 €  *(volume: 856)*\r\n- 🟩 60 minutes in: $174.15 / 147,55 €  *(volume: 683)*\r\n- 🟩 55 minutes in: $173.45 / 146,95 €  *(volume: 652)*\r\n- ⬜ 50 minutes in: $172.94 / 146,52 €  *(volume: 609)*\r\n- 🟩 45 minutes in: $172.94 / 146,52 €  *(volume: 549)*\r\n- 🟩 40 minutes in: $172.53 / 146,18 €  *(volume: 520)*\r\n- 🟩 35 minutes in: $172.33 / 146,00 €  *(volume: 483)*\r\n- 🟩 30 minutes in: $172.24 / 145,93 €  *(volume: 475)*\r\n- 🟩 25 minutes in: $172.21 / 145,90 €  *(volume: 430)*\r\n- 🟩 20 minutes in: $172.12 / 145,82 €  *(volume: 380)*\r\n- 🟩 15 minutes in: $171.50 / 145,30 €  *(volume: 208)*\r\n- 🟥 10 minutes in: $171.44 / 145,25 €  *(volume: 198)*\r\n- 🟩 5 minutes in: $171.47 / 145,28 €  *(volume: 191)*\r\n- 🟩 0 minutes in: $171.44 / 145,25 €  *(volume: 137)*\r\n- 🟥 US close price: $166.82 / 141,34 €   *($172.00 / 145,72 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from a single German exchange and converting to USD. Today's euro -> USD conversion ratio is 1.18031007. There are occasionally small differences in price that are below the rounding error to two decimal places, which can lead to colorful boxes without obvious price change. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler. I also am worried, as I have tried to make contact many times and haven't received a direct response. Nearly three weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the originator of the series. I've been serving as guest-host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/olaqr1/diamantenhände_german_market_is_open/"
}