{
    "author": "Green8Dreamer",
    "created_utc": 1626496223.0,
    "distinguished": null,
    "edited": 1626584964.0,
    "id": "olxepi",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_olxepi",
    "num_comments": 659,
    "permalink": "/r/Superstonk/comments/olxepi/gamestop_is_hiring_a_new_director_of_sec_and/",
    "score": 16181,
    "selftext": "Amid all the mod drama, dates hype and other distractions, I guess no one has noticed that [one of GameStop's most interesting new job postings is for a \"Director of SEC and Financial Reporting](https://www.linkedin.com/jobs/view/director-sec-and-financial-reporting-at-gamestop-2615517946/),\" which could indicate that GameStop is about to get a lot more serious about SEC engagement and shareholder protection by devoting an entire full-time $100-150k position to the responsibility.\n\nThe new hire will be responsible for monitoring SEC developments to identify and document the potential impact of new pronouncements or other authoritative guidance and manage the implementation of the related disclosure requirements. Most intriguingly, the position will oversee \"the equity process including tasks related to stock-based compensation, equity rollforward, shares outstanding, calculation of basic/diluted EPS, including an evaluation of the dilutive impact of equity-based awards with performance conditions.\"\n\nThe inclusion of \"shares outstanding\" in the job description is probably routine but might also be interpreted to imply an upcoming effort to reign in or otherwise grapple with the problem of naked shorts, FTDs, etc. In addition, calculation of basic/diluted EPS (Earnings Per Share) is directly related to potential issuance of shareholder dividends and/or a merger, as discussed below.\n\n[The Balance explains](https://www.thebalance.com/basic-vs-diluted-eps-357566)...What are Basic and Diluted Earnings per Share?\n\n🚀  \"When you dive into the income statement (also known as the company's \"profit and loss statement\"), you have to do it on two levels.\n\n* First, look at the entire business: How profitable is the company as a whole?\n* Second, examine the profits per share: Publicly traded companies are cut up into individual pieces or \"shares.\" Each of those shares represents part of the overall ownership pie. How much of the after-tax income is each piece of the company entitled to receive? \n\n🚀  Basic earnings per share is a company's net income, minus cumulative preferred **dividends**, divided by the number of common outstanding shares. Diluted earnings per share represent the company's net income minus preferred dividends, divided by the total of the weighted average number of shares and other dilutive securities.\n\n🚀  To an investor who is looking for **dividends**, the second figure is what counts. A company might create more profit each year but give little of that profit to the shareholders per share. That is not good for a shareholder who invests for dividends, but it might be good for someone who looks for rising share values.\n\n🚀  Profits get lost on their way to shareholders (diluted) for many reasons. For instance, a **merger** may result in new shares being issued; employees may have stock options with vesting periods that are ending; there may be securities such as warrants or convertible preferred stock issued that dilute a stock.\"\n\n[This other blog further explains](https://businessdegrees.uab.edu/blog/basic-eps-vs-diluted-eps/) \"earnings per share (EPS) is a measure of a company’s profitability and, by extension, a key indicator of its overall financial performance. In its most fundamental form (basic EPS), it indicates how much profit is assigned to each share of its common stock, which is valuable information for the firm’s investors.\n\n🚀  A high EPS generally indicates that the company has the money either to pay out via **dividends** or reinvest in the business itself, whereas low EPS implies the opposite. Accordingly, how a company’s reported EPS squares with capital market expectations can cause significant fluctuations in its stock price.\n\n🚀  In addition to basic EPS, there is also diluted EPS. This measure accounts for any convertible securities — such as employee stock options, convertible debt, convertible preferred shares, and warrants — that could be exercised, thereby diluting the EPS figure. Note that diluted EPS is by definition a theoretical figure, since it assumes something that hasn’t happened yet.\n\n**Basic vs. diluted EPS, explained**\n\n🚀  The formula for basic EPS is relatively straightforward. An accountant will subtract the company’s dividends for preferred stock from its net income, then divide that number by the weighted average of the common shares outstanding over the applicable accounting period. In calculating this weighted average, accountants must factor in any stock splits, stock dividends, share repurchases (also known as stock buybacks), and shares issued.\n\n🚀  The basic EPS figure is in theory a great indicator of a company’s financial health and stock price. Indeed, high EPS implies that it is a worthwhile investment. However, there are some distinct limitations to EPS:\n\n* The existence of stock buybacks — which have surged since the 1980s — means that a company can reduce its total number of shares outstanding without actually increasing its net income, leading to a deceptively high EPS.\n* **Mergers** and acquisitions can distort EPS.\n* EPS does not provide any direct indication of a company’s debt position or financial leverage, two figures that any informed investor will want to know about. Plus, debt might be issued for buybacks.\n* Any adjustments in a company’s accounting policy — note that generally accepted accounting principles (GAAP) are not law — can result in changes in EPS.\n* EPS does not reveal how much capital was needed to generate the figure in question. In other words, two companies could have identical EPS numbers but radically different amounts of capital used, meaning that one made much better use of its resources.\n\n🚀  Now let’s turn to diluted EPS. The formula is dividends for preferred stock subtracted from net income, divided by the sum of the weighted average of shares outstanding and the impact of all dilutive securities, including convertible shares, warrants, and stock options. As a result, diluted EPS is lower than EPS.\n\n🚀  Diluted EPS can be complicated to calculate. For starters, an accountant would need to determine what it would cost to exercise the company’s issued options, based on the strike (exercise) price of the shares in question multiplied by the total number of options.\n\n🚀  That figure would then be divided by the current market price of the stock, which would yield the number of shares that could be purchased with the value of the exercised options. Finally, subtracting that figure from the sum of the outstanding shares would provide the number of excess shares necessary for meeting the company’s obligations.\"\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀\n\nTL;DR: GameStop is hiring a new Director of SEC and Financial Reporting who will broadly deal with and oversee many aspects of $GME stock of concern to shareholders. This is a high-level position with a salary up to $150k. It's super bullish for shareholders because it means that a Certified Public Accountant with deep experience will be working full-time on SEC issues and the equity process.\n\nEdit 1: Many commenters are expressing that this is a \"normal\" job position at many public corporations. This is definitely true. You can search the web and find a bunch of similar job descriptions at other companies. The relevant question is why GME needs to hire a Director of SEC and Financial Reporting, at this point in time, and how long and why the position has been vacant. This is pure speculation on my part but I have a hunch that GME hasn't had a dedicated individual in this position for a while, and the role of SEC reporting has been carried out recently by a team led by Chief Accounting  Officer Diana Jajeh. Her bio on GameStop's website states, \"Under her leadership, Diana and her team continue to enhance the organization’s global capabilities and service offerings in the areas of governance and compliance, accounting advisory, SEC reporting, tax planning strategies, treasury operations and capital planning and process improvements and system implementation.\" The last record I could find of someone filling a Director of Financial Reporting position at GameStop is an individual who was in this position for 3 years and 9 months until April 2020, according to his LinkedIn profile. Given the financial challenges GameStop was going through in 2020, the position may have been vacant for over a year as a money-saving measure, with its responsibilities assumed by others in the organization. The old job title was Director of Financial Reporting; the new title is Director of SEC and Financial Reporting. The new position is one of the first high-level jobs that GME advertised after raising $1.1 billion from the mid-June 2021 share offering. It wasn't my intention to imply that this sort of position is unique to GameStop, but I do think it's great news (and bullish) that this position is a priority now and will soon be filled. It's going to give GameStop extra firepower dealing with SEC and equity issues at a very pivotal juncture in the company's transformation with shareholders eagerly awaiting progress.\n\nEdit 2: I think it's super freaking awesome that this post resulted in MORE THAN QUADRUPLING (so far) the number of applicants for this position via LinkedIn! When I first posted, only 2 people had applied for the job via LinkedIn. Now with all of the attention from SuperStonk and other subs, in less than 24 hours the number of applicants via LinkedIn has gone up to 9! This means there is a real chance that an ape could be hired as GameStop's next Director of SEC and Financial Reporting. How cool would that be? Good luck to all of the ape-plicants, I hope one of you gets it! \n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀",
    "title": "GameStop is hiring a new Director of SEC and Financial Reporting who will oversee \"the equity process including tasks related to stock-based compensation, equity rollforward, shares outstanding, calculation of basic/diluted EPS,\" etc. Bullish!",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/olxepi/gamestop_is_hiring_a_new_director_of_sec_and/"
}