{
    "author": "inverseyourself",
    "created_utc": 1618527113.0,
    "distinguished": null,
    "edited": 1618548016.0,
    "id": "mrq5pq",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mrq5pq",
    "num_comments": 934,
    "permalink": "/r/Superstonk/comments/mrq5pq/attention_implicit_volatility_on_800_cs_set_to/",
    "score": 4438,
    "selftext": "**Edit 1: At the risk of exciting people for no reason, I certainly don't want to set expectations and crash them like how it is happened so many times. Please, instead, see this as evidence that there is something** ***very*** **wrong about GME.**\n\n**Edit 2: The title should be IMPLIED volatility. Sorry, folks. Was just trying to get this out fast.**\n\n**Edit 3: Some folks are saying this is IV counteracting theta decay. I don't think this explains the .1/.2% jumps I'm seeing nor does it explain that it'll be likely 2000% tomorrow morning at this rate. The inputs in the IV formula must still be massive. Why is this trivial? Or... is it?...**\n\n**Edit 4: By popular request, the IV is now 1,238%.** \n\nIV is the highest I've ever seen on any option, and rising faster than on any option I've seen.\n\nThat means, generally speaking, the market is anticipating a 2000% move in GME by April 16th, tomorrow up or down. How the fuck is this possible - yet trading sideways all week.\n\nObviously, this is absurd. But this is NOT a prediction. THIS IS DATA; DATA DOES NOT LIE UNLESS IT IS FRADULUENT. Someone with a strong background in options/IV should help explain this. The most bizarre thing out of all of this is that GME does nothing tomorrow with a 2000% IV or higher on its highest OTM contract. Given what we've seen, it's possible it does nothing. But, I would highly question if that flat movement is authentic.\n\nThe last time IV reached 1000% on GME options was back in January (IV was already in the 900's today for the 800 C's). See here: [https://blog.orats.com/1000-implied-volatility-in-gamestop.-what-does-it-mean](https://blog.orats.com/1000-implied-volatility-in-gamestop.-what-does-it-mean).\n\n*I also want to note that I saw IV rise in GME AH last weekend. It jumped from 400 to 600%. I also want to point out I saw IV rise in other options too on different securities, but it was incremental compared to GME in the AH. So there is nothing inherently unusual about an AH IV rise. It is, rather, the PACE at which this is occurring.*\n\nI'm seeing this on Robinhood.\n\nDefinition of IV: \"Implied volatility is a metric that captures the market's view of the likelihood of changes in a given security's price. Investors can use it to project future moves and supply and demand, and often employ it to price options contracts.\"  Visit: [https://www.investopedia.com/terms/i/iv.asp#:\\~:text=Implied%20volatility%20is%20the%20market's,higher%20premiums%20and%20vice%20versa](https://www.investopedia.com/terms/i/iv.asp#:~:text=Implied%20volatility%20is%20the%20market's,higher%20premiums%20and%20vice%20versa).\n\nMore on whether time to expiry affects IV; overall, it does, but it should negatively:\n\n\"Another premium influencing factor is the time value of the option, or the amount of time until the option expires. A short-dated option often results in low implied volatility, whereas a long-dated option tends to result in high implied volatility. The difference lays in the amount of time left before the expiration of the contract. Since there is a lengthier time, the price has an extended period to move into a favorable price level in comparison to the [strike price](https://www.investopedia.com/terms/s/strikeprice.asp).\"\n\n[https://www.investopedia.com/terms/i/iv.asp](https://www.investopedia.com/terms/i/iv.asp)\n\n\"Another factor that impacts the volatility rating of an option is the time left to the [expiration of that option](https://optionstrategiesinsider.com/blog/understanding-an-options-expiration-date/). If there isn’t enough time left before expiry, then the implied volatility will be low. In contrast, more time means a higher probability of a fluctuation in the option’s price.\"\n\n[https://optionstrategiesinsider.com/blog/what-is-implied-volatility-and-why-is-it-important-in-option-trading/](https://optionstrategiesinsider.com/blog/what-is-implied-volatility-and-why-is-it-important-in-option-trading/)\n\n[5 seconds later....](https://preview.redd.it/n88eezby3ft61.png?width=784&format=png&auto=webp&s=2f7b216a282fb4789e6261a93b18943fa2851fae)\n\nhttps://preview.redd.it/rszjpwzx3ft61.png?width=687&format=png&auto=webp&s=215506d1d6512ec3ba2bed550f3ec28cbfa69c5b\n\n**That's .10% increase in 5 seconds.**\n\nNot financial advice!\n\nTop Critique:\n\n\"***Nothing is changing. This is just theta decay.***\n\n*You have to remember that IV is a dependent variable, not an input. So its backed into based on the price (and black Scholes formula).*\n\n*What you’re likely seeing is the impact of theta decay. Price stays the same but theta is decreasing, so in order for it to stay at that same price (since markets aren’t open) the IV must be going up.*\n\n*This is only happening because market isn’t open and price isn’t changing with theta decay.*\n\n*Nothing to see here.\"*\n\nu/[NewHome\\_PaleRedDot](https://www.reddit.com/user/NewHome_PaleRedDot/)\n\nSee WardenElite's comment below.\n\n&#x200B;",
    "title": "ATTENTION: Implicit Volatility on 800 C's set to expire TOMORROW is rising .02/.03 a second",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/Superstonk/comments/mrq5pq/attention_implicit_volatility_on_800_cs_set_to/"
}