{
    "author": "powertyisfromgun",
    "created_utc": 1618521786.0,
    "distinguished": null,
    "edited": 1618522075.0,
    "id": "mroh7q",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mroh7q",
    "num_comments": 169,
    "permalink": "/r/Superstonk/comments/mroh7q/it_will_take_days_to_get_to_the_top_of_the_rocket/",
    "score": 1703,
    "selftext": "So there is a whole hour of work that I have to do after market close. And since I couldn't watch the ticker anymore and ran out of crayons I started wondering what to expect once the rocket launched.\nEveryone is saying the rocket will take days. But how many days is it?\n\nAlso a lot of people may be afraid of missing the rocket.\nAnd I have seen a lot of dd recently about the 5-10 minute break strategy. (Which I think is brilliant)\n\nThis is not advice. I'm an idiot.\n\n\n\nSo the market will freeze at a 10% increase in price. And it will freeze for 5-15 minutes.\n\nSo if the rocket started at the 4/15/21 closing price of $156.44 and did nothing but go up, without any dips how long would it take?\n\nSo lets say it goes up 10% and there is a freeze, then it goes up another 10% and freezes again.\n\nIt will take 117 10% increments like that to get to my rock bottom floor of $10 mil a share.\n\nAssuming it takes 1 minute to increase 10% (just because that is what my candles are set at and I love those crayons)\n\nSo if they only froze for 5 minute intervals the whole way up:\n\n117×6 (1 min of shreck dick and 5 min of freeze) = 702 minutes.\nThat's 11.7 hours, or 1.8 trading days.\n\nWhat if they froze for 10 minutes each?\n\n117x11=1287 min. Or 21.5 hrs. Or 3.3 trading days.\n\nHow about freezing for the maximum of 15 minutes each time?\n\n117×16=1872 min. 31.2 hrs. 4.8 trading days.\n\nWhat if your floor is $100 mil a share?\n\n$100 mil a share is 141 10% increases from our current $156.44 closing price.\n\nSo at\n\n5 min freezes:\n846 min, 14.1 hrs, 2.2 trading days\n\n10 min freezes:\n1551 min, 25.9 hrs, 4 trading days\n\n15 min freezes:\n2256 min, 37.6 hrs, 5.8 trading days\n\n\nI wanted to know these and thought others might as well. I know it's not as impressive as other dds.\n\nBut my take away from this is that it will not require any immediate or fast action.\nWhen the rocket launches take a walk for 5-10 min. Eat some crayons. Look at memes. Whatever you want.  There is no rush.  Just relax and hodl to the top.\n\nA lot of people are getting impatient for the rocket to start. I am one of those people. I am absolutely jacked to the tits!\nBut the rocket will happen when it happens. And even then tendies are DAYS away. \nThese calculations aren't even taking into consideration any slowdowns or valleys there will be along the way.\n\nJust be patient, relax, drink water, think before you do anything, and I will see you on the moon.\n\nTA;DR: It will take days to reach the moon. There is no rush. Relax and enjoy the ride.\n\nEdit: I don't know how to format this better.\nSorry.",
    "title": "It will take days to get to the top of the rocket. But how many days should you expect? I did some calculations that may help.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/mroh7q/it_will_take_days_to_get_to_the_top_of_the_rocket/"
}