{
    "author": "thisisafakestory",
    "created_utc": 1627969933.0,
    "distinguished": null,
    "edited": 1628009241.0,
    "id": "owx3ke",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_owx3ke",
    "num_comments": 150,
    "permalink": "/r/GMEJungle/comments/owx3ke/retail_buying_affects_price/",
    "score": 1432,
    "selftext": "I strongly believe the best FUD and shill tactic they have deployed is convincing so many of us that we do not make an impact on the price, making us believe there is no point to buying more to help the stock. Or making some think paperhanding a little doesn't matter because it wouldn't hurt the price anyway since it's manipulated so much. \n\nEVERY PURCHASE MAKES A DIFFERENCE. It may be displaced with more shorting, or the price pressure may be kicked down the road via dark pools and reporting fuckery through ETFs, but don't be confused about this, eventually it does have an impact! The buying pressure of all us individuals (separately) is what got us to this point in the first place, do not let them convince us otherwise. \n\nSo the price is manipulated? I personally want to MAKE them HAVE to manipulate even more by putting buy pressure.\n\nI BUY and hold.\n\nPlease, let this idea be spread. I implore you to reverse this rediculous notion that retail doesn't have an impact. Spread it to the other subs, I don't have the karma for it. Please!\n\nEdit: So the exact post that spread this FUD was about the Odd lots discussion. [You guys are purporting a discussion as fact](https://www.reddit.com/r/GMEJungle/comments/owx3ke/retail_buying_affects_price/h7jtejy?utm_medium=android_app&utm_source=share&context=3). [See dlauer comment here.](https://www.reddit.com/r/GMEJungle/comments/oq56lb/comment/h6a0khu/3).\n\nOdd lots discussion: https://www.reddit.com/r/GMEJungle/comments/oq56lb/comment/h6a0khu/\n\nIt is NOT a fact odd lots under 100 do not affect price, that's FUD.",
    "title": "Retail Buying Affects Price.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GMEJungle/comments/owx3ke/retail_buying_affects_price/"
}