{
    "author": "Parsnip",
    "created_utc": 1627365302.0,
    "distinguished": null,
    "edited": 1627372805.0,
    "id": "osh1f4",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_osh1f4",
    "num_comments": 256,
    "permalink": "/r/Superstonk/comments/osh1f4/diamantenhände_german_market_is_open/",
    "score": 3211,
    "selftext": "Guten Morgen to all of you Great Apes around the world! 👋🦍\n\nMonday was obviously a fantastic day to HODL GME, because *nobody* was selling. Volume was ultra-low all day, setting a new record-low, yet the price increased over $3. At this point, I think that Apes are locked into this waiting game, and it's up to our Diamantenhände to HODL mightily no matter what FUD they sling. While waiting can be difficult, it is the one thing that the short hedge funds cannot beat us at - every day they struggle to put off the MOASS for just one more day, and each day is one closer to the inevitable MOASS. Remember the thesis, remember the heaps of DD, and remember the Apes who are committed to this movement. Things feel ready to change, again, and one of these times they will not be able to contain it.\n\nToday is Tuesday, July 27th, and by now you know what that means! Join other apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟥 120 minutes in: **$181.11 / 153,65 €**  *(volume: 336)*\r\n- 🟥 115 minutes in: $181.99 / 154,40 €  *(volume: 336)*\r\n- 🟩 110 minutes in: $182.14 / 154,53 €  *(volume: 336)*\r\n- 🟥 105 minutes in: $181.90 / 154,32 €  *(volume: 334)*\r\n- 🟥 100 minutes in: $182.01 / 154,41 €  *(volume: 331)*\r\n- 🟩 95 minutes in: $182.65 / 154,96 €  *(volume: 326)*\r\n- 🟩 90 minutes in: $181.18 / 153,71 €  *(volume: 319)*\r\n- 🟥 85 minutes in: $180.90 / 153,48 €  *(volume: 296)*\r\n- 🟥 80 minutes in: $180.99 / 153,55 €  *(volume: 284)*\r\n- 🟥 75 minutes in: $183.27 / 155,49 €  *(volume: 115)*\r\n- 🟩 70 minutes in: $183.55 / 155,72 €  *(volume: 93)*\r\n- 🟩 65 minutes in: $183.54 / 155,71 €  *(volume: 76)*\r\n- 🟩 60 minutes in: $183.01 / 155,26 €  *(volume: 76)*\r\n- 🟩 55 minutes in: $182.96 / 155,23 €  *(volume: 75)*\r\n- 🟥 50 minutes in: $182.70 / 155,00 €  *(volume: 73)*\r\n- ⬜ 45 minutes in: $182.95 / 155,21 €  *(volume: 73)*\r\n- ⬜ 40 minutes in: $182.95 / 155,21 €  *(volume: 60)*\r\n- 🟥 35 minutes in: $182.95 / 155,21 €  *(volume: 44)*\r\n- ⬜ 30 minutes in: $182.98 / 155,24 €  *(volume: 41)*\r\n- 🟩 25 minutes in: $182.98 / 155,24 €  *(volume: 41)*\r\n- ⬜ 20 minutes in: $182.96 / 155,22 €  *(volume: 41)*\r\n- 🟥 15 minutes in: $182.96 / 155,22 €  *(volume: 20)*\r\n- 🟥 10 minutes in: $182.96 / 155,23 €  *(volume: 20)*\r\n- 🟩 5 minutes in: $182.99 / 155,25 €  *(volume: 10)*\r\n- 🟥 0 minutes in: $182.85 / 155,12 €  *(volume: 10)*\r\n- 🟩 US close price: $183.94 / 156,05 €   *($183.78 / 155,92 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.1787. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler, following their sudden disappearance after Memorial Day. I also am worried, as I had tried to make contact many times and never received a direct response. Four weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the curator of the series. I've been serving as host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/osh1f4/diamantenhände_german_market_is_open/"
}