{
    "author": "DoesHeLookLikeAFitch",
    "created_utc": 1622069571.0,
    "distinguished": null,
    "edited": false,
    "id": "nltppc",
    "text_only": true,
    "flair_id": "7fabe5b2-8cbd-11eb-968a-0eaf84b82885",
    "flair_text": "Shitpost 👾",
    "name": "t3_nltppc",
    "num_comments": 128,
    "permalink": "/r/Superstonk/comments/nltppc/citadelken_griffin_ruined_wall_streets_grand/",
    "score": 3246,
    "selftext": "Citadel is like the athlete in college that got caught roiding up. Now the entire team has to go get tested, and half of them are going to fail.\n\nWall Street has been so comfortable with their illegal activities since the inception of the US stock market. Everyone naked shorted, dark pooled, media manipulated, pump and dump, etc. You name it. If it’s illegal, they have done it.\n\nImagine all these hedge fucks sitting high on their piles of money, buying lambos and mansions and laughing and mocking the retail investors. All of a sudden, their overconfident, retarded, bully of a brother Shitadel decides to fuck with the entire system, keep doubling down on naked shorts, and now every tactic is blasted for everyone to see. \n\n6 months ago barely anyone knew about all the fuckery being pulled by Wall Street. And now, the whole world is well on their way to knowing what bs has been going on from the US stock market. It’s the end of an era for Wall Street hedge funds, banks, brokers. Beginning of a new era for retail traders.\n\nDon’t get me wrong, there is still much more reform needed to be done before I put any trust back into the US stock market. But all the DTCC rules being quickly passed, that’s a start. More rules will follow. Definitely stricter enforcement will follow (unless they want to see another consequential market crash). And retail investors (those that will keep investing even after the GME saga) will know exactly what to look out for.\n\nAnyways, just wanted to shitpost and revel in the irony of it all. Thanks Shitadel and friends.",
    "title": "Citadel/Ken Griffin ruined Wall Street’s grand comfortable lifestyle forever. They’re going up in flames, and their peers must fucking hate them with a passion right now",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nltppc/citadelken_griffin_ruined_wall_streets_grand/"
}