{
    "author": "akareil",
    "created_utc": 1626576433.0,
    "distinguished": null,
    "edited": 1626592563.0,
    "id": "omi52f",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_omi52f",
    "num_comments": 100,
    "permalink": "/r/DDintoGME/comments/omi52f/posted_with_permission_from_ugetitgot_final/",
    "score": 1213,
    "selftext": "Edit: Thanks for the awards, feels like cheating.\n\nCourtesy of u/Get-It-Got, here is the\n\n# Final Update of Google Consumer Survey *** N=2,200***; At LEAST 164MM $GME Shares in Hands of U.S. Retail; My Best Guesstimate For Total Shares Owned Globally — 531MM\n\n[**DD 👨‍🔬**](https://www.reddit.com/r/Superstonk/search?q=flair_name%3A%22DD%20%F0%9F%91%A8%E2%80%8D%F0%9F%94%AC%22&restrict_sr=1)\n\nHi Everyone,\n\nI'll try to keep this brief since most of you already know what this is all about. And of course, I'm not a financial advisor and nothing you are reading here is financial advice.\n\nIf you do not know what this is all about, your nearest rabbit hole can be found here: [https://www.reddit.com/r/Superstonk/comments/of9pys/google\\_consumer\\_survey\\_followup\\_1937\\_million/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/of9pys/google_consumer_survey_followup_1937_million/?utm_source=share&utm_medium=web2x&context=3)\n\nThe TL;DR: I used Google Consumer Survey to survey the U.S. population about their GameStop ownership. I used randomized, representative surveying which allows a researcher to extrapolate results to a broad population. In the case of GameStop ownership, this allows us to model some very interesting numbers that are tough to get at otherwise.\n\nIf you have any questions about methodology, sample size, survey biases ... anything along these lines, I invite you to check out this post with extensive discussion about all of these things: [https://www.reddit.com/r/Superstonk/comments/o2cnd4/using\\_randomized\\_representative\\_surveying\\_data\\_to/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/o2cnd4/using_randomized_representative_surveying_data_to/?utm_source=share&utm_medium=web2x&context=3)\n\nAlso, to be a transparent in the process as possible, you can look at the results for yourself here.NOTE: There are actually some very interesting tools that allow you to slice and dice the data if you want to know things like ownership by age, gender, etc.:\n\n[https://surveys.google.com/reporting/question?hl=en-US&survey=sv2uhkuhypyl6olmiokx2zzkma&question=1&raw=true&transpose=false&tab=chart&synonyms=true](https://surveys.google.com/reporting/question?hl=en-US&survey=sv2uhkuhypyl6olmiokx2zzkma&question=1&raw=true&transpose=false&tab=chart&synonyms=true)\n\n[https://surveys.google.com/reporting/question?hl=en-US&survey=gei6t23feekehqpuxr5woosr5a&question=1&raw=true&transpose=false&tab=chart&synonyms=true](https://surveys.google.com/reporting/question?hl=en-US&survey=gei6t23feekehqpuxr5woosr5a&question=1&raw=true&transpose=false&tab=chart&synonyms=true)\n\n[https://surveys.google.com/reporting/question?hl=en-US&survey=emu6442dcciv66jbwetrmxrea4&question=1&raw=true&transpose=false&tab=chart&synonyms=true](https://surveys.google.com/reporting/question?hl=en-US&survey=emu6442dcciv66jbwetrmxrea4&question=1&raw=true&transpose=false&tab=chart&synonyms=true)\n\nSo here we go ...\n\nThe big data set of 1,500 has finished! This gives us a whooping total of 2,200 samples for this research across three surveys. **Huge props to the individual who set up and paid for the 1,500 sample size! They wanted to remain anonymous, but they are a massive contributor to our collective search for the truth! Big kudos!**\n\nBefore I start, and since I know this question will come up ... yes, we can combine these three samples so long as we understand they took place during different times (which is important because market dynamics change \\[sometimes dramatically\\] over time). Furthermore, these samples were collected randomly and from a massive pool (tens of millions), and since a person can't be served the survey more than once in any instance, we can confidently combine these results knowing there's very little, if any, impact on the overall conclusions we can draw from this data.\n\nSo here's how things shook out:\n\n&#x200B;\n\nhttps://preview.redd.it/tcnoixkxvvb71.png?width=2684&format=png&auto=webp&s=eec994bc5ff83e99183fc212bd5764c39d389b24\n\nSo the first thing you're going to notice is the drop. The prior readout came in at 194MM, and this is down to 164MM, a drop of 15%. For this type of research, that's a big number. But the thing two things to consider are this:\n\n1 -- There is a margin of error in all this ... probably 2-3% based on the current sample size.\n\n2 -- More importantly, there are market dynamics at play here, which is why I included the charts.\n\nWe must also consider the wider context of this research (in terms of market dynamics), and I think the image below is worth considering.\n\n&#x200B;\n\nhttps://preview.redd.it/qano54jyvvb71.png?width=1692&format=png&auto=webp&s=297f1f76ff30dad0b6ae6eda3ae40aa4b1a01526\n\nCertainly there are a lot of diamond-handed apes out there, but there are still market dynamics at play. This was a bearish time to survey, and results bore that out as the % of paperhands increased, ownership % fell, and even avg. shares tanked.\n\nSo I don't think the drop is an indictment of the methodology or the platform. In fact, the drop makes a lot of sense. In other words, imagine if we surveyed again as we come out of this cup that's forming. Of course we'd expect these number to fluctuate up, and it wouldn't be surprising if the increases were tens of millions of shares.\n\nI think the other thing to consider is the overall economy. The further U.S. retail investors get away from there last big round of stimulus, the more likely people are putting their resources elsewhere, or even selling to cover shortfalls due to inflation, reduced benefits, etc.\n\nSomething New For This Final Update\n\nIn the past, I have struck strictly to the data in hand. If you've read my earlier posts, you'll see I've deliberately designed this research to be ULTRA conservative. In other words, I intentionally took a \"Tip of the Iceberg\" approach. I completely remove half of all coupled individuals to ensure shares would never be double counted. I capped the response buckets at 101 shares owned, essentially Thanos snapping every share held beyond 101. I took the most extreme approach I could to support the idea that the extrapolated number would be a bare minimum.\n\nWell, I'm curious about the total number of shares. I'm done surveying. So now it's time to make same guesstimates and worry less about being conservative, and worry more about trying to come up with a precise figure.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*Before the comments flood in, please note that everything beyond this point is based only in part on hard data, but also involves some best guess on my part. If you're not interested in best guess, just stick to the content above because what's below is speculative.\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**So to come up with this Guesstimate at the total number of GameStop shares in existence, we have to first address two critical biases ... the 101+ penalty and the couple household penalty.**\n\n{my computer is acting funny ... I'm going to post this, restart, and come back to finish this post through edit ... I have more to share so please bear with me}\n\nOkay, so for any Macbook Pro owners out there ... NO, YOU CANNOT JUST USE YOUR KIDS AMAZON KINDLE CORD EVEN THOUGH ITS A USB-C ... probably just fucked my battery, but whatever.\n\nOkay, so 101+ and coupled households. If I were trying to be more precise, here's what I'd do with these two.\n\nFirst, the 101+ folks:\n\n&#x200B;\n\nhttps://preview.redd.it/nu073f54wvb71.png?width=1468&format=png&auto=webp&s=46cbe06901ea29aae661e1f9569eead41806318d\n\nYeah, that's right. The average ... double it! Well, almost.\n\nThis might still be conservative, but it's almost certainly more precise. I mean, think about it ... if I had a room of a 123 random GME holders from all around the U.S., what are the chances of there being being 1 person with oh, I don't know, 4,000 shares? Even this one person showing up half the time would increase this average still a bit further. So there are still some things we just don't know, but we know we don't know them, which is good. So again, I have to cap this (1,000). Conservative? Maybe. Maybe not. It is what it is, and it gives us an average of 64.3 shares to work with.\n\nFor coupled households ... my instincts tells me there are plenty of households were both individuals in the couple own GME. What percent? I don't know, but 20-30% seems reasonable. I also believe there are couples who might respond as if an individual (i.e. a husband answers no because the shares are in his spouse's 401K, or a wife says yes, but responds indicating only the shares in her brokerage account, even though she in and her spouse own shares together in a separate account). There are a lot of different scenarios here, but the model I've been using take the most conservative approach by lopping the coupled households in half. So instead of that draconian of an approach, let's reduce the penalty down to 80% versus the full 100% penalty.\n\nWhen we do this, and we use the new average share calculation, we get something like this for our Guesstimate-based U.S. adult population extrapolation:\n\n&#x200B;\n\nhttps://preview.redd.it/jwpsm638wvb71.png?width=1390&format=png&auto=webp&s=171be029f3e4b1e6ea47dd47153b0bbaf8d5a470\n\nAnd then, we can use the above and start adding in everything else, like foreign retail investors, insiders, institutions, etc.\n\n&#x200B;\n\nhttps://preview.redd.it/h54w45r9wvb71.png?width=888&format=png&auto=webp&s=e0907f4ca4326b926d2bdcfb42a18e8b2ddf26d0\n\nSo to answer my big, red \"Have I missed anything?\" question ... there is one bucket totally missing (Family Firms), and also, I have no idea how accurate the Small Institutions number is since they don;t really report anywhere (that I know of). Also, it's always possible for even the big firms to report confidentially. So there that. I'm a little sketchy on the ETF numbers too after watching Charlie's Vids:\n\n[https://www.youtube.com/channel/UCIDaSv47u-Y8uXfbkmEGaxw](https://www.youtube.com/channel/UCIDaSv47u-Y8uXfbkmEGaxw)\n\nWhat about anything else? Shorts? Options obligations?\n\nAnyway, 521MM shares of GameStop is my best guess at this moment for universal ownership of $GME. Furthermore, I'm 99.99% certain retail (especially global retail) owns way, way more than what's being reported as the total Outstanding shares of GameStop. It's encouraging that the paper-handing has been so low overall, even during the toughest downturn since March.\n\nWhat do I think this all means?\n\nFor a long time I've stuck to the data and kept my wider opinions to myself. But I'm ready to share what I think this all means, and it means nothing has changed. It means we're looking at the exact same picture we've been looking at all along. So long as retail continues to buy and hodl (even just hodl at this point, although I'm still buying), this is the scene:\n\n&#x200B;\n\n[ Running and escaping are not the same thing. There literally is no escape from this based on the fact the market is a zero sum game. ](https://preview.redd.it/2ny5c32bwvb71.png?width=512&format=png&auto=webp&s=f0cdd9b37f4ab5d1c6e856b4089987def4796c5d)\n\nRunning and escaping are not the same thing. There literally is no escape from this based on the fact the market is a zero sum game.\n\nThe price of GameStop will continue to rise and fall. But as DFV pointed out, only up. From a TA standpoint, this has been exactly correct. What I see is a stock forming a massive bowl and building a massive amount of energy. A caldera perhaps.\n\nIn my mind, this whole saga can only end in one of a very few ways:\n\n**A Slow Burn**\n\nThink Tesla. GameStop keeps getting stronger. The rollercoaster keeps rolling, ever higher highs and higher lows on the monthly. A year or two from now, we're much higher than we are now, and the shorts still haven't closed.\n\n**A Fast Burn**\n\nThink Overstock. GameStop initiates some sort of scenario that necessitate a recall, or perhaps a novel dividend scheme that forces shorts, FTDs, and synthetics to all close. The squeeze is squoze in the way many of us envision it, with dramatic increases and rapid liquidations.\n\n**New DTCC Rules Do Their Thing**\n\nSlowly then all at once, the dominoes start to fall. Maybe it starts with a family firm, or a small hedge fund. This might play out over days, weeks, or months ... but basically, this would be a cascade of margin calls and liquidations, getting ever larger until the banks can no longer hide it.\n\n**Federal Indictments**\n\nWe do know there is an SEC investigation, but what if the FBI is already involved. If there is criminal behavior behind all this, there could be a negotiated deal of some sort, particularly if a large market maker is brought down by charges. I'm not sure what precedent exists for this scenario, but court proceedings, etc. would change things dramatically I assume.\n\nAt any rate, I know my strategy. It's to add shares using cash as I can afford them. It's to hodl. It's to shop at GameStop if and when I can. It's to share the GameStop story with whomever might be interested to hear about it. And it's to wait, knowing I'm holding shares of a company that I believe to be undervalued, even without the potential for a squeeze.\n\nIn a nutshell:\n\nhttps://preview.redd.it/cd6slrbdwvb71.png?width=3410&format=png&auto=webp&s=29454a3e1014673a0b6d3fe0306edec59dd2af82",
    "title": "Posted with permission from u/Get-It-Got. Final Update of Google Consumer Survey *** N=2,200***; At LEAST 164MM $GME Shares in Hands of U.S. Retail; ***My Best Guesstimate For Total Shares Owned Globally — 531MM***",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/omi52f/posted_with_permission_from_ugetitgot_final/"
}