{
    "author": "somechicktho",
    "created_utc": 1618869189.0,
    "distinguished": null,
    "edited": 1618869871.0,
    "id": "mubk7t",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mubk7t",
    "num_comments": 105,
    "permalink": "/r/Superstonk/comments/mubk7t/the_worlds_largest_shell_game_the_floor_is_250/",
    "score": 2091,
    "selftext": "**TL;DR**\n\n**A parent company isn't the only way to basically own a company, but it's one of them.**\n\n**Not only do big banks take on numerous holdings, but also seemingly unrelated businesses.**\n\n**Imagine a shell game. Now imagine 13 tables all lined up, with 39 cups, and 13 dealers. But it's not a competition, and fake audience members are helping hide the ball.**\n\nMuch like last time let's start off with examining what parent companies are via example.\n\nThe Banks Are Selling Government Bonds to the Hedgies- The Floor is 250 Million [Part 1](https://www.reddit.com/r/Superstonk/comments/mtp8y1/the_banks_are_selling_government_bonds_to_the/?utm_medium=android_app&utm_source=share)\n\n[Part 1.5](https://www.reddit.com/r/Superstonk/comments/mtt8wg/master_feeder_funds_privately_negotiated_loans/?utm_medium=android_app&utm_source=share) (unformatted)\n\n[Madison Square Gardens Entertainment will cease to exist... No more Jimmy Snuka jumps?](https://www.sec.gov/Archives/edgar/data/0001795250/000119312521096718/d101795dex21.htm)\n\n > This AGREEMENT AND PLAN OF MERGER (this “Agreement”), dated as of March 25, 2021, is entered into by and among Madison Square Garden Entertainment Corp., a Delaware corporation (“Parent”), Broadway Sub Inc., a Delaware corporation and a wholly-owned direct subsidiary of Parent (“Merger Sub”) and MSG Networks Inc., a Delaware corporation (the “Company”).\n\n > SECTION 1.1 The Merger. On the terms and subject to the conditions set forth in this Agreement, and in accordance with the General Corporation Law of the State of Delaware (the “DGCL”), at the Effective Time, Merger Sub shall be merged with and into the Company. At the Effective Time, the separate corporate existence of Merger Sub shall cease and the Company shall continue as the surviving company in the Merger (the “Surviving Company”).\n\n > (h) No Liability. None of the Company, Parent, Merger Sub or the Exchange Agent shall be liable to any Person in respect of any portion of the Exchange Fund delivered to a public official pursuant to any applicable abandoned property, escheat or similar Law. Any portion of the Exchange Fund which remains undistributed to the holders of Certificates or Book-Entry Shares as of immediately prior to such date on which the Exchange Fund would otherwise escheat to, or become the property of, any Governmental Authority) shall, to the extent permitted by applicable Law, become the property of Parent, free and clear of all claims or interest of any Person previously entitled thereto.\n\nOkay okay Des what does THIS mean? Well, this is a skim of what a parent company can be or do **(or take)** from their own. And technically one could say Company X is bankrupt or insolvent, but everything from securities to funds are simply moved up the latter and we pretend losing a lower rung means really anything.\n\n  > Termination Rights\n\n > The Merger Agreement contains certain customary termination rights for MSG Entertainment and MSG Networks, including, without limitation, if the Merger is not consummated on or before December 20, 2021 (the “Outside Date”). Upon the termination of the Merger Agreement under specified circumstances, including (i) a change in the recommendation of the MSGE Board (or the MSGE Special Committee) or the board of directors (or special committee of the board of directors) of MSG Networks or (ii) the termination by MSG Entertainment or MSG Networks in order to accept a superior proposal (as defined in the Merger Agreement) with respect to an alternative transaction, MSG Networks will be required to pay MSG Entertainment a termination fee of $18,900,000 or MSG Entertainment will be required to pay MSG Networks a termination fee of $21,200,000, respectively.\n\nOkay so I bet they have that money earmarked to pass down the line as needed.\n\nSo maybe more [jimmy snuka jumps one day](https://www.sec.gov/Archives/edgar/data/0001795250/000119312521096733/d101795d425.htm). By someone, anyway.\n\nOkay let's move on to the next one.\n\n[AGREEMENT AND PLAN OF MERGER,](https://www.sec.gov/Archives/edgar/data/0001169770/000119312521090238/d35268dex21.htm)dated as of March 22, 2021 (this “Agreement”), by and between Banc of California, Inc., a Maryland corporation (“Parent”), and Pacific Mercantile Bancorp, a California corporation (the “Company”) (collectively hereinafter referred to as the “Parties.\")\n\n > The Shareholder acknowledges that, as an inducement for Parent to enter into the Merger Agreement, Parent has required that the Shareholder enter into this letter agreement and the Shareholder is willing to enter into this [letter agreement.](https://www.sec.gov/Archives/edgar/data/1169770/000119312521090238/d35268dex991.htm)\n\nSo the Shareholder has to entice the Parent by giving them stuff to be induced to merge, kinda like your wife.\n\n\n[But look at what Pacific Mercantile](https://www.sec.gov/Archives/edgar/data/1169770/000119312521090238/d35268dex993.htm) bringing to the bedroom! That's like not being your wife's boyfriend after the squeeze.\n\n\n > Santa Ana, Calif., March 22, 2021 – Banc of California, Inc. (NYSE: BANC) (the “Company”, “Banc of California”, “we”, “us” or “our”), the holding company of Banc of California, N.A., and Pacific Mercantile Bancorp (NASDAQ: PMBC) (“Pacific Mercantile”), the holding company of Pacific Mercantile Bank, today announced they have entered into a definitive agreement and plan of merger under which Pacific Mercantile will merge into Banc of California in an all-stock transaction valued at approximately $235 million, or $9.77 per share, based on the closing price for Banc of California’s common stock of $19.54 as of March 22, 2021. Banc of California expects the transaction to be 12.9% accretive to EPS in 2022 with a 2.3 year earnback period to tangible book value per share based on a conservative and achievable cost savings estimate of approximately 35%.\n\n> Pacific Mercantile Bancorp is a commercial bank headquartered in Costa Mesa, California with $1.6 billion in total assets, $1.2 billion in gross loans, and $1.4 billion in total deposits as of December 31, 2020. Pacific Mercantile had $229.7 million in Paycheck Protection loans outstanding at December 31, 2020. Pacific Mercantile operates seven banking offices, including three full service branches, located throughout Southern California. The transaction will increase Banc of California’s total assets to approximately $9.5 billion on a pro forma basis as of December 31, 2020.\n\nOkay so let's look into banc of california. Looks like someone has an nport with them in it.\n\nOh [what's this?] (https://www.sec.gov/Archives/edgar/data/0000787623/000175272421064003/xslFormNPORT-P_X01/primary_doc.xml)\n\nLot of familiar names on that borrow list. \n\nBarclays Bank PLC \nState Street Bank and Trust Company (seen that one a lot)\nUBS AG (UBS is BNY Mellon, remember guys?)\n\tRBC Capital Markets, LLC **(Royal Bank of Canada, their parent company is Bank of America)**\nBarclays Capital Inc. \nCitigroup Global Markets Inc. (were they just in the news today?)\n\nWow so many familiar faces. Well what are they borrowing?\n\nInvestment category says...\n\n> *agency debentures and agency strip  *\n\nWow way to not use capitals in a sec filings, that's just lazy. So what is this?\n\n > Agencies\" is a term used to describe two types of bonds: (1) bonds issued or guaranteed by U.S. federal government agencies; and (2) bonds issued by government-sponsored enterprises (GSEs)—corporations created by Congress to foster a public purpose, such as affordable housing.\n\n > Some organizations issue no-coupon discount notes—called \"discos\"—generally to help them meet short-term financing demands. This explains why disco maturities are usually quite short, ranging from a single day to a year. Discos resemble STRIPS in that they are zero-coupon securities that are issued at a discount to par.\n\n > What Are Interest Only Strips? Sometimes investment firms or dealers take a debt obligation or pool of obligations—mortgages, Treasury bonds, or other bonds—and after separating their principal and interest portions, sell them as distinct security products to investors, thus creating what's known as a strip bond. An interest only strip is one of these separated securities—the part that consists only of the interest portion of the monthly payments.\n\n> Although interest only strips can be created out of any debt-backed security that generates periodic payments, the term is usually associated with mortgage-backed securities (MBS).\n\nSo they're borrowing these out to a lot of big names. \n\n[Advisors Inner Circle Fund] (https://www.sec.gov/Archives/edgar/data/0000878719/000175272421065808/xslFormNPORT-P_X01/primary_doc.xml) (remember III is the Chevy Chase trust fund) has a net worth of 1 trillion dollars. They are doing [commodities contracts.](https://smallbusiness.chron.com/commodity-contract-work-15796.html)\n\n > Commodities such as grains, basic food products, metals and energy products trade through standardized contracts called futures contracts. A commodity futures contract is for the future delivery of a specified amount of a commodity. Commodity contracts are used by buyers and sellers of the commodities to lock in future delivery price and by traders looking to profit from commodity price changes.\n\n**Futures Brokers**\n\n > Commodity futures are bought and sold through an account with a commodity futures broker. Commodity brokers must be registered with the National Futures Association and are regulated by the Commodity Futures Trading Commission. The commodity futures brokerage business tends to be separate from the stock brokerage business with most commodity brokers specializing in futures trading. A commodity futures broker will provide a new account holder with trading software and either live or online recorded training about trading futures and types of strategies.\n\n**Finances of Commodity Futures**\n\n > To trade a commodity futures contract, the the trader must put up a margin deposit for each contract traded. Each commodity has a fixed margin deposit amount set by the commodity exchanges. At the time of publication, the initial margin deposit for one corn futures contract is $2,363 and the maintenance margin is $1,750. The value of futures contracts are marked to market at the end of each day. If an individual had a new corn futures position and the value increased by $800 during the day, the $800 profit would be swept into the trader's unused cash balance. If the contract lost the $800, the margin deposit would have dropped to $2,363 minus $800 or $1,563. An additional $187 would have to be added to the margin deposit to bring it up to the maintenance margin level of $1,750.\n\nBut they're not the only ones. Let's check out [JP Morgan.](https://www.sec.gov/Archives/edgar/data/0001687031/000105640421002913/msc16c31_8k-03182021.htm) and some companies they're involved with.\n\n > March 18, 2021\nDate of Report (Date of Earliest Event Reported)\n\n* Morgan Stanley Bank of America Merrill Lynch Trust 2016-C31\n* Banc of America Merrill Lynch Commercial Mortgage Inc.\n* Morgan Stanley Mortgage Capital Holdings LLC\n* Bank of America, National Association\n* UBS AG\n* KeyBank National Association\n* Starwood Mortgage Funding III LLC\n\nThat's a lot of familiar names.\n\nLet's head back to [ROYAL BANK OF CANADA](https://www.sec.gov/edgar/search/#brhc10022235_fwp.htm) since they were in the news. Plus, there does seem to be some confusion about the Royal Bank of Canada and Bank of America.\n\n > Under our distribution agreement with BofAS, BofAS will purchase the notes from us as principal at the public offering price indicated on the cover of this term sheet, less the indicated underwriting discount.\n\n>MLPF&S will purchase the notes from BofAS for resale, and will receive a selling concession in connection with the sale of the notes in an amount up to the full amount of underwriting discount set forth on the cover of this term sheet.\n\nLovely. And as a special note BlackRock is including the term LIBOR in its expectations.\n\n* 2020 Fourth Amendment Incremental Term Loan, (3 mo. LIBOR + 3.25%), 4.25%, 11/12/27(h)\n\n* 2020 Term Loan B, (6 mo. LIBOR + 2.75%, 1.00% Floor), 3.75%, 02/05/25\n\n* KFC Holding Co., 2018 Term Loan B, (1 mo. LIBOR + 1.75%), 1.91%, 04/03/25\n\nThose few are worth a few million. I really want to look into this but i have all these other threads. Uuuggghhhh\n\n[MONTHLY SERVICER’S CERTIFICATE](https://www.sec.gov/Archives/edgar/data/0001551964/000120864621000029/ex99.htm)\nBARCLAYS BANK DELAWARE\nBARCLAYS DRYROCK ISSUANCE TRUST\n\nPortfolio principal balance\n\n**5 Trillion**\n\nWhew. Good job, uh, two of Barclays holdings!\n\nLet's check out Citibank, they've JUST been mentioned.\n\n[Total Investors Collection - 4 Trillion] (https://www.sec.gov/Archives/edgar/data/0000921864/000119312521117521/d159547dex99.htm)\n\nOkay [ADVANCED SERIES TRUST](https://www.sec.gov/edgar/search/#ast77o.txt) is sus af, that's a LOT of familiar names like all our big banks as well as Credit Suisse for like a trillion dollars. They have contacts...[a LOT of Funds.](https://www.sec.gov/Archives/edgar/data/0000814679/000094040018000254/0000940400-18-000254-index.html)\n\nFuck, my head hurts. let's go back to my roots of 40APP.\n\n* Morgan Stanley Private Income Fund LLC (“MSPIF” or the “Current Fund”) and MS Capital Partners Adviser Inc. (“Morgan Stanley Adviser” or the “Current Investment Adviser”; together with the Current Fund, the “Applicants”) \n\n* In this first amended application, [The Advisors’ Inner Circle Fund (“Trust”)](https://www.sec.gov/edgar/search/#fp0063868_40appa.htm), Cambiar Investors, LLC (“Initial Adviser”), and SEI Investments Distribution Co. (“Distributor”) (collectively, the “Applicants”) \n\nThe Advisors' Inner Circle Fund! Missed you.\n\n* [BNY MELLON](https://www.sec.gov/Archives/edgar/data/0001011607/000110465921045428/tm2111456-1_40app.htm#a_015) ALCENTRA OPPORTUNISTIC GLOBAL CREDIT INCOME FUND\nBNY MELLON INVESTMENT ADVISER, INC.\n\nFeel free to take a nice long look at Exhibit A in the link below. It is names. Like this.\n\n[Morgan Stanley and Citibank](https://www.sec.gov/Archives/edgar/data/0000311847/000110465909028708/a09-12150_140app.htm)\n\n* 1 MORGAN STANLEY INVESTMENT MANAGEMENT INC.\n* 2 MORGAN STANLEY INVESTMENT ADVISORS INC.\n*  3 MORGAN STANLEY & CO. INCORPORATED\n* 4 MORGAN STANLEY BALANCED FUND\n* 5 MORGAN STANLEY U.S. GOVERNMENT MONEY MARKET TRUST\n* 6 MORGAN STANLEY DIVIDEND GROWTH SECURITIES INC.\n* 7 MORGAN STANLEY NATURAL RESOURCE DEVELOPMENT SECURITIES INC.\n* 8 MORGAN STANLEY SPECIAL GROWTH FUND\n* 9 MORGAN STANLEY GLOBAL DIVIDEND GROWTH SECURITIES\n*  10 MORGAN STANLEY LIMITED TERM MUNICIPAL TRUST\n* 11 MORGAN STANLEY TECHNOLOGY FUND\n* 12 VAN KAMPEN ASSET MANAGEMENT\n* 13 MORGAN STANLEY SMALL-MID SPECIAL VALUE FUND\n* 14 MORGAN STANLEY GLOBAL ADVANTAGE FUND\n* 15 MORGAN STANLEY LIMITED DURATION U.S. GOVERNMENT TRUST\n* 16 ACTIVE ASSETS CALIFORNIA TAX-FREE TRUST\n* 17 ACTIVE ASSETS GOVERNMENT SECURITIES TRUST\n* 18 ACTIVE ASSETS INSTITUTIONAL GOVERNMENT SECURITIES TRUST\n* 19 ACTIVE ASSETS INSTITUTIONAL MONEY TRUST\n* 20 PACTIVE ASSETS MONEY TRUST\n*  21 ACTIVE ASSETS TAX-FREE TRUST\n* 22 MORGAN STANLEY EQUALLY-WEIGHTED S&P 500 FUND\n* 23 MORGAN STANLEY SERIES FUNDS\n* 24 MORGAN STANLEY HEALTH SCIENCES TRUST\n* 25 MORGAN STANLEY SPECIAL VALUE FUND\n* 26 MORGAN STANLEY STRATEGIST FUND\n* 27 MORGAN STANLEY HIGH YIELD SECURITIES INC.\n* 28 MORGAN STANLEY INTERNATIONAL VALUE EQUITY FUND\n* 29 MORGAN STANLEY LIQUID ASSET FUND INC.\n* 30 MORGAN STANLEY MID-CAP VALUE FUND\n* 31 MORGAN STANLEY S&P 500 INDEX FUND\n* 32 MORGAN STANLEY CONVERTIBLE SECURITIES TRUST\n* 33 MORGAN STANLEY FUNDAMENTAL VALUE FUND\n* 34 MORGAN STANLEY MID CAP GROWTH FUND\n* 35 MORGAN STANLEY PRIME INCOME TRUST\n* 36 MORGAN STANLEY VALUE FUND\n* 37 MORGAN STANLEY EUROPEAN EQUITY FUND INC.\n* 38 MORGAN STANLEY FLEXIBLE INCOME TRUST\n* 39 MORGAN STANLEY INTERNATIONAL FUND\n* 40 MORGAN STANLEY MORTGAGE SECURITIES TRUST\n* 41 MORGAN STANLEY PACIFIC GROWTH FUND INC.\n* 42 MORGAN STANLEY CAPITAL OPPORTUNITIES TRUST\n* 43 MORGAN STANLEY REAL ESTATE FUND\n* 44 MORGAN STANLEY CALIFORNIA TAX-FREE DAILY INCOME TRUST\n* 45 MORGAN STANLEY CALIFORNIA TAX-FREE INCOME FUND\n* 46 MORGAN STANLEY FOCUS GROWTH FUND\n* 47 MORGAN STANLEY FX SERIES FUNDS\n* 48 MORGAN STANLEY NEW YORK MUNICIPAL MONEY MARKET TRUST\n* 49 MORGAN STANLEY NEW YORK TAX-FREE INCOME FUND\n* 50 MORGAN STANLEY SELECT DIMENSIONS INVESTMENT SERIES\n* 51 MORGAN STANLEY TAX-EXEMPT SECURITIES TRUST\n* 52 MORGAN STANLEY TAX-FREE DAILY INCOME TRUST\n* 53 MORGAN STANLEY U.S. GOVERNMENT SECURITIES TRUST\n* 54 MORGAN STANLEY GLOBAL INFRASTRUCTURE FUND\n* 55 MORGAN STANLEY VARIABLE INVESTMENT SERIES\n* 56 MORGAN STANLEY MUNICIPAL INCOME OPPORTUNITIES TRUST II\n* 57 MORGAN STANLEY MUNICIPAL INCOME OPPORTUNITIES TRUST III\n* 58 MORGAN STANLEY MUNICIPAL INCOME OPPORTUNITIES TRUST\n* 59 MORGAN STANLEY MUNICIPAL PREMIUM INCOME TRUST\n* 60 MORGAN STANLEY INCOME SECURITIES INC.\n* 61 MORGAN STANLEY CALIFORNIA INSURED MUNICIPAL INCOME TRUST\n* 62 MORGAN STANLEY CALIFORNIA QUALITY MUNICIPAL SECURITIES\n* 63 MORGAN STANLEY INSURED CALIFORNIA MUNICIPAL SECURITIES\n* 64 MORGAN STANLEY INSURED MUNICIPAL BOND TRUST\n* 65 MORGAN STANLEY INSURED MUNICIPAL INCOME TRUST\n* 66 MORGAN STANLEY INSURED MUNICIPAL SECURITIES\n* 67 MORGAN STANLEY INSURED MUNICIPAL TRUST\n* 68 MORGAN STANLEY NEW YORK QUALITY MUNICIPAL SECURITIES\n* 69 MORGAN STANLEY QUALITY MUNICIPAL INCOME TRUST (Nice)\n* 70 MORGAN STANLEY QUALITY MUNICIPAL INVESTMENT TRUST\n* 71 MORGAN STANLEY QUALITY MUNICIPAL SECURITIES\n* 72 MORGAN STANLEY INSTITUTIONAL FUND TRUST\n* 73 MORGAN STANLEY INSTITUTIONAL LIQUIDITY FUNDS\n* 74 MORGAN STANLEY INSTITUTIONAL FUND, INC.\n* 75 THE UNIVERSAL INSTITUTIONAL FUNDS, INC.\n* 76 MORGAN STANLEY EMERGING MARKETS DOMESTIC DEBT FUND, INC.\n* 77 THE TURKISH INVESTMENT FUND, INC.\n* 78 MORGAN STANLEY ASIA-PACIFIC FUND, INC.\n* 79 MORGAN STANLEY CHINA “A” SHARE FUND, INC.\n* 80 MORGAN STANLEY EASTERN EUROPE FUND, INC.\n* 81 MORGAN STANLEY EMERGING MARKETS DEBT FUND, INC.\n* 82 MORGAN STANLEY EMERGING MARKETS FUND, INC.\n* 83 MORGAN STANLEY GLOBAL OPPORTUNITY BOND FUND, INC.\n* 84 MORGAN STANLEY HIGH YIELD FUND, INC.\n* 85 MORGAN STANLEY INDIA INVESTMENT FUND, INC.\n* 86 MORGAN STANLEY FRONTIER EMERGING MARKETS FUND, INC.\n* 87 THE LATIN AMERICAN DISCOVERY FUND, INC.\n* 88 THE MALAYSIA FUND, INC.\n* 89 THE THAI FUND, INC.\n* 90 VAN KAMPEN EQUITY TRUST\n* 91 VAN KAMPEN MONEY MARKET FUND\n* 92 VAN KAMPEN CAPITAL GROWTH FUND\n* 93 VAN KAMPEN TAX FREE MONEY FUND\n* 94 VAN KAMPEN SERIES FUND, INC.\n* 95 VAN KAMPEN SENIOR LOAN FUND\n* 96 VAN KAMPEN CORPORATE BOND FUND\n* 97 VAN KAMPEN EQUITY TRUST II\n* 98 VAN KAMPEN HIGH YIELD FUND\n* 99 VAN KAMPEN TRUST\n* 100 VAN KAMPEN PARTNERS TRUST\n* 101 VAN KAMPEN RETIREMENT STRATEGY TRUST\n* 102 VAN KAMPEN GOVERNMENT SECURITIES FUND\n* 103 VAN KAMPEN PENNSYLVANIA TAX FREE INCOME FUND\n* 104 VAN KAMPEN TAX FREE TRUST\n* 105 VAN KAMPEN TRUST II\n* 106 VAN KAMPEN GROWTH AND INCOME FUND\n* 107 VAN KAMPEN TAX-EXEMPT TRUST\n* 108 VAN KAMPEN COMSTOCK FUND\n* 109 VAN KAMPEN ENTERPRISE FUND\n* 110 VAN KAMPEN EQUITY AND INCOME FUND\n* 111 VAN KAMPEN EXCHANGE FUND\n* 112 VAN KAMPEN HARBOR FUND\n* 113 VAN KAMPEN LIFE INVESTMENT TRUST\n* 114 VAN KAMPEN LIMITED DURATION FUND\n* 115 VAN KAMPEN REAL ESTATE SECURITIES FUND\n* 116 VAN KAMPEN U.S. GOVERNMENT TRUST\n* 117 VAN KAMPEN SENIOR INCOME TRUST\n* 118 VAN KAMPEN ADVANTAGE MUNICIPAL INCOME TRUST II\n* 119VAN KAMPEN CALIFORNIA VALUE MUNICIPAL INCOME TRUST\n* 120 VAN KAMPEN DYNAMIC CREDIT OPPORTUNITIES FUND\n* 121 VAN KAMPEN MASSACHUSETTS VALUE MUNICIPAL INCOME TRUST\n* 122 VAN KAMPEN MUNICIPAL OPPORTUNITY TRUST\n* 123 VAN KAMPEN MUNICIPAL TRUST\n* 124 VAN KAMPEN OHIO QUALITY MUNICIPAL TRUST\n* 125 VAN KAMPEN PENNSYLVANIA VALUE MUNICIPAL INCOME TRUST\n* 126 VAN KAMPEN SELECT SECTOR MUNICIPAL TRUST\n* 127 VAN KAMPEN TRUST FOR INSURED MUNICIPALS\n* 128 VAN KAMPEN TRUST FOR INVESTMENT GRADE MUNICIPALS\n* 129 VAN KAMPEN TRUST FOR INVESTMENT GRADE NEW JERSEY MUNICIPALS\n* 130 VAN KAMPEN TRUST FOR INVESTMENT GRADE NEW YORK MUNICIPALS\n* 131 VAN KAMPEN BOND FUND\n* 132 VAN KAMPEN HIGH INCOME TRUST II\n\n* 133 CITIGROUP ALTERNATIVE INVESTMENTS LLC\n* 134 CITIGROUP GLOBAL MARKETS INC.\n* 135 CITIGROUP GLOBAL MARKETS LIMITED\n* 136 CITIGROUP FINANCIAL PRODUCTS INC.\n* 137 CITIBANK, N.A.\n* 138 CITIBANK CANADA\n* 140 CITIBANK INTERNATIONAL PLC\nLMP CORPORATE LOAN FUND INC\n\nGood fucking god kill me, why did I number those?  [Here's the Order approving it.](https://www.sec.gov/edgar/search/#filename1.pdf)\n\nAnd these Orders of Exemption are permanent when [stated as such.](https://www.sec.gov/edgar/search/#filename1.pdf)\n\n\nHey BNY Mellon popped up again, let's check it out, hanging out with Citigroup as co-custodian for a select number of portfolios.\n\n> The Old Westbury Funds, Inc. (the “Fund Company”), BNY Mellon Distributors Inc.1 (“Distributor”), and The Bank of New York Mellon (together with the Fund Company and Distributor, the “Applicants”), hereby request an order of the Securities and Exchange Commission (the “Commission”) pursuant to Sections 6(c), 10(f) and 17(b) of the Investment Company Act that would exempt Applicants from the provisions of Sections 17(a) and 10(f) of the Investment Company Act (the “Application”).  The requested relief would permit principal transactions (“Transactions”) effected in the ordinary course of business between series of the Fund Company (each, a “Portfolio” and collectively, the “Portfolios”) and The Bank of New York Mellon and/or any entity controlled by, controlling, or under common control with The Bank of New York Mellon (collectively, “BNY Mellon”).\n\nJust in case you get confused With the acronyms, BNY Mellon absorbed PNCGIS and all their securities.\n\n > In connection with the transaction described below, PNC Global Investment Servicing Inc. was renamed BNY Mellon Distributors Holdings Inc. effective July 1, 2010. The servicing activities described above are currently provided by BNY Mellon Investment Servicing (U.S.) Inc. (formerly known as PNC Global Investment Servicing (U.S.) Inc.)  The name PNCGIS is used herein for ease of reference.\n\nWooaaah, 22.3 trillion? That's a lot, thank goodness Mellon merged with Bank of New York in 2007.  \n\n > In addition to buying and selling securities as a broker and principal, BNY Mellon is engaged in asset servicing through its offering of global custody, global fund services, securities lending, global liquidation services and credit-related services to institutional clients (e.g., mutual funds, public retirement funds, etc.).  BNY Mellon provides such services to over $22.3 trillion in assets under custody or administration, making it one of the leading asset services providers in the world.\n\n Wait wait wait what's that number? Man how do I get to be custodian of that much money? Oh, not quite as impressive as 22 trillion... Wait it absolutely is.\n\n> BNY Mellon acts as custodian for more than $450 billion in assets for onshore and offshore fund managers.  BNY Mellon also provides collateral management solutions to dealers and investors around the globe for a range of financial transactions, including repurchase agreements, reverse repurchase agreements, securities lending, and derivatives transactions.\n\nJP Morgan Chase Bank is the Primary Custodian. [ASA Gold and Precious Metals Limited](https://www.sec.gov/Archives/edgar/data/0001230869/000089843213000170/a40app-a.htm). They own a shitload of mines around the world.\n\n > 32 ASA has been informed that if DTC places a so-called “chill” on a security, then the security is not DTC-eligible and cannot settle through DTC.  To date, ASA has been unable to determine under what circumstances DTC would place a chill on (or lift a chill from) a security.  Without complete certainty as to whether DTC will place a chill on (or lift a chill from) a security, ASA believes that CLS is not a reliable means for ASA to purchase securities on the TSX.\n\nSomeone got salty as fuck in the footnotes. \n\n\n> The Commission adopted Rule 3a-7 in recognition of the increasing importance of ABS Transactions in the financial markets based on the recommendation of the Division of Investment Management (the \"Division\") in its 1992 report, Protecting Investors:  A Half Century of Investment Company Regulation (the \"1992 Report\").9 Prior to the adoption of Rule 3a-7, Issuers fell within the definition of an investment company under Section 3(a) of the Act and, absent qualifying for exceptions from the Act under Section 3(c)(5) or obtaining exemptive orders from the Commission, were subject to a regulatory regime under which they could not operate. In adopting Rule 3a-7, the Commission stated that it intended to \"remove an unnecessary barrier to the use and development of structured financings.\"10\nUnder Rule 3a-7, an Issuer that meets certain conditions is deemed not to be an investment company under Section 3(a) of the Act. \n\nWell well, what is this? \n\n> Consolidation within the financial industry that occurred throughout the 1990's and into the 2000's as a result of bank mergers and sales and related acquisitions of trustee services businesses by banks has resulted in a significant decrease in recent years in the number of bank trustees providing services to Issuers. For example, during 2013, five bank trustees acted for 89% of approximately $215 billion in new U.S. ABS.15 The Applicant acted for approximately 25% of all new U.S. ABS in 2013. By contrast, in 1990, the top five bank trustees acted for 35% of the approximately $46 billion of publicly-offered new ABS.16\n\nWait. Wait wait wait.\n\n> The Commission noted when it proposed Rule 3a-7 in 1992 that the Independent Trustee Requirement \"would not depart from industry practice,\" because \"virtually all trustees are unaffiliated with the other parties involved in\" an ABS Transaction.14 The absence of trustee affiliations was primarily due to the limitations imposed on permissible bank activities at the time. Due to: (a) consolidation of the banking industry (and corporate trustees in particular), (b) economic and other business factors and (c) the expansion of banks into investment banking, including the underwriting of securities issued by Issuers, most trustees that provide services to Issuers, including the Applicant, have affiliations with underwriters to Issuers. As a result, when, as is frequently the case, an affiliate of Applicant is selected to underwrite ABS in an ABS Transaction, Rule 3a-7(a)(4)(i) generally prevents the Applicant from serving as trustee for the Issuer.\n\nAnd then ofc a written lack of liability.\n\n> Unlike a trustee for a corporate or municipal debt security that may need to pursue discretionary remedies against the issuer in the event of a default, a trustee for an Issuer has no operating entity to pursue for such remedies. The default risk for an Issuer is solely related to risks that arise from the composition and performance of the assets in the asset pool or the insolvency of the servicer or credit enhancer.\n\nTrustees can be granted quite a bit of power if a company folds.\n\n > When liquidation is mandated by the Transaction Documents and circumstances of the transaction, the trustee will preserve the assets of the Issuer, using the available cash flow to make payments, disseminate information to investors and may be subject to the \"prudent person\" standard. If a servicer of the assets defaults by failing to perform its obligations or due to its insolvency or bankruptcy, the trustee may have the legal obligation to perform the obligations of the servicer until another servicer is selected.\n\nAnother nod to Citigroup, who's been in some trouble lately.\n\n> Citigroup Inc. (“Citigroup” or “Citi”), the parent company of the Settling Firm, CGMI and the other Adviser Applicants, is a global financial holding company whose businesses provide a broad range of financial services. The Settling Firm is a financial services holding company and the direct parent company of Citibank. CGMI, a New York corporation and an Affiliated Person of the Settling Firm, is a full service investment banking firm. CGMI engages in securities underwriting, sales and trading, investment banking, financial advisory and investment research services. CGMI is registered as a broker-dealer under the Securities Exchange Act of 1934 (“Exchange Act”) and as an investment adviser under the Investment Advisers Act of 1940 (“Advisers Act”). CGMI currently does not perform Fund Service Activities (as defined below) for any Fund 1, but it may seek to do so in the future.\n\n\n\nI get it, so you're like they're all like that, right? Well, smaller companies with a dream and a need to raise capital, they have to file a lot of stuff to get an IPO to be able to offer stock, and THEN hope someone meets the minimum projected capital. Cause, look at [Brix Reit](https://www.sec.gov/Archives/edgar/data/0001723028/000114420419020703/tv519457_40app.htm) trying to raise funds for student housing. I like this company and they seem so much more transparent. And they're [struggling](https://www.sec.gov/Archives/edgar/data/0001723028/000172302821000003/brixreit-202102121uxmessag.htm)\n\nConsidering how many small businesses have filed Beneficial Ownership with big banks, what a shame these guys are struggling so much.\n\nYou know those Funds set aside for 'Advisors' and 'Managers' to avoid federal tax income (and state taxes), and to preserve capital? They have billions of dollars. What are they preserving capital FOR?\n\nI'm not going to list more parent companies or 40APP in this Part. Just know Morgan Stanley is not unique, and they're using small companies for their own growth.\n\nIt can be beneficial, SpaceX got their chance cause of North Holdings, which is controlled(basically) by Citadel, sure, but SpaceX is going to revolutionize how NASA makes their shit. So that's cool.\n\nBut what about the companies like Brix Reit struggling cause student housing took a huge hit? Oh right, they had to implement a Plan of Liquidity. Maybe they should know the right people, huh?\n\nI know it's disorganized. I didn't work in the finance side of legal, so I'm parsing a lot of new information.\n\nim sharing the search with you guys cause there HAS TO BE A BASE OF KNOWLEDGE to understand all these brilliant DDs that other people are writing.\n\nI can't teach worth shit but i can share links and thoughts. ill keep working on it tho my brain is dusty\n\nI think the next part will involve Citadel, they've been up to a lot with talking on small companies looking to have their own IPO. Citadels interest is definitely snatching up new dealers with unmarked cups.\n\nNEXT TIME",
    "title": "The World's Largest Shell Game - The Floor is 250 Million Part 2",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mubk7t/the_worlds_largest_shell_game_the_floor_is_250/"
}