{
    "author": "rabeenesh",
    "created_utc": 1623261296.0,
    "distinguished": null,
    "edited": 1623262047.0,
    "id": "nw1ze8",
    "text_only": true,
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_nw1ze8",
    "num_comments": 617,
    "permalink": "/r/Superstonk/comments/nw1ze8/for_all_those_who_missed_what_ryan_cohen_said/",
    "score": 14871,
    "selftext": "\"We ushered in a whole new era of GameStop. On a personal note, I want you to know I’m humbled to be elected to your board and serve as your Chairman. We have a lot of work in front of us, and it will take time.\nWe’re trying to do something that nobody in the retail space has ever done but we believe we’re putting the right pieces in place and we have clear goals: delighting customers and driving shareholder value for the longterm. The management team and refreshed board will remain totally focused on\nthese goals at all times.\nWe know some people want us to lay out a whole detailed plan today, but that’s not gonna happen. You won’t find us talking a big game, making a bunch of lofty promises, or telegraphing our strategy to the competition. That’s the philosophy we adopted at Chewy.\nHere are a few things we’ve done so far: refresh the board, added technology and retail experience to the leadership team, paid off all our long term debt and strengthened the balance sheet, and begun laying the foundation for long term growth.\nMoving forward, we want you to judge GameStop based on our actions, not our words. Thank you everyone, and as my dad would say, “buckle up.”[https://gmedd.com/transformation/ryan-cohen-at-agm-we-ushered-in-a-whole-new-era-of-gamestop/](https://gmedd.com/transformation/ryan-cohen-at-agm-we-ushered-in-a-whole-new-era-of-gamestop/)",
    "title": "For all those who missed what Ryan Cohen said because of FUD and the attempt to divide us by attacking mods. Transcript below:",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nw1ze8/for_all_those_who_missed_what_ryan_cohen_said/"
}