{
    "author": "puppetjustice",
    "created_utc": 1617894348.0,
    "distinguished": null,
    "edited": 1617911975.0,
    "id": "mmtshs",
    "text_only": true,
    "flair_id": "9dea31f0-9690-11eb-a861-0e3e97b993ff",
    "flair_text": "HODL 💎🙌",
    "name": "t3_mmtshs",
    "num_comments": 878,
    "permalink": "/r/Superstonk/comments/mmtshs/some_shill_fuck_tried_to_report_me_as_suicidal/",
    "score": 8027,
    "selftext": "How to fight the new FUD - For the new or smooth brained Apes. A simple DD for simple strategies\n\nFirst - Come at me Shills, you bunch of underpaid fuck muppets\\*\\*. I couldn’t be more jacked to the titties and happy to be alive.\\*\\* Only crisis I’m having is who to help first with all your bosses’ bucks.\n\nSecond and more importantly - Holy fucking shit. Look at you Ape. You big, beautiful, diamond handed barstard. Whether you are a new Ape, old Ape, or a lurking Ape. Every single one of you counts. We need you all for the Endgame fight.\n\nThird – This is a DD to defend against FUD for new apes and apes that haven’t read enough DD. If you are a wrinkle brained Ape, I salute you and this will be of no use. **We will look at why you get to set your price and why the Shills are wrong**.\n\nFour – this is about FUD as such this will be word heavy, not number heavy.\n\n[YOU SHOULD BE JACKED TO THE TITTIES TO BE ALIVE AND PART OF THIS](https://www.reddit.com/r/Superstonk/comments/mmipp4/first_time_doing_something_like_this_im_just/?utm_source=share&utm_medium=web2x&context=3)\n\n**TL DR**\n\n**You have done the hard part. You motherfucking marvel of the modern world.**\n\n**We win. Either now or later, you get to choose how much you sell for.**\n\n**The FUD is designed to lower the amount you are willing to believe is possible. Why? Because they know it’s any price is possible.**\n\n**If we hold together they have to come shop in the Ape supermarket full of “$You name the price” shares.**\n\n**We can only do this together.** **We only get one shot. We will NEVER get another. So you want to paper hands this bitch? Or you want to buckle in, get jacked to the tits and take a trip round the tendiverse?**\n\n**Below is how in as basic a set of terms as I can still make it useful with**\n\nI will be honest, I posted that anti FUD a few days ago to then kick back, chill, and wait for lift off. I was glad to lift some spirits, help some new apes understand, and spread some simple ideas. [Then I get this](https://imgur.com/a/zLutc2L). Well fuck. Guess I got to go write a load more DD about how we should all be jacked to the tits, happy to be alive, and fighting FUD.\n\nGreat job you dumb fuck shills.\n\nFUD is obviously a hot topic for them so will look at how Apes can cover each other’s asses, and why they are trying to lower your price to thousands of dollars.\n\n**So, what does that mean and why so much FUD?**\n\n\\[[Remember that phrase “knowledge is power”? It’s not a joke](https://www.reddit.com/r/GME/comments/lj1wqv/a_comprehensive_compilation_of_all_due_diligence/)\\]\n\nYou are a living breathing part of the most interconnected decentralized hive mind the plant has ever seen. All focused on a singular goal from every angles Focused like a bloody death star lazer.\n\nYes, we formed a god damn decentralized supercomputer of Ape financial fuckery.\n\nNo single hedge fund has the sheer number of people we have working around the clock. Dedicated autistic mad geniuses tracking down every clue, every scrap of information and plugging it into the Ape online brain.\n\nSee those wrinkle brained Apes over here decrypting tweets? What about these Ape detectives over here checking the fucking fine print? What about these crayon using candle munchers over here? Or here? Or here?\n\nEverywhere you look Apes are working together to build a better world. No one asked them too, they just joined in because Apes help Apes. You brought your energy and your positivity to the group and said count me in fellow Apes. Bravo that takes guts.\n\nThat’s why they are scared of us. Fucking terrified because this is for all the marbles. This changes the world.\n\nFor three months now, some of the richest people on the planet have tried to repeatedly undermine your conviction and scare you off this ride.\n\nJanuary, they had to literally remove the Buy button and fuck up so bad they got a senate hearing.\n\nNow the rules are changing. Rich people are pissed that Kenny G and those wallstreet wankers are messing with their money and putting them at risk. Hedge Funds need more collateral to play in the game. They need more proof they can pay their bills or get kicked out the rich kids club.\n\nUnder any normal non internet set of circumstances, this would be over by now. Think about how scary the price movements would be? or the FUD news? How long would you last without the DD, the insight, and the memes? Have a serious look inside. Be honest. Not many of us, myself included, would still be here.\n\nBut we have out fellow apes around us. Our community isn’t a place it is the great Ape collective. They have burnt our house down twice. We just went to another tree and brought  more shares.\n\n\\[[Every single one of you Apes still holding walked in here and racked up some elite level hodling skills like you were picking up a pack of gum](https://www.reddit.com/r/Superstonk/comments/mmatep/how_ape_brain_gained_some_wrinkles_in_less_than_3/)\\]. This is the only reason we are here and the only reason this can continue. Now though we are all diamond hand strong. We owe that strength to each other.\n\nEvery. Single. Goddamn. One. Of. You\n\nThis is why the hedge funds spread the FUD. This is why they hire shills or pay for mainstream media to lie. Because the only way they can walk away from this with even a penny to their name is to break up the Apes.\n\n**Get to the good part you long winded British twat! How do we set our own price?**\n\nValid\n\nTo get to set your price you first need to understand the FUD attacks. Let’s look at the style of attacks.\n\nThey started out **denying** that anything was going on.\n\nThen they acted out of **angry** and closed the buy button when they were losing.\n\nThen they had to **bargain** with the senate and oversight committees to stay in the game.\n\nThen they tried to **depress** the mood with a market crash\n\nNow they have **accepted** the outcome and are finally trying to affect the amount you sell for.\n\nFor the wrinkly brained Apes who snuck in anyway, you will have noticed those are pretty in line with the 5 stages of grief. You would be right, and you would get a banana. Companies are still run by people and with enough centralized power, they act like people.\n\nSo now we are into the acceptance stage of the FUD campaign.\n\nThey have tried denying everything, they have fought back instead of folding. Tried every trick and contribution to politicians they can to make a deal. Flopped about a bit and now trying to convince you “you won, you got all the money”.\n\n**But surely if they Ken G is accepting its over, we win and this isn’t FUD, the Squeeze is go!**\n\nNot so fast there my overly enthusiastic Ape. That is the last FUD trap. The final chance to fuck you out of a life free from financial worry. Convincing you that you won, and the game is over. That you have all the tendies in the tendiverse already.\n\nBut we know better. We must remain absolutely JACKED TO THE TITTIES while completely calm.\n\nThe never-ending work of the Ape Online Superbrain is constantly updating Apes with hot ass facts and DD. These DDs show the math behind being able to set your own price. The best thing about Apes is we learn from each other. Ape helps Ape. If we find a better way to do something, great. The previous Ape wasn’t bad, instead, we are now all better.\n\nI would recommend trying to read some of these DDs linked here. They can be intense, this is why I’m doing a simple one for the New and smooth brained.\n\nSo back to the acceptance FUD.\n\nThey want to anchor 10k, 50k or a 100k as the most you will get. Anything else is crazy. They are just looking out for fellow Apes. You risk losing everything if you try to get to much.\n\nSo, take a step back. How much are the shares worth?\n\nWe know that when the hedge funds get their bullshit called, they have to start going into the market and buying the real shares they really owe.\n\nThis is the margin call. You will see a lot of FUD talking about hedge funds being able to get a few shares and swap them back and forth till everything is covered. Well, that’s not how this works.\n\nThe must go into the market and immediately buy the shares available. This isn’t normal trading with some dudes agreeing on shit. The trading algorithm goes through the market buying cheapest to most expensive. It has 0 fucks programmed to give. This is important though, so remember this hard-working little bot later.\n\nNow the news is out. Such and such group of sperm gurgling hedge fund gutter sluts know the other bottom feeders just got margin called. They rush into the market trying to get the shares they owe before it is too late.\n\nSo now it is the most expensive game of hungry, hungry hippos in history. These greedy fucks aren’t banded together like Apes. They are only in it for themselves.\n\nThis is where the Squeeze kicks in. Huge trading volume and massive green candles of buying.\n\nThey will fight to not be the last cuck holding the bag. Every Ape will look upon this and smile. Knowing they fought the good fight, and it is finally lift off.\n\nWe will watch the stock climb to unbelievable levels as we play a worldwide game of tendies chicken.\n\nRemember that bot we talked about earlier? The bot with 0 fucks given about the buying price? It will start sucking up shares. That little bad boy is the reason the floor infinite. The key to all the questions about how we can get 7 or 8 figures or more.\n\nWhen those greedy fucks start devouring themselves in a margin call frenzy, they must buy what is available.  If you are sat there with a meme price, it buys your meme price if no one is cheaper. If you are sat there with a price of 10k, guess what it is buying it at 10k.\n\nThis is what all the super wrinkly brained Apes mean when they say we set the price.\n\nIt isn’t a joke. It isn’t a meme. It is the mother fucking gospel of Ape.\n\n“Low though I walk through the valley of the shadow of bankruptcy. I shall fear no Shill or FUD. For Apes are with me. You DD and your Shares. They comfort me.”\n\nThey are doing everything they can to make you think that when this takes off, they still get to tell you how much you sell at.\n\nFuck that noise. Add up all their shit, divide it by Apes and then pay up and fuck off.\n\nSet your price higher than you think you can achieve. Be greedy when they are fearful. Let me tell you now, they are fucking terrified.\n\nSerious talk. You are in charge of your destiny. Right here. Right now. You are on the cusp of changing the world. Being part of history.\n\n**But how do we hit max profits and avoid missing out because we held to long?**\n\nRemember our buddy the little Bot that buys shit for lols. We own so many of the shares he must come calling at some point. Hungry to finish his mission of buying all the shares out there several times over.\n\nSo, if we all panic sell the first time the price dips (and it will be a rocky ride with dips) we are done for. The great Ape alliance of 2021 will be no more.\n\nThey have shorted this so much they have to buy the whole company possibly thousands of times.\n\nSo set your price. That little badass bot will be by for your Stonks sooner or later.\n\n**What if I am asleep and I Miss it all.**\n\nThe market has built in safety measures to stop the price going up to much or down too much. These breakers trigger and halt the market while people figure out what the fuck caused that sudden spike.\n\nMathematically it would take about 1.6 days if everything aligned perfectly to go from 0 to 10 mill. That is without any complications at all. So even at full perfect flight we won’t get there immediately. Same on the way back down. Those breakers stop the price dropping like a brick. \nCredit to /u/Dumbhorserunning There are others and as I find them I will link as well. This Ape knows his wrinkly brained shit. [Original explanation of circuit breakers and halts](https://old.reddit.com/user/DumbHorseRunning/comments/meky5m/explanation_and_illustration_of_trading_halts/) Creit to \n\nSell a couple of the way up if you want, it is all on you. I’m not. I setting my price that I believe I can get and waiting. Waiting for my buddy the bot.\n\nThey are trying to get you to throw your shares away at pennies or less from where we are aiming. Fuck, that, fuck them, fuck all that noise. WE SET THE PRICE.\n\nAre you really bothered if you set you price at billions and miss with millions? What if you miss your millions and get 100s of thousands per share? All of that is life changing. For any of us. So what if you miss? Aim higher that you thought possible. Even if you miss you will beat the FUD targets. That’s why it’s FUD. You settling for FUD numbers?\n\nThis is your only shot at this. EVER. You want to aim for what you believe in.\n\nThey need you to be afraid. They need you to paper hands way before the badass bot is making his first rounds. Remember, bot doesn’t give a fuck. Bot is coming for those shares what ever the meme price. The only people that care are the people paying the bill.\n\nAnd before anyone bitches about footing the bill, the insurance covers it and then the Fed money printers go BRRRR. Infinite is infinite, not what ever the fed can find down the back of the shitty sofa.\n\nBut we forget how much money is truly out there because we aren’t used to thinking in those terms.\n\n$100 million a share averages out to $9.3T these dickheads have $60T of insurance.\n\n$1 BILLION ($1,000,000,000) a share comes to about $29 TRILLION. We aren’t even half way through the first layer of insurance as a FUCKING BILLION. You still want those FUD numbers to be your anchor point? Or you want to come play with the big Apes?\n\nAmerica isn’t about to let Ken G take them for a ride. America is still trying to clean up its image from the 2008 crash. America has its own shit to deal with. It doesn’t want to add international securities fraud scandal as well.  Which would also cause international investors to lose faith in the American market and pull their money out. The need that faith in the American market. So you think they are going to choose? Kenny G or their own bank accounts and money printers?\n\nSo everywhere you look, people are pulling away from these pricks and are pretending they never even met them. Times is running out.\n\nAre you going to believe them when they tell you to sell low? Or are you going to wait for the badass trading bot to come sniffing for your shares asking how much you want for them?\n\nSET YOUR PRICE. THEN SET A HIGHER ONE. BELIEVE IN YOURSELF AND THE APES AROUND YOU. WE HAVEN’T FAILED YOU SINCE THIS STARTED. WE WON’T FAIL EACH OTHER NOW.\n\nWe are all super jacked to the titties. I have no intention of suicide. I love each and every single one of you marvelous members of this truly inspiring, world changing community.\n\nNever forget how unique this moment is. You are an important part in this.\n\nMy price floor is still the same = Add up all your shit. Divide it by Apes. Hand it over and fuck off.\n\nEdit: a wrinkle brained ape created the pricing in an equation for us all to use.\n\n\nPf=pricefloor S=all your shit A=apes\n\nS/A = Pf \n\nCredit to /u/Heavy_light_N7 for the big brain math equation to figure out our floor.",
    "title": "SOME SHILL FUCK TRIED TO REPORT ME AS SUICIDAL AFTER MY LAST DD POST. FUCK YOU I AM JACKED TO THE TITTIES TO BE ALIVE AND PART OF THIS. So here is some more simple anti FUD DD tactics. Basic level DD for new Apes - Not advanced number crunching.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mmtshs/some_shill_fuck_tried_to_report_me_as_suicidal/"
}