{
    "author": "dunkaroo55",
    "created_utc": 1624379197.0,
    "distinguished": null,
    "edited": 1624392580.0,
    "id": "o5r2vv",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o5r2vv",
    "num_comments": 244,
    "permalink": "/r/Superstonk/comments/o5r2vv/7_years_the_earliest_date_the_shorts_can_win_is/",
    "score": 5056,
    "selftext": "As everyone has likely seen GME has raised a little more than $1.1b after paying commission to Jefferies.  Combined with their reported cash position on May 1, 2021 of $770m they now have a war chest estimate of $1.879b with a B.\n\nCohen and Co clearly have this thing on a fast track turnaround / transformation based on reported EBITDA improvement of ($0.7m) for Q1 2021 vs ($75.5m) for Q1 2020.  For those smooth brains reading.... this type of improvement is insane.  It would be like being on the Titanic just after hitting the iceberg and that crazy flex seal mother fucker rolls up in his screen door bottom boat and slaps some flex tape on the big gaping hole in the side letting the ship sail on to NYC.\n\nBut just for a second let's pretend Cohen and Co stop with the improvements and Gamestop stays steady state moving forward.  The company slowly bleeds cash quarter after quarter based on their Q1 Net Loss.  In this non realistic scenario of Cohen's dream team sitting idle twiddling their thumbs day after day it would take 7 fucking years to bankrupt the company AKA a win for naked short sellers.  That means 121 more T+21 cycles and 73 more T+35 cycles for hedge funds to survive.\n\nTLDR - Hedgies best case scenario to bankrupt GME is now 2028 some time.  Cohen and Co just bent them over and whispered in their ears \"GME can wait at least 7 years while you try to stay solvent\".  Check Mate\n\n&#x200B;\n\nThis is not financial advice, but man do I love this fucking stock.",
    "title": "7 Years ----- The Earliest Date The Shorts Can Win Is Sometime in 2028 ---- Let that Sink In",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5r2vv/7_years_the_earliest_date_the_shorts_can_win_is/"
}