{
    "author": "missing_the_point_",
    "created_utc": 1624389697.0,
    "distinguished": null,
    "edited": 1624403697.0,
    "id": "o5uzci",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o5uzci",
    "num_comments": 360,
    "permalink": "/r/Superstonk/comments/o5uzci/screw_all_the_recent_filings_citadel_securities/",
    "score": 9254,
    "selftext": "Citadel Security's blatant abuse of their market maker privelages should result in an immediate revocation in power. This conflict of interest is such an obvious, monumental market flaw; I don't know how it's even allowed.\n\nSince the President of the NYSE recently came forward, it's no longer a secret that GameStop's price is being suppressed. Citadel is largely to blame.\n\nA significant percentage of retail trades go through Citadel. They can basically cut trades off at the pass and route them wherever they want. For example, if a buy order comes in they're able to process it out of the market where it won’t affect the overall price, while processing sell orders through the market which WILL affect the price. Most of the price suppression is likely due to processing buy orders in dark pools and sell orders on the market, launching of HFT-driven attacks to keep the price down in order to protect uncovered options, and set price to a level favorable to cover options.\n\nIt's not enough that Gamestop is competing against e-commerce giants, like Amazon, they're battling what we now know to be an (even more) rigged market. \n\nThey're making an amazing comeback and it's all the more difficult for them - the institution in charge of directing market orders is purposely sabotaging them because THEY'RE losing money. It's infuriating that the milestones they reach are not reflected in the price of their stock. What's even more corrupt is if it weren't for Citadel holding down the price, GameStop would probably have AT LEAST double the amount of cash on hand earned through recent ATMs.\n\nI don't doubt for a second Ryan Cohen has a plan and catalyst to launch MOASS. No way they're going to let these assholes continue to keep the price down or rely on the government to step in and fix the problem.\n\n\"Freedom is never given voluntarily by the oppressor; it must be demanded by the oppressed.\" Keep hodling, ya'll. 💎🙌🏼🦍",
    "title": "Screw all the recent filings; Citadel Securities needs to be stripped of its market marker privileges",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/o5uzci/screw_all_the_recent_filings_citadel_securities/"
}