{
    "author": "Aidangamer28",
    "created_utc": 1624412319.0,
    "distinguished": null,
    "edited": 1624473153.0,
    "id": "o62ndb",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o62ndb",
    "num_comments": 498,
    "permalink": "/r/Superstonk/comments/o62ndb/tomorrow_marks_the_beginning_of_the_end_for/",
    "score": 5745,
    "selftext": "Since January I, and all of you, have witnessed history. We have seen the greatest uncovering of financial and institutional fraud ever found. There has never been this much fraud in any system since the beginning of all recorded history, since the start of time. Think about that for a minute. The smartest minds have come together to figure out the biggest amount of criminal and fraudulent activity on a global scale. For once retail investors have overcome Wall Street and we will win. There is no way out for the hedge funds, the banks, or the SEC. The only end to this situation is for a payout of millions of dollars per GME share, there seriously is no floor since we apes own the entirety of the float, and we decide how much the cost is per share.\n\nSo prepare for the end game. Prepare for the fuckery that will be going on. Prepare for the FUD. Prepare for the shills. The media will try and convince you to sell, paper hand, and for you to convince others to do so. DO NOT SELL NO MATTER WHAT! Buy and HODL! Even if Reddit goes down during the squeeze, go to the Gangnam Style YouTube video, or just go to the Superstonk moderator Twitter accounts for more info.\n\nToday GameStop raised over one billion in capital. Tomorrow 002 is going live and will stop Citadel’s bullshit charade once and for all. Thursday is another T+21 launchpad date. Friday GME will be added into the Russel 1000. The amount of bullishness, buying, technicals, and order flow that is going into GME right now is making it a powder keg that’s about to explode. This is the apex of what’s been coming since 2008, it truly never ended. And I’m not saying that the squeeze is gonna happen tomorrow or the next week, but it will happen very, very soon. Get ready for the biggest times of financial history.\n\nAnd you know what? Maybe we should fucking dance. Our generation and the generations that have come before us have been getting fucked by the super wealthy and ridiculous politicians forever. It’s our time to shine, to have some fun, TO FUCKING DANCE! And to those who say that peoples retirement accounts and savings will be completely destroyed, I don’t think that’s completely true. I still have some faith in the system. I don’t think everyone’s savings and retirement accounts will be turned into nothing. We wouldn’t be fighting for massive amounts of money if we thought the economy would completely fail. There is justice, just not for the rich. GME is just allowing us to take advantage of the situation that is currently plaguing the economy and stock market.\n\n#The Endgame Is Here. The Economy is on the verge of collapsing. The biggest wealth transfer from the rich to the poor is about to happen. Get ready for the once in an eternity short squeeze. Be fucking relentless. Be fucking greedy. Do not sell no matter what. Apes Together Strong. Get fucking hyped. GUH!\n\n#Diamond Fucking Hands are engaged.💎🤲\n\n🚀🚀🚀🚀🌕💸💸💸💸🐵\n\n*This is not financial advice.*",
    "title": "Tomorrow marks the beginning of the end for Citadel",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/o62ndb/tomorrow_marks_the_beginning_of_the_end_for/"
}