{
    "author": "wJFq6aE7-zv44wa__gHq",
    "created_utc": 1620139181.0,
    "distinguished": null,
    "edited": 1620154518.0,
    "id": "n4py3n",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_n4py3n",
    "num_comments": 152,
    "permalink": "/r/DDintoGME/comments/n4py3n/want_to_know_why_i_know_our_boy_kenny_g_is_scared/",
    "score": 1511,
    "selftext": "Little background about me, I've been working with journalists for over a decade now. I've written for some papers and well known magazines - mainly covering tech (IoT + crypto).\n\nI've spoken to countless CEO's who needed to do damage control for their image, PR departments who wanted to get ahead of bad news, and politicians who wanted to spin a story a certain way.\n\nThese pieces, when they come out, they almost never work.\n\nWhy?\n\nBecause most well informed readers know to read between the lines.\n\nThat politician posting some pics giving out water during bad weather? Why didn't you help the state be better prepared for the storm in the first place????\n\nThe CEO promising to donate 99% of their personal wealth when they die? Then why did you setup a fund that acts as a new business and move all of your money there?\n\nThe company telling us they never stopped trading of our favourite share in Jan? We know how this story ended.\n\nSo [Bloomberg published this](https://www.bloomberg.com/news/articles/2021-03-25/ken-griffin-s-pandemic-had-planes-palm-beach-and-philanthropy) back in late March.\n\nIt's basically a PR piece, most likely co-written by Kenny's PR team + a Bloomberg 'journalist'.\n\nTL;DR of the piece:\n\n* Talks about how Kenny used his contacts at Congress + the White House to get the FDA to approve Covid treatments\n* Mentions how he supports education initiatives such as Maths tutoring programs and better internet at home for kids in underserved cities\n* Emphasises he's donated $1.25bn in his lifetime and plans to give more\n* Hilariously mentions he prefers to 'create wins' that benefit cities, states, or the nation\n\nThis piece has taught me more about Kenny than any of the videos or Citadel's actions have.\n\n**You only produce fluff pieces like this if you're under pressure, feeling cornered, needing to improve your brand, or about to get F'd and need something that shows you're a nice guy and thus should get F'd gently.**\n\nFluff pieces like this only end up in the public eye if you want to attain new friends and improve your image because you feel it's damaged. You wouldn't write this if you didn't need to.\n\nWhy?\n\nBecause the smart and rich don't flex their power in the public eye. They do it in the shadows.\n\nIt's why Apple has the biggest lobbying budget out of any other business in the US. Hidden power is leverage. Public power is desperation.\n\nThe fact Kenny talks about helping congress + White House is him basically saying:\n\n>*\"Hey, remember when I scratched your back a few months ago? Your turn to look out for me now\"*\n\nThe fact he mentions who he's helped cities through upgrading internet connections says:\n\n>\"Hey, don't bring state level charges against me, I helped your kids watch YouTube\"\n\nThe fact he mentions donating $1.25bn and wants to give more is him saying:\n\n>\"Look, I've distributed my wealth a lot in the past, and will continue to do so if I'm still rich. Please let me stay rich\"\n\nThat last part is so true.\n\nKenny, you are gonna distribute your wealth. It'll be the greatest wealth distribution in history. They will talk about it for centuries to come. **The Mother of All Short-fucking-Squeezes.**\n\nAll thanks to you Kenny ape's gonna be driving lambo's on weekends and Tesla's on weekdays.\n\nAs a result of reading this article I bought 50 shares on Friday.\n\nI'll end this by summarising a great philosopher + military strategist once said:\n\n*“Appear weak when you are strong, and strong when you are weak.”*\n\n― Sun Tzu, The Art of War\n\nEDIT:\n\nI [found another one](https://www.ft.com/content/25e6100d-4cdd-45d0-aaab-6f9b77b14257), this time written on the 7th of April.\n\nEDIT 2:\n\nA fellow ape (u/ayyyybro) found more.\n\nApparently Kenny has been inspired by our favourite hedge fund, I mean media company, Motley Fool! He's launched his own Top 10 stock pics in February! Check out his recommendations below.\n\n[February](https://www.insidermonkey.com/blog/billionaire-ken-griffins-top-10-stock-holdings-918165/)\n\n[March](https://www.insidermonkey.com/blog/billionaire-ken-griffins-top-10-stock-picks-923670/)\n\n[April](https://www.insidermonkey.com/blog/10-best-tech-stocks-to-buy-according-to-billionaire-ken-griffin-930846/)\n\n\"Stepping out of the shadows to offer stock info? Why Ken?\"",
    "title": "Want to know why I know our boy Kenny G. is scared? Because he's going on the PR trail.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n4py3n/want_to_know_why_i_know_our_boy_kenny_g_is_scared/"
}