{
    "author": "Takenforganite",
    "created_utc": 1626988600.0,
    "distinguished": null,
    "edited": 1627055770.0,
    "id": "opnazm",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_opnazm",
    "num_comments": 120,
    "permalink": "/r/Superstonk/comments/opnazm/can_we_not_project_our_personal_bullshit_here_it/",
    "score": 2214,
    "selftext": "Look no one cares how ugly, dumb, or whatever about you. I’m all for positivity but if you get triggered by Steve Cohen looking like a goomba, or Cramer looking like a hunch back, you are projecting and need to seek therapy.\n\nI’m overweight due to chronic pain. I don’t get triggered at seeing RC being handsome AF and able bodied. I appreciate what he’s done and what he’s doing.\n\nWe make memes because it’s funny or gets information out. These fucking financial terrorist have cost people their fucking lives and killed progress in multiple parts of society. They should be shamed anyway possible. There are few things we can do other than buy or hodl and meme. Unless someone is making threats to someone’s physical safety, I don’t give a fuck.\n\nNot everyone is a fucking shill. Recently saw a whole bunch of posts questioning a mod on his dd. I doubt a dude who’s shown his face and spent countless unpaid hours of research is a shill just because they might be using different verbiage or whatever people were trying to say. I do suspect people who try to stir up personal drama. I do suspect there are some coordinated disinformation and sowing discord in here but you can only do so much.\n\nUltimately this is a social forum about a stock. If you don’t like the content then downvote. Stop  telling others what they can post if it’s clearly obeys the sub rules. Stop projecting your personal lives. No one is targeting anyone except for the financial terrorist who should be. If you get triggered by pictures making fun of evil ass bullies then the internet might not be for you. \n\nIf you can’t be light hearted and laugh at pretty harmless jokes and memes you cannot control your emotions and will be a paper hand portney and sell on the way up. If you don’t know the definitions of market manipulation or collusion you should probably do some research and stop saying every post is shilly or sus because they reference the reality of this situation. I’m an individual investor who buys how much I want and when I want, anything else is fluff.\n\nDownvote this to hell I don’t give a fuck. \n\nI support apes trying to improve themselves giving up alcohol and cigs. I support apes who like the stock. I support apes who can talk about objective reality without fear. I support apes making content, informational or funny. \n\nI don’t support apes who are suspicious of harmless posts thinking the senate is going to discuss a meme in a market manipulation hearing. I don’t support apes who can’t control their emotions on a forum that Is about a stock. I don’t support apes who project their insecurities and make it other people’s issues. That’s what therapy is for. Go get help.",
    "title": "Can we not project our personal bullshit here? It sounds shilly AF. Go seek therapy and don’t make your insecurities others problems. Also stop telling apes what to do because you don’t like a meme… down vote and move on. No one is market manipulating or colluding here go educate yourself.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/Superstonk/comments/opnazm/can_we_not_project_our_personal_bullshit_here_it/"
}