{
    "author": "joaovrb",
    "created_utc": 1621982493.0,
    "distinguished": null,
    "edited": 1622013431.0,
    "id": "nl21b4",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nl21b4",
    "num_comments": 116,
    "permalink": "/r/Superstonk/comments/nl21b4/possible_token_dividend_and_what_it_means_for/",
    "score": 1438,
    "selftext": "Hi apes! I'm not a financial whatever, I know close to nothing about money, stocks and even less about cr1pt0. I like one stock. Also, apologies for some dates but the theory requires it. Finally, maybe I’m high on all this $200+ vibe, but hear me out and PLEASE correct any mistake you see. THANKS!\n\n**🚀 Gamestop Token**\n\nBy now we all know about the [NFT subdomain](https://www.reddit.com/r/Superstonk/comments/nkxrhe/umm_guys_i_think_i_just_found_something/) ([u/bcuzyouknow](https://www.reddit.com/user/bcuzyouknow/)'s post) and the [Gamestop Token](https://etherscan.io/token/0x13374200c29C757FDCc72F15Da98fb94f286d71e) (etherscan link). ~~Apparently the tokens to be issued are in pretty much the~~ ~~same quantity as the float available~~ ~~(~~[~~u/Smartch~~](https://www.reddit.com/user/Smartch/)~~'s post).~~ THIS WAS NOT THE OFFICIAL GAMESTOP COIN.\n\nThere is also an issue date of 7/14 for the Gamestop Token. You can check it here [https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e#code](https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e#code) by searching for 'launchDate' in the 'Contract Source Code'. That will show you a number 1626261600 which is the Unix Timestamp of 'Wed Jul 14 2021 11:20:00 GMT+0000'.\n\n**🚀 Ex Dividend**\n\nIf GameStop intends to distribute the Gamestop Token, as a dividend, by July 14th, to all its shareholders (at least the official number…) they should have an [ex-dividend date](https://www.investopedia.com/terms/e/ex-dividend.asp) (Investopedia link). This ex-dividend means pretty much what 4/16 meant for voting: if you don't own shares by that date, you didn't get to vote. If you don't own shares by the ex-date you don't get the dividend.\n\nNow, I looked at past dividends from $GME and this ex-date is usually 2 or 3 weeks before the distribution date. If the distribution date is around 7/14, the ex-date would be by late June.\n\n**🚀 Token Dividend**\n\nThere is speculation (lol...) that the float is shorted many many many times over, which means that a lot more than 58M people expect to get that dividend. If we were talking about a cash dividend it'd be no problem, because the shorts could just pay from their own pocket, cash is cash right? But if we are talking about a token, they can't make that up... they must cover!\n\n**🚀 MOASS Implications**\n\nOk, putting 2 and 2 together. If all shorts need to cover by late June, the MOASS - which a lot of DD tell us it will not be a 15min thing - would have to start weeks before that.\n\nSo my hypothesis here is: during the annual meeting GameStop will announce the token as a dividend. This will give shorts around 2 or 3 weeks to cover in time for the ex-date.\n\n**🚀 BONUS**\n\nIf this in fact becomes true, how many apes will actually want to keep one of these early Gamestop tokens forever? I know I do! You know how you do that? You keep at least one $GME share. You don't sell it during the MOASS == **💎✋**. Not selling all the shares is not new, and by now we are all diamond head to toe, BUT we now have an external incentive to do so. Something to keep as a token from this whole saga, a collectible! And this means more fuel to the rocket.\n\n**🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀**\n\n**TL;DR: If there is a crypto dividend by July 14th, the MOASS would have to occur sometime before that.**\n\n**🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀**\n\nSee you on the moon!\n\nEdit 1: added the TL;DR.\n\nEdit 2: Fixed the coin address. Thanks u/plzdontgetcaught. Apparently, there is a GameStop coin which is not the official one. This 'fake' one is also the one that  has the Max Total Supply of 58M, so forget about that. The core of the theory still stands though.\n\nEdit 3: Added source of the 7/14 date.\n\nEdit 4: Thanks for the Platinum 🙏🏻",
    "title": "Possible token dividend and what it means for MOASS 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nl21b4/possible_token_dividend_and_what_it_means_for/"
}