{
    "author": "taranasus",
    "created_utc": 1621937232.0,
    "distinguished": null,
    "edited": 1621947140.0,
    "id": "nkm59x",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nkm59x",
    "num_comments": 30,
    "permalink": "/r/Superstonk/comments/nkm59x/the_krypto_market_cap_fell_by_1_trillion_but_that/",
    "score": 630,
    "selftext": "Hi,\n\nLook I've seen this narrative float around a lot lately and I need to put a stop to it because it's just blatantly wrong, and when it [gets into DD](https://www.reddit.com/r/Superstonk/comments/nkgdwg/connecting_all_the_dots_while_dumbing_it_down_to/) (\"*1T just got wiped from krypto and there’s most likely exactly 1T in margin debt of which 80-90% is probably hedge funds\"*) it makes me sad as it skews the validity of the data. Enough waffle, let's get to the point.\n\nKrypto market cap is calculated, for each coin as:\n\nTotal number of coins in existence \\* price per coin. Let's take beetcoin for example:\n\nhttps://preview.redd.it/i7eek4ivk8171.png?width=1384&format=png&auto=webp&s=da7eb26f6f2956182590af2b6e54bb7ffc7f0339\n\nSo we have 38k \\* 18.7 mill = 710,000,000,000. which is pretty much the market cap no?\n\nYou do that for every coin in exitance, sum all the market caps up and BOOM! You have total krypto market cap.\n\n**HOWEVER!** Not all the coins are up for sale, nowhere near. For beetcoin for example, [only 2.3 million of all beetcoins are actually available on exchanges](https://www.coindesk.com/number-of-bitcoins-on-crypto-exchanges-hits-18-month-low). Similar for all other coins, because most people in krypto are hodlers, they're not interested in trading, so the coins are locked away safe and sound.\n\nThe price of each coin is defined exclusively only by what's available for sale, thus only the coins available for purchase represent the dollar value of the currency.\n\nLet's assume that 20% of all krypto coins are available for sale. I'm sure the number is lower since beetcoin is  (2.3 m / 18.0 m \\* 100 =) 12.7%  but let's assume that the smaller coins are more widely available.\n\nAbsolute best case scenario, they got 20% of the 1T by which the market cap went down by. Bare in mind that most of that market cap will be beetcoin so that 20% figure is certainly lower, and then remember that there were paper hands in the market as well, so not all the money went to HFs.\n\nAnd finally, and probably most importantly, when beetcoin goes down it drags all other coins with it, because on most krypto exchanges, [the exchange rate is pegged against ](https://www.quora.com/Why-do-all-crypto-currencies-follow-bitcoin-trend#:~:text=Because%20they%20are%20traded%20against,evaluated%20in%20FIAT%20for%20now)beetcoin , not against the dollar. So now a lot of these coins lost value not due to a selloff, but due to beetcoin going down.\n\nMaximum maximum HFs got 200billion from that stunt, but I really doubt it. Pulled out of my arse, I think HFs got about 25 billion - 50 billion from that sale. Which is a massive far cry from the 1 trillion market cap drop. ***UPDATE: There is another estimation on how much they made after the TL;DR.***\n\n**TL;DR: Krypto market cap not the same as actually money gained / lost. HFs did not get 1Trillion dollars from the selloff but somewhere between 25-200 billion. Please don't spread FUD as the HFs want to look high mighty and powerful when in fact they are not, they are on the brink of collapsing!**\n\nUPDATE: /u/they_have_no_bullets had a brilliant idea on how to get a more accurate estimate on how much hedgies got! Read his comment [here](https://www.reddit.com/r/Superstonk/comments/nkm59x/the_krypto_market_cap_fell_by_1_trillion_but_that/gzdkxag?utm_source=share&utm_medium=web2x&context=3). I'll get on with the math:\n\nFor all intents and purposes, the massive selloff that started bringing beetcoin down HARD started on the 12th of May:\n\nhttps://preview.redd.it/qe9ey75u29171.png?width=881&format=png&auto=webp&s=ff3498d55e10764d7bd657e66e88a9169c7fd8a9\n\nBut the massive volume of trading didn't happen then, it happened on the 19th of May\n\nhttps://preview.redd.it/8x8fw6k339171.png?width=855&format=png&auto=webp&s=2208c7c60e0555523667caafeb818a3ccd12b9c3\n\nAs you can see from the second picture, there is a clear distinction between days when selloffs were happening and normal days, so I will only take the volume on the selloff days into account (I'm ignoring the 24th of may as that was clearly a rebound day where krypto went up)\n\n125k + 150k + 325k + 150k + 150k + 150k = 1,050,000 coins transacted. Multiply that by the midway between the high and the low (45000 USD), and the hedge funds got around 47 Billion USD off of beetcoin selloffs, which is very in line with my pull out of butt estimations from earlier. This data is still not accurate as it doesn't take into account all the paper hands which are right now a part of the 47 billion USD, but it's not taking into account all the other coins that hedgies might have sold like etherarararaum and dodgiecoin. So yeah, I'm sticking to 25 - 50 billion.\n\n**Still TL;DR: Buy, Hodl, Vote, Shop!**\n\nUpdate 2: Replaced boobcoin with beetcoin as it was distracting people from the point and apparently boobcoin is an actual coin that exists...",
    "title": "The krypto market cap fell by 1 trillion, but that doesn't mean hedges got 1 trillion in USD, nowhere near actually...",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/nkm59x/the_krypto_market_cap_fell_by_1_trillion_but_that/"
}