{
    "author": "TenguAteMyBreakfast",
    "created_utc": 1616973369.0,
    "distinguished": null,
    "edited": 1616984161.0,
    "id": "mfci7z",
    "text_only": true,
    "flair_text": "Fluff",
    "name": "t3_mfci7z",
    "num_comments": 266,
    "permalink": "/r/GME/comments/mfci7z/this_is_going_to_be_a_wild_4_day_week_prepare/",
    "score": 4658,
    "selftext": "To Pixel and Rensole stay safe and do what you need to do for yourselves. They did their part. If they are in fear of their safety they did their part SPECTACULARLY. That means fear is making hedgie stupid.  You 2 have already done more than your fair share of the heavy lifting. We have this now.  \n\n\nWe know what our part is now. We buy, we hold, we repeat. Just the DD this weekend is insane. The energy is crazy. This is going to be an emotionally draining week.  \n\n\n\\-Updated Institutional and Fund ownership is at 149M share - (Looks updated 3/28/2021)  \n[https://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=126:0P000002CH](https://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=126:0P000002CH)  \nMy count says 24.4M in funds and EFT.  Another 61M shares are held by Blackrock, Fidelity, and RC Ventures (Ryan Cohen).  The DD around here says that those shares will not be in play. At least that is how I read it. \n\n\\-Beta is at -11 which as comments have pointed out is not like finding a unicorn. It's like finding a unicorn fucking a leprechaun while wearing a Krusty the clown costume and singing sea shanties with Optimus Prime cheering them on from the sidelines.   \nEdit 2 - Adding link https://www.reddit.com/r/GME/comments/mf5h45/gme_beta_showing_at_1101_on_tos_remember_a_week/?utm_medium=android_app&utm_source=share\n\n\\-Arcehgos was margined called and caused a major sell-off Friday.  Edit 2 Adding note -  We have other post popping up on our subreddit about Archie goes just being a shell for the larger hedge funds. Another was listed as selling off 2 billion as well, Nomura holdings\nEdit 3 - Adding DD post about archegos. https://www.reddit.com/r/GME/comments/mfdc64/there_is_no_way_the_liquidation_of_archegos/?utm_medium=android_app&utm_source=share\n** This is getting so wild. It's like watching titans battle.***\n\n\\-Ken Griffin is already doing interviews framing the narrative to blame retail investors.   \nEdit1 adding link https://www.reddit.com/r/GME/comments/mf8ona/kens_stupid_shitadel_trying_to_shape_the/?utm_medium=android_app&utm_source=share\n\n\n\\-SEC will probably be releasing something this regarding the closed-door meeting they had last week.\n\n  \nWe haven't even started the real week yet. This is not financial advice but mental health advice. Stay calm. You see what freaking out is getting the hedgies. The worst that can happen in this is we are still right where we were yesterday.  \n\n\nStay Calm. Stay Kind to one another. Still not advice. I plan on getting of the rocket on the way down. I want the calm zen moment of \"zero G\" at the top of the ride. I want to have a good laugh and smile. Then step gently off the rocket so I don't drop any tendies.   \n\n\nFor the pessimists white-knuckling this. Even if the rocket explodes. We made hedgie bleed a lot. He will not be able to get away with this sort of shit again. The financial world now knows the apes are out watching and waiting.   \n\n\nDo what's best for you. Remember what's important to you. I'm buying and holding. See you at the Annual Ape Picnic next year.",
    "title": "This is going to be a wild 4 day week. Prepare yourselves...",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mfci7z/this_is_going_to_be_a_wild_4_day_week_prepare/"
}