{
    "author": "sydneyfriendlycub",
    "created_utc": 1619030384.0,
    "distinguished": null,
    "edited": 1619062643.0,
    "id": "mvmasy",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_mvmasy",
    "num_comments": 171,
    "permalink": "/r/GME/comments/mvmasy/dtcc_needs_to_disappear_sec_needs_a_serious/",
    "score": 3849,
    "selftext": "\nAfter more than 4 months of researching and DD.\n\nWe need a serious change.\n\nThe DTCC needs to disappear: No more private owned (by the elite and 1%) self regulated institution full of greed and corruption taking advantage of businesses and retail.\n\nNo more IOU’s: No more virtual assets or imaginary shares. Back to physical or completely transparent system, if you buy something you own something and can claim it anytime, no more middleman holding assets forever.\n\nSEC needs a reform: Real reform and real power fully transparent and fair. No more going on favor of banks approving rules favoring them and giving exceptions to favor them. They need to be fair and partial to keep a healthy market and economy.\n\nBlockchain system: a completely transparent, honest and fair system that favors all parties in a win-win-win scenario, honest with no massive gambling bets and simple. If the company grows then the owners or the company benefit, if the company is in trouble and is going bad so is the stock. \n\nWealth distribution: The money the DTCC (elite and big money) has been stealing and taking from businesses and retail for years needs to come back to the people they disrupt for so long, all the jobs, houses, struggles, technology lost and advancements everyone lost because of that elite greed and control needs to be paid.\n\nIt’s time, we need to wake up and make this world a better place. Enough is enough. \n\nNo financial advice, this is what needs to be done so we can recover as society and have a better world. Starting from the economy.\n\nEdit: The saddest things about this whole situation is, we are being fucked by the middle man. This middle man are banks and big money that control and bought the government. \n\nThey are taking advantage of the transactions when all we want to do is support businesses and markets and at the same time benefiting for that support and help.\n\nEdit: video worth to watch https://www.youtube.com/watch?t=10&v=Kpyhnmd-ZbU&feature=youtu.be\n\nThey never learn…",
    "title": "DTCC needs to disappear. SEC needs a serious reform. Blockchain system needs to be implemented. Wealth needs to be distributed.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/GME/comments/mvmasy/dtcc_needs_to_disappear_sec_needs_a_serious/"
}