{
    "author": "micahsaurus",
    "created_utc": 1617913895.0,
    "distinguished": null,
    "edited": 1617943167.0,
    "id": "mn0svk",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mn0svk",
    "num_comments": 23,
    "permalink": "/r/GME/comments/mn0svk/apes_uatobitt_needs_your_help_convertible_bonds/",
    "score": 502,
    "selftext": " \n\n[u/atobitt](https://www.reddit.com/u/atobitt/) was on AndrewMoMoney's stream just a few minutes ago and he needs our help! We need to scour EDGAR for any connections to convertible bonds and any of the Citadel companies. He is putting together another DD.\n\nEDGAR lookup  \n[https://www.sec.gov/edgar/search/?r=el#](https://www.sec.gov/edgar/search/?r=el#)\n\n(I put this as news flair, but I really have no idea what to flair it as. I just didn't want to get killed by flairing it as \"DD\", I also posted this to superstonk)\n\nEdit-1: I forgot to say, just post it here. I don’t know if he wants his messages blowing up.\n\nEdit-2: Ok guys I have gotten messages from a lot of people saying that he addresses convertible bonds in an edit of his last post. With that being said, keep looking for connections between Citadel (and their plethora of other companies, funds, llcs, and ltds). Austin specifically listed 7-8 companies in his “EVERYTHING short” DD (I can’t remember them off the top of my head, but they are there). There is a reason HFs and other institutions do this shady crap.\n\nThe past few days I have gotten familiar with some financial jargon related to these filings, if you’re as interested in this, keep looking for connections. The great DD’ers are putting out A++ stuff, but I’m a firm believer in having more eyes on a problem. If you don’t feel comfortable (or the time) researching that’s completely okay and I don’t think anyone between Superstonks or GME would fault you. \n\nI’ll end with this, thank all of you smooth apes, wrinkly apes, wavy apes and all apes in between. I don’t really feel comfortable getting these awards, I haven’t done anything groundbreaking, but if we all work together even in the minutiae, we can accomplish anything. We may even write some Shakespeare by accident. #RunOnSentences",
    "title": "APES: u/atobitt needs your help! CONVERTIBLE BONDS and CITADEL",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/GME/comments/mn0svk/apes_uatobitt_needs_your_help_convertible_bonds/"
}