{
    "author": "Colt_45_75035",
    "created_utc": 1627560605.0,
    "distinguished": null,
    "edited": false,
    "id": "otw8p6",
    "text_only": true,
    "flair_text": "Resource 🔬",
    "name": "t3_otw8p6",
    "num_comments": 95,
    "permalink": "/r/GMEJungle/comments/otw8p6/keep_an_eye_on_this_shady_us_house_representative/",
    "score": 706,
    "selftext": "So if anyone made it through the majority of the House Financial Committee meeting yesterday, the first name that will stand out in your mind is BILL HUIZENGA from Michigan. This guy, in my mind, is probably one of our biggest enemies next to the hedgies themselves. He strongly opposed HR 4618 and 4619.  \n\n **H.R. 4618**, the “Short Sale Transparency and Market Fairness Act,” sponsored by Chairwoman Maxine Waters (D-CA), would change the 13(f) disclosure regime. Short selling is a critical component of the capital markets ecosystem that 1) promotes price discovery; 2) serves as a risk-management and hedging tool; and 3) contributes to market liquidity. SIFMA appreciates improvements made to the legislation, including requiring the SEC to focus on rulemaking under 929X for aggregate short sale position disclosures as well as directing the Commission to determine reporting frequency. However, we are concerned with other impacts of the bill. Specifically, more frequent 13(f) reporting may significantly harm managers and investors that retain their services by allowing other firms to replicate their intellectual capital by merely reviewing 13(f) reports. Many investment strategies take time to properly construct, and early disclosures of investment positions can cause material harm to the unique aspects of these strategies to the detriment of main street investors. Further, any reduction to the timeframe for reporting exacerbates the above concern and causes a significant operational burden on managers who need time to compile and review the required data. We are also concerned with the inclusion in the bill of derivatives on equity securities.2 The SEC has recently adopted a comprehensive swap reporting framework as part of Dodd-Frank rulemaking which goes into effect this fall (Regulation SBSR) and will subject securities-based swaps (including total return swaps) to extensive disclosure requirements to increase transparency. We understand the inclusion of derivatives if they confer the same ownership rights as a direct holder of equity securities but would oppose the inclusion of all derivatives at this point as overly broad. We respectfully suggest that a review of required derivatives disclosures should be deferred until after the SBSR rules have been in effect. \n\n **H.R. 4619**, sponsored by Rep. Al Green (D-TX), would amend the Securities Exchange Act of 1934 to prohibit trading ahead by market makers. It is important to note that FINRA Rule 5320 already prohibits market makers and other FINRA members from trading ahead of customer orders and requires them to have a written methodology in place governing the execution and priority of all pending orders that is consistent with FINRA Rule 5310 (Best Execution and Interpositioning). FINRA Rule 5320 provides significant protections to all market participants and SIFMA members must comply with its requirements. Second, we believe that the systems and procedures needed to implement the CEO attestation requirement would not change the compliance posture of firms because they are already subject to the requirements of the FINRA rule. Similar to the CEO attestation requirement codified under the final Volcker rule, our members would have to expend significant time focusing on attestations and sub-attestations relating to compliance that would be much better spent focusing on core compliance itself, as is the case with most other statutes governing banking entities’ activities. Therefore, we oppose this provision and respectfully do not believe the broader bill is necessary. \n\n&#x200B;\n\nBilly's top campaign contributions by sector-\n\n&#x200B;\n\n[Per opensecrets.org](https://preview.redd.it/ofa8pk8t15e71.png?width=699&format=png&auto=webp&s=b8821e46542a42e1fbb70259a2ff2ba93a9e2309)",
    "title": "Keep an eye on this shady US House Representative from Michigan",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/otw8p6/keep_an_eye_on_this_shady_us_house_representative/"
}