{
    "author": "Region-Formal",
    "created_utc": 1623947695.0,
    "distinguished": null,
    "edited": false,
    "id": "o21g7c",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_o21g7c",
    "num_comments": 65,
    "permalink": "/r/DDintoGME/comments/o21g7c/the_moass_and_black_swan_theory/",
    "score": 579,
    "selftext": "**Background**\n\nA few years ago, I bought a book by the Lebanese statistician / ex-options trader Nassim Taleb, called \"The Black Swan\". Some of you Apes may have heard of it, because it became a best seller a little after the Lehman Shock. The book was published in 2007, but seemed to predict (or at least anticipate the possibility of) the events that happened the following year and beyond. Given everything that has occurred over the last 1.5 years, I started to read the book again the other day, after years of it gathering dust in my book cabinet.\n\n**The Existence of Black Swans**\n\nThe origin of the term \"Black Swan\" is in fact about two thousand years old, from Ancient Rome. It refers to the improbability of there being black feathered swans in the world, and likens this to the possibility that any system of thought - especially those currently taken for granted - could be suddenly undone by an unforeseen event that disproves it.\n\nOne way to think of it is that no-one really believes in the Loch Ness Monster any more. But what if a freshly deceased body of such a creature gets washed up on the shores of the Loch tomorrow? We would all have no choice but to fundamentally change our conceived beliefs about *many* things, particularly the natural sciences of course, in that case.\n\nAnd so it was for aeons about black swans, with the conceived notion in Europe that there could be none of these particular creatures existing in this world. But to their immense surprise, this improbability suddenly became defunct in an instant, when  they were actually \"discovered\" in Western Australia in the late 17th century. No doubt the local Aboriginal Australians were just as surprised, seeing how surprised these Dutch explorers looked when encountering the common birds...\n\n**Black Swan Theory**\n\nSo the theory is that sometimes events happen, that are almost unbelievably shocking in both their impact *and* for the fact that they could not be predicted beforehand. Nothing like it has happened in (at least) living memory *and* no-one alive could even consider it could actually occur. The more detailed definition that Taleb gives in the book is as follows:\n\n*\"What we call here a **Black Swan** (and capitalize it) is an event with the following three attributes.*\n\n*First, it is an outlier, as it lies outside the realm of regular expectations, because nothing in the past can convincingly point to its possibility. Second, it carries an extreme 'impact'. Third, in spite of its outlier status, human nature makes us concoct explanations for its occurrence after the fact, making it explainable and predictable.*\n\n*I stop and summarize the triplet: rarity, extreme 'impact', and retrospective (though not prospective) predictability. A small number of Black Swans explains almost everything in our world, from the success of ideas and religions, to the dynamics of historical events, to elements of our own personal lives.\"*\n\nSome examples that he gives in the book are the sudden:\n\n**- Rise of the Internet/WWW**\n \n**- Outbreak of World War I**\n \n**- Collapse of the USSR**\n \n**- September 11th terrorist attacks**\n .\n\n**What About COVID-19?**\n\nInterestingly, the pandemic has been referred to *heavily*, over the last 15 months or so, as the \"Black Swan event of our age\". It has been used by governments, corporations, the banks and the media to justify taking extraordinary measures to deal with a vast range of problems. In many cases to \"socialise\" those problems to the masses, with the justification that: *\"No-one could have predicted something like this could have happened\"*.\n\nThis is, of course, not at all true. There have been *many* global pandemics before this one, and unfortunately there will no doubt be many more to come in the future. The constant bastardisation of his theory irritated Taleb enough, that he actually co-authored an article on this topic. The link to that can be found here (https://medium.com/incerto/corporate-socialism-the-government-is-bailing-out-investors-managers-not-you-3b31a67bff4a) and below are some interesting excerpts from this:\n\n*\"Furthermore, some people claim that the pandemic is a “Black Swan”, hence something unexpected so not planning for it is excusable. The book they commonly cite is The Black Swan (by one of us). Had they read that book, they would have known that such a global pandemic is explicitly presented there as a \"White Swan\": something that would eventually take place with great certainty.*\n\n*The bailouts of 2008–9 saved the banks (but mostly the bankers)... Bankers who lost more money than ever earned in the history of banking, received the largest bonus pool in the history of banking less than two years later, in 2010.*\n\n*That was a blatant case of corporate socialism and a reward to an industry whose managers are stopped out by the taxpayer. The asymmetry (moral hazard) and what we call optionality for the bankers can be expressed as follows: heads and the bankers win, tails and the taxpayer loses.\"*\n\nSome of what Taleb wrote seems to me to be foretelling some of what u/Criand and u/Atobitt plus others have recently written about. Namely that the entire financial system is on the edge of a precipice, and when it crashes the powers that be will claim it was unpredictable. When in truth it is caused by their own actions, with those actions actually *designed* to cause a market crash. And yet they will almost certainly still try to retrospectively apportion blame, using the third criteria of the theory:\n\n*\"Third, in spite of its outlier status, human nature makes us concoct explanations for its occurrence after the fact, making it explainable and predictable.\"*\n\nWho will be the scapegoat? Given the financial hell hole that most of the world may have descended to by then, they will try to find an easy target. One that has no leader, and thus no central point to defend itself. And by then, running counter to the rest of society, whose 'members' would have done rather well for themselves through the crash...\n\n**Triggers Of Black Swan Events**\n\nI refer, of course, to you Apes. No doubt we shall be at or near the top of their blame list for why the next Black Swan event takes place: the great market crash of 2021. Complete nonsense, of course, and a narrative that we must resist and educate others about. (Hence one of the reasons why I am authoring this post: for posterity. I want to point out, to any who might come to despise me and Apekind after the MOASS, that they are buying into nothing more than fictionalised propaganda.)\n\nHowever, I do think these detractors will be right about one thing: Apes and the MOASS will be at the very heart of the 2021 market crash. Not as the *cause* of the whole event, but as the final *trigger* - pushing the first falling domino - at the end of many years building up to it. What do I mean by this? Let's revisit the examples that Taleb gave in his book, and my own identification of the culminating triggers of these Black Swan events:\n\n**Rise of the Internet/WWW**\nThe Internet has been around since the1960s, so a lot longer than many people are aware of. But for many years it was the preserve of the military, academics and a few nerds. The *trigger* that exploded it was Sir Tim Berners-Lee (https://en.wikipedia.org/wiki/Tim_Berners-Lee?wprov=sfla1) inventing the WWW in 1989. Within four to five years of his invention, we already had much of what we have now. And reddit was to come just a few years after that!\n\n**Outbreak of World War I**\nEurope in 1914 was a tinderbox waiting to explode. For a century since Napoleon's defeat, the *Pax Britannica* (https://en.wikipedia.org/wiki/Pax_Britannica?wprov=sfla1) ensured that no widespread conflict could take place on the continent, or indeed the world. However with the Ottoman and Austro-Hungarian Empires in decline, and the rising industrial and militaristic power of Germany towards the end of this period, Britain and its ally France could see major shifts on the horizon. The complex mutual defence treaties made between the various actors were suddenly called into action, by the *trigger* event of the Austrian Archduke Franz Ferdinand being assassinated by a Serb on the streets of Sarajevo. Four years and 20 million deaths later (plus perhaps another 100 million due to the ensuing Spanish Flu pandemic), the world was transformed and in disarray.\n\n**Collapse of the USSR**\n\"The end of history\", as the political scientist Francis Fukuyama called it at the time. Perhaps a hyperbolic statement, even to many at the time, but it was certainly seen as a complete shock and re-drawing of both maps and mindsets. The need to keep up with US defense spending through the 1980s meant that the Soviet central planners were constantly struggling to juggle resources: deliver basic necessities to its people, develop new military and non-military technology, sponsor other actors across the world to compete with the West etc. Disasters such as the failed invasion of Afghanistan, Chernobyl and the *trigger* of Mikhail Gorbachev's \"slippery slope\" efforts at reform called Glasnost (https://en.wikipedia.org/wiki/Glasnost?wprov=sfla1)\nand Perestroika (https://en.wikipedia.org/wiki/Perestroika?wprov=sfla1), accelerated the eventual dissolution of the country at the end of 1991.\n\n**September 11th terrorist attacks**\nOsama bin Laden's 1998 'fatwa' of a holy war against the United States stated many reasons including its unequivocal support of Israel, tacit support of oppressive governments throughout the Middle East, and the First Gulf War invasion of and continued sanctions against Iraq. I believe this declaration (https://en.wikipedia.org/wiki/Fataw%C4%81_of_Osama_bin_Laden?wprov=sfla1) was the *trigger* for that fateful day three years later, as it drew the men and money that helped to carry out the attack.\n\n**MOASS: The True Black Swan Of Our Age**\n\nSo am I saying the 2021 market crash is going to be one such Black Swan event, similar to these ones above? Not at all. The very nature of financial markets means that crashes are inevitable events. And entirely predictable too, as many of the DDs on this subreddit have already stated. Yet, they will say that the crash is a Black Swan event, and the Apes are to blame. But they will be lying, and knowing very well that they are lying.\n\nThe **true** Black Swan event will, in fact, be the MOASS. Let me remind you once again the three criteria that Taleb gave:\n\n*\"I stop and summarize the triplet: rarity, extreme 'impact', and retrospective (though not prospective) predictability.\"*\n\nThe MOASS will be not only rare, but in fact *unique*. All the rules that the DTC, OTC, SEC etc. have been bringing in are to ensure that Apes can never win under these circumstances ever again in the future.\n\nThe MOASS will have an extreme impact on the lives of hundreds of thousands of hodling Apes. That's what generational transfer of wealth precisely is. And let's not forget the extreme impact it will have on thousands of short sellers...\n\nAs for retrospective predictability, this sub is a testament to that! Not many know about all the great DD here, precisely predicting why the MOASS is inevitable, and that has convinced the Apes to buy and hold. As for the prospective part? Well, all that we know is still confined to such a small group, than in effect it will come as a huge shock when the Apes are proven right!\n\nSo enjoy this experience, Apes. You are helping to trigger a true Black Swan event. In fact, **the** Black Swan event of our age. A MOASS and a MOABS in one! In years to come, there will be books and documentaries and even movies made about these days we are living through. The end of history, indeed.\n\n**TL;DR**\n\nBlack Swan events are extremely rare and unpredictable events, in many cases causing major shifts in the future direction of world history. The government, big banks and the media will declare that the impending market crash is a Black Swan event caused by the Apes. However it will be no such thing - they have caused their own very predictable downfall, and MOASS is merely the trigger of their demise. It is the MOASS that is the true Black Swan event...never before and never again.",
    "title": "The MOASS and Black Swan Theory",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/DDintoGME/comments/o21g7c/the_moass_and_black_swan_theory/"
}