{
    "author": "Captain-Fan",
    "created_utc": 1628087726.0,
    "distinguished": "moderator",
    "edited": 1628091318.0,
    "id": "oxtzps",
    "text_only": true,
    "flair_text": null,
    "name": "t3_oxtzps",
    "num_comments": 325,
    "permalink": "/r/Superstonk/comments/oxtzps/beware_phishing_attack_in_progress/",
    "score": 2783,
    "selftext": "Beware, we have become aware that there is a phishing attack in progress. Multiple accounts are PM'ing people trying to get you to click a link or go to a website.\n\nWe're currently investigating, will keep you updated in this post.\n\nHere is an example of one user receiving the message. [https://www.reddit.com/r/Superstonk/comments/oxmvgr/phishing\\_attempt\\_im\\_leaving\\_the\\_link\\_blue/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/Superstonk/comments/oxmvgr/phishing_attempt_im_leaving_the_link_blue/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nEDIT1: please reach out to me via chat if you have received a similar message.\n\nEDIT2: Ok, short update guys. It does not seem to be the massive attack we saw signals of. Just an ordinary idiot trying to get your login information, IP, location or whatever. We'll be looking into this further because this exact message has been floating around for a while now, but it's not the immediate danger we thought it was. Going to move this post to pinception and pin the daily back.\n\nBut allow me to reiterate some basic security measures.\n\n- Start by reading [this post about ape_security_protocols](https://www.reddit.com/r/Superstonk/comments/nsgv3d/ape_security_protocols/)\n\n- [Set up 2FA.](https://www.reddit.com/r/announcements/comments/7spq3s/protect_your_account_with_twofactor_authentication/)\nThis makes it way harder for a potential bad actor to gain access to you account\n\n- Beware of suspicious links. Hover over them to see if the link \nreally leads you to where it says it will redirect you: [https://www.reddit.com](https://www.citadel.com/). \nBeing from a (seemingly) trusted source is not a guarantee of safety, as these accounts are obviously a prime target \nfor hacking and hackers can make little changes in names (G00GLE instead of GOOGLE) to trick you into trusting them.\n\n- Change your password after you read this. [And check if it has not been part of a data breach.](https://haveibeenpwned.com/)\nWhich of course it wouldn't because that would mean you're reusing passwords. I know we are just dumb apes but even apes protect their precious bananas very well.\n \n- [And never forget the timeless advice of this genius. Check your links!](https://www.sanfransentinel.com/elvis-presley-on-the-recent-reddit-attacks.html)\n\n&nbsp;\n\nPlease don't just read this message, **take these steps, now!** \n\nFinally: keep reporting any suspicious activity via modmail. Only this way we can quickly act on new shill tactics. \n\nEDIT3: You can stop PM'ing me now ;). Also: always report these kinds of messages via the little flag, so reddit itself can take action against the account.\n\n&nbsp;\n\n💎🦍 Apes Strong Together 🦍💎\n&nbsp;\n&nbsp;",
    "title": "BEWARE PHISHING ATTACK IN PROGRESS",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oxtzps/beware_phishing_attack_in_progress/"
}