{
    "author": "the_Rei",
    "created_utc": 1620159026.0,
    "distinguished": null,
    "edited": 1620227733.0,
    "id": "n4wwni",
    "text_only": true,
    "flair_text": "Question ❓",
    "name": "t3_n4wwni",
    "num_comments": 189,
    "permalink": "/r/Superstonk/comments/n4wwni/help_interactive_brokers_just_responded_to_my/",
    "score": 2291,
    "selftext": "PRE-NOTE: Tried as best as I could to unfuck formatting... plz give me a *break*. Took me a while to write this, I’m still too FUCKING upset while trying to calmly piece everything to figure out the best strategy. Sorry if it’s confusing. These criminals do this fuckery in their working hours, while the rest of us have to waste our free time dealing with these crimes. I really could use some help & guidance as to what legal steps to take now.\n\n———————————\n\n**SUMMARY:**\n\nSince this exploded and got a lot of feedback (some was really great!) I am rearranging the post to make it more organized/structured. There are 2 subjects on this post:\n\n1) Interactive Brokers shows in my *account activity statement* that they have been lending my shares for months, **even though the option to lend was off** - I double checked it in March and April before the date of record - and now I cannot vote. This is because **they can ALWAYS pull your shares in Margin Accounts** even if you opt out (it is in their user agreement, fuck these con artists). **SOLUTION**: Account Settings > Account type > Cash (too late to vote tho, sorry fellow apes)\n\n2) Revolut does not let you vote directly in the official GME proxy site. They sent out an email to everyone to vote in https://vote.saytechnologies.com - which is a third party platform that collects your vote and then **supposedly** they cast the vote themselves. So if you are trying to vote 100 shares, who’s to say they actually vote the full amount? They can only vote 5... or 0. Why all the suspicion? **Because they refuse to give me my control number to vote directly on GameStop** - seriously try your luck, we need more people pressing them.\n\n———————————\n\n**1) Interactive Brokers**\n\nI waited a couple weeks for their automated email that I always get when there is something to vote on. I even received multiple emails in March to vote for NOK and NPA, which should prove that I had the option to loan shares off (as NPA was particularly demanded for shorts too). So I finally contacted them this Monday, May 3rd, asking about it, only to get this response today:\n\n>Summary: Haven’t yet received email to vote on proxy/shareholder meeting\n\n>XXXXX 2021/05/03 14:22:03\n\n>Hello, I usually receive an email from IBKR to vote for my holdings, normally a couple of trading days after the release of the SEC filing by the company. It has been over a week now and still haven’t received an email to vote for the GameStop (GME) shareholder meeting, of which I held XXX shares on the record date. Can you please look into this matter? Thank you in advance, Kind regards\n\nThe response:\n\n>IBCS 2021/05/04 12:50:12\n\n>Dear Mr xxx, \n\n>Thank you for contacting Interactive Brokers. \n\n>The record date for the GME annual meeting was the 15th of April 2021.\n\n>Checking your statement of this day shows that your shares were lent out on this day because you are part of the Stock Yield enhancement program: \nIBKR Managed Securities Lent Interest Details (Stock Yield Enhancement Program) \n\n>Value Date Symbol Start Date Quantity Collateral Amount Interest Rate >Earned by IB (%) Interest \n\n>Paid to IB Interest Rate on \n\n>Customer Collateral (%) Interest \n\n>Paid to Customer Code \n\n>USD \n\n>2021-04-12 GME 2021-04-12 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>2021-04-13 GME 2021-04-13 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>2021-04-14 GME 2021-04-14 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>2021-04-15 GME 2021-04-15 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>2021-04-16 GME 2021-04-16 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>2021-04-17 GME 2021-04-17 -XXX xx,xxx.xx 0.xx 1.xx 0.xx 0.xx Po \n\n>As described in the risk disclosure of the program this lending can have the effect that you lose the right to vote on the shares if they are loaned out on the record date for the meeting. \n\n>This was the case on the 15th of April so no voting material is going to be sent to you. \n\n>Should you require any further information, please do not hesitate to contact us again. \n\n>Yours Sincerely \n\n>Mark M \n\n>IBKR Client Services \n\n^(Note I edited those numbers bc idk if they can expose me or my account. They’re supposed to be rates and interest. Essentially they are a record of my shares being lent daily on those days)\n\n(I thought) I had been extra careful to avoid this sort of shit - **I even have my shares split in 3 different brokers: Degiro, Revolut and Interactive Brokers** - and I myself have been posting so many posts to bring awareness to possible fuckery, now this?\n\nI’ve already sent an email to GameStop investor relations, if their shareholders aren’t able to vote due to financial firms fuckery, it is in their interest to know and eventually do something about it. I also started composing an email to both the central bank of Ireland and UK - that’s where Interactive Brokers is for EU customers - and FCA (got this suggestion multiple times in the comments, thanks everyone!).\n\nHere’s the email, **feedback is appreciated**, I have yet to send it as I am waiting a reply from Interactive Brokers today before I consider sending it:\n\n>To whom it may concern,\n\n>I am a EU citizen. On May 4th 2021, I received very upsetting news from my broker - Interactive Brokers - who is originally from UK but has opened in Ireland since Brexit, hence my contact to you all.\n\n>I had contacted them on May 3rd because I’ve been waiting for their automated email to vote on a proxy/shareholder meeting for over a week. Note that I always received these emails for other companies I own shares in, because the option to lend shares has been off for many months. **I had the option to lend shares set to OFF** (they call it Stock Yield Enhancement Program) **I am 100% certain of this because I checked before the date of record**, which was April 15th 2021, for the company in question. \n\n>They respond that I cannot vote because **my shares were lent out on the date of record**, and that my Stock Yield Enhancement Program was ON - **which is a lie** - **and they set it themselves to “ON/Enabled” without my knowledge**. They proceed to show a record of lending my shares everyday around the date of record. I can confirm they set it to enabled themselves, I cannot confirm when but **I can only presume they did this after my contact**, because last time I checked in April it was OFF, as it had been since the account was created.\n\n>Furthermore, upon checking my account activity statement, they have been lending these shares several times since January without my knowledge or permission - note that I checked twice, in March and in April, that the option to lend was off, and I only did it to be overzealous, because I never changed that setting and had no reason to believe it would change on its own.\n\n>I want to exercise my right to vote, I made sure to not lend my shares by checking that the option to lend shares was OFF before the date of record, now they “changed the past” by setting the option to lend shares to “ON/Enabled”, and **either fabricated a history of lending my shares OR they flat out have been lending them without my permission and against my will**. How can I proceed with a formal complaint, and in your opinion what consequences can I yield from this, **namely: how will I be able to vote my shares?**\n\n>Also, before you ask if I keep proof/backup of all the settings in my brokerage accounts, the answer is “No, because I don’t even have the option to export those settings into a backup file, or at least I wouldn’t know how to do it”. But I am willing to go on record and testify under oath, if necessary, that I checked to confirm that my option to lend shares was set to off prior to the date of record, which was April 15th - and I did it to confirm because I already knew it was off, as it had been since the creation of the account! I even received other automated emails to vote for other proxy votes in mid march, because the lending option WAS OFF the whole time.\n\n>Thank you for your attention, I look forward to your response. Kind regards,\n\n———————————\n\n**2) Revolut**\n\nThey sent us a link to vote on this “SAY Technologies” platform - **even though it looks legit af**, THIS IS NOT THE OFFICIAL PROXY VOTING SITE.\n\nWhy am I suspicious? This is a company that is backed by Point72 (Steve Cohen) who played a major role in the January collusion when they bailed Melvin.\n\nNow SAY is refusing to give me a control number, they keep saying I don’t need it because the meeting will be in-person and not virtual, so I cannot get a control number and I should vote in their platform. I find it hard to believe the meeting can be really in-person only, can anyone help confirm this? After a lot of back and forth they keep using this rational:\n\n>Re: GameStop Corp. Meeting Information\n\n> Hi XXX,\n\n>Control numbers are required if you'd like to attend a virtual meeting. Because this is an in-person meeting only and you have already voted your shares online, you will not have a control number.\n\n>Let us know if that makes sense,\n\n>The Say Team\n\n———————————\n\nNOTE: I used X’s to replace # of shares and my account number and other personal info",
    "title": "HELP! Interactive Brokers just responded to my inquiry saying that my shares were lent out on the date of record - they set the option to lend shares ON themselves - IT WAS OFF I confirmed it multiple times in March/April! F**king criminals!",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n4wwni/help_interactive_brokers_just_responded_to_my/"
}