{
    "author": "Leenixus",
    "created_utc": 1626091802.0,
    "distinguished": null,
    "edited": false,
    "id": "oipymm",
    "text_only": true,
    "flair_id": "3067bf6e-85f9-11eb-81cd-0ea0822fb1e7",
    "flair_text": "Opinion 👽",
    "name": "t3_oipymm",
    "num_comments": 121,
    "permalink": "/r/Superstonk/comments/oipymm/calling_out_a_certain_op_who_wants_to_gatekeep_dd/",
    "score": 678,
    "selftext": "There's a person calling out DD writers implying that their DD is not DD. This post [here](https://www.reddit.com/r/Superstonk/comments/oibnz2/there_have_been_a_lot_of_dd_that_is_more_karma/).\n\nSince they're making a post calling out other people's DD, i'm making a post calling this person's post about gatekeeping DD in Superstonk. Fair = Fair\n\n&#x200B;\n\n# Gatekeeping DD in Superstonk\n\nIt feels and sounds to me that this [person](https://www.reddit.com/user/PWNWTFBBQ/) wants to gatekeep DD on Superstonk e.g to tell people what IS and what ISNT DD.\n\n**OP wants you to never post anything here that has to do with:**\n\n* Linear Floor\n* Exponential Floor\n\nSo make sure you scrap these from your research.\n\n&#x200B;\n\n# Elitist Attitude\n\nAlso OP wants to make it clear that all DD must be:\n\n* Peer reviewed.\n* Have some sort of mathematical proof in them.\n\nMake sure your DD is notarized in triplicate and you have your D13 form signed by the peer review Jedi council on Hoth because OP wants to turn Superstonk in the university of GME. Only tenured researchers can post DD here.\n\nLast time i checked, Superstonk is a place for theoretical discussions about business and stocks, specifically about GameStop's stonk.\n\n&#x200B;\n\n# A big fat NO to this shit\n\nI know a lot of people who have already stopped posting DD on GME due to elitist attitudes like this by a handful of people. Some of these DD writers were the original GME DD writers who started all of this and even they got discouraged by people attacking them because of weaponized posts like the one OP made.\n\nElitist posts like the one OP made WILL affect the entire Superstonk community and the effect will be apes attacking other apes because OP said their DD doesn't count as DD because OP said so. \n\nOP's post is just his own words and opinions. His words and opinions about the DD's he's bashing are just that, words and opinions. \n\nAnd if OP wants to play the stupid game of \"Research, Math, Peer Review\", as per OP's own words, he's offered no math, science, research or peer review to back his claims and to be fair, he shouldn't have to and that's because this is Superstonk and we just like the stonk.\n\n&#x200B;\n\n# DD posters who won't post DD anymore because of this shit\n\n Despite OP's intentions being good, people like  [**ahh\\_soy**](https://www.reddit.com/user/ahh_soy/)**, 1mag1n3\\_cgh, Dan\\_Bren, dejf2, Yelyah2** have stopped posting their ideas on Superstonk due to this kind of mentality. I won't say who, but at least 2 people from this list have professional grade Math knowledge in real life that they've used for GME DD and to provide us with information here, but they've been shat on so hard that they've stopped posting.\n\nLet me remind you all that this is Superstonk and not a certain known Sub-Reddit where only GME DD is posted. If you want curated DD, there's a place to read and post that.\n\nI've stopped posting DD here due to these bullshit attitudes. I'm keeping my research on GME to myself and so are some of the people i mentioned above. \n\n&#x200B;\n\n# DFV as an example\n\nCould you imagine if one of these people has an idea that turns out to be right but doesn't post it here? \n\nDon't you remember how DFV was shat on by everyone for his ideas? DFV was an \"idiot\" according to the community he was in but then he was proved right and he was suddenly a hero.\n\nWhat happens when one of these ostracized DD writers has an idea they wont post here as DD because they know they'll get shat on and that idea is THE ONE? \n\n&#x200B;\n\n# Checking DD for quality is ok\n\nIt's completely ok, expected and wanted. \n\n&#x200B;\n\n# Superstonk, the sub-reddit\n\nThe mods on Superstonk should follow and set their own rules and guidelines and not other people's posts as guidelines/rules e.g like OP's post. The mods rules are absolute. What they say goes and that's that.\n\n**OP's post is NOT guidelines or rules to DD posting.**",
    "title": "Calling out a certain OP who wants to gatekeep DD by requiring mandatory peer reviews, math proofs and other requirements.",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/Superstonk/comments/oipymm/calling_out_a_certain_op_who_wants_to_gatekeep_dd/"
}