{
    "author": "Noderpsy",
    "created_utc": 1626103673.0,
    "distinguished": null,
    "edited": 1626132443.0,
    "id": "oitkm7",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_oitkm7",
    "num_comments": 306,
    "permalink": "/r/Superstonk/comments/oitkm7/there_is_likely_an_ongoing_law_enforcement/",
    "score": 5704,
    "selftext": "Fellow Superstonk member [u/nmorgan81234](https://www.reddit.com/user/nmorgan81234/) was denied their FOIA request.\n\n[https://www.reddit.com/r/Superstonk/comments/oflfs3/foia\\_appeal\\_update/](https://www.reddit.com/r/Superstonk/comments/oflfs3/foia_appeal_update/)\n\nThis request pertained specifically to documents involving GME and the January event.\n\nThe FOIA request was denied because of this: \"Exemption 7(A) authorizes the witholding of \"records or information compiled for ***law enforcement*** purposes, but only to the extent that production of such law enforcement records or information... could reasonably be expected to interfere with enforcement proceedings.\"\n\nRead those words again carefully. **If there were no law enforcement proceedings then they wouldn't have had a reason to deny the FOIA request.**\n\nI believe that we have been granted insight by reason of deduction from this request.\n\nIf there's any legal broskies out there who'd like to chime in on this, please have at it.\n\nYour gonna get REKT frogman.\n\nEdit 1:  Further to the SECs legal authorities.\n\n\"While the SEC itself may not be able to bring formal criminal charges as an administrative regulatory agency, it does commonly partner with the FBI to aid in criminal investigations. When the FBI becomes involved, the stakes in any investigation are elevated far beyond fines and civil penalties. The feds can take immediate and severe action to charge individuals with [federal crimes](https://www.iannfriedman.com/criminal-defense/federal-crimes/).\"  [https://www.iannfriedman.com/blog/2019/march/can-i-be-charged-with-a-crime-by-the-sec-/](https://www.iannfriedman.com/blog/2019/march/can-i-be-charged-with-a-crime-by-the-sec-/)\n\nEdit 2: There's some pushback over the idea that the SEC is not  law enforcement agency.  I'll admit, i'm not sure anymore now.  But if they are, they sure suck >!ballz!< at it.\n\nEdit 3: Leave it to a u/OrginalCanadian to crack the case.  Looks like it is considered an LEA. I think?\n\n[https://www.sec.gov/enforce/how-investigations-work.html](https://www.sec.gov/enforce/how-investigations-work.html)\n\nSo there you have it, it really is their job and it feels like they  are mucking it up.",
    "title": "There is likely an ongoing \"law enforcement\" investigation into the GME situation. The SEC is not a law enforcement entity. This implies to me that another agency is currently investigating this matter.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oitkm7/there_is_likely_an_ongoing_law_enforcement/"
}