{
    "author": "BornLuckiest",
    "created_utc": 1622026559.0,
    "distinguished": null,
    "edited": 1622046322.0,
    "id": "nle3qo",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nle3qo",
    "num_comments": 105,
    "permalink": "/r/Superstonk/comments/nle3qo/down_the_rabbithole_why_is_gamestop_creates_nft/",
    "score": 598,
    "selftext": "I'm a programmer/crypto-coin miner, but in ***no way*** would I call myself an NFT/Blockchain expert. I know a bit, by association, but this is not in my direct circle of knowledge/expertise.\n\nLooking through the Etherscan chain a few things came up... I'll take you down the rabbit hole so you can make your own conclusions.\n\n* Firstly, we all saw the appearance of the [https://nft.gamestop.com/](https://nft.gamestop.com/) webserver.\n* That page has a blockchain token on it (0x13374200c29C757FDCc72F15Da98fb94f286d71e - don't you just love that that it starts with 1337 and 4200, that's really special!)\n* They made it easy to copy, so do that and paste it into Google to get these [search results!](https://www.google.co.uk/search?hl=en&q=0x13374200c29C757FDCc72F15Da98fb94f286d71e&meta=)\n* An [Etherscan link](https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e) appears at the top. *Note: Etherscan is a blockchain explorer, possibly one of the best, that allows you to verify transactions and explore links in the chain.*\n* The first page will list the complete transaction chain attached to the block Gamestop have identified.\n* So the Code links to a contract, which is written in Solidity (That's a programming/mark-up language for Smart Blockchain contracts)\n* Sidenote: The [contract they have coded](https://etherscan.io/address/0x13374200c29C757FDCc72F15Da98fb94f286d71e#code) is very well written, I am not sure if it a peer-reviewed off-the-shelf offering or something they have coded in-house, but it's so concise and well documented -- it's clearly created by people at the TOP OF THE GAME!\n* The contract appears to allow the issuing of tokens (Erc20 or Erc721) to be attached/deposited to this etheruem blockchain.\n* Anyone can attach tokens. I'll ignore all those tokens for the sakes of this DD - I've been down every rabbit hole on those chains - I can't find anything overly interesting.... this is what's interesting...\n* On the main Etherscan page, you will see the \"Token Tracker\" labelled as \"Gamestop (GME)\" with an Ethereum icon, like this.\n\n[Ethereum \\> GME](https://preview.redd.it/q39cujdzyf171.png?width=688&format=png&auto=webp&s=9fed9f27544bcba3b8652147db6f02bc17307729)\n\n* Follow that [link](https://etherscan.io/token/0x13374200c29C757FDCc72F15Da98fb94f286d71e); It leads to a page for an ERC721 Contract and that currently lists the supply as \"0 GME\"\n\n[0 GME \\(GME = Stock Ticker\\)](https://preview.redd.it/1jsjwbsmzf171.png?width=692&format=png&auto=webp&s=f1a60b4fb855ffc84eaa84fe9f93ad0154470496)\n\n* It lists the Asset Supply Unit of Measurement as \"GME\"... which's really relevant because that's GameStops Ticker on the NYSE. They could have called the Asset Supply \"Power-ups\" or anything... but for this particular contract, it's called GME.\n* So the only hodler of this token currently is the ROOT token at (0x0000000000000000000000000000000000000000)\n\nhttps://preview.redd.it/r6kx1jhd0g171.png?width=1049&format=png&auto=webp&s=bdaa8dbd5accc22c17258102309a4c433de6905e\n\n* [Click the transaction link](https://etherscan.io/tx/0x89df343d7e245d42a09de2c790c8c471a0956f32b55631a53a15268c56a74c2d) for the root holder, the one starting 0x89df343d7e245d42a09de2c790c8c471a0956f32b55631a53a15268c56a74c2d\n\n[Mint \\> GME](https://preview.redd.it/05xar9sn0g171.png?width=946&format=png&auto=webp&s=bbf7b5f39f3cd7bd91324b7047faf9a89646ecd8)\n\n* See that highlight? ***Yes!*** That says Mint! Now apart from Mint meaning super-awesome bananas in UK slang, it's also the name of a place that produces a currency. The mint in this case is for Gamestop Shares. Look at that again, and let it sink in?\n\n[Mint of Gamestop \\(GME\\)](https://preview.redd.it/laxak7i31g171.png?width=199&format=png&auto=webp&s=51967ab7b4b30c169ffea7d4866071b806b2f76a)\n\n* So in case you're not quite there... my conjecture here is that it appears that Gamestop is creating a blockchain Mint to prove the authenticity of each individual Gamestop share! ... and why would they do that, I wonder?\n\n# CONFIRMATION BIAS = EXPLODED!\n\n**TLDR; Hedgie R Fuk**\n\nOh... and here are some other interesting things I found down some dead-ends whilst exploring this rabbit warren.\n\n# Dead Ends\n\n[This CryptoKitty also exists](https://www.cryptokitties.co/kitty/1997565) \\- using the same token ID that's listed on GameStop's NFT page, it's nothing - I've just ignored it - it appears it's the co-incidental assignment of a CryptoKitty called \"Garfunkel Canwidgey\" that simply matches the same HEX token as the one on the NFT page.\n\n[Etherscan.co](https://etherscan.io/contactus) use their default email address for contact forms as [johndoe@cryptokitties.com](mailto:johndoe@cryptokitties.com). [CryptoKitties.com](https://CryptoKitties.com) simply 301 redirects to [cryptokitties.co](https://cryptokitties.co)\n\n[The Runner](https://nft.gamestop.com/runner.html) game itself lists a number of sources files listed in it's [source](https://nft.gamestop.com/index.js). Here's all the combined graphics [sprite/snackbar](https://nft.gamestop.com/assets/default_200_percent/200-offline-sprite.png), and there are also three sounds (Bip, DuhDuh and Ta-ding!) Looking through the code the gravity in the game reduces and the speed increases over time. The obstacles appear randomly but won't allow the same obstacle to appear more than twice on the run. In the code, the variable names refer to the main character as a T-REX, so I guess it's been hacked to show a \"Kitty\" head instead. Oh, and the moon that appears in the background changes phases too. **There's no secret** bananas to be found at the end, it never ends it just gets faster and faster and the gravity gets less and less! -- just like slingshotting past the moon into outer space!  🚀🚀🚀\n\nEdit 1: Readaility / Typos  \n\n\nEdit 2: I was asked to highlight a comment where I suggested VERY simple process of how they could actually digitise/mint the shares, without much obstruction, here it is:  \n[https://www.reddit.com/r/Superstonk/comments/nle3qo/down\\_the\\_rabbithole\\_why\\_is\\_gamestop\\_creates\\_nft/gzi2cch?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Superstonk/comments/nle3qo/down_the_rabbithole_why_is_gamestop_creates_nft/gzi2cch?utm_source=share&utm_medium=web2x&context=3)",
    "title": "Down the Rabbithole: Why is Gamestop creates NFT Assets?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nle3qo/down_the_rabbithole_why_is_gamestop_creates_nft/"
}