{
    "author": "atobitt",
    "created_utc": 1622077891.0,
    "distinguished": null,
    "edited": false,
    "id": "nlwaxv",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nlwaxv",
    "num_comments": 2819,
    "permalink": "/r/Superstonk/comments/nlwaxv/house_of_cards_part_2/",
    "score": 45334,
    "selftext": "***Prerequisite DD:***\n\n1. [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/)\n\n2. [The EVERYTHING Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/)\n\n3. [The House of Cards – Part 1](https://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n **TL;DR-**  **No freaking way I can do that.** \n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_** \n\n**1.** **Pilot**\n\nI wasn’t looking into GameStop when all of this began. Most of my time was spent researching the pandemic’s impact on the economy. I’m talking about the economic steam engine that employs people and puts food on their tables. Especially the small businesses that were executively steamrolled by COVID lockdowns. It was scary how fast they had to close their doors. \n\nI spent a lot of time looking at companies like GameStop. Brick-n-mortar businesses were basically running out of bricks to sh\\*t. Frankly, GameStop looked a lot like the next Blockbuster and it just seemed like a matter of time before they went under. Had DFV not done his homework, it's possible we wouldn’t have a rocket to HODL or a story to TODL. \n\nWhoever has/had a short position with GameStop was probably thinking the same thing. The number of shares that can be freely traded on a daily basis is referred to as “the float”. GameStop has 70,000,000 shares outstanding, but 50,000,000 shares represented “the float”. With a small float like this, a [short position of 20% becomes significant](https://bullishbears.com/vw-short-squeeze/). Heck, Volkswagen got squozed with just a [12.8%](https://bullishbears.com/vw-short-squeeze/) short position. So let’s use little numbers to walk through an example of how this works.\n\nAssume VW has 100 shares outstanding. If 12.8% of the company has been sold short, then 12.8 shares (let’s just say 13) must be available to purchase at a later date (assuming VW doesn’t go bankrupt). However, VW had a float of 45% which meant there was no real strain to cover that 12.8% short position at any moment. However, when Porsche announced they wanted to increase their position in VW, they invested HEAVILY. \n\n*“The kicker was that Porsche owned 43% of VW shares, 32% in options, and the government owned 20.2%.... In plain terms, it meant that the actual available float went from 45% down to 1% of outstanding shares” (bullishbears.com/vw-short-squeeze/).* \n\nLet’s revisit our scenario. With 100 shares outstanding and 13 shares sold short, what happens if only 1 share was available to cover instead of 45? \n\nWell….. THIS: \n\n&#x200B;\n\nhttps://preview.redd.it/c1n24ypq5k171.jpg?width=348&format=pjpg&auto=webp&s=2401d50c3ec1197e08564be1ffbd643558e52b6a\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nGameStop is/was the victim of price suppression through short selling. I discussed this topic with [Dr. T](https://www.youtube.com/watch?v=fGVY2Kco8ng) and [Carl Hagberg](https://www.youtube.com/watch?v=KHnpPfWdf78) in [our AMAs.](https://www.youtube.com/watch?v=KHnpPfWdf78) Every transaction has two sides- a buy and a sell. Short selling artificially increases the *supply* of shares and causes the price to decline. When this happens, the price can only increase if *demand* exceeds the increase in supply. \n\nI started looking closely at GameStop after confirming their reported short position of [140%](https://www.reuters.com/article/us-retail-trading-congress-shorting/short-selling-under-spotlight-in-gamestop-hearing-idUSKBN2AJ026). It’s important for me explain this why this is so much different than the VW example…\n\n140% of GameStop’s FLOAT was sold short. There were 50,000,000 shares in that float, so 140% of this was equal to the 70,000,000 shares the company has outstanding. This means AT LEAST 100% of their outstanding shares has been sold short. Now compare that to VW where the short position was only 12.8%... Simply put, it is mathematically impossible to cover more than 100% of a company’s outstanding stock. \n\nThe *peak* of the VW squeeze was reached when the demand for shares became surpassed by the supply of those shares. Here, demand represents 12.8% of their stock which must be available to close the short position. With only 1% of shares available, this guaranteed a squeeze until the number of shares available to trade could satisfy the remaining short interest. \n\nWhen a company has a short position with more than 100% of total shares outstanding, the preceding argument is thrown out the window. Supply cannot surpass demand because the company can only issue 100% of itself at any given time. Therefore, the additional 40% could only be explained by multiple people claiming ownership of the same share...  Surely this is a mistake.. right? I thought this level of short selling was impossible..\n\n..Until I saw the number of short selling violations issued by FINRA..\n\nAs we go through these FINRA reports, there are a few things to keep in mind:\n\n1. **FINRA is not a part of the government.** FINRA is a non-profit entity with [regulatory powers set by congress](https://www.finra.org/about). This makes FINRA the largest self-regulatory organization (SRO) in the United States. The SEC is responsible for setting rules which protect individual investors; FINRA is responsible for overseeing most of the brokers (collectively referred to as members) in the US. As an SRO, FINRA sets the rules by which their members must comply- **they are not directly regulated by the SEC** \n\n2. FINRA investigates cases at their own pace. When looking at the “*Date Initiated”* on their reports, it is not synonymous with “*date of occurrence”.* Many times, FINRA will not say when a problem occurred, just resolved. It can be YEARS after the initial occurrence. The [DTC participant report](https://www.dtcc.com/-/media/Files/Downloads/client-center/DTC/alpha.pdf) is littered with cases that were initiated in 2019 but occurred in 2015, etc. Many of the violations occurring today will take years to discover\n\n3. FINRA can issue a violation for each occurrence using a 1:1 format. When it comes to violations like short selling, however, these “occurrences” can last months or even years. When this happens, FINRA issues a violation for multiple occurrences using a 1:MANY format. I discussed this event in [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/) where one violation represented FOUR YEARS of market f\\*ckery. What’s sh\\*tty is that FINRA doesn’t tell you which violations are which. You have to read each line and see if they mention a date range of occurrence within each record. If they don’t, you must assume it was for one event… BRUTAL\n\n4. FINRA’s investment portfolio is held by the same entities they are issuing violations to… Let that sink in for a minute\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**2.** **State your case…**\n\nCan you think of a reason why short sellers would want to understate their short positions? Put yourself in their situation and imagine you’re running a hedge fund…\n\nYou operate in a self-regulated (SRO) environment and your records are basically private. If the SEC asks you to justify suspicious behavior, you really don’t have to provide it. The worst that could happen is a slap on the wrist. I wrote about this EXACT same thing in [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/). They received a cease-and-desist order from the SEC on 12/10/2018 for failing to submit complete and accurate records. This ‘occurred’ from November 2012 through April 2016 and contained deficient information for over 80,000,000 trades. Their punishment… $3,500,000… So why even bother keeping an honest ledger? \n\nNow, suppose you short a bunch of shares into the market. When you report this to FINRA, they require you to mark the transaction with a short sale indicator. In doing so, FINRA builds a paper trail to your short selling activity. \n\nHowever… if you omit this indicator, FINRA can’t distinguish that transaction from a long sale. Who else would there be to hold you accountable for covering your position? This is especially true for self-clearing organizations like Citadel because there are less parties involved to hold you accountable with recordkeeping. If FINRA thinks you physically owned those shares and sold them (long sale), they have no reason to revisit that transaction in the future… You could literally pocket the cash and dump the commitment to cover. \n\nAnother very important advantage is that it allows short sellers to artificially increase the supply of shares while understating the outstanding short interest on that security. The supply of shares being sold will drive down the price, while the short interest on the stock remains the same. \n\nSo.. aside from paying a fine, how could you possibly lose by “forgetting” to mark that trade with a short sale indicator? It would seem the system almost incentivizes this type of behavior. \n\nI combed through the [DTC participant report](https://www.dtcc.com/-/media/Files/Downloads/client-center/DTC/alpha.pdf) and found enough dirt to fill the empty chasm that is Ken Griffin’s soul. Take a guess at what their most common short selling violation is.. I’m going to assume you said **“FAILING TO PROPERLY MARK A SHORT SALE TRANSACTION”.**\n\nFor the record, I just want to say I called this in March when I wrote [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/). Citadel has one of the highest concentrations of short selling violations in their FINRA report. At the time, I didn’t fully understand the consequences of this violation… After seeing how many participants received the same penalty, it finally made sense.\n\nThere are roughly 240 participant account names on the DTC’s list. Sh\\*t you not, I looked at every short selling violation that was published on [Brokercheck.finra.org](https://brokercheck.finra.org/). To be fair, I eliminated participants with only 1 or 2 violations related to short selling. There were PLENTY of bigger fish to fry.\n\nI literally picked the first participant at the top of the list and found three violations for short selling. \n\n\\*cracks knuckles\\*\n\n[ABN AMRO Clearing Chicago LLC](https://files.brokercheck.finra.org/firm/firm_14020.pdf) (AACC) is the 3rd largest bank in the Netherlands. They got popped for three short selling violations, one of which included a failure-to-deliver. In total, they have 78 violations from FINRA. Several of these are severe compared to their violations for short selling. However, the short selling violations revealed a MUCH bigger story:\n\nhttps://preview.redd.it/3t5ylyfz5k171.jpg?width=1055&format=pjpg&auto=webp&s=f961999d09eeee7fbe42364700cbc727869f9e3f\n\nSo… ABN AMRO submitted an inaccurate short interest position to the NYSE and FINRA and lacked the proper supervisory systems to comply with… practically everything… \n\nIn 2014, AMRO forked over $95,000 to settle this and didn’t even say they were sorry.\n\nIn these situations, it’s easy to think *“meh, could have been a fluke event”*. So I took a closer look and found violations by the same participants which made it much harder to argue their case of sheer negligence. Here are a couple for AMRO:\n\nhttps://preview.redd.it/vir299076k171.jpg?width=1079&format=pjpg&auto=webp&s=e17e6ceff040a4be0113c1bc4e435f29fb5ce0a6\n\nABN AMRO got slapped with a $1,000,000 fine for understating capital requirements, failing to maintain accurate books, and failing to supervise employees. If you mess up once or twice but end up fixing the problem- GREAT. When your primary business is to clear trades and you fail THIS bad, there is a much bigger problem going on. It gets hard to defend this as an accident when every stage of the trade recording process is fundamentally flawed. The following screenshot came from the same violation:\n\nhttps://preview.redd.it/mnpm2gz96k171.jpg?width=733&format=pjpg&auto=webp&s=7e5c66293566b7ca2329f20bcdb634c35395943f\n\n   [Warehouse receipts](https://www.investopedia.com/terms/w/warehousereceipt.asp#:~:text=A%20warehouse%20receipt%20is%20used,well%20as%20provide%20inventory%20management.) are like the receipts you get after buying lumber online. You can print these out and take them to Home-Depot, where you exchange them for the ACTUAL lumber in the store. Instead of trading the actual goods, you can trade a warehouse receipt instead… so yeah… since this ONE record allowed AMRO to meet their customer’s margin requirement, it seems EXTREMELY suspicious that they didn’t appropriately remove it once they were withdrawn. \n\nDo I think this was an accident? F\\*ck no. Because FINRA reported them 8 years later for doing the SAME F\\*CKING THING:\n\nhttps://preview.redd.it/sv0v5igw6k171.jpg?width=1071&format=pjpg&auto=webp&s=02f17082135c702fad6bbc064073ae031151cee7\n\n   \n\nOnce again, AMRO got caught understating their margin requirements. Last time, they used the value of withdrawn warehouse receipts to meet their margin requirements. Here, they’re using securities which weren’t eligible for margin to meet their margin requirements.. \n\nYou can paint apple orange, but it’s still an apple.. \n\nThe bullsh\\*t I read about in these reports doesn’t really shock me anymore. It’s actually the opposite.. You begin to *expect* bigger fines as they set higher benchmarks for misconduct. When I find a case like AMRO, I’ll usually put more time into it because certain citations represent puzzle pieces. Once you find enough pieces, you can see the bigger picture. So believe me when I say I was genuinely shocked by the [detail report](https://www.finra.org/sites/default/files/fda_documents/2016049875801%20ABN%20AMRO%20Clearing%20Chicago%20LLC%20CRD%2014020%20AWC%20va%20%282019-1572740384682%29.pdf) on this case…\n\nhttps://preview.redd.it/4lgyti547k171.jpg?width=844&format=pjpg&auto=webp&s=633a928d28caef8cc6719873532aef60f271cefb\n\n**This has been going on for 8 F\\*CKING YEARS!?** \n\nWithout a doubt, this is a great example of a violation where the misconduct supposedly *ended* in 2015 but took another 4 years for FINRA to publish the d\\*mn report. If my math is correct, the 8 year “relevant period” plus the 4 years FINRA spent… I don’t know… reviewing?... yields a total of 12 years. In other words, from the time this problem started to the time it was publicized by FINRA, the kids in 1st grade had graduated high school…    \n\nDoes anyone else think these self-regulatory organizations (SROs) are doing a terrible job self-regulating…? How we can trust these situations are appropriately monitored if it takes 12 years for a sh\\*t blossom to bloom? \n\n…OH! I almost forgot… After understating their margin requirements in 22 accounts for over 8 years, ABN AMRO paid a $150,000 fine to settle the dust… \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI know that was a sh\\*t load of information so let me summarize it for you:\n\nOne of the most common citations occurs when a firm “accidently” marks a short sale as long, or misreports short interest positions to FINRA. When a short sale occurs, that transaction should be marked with a short sale indicator. Despite this, many participants do it to avoid the borrow requirements set by Regulation SHO. If they mark a short sale as long, they are not required to locate a borrow because FINRA doesn’t know it’s a short sale. \n\nThis is why so many of these FINRA violations include a statement about the broker failing to locate a borrow along with the failure to mark a short sale indicator on the transaction. It literally means the broker was naked short selling a stock and telling FINRA they physically owned that share..\n\nSuddenly, a “small” violation had much bigger implications. The number of short shares that have been excluded from the short interest calculation is directly related to these violations… and there are HUNDREDS of them. Who knows how many companies have under reported short interest positions..\n\nTo be clear, I did NOT choose them based on the amount of ‘dirt’ they had. AMRO’s violations were like grains of sand on a beach and It’s going to take A LOT of dirt to fill the bottomless pit that is Ken Griffin’s soul. Frankly, ABN AMRO wouldn’t get us there with 10,000 FINRA violations. So without further ado, let’s get dirty..\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_   \n\n**2.** **Call em’ out…**\n\nWhen FINRA publishes one of their reports, the granular details like numbers and dates are often left out. This makes it impossible to determine how systematic a particular issue might be.\n\nFor example, if you know that *“XYZ failed to comply with FINRA’s short interest reporting requirements”* your only conclusion is that the violation occurred. However, if you know that *“XYZ failed to comply with FINRA’s short interest reporting requirements on 15,000 transactions during 2020”* you can start investigating the magnitude of that violation. If XYZ only completed 100,000 transactions in 2020, it means 15% of their transactions failed to meet requirements. This represents a major systematic risk to XYZ and the parties it conducts business with.\n\nI spent some time analyzing [Apex Clearing Corporation](https://files.brokercheck.finra.org/firm/firm_13071.pdf) after I left ABN AMRO. Apex is 8th on the list and the 2nd participant I found with an evident short selling problem. \n\nIn 2019, FINRA initiated a case against Apex for doing the same sh\\*t as ABN AMRO. However, the magnitude of this violation really put things into perspective: I got a small taste of how f\\*cked this house of cards truly is..\n\nhttps://preview.redd.it/u1b4zh6m7k171.jpg?width=1076&format=pjpg&auto=webp&s=0f14f5fa49e73dad79ff605464fc1c64fa73f5bd\n\nThis is practically a template of the first ABN AMRO violation we discussed. To see the difference, we need to look at their [letter of Acceptance, Waiver and Consent](https://www.finra.org/sites/default/files/fda_documents/2016049448301%20Apex%20Clearing%20Corporation%20CRD%2013071%20AWC%20va%20%282019-1573777189509%29.pdf) (AWC)..\n\nhttps://preview.redd.it/zaiywobp7k171.jpg?width=938&format=pjpg&auto=webp&s=7fe2d2323e757efcdedf2ab22aa1ff34e10d7d55\n\nLet’s break this down step-by-step…\n\nApex had an issue for 47 months where certain customers recorded their short positions in an account which was NOT being sent to FINRA. It only takes a few wrinkles on the brain to realize this is a problem. The sample data tells us just how bad that problem is..\n\nWhen you see the term “*settlement days”,* think “[T+2](https://www.schwab.com/resource-center/insights/content/stock-settlement-why-you-need-to-understand-t2-timeline#:~:text=the%20seller's%20account.-,When%20does%20settlement%20occur%3F,would%20typically%20settle%20on%20Wednesday.)”. Apex follows the T+2 settlement period for both [cash accounts and margin accounts](https://www.apexclearing.com/wp-content/uploads/2020/01/Apex-Customer-Information-Brochure-2019.pdf) which means the trade *should* clear 2 days after the original trade date. When you buy stock on a Monday, it should settle by Wednesday. \n\nOk.. quick maff… \n\nThere are roughly [252 trading days](https://therobusttrader.com/how-many-trading-days-are-there-in-a-year/) in one year after removing weekends and holidays. Throughout the 47 month “review period”, we can safely assume that **Apex had roughly 987** ((252/ 12) \\* 47) **settlement dates**… \n\n**In other words: 256 misstated reports over 47 months is more than 1 misstatement / week for nearly 4 years.** Tell me again how this is *trivial?*\n\nThe wording of the “sample settlement” section is a bit ambiguous… It doesn’t clarify if those were the only 2 settlement dates they sampled, or if they were the only settlement dates with reportable issues. Honestly, I would be shocked if it was the latter because auditors don’t examine every record, but I can’t be certain…\n\nAnyway… FINRA discovered 256 short interest positions, consisting of 481,195 shares, were *incorrectly* excluded from their short interest report. In addition, they understated the share count by 879,321 in 130 separate short interest positions. Together, this makes 1,360,516 shares that were excluded from the short interest calculation. When you realize nearly 1.5 million ‘excluded’ shares were discovered in just 2 settlement periods and there were almost 1,000 dates to choose from, it seriously dilates the imagination…\n\nOnce again… FINRA wiped the slate clean for just $140,000… \n\nI want to talk about one last thing before we jump to the next section. Did you happen to notice the different account types that Apex discussed in their [letter of Acceptance, Waiver and Consent](https://www.finra.org/sites/default/files/fda_documents/2016049448301%20Apex%20Clearing%20Corporation%20CRD%2013071%20AWC%20va%20%282019-1573777189509%29.pdf) ? They specifically instructed their customers to book short positions into a TYPE 1 (CASH) account, or TYPE 5 (SHORT MARGIN) account. A short margin account is just a margin account that holds short positions. The margin requirement for short positions are more strict than regular margin accounts, so I can see the advantage in separating them.\n\nIn the [AMA with Wes Christian](https://www.youtube.com/watch?v=2rJujnpKiqM) *(starting at 7:30)*, he specifically discussed how a broker-dealer’s margin account is used to locate shares for short sellers. However, the margin account contains shares that were previously pledged to another party. Given the lack of oversight in securities lending, the problem keeps compounding each time a new borrower claims ownership of that share. \n\nNow think back to the situation with Apex.. \n\nThey asked their customers to book short positions to a short-margin account or a cash account. The user agreement with a margin account allows Apex to continue lending those securities at any time. As discussed with Dr. T and Carl Hagberg, the broker collects interest for lending your margin shares and doesn’t pay you anything in return. When multiple locates are authorized for the same share, the broker collects multiple lending fees on the same share. \n\nIn contrast, the cash account falls under the protection of [SEA 15c3-3](https://www.finra.org/sites/default/files/SEA.Rule_.15c3-3.pdf) and consists of shares that have not been leveraged- or lent- like the margin-short account. According to Wes *(starting at 8:30)*, these shares are segregated and cannot be touched. The broker cannot encumber-or restrict- them in any way. However, according to Wes, this is currently happening. He also explained how Canada has legalized this and currently allows broker-dealers to short sell your cash account shares against you.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAlright…. I’ll stop beating the dead horse regarding short sale indicators & inaccurate submissions of short interest positions. Given the volume of citations we haven’t discussed, I’ll summarize some of my findings, below. \n\nKeep in mind these are ONLY for **“FAILURE TO REPORT SHORT INTEREST POSITIONS”** or **“FAILURE TO INDICATE A SHORT SALE MODIFIER”**. If the violations contain additional information, it’s because that citation actually listed additional information. **It does NOT represent an all-inclusive list of short selling violations for these participants.**\n\n…You wanted to know how systematic this problem is, so here you go... *(EACH BROKER-DEALER NAME IS HYPERLINKED TO THEIR FINRA REPORT)*\n\n1. [Barclays](https://files.brokercheck.finra.org/firm/firm_19714.pdf) | Disclosure 36 – “SUBMITTED 86 SHORT INTEREST POSITIONS TOTALING 41,100,154 SHARES WHEN THE ACTUAL SHORT INTEREST POSITION WAS 44,535,151 SHARES.. FAILED TO REPORT 8 SHORT INTEREST POSITIONS TOTALING 1,110,420 SHARES” \n\na. $10,000 FINE\n\n2. [Barclays](https://files.brokercheck.finra.org/firm/firm_19714.pdf) | Disclosure 54 – “SUBMITTED AN INACCURATE SHORT INTEREST POSITION TO FINRA AND FAILED TO REPORT ITS SHORT INTEREST POSITIONS IN 835 POSITIONS TOTALING 87,562,328 SHARES”\n\na. $155,000 FINE\n\n3. [BMO Capital Markets Corp](https://files.brokercheck.finra.org/firm/firm_16686.pdf) | Disclosure 23 – “SUBMITTED SHORT INTEREST POSITIONS TO FINRA THAT WERE INCORRECT AND FAILED TO REPORT TO FINRA ITS SHORT INTEREST POSITIONS TOTALING OVER 72 MILLION SHARES FOR 11 MONTHS”\n\na. $90,000 FINE\n\n4. [BNP Paribas Securities Corp](https://files.brokercheck.finra.org/firm/firm_15794.pdf) | Disclosure 53 – “FAILED TO REPORT TO FINRA ITS SHORT INTEREST IN 2,509 POSITIONS TOTALING 6,051,974 SHARES”\n\na. $30,000 FINE\n\n5. [BNP Paribas Securities Corp](https://files.brokercheck.finra.org/firm/firm_15794.pdf) | Disclosure 9 – “ON 35 OCCASIONS OVER A FOUR-MONTH PERIOD, A HEDGE FUND SUBMITTED SALE ORDERS MARKED “LONG” TO BNP FOR CLEARING. FOR EACH OF THOSE “LONG” SALES, ON THE MORNING OF SETTLEMENT, THE HEDGE FUND DID NOT HAVE THE SHARES IN IT’S BNP ACCOUNT TO COVER THE SALE ORDER. IN ADDITION, BNP WAS ROUTINELY NOTIFIED THAT THE HEDGE FUND WOULD NOT BE ABLE TO COVER. NEVERTHELESS, WHEN EACH SETTLEMENT DATE ARRIVED AND THE HEDGE FUND WAS UNABLE TO COVER, BNP LOANED THE SHARES TO THE HEDGE FUND. IN TOTAL, BNP LOANED MORE THAN 8,000,000 SHARES TO COVER THESE PURPORTED “LONG” SALES”\n\na. $250,000 FINE\n\n6. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 1 - (literally came out on 5/6/2021) – “THE FIRM SUBMITTED INACCURATE SHORT INTEREST POSITIONS TO FINRA. THE FIRM OVERREPORTED NEARLY [55,000,000 SHORT SHARES](https://www.finra.org/sites/default/files/fda_documents/2018059464001%20Cantor%20Fitzgerald%20%26%20Co.%20CRD%20134%20AWC%20va.pdf) WHICH WERE CUSTODIED WITH AND ALREADY REPORTED BY ITS CLEARING FIRM, WITH WHICH CANTOR MAINTAINS A FULLY DISCLOSED CLEARING AGREEMENT”\n\na. $250,000 FINE\n\n7. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 31 - “…THE FIRM EXECUTED NUMEROUS SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT… THE FIRM, ON NUMEROUS OCCASIONS, ACCEPTED SHORT SALE ORDERS IN AN EQUITY SECURITY FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT WITHOUT BORROWING THE SECURITY…”\n\na. $53,500 FINE\n\n8. [Cantor Fitzgerald & Co](https://files.brokercheck.finra.org/firm/firm_134.pdf) | Disclosure 33 - “…EXECUTED SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT. THE FIRM HAD FAIL-TO-DELIVER POSITIONS AT A REGISTERED CLEARING AGENCY IN THRESHOLD SECURITIES FOR 13 CONSECUTIVE SETTLEMENT DAYS… FAILED TO IMMEDIATELY CLOSE OUT FTD POSITIONS… ACCEPTED SHORT SALE ORDERS FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT, WITHOUT BORROWING THE SECURITY OR HAVING REASONABLE GROUNDS TO BELIEVE THAT THE SECURITY COULD BE BORROWED…”\n\na. $125,000 FINE\n\n9. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 17 - “THE FIRM EXECUTED SALE TRANSACTIONS AND FAILED TO REPORT EACH OF THESE TRANSACTIONS TO THE FINRA/NASDAQ TRADE REPORTING FACILITY AS SHORT”\n\na. $57,500 FINE\n\n10. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 20 - “THE FIRM EXECUTED SHORT SALE ORDERS AND FAILED TO PROPERLY MARK THE ORDERS AS SHORT”\n\na. $27,500 FINE\n\n11. [Canaccord Genuity Corp](https://files.brokercheck.finra.org/firm/firm_1020.pdf) | Disclosure 31 - “…SUBMITTED TO NASD MONTHLY SHORT INTEREST POSITION REPORTS THAT WERE INACCURATE”\n\na. $85,000 FINE\n\n12. Citadel Securities LLC | [Citadel Has No Clothes](https://www.reddit.com/r/GME/comments/m4c0p4/citadel_has_no_clothes/) – LITERALLY ALL I TALK ABOUT IN THAT POST. GO READ IT\n\n13. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 10 – “THE FIRMS TRADING PLATFORM FAILED TO RECOGNIZE THAT THE FIRM WAS SELLING SHORT WHEN IT WAS ACTING AS THE CONTRA PARTY TO A CUSTOMER TRADE. AS A RESULT, THE FIRM ERRONEOUSLY REPORTED SHORT SALES TO A FINRA TRADE REPORTING FACILITY AS LONG SALES… EFFECTING SHORT SALES FROM ITS OWN ACCOUNT WITHOUT BORROWING THE SECURITY…”\n\na. $225,000 FINE\n\n14. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 59 – “…THE FIRM RECORDED 203,653 SHORT SALE EXECUTIONS ON ITS BOOKS AND RECORDS AS LONG SALES, SUBMITTED INACCURATE ORDER ORIGINATION CODES AND ACCOUNT TYPE CODES TO THE AUDIT TRAIL SYSTEM FOR APPROXIMATELY 2,775,338 ORDERS… “\n\na. $300,000 FINE\n\n15. [Citigroup Global Markets](https://files.brokercheck.finra.org/firm/firm_7059.pdf) | Disclosure 76 – “…FAILED TO PROPERLY MARK APPROXIMATELY 9,717,875 SALE ORDERS AS SHORT SALES… FINDINGS ALSO ESTIMATED THAT THE FIRM ENTERED **55 MILLION ORDERS** INTO THE NASDAQ MARKET CENTER THAT IT FAILED TO CORRECTLY INDICATE AS SHORT SALES…”\n\na. $2,250,000 FINE\n\n16. [Cowen and Company LLC](https://files.brokercheck.finra.org/firm/firm_7616.pdf) | Several Disclosures – almost every other disclosure is for failing to mark a sale with the appropriate indicator, including short AND long sale indicators\n\n17. [Credit Suisse Securities LLC](https://files.brokercheck.finra.org/firm/firm_816.pdf) | Disclosure 34 – “NEW ORDER REPORTS WERE INACCURATELY ENTERED INTO ORDER AUDIT TRAIL SYSTEM (OATS) AS LONG SALES BUT WERE TRADE REPORTED WITH A SHORT SALE INDICATOR”\n\na. $50,000 FINE\n\n18.  [Credit Suisse Securities LLC](https://files.brokercheck.finra.org/firm/firm_816.pdf) | Disclosure 95 – “BETWEEN SEPTEMBER 2006 AND JUNE 2008, CREDIT SUISSE FAILED TO SUBMIT ACCURATE PERIODIC REPORTS WITH RESPECT TO SHORT POSITIONS…”\n\na. $40,000 FINE\n\n19. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 50 – “THE FIRM FAILED TO REPORT SHORT INTEREST POSITIONS IN DUALLY-LISTED SECURITIES”\n\na. $200,000 FINE\n\n20. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 52 – “THE FIRM… EXPERIENCED MULTIPLE PROBLEMS WITH ITS BLUE SHEET SYSTEM THAT CAUSED IT TO SUBMIT INACCURATE BLUE SHEETS TO THE SEC AND FINRA… INCORRECTLY REPORTED LONG ON ITS BLUE SHEET TRANSACTIONS WHEN CERTAIN TRANSACTIONS SHOULD HAVE BEEN MARKED SHORT”\n\na. $6,000,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n21. [Deutsche Bank Securities INC.](https://files.brokercheck.finra.org/firm/firm_2525.pdf) | Disclosure 58 – “BETWEEN JANUARY 2005 AND CONTINUING THROUGH NOVEMBER 2015, THE FIRM IMPROPERLY INCLUDED THE AGGREGATION OF NET POSITIONS IN CERTAIN SECURITIES OF A NON-US BROKER AFFILIATE… IN ADDITION… DURING THE PERIOD BETWEEN APRIL 2004 AND SEPTEMBER 2012, THE FIRM INAPPROPRIATELY REPORTED CERTAIN SHORT INTEREST POSITIONS ON A NET, INSTEAD OF GROSS, BASIS..”\n\na. $1,400,000 FINE\n\n22. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 32 – “THE FIRM REPORTED SHORT SALE TRANSACTIONS TO FINRA TRADE REPORTING FACILITY WITHOUT THE REQUIRED SHORT SALE MODIFIER”\n\na. $260,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n23. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 54 – “FAILED TO ACCURATELY APPEND THE SHORT SALE INDICATOR TO FINRA/NASDAQ TRADE REPORTING FACILITY REPORTS… INACCURATELY MARKED SELL TRANSACTIONS ON ITS TRADING LEDGER”\n\na. $55,000 FINE\n\n24. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 63 – “…SUBMITTED TO FINRA AND THE SEC BLUE SHEETS THAT INACCURATELY REPORTED CERTAIN SHORT SALE TRANSACTIONS AS LONG SALE TRANSACTIONS WITH RESPECT TO THE FIRM SIDE OF CUSTOMER FACILITATION TRADES… THE FIRM REPORTED SHORT SALES AS LONG SALES ON ITS BLUE SHEETS WHEN THE TRADING DESK USED A PARTICULAR MIDDLE OFFICE SYSTEM…”\n\na. $1,000,000 FINE\n\n25. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 150 – “GOLDMAN SACHS & CO. FAILED TO REPORT SHORT INTEREST POSITIONS FOR FOREIGN SECURITIES AND NUMEROUS SHARES ONE MONTH… THE FIRM REPORTED SHORT INTEREST POSITIONS IN SECURITIES TOTALING SEVERAL MILLION SHARES EACH TIME WHEN THE ACTUAL SHORT INTEREST POSITIONS IN THE SECURITIES WERE ZERO SHARES… ACCEPTING A SHORT SALE ORDER IN AN EQUITY SECURITY FROM ANOTHER PERSON, OR EFFECTED A SHORT SALE FROM ITS OWN ACCOUNT, WITHOUT BORROWING THE SECURITY OR BELIEVING THE SECURITY COULD BE BORROWED ON THE DATE OF DELIVERY…”\n\na. $120,000 FINE\n\n26. [Goldman Sachs & Co. LLC](https://files.brokercheck.finra.org/firm/firm_361.pdf) | Disclosure 167 – “…THE FIRM FAILED TO REPORT TO THE NMC THE CORRECT SYMBOL INDICATING THAT THE TRANSACTION WAS A SHORT SALE FOR TRANSACTIONS IN REPORTABLE SECURITIES…”\n\na. $600,000 FINE (SEVERAL OTHER ISSUES REPORTED IN ADDITION TO SHORTS)\n\n27. [HSBC Securities (USA) INC.](https://files.brokercheck.finra.org/firm/firm_19585.pdf) | Disclosure 26 – “FIRM EXECUTED SHORT SALE TRANSACTIONS AND FAILED TO MARK THEM AS SHORT… HSBC SECURITIES HAD A FAIL-TO-DELIVER SECURITY FOR 13 CONSECUTIVE SETTLEMENT DAYS AND FAILED TO IMMEDIATELY CLOSE OUT THE FTD POSITION… THE FIRM CONTINUED TO HAVE A FTD IN THE SECURITY AT A CLEARING AGENCY ON 79 ADDITIONAL SETTLEMENT DAYS…”\n\na. $65,000 FINE\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI’m going to stop at ‘H’ because I’m tired of writing. Hopefully, you all understand the point so far. We’re only 8 letters into the alphabet and have successfully buried Ken to his waist. \n\nThe system that is used to mark the proper transaction type (sell, buy, short sell, short sell exempt, etc.) is obviously broken… There, I said it.. the system is INDUBITABLY, UNDOUBTEDLY, INEVITABLY F\\*CKED..\n\nRegardless of the cause- fraud or negligence- there are too many firms failing to accomplish a seemingly simple task. The consequences of which are creating far more shares than we can imagine. It’s a gigantic domino effect. If you fail to properly mark 1,000,000 short shares and a year goes by without catching the problem, it’s already too late. They’re like the f\\*cking replicators from Stargate.. \n\nIn each of the examples listed above, the short interest on the stock was understated by the number of shares excluded… and that was just a handful..\n\nKnowing this, how can someone look at the evidence and say it’s *trivial….?* \n\nNo one really knows HOW systematic this issue is because it is so deeply incorporated in the market that it has BECOME the system itself. Therefore, there is obviously something much deeper going on, here.. How does one argue against the severity of these problems after reading this? There are FAR too many things that don’t make sense and FAR too many people turning a blind eye..\n\nThe only conclusion I keep coming back to is that the people with money know what’s going on and are desperately trying to keep it under wraps..\n\n..So….  In an effort to prove this, I looked for violations that showed their desperation to protect this f\\*cked up system.\n\n..Buckle up..\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n ***HOUSE OF CARDS - PART 3 (I'm uploading it now; will link ASAP)***",
    "title": "House of Cards - Part 2",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/nlwaxv/house_of_cards_part_2/"
}