{
    "author": "AlexanderHood",
    "created_utc": 1622005991.0,
    "distinguished": null,
    "edited": 1622008889.0,
    "id": "nl90c5",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nl90c5",
    "num_comments": 265,
    "permalink": "/r/Superstonk/comments/nl90c5/may_26th_update_on_the_marriedput_forensic/",
    "score": 5758,
    "selftext": "T'was the night before MOASS'mas and if you're too jacked to sleep, I have something to keep you jacked until Market Open.\n\nFollowing up to my post from last week, [here](https://www.reddit.com/r/Superstonk/comments/ngp969/may_19th_update_on_the_marriedput_forensic/).\n\nIf you haven't already that, this business about Married-Put-Remnants and Irrational-Puts won't make much sense, so go catch up and then pop back here after, kthxbye!\n\n**Last week, on Days of our Lives Buying and Hodling ...**\n\nWe saw about 75k Irrational Puts expire. Poof! Gone. Where did they go?\n\nWhat we did *not* see Monday morning was an additonal 75k Irrational Put options get opened up, that's for sure. What we *did* see yesterday and today, was a nice well-distributed build up of Irrational puts all across the board, spread out like sand on a beach. Totally innocuous.\n\n**Pop quiz hot shot!** It's 2:30pm on a Tuesday, GME is ripping faces and chewing bubble-gum, boosters firing from $180 to over $210! What do you do?\n\n*Buy put options at a $30 strike for this Friday.*\n\nWhat??? No. Why on earth would anyone buy that crap? It's worthless. *Irrational*, if you will. ;) But that's exactly what happened today. And a lot more of it.\n\n(Note: Some of todays largest put option trades were late afternoon, low-strike, low-cost and interestingly, not out of the *PHLX* exchange! Aha!)\n\n**Naked Naked Naked ... Pop Pop Pop**\n\nI've been watching the low-strike put options open interest to see how it changes day-to-day. Here is a comparison of today to yesterday, a snap-shot of some Irrational Puts popping into existence:\n\n**Option Expiry Date:** May 28th\t\t\t\n\n**Strike** | **OI May 24** | **OI May 25** | **Delta**\n:--|:--|:--|:--\n$10.00 | 348 | 363 | 15\n$20.00 | 137 | 205 | 68\n$30.00 | 603 | 756 | 153\n$40.00 | 501 | 647 | 146\n$50.00 | 296 | 704 | 408\n$60.00 | 457 | 404 | -53\n$70.00 | 759 | 813 | 54\n$80.00 | 327 | 395 | 68\n$90.00 | 185 | 493 | 308\n$100.00 | 3,006 | 3125 | 119\n$110.00 | 1,027 | 954 | -73\n$120.00 | 806 | 901 | 95\n$130.00 | 560 | 973 | 413\nSum\t| 9012 | 10733 | +1,721\n\nWith GME soaring, the cost of most of these low-strike options dropped to super-cheap levels. You could pick up puts at even a $130 stike for just $0.23 cents! Looking over the distribution of puts at strikes today, we saw widespread increases all the way up to about the $130 strike. So it would seem that whoever programmed the algo to distribute these evenly doesn't want to pay more than about $0.25 per contract.\n\nIf the Hedgies have a budget of about $0.25 max for Married Put contract, let's take a look at the following week's Op Ex to see if we see the same pattern of evenly distributed puts added today for low-strike options.\n\n**Option Expiry Date:** Jun 4\t\t\t\n\n**Strike** | **May 24**\t| **May 25** | **Delta**\n:--|:--|:--|:--\n$10.00 | 134\t | 134 | 0\n$20.00 | 83 | 92 | 9\n$30.00 | 270 | 291 | 21\n$40.00 | 186 | 233 | 47\n$50.00 | 424 | 476 | 52\n$60.00 | 262 | 278 | 16\n$70.00 | 76 | 102 | 26\n$80.00 | 58 | 62 | 4\n$90.00 | 77 | 114 | 37\n$100.00 | 361 | 466 | 105\n$110.00 | 239 | 315 | 76\n$120.00 | 260 | 389 | 129\n$130.00 | 174 | 224 | 50\nSum | 2604 | 3176 | +572\n\nYup.\n\nAnd we see even more of these Irrational Puts added to June 11th Op Ex contracts, more added into the Hedgie perennial favorite the July 16th contracts and a few more in the Jan 21, 2022 contracts. (Refer to previous post for the last analysis I did for these last two dates.)\n\nEvery day we are seeing more and more of these Short-Term put options come into existence, about 4-5,000 per day representing about 400 to 500,000 shares.\n\n**What does all this mean?**\n\nShort Interest continues to be hidden in Long-Term Low-Strike Put options as well as low-cost Short-Term put options.\n\nIn my previous post I did an analysis using a new criteria for what an Irrational Put is, a contract for $0.10 or less with high IV. Looking at today's newly minted put contracts, these are getting up to the $0.25 range on the high-end, although the *majority* remain clustered below $0.10 there are some few being added at even these higher ranges most likely due to some semi-random algo trying to hide these puts here without accidentally making it totally obvious that they have some specific allocaation.\n\n**What about the puts that expired last week?**\n\nYes indeed. What about them.\n\nNothing. They expired.\n\nAfter yesterday and today's powerful confirmation of the T+35, T+21 theory, I am inclined to think the Hedgies just stuck the Market Maker with them. Legally, the Married-Put is used to justify the creation of the Naked Short, the two allow the MM to remain 'neutral'. Ok, but what happen's when those Naked Shorts are still out there and the Put contract that was balancing them out expires? *The MM has to cover them.*\n\nNot straight away, the day after Op Ex (the following Monday) begins the T+35 part of the FTD cycle. They will cover those shares 35 days hence.\n\nThe MM's are out there covering Naked Shorts on the 35th day, which would start spiking the price action so the SHF need to create *more* Married-Puts to create *more* Naked Shorts to again push GME down.\n\nToday, GME shot up 20% and the Short Interest *increased*! The MM's are buying to cover which is spiking the price and the SHF continue to drive it down with Married-Put Naked shorts. The SHF have *not* started covering, still just kicking the can another 35 days down the road.\n\n**Implications for Short Interest**\n\nI had previously estimated SI using Married Put remnants at 172%, but now that we are seeing Irrational Puts being created *daily*, that estimate is very, very low. There are way more Irrational Puts in existence, *including Short-Term puts and also expired puts* than I had accounted for. By the time I finish adding all of it together the Short Interest is going to be north of 340% at a minimum.\n\nEach week as these Short-Term Irrational puts expire, they are kicking off a batch of FTD's that need to get covered ~35 days later. Expired yeah, but the impact they had on the price action when they were first created persists, with GME trading sideways for weeks and weeks on end. Eventually they get covered (often at a lower price) and new Naked Shorts are created to replace them. In the meantime, every Monday a huge new batch of Naked Shorts is being created and *juggled* in a huge T+35 day loop.\n\nLast week the equivalent of over 7.5M shares worth of puts expired. That doesn't mean every week they have been creating millions of Naked Shorts, but if they want to keep the price action from rising, sufficient Naked Shorts need to be created equal to the total retail buying pressure. How much is that? We'd need to go count all the expired Irrational Puts since Jan to get an estimate. If we knew, we could better estimate the true SI and the MOASS peak & geometric mean. Data from Jan did indicate this practice of using Married-Puts increased by 10x after Jan 28th.\n\nI really hope Cohen just comes out and tells us how many shares are outstanding. That would be easier. :/\n\n**Sources**\n\n[Original Post on Married Puts](https://www.reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/)\n\n[DTC-005 Original Doc](https://zenodo.org/record/4718936/files/005%20-%20SEC%20SR-DTC-2021-005-2%20-%20submission%20of%20rule%20finding.pdf?download=1)\n\n[Share Borrowing Program](https://smithonstocks.com/part-7-illegal-naked-shorting-dtcc-continuous-net-settlement-and-stock-borrowing-programs-have-loopholes-that-facilitate-illegal-naked-shorting/)\n\n[Barchart Options](https://www.barchart.com/stocks/quotes/GME/options?expiration=2021-05-21-m&moneyness=allRows)\n\n[Stonk Tracker](https://gme.crazyawesomecompany.com)\n\n**Required** \n\n🚀🚀🚀",
    "title": "May 26th Update on the Married-Put Forensic Analysis - Shorts all the way down",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nl90c5/may_26th_update_on_the_marriedput_forensic/"
}