{
    "author": "GuitarEvil",
    "created_utc": 1617974108.0,
    "distinguished": null,
    "edited": 1617974251.0,
    "id": "mngy2b",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mngy2b",
    "num_comments": 1102,
    "permalink": "/r/Superstonk/comments/mngy2b/do_not_vote_on_the_nscc2021801/",
    "score": 13590,
    "selftext": "THERE IS NO FUCKING THING AS VOTING ON THE RULE,  PERIOD.  DO NOT comment.  Here is how these rules work by someone that has over 40 years of writing, reviewing, government regulations and rules.\n\n&#x200B;\n\n1. A kid sits down and writes a rule, he gets it approved by the boss and then it goes to a committee who shits all over it.\n2. Kid gets it back, incorporates the comments, and again the review process.\n3. Finally it passes all the bosses and attorneys and it is published for official comment.\n\nNow there are two roads.  1. A group of stupid idiots decide that they are \"voting\" and send a bunch of comments, in fact they flood the board with comments.  LEGALLY the DTCC MUST go back and read every fucking suggestion and then they must all be considered.  Those comments have to go back through steps 1-3 again, only longer because there are various hurdles and objections.  You are talking added weeks.  Then and only then after every attorney and boss in the DTCC have signed off on the new and approved draft, and everybody is happy they covered their ass again, it goes out for comment.  Then another bunch of apes floods the comment section wither suggestions.  and the process is repeated again and again.  Months and years here people\n\n&#x200B;\n\n\\-or\\_\n\n&#x200B;\n\nNo comment on the rule and we put it in place.  Period.  So stop your stupid comments and thinking you are able to \"Vote\"  Yes the rule is good, I have no comment, so put it into place Now.  Thats what not commenting will do.  Just leave it alone to get it put into action faster",
    "title": "DO NOT VOTE ON THE NSCC-2021-801",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/mngy2b/do_not_vote_on_the_nscc2021801/"
}