{
    "author": "ORaNGeTechPB",
    "created_utc": 1624056461.0,
    "distinguished": null,
    "edited": false,
    "id": "o32aqe",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_o32aqe",
    "num_comments": 238,
    "permalink": "/r/Superstonk/comments/o32aqe/with_automated_within_the_hour_margin_calls/",
    "score": 3263,
    "selftext": "Several people I work with are deep into GME and not all are a fan of the sideways trading. I remind them of the FTD's, new regs, the Russell 1000 etc.\n\nBut the thing that always seems to perk them up the most \"Could you imagine how beaten, frustrated and tired the dumb bastards at the other end of this feel right now?\".\n\nThey've shit talked not just retail, but an entire generation and beyond and now their games don't work. The rules of panic selling no longer apply.\n\nThey can try FUD, they can try dips and flash crashes, but a bunch of fucking retards look at it and gobble it up and nothing they do will make apes fucking sell!\n\nMSM articles and interviews to shit on GME, diversions in precious metals (tanking), diversions with crypto (that shit has crashed 4 times?) and pushing other stocks only for \"Nope, still holding.\"\n\nSo, if you feel frustrated due to one week of sideways trading, they've been sitting for 6 months knowing that they're dead in the water. They just desperately fight to get to the next day while retard retail buyers mock them and laugh at stupid fucking memes.\n\nNow with 002 they're going to lose the complicit safety net of their lenders not being willing to issue margin calls because it'll hurt them as well. Now it's a computer who decides when they die..\n\nBuy, hodl and wait for launch.",
    "title": "With automated within the hour margin calls coming into effect with 002 could you imagine how puckered those assholes will be? 💎🙌🦍🚀🌛",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o32aqe/with_automated_within_the_hour_margin_calls/"
}