{
    "author": "C2theC",
    "created_utc": 1628015160.0,
    "distinguished": null,
    "edited": false,
    "id": "ox9l2d",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_ox9l2d",
    "num_comments": 47,
    "permalink": "/r/DDintoGME/comments/ox9l2d/gme_156_hitwe_are_entering_a_buy_zone/",
    "score": 667,
    "selftext": "# Price Action Recap\n\nIn my post last week, I had stated the following:\n\n>Shorts will be interested to push GME down towards the 02/02 AVWAP @ 152.72, so this means it is possible that GME prices bottom out around 156.00.\n\nThe price level ended up coming a bit sooner on Monday 08/02 than I expected. While I should have updated all of Reddit yesterday morning after seeing GME touch 155.06 and close at 157.65, I posted the following in my own private trader group, that I keep amongst close friends:\n\n[Internal Discussion](https://preview.redd.it/04xylin1r6f71.png?width=639&format=png&auto=webp&s=d747393d0305e219bee2367a2a8c7b7d183e15d3)\n\n\\[speculation\\] Looking the GME price action being \"walked-down\" by the shorts, this says to me that shorts are trying to not trigger a massive buying spree, by performing a sort of Chinese water torture technique, to chip away at our diamond hands resolve, and to keep new retail apes from joining. Also, there is the possibility that due to the S&P 400 Mid Cap rebalancing that is to conclude on 08/04, where around $200M of shares need to be sold, shorts are taking advantage of the situation to push the price down further.\n\nThe takeaway from this are:\n\n* Technical Analysis is an art, sort of like trying to predict the weather a week in advance, and with GME, it is Fuzzy TA due to the manipulation\n* For TA, when metrics such as price levels, indicators, support/resistance hit early and you have a date target, they should be revised immediately\n* Trust your own DD and analysis\n* Buy and hodl\n* I'm not a [witch](https://www.reddit.com/r/Superstonk/comments/owa2de/gme_daily_discussion_thread/h7g0fwr/)\n\n# Indicators\n\nIn regards to my parallel channel, I had previously stated:\n\n>I could have made the lower channel lower, but visually, I wanted to see a possible buy zone for myself.\n\nBelow is a chart with my lower parallel channel, the gray line. You will also notice a few other interesting parts about this GME chart:\n\n* Finally below two Standard Deviations of the Bollinger Band\n* RSI oversold at 31, the lowest it has been in the last twelve months, with the second-lowest back on 07/15 (the red line is a visualization where I place RSI directly on my charts)\n* Below the 02/02 AVWAP @ 152.77 by -1.26% (GME @ 150.85 as of this post)\n\n[Price Action](https://preview.redd.it/ve96lun1r6f71.png?width=2212&format=png&auto=webp&s=b7d72687b6b680579c18d51c659e5014778194f5)\n\nWhen displaying the RSI (oversold/overbought) and SMI (momentum) with the GME  chart, we see that we are in an oversold condition that is nearing the lower gray line, and there continues to be some downward momentum.\n\n[Indicators](https://preview.redd.it/r3f8tpn1r6f71.png?width=2213&format=png&auto=webp&s=2d76e816aa724ea978c1f19290ecf4ce25334aa7)\n\nHere is just the RSI chart showing how oversold GME has become.\n\n[RSI](https://preview.redd.it/p7ad7ln1r6f71.png?width=2208&format=png&auto=webp&s=7a7c8d3db48f27683957cd274546d5d8f60f4dbc)\n\nHowever, in looking at the SMI, which is an indicator of momentum (where I overlaid the RSI in blue on top of the SMI), there is still a bit of downwards momentum for the stock.\n\n[SMI](https://preview.redd.it/im4lfln1r6f71.png?width=2211&format=png&auto=webp&s=acf4af5ed0e2076fc14ae48a8ec15a7e78bec2a8)\n\n# Is This a Buy Zone?\n\nReminder that GME is on sale five days a week, fifty-two weeks a year.\n\nThe following tells me that we have entered a buy zone:\n\n* GME is below two Standard Deviations of the Bollinger Bands\n* RSI is at 31\n* GME overshot the 02/02 AVWAP, that also defined the buy zones on 03/24, 04/13, and 05/11\n\nThe prudent recommendation is that if you believe in the stock and see this as a discount, rather than going all-in, you can scale-in your purchases. I call it the 3-2-1 legs, where if you intend to buy 6 shares:\n\n* Buy 3 shares if you are very convicted of the price\n* Buy 2 shares if you are somewhat convicted that this is a low\n* Buy 1 share if you just like the stock and think it may go down more, but don't want to miss out\n\nThis does not mean that GME will not keep drifting down, as the SMI indicates there is still some downward momentum. You may want to consider how 08/04 and 08/05 shape out, as I said previously:\n\n>it appears that GME still has a little more room for the shorts to push it down, midweek next week, around 08/04 or 08/05.\n\nAny way you cut it, we are getting a great discount now, and I am planning to buy and hodl more shares very soon.",
    "title": "GME @ 156 Hit—We Are Entering a Buy Zone",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/DDintoGME/comments/ox9l2d/gme_156_hitwe_are_entering_a_buy_zone/"
}