{
    "author": "rensole",
    "created_utc": 1623316793.0,
    "distinguished": null,
    "edited": 1623317627.0,
    "id": "nwj95f",
    "text_only": true,
    "flair_text": "Daily News 🦍💎🙌🚀",
    "name": "t3_nwj95f",
    "num_comments": 1434,
    "permalink": "/r/Superstonk/comments/nwj95f/the_daily_stonk_06102021/",
    "score": 9226,
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/p7qh3whzde471.png?width=1600&format=png&auto=webp&s=87579d5918f1efd7a7c98234519b6c2d6b2a3070\n\nGood Morning San Diago,\n\nI am Rensole and this is your daily news.\n\nDoes anyone smell that?\n\n\\*insert flashy intro card\\*\n\nhttps://preview.redd.it/nqplhq91ee471.png?width=680&format=png&auto=webp&s=b1e578460e7b924a8d1f3c560507c8ba95d19ff5\n\n# GME what we learned yesterday\n\n* Smaller than expected net income loss\n* More than $770MM cash on the balance sheet\n* Poached key Amazon executives\n* Pivot to E-commerce\n* In addition to ex-Amazon hires, ex-FB and google\n* New NFT platform\n* No debt\n* Price matching\n* Same day delivery, new fulfilment centres\n* Social media presence\n* Opening community hubs for gaming\n* Brand recognition\n\nAll this aaaaand the stock price goes down... wut?\n\nA lot of information was dumped yesterday all at once, so let's get cracking shall we dudes?\n\nhttps://preview.redd.it/2vay5eisee471.png?width=1286&format=png&auto=webp&s=2abf52e1bdd33cbe4a4958436701447f6e2e3a10\n\nDiana Saadeh-Jajeh (current interim Chief financial officer) will be replaced by Mike Recupero, and will be stepping down to her old position.\n\nMatt Furlong will be the new CEO for GME, start date is June 21st.\n\nMike Recupero the new CFO Start July 12th\n\n[Source](https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-announces-appointments-chief-executive-officer-and)\n\nMatt Furlong:\n\nMatt has been with Amazon for the past 8/9 years and has extensive knowledge of the technical side of things and has been the \"country leader\" for amazon for the past 2 years.\n\nMike Recupero:\n\nMike has been with Amazon for the past 17 years, he has experience with among other things the financial planning, digital advertisement, consumer business end, being the VP finance and CFO for Amazon Prime video and was the vp and CFO for north america.\n\n&#x200B;\n\nEven though we may not know a lot about these guys right now I'm sure that RC has chosen these people for a reason and as he said it \"putting the right pieces in the right places\".\n\n&#x200B;\n\nhttps://preview.redd.it/ezkb709fge471.png?width=661&format=png&auto=webp&s=75f898434ca538b493ac64799bf9495d1b7d2a2b\n\n# GameStop Releases First Quarter 2021 Financial Results\n\nForm 8-K\n\n[https://gamestop.gcs-web.com/node/18941/html](https://gamestop.gcs-web.com/node/18941/html)\n\n&#x200B;\n\nOk wow, lets go over some bulletins points what is in the 8k (I'll go over the details in a bit).\n\n**First Quarter Fiscal 2021 Highlights**\n\n* Net sales increased **25.1% to $1.277 billion, compared to $1.021 billion** in the fiscal 2020 first quarter, overcoming a nearly **12% reduction in the Company’s global store base** due to strategic de-densification efforts, and continued store closures across Europe due to the COVID-19 pandemic;\n* **Gross margin was 25.9%, a decline of 180 basis points compared to the fiscal 2020 first quarter;**\n* Reported selling, general and administrative expenses were $370.3 million, a decline of $16.2 million, or 4.2%, from $386.5 million in the fiscal 2020 first quarter. Adjusted for severance, transformation and other costs, selling, general and administrative expenses were $351.7 million, a decline of $29.5 million, or 7.7%, from $381.2 million in the fiscal 2020 first quarter;\n* Operating loss of **($40.8) million compared to ($108.0) million** in the fiscal 2020 first quarter. Adjusted operating loss of ($21.6) million compared to ($98.8) million in the fiscal 2020 first quarter;\n* Net loss of ($**66.8**) million, or ($1.01) per diluted share as compared to net loss of **($165.7**) million, or ($2.57) per diluted share, in the fiscal 2020 first quarter. Adjusted net loss of ($29.4) million or ($0.45) per diluted share, compared to adjusted net loss of ($157.6) million or ($2.44) per diluted share in the fiscal 2020 first quarter;\n* Adjusted EBITDA of ($0.7) million compared to ($75.5) million in the fiscal 2020 first quarter, and;\n* Income tax expense was $1.3 million compared to income tax expense of $50.4 million in the fiscal 2020 first quarter.\n\nOk so this is all good news right? then why the fuck is MSM reporting it like they had extreme losses?\n\nGoing off of these numbers alone its amazing, zero debt, an increase in sales and cutting global operating by over half\n\n&#x200B;\n\nhttps://preview.redd.it/taktybdehe471.png?width=1182&format=png&auto=webp&s=0f805e5ce78e66d29bb4e56a0e546c0e836dc6e4\n\n# the 5.000.000 share offering\n\n[https://gamestop.gcs-web.com/node/18961/html](https://gamestop.gcs-web.com/node/18961/html)\n\nI still need to go over this one with a fine tooth comb to find everything that is in this document, the things that do stand out to me are just with the last share offering, they can offer up to 5 million shares OR a max aggregate of  $1,276,950,000 usd.\n\nWhat the exact details of the share offering is right now, I can't say but I will be going over everything as well as I can along with others and expect us to have more information in the days to come.\n\n&#x200B;\n\n# The 10-Q\n\n[https://gamestop.gcs-web.com/node/18951/html](https://gamestop.gcs-web.com/node/18951/html)\n\nthis one ties back to the quarterly report, but with more details inside, one of those details that caught my eye however is the last sentence of page 21\n\n>On May 26, 2021, we received a request from the Staff of the SEC for the voluntary production of documents and information concerning a SEC investigation into the trading activity in our securities and the securities of other companies. We are in the process of reviewing the request and producing the requested documents and intend to cooperate fully with the SEC Staff regarding this matter. This inquiry is not expected to adversely impact us.\n\n&#x200B;\n\nHmm may 26th what did Cohen post a few days later? oh yeah riiiight RIP DUMBASS\n\n&#x200B;\n\nhttps://preview.redd.it/yq9cpc17je471.png?width=461&format=png&auto=webp&s=4c20c655e5592c3f470ef8b48dba0ecb40c4b230\n\n&#x200B;\n\n# The 14-A\n\n[https://news.gamestop.com/static-files/b8fcb1ce-dfcf-42fd-89a8-dfaed2084dcc](https://news.gamestop.com/static-files/b8fcb1ce-dfcf-42fd-89a8-dfaed2084dcc)\n\n2021 Proxy Statement Notice of 2021 Annual Meeting of Stockholders to Be Held on June 9, 2021\n\nThis seems to be the proxy voting materials that other people had already received before the meeting, but as per rules they have to disclose this after, as per the rules\n\n&#x200B;\n\nI want to give a shoutout to u/jth1 for his exponential floor, because it seems to be accurate as hell for at least finding the lowest points for the stonk, which is awesome to have right now\n\n&#x200B;\n\nhttps://preview.redd.it/uj0tiophje471.png?width=640&format=png&auto=webp&s=e8d0b5b61be2106ba3e324f1e2dce8cc65d7dcdb\n\nSo buckle up\n\n&#x200B;\n\nReverse Repo hit 502.904 billion with 59 party members\n\n&#x200B;\n\nhttps://preview.redd.it/ur2oge7nje471.png?width=960&format=png&auto=webp&s=f8c21a2d44ace62da2eb77f71302426d6954af03\n\n&#x200B;\n\nFor the people who expected yesterday we'd hear the overvoting, lets remember what Wes Christian said;\n\n&#x200B;\n\nhttps://preview.redd.it/hey09fyuje471.png?width=828&format=png&auto=webp&s=8b29000f6a5dede2a3f71948d9ba3354abe8514b\n\nAlso lets look at some of the data we DO have.\n\nThe float on april 14th/15th was  **54.16M** [source](https://web.archive.org/web/20210414170020/https://finviz.com/quote.ashx?t=GME)\n\nThe votes yesterday came to about **55M** Votes that's the entire float right?\n\nSo how come a lot of apes couldn't vote, lots of people being locked out, Etoro reporting only **63% have voted!**\n\n&#x200B;\n\nhttps://preview.redd.it/74o6bhbeke471.png?width=640&format=png&auto=webp&s=ae12f546f4d6dd2eccf5a9dcf21f055a8bbfb373\n\nNot only to mention all the people who couldn't vote at all, the people who have added more shares to their account since april 15th (2 months of buying the dip), and brokers perhaps culling the voting numbers because let's remember what we have heard from the past ama's\n\n&#x200B;\n\nhttps://preview.redd.it/47oigizale471.png?width=640&format=png&auto=webp&s=d154ad30d59d15240a455cd295f80cd25591d114\n\nAlso on the votes check out this [thread](https://www.reddit.com/r/Superstonk/comments/nw8ak8/you_cant_report_an_overvote_on_an_8k_pass_it_on/) by u/stronkape89\n\nYou can't report an overvote on an 8k form, we have seen fud like this before were we EXPECTED to see some sort of information in the document only to not have it and people would spread fud about it.\n\nOr as the top comment on there even says by  u/Sioned-Song\n\n>Gamestop 8K doesn't have a final vote count.  \n>  \n>Compare last year's:[https://investor.gamestop.com/node/18081/html](https://investor.gamestop.com/node/18081/html)  \n>  \n>To this year's:[https://investor.gamestop.com/node/18956/html](https://investor.gamestop.com/node/18956/html)  \n>  \n>Last year there is a statement with the total number of votes. That statement is missing from this year's document.\n\n&#x200B;\n\n[it always was](https://preview.redd.it/gwom0rdxne471.png?width=960&format=png&auto=webp&s=0972fc548f55e1b5db812f398248dd59ff59f29d)\n\nthis along with the SEC probe leads me to believe there is more at play here in the backstage that we just don't know about and we will have to wait to see what the results are regarding this, However reading all this I personally believe that we do still own the float, and nothing has changed.\n\nYesterday we saw a lot of attempts of FUD, and my god do I love Satori it was easy and simple to actually pick a lot of these idiots out, mostly new or newish accounts or revived dead accounts suddenly springing back to life to attack every chance they got, be it from attacking mods, people and the always classic \"better sell, it's over\" schtick.\n\n&#x200B;\n\nhttps://preview.redd.it/6e3vgpmrne471.png?width=577&format=png&auto=webp&s=49a087966b762bdc325def13727ac888e59aecbf\n\n# Breaking news, GME price falls to levels not seen since... 3 days?\n\nSeriously for the new apes just relax guys, we expected this to be a long hard ride, but... a flash crash attempt and the stock only goes down 30/40 bucks... ok... that's nothing lol.\n\nThe thesis still stands\n\nBuy and hold, and now we can add \"buckle up\" to it.\n\nthere are still a lot of things we don't know what GME is going to do with them, the Microsoft partnership, the nft, the ecommerce side of things, how they're going to adapt and pivot exactly (futures road map) so we hodl.\n\nAgain there was a lot of information that got dumped yesterday so it will take a few days until we have combed through everything and found all the information, so everything in here is just preliminary.\n\nAs soon as we all find stuff you'll see it pop up, I know lots of apes are currently hard at work getting to the bottom of everything because I'm with a group of people investigating some parts and I'm sure we are not the only ones, so relax sit back, read the documents, and if you grow a wrinkle share it with the group <3\n\n&#x200B;\n\nhttps://preview.redd.it/8qgymimloe471.png?width=554&format=png&auto=webp&s=37ed9b2bfa93f8c4bec798af80da52bee95ab282\n\n# EXCELLENT!\n\nBe friendly, help others!\n\nas always we are here from all different walks of life and all different countries.\n\nThis doesn't matter as we are all apes in here, and apes are friends.\n\nDoesn't matter if you're a silverback a chimp or a bonobo.\n\nWe help each other, we care for each other.\n\n**Ape don't fight ape, apes help other apes**\n\nthis helps us weed out the shills really fast, as if everyone is helpful, the ones who aren't stand out.\n\nremember the fundamentals of this company are great, so for the love of god if someone starts with trying to spread FUD, remind yourself of the fundamentals.\n\nThere is no sense of urgency, this will come when it comes, be a week, be it a month be it six.\n\nWe don't care, just be nice and lets make this community as Excellent as we can!\n\nRemember one of the only ways to counter the Cointelpro we have seen is by being overly nice, so treat all the other apes as if you're dating and you wanna get to first base.\n\nhttps://preview.redd.it/za8fahwnoe471.png?width=400&format=png&auto=webp&s=2b2ce96b144548800f99aa25382df3d8f0b41c67\n\nremember none of this is financial advice, I'm so retarded I'm not allowed to go to the zoo 'cause they'll put me in the cage with the rest of my ape brothers.\n\nIf anything happens throughout the day we will be adding it here.\n\nbackups:\n\n[https://twitter.com/rensole](https://twitter.com/rensole)\n\n[https://twitter.com/PinkCatsOnAcid](https://twitter.com/PinkCatsOnAcid)\n\n[https://twitter.com/RedChessQueen99](https://twitter.com/RedChessQueen99)\n\n&#x200B;\n\nEdit 1:\n\n Short Volume Ratio Update for 9. June 2021 [\\#GME](https://twitter.com/hashtag/GME?src=hashtag_click)  from AnnihilationGod\n\n[https://twitter.com/Annihil4tionGod/status/1402908783525961729](https://twitter.com/Annihil4tionGod/status/1402908783525961729)\n\n&#x200B;\n\nhttps://preview.redd.it/ggwxmpw5re471.png?width=4096&format=png&auto=webp&s=25378ad9313ffe18a97dc465d17b4a45785e8296\n\nhmmmm my wrinkle in crinkling 🤔",
    "title": "The Daily Stonk 06-10-2021",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nwj95f/the_daily_stonk_06102021/"
}