{
    "author": "headguts",
    "created_utc": 1626608969.0,
    "distinguished": null,
    "edited": 1626609263.0,
    "id": "omp2s6",
    "text_only": true,
    "flair_text": "Shitpost 👾",
    "name": "t3_omp2s6",
    "num_comments": 306,
    "permalink": "/r/Superstonk/comments/omp2s6/raise_your_hand_if_you_dont_give_a_fuck_about_mod/",
    "score": 10044,
    "selftext": "Shills peddle FUD and verifiably false DD. If you like the stock and believe in the company /MOASS, You know it makes sense to buy and hodl.  \n  \nUs apes know the DD is sound. If you are too smoothbrained to dissect the DD, a wrinkle brain has helped you connect the dots. At this point in the game, retail investors of superstonk know the truth about the state of US markets, fund over leverage, and greedy disregard for the lives and livelihoods of the people of Earth.  \n  \nThe only way shady mods are going to be able to kill a good sub is by deleting legit posts or making them inaccessible. DD cuts through bullshit here in 24 to 48 hours consistently. If mods are censoring free speech about discussion of stocks we like and intentionally pushing FUD, proof of that will make me abandon the sub.\n\nI'm happily avoiding any mod drama posts or participation in discussions of concern about whatever the hell is going on. This sub is nothing without the people who want to be here. People often make noise for attention, and my attention is on the stock. I understand the irony here, but I'm not posting about, commenting on, or voting on any posts about the subject until I hit the leave button... and I encourage you to do the same. \n\nUntil then, I'm buying, hodling, and shooting the shit with other people who like the stock, or have something to say about it that I haven't heard yet. But I'll take anything new with a grain of salt until DD vets it.\n\nApe no fight ape. Ape help ape.\n\nI'm throwing a party on the moon.",
    "title": "Raise your hand if you don't give a fuck about mod drama",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/Superstonk/comments/omp2s6/raise_your_hand_if_you_dont_give_a_fuck_about_mod/"
}