{
    "author": "Chemical-Pop-8576",
    "created_utc": 1622425536.0,
    "distinguished": null,
    "edited": 1622472799.0,
    "id": "nopm6v",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_nopm6v",
    "num_comments": 214,
    "permalink": "/r/Superstonk/comments/nopm6v/citadel_has_listed_sales_of_securities_totaling/",
    "score": 2473,
    "selftext": "Happy Sunday Evening Apes!\n\nEDIT 3: 10:50 AM EST\n\nSome apes have discovered things! Which was the purpose and intent of the post. Thank you all for reading and giving some insight into WUT DOING version 69.3.  It appears that these filings are in relation to capital being raised by Citadel through investors. 🤷‍♂️ Who the hell would invest in Citadel at this point? 🤮 I dunno...but they definitely have more cash on hand now to do whatever they wanna do with it.\n\nSo, the biggest takeaway: this is NOT liquidation...but it IS a Girl Scout cookie sale amongst their investors to raise capital for whatever they need 💴 for. \n\nI've taken a break from exploring afterlife options (in Assassins Creed Valhalla) to my phone blowing up from Twitter posts. The Twitter posts look like they could contain some juicy stuff...so I'm looking to crowd pool some hive minded Apes that understand SEC filings.\n\n&#x200B;\n\nhttps://preview.redd.it/te4ysysm1d271.png?width=653&format=png&auto=webp&s=3c4122558f45b187c005e78db614e74ebb8eb5d0\n\nAccording to the following link from the SEC below, Citadel (under 11 different names) posted sale forms for hefty amounts of securities totaling **28 billion** on Friday.  There haven't been any filings of this type since approximately 1 year ago, spaced amount among the funds.  I'm not sure if this is an annual type filing, since there are years skipped on these filings.  (I would guess not).\n\nCITADEL TACTICAL TRADING LLCCitadel Equities Fund LLCCitadel Wellington LLCCitadel Global Fixed Income Fund LLCCitadel Candlestick EIF LLCCITADEL TACTICAL TRADING LTDCitadel Equities Fund Ltd.Citadel Kensington Global Strategies Fund Ltd.CEIF LLCCitadel Global Fixed Income Fund Ltd.CEIF Partners LLC\n\n[https://www.sec.gov/edgar/search/#/q=%2522CITADEL%2522&dateRange=30d&category=custom&forms=D](https://www.sec.gov/edgar/search/#/q=%2522CITADEL%2522&dateRange=30d&category=custom&forms=D)\n\nExample:\n\nBottom right corner shows some of the dates for the Recent SEC Filings on [https://whalewisdom.com/filer/ceif-partners-llc](https://whalewisdom.com/filer/ceif-partners-llc)\n\nhttps://preview.redd.it/h13s1xvyzc271.png?width=3759&format=png&auto=webp&s=721eb438fe403f716e174f30773a56ae40e7a098\n\nCitadel Tactical Trading for example, looks thus far to be on track to exceed all previous years in security sales already (As of May).\n\nSource: [https://docoh.com/company/1456739/citadel-tactical-trading-llc](https://docoh.com/company/1456739/citadel-tactical-trading-llc)\n\nhttps://preview.redd.it/tb8pl4gd0d271.png?width=1709&format=png&auto=webp&s=b18bd6fe7331cd4a839cad7c45b0ccbe7057f749\n\nThe filings themselves are checked as \"amendments\" in some cases to securities dating back as far as last decade.  The \"amendments\" may actually contain the source of the security name if the date corresponds to the original purchase date?  Just a thought, since it appears they do not have to disclose the names of securities sold.\n\n[https://www.sec.gov/edgar/search/#/q=%2522CITADEL%2522&dateRange=30d&category=custom&forms=D](https://www.sec.gov/edgar/search/#/q=%2522CITADEL%2522&dateRange=30d&category=custom&forms=D)\n\n[The security above appears to have been first entered in April of 2008.  All of these appear to be long positions that have been closed.  ](https://preview.redd.it/9qqu4gex0d271.png?width=2518&format=png&auto=webp&s=8488e9470ac90cdd37e0de883b8b8b720af7c186)\n\nI'm not an attorney, expert at legal shit, or even an internet sleuth.  I'm just a regular Ape that likes the stonk.\n\nhttps://preview.redd.it/z4pg3vne1d271.png?width=600&format=png&auto=webp&s=db611c6538cccd1bdac9e3e50c6be90b9c2f19ad\n\nI couldn't pass up this opportunity to at least bring these sales to light.  They deserve to be investigated since an Ape dig some digging and spent his time for us.Thanks to the Ape that flagged me down on Twitter.  Won't post his info here since there's people advising against that these days.\n\n&#x200B;\n\nhttps://preview.redd.it/yei8rkp02d271.png?width=547&format=png&auto=webp&s=e3c256d443873a8eb113b3d6d4c7e31833b9f152\n\nOpen to any/all theories on this one.\n\nTag anybody you think would know what's up here.\n\nDo your think SuperStonk. What is Shitadel up to this time?\n\n&#x200B;\n\nhttps://preview.redd.it/vi4cyf672d271.png?width=980&format=png&auto=webp&s=5c46d4c25853934135564b2eadd351f83db3e472\n\nEdit 1:  I found a comment on another post which only had one of the filings.  Everyone piled on thinking Citadel was liquidating, etc.  It appears that this may just be an annual filing and normal business.  Below is a screenshot from an SEC Filing Ape that knows his shit.  I've asked him to look at my post to see if there is anything else to this...since the dates are not lining up and 2021's sales far exceed all previous years to this point in each of the funds.\n\n&#x200B;\n\nhttps://preview.redd.it/uqo9s28n6d271.png?width=1703&format=png&auto=webp&s=be754dc6c43e8f878f9bbd0832879532f0d57b38\n\nEdit 2: 12:04 AM EST 5/31/21 \n\nThere are lots of Apes assuming that this is a yearly filing.  I also have wondered if this was an annual liquidation/selloff of assets.  However, that doesn't appear to be the case.    \nWhen I scroll through each of the 11 different funds, I see different dates (and multiple sales) in some years.  Image below is one example from Citadel Equities Fund II [https://docoh.com/company/1727632/citadel-equities-fund-ltd](https://docoh.com/company/1727632/citadel-equities-fund-ltd)\n\n&#x200B;\n\nhttps://preview.redd.it/b1gq5f6lrd271.png?width=1701&format=png&auto=webp&s=fca695ad8cdf02224db23bb5e91a720cda285290",
    "title": "Citadel has listed sales of securities totaling $28 Billion Dollars on 5/28/21 -",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nopm6v/citadel_has_listed_sales_of_securities_totaling/"
}