{
    "author": "Door_Public",
    "created_utc": 1620083010.0,
    "distinguished": null,
    "edited": 1620122918.0,
    "id": "n49zl5",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_n49zl5",
    "num_comments": 501,
    "permalink": "/r/Superstonk/comments/n49zl5/srnscc2021801_confirmation_may_the_4th_be_with_you/",
    "score": 9050,
    "selftext": "1. Congratulations to everyone wo had bought the dip in the disccounts of today.\n2. Sorry for my english\n\nHi again, I published this post yesterday  [The SR-NSCC-2021-801 CAN be approved AUTOMATICALLY this week. (MAY THE 4TH BE WITH YOU).](https://www.reddit.com/r/Superstonk/comments/n3gxsq/the_srnscc2021801_can_be_approved_automatically/)\n\nI saw some people saying  that this rules had changes. But anyone could confirm that if these changes  can change the rule of 60 days. So I decided to send an email to the people who propose the law changes.\n\nhttps://preview.redd.it/bkdv949ekzw61.png?width=718&format=png&auto=webp&s=0f1e34047d1b59fc5193cafac91c8c135f404b75\n\nThe first answer to my email was\n\nhttps://preview.redd.it/ets55fupkzw61.png?width=1579&format=png&auto=webp&s=898f31b98913239c480c27f648bc70ce00734d7b\n\n>The SEC does have an initial 60 day period (following the date of filing) to review the proposal.  If the proposal is approved, NSCC would implement the rule change within 10 days of that approval.\n\nOkey, the first part is easy the SR-NSCC-2021-801 has to be approved and after that the NSCC has 10 days to implement.\n\nBut my dude about when we have to start to count the 60 days, the 5/3 or the 18/3 wasn´t resolved. So I email again and here there new answer.\n\n&#x200B;\n\nhttps://preview.redd.it/asj8dc6skzw61.png?width=1581&format=png&auto=webp&s=05b72fb262da8a016c35be48e59ac88d5e486c17\n\n>Hello,  \n>  \n>Please note that this filing is not proposing new laws.  NSCC is not a regulator, and does not issue regulations.  This is a proposed change to the NSCC Rules, which govern the operations and services of NSCC and are applicable to NSCC Members. NSCC Members are mostly banks and broker dealers.  You can learn more about NSCC and find our Rules on our website.  \n>  \n>The proposal was filed on March 5, 2021 and the SEC has not requested any changes to the proposal.   \n>  \n>**The initial 60 day review period for file no. SR-NSCC-2021-801 began on the March 5 filing date.**  The initial review period for file no. SR-NSCC-2021-002 is approximately 45 days after the filing was published in the Federal Register, which was on March 18 (and, therefore, approximately 60 day after the March 5 filing date).  You are correct, the SEC would need to both approve file no. SR-NSCC-2021-002 and issue no objection to file no. SR-NSCC-2021-801 before the proposal can be effective. \n\n**\"The initial 60 day review period for file no. SR-NSCC-2021-801 began on the March 5 filing date.\"**\n\nFor the people who doesn´t read my last post:\n\n**\"The proposed change may be implemented if the Commission does not object to the proposed change within 60 days of the later of (i) the date that the proposed change was filed with the Commission or (ii) the date that any additional information requested by the Commission is received.\"**\n\n&#x200B;\n\n[Spanish calendar](https://preview.redd.it/zotyzrjukzw61.png?width=668&format=png&auto=webp&s=9d9de4a9d995ca49dd9080a16264b0d0bd1b8274)\n\nSo may be we are going to have \"May the 4th be with you\".\n\nBut if the SEC wants to implement this rule of the  **SR-NSCC-2021-801,** change has to approve first the  **SR-NSCC-2021-002** and no saying any objection to the  **SR-NSCC-2021-801.**\n\nIf everything goes well for this week the sec will have both rule chanegs approved. Because without **SR-NSCC-2021-002**  the **SR-NSCC-2021-801** can´t be implemented. And after the rules are approved they have 10 days to implement them.\n\nBut take a moment and read again the **SR-NSCC-2021-801:**\n\n**\"The proposed change MAY BE implemented if the Commission\"**\n\nAnd again the ball is on the roof of the sec.\n\n&#x200B;\n\nhttps://preview.redd.it/0vz7el5wkzw61.png?width=634&format=png&auto=webp&s=fa99d485d3ce37b75259a569ca767d8d24b7a683\n\nIn this link [https://www.sec.gov/rules/sro/nscc.htm](https://www.sec.gov/rules/sro/nscc.htm) they have not yet place anything about this two rules.\n\nAnd again [SEC WANTS US TO GIVE THEM ONE CHANCE](https://www.reddit.com/r/Superstonk/comments/n2e9t9/sec_wants_us_to_give_them_one_chance/) (this is a post reviewing the last  [SEC](https://www.sec.gov/news/speech/werewolves-of-change)  speech)\n\nI really believe that they want to start doing the right and correct things.\n\n# THEY KNOW WE ARE HERE AND WE HAVE COME TO STAY.\n\n## 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nEdit:  [Timelines for NSCC-801 and NSCC-002 approvals](https://www.reddit.com/r/Superstonk/comments/n445l7/timelines_for_nscc801_and_nscc002_approvals/)",
    "title": "SR-NSCC-2021-801 CONFIRMATION (MAY THE 4TH BE WITH YOU)",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/n49zl5/srnscc2021801_confirmation_may_the_4th_be_with_you/"
}