{
    "author": "birchcliff",
    "created_utc": 1620417233.0,
    "distinguished": null,
    "edited": 1620442259.0,
    "id": "n77cdr",
    "text_only": true,
    "flair_text": "𝗦𝗽𝗲𝗰𝘂𝗹𝗮𝘁𝗶𝗼𝗻",
    "name": "t3_n77cdr",
    "num_comments": 264,
    "permalink": "/r/DDintoGME/comments/n77cdr/the_reasons_why_i_am_bullish_on_gme_and_how_i_am/",
    "score": 724,
    "selftext": "Hello fellow apes,\n\nLet me start this post by saying that I am long on GME (high XXs) since March. I have been lurking these subs for a while now (since Feb, after the Jan squeeze) and have been a moderate investor in the stock market for a couple of years.\n\nAfter January, **I have seen a lot of uncertainty and discussion on these subs**. Many apes are growing anxious as the days go by because of the prolonged TUT (time under tension) and that makes complete sense, psychologically. I have also seen these subs become more and more cult-ish which, as an investor and rational individual, I personally dislike. I see constant discussion on the fuckery and the methodology of this fuckery, which IMO doesn't matter so much for monetary, short/medium term purposes. **The thing that matters most to me is SI and if they did cover or did not cover.**\n\nSo I am writing this for all the apes that, like me, are not compelled by the cult hype, the photos of HFs offices with lights on, the drones flying around, the blind belief in certain figures and the memes. This is for apes who still are not convinced by current numerical DD and are trying to find legitimate/rational/compelling arguments to sleep at night and HODL.\n\nLets start by the beginning, as with all investments, **we are betting on an outcome**. This is an investment that can be right and can also be wrong. Also, hedgies are a lot of things (corrupt, fuckers, liars) but we cant assume they are dumb. They are smart and this is their game. They have been playing it for decades.\n\nThere are **2 different bets happening** and we need to clearly identify them: **a) GME MOASS** and **b) GME Fundamental Long Term Value.**\n\nThese bets occur independently but at the same time they have repercussions on the other.\n\n# a) GME MOASS\n\nMy bullish thesis for GME MOASS is based on two main points:\n\n1. *HFs Greed*\n2. *HFs thinking they are know-it-all’s and have full control of the market dynamics and how things were gonna play out*\n\nBased on these two reasons, **almost no evidence will undermine my thesis until the shareholder voting results come back**. If a good portion of retail holders vote and GME receives 2x the float in votes, then HFs are fucked. That will confirm our conspiracy thesis. Yes, you heard me right. MOASS is in fact a conspiracy thesis. They have to collude and lie and hide. And yes, conspiracies do happen in the world especially assuming that HFs are liars and entitled shits.\n\nOther than that, most other numerical arguments for HFs not covering are **not extremely compelling/irrefutable at this point** (and if you have a decisive argument, please feel free to share as it also benefits me). The days following the January squeeze (when the SI reduced by 100%) there was sufficient long volume for them to have covered. The daily short volume that has happened since Jan (around 50% each day) can be explained by intraday trading and simply new shorts who think that the stock is overvalued and hyped at the moment and see it returning to 40-50$ in the medium term.\n\nI am playing the MOASS game based on HFs *assuming* that, **by halting trading and bringing the price down in Jan, retail would evaporate and start panic selling**. This would bring the price much closer to pre-Jan levels and they would cover at a small loss. **But that did not happen**. I do agree that **we have seen some suspicious activity** on MSM, market manipulation by layering, and many other questionable acts. \n\nEDIT: consider that this suspicious activity could also be HFs taking advantage of volatility and retail investors.\n\nI think **the bullish argument has merit**, based on past attitudes/greed and the general decision making that HFs have. However, I myself am playing this assuming always the worst case scenario; I tell myself that the chances of them **not** having covered are **lower** than the ones of them **having covered**. That's the way I roll in my decision making, to stay grounded.\n\nI (personally) assume a 3:1 chance (having covered/not having covered). So in this case odds are against me. But, if I (we) am right, I expect minimum earnings of 100:1 (earnings/investment). At this point, bet \"b\" also comes into play. Do I believe medium and long term fundamental values of GME are below what I invested? My conservative assumptions are Maybe 50% lower in the medium term but potentially breakeven or 10% higher in the long term. Again, I am being as pessimistic as possible. **Looking at it that way, the bet seems rational and I can (try to) sleep every night**.\n\nWith that said, I am not risking *life changing* money on a 3:1 bet even if it has 100:1 earnings potential and a 50% medium term downside. But I am risking a *significant* amount (2-3x monthly income) based on my current situation (28, single, good job, no debt).\n\nWould you bet your 300K house if I told you you have 1 in 4 chances of winning, but if you won I would give you 30 million dollars and if you lost, you would have to downgrade to a 150K beat up house in a shitty neighborhood? (Thank you Miami real estate :'D)\n\nThe answer to this question is personal, as some people wouldn't mind downgrading to a 100K house. I do and that's my own business. So I don't play with mortgage money, for example. **I play with what I am willing to lose**. I am willing to get punched in the face, but not willing to lose a leg, an arm or liver and then wait for a high tech prosthesis. Each one of us has his/her own risk aversion. Each one of us has a different life and set of responsibilities. Be smart, fellow ape.\n\nEDIT: I would do the house bet if, as many apes comment, the 3:1 chance was inverted (right/wrong). I just don’t know if it is that way and prefer assuming a more pessimistic value. I need to be able to sleep myself. \n\n# b) GME Long Term Fundamental value\n\nMy bullish thesis goes as follows:\n\nThis point has some speculation, but in my opinion, **GME can be worth 3x current market cap (or more) in a couple of years**. The gaming market is huge. The GME frenzy gave the company a lot of hype/marketing and there are a bunch of crazy apes who are willing to bet their mortgages on the company. That has a lot of value. Also, E-Sports is a thing and I expect that market to grow a lot. Ryan Cohen is a successful entrepreneur with contacts and experience. He is also young. GME's team has been updated and enhanced. They have 550M cash. If the MOASS happens, then the hype/marketing will be even stronger/crazier. Apes will be millionaires and the hype will continue stronger than ever.\n\nEDIT: Can we make GMellionaires a thing? Is it already?\n\nSo you might ask, **is there any bearish thesis on this bet too?** What are the bearish elements that could fuck this for us? Well there are.\n\nFor instance, I feel that the stock market is extremely overvalued in general. Fundamentals are not reflected in stocks prices. Price discovery is not a thing at the moment. I feel like we are heading into a market crash, that could come from several different fronts. I feel like we might progressively transition into crypto to avoid the market manipulation. **These are my opinions.**\n\nNow, make no mistake. **HFs know all the information we know**. Unlike us, retail investors, **HFs have all the information available to them** (SI, institutional ownership, everything) through contacts and fuckery. They are also the shorts, so **they know how short they are and we don't**. **They know that the bearish fundamental thesis does not exist anymore**. I still see people quoting Mark Cuban's *\"The goal of shorts is not to cover\"* as a solid argument for any of the bets. Obviously, the ideal goal of short investors is to hit the 'bankruptcy jackpot' and never cover. Just like the ideal goal of long investors is for the price to become infinitely high.\n\nInitially, 'bankruptcy jackpot' is why Melvin and Shitadel shorted GME. But they know that's not a possibility anymore. GME is not going bankrupt. **We cant work under the assumption that they are idiots and still acting under that basis.** That's naïve.\n\n# To conclude (and some cathartic thoughts for myself)\n\n**GME's bullish bets seem to be somewhat rational.** I am not the member of a fucking cult. You shouldn't be, either. Strong statements need to be backed by evidence and we need to consider the bearish possibilities too. We are apes, but we are also investors at the moment. This is not monopoly money. **Our subs are infiltrated, but not all counter DD comes from Shills/Hedgies**. Please, take everything with a grain of salt, but TAKE IT. Both MOASS outcomes are possible. Fuck it, all outcomes are possible in this manipulated stock market.\n\nEDIT: You can be part of the cult if you want. This is a free country (or is it?)\n\nWith that said, I hope all of you have a nice weekend. Go drink a beer. Be with your family. Disconnect from your PC. Try to work Mon-Fri, because that's the job that you 100% have and that's how you provide for you/your loved ones.\n\nAnd if by any chance I don't see you on the moon in the short term, I believe I will still see you on the moon in the long term.\n\nEDIT: Formatting\n\nEDIT: Please note that 3x my monthly income is literally a significant chunk of my savings. So I am, in my own terms, heavily invested in this bet.",
    "title": "The reasons why I am Bullish on GME (and how I am able to sleep at night)",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/DDintoGME/comments/n77cdr/the_reasons_why_i_am_bullish_on_gme_and_how_i_am/"
}