{
    "author": "cloudyninety",
    "created_utc": 1614467292.0,
    "distinguished": null,
    "edited": 1614605937.0,
    "id": "ltzo1p",
    "text_only": true,
    "flair_text": "💎🙌",
    "name": "t3_ltzo1p",
    "num_comments": 117,
    "permalink": "/r/GME/comments/ltzo1p/100k_the_optimal_mindsets_of_the_diamondhanded_ape/",
    "score": 1105,
    "selftext": "**$100K IS THE MINIMUM.**\n\n**AIM FOR $100K, AND NOTHING LESS, AND YOU'LL FIND THAT THE PRICE IS ALL THE MORE LIKELY TO GET THERE.**\n\n**THIS IS POSSIBLY YOUR ONLY CHANCE TO MAKE LIFE-CHANGING MONEY.   \nTHIS IS NOT ANY OTHER STOCK. AND ALL YOU HAVE TO DO IS BUY, HOLD, AND BELIEVE.**\n\nWarning: long ass read\n\n💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎💎👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐👐🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍🦍  \n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nHello ape, do I have your attention now? :)  \nOk seriously, I just wanted to share something after reading through every single DD here on this sub twice a day.\n\nThere is the math, the DD, the data, the collective wisdom and analysis from autists and wrinkle-brained apes alike.\n\nBut one thing I feel that was not covered well enough was the human factor of things, and I wanted to bring them to light here.\n\nThere have been a few posts that stood out to me, and I wanted to pen them down here as a collective for us all to take note.\n\nThis is NOT due diligence, rather a personal insight I felt would be beneficial to whoever reads this.\n\nThere's no math involved.\n\n**It's about the mindset when hodling GME.**\n\nTo re-iterate:\nNo ceiling price is certain.   \nNo rocket launch date is certain.    \nNo tendies are certain until ape sell and cash out (hopefully at $100k minimum)\n\nExpect HFs and MMs to throw everything they have and more. \n\"We are in the Endgame now.\" - Mister Doctor\n\nOut of 14,000,605 possibilities, **one thing is for sure, and that's ourselves.** \n\nThis will be a long read. I put some effort into typing this while sipping blue crayon macchiato.\n\nMaybe this will be worth your while, seeing as you're probably bored waiting for market to open 🙂\n\nLet me know in the comments if I'd missed anything out or misrepresented anything.\n\nI will split this into a few chapters:  \n01 – A little bit about myself, and why I'm writing this   \n02 – What I think is going to happen   \n03 – What kind of price should ape expect (based on all the DD)   \n04 – The optimal mindset while waiting for the almost-certainly-inevitable squeeze    \n05 – What should ape do in when the rocket is launching   \n06 – What kind of fail-safes should ape have to hedge against disappointment    \n07 – What happens after ape get rich?   \n08 – Closing summary, quotes to remember   \n\n  \n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 01 – A LITTLE BIT ABOUT MYSELF, WHY I'M WRITING THIS\n\nI come from a background of card games and I read up a little about game theory and psychology over the years, so here's my personal take on things.\n\nI was a gambler who stumbled into WSB and bought in to GME just to learn about the stock market. I know, dumb, right? Well, turns out it might be the best decision I'd ever made.\n\nSurprise, there's no better way to find out every term on Google, and read furiously on everything on investopedia, when your money is on the line.\n\nSomeone once mentioned in a thread that it's most important that the greatest enemy in this scenario is ourselves, and it's very very true here, because this is possibly the biggest and most entertaining case study of prisoner's dilemma.\n\nGME is going to make history as you know it.\n\nComing from WSB, WSBN, the day when the market pulled the rug from underneath (Jan 28) I was so demoralised and I thought surely there was no way of coming back.\n\nWSB was taken over by old mods and bad shills and filled with FUD, but then I stumbled upon this subreddit. I read every DD twice, I saw the god-tier DD thread being put up couple days after I joined.\n\nThere were daily analysis and reasons with regards to price jumps and dips, all the information was like a storybook read to a toddler.\n\nNow there's even have a dedicated news anchorman-turned-mod.\n\nThis subreddit is a God-send. You guys are amazing. I don't know any of you, but I love you.\n\nPersonally, I hope for everyone to succeed in this MOASSOAT (Mother Of All Short Squeezes Of All Time), and I hope for everybody holding on to GME stock to walk out at the end of the day with 100k minimum per share.\n\n**100k. Minimum. Per share.**\n\nBut recently there's been some.. concern? With an overly-hyped post about the date for the squeeze.  \nSo I'm going to put down my thoughts for every ape to think about when dealing with confirmation bias and potentially upsetting news to come (if any does come along the way).\n\nAlso, this isn't financial advice. Sell at whatever price you deem fit. I most certainly did not recommend that you sell at **100k. Minimum. Per share.** The price I name is certainly not gospel. Once again I'm here to talk about the human factor.\n\nI'm not a cat. I'm not a financial advisor. I do not solicit payment for advice, nor is it in my interest to make any kind of monetary profit out of making this post. DFV, if you're reading this, I love you.\n\nI'm just a dgen gambler rrrrretard who plays Legends of Runeterra while sipping blue crayon macchiato and re-reading the DD on r/GME.\n\nHere we go.  \n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 02 – WHAT I THINK IS GOING TO HAPPEN\n\n**I THINK THE SQUEEZE IS MOST PROBABLY ALMOST CERTAINLY MOST LIKELY INEVITABLE.**\n\n**BUT WHAT IF IT DOESN'T HAPPEN?**\n\nDid you feel something rising as you read the first sentence?  \nGood. That's hopium, otherwise known as hope.\n\nDid you feel something sinking in your gut?  \nGood. That's most likely the disappointment you don't want to have, and you fear the possibility of having to face it, however infinitesimally small it can be.\n\nWe're going to talk about that in a bit in Chapter 4.  \n\nNow, in almost every game, there's a difference between playing the game, and playing the player.\n\nIn this case, the game is already set. Whoever holds the supply going to win. EVERYONE HOLDING THE STOCK WILL GET PAID.\n\nThe difference here however, is in the mentality of the player. Apes will hold as one, through the dip, through the ATL, through the FUD. But apes will all sell differently, as different apes have different price targets to hit.\n\nLike many posts before mine have mentioned, that's what the HFs are doing, with FUD, shills, bots, MSM. For example, they might do the following as listed here by [u/Spielporn](https://www.reddit.com/user/Spielporn/)\n[https://www.reddit.com/r/GME/comments/lt5atn/how\\_theyll\\_try\\_to\\_separate\\_us\\_from\\_our\\_shares/](https://www.reddit.com/r/GME/comments/lt5atn/how_theyll_try_to_separate_us_from_our_shares/)\n\n**Excessive expectations/dates**\n**Distraction**\n**Demoralization**\n**Misinformation**\n**Herd instinct, panic**\n\n**But one thing is for sure, they want to separate you from your shares.**\n**(nah, I'm sure ape won't until the price is right. Apes are all** 💎👐)\n\nThey have tried with the negatives and found diamond hands impenetrable, so they're going to try to break the morale with positive spikes and seemingly-insane price jumps to shake off impostor diamonds.\n\nI wouldn't put it past them to exhaust everything in their playbook before taking everyone else down with them.\n\nI'm not a market expert, I'm barely a month old into stocks but what I feel could happen is:  \n/**THE PRICE MIGHT JUMP TO $1000 AND FALL TO $100.**   \n/**THE PRICE MIGHT JUMP TO $5000 AND FALL TO $1000.**   \n/**THE PRICE MIGHT JUMP TO $9000 AND FALL TO $3000.**   \n/**THE PRICE MIGHT JUMP TO $10,000 AND FALL TO $5000.**   \n/**THE PRICE MIGHT JUMP TO $69,420 AND FALL TO $10,000.**   \n/**DURING THE SQUEEZE, NOTHING IS GUARANTEED.**   \n/**WE CAN HOLD, BUT THEY CAN FUCK AROUND.**   \n/**BE WARY OF FALSE POSITIVES. BE PREPARED.**   \n\nFUDS ARE FALSE NEGATIVES.   \nPRICE SPIKES BEFORE THE PRICE EVEN GETS CLOSE TO $100K **COULD** BE FALSE POSITIVES, SO PREPARE YOURSELF.\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 03 – WHAT KIND OF PRICE SHOULD APE COME TO EXPECT\n\nOver January and early February, as the bullshit unravelled, RH stopping trading and whatnot, there was a collective psychological re-shuffling as diamond hands stood together, held strong, and set NEW expectations for what the price could POSSIBLY BE.\n\nBased on collective math, price action and technical analysis. And it was glorious. \n\n1) Ape now have a VERY CLEAR TARGET as to what kind of price that ape can come to expect.   \n**NOTHING LESS THAN SIX DIGITS MINIMUM PER SHARE.**   \n**NO DECIMAL PLACES, ONLY COMMAS**   \n**There's literally no need for me to talk about the math. It's all here.**   \n[**https://www.reddit.com/r/GME/comments/lj1wqv/a\\_comprehensive\\_compilation\\_of\\_all\\_due\\_diligence/**](https://www.reddit.com/r/GME/comments/lj1wqv/a_comprehensive_compilation_of_all_due_diligence/)\n\n2) And the average ape also has a few more things to take note of:  \n**BUY.**   \n**HOLD.**    \n**WAIT.**   \n**DON'T LOSE HOPE.**   \n**DON'T DAY TRADE. (yeah fuck you, traders)**   \n**DON'T SELL UNTIL SQUEEZE SQUOZE.**   \n**(not financial advice)**   \n\n[https://www.reddit.com/r/GME/comments/ltmutx/everyone\\_i\\_propose\\_we\\_keep\\_it\\_simple\\_the\\_only\\_way/](https://www.reddit.com/r/GME/comments/ltmutx/everyone_i_propose_we_keep_it_simple_the_only_way/)  \n[https://www.reddit.com/r/GME/comments/ls0cc1/what\\_our\\_community\\_needs\\_us\\_to\\_know\\_going\\_into/](https://www.reddit.com/r/GME/comments/ls0cc1/what_our_community_needs_us_to_know_going_into/)\n\nTo put the checkpoints in perspective BASED ON COLLECTIVE DD AS OF THE DATE I WRITE THIS, from what I understand, apes stand at:   \n--$800 for all hell to break loose.   \n--$1000 to see people fomo/pussy out/get quick gains.   \n--$5000 for some to sell and start eating their shoe or something.   \n--$10,000 to be a checkpoint where the short squeeze *really* begins.   \n--$69,420 will most certainly be a checkpoint. Cos some are gonna sell one stock for the meme.   \n--$100k to be the expected floor. FLOOR.   \n--$130k is what an AI model predicted, based on a market that doesn’t have maximal autism steering it.   \n--$250k might be an actual meme price that could happen..   \n--$300,000???????   \n--ONE MILLION PER SHARE??   \n--**JOKES ON YOU, THERE IS NO POSSIBLE CEILING TO CAP THIS IF EVERYONE HOLDS.** 💎👐   \n--AS FAR AS I UNDERSTAND (I can be wrong) ALL PRICE PREDICTIONS ARE BASICALLY AN EXPECTATION OF A PRICE DURING WHICH ALL DIAMOND HANDS / UNKNOWN INSTITUTIONS / WHALES DECIDE TO SELL.   \n\n$100K IS SERIOUSLY NOT A MEME.\nBELIEVE IN THE $100K, AND IT MOST PROBABLY ALMOST CERTAINLY MOST LIKELY WILL HAPPEN.\nAND THERE'S A SMALL CHANCE THAT, BECAUSE OF COLLECTIVE REEEETARDATION, GME MIGHT GO BEYOND $130,000.\n\nHere are some example posts to back my belief: (there's more out there, read them if you can)  \n[https://www.reddit.com/r/GME/comments/ls78g7/why\\_the\\_130k\\_ai\\_is\\_wrong\\_and\\_why\\_thats\\_a\\_good/](https://www.reddit.com/r/GME/comments/ls78g7/why_the_130k_ai_is_wrong_and_why_thats_a_good/)  \n[https://www.reddit.com/r/GME/comments/lpbor3/guys\\_gals\\_100k\\_is\\_not\\_a\\_meme\\_it\\_really\\_isnt/](https://www.reddit.com/r/GME/comments/lpbor3/guys_gals_100k_is_not_a_meme_it_really_isnt/)  \n[https://www.reddit.com/r/GME/comments/ltoe73/comparing\\_rough\\_gme\\_numbers\\_to\\_vw\\_08\\_numbers\\_why/](https://www.reddit.com/r/GME/comments/ltoe73/comparing_rough_gme_numbers_to_vw_08_numbers_why/)\n(they can be wrong, so take it with a pinch of salt. Only thing that can't go wrong is **holding**)\n\nAnd even if there isn't a squeeze, a study on the possible intrinsic value of GME moving forward suggests that it might reach $5000 in the near future.  \n[https://www.reddit.com/r/GME/comments/lthmqx/why\\_gme\\_is\\_worth\\_at\\_least\\_5000\\_on\\_merit\\_and/](https://www.reddit.com/r/GME/comments/lthmqx/why_gme_is_worth_at_least_5000_on_merit_and/)\n\nWhatever the price can be, at this point, GME doesn't need a price point to tell you that you can be bullish on its prospects. $100 is a discount. \n\n**After double checking the sources and cross-referencing posts, I trust the math, I trust the DD, I trust the process, and I trust every single one of you reading this to hold on to your stock for your life because this is life-changing money we're talking about.**\n\nI'm sure you won't let me down. APES TOGETHER STRONG   \n💎👐💎👐💎👐💎👐💎👐💎👐💎👐💎👐\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 04 – SUGGESTION: OPTIMAL MINDSETS WHILE WAITING FOR THE ALMOST-CERTAINLY-INEVITABLE SQUEEZE (IMO)\n\n*All of below is based on my understanding and analysis of the average ape brain, while also referencing my thoughts and emotions as I rode the highs and lows since Jan 26.*\n\n*Feel free to correct me if anything I say might be wrong, or if you have something to add :)*\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part A - Sensible Optimism**\n\nRemember when I said we'll talk about hopium and facing disappointment?\n\nAccording to The Psychology Of Money by Morgan Housel, he talks about sensible optimism:  \n*Optimism is usually defined as a belief that things will go well. But that’s incomplete.*   \n*Sensible optimism is a belief that the odds are in your favor, and over time things will balance out to a good outcome even if what happens in between is filled with misery.*   \n*And in fact you know it will be filled with misery.*   \n*You can be optimistic that the long-term growth trajectory is up and to the right, but equally sure that the road between now and then is filled with landmines, and always will be. Those two things are not mutually exclusive.*\n\nI believe the price will hit $100k per share.  \nBut, if it doesn't, I am sure there will be DD and analysis to tell me why it didn't, because of new disruptive factors which no one could possibly have predicted.\n\nWill it be too late to realise your gains by then? Likely. But I don't know. This is unprecedented after all. So I'm going to quote from the book again in part B:\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part B - Be Prepared For The Worst, So You Are Prepared For The Best. DON'T REGRET.**\n\n*Planning is important, but the most important part of every plan is to plan on the plan not going according to plan.*\n\nBe prepared for it to not hit $100k. I can't tell you what the price will be. I only wish I could.  \nBut if I told you what would happen, it wouldn't happen.\n\n**So make your own plan for MINIMIZING LOSS BEFORE MAXIMIZING GAIN. THIS IS SO THAT YOU MITIGATE REGRET.**\n\nThis way, you are actually protecting yourself from the emotional backlash of regret, from missing out on unrealised gains or something along those lines.\n\nRemember, fear and greed leads people to make the stupidest of decisions. **But regret rubs it in like nothing else.**\n\nDisappointment hits us twice as hard as fulfilment. In other words, you're likely to feel the pain of dropping an ice cream as much you feel the joy of eating an ice cream twice.\n\nRelevant:  \n[https://www.reddit.com/r/GME/comments/lq993q/emotional\\_dd\\_and\\_risk\\_management/](https://www.reddit.com/r/GME/comments/lq993q/emotional_dd_and_risk_management/)\n\nTBH, we can argue about paper hands cashing out too early, but at any point in life, just knowing that you did what you thought was best at the time is enough reason. So don't regret. Hindsight is 20/20, yes, but don't you dare regret getting off the rocket too early, or not even getting on in the first place.\n\nIf you can afford it, I'd rather you risk going up to $100k than to drop out at $10k and cry over a $90k unrealised gain. It won't hurt as bad, because at least you went for it.   \nAlso, it's not just you. You have apes. All holding. (make a calculated risk. Don't play with money you can't lose.)\n\n**Minimizing loss, realized or unrealized, in my opinion, is the most important play you need to make in this entire MOASS. Take calculated risks to mitigate regret.**\n\n**If you really have to, just cash out what you need at the price point you want, but if you can afford it, hold.**\n\n**IMO, cashing out before it even hits $10k is stupid. Sell at your own discretion. Just don't regret the price you bought or sold.**\n\n**--**\\---------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part C - Know What and Why You're Believing**\n\n[**https://www.reddit.com/r/GME/comments/lttdys/just\\_finished\\_this\\_classic\\_sage\\_words/**](https://www.reddit.com/r/GME/comments/lttdys/just_finished_this_classic_sage_words/)  \n\\^I believe this is a page from The Intelligent Investor by Benjamin Graham, aka the father of value investing whose student was Warren Buffett.\n\nHe says, have the courage of your knowledge and experience.  \nIn this case, apes have the collective wisdom and analysis of brother autists here:  \n[**https://www.reddit.com/r/GME/comments/lj1wqv/a\\_comprehensive\\_compilation\\_of\\_all\\_due\\_diligence/**](https://www.reddit.com/r/GME/comments/lj1wqv/a_comprehensive_compilation_of_all_due_diligence/)\n\nSeriously. I ain't seen anything like it. It's fantastic.  \nI go back to it whenever I feel shaky in my faith that this will eventually moon.\n\nYou are right to believe GME will moon, because the reasoning, data and daily analyses are right.\n\nLogically, this is what should translate into an ape's trust for one another to hold the line and launch this rocket into the moon, in this community.\n\nApes are reeeeetarded tho. Doesn't matter. \n\nRelevant:  \n[https://www.reddit.com/r/GME/comments/lqy87l/for\\_those\\_who\\_bought\\_high\\_and\\_held\\_long\\_hang\\_in/](https://www.reddit.com/r/GME/comments/lqy87l/for_those_who_bought_high_and_held_long_hang_in/)  \n\\^I think this is FANTASTIC.  \nThe real questions to ask yourself, Zermelo's Theorem... exactly as I understood the situation.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part D - Don't believe in every hype. Be hyped because you** ***know*****, not because you** ***feel*** \n\nAs I mentioned, hedgies will use every negative and positive to their advantage in order to shake you off of your shares.\n\n**Everything about the price, be it good or bad, that suggests you should sell earlier or later than you expect, should give you reason to suspect that it could be meaningless hype or FUD.**\n\n**I'm not saying doubt everything, I'm saying don't believe everything.**  \n**Somewhere, somebody is wrong. Don't let your emotions, especially when it's green, to get ahead of yourself.**\n\nI trust the mods to filter out bots and shills. But you'll also need to do your due diligence and double, triple-check all sources, as much as possible.\n\nAnd most of all, you have to be disciplined in your emotions as this rocket goes to $100K MINIMUM.  \nThis is once in a lifetime, don't muck it up just cos you got overhyped or you became a pussy along the way. \n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part E - Believe in the ape who believes in you, GAMESTOP IS THE STOCK THAT WILL PIERCE THE HEAVENS!!!!!!!!!!!!!**\n\nAt this point, I think it's safe to say that $100k per share minimum is what we've come to understand as a **self fulfilling prophecy.**\n\nAn individual's expectations about another person or entity eventually result in the other person or entity acting in ways that confirm the expectations.\n\nBut apes not just an individual, but collective bunch of smooth-brained apes that saw value in DFV's diamond-ball play on GME, got screwed over by RH, HFs and MMs just to realise $100K MINIMUM IS NOT A MEME.\n\nSo where does that bring ape? 🙂 GME is most probably going to hit $100K minimum at this rate, not just because the math predicted it, but because it led apes to believe they will hit it as well.\n\nBelieve the compilation of data collected. Apes have millionaire gamblers, data scientists, AI researchers, possibly some autists from the financial sector, and a random dude who can access Bloomberg Terminal from his school library.\n\nApes have billionaires, representatives speaking up for ape. Massive whales throwing $13m into the game just to stir the pot.  \nApes have math that suggests retail investors are holding on to the majority of the stock.   \nThere are apes from ALL OVER THE WORLD holding the line every single day.  \nI'm not from the US. Yet, here I am.  \nApes are certainly most positively winning. Don't ever doubt that.   \nIf you do, apes still got you. I can have your back because someone else does!\n\nRelevant:  \n[https://www.reddit.com/r/GME/comments/ltp7ro/historical\\_study\\_of\\_being\\_right\\_when\\_everyone/](https://www.reddit.com/r/GME/comments/ltp7ro/historical_study_of_being_right_when_everyone/)  \n\\^trigger warning: dude uses Hitler as a case study. Objectively speaking, this shouldn't affect you, unless you're Gabe Plotkin. haha.\n\n**BELIEVE IN THE APE WHO BELIEVES IN YOU. BUY AND HODL.**  \n**GAMESTOP IS THE STOCK THAT WILL PIERCE THE HEAVENS!!!!!!!!!**\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Part F - Patience**\n\n*\"The stock market is a device for transferring money from the impatient to the patient.\"* \\- Warren Buffett\n\nWe're seeing this float around a lot, but please don't just read it at face value.\n\nMy take to apply that quote into our situation:  \n**It's easy to hold in the red**. We know it can't get any lower. That's simple. Maybe it could, but there's only so much lower it can go. We're sad, but we know it'll get better.  \n**It's actually harder to hold in the green**, because we can't be sure how high it can go, because let's face it, Im sure many would want to time their exit at the peak.   \nYou're going to be happy when the price spikes, but fear/fomo will hit you harder because no one want to realise lesser gains than expected.\n\nCombine that with prospects of cashing out life-changing sum, you get woozy REAL quick.\n\nA relevant quote I found somewhere on GME I think:  \n*Basically, once the human mind gets past a few hundred dollars it stops being able to function effectively as a judge of scale, cost and value.*  \n*That is arbitrage opportunity for anyone who wants to exploit you by either separating you from your money or by making you not care about money you are entitled to.*\n\n**TLDR: STAY STRONG. THE PRICE DOES NOT MATTER NOW. FUNDAMENTALS ARE OUT OF THE WINDOW. IF YOU CAN AFFORD IT, HOLD UNTIL YOU SEE $100K MINIMUM, BE IT GREEN OR RED.**  \n(not financial advice)\n\nIf you are patient, you can eventually realise the gain at the price you want.\n\nRelevant:  \n[https://www.reddit.com/r/GME/comments/lt4vkw/reminder\\_gme\\_doesnt\\_need\\_to\\_hit\\_anything\\_today/](https://www.reddit.com/r/GME/comments/lt4vkw/reminder_gme_doesnt_need_to_hit_anything_today/)  \n[https://www.reddit.com/r/GME/comments/ltrkev/dont\\_be\\_a\\_paperhanded\\_pussy/](https://www.reddit.com/r/GME/comments/ltrkev/dont_be_a_paperhanded_pussy/)\n\nThink marathon, not sprint.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Chapter In Summary:**\n\nPart A - Sensible Optimism  \nPart B - Be Prepared For The Worst, So You Are Prepared For The Best. DON'T REGRET.  \nPart C - Know What and Why You're Believing  \nPart D - Don't believe in every hype. Be hyped because you know, not because you feel   \nPart E - Believe in the ape who believes in you, **GAMESTOP IS THE STOCK THAT WILL PIERCE THE HEAVENS!!!!!!!!!!!!!**  \nPart F - Patience\n\n  \n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 05 – WHAT SHOULD APE DO WHEN THE ROCKET IS LAUNCHING\n\nIn case of a rocket launch and GameStop opens a brand new flagship store on Mars, these hedgies won't go down without a fight, and they'll fight you every step of the way.  \nBut don't be afraid of them, they're gonna lose.  \n\n\nSmart ape says **be afraid of yourself**. Because you will now be subject to the 2 strongest emotions known to man in the stock market: fear and greed.\n\nA wise man once told me, be careful of what you do when you're sad and angry, but more than that, be most wary of who you are when you're excited and happy.\n\nLike I said in Chapter 2, if you want to see $100k, then you'll have to be prepared to see major price dips after a big raise. I.E. VOLATILITY.\n\nTHIS ROCKET RIDE IS NOT FOR THE FAINT HEARTED AND PAPER HANDED.  \nTHE BIGGEST FACTOR THAT WILL ULTIMATELY DECIDE IF WE HIT $100K, IS DISCIPLINED CONTROL OVER OUR INDIVIDUAL EMOTIONS.\n\nWith every spike, eventually there comes a dip. Something something fight you every step of the way.  \nSpikes and dips are also directly proportionate to our emotions. If you haven't realised.  \nRelevant: [https://www.reddit.com/r/wallstreetbets/comments/lrcllf/self\\_sabotage\\_and\\_the\\_chamber\\_of\\_secrets\\_of\\_why/](https://www.reddit.com/r/wallstreetbets/comments/lrcllf/self_sabotage_and_the_chamber_of_secrets_of_why/)  \n(idk about watching his youtube, but the post itself was pretty useful)\n\nPeople in the stock market behave the most irrationally. Traders literally are the only people in the world who sell at a loss and buy at the peak. Master your emotions, and you'll ride this baby to Alpha Centauri.\n\nSo don't be afraid to see it dip a bit or maybe even a lot, at $69,420 or something.  \nI don't know what's going to happen. But I am certain that if I hold, I can expect $100k minimum per share. \n\nThe DD and analysis posts along the way will tell you when to really sell.  \nFar beyond that, know yourself first.  \nThe rocket is going to go to Alpha Centauri, but no one said how long it'll take to actually get there.\n\n**AS GME TRANSITIONS FROM THE SETBACK TO THE COMEBACK, THERE IS A PROCESS.**  \n**TRUST THE PROCESS AND HOLD TIL YOU SEE $100K MINIMUM.**  \n**Not financial advice. Not a cat.**\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 06 – What kind of fail-safes should ape have in place to hedge (haha) against any possible disappointment?\n\nContinue reading up, double check the DD.  \nSome posts I found useful:  \n[https://www.reddit.com/r/GME/comments/ltu85n/use\\_your\\_own\\_head\\_and\\_double\\_check\\_any\\_dd\\_be\\_in/](https://www.reddit.com/r/GME/comments/ltu85n/use_your_own_head_and_double_check_any_dd_be_in/)  \n[https://www.reddit.com/r/GME/comments/lttc5d/regarding\\_the\\_upcoming\\_reveal\\_of\\_the\\_day\\_it\\_will/](https://www.reddit.com/r/GME/comments/lttc5d/regarding_the_upcoming_reveal_of_the_day_it_will/)\n\nDon't base your hopes and dreams on someone else's data. Expect $100k minimum, but also expect the possibility of $99k maximum. Get what I mean?  \nContinue to set new exit plans, update them if necessary, based on new factors, price movements, Elon Musk tweets, whatever.  \nIf you're in it JUST to see hedge funds burn, okay, I'm with you. But if you need the money, please plan ahead!\n\nDon't start fantasizing about what you can do with the money (you can, but I suggest not excessively), just remain focused on 3-5 goals of why you're holding.  \n**Don't count your chicks before they hatch, but remember why you're holding on to this basket of eggs.**  \nPersonally, I want to buy an apartment of my own, and then a Tesla. That's it.\nI'm not going to dream of that new yacht surrounded by escorts. Yet...  \nRelevant: [https://www.reddit.com/r/GME/comments/ltp6dc/dream\\_100k\\_big\\_why\\_are\\_you\\_hodling/](https://www.reddit.com/r/GME/comments/ltp6dc/dream_100k_big_why_are_you_hodling/)\n\nNothing will stop you from spending your well-deserved tendies later, but it matters what you do NOW because **you're right on the verge of getting them.** \n\nAnother smart ape once said: When Moon, Sell One Share At A Time.  \nSet increasing prices for each one, all the way up to the expected amount for yourself depending on your personal targets.\n\nI believe it'll hit $100k, but I'm also setting one limit sell to go off at $10k, to cover my cost basis. When playing on house money, every gain is a bonus!\n\nWhat is so special about this MOASS is, based on the math, there's an actual life-changing price to look forward to, and it's certain every single stockholder will be getting paid, God forbid any market manipulation at the peak.\n\nDon't look away from that. Remember to set some safety net sell prices so that you get massive profits as much as possible without being disappointed.\n\nAgain. DON'T REGRET. I'd rather you take the calculated risk with exit plans, than to wage it all on one play and be disappointed on the gains you expected but didn't get.\n\nBe prepared. It can happen today, tomorrow, anytime within the year.\n\nExpect march 19th, but also expect it not to happen. HFs and MMs will fight you every step of the way to get your shares that they need at the lowest price possible.\n\nHolding is NEVER wrong. Hold if you can afford to. You lose if you sell. Yes that means day trading as well. BUY HOLD AND DON'T DAY TRADE.\n\nOne day I hope when this is over and you're set for life due to all the massive gains, you'll look back and thank yourself for holding through the fear and doubt and disbelief.\n\nAnd you'll be glad you did it. You'll want to do it all over again.\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 07 – What happens after ape get rich?\n\n[https://www.reddit.com/r/GME/comments/lsqk4g/for\\_the\\_love\\_of\\_god\\_when\\_this\\_thing\\_squeezes\\_and/](https://www.reddit.com/r/GME/comments/lsqk4g/for_the_love_of_god_when_this_thing_squeezes_and/)\n\nDon't share how much you have. Seriously.  \nDon't disclose it. Don't flaunt. DO NOT FLAUNT YOUR NEWFOUND WEALTH.\n\nAll the naysayers will come back to find out how much you made when it moons, and they'll try to be your friends. Where were they when GME was at $40?\n\nLITERALLY, stay away from toxic people in your life, because you will most likely have no financial barrier to stop you from leaving anymore!\n\nThink about the people who were there for you when you had nothing.  \nThey're probably the people you should spend on. I wanna buy my dad a Jeep.\n\nDon't get cocky and think you can do it again with another stock or at an actual casino. To quote The Psychology of Money again:  \n*There are a million ways to get wealthy, and plenty of books on how to do so. But there’s only one way to stay wealthy: some combination of frugality and paranoia.*  \nRemember: if you can see your money as quickly lost just as easily you made it, then you'll be more inclined to steward it well. I can't afford to be poor the rest of my life ever again.\n\nRelevant for investing/trading with your newfound wealth:  \n[https://www.reddit.com/r/GME/comments/ltqlvr/what\\_trading\\_gme\\_has\\_taught\\_me/](https://www.reddit.com/r/GME/comments/ltqlvr/what_trading_gme_has_taught_me/)\n\nRelevant for frugality (even before GME moons):  \n[https://www.reddit.com/r/GME/comments/lt75c4/this\\_experience\\_has\\_made\\_me\\_very\\_good\\_at\\_saving/](https://www.reddit.com/r/GME/comments/lt75c4/this_experience_has_made_me_very_good_at_saving/)\n\nTBH I don't give a flying banana as to what you do with your tendies, but I sure want to come back here after the squeeze, to see happy posts of people free from debt, people enabled to live their lives to the fullest, to help other people in the family and communities.\n\nSomeone said in a thread: at $10k/share I can change my life, but at $100k/share I can change others' lives. I wanna be that guy at $100k/share as well.\n\n&#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n# 08 – Closing Summary, Quotes to remember\n\n**AIM FOR THE MOON AND YOU'LL LAND AMONGST THE STARS**  \n**AIM FOR ALPHA CENTAURI AND YOU'LL AT LEAST COLONIZE MARS**\n\nWE CAN STAY REEEETARDED LONGER THAN THEY CAN REMAIN SOLVENT\n\nDON'T COUNT CHICKS BEFORE HATCH, REMEMBER WHY YOU HOLD BASKET OF EGG\n\nYOU SELL YOU LOSE; WIN IF HOLD UNTIL PRICE IS RIGHT\n\nI LIKE THE STOCK. I WILL HOLD TIL $100K MINIMUM.\n\nBE DISCIPLINED EMOTIONALLY. THIS IS AS GOOD AS A WAR.  \n(haha war street.... hahahahahahaha I'll show myself out)\n\nI cannot summarise everything here. Read a chapter at a time if you will.\n\nNot financial advice. Clearly.\n\nThanks for reading :)",
    "title": "100k - The optimal mindsets of the Diamond-handed Ape",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/ltzo1p/100k_the_optimal_mindsets_of_the_diamondhanded_ape/"
}