{
    "author": "Purple-Artichoke-687",
    "created_utc": 1620719614.0,
    "distinguished": null,
    "edited": 1620722319.0,
    "id": "n9rpg1",
    "text_only": true,
    "flair_id": "a48b5c8e-8ff4-11eb-89b6-0e67f4f5fcb3",
    "flair_text": "News 📰 | Media 📱",
    "name": "t3_n9rpg1",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/n9rpg1/running_my_daily_secgov_search_for_my_beloved/",
    "score": 685,
    "selftext": "This is the search link for today: [https://www.sec.gov/edgar/search/#/q=gamestop&dateRange=all&startdt=2021-05-07&enddt=2021-05-11](https://www.sec.gov/edgar/search/#/q=gamestop&dateRange=all&startdt=2021-05-07&enddt=2021-05-11)\n\nA lot of 13F's came up, showing us where \\~800k of our beloved stock is, but also quite a big PUT position for  CTC LLC. They also have a call, but it's smaller.\n\nAlso a IBKR quarterly report showed up. Here's a little quote:\n\n>*“Short Squeeze” Antitrust Litigation*  \n>  \n>Since late January 2021, more than three dozen federal class action lawsuits have been filed in different jurisdictions against various brokers and other market participants claiming that the defendants acted improperly in restricting trading in the shares of and options on **GameStop** Corp. and other companies that were subject to unusual trading in January 2021 in what has been referred to as the “Reddit-related short-squeeze”. Most of these cases assert federal antitrust claims, including alleging an illegal antitrust conspiracy among the defendants, as well as various state and federal securities-related claims. IB LLC and its affiliates have been named as defendants in nine of these class action lawsuits. These cases have been consolidated into a multidistrict litigation (“MDL”), and were transferred to the Southern District of Florida on April 1, 2021 for pre-trial proceedings. All discovery has been stayed until amended complaints are filed, and issues regarding the timing of amended complaints and responses to the allegations therein will be addressed by the MDL court at a future date. The time for IB LLC and its affiliates to respond to the allegations will likely be stayed during the pendency of the Judicial Panel on Multidistrict Litigation proceedings. The Company believes that the claims asserted against IB LLC and its affiliates lack merit on their face and the Company intends to file, at the appropriate time, a motion to dismiss any class action that might name IB LLC and its affiliates as defendants. \n\n\\---------------------\n\nAlso used the shitadel search link: [https://www.sec.gov/edgar/search/#/q=citadel&dateRange=all&startdt=2021-05-10&enddt=2021-05-11](https://www.sec.gov/edgar/search/#/q=citadel&dateRange=all&startdt=2021-05-10&enddt=2021-05-11)\n\nNot much I can read there, mostly buying portions in investments firms, but a lot lower rate.\n\n\\-------------\n\nSince I was there, I thought I'd look another term: **squeeze**\n\n[https://www.sec.gov/edgar/search/#/q=squeeze&dateRange=all&startdt=2021-05-01&enddt=2021-05-11](https://www.sec.gov/edgar/search/#/q=squeeze&dateRange=all&startdt=2021-05-01&enddt=2021-05-11)\n\nSome companies have the same phrase GME had in their filling.\n\nFor the others, this seems like a new added phrase for \"Just in case\"\n\n>While we have no reason to believe our shares would be the target of a short squeeze, there can be no assurance that we won’t be in the future, and you may lose a significant portion or all of your investment if you purchase our shares at a rate that is significantly disconnected from our underlying value.\n\nThis document has the definition of Short selling and short sqeeze in it, in legalese [https://www.sec.gov/Archives/edgar/data/0001006373/000008805321000420/df050121vit.htm](https://www.sec.gov/Archives/edgar/data/0001006373/000008805321000420/df050121vit.htm)\n\n**Look like Wells Fargo is pushing a false narative:**\n\n[https://www.sec.gov/Archives/edgar/data/0001081400/000119312521154925/d50560dncsr.htm](https://www.sec.gov/Archives/edgar/data/0001081400/000119312521154925/d50560dncsr.htm)\n\n>This was compounded by technical factors as some hedge funds were forced to sell stocks to protect themselves against a well-publicized short squeeze coordinated by a group of retail investors.\n\nBlackRock seems to warn about a short squeeze (just search for squeeze), aso there's more fillings from BR mentioning \"squeeze\", this is just one of them, and it looks like it's talking about swaps and derivatives.. this is way ahead of me.. u/atobitt?: [https://www.sec.gov/Archives/edgar/data/0001752019/000119312521156447/d732236dn2.htm](https://www.sec.gov/Archives/edgar/data/0001752019/000119312521156447/d732236dn2.htm)\n\nTake a look at what these fuckers say:  Western Asset Diversified Income Fund [https://www.sec.gov/Archives/edgar/data/0001819559/000119312521148573/d16511dn2a.htm](https://www.sec.gov/Archives/edgar/data/0001819559/000119312521148573/d16511dn2a.htm)\n\n>To the extent that the Fund takes a short position, if such short position or strategy become generally known, it could have a significant effect on the Fund’s ability to implement its investment strategy. In particular, public disclosure may increase the likelihood that other investors could cause a “short squeeze” in the securities held short by the Fund forcing the Fund to cover its positions at a loss\n\nI may be stupid but it looks like they say they don't want to disclose their short positions. Dudes, **the best way of avoiding a short squeeze, is to avoid shorting, not to avoid transparency!**\n\nSo it looks like \"squeeze\" became a more and more usual word on the SEC filings. Will include this is my daily searches (I know I don't post daily, sometimes it's not much to see)\n\nDo what you want with this info, could be nothing, could be good DD starting point for more wrinkled brain apes, I just like to search [SEC.gov](https://SEC.gov) and this is no kind of advice, this is written on the SEC website\n\nObligatory: 🚀🚀🚀\n\n&#x200B;\n\nEdit: Okay, so I thought I'd give it one more try with \"short positions\": [https://www.sec.gov/edgar/search/#/q=short%20positions&dateRange=all&startdt=2021-05-07&enddt=2021-05-11](https://www.sec.gov/edgar/search/#/q=short%20positions&dateRange=all&startdt=2021-05-07&enddt=2021-05-11)\n\nTake a look at what these fuckers say: [https://www.sec.gov/Archives/edgar/data/0000898745/000089874521000361/sp20202054globalmulti-stra.htm](https://www.sec.gov/Archives/edgar/data/0000898745/000089874521000361/sp20202054globalmulti-stra.htm)\n\n>When taking a short position, the Fund may sell an instrument that it does not own and then borrow to meet its settlement obligations.\n\n**They SELL before they Borrow! WTF?**\n\nEdit 2: Adding other fuckers with other interpretation of short selling: [https://www.sec.gov/Archives/edgar/data/0001314414/000158064221002289/biondo497.htm](https://www.sec.gov/Archives/edgar/data/0001314414/000158064221002289/biondo497.htm)\n\n>A short sale is a transaction in which the Fund sells a security it does not own or have the right to acquire (or that it owns but does not wish to deliver) in anticipation that the market price of that security will decline.\n\n**WTF?**",
    "title": "Running my daily SEC.gov search for my beloved stock to see what's new with it",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/n9rpg1/running_my_daily_secgov_search_for_my_beloved/"
}