{
    "author": "dg_713",
    "created_utc": 1628149065.0,
    "distinguished": null,
    "edited": 1628158899.0,
    "id": "oycn59",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_oycn59",
    "num_comments": 89,
    "permalink": "/r/Superstonk/comments/oycn59/re_bank_of_americas_potenial_bankruptcy_the_58/",
    "score": 1494,
    "selftext": "**tl;dr:** I don't exactly know how this will affect the thesis of u/gfountyyc's potential DD titled [Bank of America Is Short GME And Is Positioned For A Potential Bankruptcy (semi debunked post from last night)](https://www.reddit.com/r/Superstonk/comments/oxz8kg/bank_of_america_is_short_gme_and_is_positioned/). The main purpose of this post is to simply add some information about reading a Statement of Cash Flow and how it can be generated in two ways, and how sometimes, a deduction is not necessarily a loss in cash depending on the method used by the Statement of Cash Flow. The line item *Trading and derivative assets/liabilities* amounting to $58.372 billion, which is interpreted as a loss, doesn't seem like a loss to me, but is merely an adjustment per the standard procedure of using the Indirect Method of preparing a statement of cash flow. If you want to understand further what this means, you can read on.\n\n===============================================================\n\nTo start off, there is a portion in there that I think need to be addressed as this is an inaccurate interpretation based on what I know about how to generate operating cash flows:\n\n[Image 1: Taken from u\\/gfountyyc's work, which will be the only portion I will discuss](https://preview.redd.it/1swocaqingf71.png?width=813&format=png&auto=webp&s=4fc84ec654b1f7468fc857a0adecf1eb9959b8fc)\n\nIn this section of the potential DD showing BofA's Consolidated Statement of Cash Flows, the line item *Trading and derivative assets/liabilities* amounting to $58.372 billion *is interpreted as a net loss in cash*. This is the obvious interpretation and even the line items themselves can mislead a reader towards that conclusion because after all, even the bottom line item is called *Net cash provided (used in) operating activities*. However, this particular Consolidated Statement of Cash Flows by BofA isn't arrived at by how most of us think a report is prepared, such as like this one below:\n\n[Image 2: A straight-forward cash flow report of some poor but happy shmuck because of his last $15 purchase](https://preview.redd.it/sna8tq61qgf71.png?width=519&format=png&auto=webp&s=dffa88d64e386fac4981c60671c91d50dc07c233)\n\nThis is how we normally interpret a cash report, by simply adding what we receive, and deducting whatever we spend, with the net amount being whatever cash remains. When applied to accounting and finance, we call this the Direct Method of generating a cash flows statement, it is [defined by investopedia](https://www.investopedia.com/terms/d/direct_method.asp) as:\n\n[Image 3: Taken from https:\\/\\/www.investopedia.com\\/terms\\/d\\/direct\\_method.asp](https://preview.redd.it/sihdbf0qqgf71.png?width=622&format=png&auto=webp&s=e9245b0fac32bf381a6c5be8447fe22be9a4f828)\n\nThis definition simply has too much jargon and I recommend my smooth brain definition in the caption of Image 2, of simply adding what we receive and deducting what we spend. I simply provided this link and picture to show that it is an established practice in accounting and finance.\n\nHowever, that is not how BofA, and many other businesses regardless of industry, generate their Statement of Cash Flows. Notice that in investopedia's definition, the first sentence says that there are two accounting treatments used to generate a cash flow statement. Since the first one called the *Direct Method* isn't the one used by BofA, then it must be the second one, right? I will also show later how I know that it isn't Direct Method that they used. Enter the [Indirect Method](https://www.investopedia.com/terms/i/indirect_method.asp):\n\n[Image 4: Taken from https:\\/\\/www.investopedia.com\\/terms\\/i\\/indirect\\_method.asp](https://preview.redd.it/ty952vlpsgf71.png?width=610&format=png&auto=webp&s=d5442618dd036cca4e96535e1b7ea2bcdba5d3e2)\n\nAs the definition states, it uses increases and decreases in the balance sheet line items to modify the operating section of the cash flow statement.\n\nGoing back to Indirect Method, a website called [accountingtools.com](https://accountingtools.com) has a better definition of that [here](https://www.accountingtools.com/articles/2017/5/17/cash-flow-statement-indirect-method):\n\n[Image 5: Taken from https:\\/\\/www.accountingtools.com\\/articles\\/2017\\/5\\/17\\/cash-flow-statement-indirect-method](https://preview.redd.it/j0q7rc4gtgf71.png?width=981&format=png&auto=webp&s=e504e10a295c5e18e558912b075eb13c19e2328f)\n\nNow let's take a look at the example provided by [accountingtools.com](https://www.accountingtools.com/articles/2017/5/17/cash-flow-statement-indirect-method) side-by-side with the one published by BofA:\n\n[Image 6: The example from accountingtools.com's article for Indirect Method of Cash Flow Statement generation and BofA's Consolidated Statement of Cash Flows. I just removed the extra spaces between the line item labels and the amounts so they can fit a little better. A little segue: Just in case you are wondering, the only difference between a Statement of Cash Flows and a \\\\\"Consolidated\\\\\" Statement of Cash Flows is that a Consolidated one combines all of the cash flows statement from the parent company, in this case BofA, and all of its subsidiaries.](https://preview.redd.it/klia172rvgf71.png?width=1344&format=png&auto=webp&s=98e424c89ee15b0c64d0a55dc3cc3613386e9b14)\n\nNow that we have defined what method was used by BofA in preparing its Consolidated Statment of Cash Flow, what we need to do now is to tie it up with how the line item *Trading and derivative assets/liabilities* amounting to $58.372 billion has been misinterpreted as a net loss in cash.\n\nTo do this, let us first look into how cash actually goes in and out of a business because of its operations (hence, the operating cash in*flow* and out*flow*). There are many ways it does, but these ones are the most relevant in our discussion:\n\n1. **BofA paid cash for services, salaries, utilities, etc. as part of its expenses** \\- since this is part of the business's expenses, it is immediately accounted for in the income statement, and thus, is *ultimately factored in when the Net Income is calculated, which is the starting point of a Statement of Cash Flow that is prepared using the Indirect Method.*\n2. **BofA has received cash for the interest it is charging on loans it grants** \\- this is also *ultimately factored in when the Net Income is calculated, which is again, the starting point of a Statement of Cash Flow that is prepared using the Indirect Method.*\n3. **BofA has received cash for its sale of trading assets and derivatives** **as part of its operations** \\- this one has two components in this transaction: The portion that is the cash it originally paid to have ownership of the trading asset or derivative and the portion it has realized as a loss or gain. Dividing this transaction into two components is important because for example, if BofA buys $5million worth of $ASS, then sells it for $5.5million, then only the remaining $0.5 million, i.e., the *portion that is the realized of gain is going to be ultimately factored in the Net Income, which is again, the starting point of a Statement of Cash Flow that is prepared using the Indirect Method (I know, I just want to be sure this is emphasized enough).* Meanwhile, the other portion, which is the cost of $5 million, is simply accounted for as a \"conversion\" from being $ASS to cash, in other words that $5 million worth of cash, which is *the cost of the trading asset sold is not going to be factored in the calculation of the Net Income, but will only be recorded into the balance sheet as a* ***decrease in trading asset***\\*, and an\\* ***increase in cash***\\*.\\* Look at this illustration below:\n\n[Image 7: How the gain or loss in the sale of assets, such as trading assets or derivatives, are recorded separately for the balance sheet and the income statement\\/net income](https://preview.redd.it/zuxj2kycohf71.png?width=600&format=png&auto=webp&s=c1745d9860ddc545ab9a80ca1d352529c59d88eb)\n\nThat illustration and the above enumeration is important because it shows how not everything that happens to a company's cash is recorded in the income statement, but only in the balance sheet, and vice-versa. However, it also shows you that you can actually just start your cash flow statement from the net income and just add or deduct some balance sheet items to arrive at how much cash were actually used for the operations, *because many things that has to do with cash is already factored into the Net Income, not exactly all, but many*. So if you are thinking that using indirect method is just a convenient way of preparing a cash flow statement, then yes, you are correct.\n\nSo now, by following the definition that Indirect Method, is simply using the changes in the balance sheet of the company as adjustments to the net income, so that the operating cash flow can be arrived at, we can then look at BofA's balance sheet to see if the negative amount of $58.372 billion in Trading and derivative assets/liabilities, is actually a loss or simply a decrease in the cash of BofA with a corresponding increase in its trading and derivative assets/liabilities:\n\n[Image 8: The consolidated balance sheet of BofA as of June 30, 2021 showing the trading account and derivative assets and liabilities.](https://preview.redd.it/untzj6wyihf71.png?width=964&format=png&auto=webp&s=dd20e6fb1cb099cc75bb771523df48037f969e27)\n\nThen to calculate the change in trading and derivative assets and liabilities:\n\n[Image 9: I took the highlighted amounts from the balance sheet and did this calculation.](https://preview.redd.it/mi2gka1nihf71.png?width=744&format=png&auto=webp&s=971ec701ff57faa12c0c1d1c405f054b4e409993)\n\nAs you can see, there is only a 6.05% difference between the net change in trading and derivative assets/liabilities as reported by BofA compared to what I calculated using their own balance sheet. I could posit a few reasons for why there is still some difference:\n\n1. The $58.372 billion is the original cost of the derivatives as they have reported in the cash flows statement, of which the purchases occurred between January 1, 2021 to June 30, 2021, and these securities have since netted an unrealized loss of about 6.05%.\n2. Quarterly financial statements aren't exactly as thoroughly audited as annual financial statements, hence, the inaccuracies in their reporting.\n3. Smooth brain mistakes with how I applied the concept of Indirect Method.\n\nEither way, the bottom line of this post isn't to debunk u/gfountyyc's potential DD titled [Bank of America Is Short GME And Is Positioned For A Potential Bankruptcy (semi debunked post from last night)](https://www.reddit.com/r/Superstonk/comments/oxz8kg/bank_of_america_is_short_gme_and_is_positioned/), but only to provide additional insight as to why, because of the method used in the Cash Flows Statement of BofA, the negative amounts in their operating cash flow section are not exactly losses per se, but are only reverse calculations needed to arrived at how much cash was actually used in the operations.\n\nEDIT: just a few words and a punctuation mark",
    "title": "Re: Bank of America's Potenial Bankruptcy: The $58 billion \"loss\" in trading and derivative assets/liabilities in the Consolidated Statement of Cash Flows is not exactly a loss, it is simply a subtraction to arrive at the net operating cash flow in an accounting approach known as Indirect Method",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/Superstonk/comments/oycn59/re_bank_of_americas_potenial_bankruptcy_the_58/"
}