{
    "author": "AlternativeNo2917",
    "created_utc": 1618071790.0,
    "distinguished": null,
    "edited": false,
    "id": "mo7t8c",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mo7t8c",
    "num_comments": 652,
    "permalink": "/r/Superstonk/comments/mo7t8c/options_data_proves_hedgefunds_need_to_bankrupt/",
    "score": 7212,
    "selftext": "TLDR - Options data show that the hedgefunds are still fucked and the original plan for bankrupting GME hasn't changed. Since I've become more active on reddit either making posts, commenting more or responding to DMs I've started getting threatening messages and \"insulting\" comments, these do not bother me and the tone of my posts will now include a lot more sarcasm and mocking in response, please enjoy. \n\n&#x200B;\n\nApe. Are you struggling with the weekend?  Do you miss eating crayons? Looking for some friendly confirmation bias to stop you climbing up the walls? \n\nYou've come to the right place!   \n\n\nI've gone through all the option data on yahoo finance for this coming week which I will link incase you want to look for yourself.\n\n([https://finance.yahoo.com/quote/GME/options?p=GME](https://finance.yahoo.com/quote/GME/options?p=GME)) \n\nFor all you apes that don't click links don't worry I've got screenshots, I'm used to you lazy fucks now.   \n\n\n[$0.5 - $10 strike price with OI of 228,077 ](https://preview.redd.it/cfeto1o95ds61.png?width=1104&format=png&auto=webp&s=9b6e575a3a400d6e5c57128873f63637edd5eb0a)\n\nIt's likely these options were placed a long time ago so the premium that would've been paid on these puts is likely in the millions of bananas. Hedgefunds go ouch. \n\nThis quite simply is why we keep seeing GME attacked in the news, why Mevlin lied to congress to say they covered thier shorts, why the data that is being reported by S3 and others is just complete bollocks. The play was to bankrupt GME to save on tax. They didn't cover at $40 they aren't covering at $160 because they bet BIG on GME dying. \n\n&#x200B;\n\n[$11 - $30 strike price with OI of 72,842](https://preview.redd.it/8xwjxs3s7ds61.png?width=1076&format=png&auto=webp&s=61624af6a0fed3eb36694ba9872a2631b0b23fbf)\n\nSo lets quickly total that up... 300,919 puts with OI for $30 or less... let me just quickly check the price again... $158.36\n\n&#x200B;\n\nhttps://preview.redd.it/j1gj3i3j8ds61.png?width=500&format=png&auto=webp&s=f4ff23b4da72f66da7ab0d338031921764baa5c4\n\nThat was a bad play hedgies... Would not recommend. \n\nI just hope for their sake that they don't have many more of these positions otherwise they are going to be seriously hurting. \n\n&#x200B;\n\n[$31 - $50 strike price with OI of 48,542](https://preview.redd.it/mszn8fj09ds61.png?width=1076&format=png&auto=webp&s=12d240d06bbe2399c79e9ad73b57127411810624)\n\nYou think this will go below $50 per share!?!? With Captain Cohen in charge???\n\n&#x200B;\n\n[Mad millionaires calling up Gabe and Kenny G ](https://preview.redd.it/c1wfkqq9ads61.png?width=1136&format=png&auto=webp&s=4e42e8a3526fe9b546ee0e7a73fcba7755ba0f18)\n\nI keep seeing news reports about reddit being bad for the market users say stupid things like \"We like the stock\" \"Apes together strong\" and Citadel spend billions on order flow to know exactly what everyone here is doing so that they can counter it and profit. Yet here we are... shills reading this please ask Kenny, Gabe and any other dumb dumb who keeps betting against GME \n\n\"y u do dis\" \n\nI would like to know. \n\nAnyway enough sass (for now) back to the data. \n\n&#x200B;\n\n[$55 - $145 strike price with OI 46,769](https://preview.redd.it/yqdk0ljfbds61.png?width=1066&format=png&auto=webp&s=7391a378409cc41b03ba6b02514dc02edb1c7f97)\n\nOk so we are at 396,230 puts now and none of them are in the money currently moving into next week....\n\n&#x200B;\n\n[Pls shills, ask the dumb dumbs. ](https://preview.redd.it/7u5u2qoicds61.jpg?width=600&format=pjpg&auto=webp&s=aa56a7ee6adc1609d6d273d200c5aa4a72f2a9e3)\n\nNow to add up all the puts that expire this week on April 16th, there are **422,649** with a large majority of them currently being out of the money. So expect more fuckery and the price to be driven down further but remember that the play is BANKRUPT GME. That was the goal at the start for these hedgefunds and just looking at the insane amount of puts just this week we can see that hasn't changed. \n\nJust for comparison there are 126,256 call options this week, including 500 from the legend himself u/DeepFuckingValue at $12. Which means he has the right to buy another 50k shares for $12 each. Although it will actually be slightly less as if he decides to as he would've paid a premium for the position already. \n\nFor the moon boys there are 33,300 calls on GME being $800 or higher by Friday 16th. Good luck to anyone on that YOLO play, I personally haven't made any I just buy and hold my shares and then stare at them 24/7 and shout \"do a kickflip\" so far no success but I'll keep you updated. \n\nIn summary, there really isn't a need for more DD... Hedgefunds put the house, the yacht, the instagram model wives all on GME going bankrupt and it just isn't going to happen. GME recently reported that preliminary sales are up 11% from the same time last year.   \n\n\n[https://finance.yahoo.com/news/gamestop-announces-preliminary-sales-results-100000741.html](https://finance.yahoo.com/news/gamestop-announces-preliminary-sales-results-100000741.html)\n\nRemember that they have also massively reduced costs by moving to ecommerce and closing underpreforming stores, they could very well be on pace to have a more profitable start to the year in 2021 than they did in 2019 precovid and this is just the beginning for the Cohen era for GME. \n\nThe squeeze is invevitable if you have doubts just turn off the news, close your laptop and set a price alert for $800 per share so you don't miss the gamma squeeze, before the short squeeze, before the MOASS!\n\n&#x200B;\n\nThank you and I'll see you somewhere in space!",
    "title": "Options data proves hedgefunds need to bankrupt GME or they will go bust.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mo7t8c/options_data_proves_hedgefunds_need_to_bankrupt/"
}