{
    "author": "animasoul",
    "created_utc": 1618084119.0,
    "distinguished": null,
    "edited": 1618084367.0,
    "id": "mobnyf",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_mobnyf",
    "num_comments": 129,
    "permalink": "/r/Superstonk/comments/mobnyf/the_anatomy_of_an_equity_swap_how_prime_brokers/",
    "score": 875,
    "selftext": "A question has been floating around for a while – *why didn’t the shorts just pay in Jan, why do they make their lives worse*? The general answer has been that they are just greedy, but there’s something unsatisfying about that. They might be greedy but they can’t be that stupid. A lot of hedge funds took advantage of RobinHood’s halt on buying to close out their short positions. They took their losses and are making their way back like big boys should. That’s what anyone with half a brain would do. You would just forget about GameStop.\n\nNow why might market makers and prime brokers not do the same? Why not just take the loss? Because of the anatomy of the **equity swap** and the legal consequences for a broker/market maker when a hedge fund client fails. ESPECIALLY when the client was short.\n\nTo understand an equity swap, let’s start with an equity swap where the **client is long**. That is what happened to Archegos.\n\n# Equity swap – client goes long\n\n&#x200B;\n\n[What happened with Archegos  ](https://preview.redd.it/sk9wrycgdes61.png?width=1724&format=png&auto=webp&s=4b4aacda17d1976ca70549a55e1caf0567f010b4)\n\nI already wrote about this here: \\[[https://www.reddit.com/r/GME/comments/mh6gfz/the\\_big\\_banks\\_are\\_the\\_shorts\\_who\\_have\\_to\\_pay\\_when/](https://www.reddit.com/r/GME/comments/mh6gfz/the_big_banks_are_the_shorts_who_have_to_pay_when/)\\] but to quickly recap, ever since Basel III and the Dodd-Frank Act, it has become more expensive to short stocks the traditional way with margin lending or securities lending. For that reason, the **synthetic prime brokerage** business has boomed, with the most popular transaction being the **equity swap**.\n\nIn a swap, you don’t actually invest in anything. You don’t buy or sell short anything. That would be an investment. You just **PRETEND** to invest. You write a contract outlining the terms and conditions of the pretence and agree on the money each side has to pay depending on how the underlying asset performs. That’s why I labelled the positions **synthetic**.\n\nThis contract will end when it matures and the final payments are made. As you can see from the picture, in the case of **a client going long on the swap**, the swap provider/executing dealer can then unwind the long equity hedge (the hedge is a real position) by selling the security.\n\nWhen **Archegos** failed to fulfil its end of the swap, the prime brokers unwound their long hedge by making emergency sales on the open market. It seems that Goldman made enough on the appreciation of the share price until that time to cover its costs, but Credit Suisse and Nomura were late and sold into a falling market, and did not cover the cost of Archegos failing to make its payments.\n\n# Equity swap – client goes short\n\n&#x200B;\n\n[What will happen with GME](https://preview.redd.it/8wi06w78ees61.png?width=1725&format=png&auto=webp&s=a62f72c37e64ec8d3cd4a9274a6db85650cb90bb)\n\nThe positions of provider/dealer and client are reversed in this case. Where client long produces a real long for the dealer, **client short** produces **a real short for the dealer**. This short must be unwound (i.e. the shares acquired) for the swap to end. We know that in 2020, the institutional opinion on GME was very negative. It was a company on the way out. The only reason for any institution which is not a market maker or a broker-dealer to hold GME shares was to make money by lending them out. That would be ETFs, pension funds, long portfolios, etc. You can also see this in the diagram in the **“Market”** box.\n\n❗  Notice that the dealer in the short equity swap is forced to (short) sell the underlying on the market.\n\n❗  Notice the box does not include diamond handing apes buying the underlying and not giving it back.\n\nThis is why they are stuck. The hedge fund client, i.e. Melvin as far as we know, has probably already failed. That leaves the dealer with a synthetic long exposure that its hedge fund client can’t pay for and a real short exposure that it can’t cover because apes are holding too many shares. To make things worse, an equity swap’s **notional** resets on each cash flow date in accordance with the performance of the asset. So the equity swap is resetting at a higher and higher price as GME’s price rises. Unless they arranged for a single payment at the end of the contract only.\n\n# Liability of the prime broker when a hedge fund fails\n\nWhen a hedge fund fails, the hedge fund’s customers can go after the prime broker to get their money back. Nuff said. See the sources below if you are interested in the case law.\n\n# The negative beta\n\nIf you’ve been following me until now, you will know the picture I have built through each of my posts and the responses I seem to be getting from MSM and Kenny G. Here is my timeline again up to **4 April**.\n\n[At 4 April](https://preview.redd.it/ntimw2svees61.png?width=838&format=png&auto=webp&s=d7cf874799dee6b1a4591e72eaae3d07eca64d67)\n\nNow I’m not a quant and I don’t know all the ins and outs of the maths that they have put into this market engineering. To my limited, crayon-fuelled understanding, the prime brokers and market makers seem to be engineering a market crash, are likely positioning net short on equities and long on gold to survive. For some reason, the maths is giving GME this crazy negative beta (and GME short a crazy positive beta), meaning their market crash entails that GME will moon.\n\n# How will the squeeze play out\n\nI am not sure right now how the squeeze will play out. It’s worth asking how they can potentially crash the market without squeezing. Any market crash is going to need a crisis of the **banks** (who are also the **prime brokers**). We have already seen the mind-blowing losses of **Credit Suisse** and **Nomura** due to client-long equity swaps with **Archegos**. It is likely only the tip of the iceberg. What if the rest of the iceberg is **client-short** equity swaps? *In a long, loss is limited to 100% of exposure. In a short, loss is potentially infinite.*\n\n# Thick as thieves?\n\nHow much solidarity do thieves really have between each other?\n\nHave you seen the movie **Margin Call**? That’s what Goldman did with Archegos. They sold out first to save themselves. I can imagine that at some point, one of the brokers is going to go out onto the market to be the first to close their shorts, throwing everyone else after them under the bus. Only then will we see a market crash. (*See my previous posts for what I wrote about the signs I see of a market crash*.)\n\n🚀 🚀 🚀 🚀 but I can’t dance.\n\n&#x200B;\n\n[30-day beta of GME against the Dow Jones at 10 April 2021](https://preview.redd.it/gsl0gkwafes61.png?width=761&format=png&auto=webp&s=91d8cd46f7eebaec64e0b2b0b78761cb72dd9004)\n\n**Disclaimer:** Educational purposes only. Any errors are my own. Any decisions are your own.\n\n**Sources:** [http://media.mofo.com/files/uploads/Images/The-ties-that-bind-the-prime-brokerage-relationship.pdf](http://media.mofo.com/files/uploads/Images/The-ties-that-bind-the-prime-brokerage-relationship.pdf) and [https://studylib.net/doc/8844817/thinking-outside-of-the-index--equity-index-futures-and-swaps](https://studylib.net/doc/8844817/thinking-outside-of-the-index--equity-index-futures-and-swaps) and [https://bsic.it/short-selling-bans-the-introduction/](https://bsic.it/short-selling-bans-the-introduction/). For more see previous posts.\n\nFor the \\*\\*FT'\\*\\*s article on Archegos and equity swaps, google:  *Archegos debacle reveals hidden risk of banks’ lucrative swaps business Derivatives that blew up Hwang family office were growing source of revenue for Wall Street*\n\nPosted 10 April 2021.",
    "title": "The anatomy of an equity swap - how prime brokers and market makers are stuck in equity swaps and GME will moon 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mobnyf/the_anatomy_of_an_equity_swap_how_prime_brokers/"
}