{
    "author": "Parsnip",
    "created_utc": 1627278900.0,
    "distinguished": null,
    "edited": 1627286403.0,
    "id": "orsltt",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_orsltt",
    "num_comments": 222,
    "permalink": "/r/Superstonk/comments/orsltt/diamantenhände_german_market_is_open/",
    "score": 2912,
    "selftext": "Guten Tag to all of you Great Apes around the world! 👋🦍\n\nI've learned not to have any expectations around GME, but I certainly did not expect to see the lowest volume in 2 years last Friday. Fridays have had a tendency to have a bit more volume, maybe due to options activity or paychecks, but volume below 1.3m is simply astounding. It is *clear* that Apes are HODLing with Diamantenhände. Well done, Apes. This is how the MOASS happens.\n\nLast week delivered other gifts as well, in the form of several hundred pages of fresh tit-jacking material. We've been granted a glimpse behind the curtain to see how the short positions are hidden, and the plan on how this whole mess will unravel when the MOASS begins. Our biases were already confirmed, of course, but this was confirmation icing on top. As we eagerly await each new piece of DD into NSCC-2021-803 and NSCC-2021-010, let's also take a moment to welcome Gurbir Grewal to lead enforcement at the SEC. Everything I've learned about Herr Grewal gives me great hope that he will set a new direction for SEC enforcement, and I'm sure we'll all welcome that.\n\nToday marks the start of another trading week. Monday, July 26th. You know what that means! Join other apes around the world to watch low-frequency updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\r\n- 🟩 120 minutes in: **$179.76 / 152,76 €**  *(volume: 1143)*\r\n- ⬜ 115 minutes in: $179.65 / 152,68 €  *(volume: 1132)*\r\n- ⬜ 110 minutes in: $179.65 / 152,68 €  *(volume: 1132)*\r\n- 🟥 105 minutes in: $179.65 / 152,68 €  *(volume: 1132)*\r\n- 🟩 100 minutes in: $179.67 / 152,69 €  *(volume: 1126)*\r\n- 🟥 95 minutes in: $179.65 / 152,68 €  *(volume: 1120)*\r\n- 🟥 90 minutes in: $179.71 / 152,72 €  *(volume: 1120)*\r\n- ⬜ 85 minutes in: $180.17 / 153,11 €  *(volume: 1120)*\r\n- 🟥 80 minutes in: $180.17 / 153,11 €  *(volume: 1116)*\r\n- ⬜ 75 minutes in: $180.56 / 153,45 €  *(volume: 816)*\r\n- 🟩 70 minutes in: $180.56 / 153,45 €  *(volume: 806)*\r\n- 🟩 65 minutes in: $180.52 / 153,41 €  *(volume: 728)*\r\n- 🟩 60 minutes in: $180.24 / 153,18 €  *(volume: 697)*\r\n- 🟩 55 minutes in: $180.23 / 153,16 €  *(volume: 695)*\r\n- ⬜ 50 minutes in: $180.14 / 153,09 €  *(volume: 682)*\r\n- 🟥 45 minutes in: $180.14 / 153,09 €  *(volume: 675)*\r\n- 🟩 40 minutes in: $180.18 / 153,12 €  *(volume: 578)*\r\n- 🟩 35 minutes in: $179.84 / 152,84 €  *(volume: 473)*\r\n- 🟥 30 minutes in: $179.77 / 152,78 €  *(volume: 471)*\r\n- 🟩 25 minutes in: $179.79 / 152,79 €  *(volume: 451)*\r\n- 🟥 20 minutes in: $179.21 / 152,30 €  *(volume: 349)*\r\n- 🟥 15 minutes in: $179.24 / 152,32 €  *(volume: 344)*\r\n- 🟥 10 minutes in: $179.80 / 152,80 €  *(volume: 113)*\r\n- 🟩 5 minutes in: $179.92 / 152,90 €  *(volume: 110)*\r\n- 🟥 0 minutes in: $179.87 / 152,86 €  *(volume: 0)*\r\n- 🟩 US close price: $180.36 / 153,28 €   *($180.54 / 153,43 € after-hours)*\r\n\n\n***\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.1767. I wrote and maintain a C# application that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nMany among the Diamantenhände community are concerned about the well-being of the originator of the series, u/DerGurkenraspler, following their sudden disappearance after Memorial Day. I also am worried, as I had tried to make contact many times and never received a direct response. Four weeks ago, DerGurkenraspler deleted their Reddit account. While this gives me hope that they are alive and well, it seems to be a certainty that they will not be resuming their role as the curator of the series. I've been serving as host since their unexpected absence began and I intend to continue to post updates, but dearly hope that DerGurkenraspler is well and sincerely thank them for the effort they put into building the worldwide community that lives on.\n\nDiamantenhände isn't just a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
    "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/orsltt/diamantenhände_german_market_is_open/"
}