{
    "author": "happysheeple3",
    "created_utc": 1627301011.0,
    "distinguished": null,
    "edited": 1627344562.0,
    "id": "orxag8",
    "text_only": true,
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_orxag8",
    "num_comments": 122,
    "permalink": "/r/Superstonk/comments/orxag8/the_smoking_gun_ftds_and_the_archegos_collapse/",
    "score": 1943,
    "selftext": "Edit 2: I was unaware that the SEC rolls FTDs forward in their reports. Consequently, my data may not be accurate because I aggregated FTDs rather than calculating how many appeared and/or disappeared. \n\nNevertheless, if the FTDs were covered the next day and new FTDs were reported, my data would be correct. I don't know how many unique FTDs there were, and I doubt anyone does other than the MMs because the SEC does not report the FTD data in a cogent manner. \n\nTo rectify this, I will be uploading average daily outstanding FTD data for each ticker I mentioned (except TME coz it isn't that interesting). The charts still look pretty much the same, just the numbers are smaller because there are many days where outstanding FTD data is 0.\n\nThis is my first attempt at peer reviewed data analytics. Thank you for bearing with me! \n\nI'll leave the rest of the post as is. \n\nEdit 3: Updated charts with average daily values rather than aggregated values. \n\nhttp://imgur.com/a/SN5zdu3\n\nEdit 4: My thesis remains the same. There is certainly anomalous activity on and around the time of the Archegos manipulation. I don't have the data analytics expertise to elaborate further. If anyone wants it, I'll send the data. \n\n------------Start of post-------------\n\nWe’ve been discussing and theorizing at length about how the elites consuming one another in their efforts to stave off unlimited losses. What I found, MAY be a smoking gun in one such circumstance. \n\nTo set things up a little more, I’m sure that we’re all intimately familiar with how FTDs can affect price. If shares don’t get delivered, the supply of shares gets diluted, and it becomes easier for short sellers to suppress price. \n\nQuick Backstory: This all started while I was working on FTD data for a thesis completely unrelated to both GME and the topic I’m about to discuss. I was looking through March 2021 FTD data when I noticed VIAC had an absurd amount of FTDs in March. It peaked my interest, but I went about my business, not really stopping for thought.\n\nA few days later, while daydreaming about FTDs, it hit me. VIAC was one of the stocks that caused Bill Hwang’s family investment fund Archegos to be liquidated and it was one of his largest positions! My interest was now more than peaked. Could FTDs have caused this?\n\nI smell a mystery!\n\nTo find the answer, I downloaded all the FTD data between December 2019 when Viacom merged with CBS until the most recent FTD release which is the end of June of this year. Between 3/22 and 3/29 VIAC, lost $57/share. In that same time period, there were 2,725,736 VIAC FTDs totalling $254,245,560.68. Very interesting! \n\nNow this could be something, or it could be nothing. In order to establish anomalous activity, I would need to show that the FTDs during that period were substantially higher than in periods past. I do believe I have uncovered some “anomolus activity”.\n\nhttps://i.imgur.com/w0FL9rV.png\n\nIt gets better when you factor in total value of FTDs (# of FTDs x Settlement Price)\n\nhttps://i.imgur.com/iIe91bH.png\n\nThe total value of FTDs on VIAC in March were just about $500 mill! That could certainly put a dent in stock momentum and facilitate a short attack.\n“Ok Sheeple“ you may be thinking, \"didn’t Hwangalang have other positions\"? \n\nYou bet your sweet ape ass he did!\n\nDISCA FTDs\nhttps://i.imgur.com/1rWQltC.png\n\nValue of DISCA FTDs\n**https://i.imgur.com/BcTeqX0.png**\nLooks like Bear Week on Discovery heh heh heh\n\nHe also had substantial holdings in BIDU and TME. Their FTD data doesn’t correlate too strongly, but there is still something there, so stand by.\n\nBidu FTDs\nhttps://i.imgur.com/qpmoi9S.png\n\nBIDU FTDs total value\nhttps://i.imgur.com/SSwSPmG.png\n\nTME FTDs\nhttps://i.imgur.com/GZxE4cY.png\n\nTME FTDs total value\nhttps://imgur.com/5e0cyrw\n\nYou may have noticed the bulk of the BIDU and TME FTDs don’t all occur in March. According to WSJ, \n\n>“Mr. Hwang’s strategy began backfiring in recent weeks, as the stock price of companies in which Archegos had significant exposure, including China internet-search giant Baidu and Farfetch, began to sell off. Baidu’s stock price rose sharply in February, but by mid-March its shares had dropped more than 20% from its highs.”\n\nI do believe we have more than just a \"sell-off\" here. All those FTDs over the preceeding 5 months could have certainly compounded the effects of a sell-off / short attack.\n\nhttps://www.wsj.com/articles/what-is-archegos-and-how-did-it-rattle-the-stock-market-11617044982\n\nWhat you may have also noticed is that the FTDs in VIAC and DISCA continue after the margin call was made before tapering off back to their normal levels. I believe this provides further evidence of skullduggery.\n\nIt should be noted that this is not necessarily the work of our favorite punching bag Shitadel. Any market-manipulator responsible for delivering shares could have had something to do with this.\n\n--------Now onto price action.--------------\n\nI know you have a short attention span, so I’ll remind you that although BIDU and TME don’t have exceptionally anomalous FTD data, but there’s something there. I also promised you some GME involvement and I’m not gonna break that promise.\n\nThe price action on Billy’s largest positions exhibit some eerie similarities.\n\nVIAC yearly chart\nhttps://imgur.com/TO0aeg3\n\nDISCA yearly chart\nhttps://imgur.com/sFVzGxZ\n\nBIDU yearly chart\nhttps://imgur.com/JHJz6SO\n\nTME yearly chart\nhttps://imgur.com/BDet5Qw\n\nFTCH yearly chart\nhttps://imgur.com/bi3F5rs\n\nLast but definitely not least!\nhttps://imgur.com/RPWR96t\n\nWat doing market manipulators?\n\nClearly, March 24th was a big day. I don’t believe the correlations in Billy’s stock positions were the result of liquidation because, according to the major news outlets Hwang didn’t have his positions liquidated until the 26th. I could be wrong here, but this all seems like a coordinated attack to flush Billy out of his positions two days prior to the liquidation.\n\nI don’t have a clue why GME also went down on the 24th, maybe Billy was long??? If he was long GME, pushing him out of his positions would drive the price of GME down. It is sus that their charts are the same two days before the March 26th liquidation. After all, Hwang had 10's of billions of dollars at his disposal. At the time, it wouldn't have taken all that much money to drive GME up, or drop it down.\n\nImplications of all this: **THIS IS PURELY CONJECTURE**\n\n-\tEvery article I’ve read on the Archegos collapse claims that the banks leveraging Hwang did not know about how much leverage he was getting, or [how risky his positions were.](https://imgur.com/5SBvjkp) Assuming the anomalous activity was the result of market manipulation which I believe it is, someone had to know how leveraged Billy was in order to carry out the attack.\n\n\n-\tFTDs significantly affect price action! It shouldn’t have to be said, but I’ll say it anyway. If you’re a domestic or foreign investor with significant holdings, PAY ATTENTION TO FTD DATA!!!\n\n\n-\tSomebody, or more likely, somebodies made a lot of money off of this.\n\n\n-\tThe rich are feeding on their own.\n\n\nI could be 100% wrong and I look forward to what the apes with actual wrinkles have to say.\n\nLimitations of my work:\n\n1.\tI don’t have access to bloomberg terminal which would give me institutional short position reports in all the stocks I mentioned.\n\n\n2.\tI don't have the ability to check every stock in the market to see if the anomoly could be considered market wide. I did check a few other tickers, and there price action did not mirror Hwang's positions and GME, but again, I can't check every stock.\n\n\n3.\tThe MSM articles I’ve read don’t all report the events the same way\n\n\n4.\tI am a retard and have invested my life’s savings into my favorite stock\n\n\nTLDR: I believe that the Archegos collapse was orchestrated by one or more market makers utilizing FTDs to suppress upward trajectory in the underlying securities his positions were based on. If this is true, then someone knew full well how leveraged Hwang was despite what the media has said. \n\nGiven how much some banks made off of Hwang’s positions, its possible if not probable that they were in on it too.  GME moved right alongside the positions that Bill Hwang was in, so Billy Hwang may have been an ape. That might explain the actions taken against him by the market maker(s). I don't think it's an obsurd conjecture that DFV and RC were the only ones to notice Gamestop's potential. \n\nWall Street’s losses were estimated at $10 billion, so I do believe this warrants further investigation.\n\nEdit 1: Apparently I'm not allowed to aggregate the numbers because FTDs are rolled forward day to day. \n\nWhat I've posted is the maximum number of FTDs and associated cost that could exist. Later today I will go back and subtract the data points and fond the minimum number of FTDs and associated costs that could exist in the given data.",
    "title": "🚨🚨The Smoking Gun: FTDs and the Archegos Collapse🚨🚨",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/orxag8/the_smoking_gun_ftds_and_the_archegos_collapse/"
}