{
    "author": "lookshee",
    "created_utc": 1626917106.0,
    "distinguished": null,
    "edited": 1627005936.0,
    "id": "op3qdi",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_op3qdi",
    "num_comments": 690,
    "permalink": "/r/Superstonk/comments/op3qdi/as_of_today_i_will_own_gamestop_is_back_on/",
    "score": 11481,
    "selftext": "Hello Apes.\n\nIt has been nearly six months since my original thesis (which I cannot link here due to where it was posted and the auto-mod settings; it was back in February, so you can probably work it out) on how GameStop is worth more than the current price ($40 at the time), how GameStop is poised to do amazing things like create their own livestream content, produce their own high-production-quality original content, get into esports, etc... and most importantly: how hedge funds, market ma(ke)nipulators, and short sellers artificially suppressing the price creates an opportunity to exponentially increase one's position, forever.\n\n\n##Well, I'm back. And I'm a little pissed off.\n\n______________________________________________________\n\nAfter continually seeing nothing but positive news about GME, bullshit ways in which MSM spins the situation, short sell ratios through the roof, buy to sell ratios *grossly* weighted on the buy side (clearly routed through dark pools), etc... I've decided to step back up to the plate and continue doing my job: which is working toward owning this company outright.\n\n\nThis will be accomplished the same way I managed to increase my position throughout the time I was actively pursuing my thesis: leveraging options (by way of my share count), in order to amass capital on a weekly/monthly basis, and use that premium to acquire more shares.\n\n\nAdditionally, excess money that my business generates will be allocated to my portfolio in order to take advantage of sudden discounts; after all, averaging down is a gift.\n\n\nI am currently an XXXX shareholder. This week I acquired XXX more shares, and I expect I'll acquire XX more shares by end of next week.\n\n\nThis will continue every week until The Big Event.\n\n______________________________________________________\n\n\nEither I win, or you win; and as long as the stock price remains suppressed, my share count will increase at a compound rate.\n\n\nSee y'all from the boardroom.\n\n______________________________________________________\n\n*edit to add (included this in a separate post, but it makes more sense to tack it on here):\n\n**I do not recommend anyone follow me on this path.** My understanding is that most of you are here for the MOAß, and playing options is a good way to miss it. \n\nOver-leveraging yourself on long calls is a good way to end with zero money in your account when hedgies toy with the price.\n\nSelling the wrong dates and strikes on covered calls is a good way to lose your shares when the rocket launches. \n\nIf you mess with puts on GME, I don't even know what to say to you (good luck, I guess).\n\nKnow that if this drags out long enough, you lot (apes with a fixed floor, who want to make the world a better place) are going to be a much smaller problem for hedge funds to deal with than I am going to be.\n\nI don't need or particularly want the money. I just want to own this company; I found a mathematical anomaly through which I believe it is possible, and I intend to explore it to it's fullest extent (but I imagine the main event will occur long before I acquire enough shares to cause any sort of gridlock).",
    "title": "As of today, \"I Will Own GameStop\" is back on.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/op3qdi/as_of_today_i_will_own_gamestop_is_back_on/"
}