{
    "author": "bhaktimatthew",
    "created_utc": 1626892286.0,
    "distinguished": null,
    "edited": 1626916290.0,
    "id": "oovynk",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oovynk",
    "num_comments": 493,
    "permalink": "/r/Superstonk/comments/oovynk/start_preparing_yourself_now_for_the_most/",
    "score": 7109,
    "selftext": "Title. This is it, fellow apes and comrades. We have made it this far. We have beaten our drum incessantly demanding justice come to these Wall Street crooks, and they are about to be flattened under our weight. \n\nBut I implore you. Do NOT get cocky and lose focus. Don’t get arrogant. Don’t start thinking it’s a piece of cake. In fact, I encourage each and every one of you apes to start acting and thinking NOW like a Navy SEAL about to go into the most important, the most dangerous, high-risk operation you’ve ever done. \n\nAlmost every bit of bias about the MOASS has been confirmed. But the most important part of the MOASS theory is about to be tested—diamond fucking hands. \n\nEssentially, there is NO way for us to know what kind of mental or emotional state we will go into when our portfolio is literally in the millions, tens of millions, and hundreds of millions. The floor is $35mil IF NOT $50 MIL. Are we prepared to HODL until those numbers are reached? If not, do some thinking. Do some soul-searching. Go off into nature and think long and fucking hard about what’s ABOUT TO HAPPEN. Apes have the financial system by the balls. Do we have the courage to stand and fight our final fight? Or will we get scared, doubtful, and meek in the final hour? This is our witching hour. We either bring it all home or we miss out on the greatest opportunity history may ever present us, or any group, with to beat the system. \n\nIt may seem surreal to some to reach those numbers. The truth is, it’s entirely up to us what the price goes to. If nobody sells, we will reach Alpha Centauri. Just think now about it: is your share worth $10mil? $20 mil? $30 mil? Or beyond? We can skirt off with decent winnings that will certainly last us as individuals a lifetime at those levels. But I don’t think anyone is really here just for themselves. I want. The house. To be destroyed. They fuck us, time and time again, year after year, month after month, day after day. They stole our parents and grandparents $ like it was nothing. They’ve robbed entire generations of their right to pursue happiness, they keep us locked in a perpetual, inescapable cycle of wage-slavery and debt. They did this on purpose and by design. These are the ‘people’ we’re up against. Ask yourself now: do they deserve an iota of mercy or forgiveness from even a single one of us?\n\nThis is how history is made. This is how revolutions occur. It is made by a tsunami of individual effort and will that begins to transcend all logic, all reasoning, or all questions designed to quell it. There is no discussion here. We are winning this war (not just battle) and we are TAKING BACK what is rightfully ours. No questions, no debate. We have the DD. We have six months of rock solid evidence of financial terrorism and war crimes exercised at a level that is unfathomable to the rest of the planet.\n\nSo stand up. Take a fucking bow. Congratulate yourself and appreciate every single god damn ape you’ve met here, every single meme and each DD you’ve read. It has made you into an indomitable, fearless warrior and you are about to fight your last fight. The world needs you. Your entire family, your friends, your ancestors, your children and grandchildren NEED you now. And you will rise. You will fight. As an ape said yesterday, enjoy these moments because it’s about to get bloody and it’s all about to change. \n\nJust remember. These people decimated the *entire global economy* in 2008, got bailed out by American taxpayers, then started doing the same shit years later. Entire families, homes, livelihoods were destroyed in the tens of millions in every country. We will not, we must not, we CANNOT let that happen again. This is our One. Chance. \n\nYour shares of GME are likely the most valuable asset on earth right now. Be prepared to hold onto that FACT as this rocket starts to ignite. \n\nThat is mostly all. I just want to implore you now. Take a long walk or hike.  Reflect on all you’ve seen, heard, read, witnessed and experienced since December or Jan. Do you believe in the MOASS? Or will you flake out at $5/10mil? \n\nDo not hold for life-changing money. Hold for one thing only. World-changing, paradigm-shattering, fuck you in the teeth and beyond money. That’s exactly what these people deserve and that’s exactly what every single ape should be prepared to give them. Hodl for the PLANET because whether we like it or not, we are the ones in power now. We are the ones with the ONLY chance to stick it to the system so fucking hard that they crumble. Are you ready for that? Would you fight and die for that? I would. That’s what I come to this sub every day for. The gloves are off and there is no turning back. I want to utterly erase this fraudulent system (DTCC), take my winnings and rebuild from scratch. Who’s with me? \n\nThis is not a drill. Take a beat and prepare yourself now for one of the most important things humanity has ever embarked upon. You, reading this, yes you, are smack dab in the center of it. Are you ready? \n\nActually, yeah. Fuck these guys. The floor is $50,000,000/share.\n\nedit: obligatory this is not financial advice, all hypothetical and nothing I said here should be taken seriously. I’m speaking on my behalf. Do whatever you want.\n\nedit2: fucking watch this. \n\nhttps://youtu.be/POdknqszMDY",
    "title": "Start preparing yourself now for the most important journey you may ever take. Yes, we have the winning hand. But it’s moot if people panic-sell on the way up. If we want to take down the house, be prepared to have 10s of millions to your name and to keep holding.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/Superstonk/comments/oovynk/start_preparing_yourself_now_for_the_most/"
}