{
    "author": "PowerRaptor",
    "created_utc": 1626890851.0,
    "distinguished": null,
    "edited": 1626891512.0,
    "id": "oovh2q",
    "text_only": true,
    "flair_text": "HODL 💎🙌",
    "name": "t3_oovh2q",
    "num_comments": 256,
    "permalink": "/r/Superstonk/comments/oovh2q/until_a_catalyst_triggers_a_short_squeeze_the/",
    "score": 6608,
    "selftext": "We've seen obvious manipulation of GME for months.\n\nBuy pressure is insane and the price has been flailing wildly. GME was the most traded stock in Australia yesterday. More than any other security.\n\nDon't let them use the ticker to play with your emotions. When that's true for the price going down and users on this subreddit all write \"the price is fake\" (which it obviously is), it may just as well be the case on the way back up. I see posts here congratulating apes on what \"they did\" or \"achieved\" - and that gets people emotionally invested in positive price action.\n\nI think it would be wise to be wary that shorts could deliberately let the price run up, and that this may be a vector for sowing doubt in the long run.\n\n___\n\nAs I see it, the ticker is only the current price of a share. Its movement is independent of buy pressure or sell pressure - we've seen this demonstrated and theorized in more DD than I can count.\n\nIt's just what it'll cost me to get another share.\n\n____\n\nRetail knows the mother of all short squeezes is practically inevitable. SHF are in debt and *must* close the position sooner or later.\n\nI want to be holding as many shares as I can afford when it happens - and it's logical that the more shares are sold short (the higher the SI%), the more vulnerable the shorts are to a number of catalysts - dividends, splits, price spikes, regulation, liquidity tests, you name it. This is developing in the right direction for retail... I'll continue to buy and hold.\n\n**But until we do see a real catalyst - the ticker and price movement of GME is largely irrelevant.**\n\nPaper losses don't mean anything if I'm not gonna' sell. But neither do paper gains.\n\nI don't need the ticker to jack my tits. In fact, I want to strive for a complete disconnect between the jacking of aforementioned tits, and the ticker. They come pre-jacked from having read the Due Diligence and knowing shorts are fucked.\n\n(this is not financial advice)",
    "title": "Until a catalyst triggers a short squeeze, the price movement of GME is largely irrelevant.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/oovh2q/until_a_catalyst_triggers_a_short_squeeze_the/"
}