{
    "author": "JustBeingPunny",
    "created_utc": 1618038937.0,
    "distinguished": null,
    "edited": 1618120345.0,
    "id": "mo038k",
    "text_only": true,
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mo038k",
    "num_comments": 817,
    "permalink": "/r/Superstonk/comments/mo038k/04102021_the_fud_news_on_melvin_stop_believing/",
    "score": 8500,
    "selftext": "**Edit -** [04/11/2021 - The Fake Squeeze theory - Daily FUD Report](https://www.reddit.com/r/Superstonk/comments/moldpw/11042021_the_fake_squeeze_explained_ive_set_out/) \\- I've decided to go in depth a little more on the fake squeeze theory in 'tomorrows' FUD report.\n\n&#x200B;\n\n**EDIT (AGAIN) -** For everyone saying that *'it might just be true',* think about the most glaringly obvious problem.\n\nThey used Bloomberg and Reuters previously to push the *'We've covered'* narrative (via anonymous source) back in February.\n\nWhatever the motive here, **Why is their loss being reported in the media AT ALL? Better yet, from sources which Melvin are historically tied to for shilling purposes?**\n\n**Something is off.** Below is merely the speculation as to why this could be.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**EDIT - Thank-you all for being so open to a different view on this. I'd like to just state another couple points:**\n\n&#x200B;\n\n* Apes have to realise that there are a lot of silent investors who invested in GameStop that do not browse these subs. You might hold but it might just sway an average human. They are very much at risk to be influenced by MSM.\n\n*Like my mother...*\n\n&#x200B;\n\n* **There's the other obvious motive.** Using the ***\"49% down, 51% to go!\"*** as a headline makes it look as though retail investors intentions aren't there to support a great company. It's pushing the narrative that we are only investing in Gamestop to take down HFs, shifting the blame from their shitty decisions onto others. They may try and pull the:\n\n'*we were bankrupted by reddit investors. That was people's pension money. HAVE THEY NO SHAME'.*\n\n*Cue hate.*\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nGood morning apes *(I would appreciate* u/rensole\\*’s input on this)\\*\n\nI have used the possible DD flair instead of news. **As always, please leave a comment and let me know your thoughts.**\n\n&#x200B;\n\nhttps://preview.redd.it/vbxafh15pas61.png?width=307&format=png&auto=webp&s=f07f9896f9f1c30906bda07afcb6e4cf29b6506a\n\n&#x200B;\n\nThis post is taking a more serious tone because I believe this is important (hahahaha banana police).  I never advocate for one of my posts to be actively shared (I never think one is important enough lmao) but for this, I think it’s important lesson for a lot of people and a big reminder.\n\n&#x200B;\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n**The latest news report from Bloomberg shows:**\n\n# MELVIN CAPITAL IS DOWN 49% FOR THIS QUARTER\n\n&#x200B;\n\n&#x200B;\n\n**Great. Immediately smell bullshit. As much as I’d love to believe this, I still push to question everything (I'm the fud patrol!?)**\n\nBloomberg’s source? An insider to the fund. [Shillink](https://finance.yahoo.com/news/1-hedge-fund-melvin-capital-205342159.html)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/a7ay8xbfpas61.png?width=452&format=png&auto=webp&s=f1e82e215e235afb9933baaa86bce276866b4244\n\n&#x200B;\n\n&#x200B;\n\n**Woah so hold on? No SEC filing. Melvin declined to comment and its’ ‘an anonymous insider’.**\n\n**Bullshit is called on everything else with Melvin. Closing their short positions etc, but because this is confirmation bias, we give MSM a free pass? I mean c’mon….**\n\n&#x200B;\n\n&#x200B;\n\n# NOT ON MY WATCH\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**This is why I think it’s possibly FUD. Hear me out. Two scenarios here:**\n\n&#x200B;\n\n1. Melvin is actually taking heavy losses here and (obviously hasn't closed their short position). T*his would be nice but unverified articles make me uneasy. I can’t reference anything to prove it.*\n\n&#x200B;\n\n*Edit-* u/Ok_Read_7160 *pointed out they could be using this to cover for a much bigger loss. It's possible, though they have absolutely no obligation to post their current positions (note no SEC filings). Why would a little HF's loss make mainstream news?*\n\n&#x200B;\n\n&#x200B;\n\n# OR\n\n&#x200B;\n\n&#x200B;\n\n**2. HFs know we can sniff bullshit out from a mile off, BUT THE GUARD IS LET DOWN WITH ANY NEWS THAT’S CONFIRMATION BIAS.** Who bothers to check, its good news right? **WRONG. FUD PATROL CALLS BULLSHIT ON EVERYTHING.**\n\nThe question then has to be asked - '***what would they gain from saying they’re failing?'***\n\n&#x200B;\n\n**Oh I don’t know maybe a FAKE SQUEEZE**. I see the media narrative pushing the following –\n\n&#x200B;\n\n*MELVIN CAPITAL AT LOSSES OF 50%*\n\n*In order to save the failing fund, Melvin has began to cover short positions linked back to GameStop from January. The price rose to $500 during the week of 04/12/2021, with Melvin covering all of their positions.*\n\n&#x200B;\n\n(Jeez i’m borderline illiterate and that’s not far off of some of these so caller reporters sound like)\n\n&#x200B;\n\n**See that?** **You are led to believe Melvin was the only sinking ship in this battle and to save their fund, covered and made a fake squeeze to make everyone believe it’s all over.**\n\nRemember the DD stating there would be a fake squeeze to shake everyone?\n\nAnd regarding the question ‘what about a margin call’? Well can you not see Citadel have had weeks to fuck around and do whatever is necessary to prepare themselves. **I think Melvin is going to be the controlled explosion to FUD everyone into believing it’s over and for paper hands to take what they can get.**\n\n&#x200B;\n\n**This is why HODLING is more important than ever.**\n\n&#x200B;\n\n**EDIT 2 - Oh yeah, remember when Melvin were caught doing this in February?**\n\nFound that link about \"Melvin planted stories\": [**LINK**](https://web.archive.org/web/20210304081626/https://old.reddit.com/r/wallstreetbets/comments/lxatg6/melvin_planted_stories_about_their_feb_performance/) \\*\\*(\\*\\*thanks u/Tavmania)\n\n&#x200B;\n\n*Hello apes, I'm a former reporter at Bloomberg. I cannot divulge my name, but ask me anything else and I will try to prove I'm not bullshitting.*\n\n*Anyway, today we saw Bloomberg, CNBC, and Reuters simultaneously blast glowing articles about how Plotkin made 20% in Feb. Every story came out at the same time and cited \"sources\" or \"people familiar with the matter,\" but barely had any other details. This is typical of story planted by PR.*\n\n*PRs will tell every reporter on the street \"hey I got a tip for you but don't publish until Wednesday after market.\" And every reporter thinks they have an exclusive and types up the article. And then PR gets the most bang for the buck as every outlet publishes the same bullshit at the same time.*\n\n*I would know. I deal with Melvin's cunty COO David Kurd when I was reporting on them. This is his usual tactic. Anyway, I don't know if they're lying about these gains. Probably not. Maybe they fudged some mark-to-market valuations to show a good month. But the bigger takeaways is that Melvin is desperate to improve their image. They are weak. We are strong. Fuck Plotkin and fuck Kurd. Let's keep digging into their positions.*\n\n&#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# TL;DR – Today’s Lesson; Didn’t Read\n\n**Stop believing any confirmation bias from MSM without properly fact checking. It is a HUGE weak spot if they know it’ll run right through without anyone digging into it and can use it to their advantage. Always question motive. Wear your tin foil hat with pride.**\n\n*It’s possible we could be living in a completely fraudulent system.*\n\n&#x200B;\n\n**FUD PATROL OUT.**\n\n&#x200B;\n\n*Disclaimer- this is in no way financial advice. Do not base your investment decisions on any of my previous, current or future posts.*",
    "title": "04/10/2021 - THE FUD NEWS ON MELVIN – STOP BELIEVING MSM WHEN ITS CONFIRMATION BIAS – DAILY FUD REPORT",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/mo038k/04102021_the_fud_news_on_melvin_stop_believing/"
}