{
    "author": "CM_MOJO",
    "created_utc": 1616416430.0,
    "distinguished": null,
    "edited": 1616423249.0,
    "id": "mamgty",
    "text_only": true,
    "flair_text": "Hedge Fund Tears",
    "name": "t3_mamgty",
    "num_comments": 142,
    "permalink": "/r/GME/comments/mamgty/the_mythical_long_whale/",
    "score": 845,
    "selftext": "I keep hearing rumblings and grumblings from some on this subreddit and the WallStreeBets (WSB) subreddit that there are no long whales (LWs) out there ‘helping’ the retail investors (RIs). That it’s some mythical beast we tell ourselves about at night to keep our spirits up. I’d say to those who doubt they exist… What if I told you that Moby Dick really existed? And I don’t mean existed within the realm of the novel, a work of fiction. I mean [existed](https://en.wikipedia.org/wiki/Mocha_Dick) in real life sometime in the past.\n\nThar she blows, the mythical white whale. The LWs exist, it's not a myth.\n\nOh, you still don’t believe me? Thursday, March 11th, it was pretty obvious that the Short Sale Restriction (SSR) was purposely tripped right after open. Look at that drop right after the opening bell and then it IMMEDIATELY bounces back up.\n\n&#x200B;\n\n[The 'Flash Crash' on 2021-03-11](https://preview.redd.it/ltjeacwcoko61.jpg?width=653&format=pjpg&auto=webp&s=c1a5a08040006afcf76ba062efbf22fef306cca9)\n\nOh you’re one of those smoothed-brained apes, you still doubt the existence of the mythical Long Whale(s)? The last FOUR trading days, beginning Tuesday, 2021-03-16, through Friday, 2021-03-19, the price of GME closed just above $200. The last 10 minutes of trading on Friday was insane as two opposing forces were fighting over that $200 mark. It was crazy to watch. When my Yahoo screen showed the closing price right at the bell, it was $200 EXACTLY and I laughed so hard I almost fell out of my chair. It was later adjusted to $200.27.\n\nWhy was $200 so important? Because at that closing price on Friday, the most call options AND put options finished OUT OF THE MONEY (OTM). They became worthless. Someone lost a lot of money.\n\nStill don’t believe? I’ll try to be nice and just call you naïve.\n\nYou really think that there are no other intuitional investors and hedge funds out there and looking at this subreddit and all the great due diligence (DD) and research being done?  You really think they don't see what we see.  You think they like don't like money?  You think that they didn't look at the GME DD on this subreddit and not use their vast resources to do their own DD?\n\nStill don't believe? Well now, you're just being stupid.\n\nBut I’ll give you more ‘proof’. What if I told you [BlackRock owns](https://fintel.io/so/us/gme/blackrock#:~:text=2021%2D01%2D26%20%2D%20BlackRock,percent%20ownership%20of%20the%20company.) 9.2 million shares which is 13.2% of the company? [BlackRock](https://en.wikipedia.org/wiki/BlackRock) has $8.67 TRILLION dollars in assets under management (AUM). They are the WORLD’s largest asset manager and they own 13.2% of GameStop which is a LONG position. Not only is BlackRock a long whale, they’re the biggest whale in the ocean. They’re literally MOBY FUCKING DICK.\n\nSure, that data's almost two months old by now.  But you really think they they don't still have some long position in GME?\n\nStill don’t believe? Well now you’re just pissing me off. You’re either willfully ignorant at this point or just plain dumb. Please leave the discussion and let me talk to the rest the apes.\n\nFellow apes with a few wrinkles in your brain, may I continue? Yes? Good.\n\nI know I said I was going dark until after the GME earnings call on Tuesday unless something crazy happened. Well, nothing crazy happened. But I also told all of you that I had to drive down to Chattanooga and back to drop off my kids. Chattanooga being the biggest city that is about half way between Chicago and Orlando. That drive for me is about 9 hours down and 9 hours back. When you’re in the car for 18+ hours over two days, you gotta lot of time to think. So that’s what I did, I thought A LOT about the GME ‘problem’. I poked it, I prodded it, looked for holes in my logic, in the logic of others. I had several ‘light bulb’ moments where I saw things I missed. So this is why after driving 9+ hours today I am writing this post instead of resting. Hell, I couldn’t get home fast enough to share this new insight I have with you apes (I'll be posting this early Monday though in an attempt to get it the most visibility going into the day).\n\nSo, I’m going to take those light bulb ideas that came to me on that long drive and consolidate it with everything I’ve [written](https://www.reddit.com/user/CM_MOJO/posts/) regarding the mythical long whale since Friday, 2021-03-12. Hopefully it will also clarify some things.\n\nBut before I do, I want to clear some things up. What I am doing with my posts, is not due diligence (DD). I am taking all the wonderful DD that I find on this subreddit (and sometimes WSB) and trying to make sense of it. I know it may sound corny but I’m trying to see if the ‘data’ is telling me a story. I am then trying to tell that story. So please, please, don’t refer to my posts as DD. DD requires research and I am bad at research and I hate doing it. I usually end up getting distracted and then looking at videos of kittens. So, to all the people on this site that are doing the heavy lifting on the DD, my hat is tipped to you. Your efforts are invaluable to me and all the other apes.\n\nAlso, before I start (jeez, get on with it already), I want to define one concept because it’s important. I want to briefly discuss zero days to expire (0DTE) options contracts. All options contracts expire on Fridays. The ones expiring on the current Friday trading day are the 0DTE contracts. The brokerages that the RIs use can determine whether or not to allow the trading these 0DTE contracts. In fact, I use two brokerages, JP Morgan Chase and e\\*Trade. Chase will not let me trade these under any circumstance. e\\*Trade let me purchase one last Friday. For the big boys, the DTCC (or one of their subsidiaries) determines if 0DTE contracts are allowed to be traded. These things are highly risky which is why some retail brokerages don’t’ allow it. For the big boys to be allowed to trade them, the previous day’s volatility in the stock needs to be low. The thought being the lower the volatility from the day before will carry into the Friday and low volatility makes these 0DTE contracts appear less risky. If these 0DTE options are out of the money, they are very cheap to buy because if the price stays flat, they’ll be worthless by the end of the day.  The contract I bought on Friday that I mentioned above was expiring that day at a strike price of $210. I bought the contract early in the day when GME was trading around the $190 mark. The contract price was $1.50 and it cost me $150.66 ($1.50 \\* 100 plus the brokerage fee 0f $0.66). That contract was ‘only’ $20 dollars OTM and I got to control 100 shares for 150 bucks. That’s insane. And we all know moving the price of GME 20 bucks is NOTHING. Got it? Good, now let’s get started.\n\nSo, my first ‘A-HA’ moment was when I realized that I was looking at the ‘problem’ all wrong.\n\nBack when I was in college studying aerospace engineering, we’d get assigned homework by our professors (which is what they do). I’d work the problems the best I could, solve some, but couldn’t quite figure out the others. Sometimes, you’d just get stuck. Most engineering textbooks (at least for my experience) had some of the answers in the back of the book, usually the odd numbered questions. So, if you got stuck, hopefully the answer was in the back of the book. If it was, you’d look it up and then you could work the problem BACKWARDS. I figured this out on the way down to Chattanooga. Which led me to start working the problem backwards.\n\nBut before I get on with it, we have to take another slight detour to discuss [serendipity](https://en.wikipedia.org/wiki/Serendipity). If you read my previous [post](https://www.reddit.com/r/GME/comments/m7fx5z/serendipity/) on that topic, you’ll find I don’t place much credence in it but I do notice it when it happens. OH BOY, did it ever slap me right across the face on the way back up from Chattanooga (I love typing Chattanooga, such a cool word).\n\nI was on I-95 heading north through Kentucky just south of Elizabethtown which itself is about 45 minutes south of Louisville. I needed gas so I got off the interstate and filled up. The radio station I had been listening to was starting to get indecipherable so I started looking for a new one. I felt in a learning mood, so I went looking for a local public radio station. Those normally hang out in the lower portion of the FM dial so that’s where I went. I found one, my radio told me the name of the program was [*Hidden Brain*](https://www.npr.org/series/423302056/hidden-brain).  Perfect, right up my alley.\n\nThe program was already about 14 and half minutes into the [show](https://hiddenbrain.org/podcast/the-story-of-stories/) (I encourage you to listen to this, it was very good). Anyway, the guest was [Tania Lombrozo](https://psych.princeton.edu/person/tania-lombrozo), a Professor of Psychology at Princeton. She was talking about how here father would travel to Japan and bring back toys for her and her brother. They could keep them on one condition; they had to figure out how they worked. The writing on the toys was in Japanese as well as the instructions. And then she says this at the 16:17 mark \\[emphasis mine\\]:\n\n>And that sort of process of **reverse engineering**, of looking at something’s behavior, what it looks like, how it behaves. And then trying to **think backwards** to what it’s function must be, such that, you can understand why it has those properties. That’s very much what a psychologist does. Looking at human behavior, and then trying to figure out why the mind works the way it does.\n\nOh, my gawd. Here was that old friend serendipity hitting me over the head with a baseball bat. This is the exact thing I was doing with the GME problem. The theme of the show was about the stories we tell to try and understand. Hell, the name of the episode is “The Story of Stories.” I’d been trying to tell everyone all week that my work wasn’t DD, that I was taking all the DD I could find, and then looking for the story. Bam, serendipity hits me over the head again. If you listen to the entire show, you’ll gain valuable insight into my thought process, because they describe it to a 'T' what it is I am doing.\n\nOk, so what’s the GME story? Well let’s reverse engineer the shit out of this ‘problem’ and see what we get.\n\nWhat’s the problem? We know the long whales are out there lurking (hopefully the doubters have left). What’s their goal? As I’ve mentioned many times in my posts and comments, they’re every bit as much greedy little piggies as the shorting hedge funds (SHFs). What do greedy little piggies like? MONEY!!! Lots of it. It’s why we’re in the current situation, greed. But they just don’t want money, they want as much money as they can possibly get.\n\nSo that’s their end goal, they want as much money as they can get. Now we know the ‘answer’, let’s work backwards from there.\n\nHow do they get the most money possible? Well clearly, BlackRock has 9.2 million shares. When this thing explodes, they’re going to make BILLIONS, possibly hundreds of billions. But that’s not enough for a greedy little piggy.  Greedy little piggies ALWAYS want MORE!\n\nSo, how do they make more?\n\nOptions.\n\nOptions are very risky. You can lose your entire ‘bet’. But the upside is HUGE because the options use leverage. Just look at DFV’s last YOLO post from March 8th.\n\n&#x200B;\n\n[DFV's March 8th YOLO Update](https://preview.redd.it/0m1qhx9hoko61.png?width=2886&format=png&auto=webp&s=577543d2e797aa04a71bbbcef403a74d7df74e40)\n\nDo you see that crazy return on his options contracts? 88,183% Yes, he’s ‘made’ more money on his actual stock that's because he's only holding 500 contracts (50,000 shares controlled which is exactly half his long position).  But his return on the options is ORDERS of magnitude greater. You can bet the LWs will buy WAY more than 500 options contracts.\n\nSo, let’s keep working backward. How do the LWs make the best return on options? By buying all the 0DTE call options for next to nothing on a Friday.\n\nHow do they do that? By making sure GME has low volatility the day before.\n\nHow do they make sure GME has low volatility the Thursday before? By spending weeks setting this strategy up and bleeding the SHFs as dry as they could.  Throw in the SSR being tripped early Thursday and the LWs should be able to get GME to close exactly where they need it to enable them to buy 0DTE call options the next day. Hell, even if the SHFs still have a few rounds left in their clip and are able to crash the price, they LWs will just counter and get the price to close just where they need it.  We saw them do this all last week.\n\nSo, there it is game, set, match.\n\nCheckmate.\n\nBut I’ve got more.\n\nMy second “Take On Me” moment (that’s a little meta, hopefully you get it) was when I realized, maybe it was the LWs who caused the ‘flash crash’ on Wednesday, March 10th. Maybe they caused it because they felt they weren’t ready. We don’t have anyway to know for sure who caused it, but I think it’s plausible and worth pondering. Maybe they looked at that options chain and said, “We cause everybody but ourselves the most pain by finishing last Friday below $300 and finishing on the quad witching day at just above $200.”\n\nBUT WAIT, THERE’S MORE. My third light bulb going off moment.\n\nThe LW’s strategy I just laid out above is also the LEAST risky for them to pull off. Imagine a scenario where they have all the conditions I’ve laid out above going into a Friday. Around mid-day, the LWs start buying up every 0DTE call option they can get their hands on. Once that’s done, they start placing HUGE buy orders for GME. Remember just one of the LWs, BlackRock, has $8.67 TRILLION AUM. You don’t think they alone could move the price of GME?\n\nNow imagine, for whatever reason, they cannot get enough upward price pressure to initiate the gamma squeeze.\n\nWhat did it cost them? Next to nothing. Those 0DTE contracts were next to worthless when they bought them; they’re selling for literal pennies. What are they out? Maybe a million bucks. What’s a million bucks to these guys? Oh, and they just increased their long position within GME by a lot, further decreasing available shares in the pool and giving them a better long position.\n\nThey reload and wait for a future Friday, maybe not the next one, but a future one.\n\nThis thing is going to happen. It may take time, but it’s going to happen. It’s in-ev-i-ta-ble.\n\n&#x200B;\n\n&#x200B;\n\nSo, I believe that this is what the LWs are trying to do. It’s logical to me. Please read all this over and try and find flaws in my logic.  I’ve battled this one out in my head for almost 18 hours this weekend. I have so many new wrinkles in my brain.\n\nI've taken all my previous posts on this matter, read additional DD, and thought on this a lot.  I still stand by all-my previous posts.  I got a few of the things wrong.  That's ok.  I'll be the first to admit it.  I got a few things 'right'?  But was I right?  I'll get back to this.  When scientists propose a theory, they state their hypothesis then go about creating experiments, and gathering data.  They may then get results that may not fit exactly to their initial hypothesis.  They think about it, refine their methodologies/experiments, and gather more data.  This is how it's done.  When presented with new data, see if it's valid, then include it and refine your approach.  I've been judging the Chicago Public Schools' citywide science fair for the last 10+ years.  This is what I try to teach our future scientists.\n\nI’ve mentioned in a previous post that the current state of GME is a powder keg. I want to revise that statement. The current state of GME is a powder keg with its fuse lit in the middle of a burning gas station. And there’s a semi-tanker truck full of liquid hydrogen barreling toward the keg. And its brakes are out.\n\nAny thing at this point could set this thing off. Any number of catalysts could trigger the squeeze. The DTCC cracking down, GameStop recalling their shares, the earnings report, GameStop naming Cohen CEO, Jim Cramer’s head exploding on live TV, etc.\n\nSo, why focus on the long whales? Because I truly believe that they are the one’s currently in the driver’s seat. Everything the SHFs have tried the LWs have been able to counter. It’s been a master class in fencing. And they’ve clearly been the ones manipulating the stock price to close exactly where they want it.\n\nThis isn’t to say that they can pull it off. Any one of those triggers I’ve mentioned could be enough. But I think this is their play. This is how they make themselves the most money.\n\nAnd you’d best believe the LWs are going to make money after the squeeze when the price goes back down to something resembling GME’s true value. I just don’t care what that strategy is because at that point I’m going to swimming through all my gold coins in my bank vault like Scrooge McDuck.\n\nNow let’s imagine everything plays out exactly how I described it above.\n\nWas I right in my ‘prediction’?\n\nI don’t know.\n\nAnd that’s the problem with our markets. Transparency, or lack thereof. We won’t know who’s buying what, who’s selling what. It’s bull crap. The big boys don’t want us to know what’s going on. It benefits them. I have a lot of thoughts on this topic that I hope to share at a later date. It’s way too much to put in here.\n\n&#x200B;\n\n**EDIT:** I forgot to add this in here so I'm putting it in after the fact.\n\nI expect the price to fluctuate around $200 Monday and Tuesday.  The LWs really have no incentive to drive the price up before the earnings call.  Then if the earnings call is good, even more so if it's exceptional, they can then use the earnings call as 'cover' to start driving up the price afterwards.\n\n&#x200B;\n\n&#x200B;\n\nTL;DR\n\nHODL, for the love of god, HODL (not financial advice, I personally really, really like the stonk).\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n# Personal Notes:\n\nMy kids made it safely to Orlando and I made it back safely as well.\n\nA lot of you apes wished me safe travels this weekend and it truly touched me. I really love this ‘community’ and I think when we get those tendies, that love will be AMPLIFIED out into the world. I can feel it.\n\nI did have two somewhat scary incidents on my way back up.\n\nThe first was when I was approaching a semi-truck and it was just kicking up all sorts of gravel and rubber. As I passed him on the left, I could see a huge piece of tire wedged underneath the back of the trailer dragging on the road. This was a situation where this truck driver was in danger and unaware and he was putting other drivers in danger as well. I safely pulled in front of him, put on my hazards, and began slowing down in front of him. I also put down my window and began pointing to the shoulder of the road. After about 45 seconds, he realized what I was trying to do and pulled off to the side. I pulled off in front of him. I went up to his cab and told him about the dragging rubber. When we both got around to the passenger’s side of the rig, we could see that he’d blown both rear tires on the trailer and was riding them on the rim, just tearing up the road. I couldn’t see this when I passed him due to the mud flaps and the tires being on the opposite side from where I was passing. Kind of scary for the guy. He was extremely grateful and wished me well and I was on my way (not much I could do for him).\n\nThe second was when a guy just had to get in front of me to pass. I was about to overtake a vehicle on the left and this bozo slid in between the two of us in the ever-decreasing gap. He almost clipped my front bumper. I gave him a good dose of the horn and just shook my head and then let it go. My oldest son asked me to stop yelling at idiot drivers. I heard you Miles, and I’m trying.\n\nA lot of you have asked if I’m on other social media. I absolutely hate Facebook and will never join that cesspool.  I'm on LinkedIn but that's more for my professional career.  I've linked to that already so I won't do so again.  Most social media is lost on me.  So I don't have a presence on many of the other platforms.\n\nI do have a Twitter ([clmoffatt](https://twitter.com/clmoffatt)) and a website/blog ([clmoffatt.com](https://clmoffatt.com)).\n\nI do enjoy writing, especially for you apes. During the long drive, I came up with a bunch of various topics that I’d like to write about in the future. I’ll continue to post GME related thoughts on this subreddit. But things unrelated to GME, I’ll post over there and send out a tweet when something new gets posted on my site.\n\nSome topics rattling around in my brain: the current sad state of Major League Baseball, sunflower seeds (yes, I said sunflower seeds), Michael Phelps (huh?), the stock market (obviously), health care, weight loss from an engineer’s perspective, walking on water, and a few more that are slipping my mind (it’s been a long weekend). I also may share at any point stories from my past (oh boy do I have many), thoughts on social issues, politics, or thoughts on a current event or topic. It could be about just anything. I just find this world so fascinating that almost anything is on the table.\n\nThe website needs a face lift but I just don’t have the time currently to tackle it. I’m still fighting for that paper like all of you.\n\nStay hungry for those tendies my friends.",
    "title": "The Mythical Long Whale?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mamgty/the_mythical_long_whale/"
}