{
    "author": "weeknddev",
    "created_utc": 1617217506.0,
    "distinguished": null,
    "edited": 1617222017.0,
    "id": "mhd7ba",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion 🦍",
    "name": "t3_mhd7ba",
    "num_comments": 272,
    "permalink": "/r/GME/comments/mhd7ba/blackrock_and_a_trillion_dollar_honeypot/",
    "score": 2405,
    "selftext": "Edit: this is blowing up a little, I'd like to reiterate this is not in any way presented as facts. I am actively seeking to know more. Conjecture on finding out motivations is exciting. In no way is this advice.\n\nPiecing together information from the last two weeks I have a hypothesis that BlackRock has setup Ken and the short hedges to take a fall to cover up massive amounts of US debt via a shorted treasury bond fiasco.\n\nLooking at the \"everything short\" we are smelling doomsday for the US economy if Citadel has really sold billions of dollars short US treasury bonds. I wont repeat that DD it's beautiful, go read it.\n\nMy hypothesis is maybe even more dramatic and quite possibly wrong.\n\nWhat if the Fed and Blackrock (and others of old, ancient money) caught on to Kenny G's racket of shorting bonds. What if Blackrock got smoked out a few billion dollars on some key deals (TSLA) and what if the powers of the market decided to make Ken pay for the trespassing on the world's biggest wealth?\n\nI hypothesis that BlackRock with the help of the FICC insider set up a honeypot of shorting activity, aimed to target naked shorts out of the financial system and have come up with a plan to liquidate assets for the richest to come out of this unscathed (mostly). \n\nSince BlackRock was tapped to buy unbelievable amounts of treasury bonds in the last year and their was a huge amount of money being spent by the government. Maybe they thought they could hit two birds with one stone. Destroy the leaching shorts, and recover billions back into the economy by bleeding the shorts dry.\n\nWho wins? Blackrock. The Fed. The people (maybe). This all depends how they plan to deal with the 30 billion dollars of US treasury bonds citadel borrowed from Blackrock to leverage in the stock market.\n\nThe Fed is RRP 100b of Treasury Bonds as of today effectively taking 100b dollars back, helping keep inflation down.\n\nIf the theory about liquidating folks like Mr. Hwang is true, they are liquidating those billions to give back to the Fed. The Fed just wants to keep inflation down so the economy keeps working and the USD remains strong worldwide.\n\nIf the above is true, then they are actively targeting the riskiest investment tools they can with infinite risk. This is brilliant because those are the positions that they cannot get out of, there will be no bailout. \n\nCombined with the updating of rules such as 403 and 801 this basically gives the DTCC (the FICCs cousin) the right to liquidate every short position and claim all those tendies.\n\nWhat I can't figure out is: how do they plan to stabilize this? (Am I totally wrong?) And who the fuck is watching the FICC and this ridiculous lending habit?\n\nAny actual wrinkle-apes wanna chime in?\n\nAt any rate that would make GME just as lucky vehicle all us apes got to jump on while this shitshow unwinds.",
    "title": "Blackrock and a trillion dollar honeypot",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhd7ba/blackrock_and_a_trillion_dollar_honeypot/"
}