{
    "author": "sofessenceee",
    "created_utc": 1617243239.0,
    "distinguished": null,
    "edited": 1617254902.0,
    "id": "mhlduj",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mhlduj",
    "num_comments": 133,
    "permalink": "/r/GME/comments/mhlduj/if_you_are_new_do_not_use_robinhood_and_do_not/",
    "score": 1484,
    "selftext": "🚀🚀🚀🚀🚀🚀🚀🌚🌚🌚\n\nThere are a lot of newcomers and I want to reiterate this, and this may have to be said every now and then as this subreddit expands. Senior apes, I know you already know this. When I first joined, I foolishly made this similar mistake. GameStop is getting a more positive public outlook. Newcomers are expected. \n\nMy sibling just joined abroad the rocket to tendie land and wasn’t aware that by trading on margin and/or by using a brokerage such as robinhood, you are giving short sellers more ammo. Specific brokerages lend out your shares to short sellers such as hedge funds (Citadel for example).\n\nIt is important to check if your trading account is a margin account. If it is, then you don't really own the shares that you bought and they can be lent out to the HFs to short the stock with. So it's better to switch your account to a cash account, this way you will own the shares and they can't be borrowed out.\n\nI know robinhood has a friendly UI and that is literally the only benefit. Do not fall into the trap of free shares. Wouldn’t you rather go to a brokerage that actually lets you own your shares? Many users went over to Fidelity where you can actually own your shares. \n\nTLDR: trading on margin or using RH helps hedge funds and gives them more ammo. Fidelity is one of the better brokerages to invest with. \n\n* not financial advice \n\nEdit: be nice to each other and welcome aboard anyone new. ❤️🦍 \n\nEdit edit: thank you for my first award ❤️\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "IF YOU ARE NEW, DO NOT USE ROBINHOOD AND DO NOT TRADE MARGIN",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhlduj/if_you_are_new_do_not_use_robinhood_and_do_not/"
}