{
    "author": "pinkcatsonacid",
    "created_utc": 1617229291.0,
    "distinguished": null,
    "edited": 1624847776.0,
    "id": "mhh9kn",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_mhh9kn",
    "num_comments": 240,
    "permalink": "/r/GME/comments/mhh9kn/reading_the_everything_short_dd_and_michael/",
    "score": 2874,
    "selftext": "Update: Burry's Twitter now links to [this.](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm) ... he knows we are looking 👀 *it directly refers to the rehypothecization and treasury securities discussed in Everything Short DD*\n\nEveryone in this sub talks about the movie the Big Short every single day. I see it quoted constantly. Well did you know that the guy that movie is based on, Dr. Burry, [has been screaming at us for a while](https://markets.businessinsider.com/news/stocks/big-short-michael-burry-warns-stock-market-huge-risk-crashing-2021-2-1030106969) about an impending crash, and it came to a head in the last few days? He called it once in 2008, and now he's been silenced on Twitter again by the SEC. The only way he can speak to us now is [cryptically](https://www.reddit.com/r/GME/comments/mh3sar/michael_burrys_new_twitter_profile_and_background/?utm_medium=android_app&utm_source=share), just like DFV. \n\nTo a person with @uti$m, words mean something. Every word does. Every symbol.... every unwritten, suggestive wink or nudge. We're really good at giving clues and seeing deeper meaning (I say we because I have a$perg's). We notice patterns and algorithms that normal people don't. And cryptic language is often our bread and butter. Yes, DFV, MJBurry, even Papa Cohen are communicating with apes the only way they can... through cryptic means. And their messages are important. Remember... every word means something to an @uti$t.\n\nIf you read the Everything Short DD and you're freaked out, it's ok. If you think u/atobitt is a shill or sent to induce FUD, I believe you're wrong. And here's why. \n\nEverything in the DD echoes what our boy Dr. Burry has been saying since at least [Sept 2019.](https://www.cnbc.com/2019/09/04/the-big-shorts-michael-burry-says-he-has-found-the-next-market-bubble.html) One confirms the other. What more [confirmation](https://www.reddit.com/r/GME/comments/mh7a8k/im_just_gonna_leave_this_right_here/?utm_medium=android_app&utm_source=share) do you need? \n\nAlso look at what DJI and NASDAQ have been up to in AH. I believe we are approaching the launchpad ladies and apes 🚀🚀🚀🚀🚀🚀\n\nDisclaimer: I'm fucking hella blazed 24/7 and I wrote this while I was still choking on dabs and crayons. I'm just purging words into the ethos of GME. Love you crazy apes 💖\n\n2nd disclaimer: I'm actually a person with @$pergers, and not using the term @uti$m in a derogatory way. Automod trippin.\n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nDr. Burry, if you're reading this don't worry. CFH are HODLing;\n\n\nUnder the lights where we stand tall\n\nNobody touches us at all\n\nShowdown, shootout, spread fear within, without\n\nWe're gonna take what's ours to have\n\nSpread the word throughout the land\n\nThey say bad guys wear black\n\nWe're tagged and can't turn back\n\n\nYou see us comin'\n\nAnd you all together run for cover\n\nWe're taking over this town\n\n\nHere we come reach for your g*n\n\nAnd you better listen well, my friend, you see\n\nIt's been slowed down below\n\nAimed at you, we're the cowboys from hell\n\nDeed is done again, we've won\n\nAin't talking no tall tales friend\n\n'Cause high noon, your doom\n\nComin' for you we're the cowboys from hell",
    "title": "Reading the Everything Short DD and Michael Burry's final tweets connect the final dots- Sirens are screaming in the distance... and no one is listening besides us. It ain't what you don't know that gets you in trouble, it's what you know for sure that just ain't so... My opinion as an actual a*tist",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mhh9kn/reading_the_everything_short_dd_and_michael/"
}