{
    "author": "Alternative_Band_880",
    "created_utc": 1617192371.0,
    "distinguished": null,
    "edited": 1617282321.0,
    "id": "mh4nx7",
    "text_only": true,
    "flair_id": "d6dd598c-6e3c-11eb-bf7d-0eebd6918099",
    "flair_text": "Discussion 🦍",
    "name": "t3_mh4nx7",
    "num_comments": 478,
    "permalink": "/r/GME/comments/mh4nx7/when_the_storm_is_clear_and_the_squeeze_has/",
    "score": 7893,
    "selftext": "Every time I wake up, r/GME is the first place I go. I get a good feeling every time I come into Reddit and honestly don’t know what I’d do without it...\n\nThis ape community has seriously formed and is now a serious group and a serious community and I feel like I am part of something special and very very good.\n\nSo when the squeeze squeezes.(which it will, we just don’t know when) I want all of you to come back and stay here to spread awareness about how we shared our money and helped our families and people in need. I want to hear your business ideas, philanthropist activities and good things we are doing for our friends and families.\n\nEdit: This is my first proper post, so Thankyou for all the upvotes and support. Hedgefunds if you are reading this, yes were ARE NEVER LEAVING, so yeh you have definitely made the wrong decision about GameStop as this company will never EVER go bankrupt. We all fail, we ALL do. So take your loss and accept your bet didn’t go well. Cover your positions now before it is too late because we aren’t going anywhere... even after the squeeze💎🙌 🦍\n\nEdit #2: Wow 3.4K upvotes 😳... this is legit my first post and so happy it’s done this well. Remember, keep HODLING and BUY if you can afford it 🦍\n\nEdit #3: Wow. For my first post I’d say 7.9k upvotes is decent 🦍. Thankyou for all the rewards you have given me and keep HODLING🚀",
    "title": "WHEN THE STORM IS CLEAR AND THE SQUEEZE HAS SQUOZE.... I WILL NOT BE LEAVING THIS GROUP!!",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/mh4nx7/when_the_storm_is_clear_and_the_squeeze_has/"
}