{
    "author": "Tx3hc78",
    "created_utc": 1621876464.0,
    "distinguished": null,
    "edited": false,
    "id": "nk30qk",
    "text_only": true,
    "flair_text": "🔬 DD 📊",
    "name": "t3_nk30qk",
    "num_comments": 148,
    "permalink": "/r/GME/comments/nk30qk/a_comprehensive_guide_to_selling_during_moass_for/",
    "score": 510,
    "selftext": "# Introduction\n\nHello everyone,\n\n&#x200B;\n\nI have been recently replying to a lot of questions regarding the notorious **Take profit**, **Stop Loss**, MOASS 'exit strategy', Market orders, Limit orders, etc. (on r/Etoro)\n\n&#x200B;\n\nI will do my best to explain everything to you to clear all misconceptions and prepare you for the MOASS.\n\n&#x200B;\n\n\\*\\*\\*\\*I'm not a financial advisor and this is not a financial advice.\\*\\*\\*\\*\n\n&#x200B;\n\n# Understanding the terms\n\n&#x200B;\n\n**Bid** and **Ask**\n\n>The [bid price](https://www.investopedia.com/terms/b/bidprice.asp) represents the maximum price that a buyer is willing to pay for a share of stock or other security. The [ask price](https://www.investopedia.com/terms/a/ask.asp) represents the minimum price that a [seller](https://www.investopedia.com/terms/s/seller.asp) is willing to take for that same security.\n\n[Source](https://www.investopedia.com/terms/b/bid-and-ask.asp)\n\n**Position**\n\n>A position is the amount of a security, asset, or property that is owned (or [sold short](https://www.investopedia.com/terms/s/shortsale.asp)) by some individual or other entity. A trader or investor takes a position when they make a purchase through a buy order, signaling [bullish](https://www.investopedia.com/terms/b/bull.asp) intent; or if they sell short securities with bearish intent.\n\n[Source](https://www.investopedia.com/terms/p/position.asp)\n\n**Market order**\n\n>A market order is an instruction by an investor to a [broker](https://www.investopedia.com/terms/b/broker.asp) to buy or sell stock shares, bonds, or other assets at the best available price in the current financial market.\n\n[Source](https://www.investopedia.com/terms/m/marketorder.asp)\n\n**Limit order**\n\n>A limit order is a type of [order](https://www.investopedia.com/investing/basics-trading-stock-know-your-orders/) to purchase or sell a security at a specified price or better. For buy limit orders, the order will be executed only at the limit price or a lower one, while for sell limit orders, the order will be executed only at the limit price or a higher one. This stipulation allows traders to better control the prices they trade.\n\n[Source](https://www.investopedia.com/terms/l/limitorder.asp)\n\n**Stop order**\n\n>A stop order is an order to buy or sell a security when its price moves past a particular point, ensuring a higher probability of achieving a predetermined entry or exit price, limiting the investor's loss, or locking in a profit. Once the price crosses the predefined entry/exit point, the stop order becomes a market order.\n\n[Source](https://www.investopedia.com/terms/s/stoporder.asp)\n\n**Stop Loss**\n\n>It is an instruction to close a trade at a specific rate, if the price is going against you, to prevent additional losses. If the market reaches your requested rate and you have lost the predetermined amount, the Stop Loss will trigger and automatically close your position.\n\n[Source](https://www.etoro.com/customer-service/help/499047/what-is-stop-loss/)\n\n**Take Profit**\n\n>A Take Profit (TP) is an instruction to close a trade at a specific rate, if the price is going in your favor, to ensure the profit is realized and goes to your available balance. If the market reaches your requested rate and you have gained the predetermined amount, the Take Profit will trigger and automatically close your position.\n\n[Source](https://www.etoro.com/customer-service/help/551846/what-is-take-profit/)\n\n&#x200B;\n\n# Understanding terms as a smooth brain ape (Oversimplification)\n\n&#x200B;\n\n**Position** \\- Once you have made a purchase you have opened a **position**. When you click on your 'Portfolio' and then select 'GME' you will be able to see all of your \"positions\".\n\n&#x200B;\n\n**Market order** \\- Market order acts like you saying to your broker that you want to open/close your position NOW. Let's look at a stupid example in selling scenario:\n\nYou: *Can you sell this stocks for me NOW?*\n\nBroker: *Okay, give me a millisecond. I'll put you in 'queue' but just to be clear, the price could change in that millisecond. Is that okay?*\n\nYou: *Yep, just get sell it at a next available price* ***I don't care at which price***.\n\n&#x200B;\n\nThis is why market order is troublesome but I will elaborate more later why is it a huge problem for MOASS.\n\nQuick note: On eToro, when you just press '**X**' and click on 'Close trade' you are closing your position with a market order.\n\n&#x200B;\n\n**Limit order** \\- Limit order acts like you saying to your broker that you want to open/close your position when share reaches certain price. On eToro you can set at which **rate** to buy/sell the stock which basically means when price reaches that point you will buy/sell.\n\nExample of selling scenario:\n\nYou: *Can you sell the stock when the price hits $150? (for profit)*\n\nBroker: *Yes of course, I can also vouch to* ***close your position*** *(sell) when price reaches $150 for $150 per share* ***or more***.\n\nYou: *Wow man, you are the best!*\n\n&#x200B;\n\nThis makes Limit order the best way to buy/sell since it ensures you are getting what you want or better.\n\n&#x200B;\n\n**Stop order** \\- Stop order will trigger at a certain rate to prevent losses. This will ensure that you don't lose too much if price of stock goes down. **STOP ORDER IS ESSENTIALLY AS A MARKET ORDER!**\n\n&#x200B;\n\n**Stop Loss** \\- On eToro Stop Loss (**SL**) is a Stop order. You can only set Stop Loss for **lower** price then current stock price. Minimum SL while in profit appears to be **\\~0.8** of the current stock price but I didn't find any official documentation regarding the minimum SL.\n\nWhat does this mean?\n\n**Example scenario**: You have bought 1 GME stock for $150. Current price of stock is $200. Minimum SL that you can set is at rate of 160 or amount of +10$. This means that the broker will put a market order in once price hits $160 or goes below, closing your position and you should still be in profit.\n\nUnfortunately, SL is market order which is tricky for MOASS, I will explain why later.\n\n**Note**: I won't talk about **Trailing Stop Loss** since it is not useful for MOASS imo and you shouldn't use it.\n\n&#x200B;\n\n**Take Profit** \\- On eToro Take Profit (**TP**) acts as a **Limit order**. On other brokers this order is also called Sell Limit. You can only set Take Profit for **higher** price then current stock price. Maximum TP you can set is 1000% of the current stock price which is higher then on most brokers.\n\nWhat does this mean?\n\n**Example**: You have 1 GME stock and current price is $200. Maximum TP you can set is at rate of $2000. This means that you will sell your stock once the price reaches $2000 with a **limit order**.\n\n&#x200B;\n\n# Why is market order bad? (To my understanding and oversimplified as everything else)\n\n&#x200B;\n\nWhen you use a market order you are going to the *market* and you are looking for the first best ask/bid price available.\n\nNow that you know what ask/bid price are I will explain why during MOASS selling with market order could be fatal.\n\nLet's first take a picture that dlauer posted and I stole because I'm lazy.\n\nhttps://preview.redd.it/pjk6uvx2j3171.png?width=319&format=png&auto=webp&s=529489a7921bba60d0e05923751a0942add126a5\n\nAbove you can see how orders are being filled. Under *Bid*  you can see how much buyer is offering per share and under *Shares* you can see how much stocks are available at that price. Meaning, if you wanted to buy 1000 stocks at that exact moment with a market order, you would need to pay 164.21 for 736 of them and then 164.17 for next 23 shares and so on. (at that moment at least)\n\n&#x200B;\n\nLet's see how those offers could look during MOASS:\n\n&#x200B;\n\n[Pardon the crayons, last price is 200$ and the rest are in millions.](https://preview.redd.it/l5u9gpa5l3171.png?width=159&format=png&auto=webp&s=8e280177fb22d0fd1f0f80c5452ec78fdc2f5685)\n\nSo MOASS has started, liquidity is at zero, no one is selling, buying is temporary restricted and there are only apes vs HFs.\n\nPrice is rising as HFs are putting bigger and bigger bids. Keep in mind that highest Bid always goes first and that is the price that you will see for *Buying*. But our opponent is tricky and it want's to fuck us.\n\nYou see that they are bidding $10M for a stock and you think yourself oh well, now is my time to shine. You fill a market order (Like an true idiot that you are) but there are thousands of idiots like you as well and guess what, you are not the fastest idiot.\n\nSo thousands of idiots fill a market order at this point (including you) when they see $10M price. For case of simplicity let's say everybody has only 1 share. So what happens?\n\nFirst 2,297 get $10M per stock. Next 2,300 get 200$ per stock and those that sell after those 2,3k are getting even less.\n\nAnd yeah, you were in one of those who got fucked cuz your phone is lagging or your internet connection is slow or something.\n\n&#x200B;\n\nThis is a basic idea and it truly is oversimplified but should help you understand why market order is bad for you folks.\n\n&#x200B;\n\nHow to avoid this you ask? **USE SELL LIMIT aka TAKE PROFIT** (on eToro).\n\n&#x200B;\n\n# Enter Take Profit\n\n&#x200B;\n\nOkay, so you learned what TP is and how it works basically but you have one simple question that is clouding your vision:\n\n>If TP can be only **higher** then the current stock price, how can I use it when the price is going down?\n\nOof, this is a though one.\n\nSo again, let's create an example so it is easier to understand.\n\nCurrent price is 100M and your floor is 20M. You can't set TP since 20M is lower then current stock price and you don't want to use SL since it is a market order and you could get fucked.\n\nNow you will have to wait for price to go down since you are only able to set TP for higher price then the current stock price. Price keeps going down and it falls below 20M. Now you are able to set TP but the price keeps falling and you see it drop lower and lower, further and further from your floor and you fall in the huge cloud of FUD.\n\nPrice is at 10M for the last few hours and you can't take it anymore and you want to just close the position with a market order....\n\n...At that moment you feel that little wrinkle you got after reading this post and you remember that these fuckers have **naked short sell** the stock to oblivion and now they have to cover a LOT. More then float and more importantly **more that we are willing to sell.**\n\nAs you already know, a lot of apes won't sell all their stocks and will keep most of them since their diamond hands won't let go.\n\nTHIS means that you don't have to worry. THIS means that it is only a matter of TIME.\n\nYou are watching many apes selling for 10M and hours pass, market is closed and price is still 10M. But there is always tomorrow. You keep holding just a little bit more and you see the price starts rising again closing to your floor and BOOM you got $20M or more!\n\n**Also, you won't be alone I will be with you as well as other apes, waiting patiently.**\n\n&#x200B;\n\nIf we do this and don't sell before ceiling, we could very well see infinity squeeze.\n\n&#x200B;\n\n# Clearing misconceptions\n\n&#x200B;\n\nI know some of you were worried about the below bold text from [eToro's Help page](https://www.etoro.com/customer-service/help/551846/what-is-take-profit/) regarding TP:\n\n>Under normal market conditions, the set Take Profit is not guaranteed. **When the market is volatile, the Take Profit rate you requested may not be traded in the market.** In this case, the Take Profit will trigger at the next available rate. The result is that you could gain more than you expected on the trade.\n\nSome of you were asking does this means that during MOASS, TP won't work?\n\nTo me this little paragraph is self explanatory but I will dumb it down even more:  \nIf the market is volatile the rate (price) at which you wanted to TP could be *skipped* so you will TP for a higher price which is even better.\n\nUsually stock prices rise and fall for small amount. For example: 166.1,166.2,166.4, 166.3, 166.6... But in a volatile market the price could rise very quickly.\n\nPlease note that this is an oversimplification of the event.\n\nFor example let's say you have set TP to $980 and the current price is $150. MOASS starts and price is rising: 300, 350, 400... ...900, 950, 1000, CLICK! - Your TP is triggered and you close your position at $1000 with 20$ more then you were expecting. WHICH IS GOOD!\n\n&#x200B;\n\n================================================================\n\n&#x200B;\n\n[Official statement from eToro team.](https://preview.redd.it/jbsqpqkho3171.png?width=662&format=png&auto=webp&s=c2d2eb11b77f7ae7edff47d8b28c2c11759d5a00)\n\nPlease take a look at what these fucking retards are posting:\n\n[Raw example of clueless ape reposting things he doesn't understand because of fear.](https://preview.redd.it/jmte7lzso3171.png?width=661&format=png&auto=webp&s=5f334a74eb2b26c99eada33f3ba419fdfcb4c8b0)\n\n&#x200B;\n\nBut don't you worry, I'm here to calm your concerns.\n\nThis does not mean that eToro will close your position on GME during the MOASS or any other time for that matter. During the MOASS due to the liquidity problems, since no one wants to sell, eToro and all other brokers will have to restrict BUYING the stock. Other *trading restrictions* include short selling and options. (No, options are not available on eToro. I was talking in general)\n\n&#x200B;\n\n# What is my exit strategy?\n\nMy floor is $20M. If we enter June, I might raise it.\n\nI will have an separate browser windows open for all of my positions to quickly set TP on all of them while recording everything. (mostly because this is once in a time opportunity and I want to record it. Not to worried about legality)\n\nOnce we pass the ceiling and price plummets below my floor, I will set TP on all of them and then get hydrated and calm my self, maybe take a little walk and wait until price comes back to me.\n\n&#x200B;\n\n# FAQ\n\n&#x200B;\n\n**Q**: What should I use during MOASS to sell my shares?  \n**A**: Take Profit.\n\n**Q**: Should I set TP now?  \n**A**: **NO**. If you set it now, you maximum TP would be around $1800 and you won't get rich. Also, you will slow down the rocket to the moon.\n\n**Q**: Is TP a limit order?  \n**A**: Yes.\n\n**Q**: Is TP same as Sell limit?  \n**A**: Yes\n\n**Q**: Should I use SL?  \n**A**: You can, but you **shouldn't** since it is a market order and I already explained how you could be fucked on this.\n\n**Q**: Can I set TP for all of my positions on $GME at once?  \n**A**: No. You will have to set TP on all of your positions individually. Prepare to multitask. I suggest using a computer instead of phone during MOASS.\n\n**Q**: Can I set TP for only few shares of my position and not all of them?  \n**A**: No, you cannot. You can only sell part of the trade with market order while clicking on 'X' to 'Close trade' which is not TP.\n\n**Q**: Is there a way to merge all positions into one?  \n**A**: No, at least that I know of.\n\n**Q**: What is Rate and what is Amount while setting SL or TP?  \n**A**: Rate presents the price at which you want to buy/sell. Amount is the *amount* of money in dollars that you want to take from that transaction.\n\n**Q**: Should I set by Rate or Amount on TP?  \n**A**: Rate is better. If you set Rate at 20M you will sell when stock price reaches 20M. If you set Amount to 20M you will sell so you get 20M profit which means you will sell when price reaches 20M + *Price of stock at which you have bought it*.\n\n**Q**: Is there a way to practice this?  \n**A**: Yes, on eToro you have a virtual portfolio in which you can practice setting TP without affecting your real portfolio.\n\n**Q**: What should I do now?  \n**A**: BUY, HOLD and VOTE. (We cannot vote on eToro YET. But they are working on it!)\n\n**Q**: Does your wife has a boyfriend?  \n**A**: Yes and he is very happy that we are about to get rich.",
    "title": "A Comprehensive guide to selling during MOASS for eToro apes",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GME/comments/nk30qk/a_comprehensive_guide_to_selling_during_moass_for/"
}