{
    "author": "Nomes2424",
    "created_utc": 1616970211.0,
    "distinguished": null,
    "edited": 1616973796.0,
    "id": "mfbim9",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mfbim9",
    "num_comments": 163,
    "permalink": "/r/GME/comments/mfbim9/ken_griffin_is_scared_already_coming_up_with/",
    "score": 2483,
    "selftext": "https://www.ft.com/content/6c613f92-cf35-4b2e-b2b0-2ac0a6afb1fb\n\n“On the whole, Griffin says he is optimistic on the outlook, and hailed the retail trading boom as a way for more Americans to benefit from the US stock market. But he warned of a “doomsday” scenario win which accelerating inflation deepens a bond market sell-off, sends stocks tumbling and stokes unrest among retail investors hurt in the process.”\n\n“The fund stepped in to bail out Melvin Capital, one of the biggest hedge funds betting against GameStop. **When Robinhood, a brokerage popular with the new generation of retail traders, was subsequently forced for regulatory reasons to curtail trading in GameStop, many Reddit users seized on a conspiracy theory that it was at Citadel’s behest.** Citadel Securities — a separate high-speed market-maker also owned by Griffin — is one of Robinhood’s biggest revenue sources, paying it for the right to execute the trades of its customers.”\n\n“Griffin highlighted how an oblique tweet of a McDonald’s ice cream cone and a frog emoji from Ryan Cohen, a big GameStop shareholder, appeared to be the spark for a doubling of the stock’s price in one afternoon in February.”\n\n“The fact that the tweet of an ice cream cone can move markets will be the subject of academic study for years,” Griffin said. **“It represents a dynamic where certain stocks are now almost exclusively owned by retail and passive funds.** You’ve taken out active investors who focus on traditional metrics in valuing an equity.”\n\nSounds like someone is scared. Only confirms the inevitable. \n\n💎🙌🦍\n\nEdit: I’m aware there is a paywall, I want to post the entire article, but due to copyright reasons, I cannot post the entire article. However, if you use google instead of the Reddit sub, you might be able to see the entire article.",
    "title": "Ken Griffin is scared. Already coming up with excuses. Please read this article.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/GME/comments/mfbim9/ken_griffin_is_scared_already_coming_up_with/"
}