{
    "author": "Glittering-Lead-9228",
    "created_utc": 1616943164.0,
    "distinguished": null,
    "edited": 1616958039.0,
    "id": "mf29mw",
    "text_only": true,
    "flair_text": "News",
    "name": "t3_mf29mw",
    "num_comments": 131,
    "permalink": "/r/GME/comments/mf29mw/proof_shills_are_wrong_archegos_is/",
    "score": 2750,
    "selftext": "EDIT: LOL, getting so many downvotes. Call me bias, but every downvote is a confirmation downvote. Was at 357 upvotes 30 secs ago, now only 352... .\n\nCorrected some typos also, you have my gratitude my dear shills for pointing out these. Either you are being paid by the shorts and grasp anything to attack somebody OR you are a paperhanded shill that want the brave apes to share in your misery of paperhanding it at 50 in February and being too scared to buy in again  😂.\n\nORIGINAL POST BELOW\n\nFeel this is GME related as this is PROOF that one major event that tightens the noose around the naked shorts is starting to have effect.  Archegos was just a minor playor being caught in the crossfire, probably overleveraged and having no way to resolve this easily now.\n\n&#x200B;\n\n[Google search ](https://preview.redd.it/nlrooksr9sp61.png?width=843&format=png&auto=webp&s=b6dd1c35a4fa55471d287be56a9365430426ef72)\n\n[Caption from TD Amritrade](https://preview.redd.it/fso54n5w9sp61.png?width=1104&format=png&auto=webp&s=404a6d3ddb1b40e846adea72d0c8024beb1b958b)\n\n[https://www.tdameritrade.com/td-ameritrade-trading-restrictions-stocks.page](https://www.tdameritrade.com/td-ameritrade-trading-restrictions-stocks.page)\n\nBUT THERE IS NO GME STONK LIQUIDATED\n\nThis is a effect from the end of the infinite money cheat they've been using and the changes implemented due to recent event. Now 100% minimum margin on GME stonks, seeying the volatility in GME am sure they want 200+% margin to be sure they don't get margin called like Archegos.  So yeah, there is your GME link.\n\nBut do you think any fund would liquidate huge amounts of stock knowing it will tank the price resulting in lower returns. Hell no, they would liquidate in small batches to ensure best price for their stock and maximum profit.\n\nOnly reason for a large sale like this is if the house sells your stock. They don't care about your profit or bottom line. They want their money, no matter your losses. With GME being put on the 100+% margin list and prohibited short list a lot of small players having sold these calls naked will be at risk of being margin called early on. This will eventually escalate to the larger players.\n\nDEFINITELLY ARCHEGOS\n\nFew posts stating it is not Archegos and maybe BlackrockVanguard.\n\nGuess what, google search finds loads of reports that Archegos is liquidating and NOT 1 report for Blackrock Vanguard. Wonder why they want us to believe it is BlackrockVanguard and why target Blackrock if there is not a single newsreport supporting this.... very SUS, could the DDs on Blackrock being the long whale have anything to do with it. Maybe, maybe not....but definitely SUS imo.\n\nCOULD THIS BE FUD NEWS?\n\nAnd yeah, we did not believe the news reporters before about GME so why now. BECAUSE NOW THEY ARE NAMING ARCHEGOS BY NAME linking it to the liquidation.\n\nDo you think any news site would knowingly name a company in relation to bad news if they were not 200% sure. Hell, if they are wrong they would get sued for everything they own. So yeah these reporters are right on the spot for this.\n\nMY FINAL PLAY, TIME IS IN OUR FAVOUR\n\nBesides a lot of fuckery, I expect that next week we will see a lot of other stocks go down as they will need to liquidate to cover their short positions. Will GME go up? Probably not as much as we want, because they just need sufficient capital to cover and they will prefer to do that and not buy GME stonk. Because that will trigger the MOASS.\n\nThe shit they are pulling just shows that time is running out for them. My previous post linking to Archegos DDs got downvoted as I looked at, got loads of comments stating its bs and its not Archegos or GME related within 30 minutes after posting. Even got 1 follower.. or a tail :)\n\nSo why do this, why care about a noob ape who is not saying anything at all? Something is fishy here and I am calling BULLSHIT. Shitload of smoke for it not to be bullshit.\n\nExpect a lot of shit to happen still, a lot of FUD, a lot of shills and loads of threats. But hold strong my apes and HODL on those stonks.\n\n&#x200B;",
    "title": "PROOF SHILLS ARE WRONG: ARCHEGOS IS LIQUIDATING/MARGIN CALLED",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/mf29mw/proof_shills_are_wrong_archegos_is/"
}