{
    "author": "HappyBus8759",
    "created_utc": 1620676454.0,
    "distinguished": null,
    "edited": 1621971140.0,
    "id": "n9eds5",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_n9eds5",
    "num_comments": 2920,
    "permalink": "/r/Superstonk/comments/n9eds5/raise_your_hand_if_youve_been_here_since_janfeb/",
    "score": 45430,
    "selftext": "Everyday for the last 4/5 months hundreds of thousands if not millions of people all over the globe have been buying and holding GME, yet the price either stagnates or goes down. In what other scenario is this even possible? \n\nA supposed finite asset has been bought up in its entirety, yet more and more of these assets magically appear for sale everyday, resulting in more sell pressure than buy pressure that makes the price go down. How the fuck are the SEC and all the other regulators able to sit there and watch these Mickey Mouse fake shares being dumped into the market? \n\nAs a Europoor, I am completely disgusted at what I’ve witnessed over the last few months and will never invest a single cent in the US markets once this is over. \nGary Gensler, what the fuck are you doing?? We know you’re only been in the job 3 weeks, the time for action is now! You know there is fuckery going on in GME, yet it seems you’ve done nothing so far. Enough is enough!\n\nTo my beloved apes and apettes, I don’t give a fuck about karma. Please raise your hand if you’ve been buying and holding since this all began. Let’s see how many of us have 110% conviction in seeing justice served.\n🙋‍♂️\n💎🙌🏻🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "title": "Raise your hand if you’ve been here since Jan/Feb and have continued to quietly buy more and hold through all of the fuckery we are witnessing everyday 🙋💎🙌🏻🚀🚀🚀🚀🚀",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/Superstonk/comments/n9eds5/raise_your_hand_if_youve_been_here_since_janfeb/"
}