{
    "author": "semerien",
    "created_utc": 1618316449.0,
    "distinguished": null,
    "edited": false,
    "id": "mq13t7",
    "text_only": true,
    "flair_id": "443477c2-9859-11eb-93e5-0e7222816149",
    "flair_text": "Possible DD 👨‍🔬",
    "name": "t3_mq13t7",
    "num_comments": 625,
    "permalink": "/r/Superstonk/comments/mq13t7/option_chains_going_crazy/",
    "score": 6325,
    "selftext": "  \n\nGood morning Apes\n\nExpect fuckery. This is a CRAZY week on the options side. The hedgies absolutely cannot lose control of the price this week, they will use every trick and cheat that exists this week.  \n\nI don’t think this is a week where anyone is worried about max pain. This is a week where hedgies just need the price as low as they can get it to avoid those call options going ITM. The delta hedging could start to form a terrifying gamma squeeze if these call options started getting ITM.\n\nThat dark pool buy / open market sell trick. Yeah, they are going to keep doing that.  They have too. They probably have dozens of tricks apes haven’t even noticed yet. They will all be in play this week.\n\nThe options market is where to watch the fight this week.  And it’s already growing.\n\nI made a post here [https://www.reddit.com/r/Superstonk/comments/mowgh9/faking\\_a\\_squeeze\\_would\\_backfire/](https://www.reddit.com/r/Superstonk/comments/mowgh9/faking_a_squeeze_would_backfire/) on Sunday, where I fortunately was tracking option numbers.\n\nWe already see some major changes in the numbers\n\nOn Sunday the numbers were\n\n200 5,197 calls\n\n250  4,232 calls\n\n300 4,986 calls\n\n350 2,379 calls\n\n400 4,858 calls\n\n500 6,645 calls\n\n600 5,273 calls\n\n800 33,300 calls\n\nThis morning the numbers are\n\n200 7,738 calls (+2500)\n\n250 6,335 calls (+2100)\n\n300 6,974 calls (+2000)\n\n350 3,044 calls (+600)\n\n400 5,944 calls (+1100)\n\n500 8,333 calls (+1700)\n\n600 5,265 calls (not much change)\n\n800 40,208 calls (+7000)\n\nThat’s an extra **17,000 call** contracts since Sunday on just those 8 strike prices. And if you look lower, starting at 150, there are at least 1,000 calls on every strike price up to 200, except 155 and 195. \n\nAnd remember when dealing with call contracts, each one represents 100 shares.  So that is 1.7 million shares that are represented in those extra 17,000 call contracts.  Those 8 strike prices currently represent almost 8.4 million shares that would need to be hedged by option sellers to remain delta neutral.\n\nSo expect the price to do some crazy shit this week. The hedgies will be trying to tank the price as much as possible.  If there truly are long whales in play (looking at the option chains it’s possible) they aren’t betting on a max pain week. Those options were placed to fly.\n\nNo one is looking at max pain this week. The option chain this week is INSANE. This is not a normal options week. Next weeks highest call count is 4,757 at 800 (sigh, come on guys). The next highest is 1,198 at 300 then 1,124 at 200.\n\nI’m not saying play in contracts (if you don’t know how they work intimately, it’s best to avoid), I’m not saying YAY gamma squeeze. I’m not expecting anything until someone makes the hedgies play by the rules.  I’m just saying that they are going to cheat like crazy this week, because they are looking at a terrifying option chain that could pre-launch this thing into margin call territory.\n\nNone of this is financial advice, just an ape who likes looking at numbers.",
    "title": "Option Chains Going Crazy",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/mq13t7/option_chains_going_crazy/"
}