{
    "author": "ThatOneGiantofAMan",
    "created_utc": 1626473978.0,
    "distinguished": null,
    "edited": 1626481963.0,
    "id": "olrg0v",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_olrg0v",
    "num_comments": 86,
    "permalink": "/r/Superstonk/comments/olrg0v/so_much_fud_stock_volatility_and_low_low_volume/",
    "score": 570,
    "selftext": "Let’s put this bitch into perspective: \n\n\nTeeny tiny volume this last week. No volume, on a stock with hundreds of thousands of activist investors interested in it, is weird. Not just that, the volume has been dipping pretty steadily lately. They used to actively suppress the price. Now? They’re just responding to our buying pressure. They’re running out of their “fuck you” money. BULLISH!\n\n\nFor volatility? Just take a gander at the fucking VIX, baby! Kaboom soon. \n\n\nNext, we had Burry and just a few other eggheads talking about the market’s potential collapse last year. Now? It’s everywhere. J (money printer go brrrrrrr) Powell can’t even contain his negative physical response to Warren’s “optimism” over the banks’ current strength. BULLISH AS FUCK!!\n\nNext, manipulation has really ramped up. I mean, REALLY fucking ramped up! We went for a couple weeks with some really weak-sauce FUD but they’re certainly making up some fucking ground this last week.\n\nMy background: (hold the fuck on. It’ll make sense in a minute) I’m a psych ape and my brain is so wrinkly that it looks like Kenny does in our latest stream of forum sliding memes. I got paperwork proving it but fuck that. Either believe me or tear my post apart, whatever fucking works. Anyway, not only am I a wrinkly psych ape, I’ve dealt with some of the most manipulative, skeezy, horrible piles of excrement that are supposed to be people. I still deal with some of those wastes of oxygen, but I digress. Basically, I’m REAL fucking familiar with manipulation. \n\nWith that in mind, this sub has been the one girl in an 8 man gangbang of manipulation tactics for at least a week. Forum sliding, fake DD, wild conspiracy theories, divisive political discussions, false hype, Mod drama, and much more. Basically, fuckery abounds. \n\nNow, what did we say about the manipulation, in relation to the MOASS? Oh yeah! It’ll fucking pick up, the closer we get to absolution. And this week, fuckery ABOUNDS. \n\nLet’s tie that in with financial experts saying that trillions are about to change hands, this summer. Tits: FUCKING JACKED!\n\nOne last, and probably the most important, morsel. T. PLUS. TWO. Over three hundred FUCKING THOUSAND puts expired out of the money today. How many shares can be hidden in a married put again? I’m pretty damn sure it’s 100. 100 times 300,000 is 30 fucking milli, baby. Half of the fucking float! You know, if fuckery did not abound, that is. \n\nThat means they gotta figure out what the fuck to do before July 20th. My thinking? Hedgies are FUCKED. Oh yeah, and isn’t there some moon party themed thing occurring on the 20th and sponsored by GameStop? \n\nYeah, our venerable queen probably fell for a honey pot. But I mean, really, who hasn’t? Tits, man. They’ll hypnotize you and steal your soul. Anyway, mod drama don’t mean shit. Nobody gives a shit if you care about it. Even less people give a shit if you don’t care about it. Stop fucking karma whoring like the thirsty bitches you are. \n\nThey’re desperate, the stops have been pulled. See you bitches in the winner’s circle. \n\n**TLDR:** fuck you. Read it…. But moon soon. \n\n🚀🚀🚀🚀🚀🚀🚀, rockets. Because I fucking like them, that’s why. \n\nI’m flairing this as DD because I’m analyzing the recent bullshit. Mods can change it if they disagree.\n\nEdit: you’re fucking welcome, u/zenszola",
    "title": "So much FUD, stock volatility, and low low volume this last week. My tits are JACKED!!!!!",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/Superstonk/comments/olrg0v/so_much_fud_stock_volatility_and_low_low_volume/"
}