{
    "author": "morebikesthanbrains",
    "created_utc": 1623336173.0,
    "distinguished": null,
    "edited": 1623351092.0,
    "id": "nwpbpp",
    "text_only": true,
    "flair_id": "57abfac2-85f9-11eb-a149-0e1c812e54f7",
    "flair_text": "Discussion 🦍",
    "name": "t3_nwpbpp",
    "num_comments": 410,
    "permalink": "/r/Superstonk/comments/nwpbpp/a_new_rule_to_allow_brokers_to_restrict_customers/",
    "score": 3858,
    "selftext": "EDIT6: from /u/thisisnotameme2020 \n\n> Note - you may want to post THE EXISTING RULE\nhttps://www.finra.org/rules-guidance/rulebooks/finra-rules/2165\n\n> tinfoil hat on: why add the part about \"(1) extend a temporary hold on a\ndisbursement of funds or securities or a transaction in securities for an additional 30-\nbusiness days if the member firm has reported the matter to a state regulator or agency or\na court of competent jurisdiction\" if you already have the ability to do so based on \"exploration\" - isn't defacto a report to/investigation/lawsuit a flag to trigger holds in this case? So why add this explicitly?\n\n> That coupled with the safe harbor as discussed can be troubling tinfoil hat off\n\n> However, again, this is as written strictly limited to seniors 65+ and legal category of mentally or physically impaired so as to be unable to protect their interest (mentally incompetent in olden days).\n\n\nEDIT5:  One of the 10 Ape Commandments is to wait a few hours before jumping to any conclusions.  I posted this for groupthink and it seems that it may not be as big a threat as it seems.  Fundamentally, shorts have to cover so mass-abuse of this would seemingly only delay the closure of short positions.  Additionally, this rule is directed towards seniors and physically/mentally disabled people, with language that might specifically call out what those terms mean and who they apply to.  Finally, this is an amendment of an existing rule, which has allowed member firms to put holds on fund withdraws.  This provides clarification to those rules, and expands member firm's rights and responsibilities equally regardless of which state they are in.  \n\nBut please though, keep digging \n\nEDIT4: from /u/grogosaur\n\n> Doesn't matter.\n\n> Why?\n\n> No matter what hedge funds throw at us... We BUY and We HODL\n\n> It doesn't matter if they freeze transactions for a year...\n\n> SHORTS NEED TO COVER\n\n> They cannot cover if the shares they need are held by us... They need us to sell... They need our shares... We can't buy any more stocks? Fine. Short ladder it to zero... Still need to buy the stock... Still need to cover short positions...\n\n> The only way to buy shares, is to create naked shorts, which would create a never ending feedback loop.\n\n> Buy... Hold... Eat the rich\n\n\nEDIT3: from /u/Slipperhat: \n\n> I haven't read it fully yet, but there's some language around them having to also notify an assigned person - I think essentially a carer of some sort. So I would imagine it's people who want to trade, or at least have their money in an account that doesn't depreciate like a tracker who also are registered as disabled. I don't particularly like it at all either, but the rule has existed for a while form what I can see and they are just adjusting the time frames\n\nEDIT2:  from /u/Carb0n12: \n\n> I do want to note, this ruling is targeted at mentally handicapped and seniors. This proposed ruling targets accounts with owners over a certain age or mental capacity designation. I’m still reviewing it, but it looks like 99% of us apes are in the clear for this, so far.\n\n> Here is the text pertaining to this specified rule:\n\n> The definition of \"specified adult\" in Rule 2165 covers those investors who are particularly susceptible to financial exploitation.13 A \"specified adult\" is (A) a natural person age 65 and older or (B) a natural person age 18 and older who the member reasonably believes has a mental or physical impairment that renders the individual unable to protect his or her own interests.\n\n> More info on this rule: https://www.finra.org/rules-guidance/notices/17-11\n\n> Basically FINRA-2021-16 summarizes who falls under this rule, the restrictions proposed, the rationale, the age range and requirements of this ruling. This proposed (not into effect) ruling won’t apply to 99% of apes more than likely. I hate the idea of them of reverse taking advantage of any apes who fall into this category, however.\n\n> TLDR: if you’re not old (65+) and/or ACTUALLY designated mentally handicapped / limited, this finra proposed rule change doesn’t apply to you.\n\n**ORIGINAL POST BELOW**\n\nFINRA released a new rule (SR-FINRA-2021-061) ([link](https://www.finra.org/sites/default/files/2021-06/sr-finra-2021-016.pdf)) yesterday titled *Proposed Rule Change to Amend Rule 2165 (Financial Exploitation of Specified Adults).*\n\nAt first read, there is a lot of language about protecting old investors from fraud, but the more I read the more vague and open-ended the rule change appears.  After a few pages, my tinfoil hat is telling me this could be abused to prevent apes from trading stonks during the peak of a squeeze.  Take for instance this language: \n\n> While some state laws permit placing holds on transactions, FINRA is proposing to amend Rule 2165 to create the first uniform national standard for placing holds on securities transactions related to suspected financial exploitation.  Under the safe harbor approach, **a member firm would be permitted, but not required, to place a temporary hold on a transaction when there is a reasonable belief that the customer is being financially exploited**.  FINRA recognizes that placing a temporary hold on a transaction is a serious step for a member firm and the affected customer.  But FINRA also recognizes that placing a temporary hold on the underlying transaction may prevent significant negative financial consequences for the customer.  These negative financial consequences can result even if a temporary hold is placed on any related disbursement of funds out of the customer’s account.\n\nThere are safeguards that are assured to be there to protect customers from abuse of this rule, but the safeguards include things like \n\n* the customer must be notified within 2 days of the commencement of the hold for the reason of the hold. so, a hold can be placed without the customer knowing for a full 2 days.  \n\n* a full investigation must commence immediately by the member firm placing the hold, but the hold can be placed with \"reasonable belief\" that a financial exploitation has occurred, has been attempted, or **even if they only believe that the exploitation may occur**\n\nIt would be helpful if any big 🧠🦍 could review\n\nEDIT1: grammar",
    "title": "A new Rule to allow brokers to restrict customer's trading and withdraws. SR-FINRA-2021-016 will allow firms to place a hold for up to ~~25~~55 days on a customer's ability to trade and/or withdraw funds when there is a reasonable belief the customer is being exploited. **CALLING ALL BIG BRAINS**",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/Superstonk/comments/nwpbpp/a_new_rule_to_allow_brokers_to_restrict_customers/"
}