{
    "author": "Stonkinator3000",
    "created_utc": 1623351138.0,
    "distinguished": null,
    "edited": 1623382374.0,
    "id": "nwvboc",
    "text_only": true,
    "flair_text": "Discussion 🦍",
    "name": "t3_nwvboc",
    "num_comments": 58,
    "permalink": "/r/Superstonk/comments/nwvboc/current_hedge_fundmass_media_strategy_is_to/",
    "score": 1493,
    "selftext": "If this post gets through Superstonk and makes it to the front page of Reddit, what you’ve got to understand if you’re a casual investor is that no serious Reddit investors are talking about, interested in, or let alone investing in any of the new ‘meme stocks’ getting so much attention on mainstream media on the daily. The one and only play is GME, it’s the only ‘meme stock’ that matters and the only one that threatens the survival of all the entities pumping all these other supposed ‘meme stocks’.\n\nThe only place on Reddit where these pump and dump schemes are being broadcast is Wallstreet Bets, which was subjected to a hostile hedge fund takeover months ago. Any mention of GameStop is banned on Wallstreet Bets and posts talking about it are usually deleted within minutes.\n\nSo you’re being criminally scammed into lighting your hard earned money on fire by chasing these supposed ‘meme stocks’ that are suddenly getting so much attention in the media while being promoted by hedge fund shills on Wallstreet Bets. They’re not getting any attention or interest from serious Reddit investors.\n\nWhat mainstream media and the hedge funds with vulnerable short positions in GME are accomplishing with their self-chosen ‘meme stocks’ is twofold. They’re running a pump and dump scheme to steal away your money in order to generate more finances for the war for survival in GME. And after the fact, when the dump happens, they get to start the long-term narrative that “those fickle redditors have moved on to something else. They’re not serious investors and it’s their fault you lost your money.” They want to discount and diminish us as serious investors because we pose a threat to their survival, to their ability to continue to game the system for their own gain.\n\nWell, we are serious investors. The play is and always has been GME, it’s the only ‘meme stock’ that matters and that’s why it’s the only ‘meme stock’ that barely gets any attention at all on mainstream media except to cast doubt on its suitability as a good investment. Every other ‘meme stock’ being pumped on mainstream media is a hedge fund pump and dump scheme meant to convince you to jump in to put money in their coffers before pulling the rug out from under you.",
    "title": "Current hedge fund/mass media strategy is to choose a stock with small market cap, start long position to get big upward movement, call it a ‘meme stock’ and attribute that movement to Redditors, get gullible retail investors to buy in, then dump it. Classic pump and dump scheme.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/nwvboc/current_hedge_fundmass_media_strategy_is_to/"
}