{
    "author": "lolailo_le",
    "created_utc": 1623095360.0,
    "distinguished": null,
    "edited": 1623125165.0,
    "id": "nulqli",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_nulqli",
    "num_comments": 145,
    "permalink": "/r/GME/comments/nulqli/tesla_will_be_the_moass_indicator/",
    "score": 539,
    "selftext": "Hi my fellow apes!\n\nLet's get to the point here and try to answer DA QUESTION:\n\n&#x200B;\n\n# How will we know when the MOASS has started?\n\nBy now, we all know that if Short Hedgies get margin called they will need to start selling their assets, in order to start paying for GME shares, right?\n\nAt that moment, they loose control over their other shares and their brokers start liquidating everything they have so the apes can get some tendies. This may sound ambiguous if you don't know what those other assets are. We all could fall into a fake squeeze if we are not smart enough, which they will try to produce.\n\nWell, worry no more my fellow apes, we are here to save the day and save you from those evil Hedgies that want you to paperhand BEFORE the real MOASS.\n\nAnd the solution for this is actually very simple, **when TSLA starts going to shit (like real shit), that means the MOASS has started.**\n\n&#x200B;\n\n# But why? What does Tesla have to do with this?\n\nGood question my ape in arms!\n\nThe other day I was having a look at Michael Burry's latest investments, only because he's my hero and I want to have as many wrinkles as he has one day. As most of you know by now, this guy has a position worth [half a billion dollars in TSLA puts](https://www.reddit.com/r/GME/comments/nr7xsp/i_just_realized_why_burry_has_shorted_bet_against/?utm_medium=android_app&utm_source=share).\n\nAnd why did he do that you ask?\nBecause TSLA is the [largest long position GME Short Hedgies hold](https://www.reddit.com/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/).\n\nSo, the way I see it, the moment the Hedgies get margin called, there's going to be a BIG surplus of TSLA shares being sold at the market or auctioned. Meaning that the price will go down dramatically. This is for me, the indicator that the MOASS has started.\n\n&#x200B;\n\n**Thoughts?**\n\nPlease feel free to poke holes into this and tell me how smooth brained I am. This is not financial advice, I'm stupid as hell.\n\n&#x200B;\n\n**TLDR:** The moment Short Hedgies get margin called there are going to be a shit ton of TSLA shares being sold. This will make the price go down and we will know that the MOASS is starting.\n\n&#x200B;\n\nI'm a Spainape/Europoor so my English is not perfect but I promise I have tried my very best here.\n\nEdit: Thanks for the awards! I'm thrilled!",
    "title": "Tesla will be the MOASS indicator",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/GME/comments/nulqli/tesla_will_be_the_moass_indicator/"
}