{
    "author": "Starhammer4Billion",
    "created_utc": 1624579998.0,
    "distinguished": null,
    "edited": 1624600385.0,
    "id": "o7cdq4",
    "text_only": true,
    "flair_text": "Opinion 👽",
    "name": "t3_o7cdq4",
    "num_comments": 325,
    "permalink": "/r/Superstonk/comments/o7cdq4/ryan_cohen_told_us_that_today_was_not_gonna_shoot/",
    "score": 5034,
    "selftext": "Every time he posts something that has to do with poop, its a sign of a red day.  \nHe posted Mr. Hankey the christmas poo, before a dip.  \nHe posted that \"Dumb and Dumber\" Clip, before a dip.  \nAnd he posted Terrance and Phillip farting, before a small dip.\n\nProbably because he knew we expected a green day.\n\nSo he knew and he told us.I don't know how he knew.   \nAnd I don't know what he knows.  \nBut he somehow knew.Maybe its because of the federal Holiday, that its +1 Day, but I don't know.\n\nI still like the stock.  \nAnd I still like R.C. in the Chair, I feel like Gamestop is in good hands, Apes included.  \n\n\n  \nEdit:  \nWow, thanks for the awards!  \nThis wasn't initially my theory, I did read it on superstonk after one of those poop tweets.  \nSome wrinkled apes added some more info:  \n\n\nu/w2re3tr4 added:\" 4/29 Tweet: -17.5% cumulative after 7 trading days (two positive days +0.1%, +1.0%)\n\n3/11 Tweet: -53.7% cumulative after 9 trading days (one positive day +0.8%)\"\n\nu/DotAdewk added:\" To add on to OP, the price for GME dropped for 9 trading days after both the Dumb and Dumber pooping gif (March 11-24) and Mr. Hankey picture (April 29-May 11). We'll see if joining the Russell 1000 breaks the trend!\"\n\nu/BluPrince added:\"You forgot the Blockbuster video tweet w/ poop emoji from Jan. 6, which also preceded a red day.\"  \n\n\nI am also not 100% married to the whole t+21 theory, maybe its t+1 because of SEC holiday, maybe its t+35.  \nMaybe something else disrupted the theory and it will pop up again, I don't know.  \n\n\nI am looking forward to all new theories, though it does not have any influence on when I buy.  \nI just buy whenever I got some money and am not really concerned about dips or not dips.  \nWhen it goes up it will not matter and those extra shares are for the infinity pool anyway.",
    "title": "Ryan Cohen told us, that today was not gonna shoot up",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/Superstonk/comments/o7cdq4/ryan_cohen_told_us_that_today_was_not_gonna_shoot/"
}