{
    "author": "sososhibby",
    "created_utc": 1623987249.0,
    "distinguished": null,
    "edited": 1624024623.0,
    "id": "o2fm52",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_o2fm52",
    "num_comments": 126,
    "permalink": "/r/Superstonk/comments/o2fm52/theyve_known_all_along_the_issues_that_exist_dd/",
    "score": 2038,
    "selftext": "**This is like an adrenaline shot of confirmation bias that every bit of fact finding 🦍’s have conducted these last 6 months are VALID & that MSM is gaslighting us into believing we are just Reddit conspiracy theorists who know nothing.**\n\nEdit1: We should get Jeff Connaughton or Ted Kaufman on for an AMA.\n\n\nThis post details some of the things that were happening behind the scenes during Clinton’s administration & Obama’s administration. These details are from former chief of staff to Ted Kaufman, Jeff Connaughton(JC) in his book The payoff: Why Wall Street Always Wins. (Note JC is a Democrat, so that is why he was only part of White House during democratic presidency’s. Also this book was written in 2012, ~10 years ago)\n\n(Note2 I read on an iPhone so page numbers are different on here than a traditional book when citing)\n\nJC also served as a special assistant to the counsel of the president during Clinton’s 1st term. In between chief of staff & special assistant he served time as a lobbyist. \n\nThese “findings” will be limited to JC’S experiences. I decided to share because of the timeline of when they occur & I thought they were interesting pieces to our puzzle.\n\n*This post is lengthy, but should be quite easy to read. Honestly most of the work goes to the author because of how concise & easy to understand the writing is.*\n\n###Breakpoints\n- Wall Streets Influence in Clinton’s administration \n- The Blob\n- Naked Short Selling & The SEC\n\n\n#Wall Streets Influence\n\nBill In Review: Private Securities Litigation Reform Act of 1995\n\nExcerpt about this bill:\n\n“A corporate coalition - Wall Street banks and brokers, accountants, insurers, Silicon Valley—wanted the bill, which would make it more difficult to prove securities fraud, passed intact. The bill’s opponents felt it would shield securities fraud by these companies. Particularly troublesome to them were provisions regarding the statements companies make about future performance.” (P171-172)\n\n**Basically it is now harder to prove securities fraud as well as provides safety to companies for including forward looking statements & prospective information. (Hello Enron) **\n\n**JC account with this bill involved counseling Bill Clinton himself. Pushing the president that this bill is not good for the public, to which it seems the president agrees.**\n\nHere is the part that stands out to me\n\n“If the president has to think very hard before taking on this kind of fight, I thought to myself, imagine how disproportionately unlikely it is for Washington’s lower castes to dare do the same.”(P178)\n\n**So even the president of the United States faces severe pressure from Wall Street to bend to their whims. Anyway, JC counsels Clinton, and Clinton is onboard to amend the bill.**\n\n**The amendment corrects securities fraud protection & removes forward looking statements.(Excerpt below)**\n\n“I called a staffer in Senator Paul Sarbanes’s office. I briefed him that if Sarbanes would offer an amendment that would preserve the viability of a securities-fraud action against company executives who had “actual knowledge” that, a forward-looking statement was fraudulent, the White House would support it”(P180)\n\n**Great, so everything is good right? Nope**\n\n“The vote began, and it looked for a while like we were going to win. Then Dodd started working his fellow senators. It soon became apparent it was going to be a tie. Finally, Dodd voted against the amendment, which failed by one vote.”\n\n**Yup Dodd, you know the senator behind the Dodd-Frank act? He not only voted with Wall Street, he spearheaded the damn thing. Dodd is a Democrat, who went against a democratic president helping Wall Street & screwing the little guy. Wowzers **\n\n**Anyway the amendment gets rejected, original bill gets passed by the senate. **\n\n“Some have speculated that Clinton wanted to have it both ways: he vetoed the bill, but also signaled to Dodd that he wouldn’t be overly displeased if two-thirds of Congress voted to override it. I don’t know whether that’s true or false.”(P186)\n\n**Clinton vetoes. Senates votes 2/3 to override it.**\n\n**So seems Bill wanted to have his cake & eat it too. Whether this case is true or not, Clinton went on in his second term to repeal the Glass-Steagall Act leaving derivatives transactions unregulated. **\n\n\n\n#The Blob\n\n“The Blob (it’s really called that) refers to the government entities that regulate the finance industry—like the Banking Committee, Treasury Department, and SEC—and the army of Wall Street representatives and lobbyists that continuously surrounds and permeates them. The Blob moves together. Its members are in constant contact by e-mail and phone. They dine, drink, and take vacations together. Not surprisingly, they frequently intermarry. “Indeed, a good way to maximize your family income in DC is to specialize in financial issues and marry someone in The Blob. Ideally, you and your spouse take turns: One of you works for a bank, insurance company, or lobbying firm while the other works for a government entity that regulates, or enacts legislation for, the financial industry. Every few years, you reverse roles: “Sally Striver, staffer on the Senate Banking Committee,” so might read a typical notice in Roll Call, “today announced her departure to work for the Financial Services Roundtable”; inevitably, she’s replaced with someone from the financial industry because, so runs the justification, the committee needs people familiar with the issues. What you and your spouse do all the time is share information.”(P250)\n\n**Wow. Idk this was enraging when I read it. The fact that this happens so blatantly that it’s given a nickname because it’s so fucking common & accepted is sickening. Just more evidence of the revolving door between regulators & financial institutions to game the system.**\n\nThis is during JC’s time as chief of staff:\n\n“Ted and I quickly learned that, when you take on Wall Street in Washington, you take on The Blob. We were fighting deeply entrenched interests and a deeply ingrained institutional culture.”\n\n**You have to fight through a financial mob so to speak to even begin to create reform. Translated: 🦍 need to stay 💪 to get reform past the blob for financial fairness in the markets.**\n\n\n#Naked Short Selling & The SEC\n\n**This part is a little bit longer, but I just wasn’t expect this to be in this book nor to this extent.**\n\n(Senator Johnny Isakson)\n“Isakson and Ted shared an interest in financial issues, and both had recently received complaints from constituents about the naked short selling of stocks by hedge funds and about the SEC’s rescission of the uptick rule.” \n\n“Many ordinary investors, including Kaufman and me, have sold stocks short from time to time. But there’s an important difference. When I sell stock short, my brokerage firm makes me borrow the shares of stock before I do the short sale. This ensures that I can deliver the shares at the required time for settlement of the trade. Banks and brokerage houses make a lot of money charging people to borrow stock for short sales.\nThe SEC rule, however, doesn’t require that everyone borrow the stock. A short seller only needs to have a “reasonable belief” that he can locate the stock in time to deliver it at settlement, which happens three days later. Selling a stock without intending to locate it in time for settlement is naked short selling. It amounts to selling shares that don’t exist, which increases the supply of a stock in a way that can push its price down.\nSince the Depression, the SEC had required short sellers to wait for an uptick in price before selling short. Forcing short sellers to wait for the price to tick up before they sell more shares gives a breather to a stock in rapid decline and helps prevent bear raids, which are essentially attacks on a stock (typically by hedge funds) with the aim of driving down its price to ensure that their short selling is profitable. The uptick rule was in force for nearly seventy years. In 2007, the SEC rescinded it. In Mary Schapiro’s confirmation hearings before the Senate Banking Committee, she was asked repeatedly whether she would restore the uptick rule. Schapiro, who took office as SEC chairman in January 2009, all but promised she would.\nNothing happened.”\n(P252-254)\n\n**I mean wow. Talk about spitting some straight DD. This book was written 2012, and if I just read this correctly it sounds like Congress & White House 100% understand this shit exists & are complicit in naked short selling existing. But wait it keeps going.**\n\n“The pushback from the Blue Team was followed by pushback from The Blob. I received an e-mail from a lobbyist (and former Dodd staffer) who represented a large hedge fund well known for short selling. She warned me that it would be bad for my career if Ted and I went after short selling. She added that Ted and I looked like deranged conspiracy theorists for seeking to explore whether short selling had played a role in the downfall of firms like Lehman Brothers”(P257)\n\n**Does that sound familiar ? I guess everyone is a conspiracy theorist around.  Ohh & Lehman brothers also failed even with a plan to save them due to short sellers naked short selling them into the grave.** \n\n**More juice to squeeze.**\n\nAt a senate meeting with the SEC:\n“Senate staffers pointed out that the SEC was ignoring the fact that its short-selling manipulation rule was unenforceable. Hedge funds can spread false rumors about a stock and conduct massive short sales without locating the stock, even if they succeed in delivering the shares three days after the rumors. They could beat down a stock’s price repeatedly. The SEC people said little during the discussion. My impression was that they viewed it as another meeting to endure; after feigning to listen, they could simply continue to do things their way.”(P258)\n\n**Ok, read this next part carefully.**\n\n“They added that they couldn’t give us any details of the investigation but warned us that it’s almost impossible to prove intent under the current rule (that is, the reasonable-belief standard). Under this rule, anyone accused of naked short selling can simply say: “I reasonably believed I could find the stock in time.” In essence, the SEC lawyers confirmed our view that the rule against naked short selling was unenforceable and that they knew it.”(P259)\n\n\n**How convenient. How oh so convenient. Honestly I do not think we see justice for these crimes. Unless the SEC amends this short selling rule, Kenny Mayo will be walking free. Floor is now $30 million**\n\n**Ohh but it gets better.**\n\n\n“Most stock trades in the United States are cleared by a Wall Street backroom firm called the Depository Trust Clearing Corporation (DTCC). I suspected that the DTCC had extensive data on short selling. After a series of enquiries, I finally arranged for the DTCC’s general counsel (Larry Thompson) and one of its managing directors (Bill Hodash) to meet with me in Washington. We’d chatted for about fifteen minutes when Larry startled me by saying, “We want to be part of the solution, and we think we have a proposal that will work. “It turns out that months previously the DTCC had gone to the SEC with a proposed solution to naked short selling: The DTCC would create a computer system in which the actual shares of a stock must first be declimated (more simply: flagged or identified) before a broker could sell shares short. A centralized database would prevent the same shares from being used for multiple short sales. The DTCC believed that such a system would effectively stop naked short selling for the shares it cleared, which represented a vast majority of all shares traded in the United States. Larry told us that the SEC had received the DTCC proposal months ago but hadn’t done any follow-up. Instead, the SEC had asked Larry whether he was sure that the DTCC board (which is made up of representatives of Wall Street brokerage firms) supported the proposal.”(P259-261)\n\n\n“Within a month of hearing about the DTCC’s idea, I’d helped Kaufman recruit seven other senators to write to “recruit seven other senators to write to the SEC endorsing the idea as a potential solution to abusive short selling.”(P261)\n\n“Not long after receiving the letter, the SEC announced it would hold a public roundtable to discuss naked short selling and possible solutions on September 24, 2009. I was convinced we were making progress.”(P261)\n\n“To its roundtable the SEC had invited nine banking-industry participants, all but one of whom was in favor of maintaining the status quo. During the meeting, the DTCC representative sat mute and didn’t even mention the DTCC’s proposed solution for naked short selling. Afterwards, I went over to Larry and Bill and asked “What happened?” Sheepishly, and to their credit, they admitted, “We got pulled back.” They meant: by their board, by the Wall Street powers-that-be. It was just as the”(P264)\n\n“There were two reasons why Wall Street didn’t want to adopt it. First, banks make an enormous amount of money lending stock for short sales, and so no big bank wanted to change the status quo. Second, and perhaps more importantly, stocks now traded in microseconds; millions of shares change hands (including in short-selling transactions) in the blink of an eye. High-frequency traders would oppose any solution, like the DTCC’s, that required that shares be located and marked before being sold short. A high-frequency trade has no time to get its ticket stamped before jumping on its high-speed train.”(P266)\n\n**I know that was a lot here’s a quick breakdown.**\n\n**DTCC had a solution to fix naked short selling in 2008. They reached out to SEC to propose the changes. DTCC is made up of Wall Street execs. SEC roundtable was setup to fix naked short selling. DTCC sits on their thumbs during the roundtable because their board, Wall Street, has reeled them back in. Naked short selling is highly profitable from fee collection on lent stocks. High frequency traders don’t want to execute orders correctly, just quickly.**\n\n**But holy fuck. I mean everything is here in this book from ~10 years ago. **\n\nHere’s some more tidbits of confirmation bias that 🦍 are not crazy & we are 10000% correct.\n\n“Altogether, off-market trading—in dark pools or internally at broker-dealers—accounts for nearly one quarter of U.S. stock-trading volume. For retail investor orders, it may be twice that amount.”(P271)\n\n\n**Ohh so almost 50% of retail trades being routed to dark pools. Sound familiar ??**\n\n\n“It would’ve been easy, and quite understandable, for us to be convinced by Wall Street’s unanimous message. But we’d been educating ourselves about these issues and we were convinced that there were, to use Donald Rumsfeld’s locution, too many unknown unknowns for us to stop burrowing for answers and prodding the SEC.”(P274)\n\n**Sounds like fellow 🦍 to me.**\n\n\n“One HFT strategy is called pinging. It involves attempting to “uncover how much an investor is willing to pay—or sell for—by sending out a stream of probing quotes that are swiftly cancelled until they elicit a response.\nThe traders then buy or short the targeted stock ahead of the investor, offering it to them a fraction of a second later for a tidy profit.  “\nThere are also momentum strategies (in which traders take a position in a stock and then use HFT to generate market momentum that would benefit their position) and liquidity-detection strategies (in which traders use HFT to front-run—that is, buy or sell microseconds ahead of—incoming orders from pension and mutual funds). An SEC staffer stated that in some instances these strategies “could be manipulation” and “would concern us.”(P275-276)\n\n“The Tabb Group estimated in 2009 that HFT generates $8 billion in profits annually. The question is: How much of this profit is from legitimate practices this profit is from legitimate practices that benefits all investors, and how much of it is effectively an illicit toll extorted from average investors without their knowledge?”(P277)\n\n**TLDR: HFS deploy strategies of market manipulation to screw over average investors. Sound familiar yet?**\n\n\n**I will leave it with one last quote.**\n\n“Helping other senators understand HFT, flash orders, and dark pools was one challenge. Another was to get them to care. In Washington, if an issue isn’t in the newspapers, no senator is going to care much about it.”\n\n**I. E. 🦍 need to keep making noise, raising awareness of the manipulative issues that exist, that our votes depend on the correction of our markets & that 🦍’s will not let these issues slide into the darkness. This also shows why every newspaper & news source ice being bought up by financial institutions.**\n\n\n\n\n#TLDR: Chief Of Staff to a senator confirms every single issue 🦍’s have unraveled in last 6 months, chronicles the pervasive influence Wall Street holds on our government.\n\n###Our government will not listen UNLESS our independent collective voices are heard. These issues are resolved by 🦍’s. We may be the last hope of reform.",
    "title": "They’ve known all along the issues that exist. 🦍 DD Major Confirmation.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/o2fm52/theyve_known_all_along_the_issues_that_exist_dd/"
}