{
    "author": "HCMF_MaceFace",
    "created_utc": 1625420848.0,
    "distinguished": null,
    "edited": 1625425136.0,
    "id": "odpdde",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_odpdde",
    "num_comments": 59,
    "permalink": "/r/Superstonk/comments/odpdde/gme_mother_of_all_short_squeezes_moass_thesis/",
    "score": 1633,
    "selftext": "[Marianne Jacked to the Tits](https://images.app.goo.gl/Kc53NoW8amUEY7QJ6)\n\n0.Intro FR\n\nCeci est une tentative de traduction du post original de [u/HCMF\\_MaceFace](https://www.reddit.com/user/HCMF_MaceFace/).\n\nL’objectif de ce post est de transmettre cette mine d’informations à nos compatriotes n’étants pas bilingues. Si vous trouvez des erreurs de traduction ou d’interprétation de ma part, n’hésitez pas à me le faire savoir dans les commentaires. J’espère recevoir de bons retour de votre part car j’ai passé quelques heures à bosser sur cette traduction (ce n’est pas du tout mon domaine à la base) et si c’est le cas j’essaierais de traduire d’autres DD importants. D’ailleurs n’hésitez pas à me donner des recommandations.\n\nI. LIENS IMPORTANTS POUR LES NOUVEAUX MEMBRES DE [r/superstonk](https://www.reddit.com/r/superstonk/)\n\n· [Protocole de sécurité de l'APE (comment se sécuriser et se protéger en ligne)](https://www.reddit.com/r/Superstonk/comments/nsgv3d/ape_security_protocols/)\n\n· [Page Guide du débutant DD](https://www.reddit.com/r/Superstonk/comments/njwv6n/the_gme_masters_guide_a_dd_campaign_for_apes/?utm_medium=android_app&utm_source=share)\n\n· [Wiki](https://www.reddit.com/r/Superstonk/wiki/index)\n\nII. INTRO / INTENTION DU POST\n\nL'intention première de ce post était de présenter la thèse du MOASS d'une manière compréhensible pour les personnes à l'intérieur et à l'extérieur de la communauté (en particulier celles qui sont relativement nouvelles sur le marché financier). Il a également pour but de servir de référence si vous essayez d'expliquer à quelqu'un pourquoi vous pensez que c'est une bonne option d'investissement.\n\nCe post donnera une description relativement simpliste de la situation actuelle et du paysage de l'action GameStop (GME). Il résumera la théorie selon laquelle le prix de GME atteindra bientôt des niveaux astronomiques lors d'une compression massive des positions à découvert (shorts), alias thèse du MOASS. La majeure partie de ce post est une décomposition des termes et concepts du marché qui devront être compris afin de comprendre pleinement le qui-quoi-quand-où-pourquoi-comment.\n\nIII. Note personnelle\n\n**Avis de non-responsabilité**\n\nCe document n'est PAS destiné à servir de source de preuves pour cette théorie, et il fonctionne en supposant que la théorie est valide et que les conditions sur lesquelles elle est construite sont valides. Le crédit pour le DD sur lequel cette thèse est basée appartient à la communauté plus large des détaillants à l'intérieur et à l'extérieur de [r/superstonk](https://www.reddit.com/r/superstonk/). J'y ai personnellement très peu contribué, si ce n'est en synthétisant et en résumant la thèse et les mécanismes d'une manière digeste pour permettre à d'autres de faire passer le message, et je ne suis un expert sur aucun de ces sujets, même si j'ai quelques connaissances dans ce domaine.\n\nIV. CONCEPTS CLÉS\n\nCes termes sont essentiels pour comprendre la théorie et la valeur spéculative d'un investissement dans GME.\n\nTable des matières des concepts clés\n\n1. Concepts d'actions\n\na. Action/stock\n\nb. Actions synthétiques\n\nc. Actions en circulation\n\nd. Actions restreintes\n\ne. Le flottant\n\nf. Assemblée générale annuelle\n\ng. Votes des actionnaires\n\n2. Positions commerciales\n\na. Position longue - Achat/Vente d'actions\n\nb. Position courte - Vente à découvert/couverture d'actions\n\nc. Naked Short Position - Naked Shorting/Covering Stock\n\n3. Participants au marché\n\na. Investisseurs de détail\n\nb. Investisseurs institutionnels\n\nc. Teneurs de marché\n\nd. Prime Brokers\n\ne. Centres d'échange d'informations\n\nf. MSM (Médias de masse)\n\n4. MÉCANISMES IMPORTANTS DU MARCHÉ/DES ÉCHANGES (MOASS)\n\na. Défauts de livraison (FTD)\n\nb. Marge\n\nc. Appels de marge\n\nd. Appels de marge Qui appelle qui\n\ne. Short Squeeze\n\n1 - CONCEPTS DE STOCKS\n\n1.1 - [Actions](https://fr.wikipedia.org/wiki/Action_(finance))/stocks\n\nC’est la plus petite unité d'une entreprise (Stock)\n\n· Les actions et les parts sont souvent utilisées de manière interchangeable.\n\n· Techniquement, les \"actions\" représentent le nombre d'actions d'une société spécifique, alors que l'achat de plusieurs \"actions\" signifie que des actions de plusieurs sociétés ont été achetées.\n\no ex. J'ai acheté 2 actions : 10 titres de GME et 60 titres d'CHWY.\n\n· Il existe différents catégories d’actions qui se distinguent par leurs droits de vote, leurs frais de vente et d'autres facteurs.\n\no Les classes d'actions ont une dynamique relativement complexe, mais je ne m'y attarderai pas ici, car elle n'est pas aussi pertinente pour GME/CHWY.\n\n1. 2 - Actions synthétiques\n\nCeux sont les instruments financiers qui sont produits par le Naked Shorting.\n\nÀ ne pas confondre avec les options synthétiquesqui sont des stratégies commerciales légales/légitimes qui \"simulent\" les profits/pertes comme si le trader détenait réellement ces actions.\n\n· Les actions synthétiques confèrent à leur propriétaire les mêmes droits qu'un investisseur possédant une action non synthétique.\n\n· Les cas où il y a un nombre excessif d'actions synthétiques indiquent la possibilité qu'une action fasse l'objet d'un abus ou d'une manipulation.\n\n· Ne peut être facilement mesuré en raison de la transparence publique limitée au niveau des teneurs de marché et des courtiers principaux.\n\n1.3 - [Actions en circulation](https://fr.wikipedia.org/wiki/Action_en_circulation)\n\nLe nombre d’actions en circulation englobe le montant des actions émises détenues par tous les actionnaires (privés et publics)\n\n· Il est possible qu'il y ait plus d'actions en circulation grâce à la vente à découvert à nu, qui produit des actions synthétiques.\n\n· Le nombre d'actions émises ET synthétiques en circulation est très difficile à mesurer, car elles ne sont enregistrées que dans les livres des teneurs de marché générant des actions synthétiques et des courtiers principaux par l'intermédiaire desquels ils négocient.\n\no Ces parties ne sont pas incitées à être transparentes mais à dissimuler activement ces chiffres, car la pratique de la vente à découvert à nu de manière excessive est frauduleuse et illégale.\n\n1.4 - Actions restreintes\n\nNombre d'actions émises détenues par des initiés de la société\n\n· Ces actions ne sont pas négociées sur le marché boursier.\n\n1.5 – [Le flottant](https://fr.wikipedia.org/wiki/Flottant_(finance))\n\nLe flottant est le nombre d'actions disponibles pour être négociées publiquement (le nombre d’actions en circulation)\n\n· En théorie, le nombre d'actions détenues par les investisseurs particuliers\n\net les investisseurs institutionnels ne doit pas dépasser le flottant.\n\n· Le flottant total de GME est actuellement de \\~56,89 millions d’actions (en date du 10/06/21)\n\n1.6 - Votes des actionnaires\n\nAssemblée générale des actionnaires :il s'agit essentiellement d'une assemblée annuelle qui permet aux actionnaires de voter.\n\n· Les votes portent sur des sujets tels que\n\no Nomination des administrateurs\n\no Rémunération des dirigeants\n\no Ajustements des dividendes\n\n1.7 - Votes des actionnaires\n\nLe vote des actionnaires est un droit accordé aux actionnaires détenant des actions de l'entreprise qui leur donne le droit de voter sur les politiques de coopération.\n\n· Exemples d'objets soumis au vote\n\no Nomination des administrateurs\n\no Rémunération des dirigeants\n\no Ajustements de dividendes\n\n· Sur-Vote\n\no Lorsqu'il y a un sur-vote (comme GME le 6/9), les votes seront normalisés à un nombre basé sur le nombre d'actions détenues par la DTCC.\n\no Le formulaire officiel 8K ne peut pas être soumis officiellement avec un sur-vote\n\n§ Lorsque cela se produit, la SEC et la société sont notifiées.\n\n2 - POSITIONS COMMERCIALES\n\n2.1 - Position longue - achat/vente d'actions\n\nLorsqu'un investisseur achète une action, il est considéré comme un acheteur\n\n(c'est le type de position que la plupart des gens associent à la négociation d'actions)\n\n· A ne pas confondre avec un investissement sur le long terme\n\n· En d'autres termes, les détenteurs de positions longues ont un nombre **positif** d'actions.\n\n· Pour fermer une position longue, le propriétaire vend ses actions sur le marché boursier.\n\nLe flux de base pour obtenir/fermer une position longue est le suivant :\n\n1. Acheter l'action\n2. Le conserver jusqu'à ce que son prix augmente à un niveau souhaité.\n3. Le vendre à profit\n\n2.2 - [Position](https://fr.wikipedia.org/wiki/Position_(finance)) courte - Vente à découvert/couverture d'actions\n\nLorsqu'un vendeur à découvert short une action, il détient une position courte sur l'action et se doit de rembourser les actions qu’il a vendu à découvert au tiers auquel il a emprunté ces actions.\n\n· A ne pas confondre avec un investissement sur le court terme.\n\n· Les investisseurs ayant des positions courtes sont effectivement *endettés* ou *doivent* le nombre d'actions qu'ils ont vendues à découvert et peuvent être considérés comme ***négatifs*** sur le titre.\n\n· Pour clôturer cette position, les vendeurs à découvert doivent acheter un nombre d'actions égal à la taille de leur position à découvert (l'achat pour clôturer une position à découvert est appelé couverture)\n\n· Les positions courtes doivent être déclarées aux autorités de réglementation (contrairement aux ventes à découvert nues).\n\nFlux de base pour obtenir/fermer une position courte :\n\n1. Emprunter une action détenue par un prêteur\n2. Vendre l'action qui a été empruntée\n3. Gagner de l'argent sur la base du prix qu'elle avait au moment où elle a été vendue à découvert.\n4. Payer des intérêts sous forme de pourcentage de la valeur de l'action.\n5. Comme il s'agit d'un pourcentage, le coût des intérêts augmente si la valeur de l'action augmente.\n6. Maintenir la position jusqu'à ce que le prix ait baissé jusqu'au prix souhaité.\n7. Acheter l'action sur le marché libre\n8. Idéalement, les actions sont rachetées à un prix inférieur à celui de l'emprunt initial, de sorte que l'investisseur peut empocher la différence.\n9. Remettre l'action au prêteur\n\n2.3 - Position à découvert à nu - Vente à découvert à nu/couverture d'actions\n\n[Vente à découvert](https://fr.wikipedia.org/wiki/Vente_%C3%A0_d%C3%A9couvert#Vente_%C3%A0_d%C3%A9couvert_nue_et_locate) à nu (Naked Short)\n\npermet effectivement à un vendeur à découvert, travaillant avec un teneur de marché, de vendre à découvert une action en utilisant une action sans avoir à emprunter une action comme dans le cas d'une vente à découvert normale.\n\n· Les ventes à découvert nues ne doivent PAS être déclarées de la même manière que les \"ventes à découvert\" normales et peuvent être \"cachées\".\n\no Le fait de ne pas livrer à l'acheteur les actions qui ont été \"faussement empruntées\" est l'un des principaux moyens de trouver des preuves de la vente à découvert à nu.\n\n· En raison d'une faille et d'un manque de surveillance par la réglementation, la vente à découvert à nu peut être utilisée pour manipuler le prix de certaines actions.\n\no Ce type de transaction est illégal en dehors de situations spécifiques impliquant des teneurs de marché.\n\n· La vente à découvert à nu a fait l'objet d'une réglementation plus stricte pendant la crise financière de 2008, mais l'application de cette réglementation n'a malheureusement pas permis d'empêcher la manipulation du marché.\n\nFlux de base pour obtenir/fermer une position courte nue (assez complexe et impliquant deux parties spécifiques pour deux transactions initiales appelées \"married put\").\n\n1. Un vendeur à découvert \"A\" achète 100 actions à un teneur de marché \"Z\", qui peut techniquement les vendre sans les localiser.\n\na. Le teneur de marché vend à découvert l'action, et le vendeur à découvert reçoit 100 actions synthétiques.\n\n2. Le vendeur à découvert \"A\" achète maintenant une [option de vente](https://fr.wikipedia.org/wiki/Put#:~:text=Le%20put%20ou%20l'option,(dite%20date%20de%20maturit%C3%A9).) (put)\n\n(1 contrat d'option vaut 100 actions) du teneur de marché \"Z\" qui est le rédacteur\n\nde l’option de vente.\n\na. La vente d'une option de vente rapporte +100 actions au teneur de marché, ce qui a pour effet de neutraliser les -100 actions qui ont été vendues à découvert, de sorte que le teneur de marché se retrouve en position neutre (les teneurs de marché essaient généralement de conserver une position nette nulle sur les transactions).\n\nb. Le vendeur à découvert \"A\" dispose maintenant de 100 actions qui peuvent être vendues à découvert (il \"emprunte\" les actions synthétiques que le teneur de marché a effectivement imprimées de toutes pièces), et d'un contrat de vente sur lequel il peut gagner de l'argent tant que le prix baisse.\n\n3. Les étapes pour le vendeur à découvert sont fondamentalement les mêmes que pour une vente à découvert normale, cependant, les intérêts du vendeur à découvert ne doivent pas être payés à un prêteur (personne ne les prête officiellement).\n\na. La prime de l'option de vente achetée au teneur de marché est leur bénéfice.\n\nb. Le vendeur à découvert \"A\" a maintenant une position courte qu'il peut couvrir simplement en achetant 100 actions, ce qui annulerait la position courte synthétique.\n\n3 - ACTEURS DU MARCHÉ\n\n3.1 - Investisseurs de détail\n\n· Les investisseurs particuliers, également connus sous le nom d'investisseurs individuels, sont des investisseurs ordinaires (et non des entreprises ou des organisations).\n\n· Appelé \"Dumb Money\" (Argent facile/fictif) par Wall Street et la communauté financière \"professionnelle\".\n\n· Communautés Reddit\n\no Subreddits notables\n\n3.2 - Investisseurs institutionnels\n\nLes [investisseurs institutionnels](https://fr.wikipedia.org/wiki/Investisseur_institutionnel) sont des organisations qui investissent au nom des particuliers\n\n· Exemples d'investisseurs institutionnels\n\no Fonds de dotation\n\no Banques commerciales\n\no Fonds communs de placement\n\no Fonds spéculatifs\n\no Fonds de pension\n\no Compagnies d'assurance\n\n3.3 - Teneurs de marché\n\n· Les [teneurs de marchés](https://fr.wikipedia.org/wiki/Animateur_de_march%C3%A9) (market maker) sont très différents des \"investisseurs\" et sont un peu plus difficiles à expliquer, mais ils servent essentiellement à accroître la liquidité sur le marché.\n\n· Lorsque vous achetez et vendez des actions, ces transactions se font souvent entre vous et un teneur de marché.\n\n· Les teneurs de marché bénéficient de \"règles spéciales\" qui leur permettent de maintenir la liquidité sur le marché lorsque celle-ci est faible.\n\n· La vente à découvert à nu est l'une des options dont disposent les teneurs de marché lorsqu'ils effectuent une transaction dont les autres investisseurs ne disposent pas.\n\n3.4 - Prime Brokers\n\n· Un Prime broker est un groupe de services que les banques d'investissement et d'autres institutions financières offrent aux fonds spéculatifs et à d'autres clients d'investissement importants qui doivent pouvoir emprunter des titres ou des liquidités afin de procéder au [netting](https://fr.wikipedia.org/wiki/Netting_(finance)#:~:text=En%20finance%2C%20le%20netting%20est,les%20cr%C3%A9ances%20de%20celles%2Dci.) pour obtenir des rendements absolus.\n\n· [Courtier](https://fr.wikipedia.org/wiki/Courtier)[ ](https://www.investopedia.com/terms/p/primebrokerage.asp)vs Prime Broker\n\no Un courtier est une personne ou une entité qui facilite l'achat ou la vente de titres, comme l'achat ou la vente d'actions et d'obligations pour un compte d'investissement. Un courtier principal est une grande institution qui fournit une multitude de services, de la gestion de trésorerie au prêt de titres en passant par la gestion des risques pour d'autres grandes institutions.\n\n· [Teneurs de marché (Market Maker)](https://fr.wikipedia.org/wiki/Animateur_de_march%C3%A9)\n\no Le Prime Broker est celui qui appelle Shitadel si sa position à découvert devient trop importante ou s'il perd trop de capital.\n\n3.5 – Chambres de compensation\n\nLes [chambres de compensation](https://fr.wikipedia.org/wiki/Compensation_(finance)) sont des intermédiaires entre les acheteurs et les vendeurs\n\n· Finaliser les transactions\n\n· Réglemente la livraison des biens\n\n· Rapports sur les données commerciales\n\n3.6\\* - Médias de Masse/MSM (Mainstream Media)\n\nBien qu'il ne s'agisse pas d'un acteur traditionnel du marché (c'est-à-dire qu'il ne s'agit pas d'entités commerciales/financières), les médias de masse sont à noter en raison de leur rôle dans l'influence de l'atmosphère et du paysage financier.\n\n4 - MÉCANISMES IMPORTANTS DU MARCHÉ/DU COMMERCE (MOASS)\n\n4.1 – Défauts de livraison (FTD)\n\n· Les FTD se produisent lorsqu'un acheteur d'une action finit par ne pas avoir l'argent nécessaire pour acheter l'action qu'il a négociée OU, **lorsqu'un vendeur à découvert ne possède pas l'action au moment du règlement.**\n\n· Les FTD sont l'une des principales indication de la vente à découvert à nu, de sorte qu'un nombre très élevé de FTD en est la preuve.\n\no Spoiler : GME ont des tonnes de FTD signalés\n\n4.2 – Appels de Marge (Margin calls)\n\n· Les achats à découvert sont des crédits qu'un investisseur peut utiliser pour acheter plus d'actions.\n\n· Lorsque vous achetez à découvert, vous devez mettre en gage les actifs que vous avez déjà achetés avec votre propre argent.\n\n· Le montant de la marge / du crédit que vous pouvez avoir dépend de la valeur de votre garantie.\n\n· La valeur de vos garanties et de vos liquidités doivent respecter les exigences de pour continuer à acheter à crédit.\n\n· Gardez à l'esprit que la valeur de votre garantie peut changer si le prix monte ou descend et que si la valeur de votre garantie/espèces tombe en dessous de la marge requise, vous recevrez un [appel de marge](https://fr.wikipedia.org/wiki/Appel_de_marge).\n\nEn d’autres termes :\n\n1. Imaginez que j'ai 1 000 $ en stock\n2. Vous obtenez un prêt personnel de 1000 $ supplémentaires\n3. Pour obtenir le crédit, vous mettez en jeu vos 1000 $ en actions (si vous ne les payez pas, ils vont au prêteur pour couvrir votre dette).\n4. Vous achetez 1 000 $ d'actions supplémentaires avec ce prêt (vous possédez maintenant 2 000 $ d'actions, la moitié en espèces, l'autre à crédit).\n5. Vous paierez des intérêts sur les 1000 $ à crédit, mais si votre investissement rapporte plus que les intérêts, vous en profitez quand même.\n6. Si votre investissement tourne mal (disons que le prix de votre action chute de 50 % et que vous vous retrouvez avec 1000 $), votre prêteur peut liquider de force vos positions (tout ce que vous avez acheté en espèces et mis en garantie, ainsi que ce que vous avez acheté à crédit, afin de récupérer les 1000 $ qu'il vous a prêtés).\n\n· Un appel de marge est un avis indiquant que vous disposez d'un délai spécifique pour déposer suffisamment de fonds propres pour répondre à votre exigence de marge (si vous ne pouvez pas répondre à l'exigence, le prêteur est en droit de vendre tous vos avoirs pour récupérer ce que vous avez emprunté).\n\n**Exemples de marges :**\n\nIl s'agit d'un scénario légèrement compliqué qui peut être un peu difficile à suivre. Si vous n'y comprenez rien du premier coup, relisez-le, mais en gros, Marge est une ligne de crédit que vous pouvez utiliser pour acheter d'autres actifs (en fait, un prêt garanti par une garantie et des liquidités sur votre propre compte). Si vous achetez des actifs avec cette marge, vous devez rembourser ce que vous avez emprunté, que la valeur de votre investissement augmente ou diminue (si la valeur de l'investissement augmente, vous gagnez plus que vous ne le feriez normalement, mais si la valeur de l'investissement diminue, vous perdez plus que vous ne l'auriez fait sans marge).\n\nCela devient encore plus ou moins compliqué lorsque vous avez des positions courtes ET des positions longues, comme la plupart des investisseurs institutionnels. Pour avoir des positions courtes, je dois toujours avoir une marge, mais je n'ai pas besoin de l'utiliser pour acheter des actions. Elle peut servir de tampon si j'ai une position courte sur une action qui prend de la valeur (avec une position courte, si le prix de l'action que je vends à découvert augmente, je perds de l'argent), et si elle devient trop élevée, elle peut se heurter à ma ligne de marge, provoquant un appel de marge.\n\n**GAIN : Positions longues**\n\n1. Imaginons que j'aie 1 000 dollars d'actions XXX (disons 10 actions de 100 dollars chacune).\n2. Mon courtier peut me prêter une ligne de crédit de marge égale à la valeur de mes actifs (donc 1000 $ de marge), et disons qu'il me donne une exigence de marge de 800 $, ce qui signifie que la valeur de mes actifs sans marge (ceux que j'ai achetés avec mon argent) doit être supérieure à 800 $ pour que je puisse continuer à utiliser la marge (donc tant que l'action XXX reste au-dessus de 80 $ l'action, je ne recevrai pas d'appel de marge pour être en dessous de l'exigence).\n3. Je choisis ensuite d'utiliser la marge, en achetant 10 actions supplémentaires de l'action XXX pour 100 $ chacune, de sorte que je dispose maintenant de 20 actions de l'action XXX, évaluées à 100 $ chacune.\n4. Si le prix de l'action XXX augmente de 25 % par action, et que je vends les 20 actions, je viens de réaliser un bénéfice de 500 $ (+25 $ sur 20 actions).\n\na. Dans ce cas, la fermeture de la position me libère de la dette de marge, car je ne l'utilise plus dans une position ouverte.\n\nb. Si je n'avais pas utilisé la marge, je ne serais reparti qu'avec 250 dollars de bénéfice (25 dollars par action sur 10 actions), mais au lieu de cela, j'ai gagné 500 dollars et remboursé le crédit, plus un peu d'intérêts\n\n5.Cool\n\n**PERTES : Positions longues**\n\n1. Imaginons que j'ai 1000 $ en actions XXX (disons 10 actions d'une valeur de 100 $ chacune).\n2. Mon courtier peut me prêter une ligne de crédit de marge égale à la valeur de mes actifs (donc 1000 $ de marge), et disons qu'il me donne une exigence de marge de 800 $, ce qui signifie que la valeur de mes actifs sans marge (ceux que j'ai achetés avec mon argent) doit être supérieure à 800 $ pour que je puisse continuer à utiliser la marge (donc tant que l'action XXX reste au-dessus de 80 $ l'action, je ne recevrai pas d'appel de marge pour être en dessous de l'exigence).\n3. Je choisis ensuite d'utiliser la marge, en achetant 10 actions supplémentaires de l'action XXX pour 100 $ chacune, de sorte que je dispose maintenant de 20 actions de l'action XXX, évaluées à 100 $ chacune.\n4. Si le prix de l'action XXX baisse de 25 %, ce qui ramène la valeur par action à 75 $, la valeur de ma position totale est maintenant de 1 500 $, et la valeur de mes actifs sans marge est de 750 $, ce qui est inférieur à la marge requise (n'oubliez pas que j'ai emprunté 1 000 $, et que c'est donc toujours le montant que je dois rembourser).\n5. Mon prêteur va me donner un appel de marge, m'indiquant que j'ai deux jours ouvrables pour déposer 50 $ sur mon compte afin de satisfaire à l'exigence de marge.\n\na. Si j'ai de l'argent liquide à déposer, les 50 $ supplémentaires porteraient mes actifs à 800 $ (750 $ en actions XXX + 50 $ en espèces).\n\ni. Si le prix de l'action XXX remonte à plus de 80 dollars par action, il pourrait également satisfaire à l'exigence\n\nb. Si je n'ai pas de liquidités à déposer, je suis dans le pétrin, car après deux jours, ils sont autorisés à liquider (vendre) les actifs que j'ai achetés avec mon propre argent, ainsi que les actifs que j'ai achetés sur marge.\n\ni. Supposons que cela se produise, tous mes actifs empruntés sont vendus en premier pour couvrir mon prêt de 1000 $ (puisque le prix de l'action XXX n'était que de 750 $, il ne couvre que 750 $ de ma marge de 1000 $).\n\nii. Il me reste maintenant 750 $ d'actifs de l'action X, mais je dois encore de l'argent sur la marge, donc mon prêteur a le droit de vendre 250 $ de mes actions afin de récupérer la totalité de ses 1000 $.\n\niii. Il me reste maintenant 500 $ au total (750 $ en 10 actions XXX - 250 $).\n\n6. Pas cool\n\n**PERTES : Positions courtes et longues**\n\n**C'EST CE QUI CONCERNE GME**\n\n1. Imaginons que j'aie 1 000 dollars d'actions XXX (disons 10 actions de 100 dollars chacune).\n2. Mon courtier peut me prêter une ligne de crédit de marge égale à la valeur de mes actifs (donc 1000 $ de marge), et disons qu'il me donne une exigence de marge de 800 $, ce qui signifie que la valeur de mes actifs sans marge (ceux que j'ai achetés avec mon argent) doit être supérieure à 800 $ pour pouvoir continuer à utiliser la marge.\n3. Au lieu d'utiliser la marge pour acheter davantage, je vendrai à découvert 10 actions de la société YYY, dont le cours est actuellement de 50 dollars par action (ce qui me donne 500 dollars de liquidités supplémentaires), que j'utiliserai pour acheter 5 actions supplémentaires de la société X.\n\na. Je suis maintenant acheteur de 15 actions de l'action XXX évaluées à 1500 $ et vendeur de 10 actions de l'action YYY évaluées à -500 $ (500 $ négatifs) pour une valeur nette de 1000 $.\n\nb. Aucune marge n'est activement engagée dans des positions ouvertes, et j'utilise toujours mes 1000 $.\n\n4. Supposons maintenant qu'un [short squeeze](https://fr.wikipedia.org/wiki/Liquidation_forc%C3%A9e_des_positions_courtes) se produise sur l'action Y, faisant monter en flèche le prix de l'action jusqu'à 200 $.\n\na. Ma position courte est maintenant de -2000 $ (10 actions de -200 $ chacune).\n\n5. La valeur nette de mon compte est maintenant de 500 $ (1500 $ - 2000 $), ce qui utilise ma marge. Comme la valeur de mon compte n'est plus supérieure à 800 $, je ne réponds plus aux exigences de marge et je reçois un appel de marge.\n\n6. Si je ne parviens pas à équilibrer mon compte, le prêteur liquidera mes 1 500 dollars d'actions XXX afin de payer les 2 000 dollars que je dois, ce qui me laissera une dette de 500 dollars.\n\na. Je suis maintenant en défaut de paiement, car je ne peux pas payer les 500 $.\n\n7. Maintenant que j'ai fait défaut, le prêteur qui m'a fait crédit possède mes positions courtes, ce qui signifie qu'il est maintenant à découvert sur ce qui restait.\n\na. Le prêteur peut maintenant gérer les positions courtes comme il l'entend (il peut les conserver et espérer que le prix baisse, puis les couvrir pour les fermer, ou il peut les fermer immédiatement, ce qui lui coûtera les 500 dollars que je dois encore).\n\n8. Ouch !\n\n4.4 - Margin Calls Who Calls Who\n\n· Les appels de marge se produisent des niveaux 1 à 4 lorsque la case de gauche ne peut satisfaire aux exigences de marge.\n\no Appels de marge des courtiers Traders de détail\n\no Prime Brokers Margin Call Brokers, Hedge Funds, and Market Makers\n\no Les appels de marge de la NSCC Prime Brokers\n\n· Les défauts de marge se répercutent de gauche à droite.\n\no Si l'opérateur individuel fait défaut, le courtier doit reprendre ses positions restantes.\n\no Si le courtier, le fonds spéculatif ou le teneur de marché fait défaut, le courtier principal doit reprendre les positions restantes.\n\no En cas de défaillance du courtier principal, la NSCC doit prendre position.\n\no Si la NSCC fait défaut, la Fed doit prendre la position\n\nNiveau 1 Niveau 2 Nveau 3 Niveau 4 Niveau 4\n\nCommerçant de détail Courtier Courtier principal NSCC (DTCC) Fédéral (JPOW)\n\nx Teneur de marché Courtier principal NSCC (DTCC) Fédéral (JPOW)\n\nx Fonds spéculatifs Courtier principal NSCC (DTCC) Fédéral (JPOW)\n\n4.5 - Short Squeeze\n\n· Un short squeeze est un événement de marché qui se produit lorsqu'il existe une position courte importante sur une action dont le prix augmente plus rapidement que prévu, normalement en raison d'un catalyseur.\n\n· Pendant le short squeeze, les pertes de ceux qui ont des positions courtes continuent d'augmenter.\n\no Comme ils **possèdent des** actions qu’ils doivent **rendre**, le coût de couverture de leur position augmente en fonction de la hausse du prix (il n'y a théoriquement aucune limite à la hausse d'une action).\n\n· Comme les participants au marché qui sont à découvert sur l'action achètent pour se couvrir, l'offre diminue et la demande augmente, ce qui entraîne une hausse encore plus rapide du prix.\n\n· Alors que les vendeurs à découvert s'efforcent de couvrir leurs positions, la variation rapide du cours peut inciter les investisseurs qui ne sont pas à découvert à acheter l'action afin de réaliser un profit rapide.\n\no Encore une fois, la baisse de l'offre et l'augmentation de la demande\n\nV. The Mother Of All Short Squeezes (MOASS)\n\nExplication\n\nMaintenant que nous avons passé en revue les nombreux termes importants, nous pouvons aborder la théorie du MOASS.\n\nEn raison des ventes à découvert excessives et des ventes à découvert à nu de GME par certains acteurs du marché (principalement les grands fonds spéculatifs et les teneurs de marché), les investisseurs particuliers et les investisseurs institutionnels longs possèdent collectivement un nombre d'actions supérieur à la flotte. On estime que le nombre d'actions actuellement détenues se situe entre **200 % et 400 %** de la flotte\\*\\*, voire plus,\\*\\* ce qui signifie que 100 % à 300 % de la flotte ont une position courte correspondante (principalement des ventes à découvert à nu). Pour situer le contexte, la plupart des actions ont généralement un taux de ventes à découvert d'environ 1 %, et un taux de vente à découvert de 10 à 20 % est considéré comme excessif, sans parler de plus de 100 %.\n\nLes vendeurs à découvert doivent finalement clôturer, ou couvrir, leur position courte.\n\n· Le seul moyen d'y parvenir est d'acheter les actions détenues par les investisseurs qui sont en position longue.\n\no pendant ce temps, les vendeurs à découvert paient des intérêts sur cette position à découvert jusqu'à ce qu'elle soit clôturée, proportionnellement au coût des actions, ce qui sape leur capital au fil du temps.\n\n· Malheureusement pour les vendeurs à découvert, les propriétaires des actions **NE SONT PAS** obligés de vendre leurs actions.\n\no Les vendeurs à découvert, quant à eux, **sont** obligés d'acheter afin de clôturer leur position (ou de continuer à payer des intérêts).\n\nQue se passe-t-il donc si personne ne vend les actions sur lesquelles ils sont \"longs\", mais que les vendeurs à découvert doivent les acheter ?\n\n· L'offre et la demande\n\no Avec une offre très faible et une demande élevée, le prix d'une action peut augmenter bien au-delà de sa valeur fondamentale.\n\no Si les vendeurs à découvert reçoivent un appel de marge parce qu'ils ne satisfont plus à leur exigence de marge et qu'ils ne sont pas en mesure de la satisfaire à temps, leurs actifs seront liquidés de force par leur prêteur afin de rembourser la marge, ainsi que de liquider la position si l'emprunteur fait défaut.\n\nSi vous vous demandez pourquoi une organisation vendrait abusivement à découvert une action comme celle-ci si elle doit finalement couvrir ses positions :\n\n· Si une entreprise fait faillite ou est retirée de la bourse :\n\no Les vendeurs à découvert ne sont pas obligés de clôturer leur position.\n\no Tous les produits de la vente à découvert disparaissent effectivement de leurs livres.\n\no Ils ne doivent même pas payer d'impôts sur ces bénéfices.\n\nLes positions courtes correspondent au nombre total de positions longues moins la flotte, ce qui signifie (sur la base d’une fourchette théorique) qu'il leur faudra acheter entre 56 et 170 millions d'actions pour clôturer toutes les positions courtes.\n\n· On s'attend à ce que les membres ayant des positions courtes (fonds spéculatifs et teneurs de marché qui ont vendu des actions à découvert) soient incapables de couvrir leurs positions courtes, ce qui entraînera une situation où leurs prêteurs, jusqu'à la chambre de compensation (DTCC), devront gérer ces positions.\n\n· Si la DTCC/NSCC est obligée de gérer les positions, il est généralement admis qu'elle couvrira rapidement les positions courtes à n'importe quel prix disponible (c'est ainsi que ses systèmes sont censés gérer la défaillance d'un membre), en liquidant tous les actifs nécessaires du membre défaillant.\n\nConsidération\n\nIl s'agit d'une situation totalement inédite, de sorte qu'en vérité, il y a beaucoup d'incertitude sur ce qu’il va se passer une fois que les Prime Brokers (les grandes banques) et la NSCC devront gérer la situation, ainsi que sur la hauteur du pic de prix qui sera atteint. Il existe un risque réel d'impact négatif généralisé sur l'ensemble du marché en raison de cette situation.\n\nJe pense que l'on peut supposer que certaines choses sont sûres :\n\n· Avant qu'il ne se passe quoi que ce soit qui puisse plafonner ou affecter négativement le MOASS, tous les fonds spéculatifs et les teneurs de marché qui ont conspiré pour manipuler le marché auront probablement été mis en faillite et éliminés du paysage du marché à ce moment-là.\n\n· Les Prime Brokers auront reçu un coup dur (comme le Credit Suisse après l'effondrement d'Archegos, mais en bien pire) qui, espérons-le, devrait permettre aux régulateurs de combler toutes les lacunes qui ont été exploitées pour manipuler le marché et lui porter préjudice.\n\n· Le pic sera plus élevé que n'importe quel autre short squeeze dans l'histoire et ne sera probablement jamais battu à l'avenir (JAMAIS).\n\nVI. Dernières réflexions...\n\nCeci est la thèse du MOASS. GME est une action qui va atteindre un niveau de prix sans précédent car les manipulateurs du marché n'ont pas réussi à mettre GameStop en faillite, en grande partie grâce au [légendaire Keith Gill, alias u/DeepFuckingValue.](https://en.wikipedia.org/wiki/Keith_Gill) [Ryan Cohen](https://en.wikipedia.org/wiki/Ryan_Cohen), [Michael Burry](https://en.wikipedia.org/wiki/Michael_Burry)\n\net tous les investisseurs de GME qui ont pris part à cette saga. Ce ne sera peut-être pas aujourd'hui, ni cette semaine, ni même ce mois-ci, mais un jour prochain, ces participants toxiques n'auront d'autre choix que d'acheter les titres pour liquider leurs positions courtes.\n\nDans certaines écoles de pensée, on pense que ces participants ont surestimé le caractère \"raisonnable\" des investisseurs particuliers (qui pourrait être assez stupide pour conserver une action alors qu'elle est passée de près de 500 dollars à 40 dollars ?) En vérité, ces manipulateurs n'ont pas compris le groupe démographique avec lequel ils se battaient. Les gamers font partie des personnes les plus têtues de la planète. Ils sont prêts à passer des dizaines de milliers d'heures sur un même jeu vidéo parce qu'ils l'aiment. Eh bien, \"nous aimons l'action\", et pour nous, les adversaires de Wall Street ne sont qu'un \"boss\" de plus. On a peut-être dû réessayer plusieurs fois, mais on finit toujours par gagner. En plus de cela, ils ont énervé Reddit, et en aucun cas, vous ne devez énerver Reddit.\n\nÀ ce stade, si vous lisez encore ces lignes, sachez que c'est à vous de décider de votre prochaine action, qu'il s'agisse de faire votre propre analyse préalable, de vous retirer ou d'acheter quelques actions (ou beaucoup d'actions) au cas où nous aurions raison. Beaucoup d'entre nous ont fixé leur plancher (montant minimum de gains acceptables) à 20 000 000 $ (c’est 30 à l’heure où je traduis) par action, et vous pouvez penser que c'est fou, mais en vérité, nous savons que nous pouvons choisir notre propre prix si nous tenons assez longtemps. Nous ne nous soucions pas de savoir si quelqu'un d'autre achète ou non, car nous savons que le résultat est inévitable. Le temps presse pour les acteurs du marché toxique concernés, et même les médias ne peuvent cacher que nous sommes à la veille d'un événement de marché massif qui se répercutera sur l'ensemble du système financier mondial, et que nous ne verrons probablement plus jamais un tel événement de notre vivant.\n\nIl s'agit d'**un combat que Wall Street, Shitadel, Melvin Capital et tous les autres partis toxiques ne gagneront pas**. Il y a de fortes chances que ce soit vraiment \"**LE MOASS\"**, c'est-à-dire qu'il n'y en aura jamais un autre comme celui-là de notre vivant (ou jamais). Alors que les conditions en jeu (la capacité des grandes fortunes à manipuler brutalement le marché) ont permis ce qui pourrait être le plus grand transfert de richesse de l'histoire, une réforme réelle pour empêcher qu'un tel paysage ne se forme à nouveau est probablement une bonne chose à long terme (je dis cela en tant que pragmatique, et je suis honnêtement très loin d'être un idéaliste). Si vous voulez influencer la réforme du système, achetez, tenez et attachez vos ceintures. Si vous êtes juste là pour les zéros, Achetez, Tenez et Attachés vos ceintures !\n\nVII. TL;DR\n\n1. Les participants au marché toxique ont accumulé des [positions courtes ](https://www.investopedia.com/terms/s/short.asp)massives.\n\nréalisés par le biais du [Naked Shorting](https://www.investopedia.com/terms/n/nakedshorting.asp)\n\n2. Le secteur de la vente au détail a adopté cette stratégie et a découvert qu'elle pouvait se retourner contre lui si la société faisant l'objet de la vente à découvert ne faisait pas faillite, surtout si les actions étaient achetées et conservées indéfiniment.\n\n3. Les règles et réglementations mises en œuvre par la DTCC et ses filiales ont pour but d'empêcher l'effondrement du marché et de réduire au minimum la possibilité de réaliser des transactions illégales (naked shorting).\n\n4. La SEC fait également plus pour faire respecter les \"règles\".\n\n5. Les manipulateurs sont à la merci d'un cycle commercial vicieux (cycle FTD t+21) qui oblige ceux qui ont des positions courtes nues à effectuer des actions de [couverture.](https://www.investopedia.com/terms/s/shortcovering.asp)\n\n(racheter les actions qui sont à découvert), ou risquer des conséquences réglementaires\n\n6. Cet acte de couverture rapide fait grimper le prix, ce qui rend la couverture plus coûteuse au cours du cycle suivant si le prix de l'action continue à augmenter d'une semaine à l'autre.\n\n7. Les prix des GME finiront par être si élevés que les courtiers principaux et les chambres de compensation n'auront d'autre choix que de procéder à des [appels de marge.](https://www.investopedia.com/terms/m/margincall.asp)\n\nces participants, qui ne seront très probablement pas abordables en raison de la nature des [Short Squeezes.](https://www.investopedia.com/terms/s/shortsqueeze.asp)\n\nce qui les met en défaut\n\n8. Les [Prime-Brokers](https://www.investopedia.com/terms/p/primebrokerage.asp)\n\nSi les Prime Brokers ne peuvent pas les couvrir et sont également en défaut, la NSCC sera la suivante à tenter de régler toutes les positions restantes sur la base de son [plan de redressement et de liquidation (p42).](https://www.dtcc.com/~/media/Files/Downloads/legal/policy-and-compliance/NSCC_Disclosure_Framework.pdf)\n\n9. Si la NSCC ne peut pas se permettre de tout clôturer avec l'argent réservé à ce type de situation, la Fed doit gérer les positions restantes (potentiellement via l'impression d'argent/le renflouement).\n\nVIII. STILL TL;DR\n\nLes appels de marge se produisent sur l'ensemble du marché et obligent tous les acteurs du marché ayant des positions courtes sur GME à se couvrir ou à faire faillite s'ils n'en ont pas les moyens. Les systèmes de la NSCC qui règlent les positions après les défauts de paiement massifs liquident tous les fonds spéculatifs à découvert et couvrent autant de GME que possible. Si la NSCC ne peut pas tout payer, c'est à la Fed et au JPOW d'imprimer de l'argent pour régler les transactions.",
    "title": "$GME – “Mother of All Short Squeezes” (MOASS) Thesis, FRENCH edition. Credit goes to a rogue lurker ape that I was to only refer to publicly as \"The Baguette Guy\". So, for our French Audience, you have The Baguette Guy to thank for this translation. Prendre Plaisir (Enjoy) 😎",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/odpdde/gme_mother_of_all_short_squeezes_moass_thesis/"
}