{
    "author": "iNogle",
    "created_utc": 1622743555.0,
    "distinguished": null,
    "edited": 1622760401.0,
    "id": "nrjtdw",
    "text_only": true,
    "flair_text": "Fluff ☁",
    "name": "t3_nrjtdw",
    "num_comments": 38,
    "permalink": "/r/Superstonk/comments/nrjtdw/twas_the_night_before_moass/",
    "score": 540,
    "selftext": "'Twas the night before MOASS and though it was late  \r\nJust one creature was stirring, awake sat an ape  \r\nThe stocks were all purchased from the brokers with care  \r\nIn hopes that the tendieman soon would be there  \n  \r\nThe chimplings were nestled all snug in their beds  \r\nWhile visions of lambos danced in their heads  \r\nMy wife was satisfied by her boyfriend's cock  \r\nWhile I stayed up all night to watch the ticks of the stock  \n  \r\nWhen out on the ticker there arose such a candle  \r\nHad the hedgies finally been caught in their scandal?  \r\nI opened up r/superstonk in a flash  \r\nAnd saw FUD from the shills about a stock crash  \n  \r\nI checked that I had one more order to buy  \r\nMy 💎👐 would stop shills, whatever they try  \r\nWhen what to my wandering eyes did appear  \r\nBut a rocket 🚀 with a sign saying \"Apes Enter Here\"  \n\r\nWhen I saw the red bandana I knew  \r\nThis pilot here was Deep Fucking Value  \r\nMore rapid than eagles the rocket 🚀ascended  \r\nAnd he whistled, and shouted, and yelled the hedgies were ended:  \n\r\n\"Fuck Kenny! Fuck Vlad!  \r\nAnd fuck Robbinghood!  \r\nFuck Shitadel, Melvin,  \r\nAnd all of their brood!  \n\r\nTo the top of the moon!\" And the price, yes it rose  \r\n\"Now apes buy and hodl! Let the squeeze be squoze!  \r\nAs leaves that before the wild hurricane fly  \r\nWhen they meet with an obstacle, mount to the sky  \n\r\nSo right past $10,000 the stonk price did rise  \r\nMoving so fast it left tears in my eyes  \r\nAnd then, in my smooth brain, I heard a voice  \r\n\"The DD was right! It's time to rejoice!\"  \n  \r\nAs I snacked on my crayons, the rocket 🚀 in motion  \r\nI looked to my left and saw Ryan Cohen  \r\nHe was dressed all in fur, from his head to his foot  \r\nThe man was dressed up in an ape suit  \n\r\n\"The votes are in,\" said he, \"690%!  \r\nHedgies r fukd - they won't be left with a cent!\"  \r\nHis eyes - how they twinkled! His memes, so merry!  \r\nHis cheeks were like ice cream 🍦 topped with a cherry!  \n\r\nHis grinning mouth was drawn up in a bow  \r\nAnd the beard on his chin was as black as it could go  \r\nHis IPhone he held tight in his right hand  \r\nI knew one tweet would send apes to tendieland  \n\r\nHis had a slim face and perfect, groomed hair  \r\nThat shook when he laughed, like the price of a share  \r\nHe was clever and wise, a right cunning short wrecker  \r\nI cheered when I saw him and felt better and better  \n  \r\nA wink of his eye, and a twist of his head  \r\nSoon gave me to know I had nothing to dread  \r\nHe spoke no more words, but went straight to work  \r\nHe tweeted just \"🚀\", then sat back with a smirk  \n  \r\n7 digits now! 8! A superstonk like no other!  \r\nMargin had called! Hedgies were trying to cover!  \r\nHe called to DFV and gave him a whistle,  \r\nAnd apes all flew up like the down of a thistle  \n  \r\nAnd I heard them exclaim, now apes knew they were right-  \r\n\"Happy MOASS to all, apes have won the fight!\".",
    "title": "'Twas the night before MOASS...",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/Superstonk/comments/nrjtdw/twas_the_night_before_moass/"
}