{
    "author": "Long-Setting",
    "created_utc": 1621989163.0,
    "distinguished": null,
    "edited": false,
    "id": "nl453o",
    "text_only": true,
    "flair_id": "37ec242e-984f-11eb-94c6-0e8d0acce789",
    "flair_text": "Education 👨‍🏫 | Data 🔢",
    "name": "t3_nl453o",
    "num_comments": 137,
    "permalink": "/r/Superstonk/comments/nl453o/old_post_why_a_crypto_dividend_would_end_all/",
    "score": 2661,
    "selftext": "Last year **Overstock ($OSTK)** issued a crypto dividend (hmm, wonder why GME paid off all its debts early, they can now issue dividends). \n\nBy creating a custom crypto dividend this would force **ALL** shorts to cover due to the fact *Ole Ken sucks toes, Melvin gobbles gilfs, and Vlad the queer beer* wouldn’t be able to provide the crypto as *only GameStop could provide the crypto.*\n\nSo let’s do some simple meth *ahem* I meant math 😳 on Overstocks little teaspoon of a comparison fucking squeeze. \n\n$OSTK on March 13, 2020 was trading for **$3.23** and just five months later on August 21, 2020 it went up to a *juicy* **$121.09** damn that’s a sexy squeeze right? 🌚\n\n[Overstock before the squizzle ](https://imgur.com/gallery/mDUE43j) \n\n[Overstock after the squizzle](https://imgur.com/a/IqxHQnR) \n\nWell guess fucking *what* mate the short interest was only fucking 13.8%...there was **5.8 million shares shorted out of 42 million** \n\nSo that’s a *3,749%* increase in price.\n\n*Hehehe, here’s where the fun begins*\n\nSo let’s take the minimum amount of short interest we have based off institutional holdings and all other calculations us *wrinkle brained chimpino apes have done* and let’s assume the minimum short interest calculation we have to work with is only **140%.**\n\nNow we’d have a **38,033.33% increase at GameStops current fucking price.**\n\nAfter hours close as of 4/16 is at $160.99 so using these calculations for the **minimum** projected squeeze target is **$61,229.33**.\n*Hot damn this isn’t even including FTDs, OTC shares, all the other bullshit hedgies have thrown into our glorious oven where the tendies are being fucking baked and seasoned to perfection.* **Assuming all the other seasonings for our tendies our projections of 1-10-100 million are NOT “unrealistic targets.”**\n\n\nNow let’s also take a look at the ticker **$DGAZF**\n\nThe stock had a short interest of **45%** and went from a mere $400 a share all the way up to **$25,000** a share.\n\n[DGAZF Squizzle dawg 😎](https://imgur.com/a/9JUYdra) \n\nSo, take a chill pill, a boner pill, maybe some whiskey or rum, or suck a big 🐔 (*if you’re a shill*) and wait for the **largest redistribution of wealth in history to occur.**\n\nI also want to discuss how there’s a large influx of shill posts trying to stir drama for no reason or karma farming posts that have no true worth. *Take a step back before posting and ask whether we can take something away from your post or you’re just going on a pointless rant.*\n\n**Let’s get something very clear: when someone says that their FLOOR is XXXXXX that does NOT mean it is the CEILING, PLEASE KNOW THE DIFFERENCE BETWEEN A FLOOR AND A CEILING.**\n\n*Thank you DFV for staying true and giving the 99% hope. I’ve lost my job this pandemic and it’s been tough mentally but once this rocket takes off I will never forget the unity we’ve had on this sub...I will get a tattoo as remembrance once we hit over $25,000. I vow to make the world a better place, as well as many other 💎🙌🦍 So cheers everybody, here’s to new beginnings, a brighter future for the world as we know it, and let’s never forget where we came from.*",
    "title": "(OLD POST) Why a crypto dividend would end all shorts…I posted this 35 days ago ;) Short Squeeze History 👨‍🚀🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nl453o/old_post_why_a_crypto_dividend_would_end_all/"
}