{
    "author": "Insertions_Coma",
    "created_utc": 1621478794.0,
    "distinguished": null,
    "edited": 1621483440.0,
    "id": "ngoodu",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ngoodu",
    "num_comments": 196,
    "permalink": "/r/Superstonk/comments/ngoodu/dfvs_cat_uno_tweet_and_what_he_was_trying_to_tell/",
    "score": 2260,
    "selftext": "First off I bet you are wondering how you could possibly have a DD post on a tweet. Well, the tweet in question is the one tweet from DFV that I believe he was trying to drop us a major hint on what he is looking at. But nobody here seemed to ever be able to decipher it.\n\nI believe I have deciphered it, and you won't believe what I found after months of pondering this tweet. This is not just simply confirmation bias. This is decoding the tweet and then researching what data we have to support it.\n\n[DFV Tweet 4\\/9](https://preview.redd.it/ry2vy4qod6071.png?width=1500&format=png&auto=webp&s=fd5a55a8bc9c62e44a77a303d34dfd529527df16)\n\n# First, we will start off with the obvious.\n\nEdit: [But also first, I discovered something not so obvious. The cards shown are directly cropped from google images. However, I still believe they can mean something, and well if I'm wrong then at least you got to join me in tin foil hat land for a minute.](https://www.reddit.com/r/Superstonk/comments/mo1pfh/i_am_here_to_burst_your_bubble_analysing_dfvs/)\n\nOn the table of cards already played (which represents the past), we have in the order they would have been played:\n\nGreen reverse = Stonk rises\n\n2 = February\n\n2,4 = 24th\n\nWILD CARD = The definition of a wild card outside of UNO is, \"a person or thing whose influence is unpredictable or whose qualities are uncertain.\" This could have several meanings in this context, but I'll leave that up to you. Read on later and help me decide.\n\nSo what's the final message on the table? The stock had a large price rise on 2/24 due to the unknown entity (citadel/shorters I'm guessing), or outside force. I think this is an easy message to draw from this.\n\n# Next, we move onto the cards in the cat's hand.\n\nEdit: [It has come to my attention that this image was used in the cats hand. Therefore, the cards were not hand picked by DFV.](https://www.reddit.com/r/Superstonk/comments/ngoodu/dfvs_cat_uno_tweet_and_what_he_was_trying_to_tell/gys2o81?utm_source=share&utm_medium=web2x&context=3)\n\nI am pretty certain these are meant to be read left to right. So we have:\n\n\\+21 = To me this clearly references the 21 FTD cycle as 2/24 mentioned in the cards already played was the first FTD reset and the 21 FTD cycle is one of the bigger things we look at on this sub.\n\nWILD CARD = Same meaning from above. Unknown entity influence (possibly Citadel/shorters)\n\nNow this is where I struggled for the longest time. Next, we have a 6 and a draw 4 (+4). I really think the simplest explanation is the best one here. I believe it literally means 6 + 4 = 10. I couldn't figure out why the number 10 for the longest time until I started playing around with the chart. Stay with me here.\n\nhttps://preview.redd.it/qmoreqqd76071.png?width=1098&format=png&auto=webp&s=ec0c0366247992faf94ab7cbf211810b8c26bdce\n\nThe blue lines are the 21 day FTD cycle, and the orange lines are the 21+10 days. I believe DFV is pointing out the 21 day FTD cycle that ended/started on 2/24, and that on the 10th day after we had a huge hit down in price.\n\nWhat really makes this interesting, is the day DFV tweeted the cats playing UNO.\n\n**DFV tweeted the cats playing UNO on 4/9, the second time we hit the 21 day FTD cycle +10 days**. I believe he did so because he had a theory, and once proven gave us this massive cryptic hint.\n\nAlso:\n\n[Look what else he posted on 4\\/9 just before the cats playing UNO. \\\\\"What do we say to the god of death?\\\\\" \\\\\"Not today\\\\\"](https://preview.redd.it/5vrxppelu6071.png?width=601&format=png&auto=webp&s=cdb18a8d1ee30766089a85b6fca74d146e6fadd9)\n\n&#x200B;\n\nSo this really got me thinking. What the hell is happening on these +10 days?\n\nThey are all days we saw, relative to the time period, massive attacks on the price. Why would we see attacks on the price so periodically? Well, I believe it's to meet some kind of risk/capital/margin requirement by lowering the price so that the calculation isn't underwater.\n\nhttps://preview.redd.it/cm5dqotls6071.png?width=1097&format=png&auto=webp&s=4b8f60ce431b48363529cac6941ae5483c43b78e\n\nIf we assume that the orange days are the days they need to meet risk requirements in order to avoid a margin call, then we can also assume that the lows on those days are the number they needed the stock at to avoid liquidation from too much risk. For shits and giggles, trending this, we get the pink line.\n\n# Which I found stunning that it plotted a straight line.\n\nThe yellow line is the higher lows. This is where the support from retail buying and holding can be tracked.\n\nI find it frankly amazing that **the intersection of these two is right around 5/10 when we broke out of our major 5-month wedge** that I'm sure you've all heard about. Since then we have been stair-stepping upwards in a really nice way.\n\nMy takeaway? **I believe the hedge funds have been overrun. They no longer have the capacity to keep the price down at the level they need in order to meet their risk requirements to avoid liquidation.**\n\nNow, I bet you are wondering what is the risk requirement they are needing to meet on these days. I am also wondering this myself, and I believe I may have an answer, but I am not well versed in the area of the trading matrix, and its rules and obligations. So I really would like to see if anyone can expand on this or has a different explanation.\n\n# The Liquidation Horizon\n\nThere is one particular rule that I found about a 10-day Liquidation Horizon that is enforced by the [International Derivatives and Swaps Association (ISDA)](https://en.wikipedia.org/wiki/International_Swaps_and_Derivatives_Association). As the name suggests, this is an organization that facilitates and monitors derivative and swap transactions. ISDA has more than 925 members in 75 countries; its membership consists of derivatives dealers, service providers, and end-users. Googling Citadel and ISDA shows that Citadel definitely uses them, but beyond that, I'm a bit lost.\n\n**The Liquidation Horizon rule deals with Non-Cleared OTC Derivatives.**\n\nSo firstly, What is a non-cleared OTC Derivative?\n\n[A derivative is a security with a price that is dependent upon or derived from one or more underlying assets. Its value is determined by fluctuations in the underlying asset. The most common underlying assets include stocks, bonds, commodities, currencies, interest rates, and market indexes. Depending on where derivatives trade, they can be classified as over-the-counter or exchange-traded (listed).](https://www.investopedia.com/ask/answers/052815/what-overthecounter-derivative.asp)\n\nNon-Clearing simply means that a clearinghouse is not used for the transaction and therefore you can (from my understanding), for lack of better words, bounce checks.\n\nSo to sum up, it's OTC transactions that are privately facilitated between both parties without the use of a clearinghouse.\n\n# Back to the Liquidation Horizon.\n\nThese are some snippets [from here](http://assets.isda.org/media/7dd1c040/8cc1a146-pdf/), and the author points out some of the problems with the current 10-Day Horizon. Worth the full read.\n\n*\" The BCBS-IOSCO guidelines (BCBS-IOSCO, 2015) define the Initial Margin requirement as an amount that “covers potential future exposure for the expected time between the last variable margin exchange and the liquidation of positions on the default of a counterparty”. It is further specified that the calculation of this potential future exposure “should reflect an extreme but plausible estimate of an increase in the value of the instrument that is consistent with a one-tailed 99% confidence interval over a 10-day horizon, based on historical data that incorporates a period of significant financial stress.*\n\n*The guidelines propose two methods for computing Initial Margin requirements for non-cleared derivatives. The first method, called the standard schedule approach, computes Initial Margin proportionally to the notional size of the contract, applying precalibrated weights linked to the type and maturity of each asset. These weights represent conservative estimates for the 10-day 99% loss quantile for a directional position in a typical index in each asset class.*\n\n*Regardless of how these weights have been calibrated, such an approach is clearly not risk-sensitive: it does not properly account for netting and hedging effects, nor does it distinguish between an at-the-money option from a deep out-of-the-money one. It therefore typically leads to an overestimation of margin requirements and, more importantly, as the level of Initial Margin does not vary proportionally with any reasonable risk measure of the position, it does not provide the correct risk management incentives to the counterparties. Presumably, its main purpose is to serve as a (costly) fallback option and motivate market participants to use the alternative internal model approach.\"*\n\nOptions you say? Hmmm... last time I checked hedge funds were hiding their FTD's in options contracts because the question of where the underlying stocks are is never asked by the counter-party in the transaction.\n\nAnother interesting quote is the one below. Could this also have to do with margin requirements with the banks?\n\n*\"Although the choice of the internal model is left to market participants, the horizon of the calculation, sometimes designated as the margin period of risk (MPOR), is not: it is fixed to 10 days, which is twice the horizon used for centrally cleared swap contracts (5 days). The rationale for this choice can be traced back to the minimum risk horizon of 10 days used in the Fundamental Review of the Trading Book (FRTB) guidelines (BCBS, 2014) for the determination of bank capital requirements.*\n\n*As explicitly stated in the CFTC final rules: “To the extent that related capital rules which also mitigate counterparty credit risk similarly require a 10-day close-out period assumption, the Commission’s view is that a 10-day close-out period assumption for margin purposes is appropriate.” It is noteworthy that the referenced capital rules do not offer a rationale for the choice of a 10-day horizon. \"*\n\n# Continuing on...\n\n*\" As pointed out in (Avellaneda & Cont, 2013) and (Cont, 2015),* ***the appropriate closeout horizon for a position depends on the size of the position relative to the daily trading volume or, for an OTC contract, the typical trade size.*** *For example, if the size of the position is of the order of magnitude of a typical trade or less than, say, 10% of daily volume, it may be feasible to unwind it in a single day. On the other hand, if a market participant has accumulated a very large position in some instrument, corresponding to, say, 5 times the average daily trading volume, it may not be feasible to unwind it in 5 or even 10 days, whether or not this instrument is cleared by a CCP. So, the determinant of the liquidation horizon is not the ‘market liquidity’ of the asset viewed in isolation, but the size of the position relative to the market depth. Such examples of large concentrated positions are not hypothetical and have been associated with large liquidation losses in financial institutions (see e.g. Cont & Wagalath, 2016).  \"*\n\nRead that again, \"***the appropriate closeout horizon for a position depends on the size of the position relative to the daily trading volume or, for an OTC contract, the typical trade size.\"***\n\nYa know, I kinda recall seeing a few posts about [low trade size in OTC markets](https://www.reddit.com/r/Superstonk/comments/n5qp96/ama_followup/)... /s\n\n[Courtesy of David Lauer himself](https://preview.redd.it/k38yriexm6071.png?width=1219&format=png&auto=webp&s=17a23251a3ad9f0e7ed4bed54a8b23485b3610f4)\n\nu/dlauer notes that the overall volume of OTC has not increased, however, the transaction size has dropped massively. **According to the calculation to determine OTC risk, the smaller the trades, the less margin requirement you will have.**\n\nSo what happens when a party does not meet the requirement of the liquidation horizon calculation?\n\n*\" When a clearing participant in a CCP defaults, the default management procedure requires the CCP to liquidate the position of the defaulted clearing participant, usually through an auction procedure. The liquidation horizon considered for IM calculations is supposed to correspond to the duration required for the CCP to take notice of the default and set up the auction process. The auction usually needs to take place in the week following the default event and the CCP does not have the option of retaining these positions beyond the liquidation horizon, as stipulated in the CCP’s default management procedure. Any market loss incurred on the positions of the defaulted member between the default date and the liquidation date thus flows to the CCP. Therefore, a measure of the market risk exposure of the member’s portfolio over the liquidation horizon, for example using a 99% VaR or expected shortfall measure, seems a reasonable basis for quantifying the actual exposure of the CCP during closeout. Indeed, this approach is used by many CCPs for computing IM. \"*\n\nI am going to have to cut this short as I could keep going down this rabbit hole longer, but I think I have shown some interesting things to think about. Again, I am not well versed in the gears that turn the machine, so please take the Liquidation Horizon thing with a grain of salt until more wrinkly-brained apes chime in.\n\n# Summary:\n\nUnfortunately, I am really unsure on how to wrap this up into a TLDR as the bit about the Liquidation Horizon is something I've just been looking into today. That being said, there does seem to be quite a bit of empirical evidence that backs up DFV's tweet, and the conjecture from the Liquidation Horizon does seem to back up David Lauer's data. I know it is a bit of a bland read in the second half, but trust me it's worth the read.\n\nIt seems clear to me that Citadel and friends no longer have the ability to keep the price down enough in order to meet their margin requirements for their OTC derivatives. Therefore, they may be subject to liquidation of their options positions.\n\nI am completely open to *constructive* criticism and if anything in here is proven to be wrong, I will make edits as best as I can. I'm just some dude.\n\nEdit 1: For some extra tit-jacking, here is [Ryan Cohens Tweet from today.](https://twitter.com/ryancohen/status/1395047208748261379) A heart emoji. Also expressed as < 3, or in English, less than three. Less than 3 what, Ryan? Tradng Days?\n\nTit-jacking edit 2: [Here is RC's tweet referencing 10 days.](https://www.reddit.com/r/Superstonk/comments/ngoodu/dfvs_cat_uno_tweet_and_what_he_was_trying_to_tell/gys6tey?utm_source=share&utm_medium=web2x&context=3)",
    "title": "DFV's Cat Uno Tweet, and What he was Trying to Tell us About the 21 FTD Cycle - FTD Cycle Finally Explained DD",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/Superstonk/comments/ngoodu/dfvs_cat_uno_tweet_and_what_he_was_trying_to_tell/"
}