{
    "author": "AlexanderHood",
    "created_utc": 1621480488.0,
    "distinguished": null,
    "edited": 1621488823.0,
    "id": "ngp969",
    "text_only": true,
    "flair_text": "DD 👨‍🔬",
    "name": "t3_ngp969",
    "num_comments": 144,
    "permalink": "/r/Superstonk/comments/ngp969/may_19th_update_on_the_marriedput_forensic/",
    "score": 2379,
    "selftext": "If you're feeling blue cause of all the red, I have some confirmation for your bias right here. :)\n\nYou shouldn't need it, cause the [004](https://www.sec.gov/rules/sro/occ.htm) news should have every part of your body totally jacked.\n\nSince we just had such a blood-red day I wanted to check the current option Open Interest to see how much of todays selling pressure was from Naked Shorting. Well, we know Apes certainly aren't selling, so its gotta be bare nekkid!\n\nThis is an update to my previous post on Married-Put Remnant Forensics [here.](https://www.reddit.com/r/Superstonk/comments/nacqtm/may_update_on_the_marriedput_forensic_analysis/) If you haven't read that, read it first for the context of this post.\n\n**TLDR** Short Interest increased by another 5% last week to 155% of the float and there may be even more shorts hiding in short-term put options for an additional 17% short interest.\n\nNo, seriously, go back and read that first one then come back.\n\nLet's go!\n\n**Updated Calculated Short Interest from Married-Put Remnants**\n\nGME Shares outstanding: 70.77M\n\nGME Float: 47.75M\n\nIrrational Puts from now until Jan 2023:\n\nOption Expiry | Open Interest Apr 18 | Open Interest May 11 | Open Interest May 28\n:--|:--|:--|:--\nApr 16 | 7,067 | 0 | 0\nApr 30 | 6,124 | 0 | 0\nMay 14 | 135 | 683 | 0\nMay 21 | 3,648 | 3,990 | 0\nMay 28 | 150 | 412 | 484\nJun 4 | 0 | 64 | 211\nJun 11 | 0 | 11 | 108\nJun 18 | 0 | 1,046 | 1,458\nJun 25 | 0 | 13 | 28\nJul 16 | 299,922 | 303,927 | 303,679\nOct 15 | 14,736\t| 19,223 | 19,285\nNov 19 | 22,760 | 22,601 | 22,527\nJan 21, 2022| 220,355 | 224,653 | 226,991\nJan 20, 2023 | 43,984 | 46,136 | 45,859\nTotal puts | 619, 458 | 622,769 | 624,608\nShares short | 61.88M | **62.27M** | **62.46M**\n\n**Ok, what does fox say?**\n\nThe number of naked short shares implied by Married Put remnants has increased by the equivalent 184,900 shares in just the last week.\n\n* Ortex has 'exchange reported' Short Interest at 11.82M shares.\n\n* 4,600 put contracts have expired since the previous post but there is still a net *increase* of 1,839 contracts.\n\n* Combining the calculated Naked Short interest of 62.46M with the official 11.82M short interest, we get 74.28M shares short or *155.6% SI*.\n\nSo, the Short Interest has *increased* by another ~5% over the last week while GME went from $146 to $168. (Wow. Apes are crushing!)\n\n\n**The Great Put Embiggening**\n\nThanks to u/Full_Option_8067 for digging up the options chain from January! \n\nBack on January 15th the open interest for sub $20 Jan 2022 Puts was 22,278 which today has over 223,653 puts.\nThe March sub $20 Puts was 29,374 and today that has ballooned to 224,653 puts. \n\nYup. No real suprise here, the baby-squeeze on Jan 28th sorta marked the beginning of the marry-them-puts shenannigans to drive the price action down down down. \n\nCould this indicate naked shorting was occuring back in Jan? Possibly and probably. Certainly not to the extent it is today or at least the means to short GME were not predominantly Married-Put naked shorting. \n\n\n**The Wedding Planner**\n\nConsidering the Put part of a Married-Put trade is NEVER gonna be used, it makes sense to minimize the cost the these types of puts. If you look at the January 2022 put options, the $0.50 strike costs just 2 cents! Two freaking cents! I guess even hedgies don't like throwing money away if they don't have to.\n\nThis explains why the pattern for these is densely clustered around just two Option dates a super-low-strikes. July 16th and Jan 21, 2022. These are the most cost-effective places to dump irrational puts. Only one problem, they stick out like a sore thumb. This got me thinking, where else can they hide shorts?\n\n\n**When you make an Assumption ...**\n\nWhen I wrote my original post on this topic I picked $20 as the cutoff strike price to delimit rational from irrational puts. I did that by eyeballing the double-distribution of puts across the Option Expiry dates and found a valley. Normal stocks don't have such exaggerated double humps and instead call/put action *generally* creates a nice camel hump pattern around the current stock price with the sporradic YOLO or fatfinger bet outliers.\n\nThat was a bad assumption and the more correct way to do it would be to define irrational puts by their implied volatility or more directly by their cost-effectiveness, knowing that anything spent on the cost of that put option is totally written off.\n\nBUT, you can't just load up on *half a million* $0.01 put options in July at a $0.50 strike! That's gonna stand out like a big turd on the sidewalk, apes or somebody might notice that. You gotta spread those puts around a bit. So they grabbed 148k at $0.50 strike, 30k more at the $1.00 strike and well ... that's really not very well spread out. In thier defense, only the July 16 and Jan 21, 2022 Option Expiry dates have these ridiculous strikes so if there really wasn't a lot of other places to spread these turds out. \n\n**Shotgun Weddings**\n\nAfter snorting a few more crayons and reconsidering what an 'irrational put' is defined as, the next most obvious place to look was ANY puts that are really cost-effective with high-implied volality. (i.e. fat chance in hell of hitting that strike price.)\n\nOf course, SHORT TERM put options!\n\nPerfect place to hide more turds. You can get them cheap cause of the greeks, very often less than ten cents for the contract! Yeah, they expire within days, but there is a solution to that: Let them. Buy more next week.\n\nLet's look at the irrational puts for the next couple of months option expiry and filter for *ten cent* put options with 200%+ Implied Volatility:\n\nOption Expiry |\t10 cent puts, high IV\n:--|:--\nMay 21 | *75,971*\nMay 28 | 2,717\nJun 4 | 1,036\nJun 11 | 306\nJun 18 | 1,948\nJun 25 | 36\nTotal | 82,014\n\nBoom! This Friday, nearly 76 thousand *worthless* puts expiring. Go look at the put option chain yourself [here](https://www.barchart.com/stocks/quotes/GME/options?expiration=2021-05-21-m&moneyness=allRows). Seriously, look at it. Does it make any sense? Dirt cheap puts with over 300% IV all the way up to a $80 strike. Who would buy an insane option like this? Anyone here think GME is going to drop by half in two days? Yeah, me either. \n\nThat's potentially another 8.2M shares short, bringing our calculated Short Interest up to 82.5M shares short or 172.8% Shorted of the float.\n\nHow can we confirm they are rolling short-term puts as part of married put trades? We should know Monday, cause the total open interest for irrational puts needs to be maintained in order for them to continue under the pretense of using this as a *legal* means of naked short selling. And this is a ton of open interest that's gotta get rolled. The OI for next week is a mere 2,717 contracts so if we see massive amounts of irrational puts Monday, there you go.\n\n**Could the Short Interest be even higher?**\n\nABSOLUTELY.\n\nThis calculation does NOT include short shares created directly using legal Market Maker provisions and have not yet been covered (T+21) by that Market Maker. This calculation does NOT include legal short shares created using the re-borrowing method. (See 005 below.) This calculation does not include shares shorted via the ETF's. (62 [ETF's](https://www.etf.com/stock/GME) hold 10.5M GME shares and that undoubtedly all been shorted.)\n\n**Conclusion**\n\nHedgies r fuk. They're digging an even deeper hole with every passing day. Every time I look at it there are more shorts. Naked shorts, everywhere. And I don't think we've found them all. There could be millions more hidden using 005 re-borrowing and millions more in rolling FTD's. I will not be surprised, if it turns out the real number was closer to 1,000% SI.\n\nI do believe they are limiting themselves to only *legal* mechanisms for shorting the stock. Otherwise we would *not* see all the evidence they have left behind, like open puts, FTD reports, 13F's, etc.  Which is probably a wise decision, when they get busted, none of them will actually go to jail.\n\nThe rate the SI in increasing is clearly unsustainable. The DTCC needs to margin call them ASAP. Every day they delay increases the cost by ~21 thousand shares, or about $210 million a day if the moass geometric mean is $10k. *cough* or higher. ;)\n\n**Sources**\n\n[Citadel 13F - Fintel](https://fintel.io/i13f/citadel-advisors-llc/2021-03-31-0)\n\n[Original Post on Married Puts](https://www.reddit.com/r/GME/comments/mgj0j1/the_naked_shorting_scam_revealed_lending_of/)\n\n[DTC-005 Original Doc](https://zenodo.org/record/4718936/files/005%20-%20SEC%20SR-DTC-2021-005-2%20-%20submission%20of%20rule%20finding.pdf?download=1)\n\n[DTC-005 Analysis](https://www.reddit.com/r/GME/comments/mi8mo9/legal_interpretation_of_the_proposed_srdtc2021005/)\n\n[Share Borrowing Program](https://smithonstocks.com/part-7-illegal-naked-shorting-dtcc-continuous-net-settlement-and-stock-borrowing-programs-have-loopholes-that-facilitate-illegal-naked-shorting/)\n\n[Barchart Options](https://www.barchart.com/stocks/quotes/GME/options?expiration=2021-05-21-m&moneyness=allRows)\n\n[Stonk Tracker](https://gme.crazyawesomecompany.com)\n\n**Required** \n\n🚀🚀🚀",
    "title": "May 19th Update on the Married-Put Forensic Analysis",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/Superstonk/comments/ngp969/may_19th_update_on_the_marriedput_forensic/"
}