{
    "author": "gmorgan99",
    "created_utc": 1621459680.0,
    "distinguished": null,
    "edited": 1621489153.0,
    "id": "nghov2",
    "text_only": true,
    "flair_id": "7b24752e-85f9-11eb-b3c8-0e861167b641",
    "flair_text": "DD 👨‍🔬",
    "name": "t3_nghov2",
    "num_comments": 563,
    "permalink": "/r/Superstonk/comments/nghov2/the_final_nail_for_citadel_and_youre_holding_the/",
    "score": 6673,
    "selftext": "This is a summary of what we have discovered:\n\n🍌\n\nCitadel adds a new branch to hide certain holdings (Ashler)\n\nObtains a large portion of Freddie Mac (percent not known)\n\nSome insane shit goes down in January with their books\n\nMajor drama and defaults happen, all connected to Citadel\n\nNew rules are passed by the govt in record time because Citadel is way too connected to the housing market/ commercial properties\n\nMay 10 - We get the \"wind-down plan\"\n\nMembers from Freddie Mac bail the same day\n\nMay 11 = Freddie Mac (listed under Ashler) filings released\n\n**AND NOW IT’S GETTING UGLLLY!!!  (stay with us here.. its deep, and connected globally🌎🌍🌏)**\n\nReferences\n\n2020 ADV Form – Citadel Advisors LLC\n\n[148826.pdf (sec.gov)](https://reports.adviserinfo.sec.gov/reports/ADV/148826/PDF/148826.pdf)\n\n2015 ADV Form – Citadel Advisors LLC (for comparison)\n\n[158862.pdf (sec.gov)](https://reports.adviserinfo.sec.gov/reports/ADV/158862/PDF/158862.pdf)\n\nFreddie Mac May 11 Report\n\n[FEDERAL HOME LOAN MORTGAGE CORP - ABS-15G/A - - FILE 18 OF 18 - May 11, 2021 (fintel.io)](https://fintel.io/doc/sec-federal-home-loan-mortgage-corp-1026214-abs15ga-2021-may-11-18758-401)\n\nAshler Capital\n\n[Ashler Capital Llc - Portfolio Holdings (13F, 13G) (fintel.io)](https://fintel.io/i/ashler-capital)\n\n[https://www.citadel.com/investment-strategies/ashler-capital/](https://www.citadel.com/investment-strategies/ashler-capital/)\n\nMadison\n\n[https://www.mdcp.com](https://www.mdcp.com/)\n\nGME Timeline\n\n[https://gmetimeline.com/](https://gmetimeline.com/)\n\nFrom Citadel Advisor LLC’s recent ADV Filing:\n\nCITADEL ADVISORS LLC\n\nComplete this form truthfully. False statements or omissions may result in denial of your application, revocation of your registration, or criminal prosecution. \n\nQUESTION:\n\nWhat is the total number of offices, other than your principal office and place of business, at which you conduct investment advisory business as of the end of your most recently completed fiscal year?\n\nANSWER: 19\n\nCITADEL ADVISORS LLC (CRD# 148826/SEC#: 801-70860)\n\n**Alternate Names: ASHLER CAPITAL LLC (RELYING ADVISER),** CITADEL ADVISORS II LLC (RELYING ADVISER),CITADEL ADVISORS LLC,CITADEL ASIA LIMITED (F/K/A CITADEL (HONG KONG) LIMITED) (RELYING ADVISER),CITADEL EUROPE LLP (RELYING ADVISER),CITADEL HOLDINGS I LP (RELYING ADVISER),CITADEL INVESTMENT CONSULTING (SHENZHEN) COMPANY LIMITED (RELYING ADVISER),CITADEL STRUCTURED FINANCE ADVISORY LLC (RELYING ADVISER)\n\nCitadel’s US State Jurisdictions (States where they have legal obligations)\n\nCalifornia  - 1/15/2021\n\nConnecticut – 1/15/2021\n\nIllinois – 1/15/2021\n\nMinnesota – 12/31/2020\n\nOhio – 3/31/2021\n\nTexas – 1/15/2021\n\nA few stats on Citadel Advisors LLC per their 2020 ADV Form filing with the SEC:\n\nYear-End: December\n\nCorporate Jurisdiction – Delaware\n\nStates with Jurisdiction – CA, CT, IL, MN, OH, TX\n\n2375 total employees\n\n1112 perform investment advisory functions\n\n56 registered representatives of broker- dealer\n\n41% of clients are NON-US persons\n\n17 pooled investment vehicles totalingL $244,269,595,218\n\n&#x200B;\n\nNOW;🐳\n\nHere’s a complete breakdown of Citadel Advisors 2020 ADV Form– including each of their 22 Hedgefunds – the Partners, Bankers, Auditors, Bookkeepers, Oversees Actors.  What a picture it paints. (an interesting note is main books are kept china)\n\n[https://drive.google.com/file/d/1rKHitLtuXgjEkuzEefa7ViFVvAjEpci1/view?usp=sharing](https://drive.google.com/file/d/1rKHitLtuXgjEkuzEefa7ViFVvAjEpci1/view?usp=sharing)\n\nList of Banks and Institutions affiliated as custodians with Citadel Advisors LLC\n\n[https://drive.google.com/file/d/1MI3IOFjivmmts7s1CA598PBidrb818rz/view?usp=sharing](https://drive.google.com/file/d/1MI3IOFjivmmts7s1CA598PBidrb818rz/view?usp=sharing)\n\nThis shows all the alternate names for Citadel. Everything under Freddie Mac is listed under Ashler.\n\n[https://adviserinfo.sec.gov/firm/summary/148826](https://adviserinfo.sec.gov/firm/summary/148826)\n\nOn March 10th, 2021, the SR-NSCC-2021-003 Rule change request was filed. This was to require more regular position confirmations and clarity.\n\n On March 24th, the DTCC officially eliminated month-end reporting and changed this to daily.\n\nBy April 6th, DTCC-2021-005 went into effect, which prevented shares from being used as collateral within the market, multiple times. Tightening up these loopholes makes it harder for naked shorting to have its place in the market. \n\nOn April 16th, the DTC-2021-006 Rule change was requested, preventing more shares of a company to be traded than exist, which is still in review.\n\nOn top of all these laws and regulations rolling out, GameStop also has a proxy voting for the shareholder meeting currently taking place. It is expected that GameStop will receive more votes than shares accounted for, showing over selling within the market. These voters can only vote if you own shares in the company, and a number is provided by brokers to individuals. See Wes’ AMA if you need to know more on this topic.\n\n**Every name on a 257-page ADV doc that is affiliated with Citadel Advisors LLC has made the news lately showing heavy losses, extreme stress, or is doing weird sh\\*t (BofA/ JP Morgan).   That same document shows 19 umbrella companies connected to Citadel. They are worldwide and the implosion proves to be nasty AF.  Blackrock has been buying shares (not calls) like crazy. The same shares that Citadel has heavy shorts and puts in. Blackrock has been buying up housing. Blackrock has been buying shares in everything Citadel is short on. Citadel bought a crapload of bank assets on 08 before everything exploded.**\n\n[https://docoh.com/filing/1456739/0001806691-20-000010/DA](https://docoh.com/filing/1456739/0001806691-20-000010/DA)\n\nSection 5 Bottom right of the page shows them all. 7.7 billion dollars worth.\n\nThese are all sales. Everybody that's buying them is getting f\\*cked but it shows how bad they're looking for money by selling off this much in assets.\n\nAll purchased 2008-01-01\n\n[https://www.marketwatch.com/story/the-trump-administration-may-privatize-fannie-mae-and-freddie-mac-and-it-could-disrupt-the-nations-housing-finance-system-11606208076](https://www.marketwatch.com/story/the-trump-administration-may-privatize-fannie-mae-and-freddie-mac-and-it-could-disrupt-the-nations-housing-finance-system-11606208076)\n\nMadison Dearborn and Ashler Capital have the same website images. Yes, you read that right! Compare the images…..both are under Citadel, which also has the same images on their site.\n\n[https://www.citadel.com/investment-strategies/ashler-capital/](https://www.citadel.com/investment-strategies/ashler-capital/)\n\n[https://www.mdcp.com](https://www.mdcp.com/)\n\nA 41% increase before they blew up and were liquidated.\n\n[https://www.google.com/search?client=firefox-b-d&q=NUVEEN+FUND+LIQUIDATED](https://www.google.com/search?client=firefox-b-d&q=NUVEEN+FUND+LIQUIDATED)\n\n[https://fintel.io/so/us/ino/nuveen-asset-management-llc](https://fintel.io/so/us/ino/nuveen-asset-management-llc)\n\n**So... Madison Dearborn, Ashler, and Citadel (and others) are all essentially the same company, or at least connected through bank accounts.   Madison is buying up assets after Kenny's group of shorters f\\*cked those companies into the ground.   We now know that this is 2008 2.0 but this time, with commercial properties.  Ashler = Freddie Mac.  BofA is now connected to Citadel after permanently closing a ton of branches.**\n\n005 rule shows up and Bitcoin tanks. ([coinmarketcap.com](http://coinmarketcap.com/))\n\n[https://mf.freddiemac.com/about/our-leaders.html#koontzModal](https://mf.freddiemac.com/about/our-leaders.html#koontzModal)\n\nTLDR: Citadel go DUURRRR. GME go BRRRR.For more please, It is strongly recommended that you continue to do research, as this information is so broad to try and cover, and understand. Knowledge and transparency is highly encouraged🦍🦍🦍🦍❤️🍌🚀\n\nAlso, the support of chat on stream and background help was extremely helpful. Thank you everyone who contributed. Hours of work were spent digging into this information with several brains. Especially that spreadsheet which is available for view. Thanks you, and cheers🍌\n\nAuthors: u/Broad_Grapefruit u/Bloodhound1144 u/gmorgan99\n\nedit 1: please no stupid questions, this is a lot.. also, if the sheet links are not allowing you access, thats being worked on right now. Its simply the 257 page paper broken down into 4 sheets.\n\nedit 2: links should be guud :)\n\nEdit 3: thank you for the luv n support. For some reason this cannot get posted into gme sub... a bit weird, and VERY sus \n\nEdit4: 005 did go into effect immediately but was removed for formatting. This is expected to go back into place and be once again, effective immediately",
    "title": "The final nail for Citadel – And you’re holding the HAMMER!!! 🚀",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/Superstonk/comments/nghov2/the_final_nail_for_citadel_and_youre_holding_the/"
}