{
    "author": "IlluminatiKev",
    "created_utc": 1627482559.0,
    "distinguished": null,
    "edited": 1627493669.0,
    "id": "otb1by",
    "text_only": true,
    "flair_text": "Opinion ✌",
    "name": "t3_otb1by",
    "num_comments": 157,
    "permalink": "/r/GMEJungle/comments/otb1by/price_drop_on_800k_volume_in_the_first_half_hour/",
    "score": 1772,
    "selftext": "Looks like the good news wombo combo of **SR-NSCC-2021-011 + GME entering the S&P Mid-Cap 400** has really scared the living shit out of the hedgies today.\n\n&#x200B;\n\nWe're all accustomed now to good news = price drop, BUT I think it's important that we think of the price drops from a psychological perspective:\n\n&#x200B;\n\nIf we are floating sideways with absolutely nothing volume wise, as we have been, then that shows psychologically the hedgies feel it's under control at that moment. **But when they drop the price, we know there is something going on that is scaring them.**\n\n&#x200B;\n\nIf you missed [my comment](https://www.reddit.com/r/Superstonk/comments/osqksh/rule_alert_nscc_proposed_rule_change_filing_to/h6qj8wg?utm_source=share&utm_medium=web2x&context=3) last night on the post about *SR-NSCC-2021-011* from u/dismal-jellyfish or Charlies post, here is a TLDR to explain why hedgies are more fuk:\n\n&#x200B;\n\n>*SR-NSCC-2021-011, for all members of the ID Net settlement system (setup to expedite large institutional block order trade settlement), removes all institutional block trades that are completed off-exchange from any collateral calculations for each respective firm. This means that* ***previously***\\*, if a firm (banks/funds) is massively short on a stock that is squeezing and thus putting the firm/DTC/NSCC at risk, the firm could simply run their large, off-exchange block trades through the ID Net system and thus the DTC's CNS system, and the value of those institutional trades can be used to offset the unrealized losses from any short position.\\* ***NOW***\\*, the NSCC is removing that ability for firms to pump their collateral calculations by including these institutional trades in the calculations,\\* ***meaning this is pretty much identical to when they removed krypt0 & junk bonds from being used for collateral. This means that the margin call number for each SHF likely just became even lower.***\n\n&#x200B;\n\n(note: this rule change was submitted to the SEC, and will be implmented no more than **10 days** after SEC approval)\n\n&#x200B;\n\nOk so with that TLDR in mind, hedgies are more fuk. But wait, what's that I hear.....is this.....\n\n&#x200B;\n\n[Good News? Getcha life jackets ready](https://preview.redd.it/xpp8e3nkryd71.png?width=906&format=png&auto=webp&s=582fe6e4b66ad16433b0341e56d1994c84ec7a3a)\n\n&#x200B;\n\nI saw some posts this morning about how there is normally ALWAYS significant buying pressure the morning after a company announces it is joining the S&P Mid-Cap 400, so of course I expected this big price drop.\n\n&#x200B;\n\nBut here's the deal: **this price drop is even more significant because they don't have the same fire power anymore. Volume has been dryer than your grandma & new rules/rule changes are coming weekly to plug the holds the SHFs are exploiting. They know now that this wombo combo of S&P 400 news +** ***SR-NSCC-2021-011*** **might be the KO they've been trying to buy one more day to avoid. The ONE thing they've been able to control lately is buying pressure, because more apes are already in & HOLDing, but they won't be able to manipulate buying pressure so easily any longer with this news, and soon they will need a lot more collateral to remain solvent. Thus, they have no choice but to try buying one more day and shorting GME as much a possible in the near future before SR-NSCC-2021-011 comes into play & buy pressure starts to increase.**\n\n&#x200B;\n\nStay strapped in fam, the ride will begin shortly.\n\n&#x200B;\n\n👁 Kev\n\n&#x200B;\n\n*Obligatory: Yes I am in the  Illuminati, but no I am not a financial advisor and this is not  financial advice. Do your own research, due diligence, and make your own  conclusions about all stocks.*\n\n&#x200B;\n\nedit: CANNOT WAIT to see the buy to sell ratio at the end of the day 😂 send your predictions\n\n&#x200B;\n\nedit 2: As of 10:30a EST, Fidelity is reporting a 7:1 buy-to-sell ratio for GME (thanks for u/Famous_Variety [post here](https://www.reddit.com/r/Superstonk/comments/otaxoc/look_at_that_ratio_fuck_you_hedgies/))",
    "title": "Price Drop on 800k volume in the first half hour? HEDGIES R ACTUALLY SHITTING THEMSELVES",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/GMEJungle/comments/otb1by/price_drop_on_800k_volume_in_the_first_half_hour/"
}