{
    "author": "WillyTheKid007",
    "created_utc": 1627283261.0,
    "distinguished": null,
    "edited": 1627286401.0,
    "id": "ortkgu",
    "text_only": true,
    "flair_text": "🐵 Discussion 💬",
    "name": "t3_ortkgu",
    "num_comments": 182,
    "permalink": "/r/GME/comments/ortkgu/the_fed_just_went_full_retard_to_protect_itself/",
    "score": 1601,
    "selftext": "As I am writing this at 1250 AM on a Sunday/early Monday morning, [https://www.earthcam.com/usa/illinois/chicago/field/?cam=fieldmuseum](https://www.earthcam.com/usa/illinois/chicago/field/?cam=fieldmuseum)\n\nshows Citadel HQ nearly LIT UP LIKE A CHRISTMAS TREE! You guys done fucked up, didn’t you?\n\nThis relates back to my other post: [https://www.reddit.com/r/GME/comments/oqkzwl/nscc2021010\\_a\\_little\\_too\\_little\\_a\\_little\\_too\\_late/h6jd48h/?context=3](https://www.reddit.com/r/GME/comments/oqkzwl/nscc2021010_a_little_too_little_a_little_too_late/h6jd48h/?context=3)\n\nTo begin with, NSCC-2021-010 is the Fed’s nearly 400 page attempt to control an ELE (Extinction Level Event) for the American Financial System. Make no mistake, this IS an ELE for their monetary system. The MOASS is so big and powerful it has the potential to wipe out what is there and reset the whole system. And the Powers That Be (PTB) are *terrified of its power.* Let’s also get this out of the way: we did not design this. We are no villain in a movie. This ENTIRE SITUATION HAS BEEN BUILDING SINCE THE DESTRUCTION IN 2008. THE AMERICAN FINANCIAL SYSTEM ONLY LEARNED THERE WAS GREATER MONEY TO BE MADE OFF THE UNKNOWING PUBLIC. ANY MISTAKES MADE THE GOVERNMENT WOULD FORCE THE PUBLIC TAX PAYERS TO COVER. *IT GAVE THE BANKS AND SHF’S A CARTE BLANCHE, AN INFINITE MONEY GLITCH TO LOAD UP ON TRILLIONS OF DOLLARS FOR THEMSELVES.*  But something went wrong. A single ape looked and noticed the glitch that was draining the American people had become complacent. Instead of playing it safe and doing what it always did, the glitch took a dangerous route… right by Ape territory. The one ape pointed it out, then two noticed, then 4, then 100, then 1 million, and more! And it got waylaid by the apes! Ape didn’t fight ape. They divided and shared the glitch. Suddenly, millions of apes possessed this very glitch that served the greedy, the dishonest, and they have created an ELE of their own making: the MOASS.\n\nThe Fed, the SHF’s, the banks all realized the apes had suddenly gained their power, their knowledge, and it is causing liquid shits on the hour. Every hour.\n\nThis is the Feds and gang going *all out, balls-to-the-wall, FULL RETARD!* The interesting thing is, you never go Full Retard. You never show all your moves in a fight… your opponent will see how desperate you are and can counter and win if possible. The Fed, going FULL RETARD, showed us their last moves. There is a chance they have little left. So they are left trying to control the *full fury of nature.* *They are trying to control the earthquake that will create a monstrous tidal wave.* *They are trying to control the meteor shower that foreshadows the hulking monster dinosaur-killing asteroid about to strike their financial system.* *They are trying to control the impossible.*\n\n*They are going FULL RETARD.*\n\nIt is also nearly 400 pages long, very thorough, very confusing as it cross-references itself, defines so many old and new terms and definitions.  Expert Apes are still pouring over the encyclopedia 'No the Fed will control the ELE/MOASS' book.  It’s like they are trying to *litigate an ELE, The MOASS, to death!*\n\nSo why?\n\nUnless you have nothing left to lose and must win at all costs! Without admitting it, they are admitting they created this stupidly dumb situation that involves their insanely overleveraged financial system that took greed and fraud to a whole new level. Hell, they even mentioned they are trying to protect the fabrication of synthetic shares ie. *Naked Shorts* that were very illegal but allowed to be used in its own system. In Ape-speak: ‘Oopsies guys. Our bad…’\n\nIt is very telling that they marched out this encyclopedia-novel-thick ruling to protect themselves. It is very telling because there is no cause for going FULL RETARD unless you are on the brink of disaster. But now with the US Gov doing everything in its power and the SHF’s doing everything in *their power to save themselves,* and MOASS in danger of wiping them ALL OUT, just who is it they are trying to protect? Who are the key players?\n\n[https://hannenabintuherland.com/usa/the-federal-reserve-cartel-the-eight-families-who-own-usa-dean-henderson-herlandreport/](https://hannenabintuherland.com/usa/the-federal-reserve-cartel-the-eight-families-who-own-usa-dean-henderson-herlandreport/)\n\nRight here it mentions ‘*My queries to bank regulatory agencies regarding stock ownership in the top 25 US bank holding companies were given Freedom of Information Act status, before being denied on “national security” grounds.’* Denied. They revealed their identities, then someone in the government must have said ‘Ohhh ssSSSSHHHEEEIIIITTT!!!’ and classified it. Too late dude. You outted them. **The very key players we are fighting are the same that rule this entire dark and corrupt system: They are 8 well-known Ultra-Wealthy families who (did I use that right?) own the Federal Reserve: They are the Goldman Sachs, Rockefellers, Lehmans and Kuhn Loebs of New York; the Rothschilds of Paris and London; the Warburgs of Hamburg; the Lazards of Paris; and the Israel Moses Seifs of Rome.** **Many of the bank’s stockholders reside in Europe.**\n\nDamn if this does not sound like some John Wick High Table shit…\n\nEven further, ‘*Their monopoly over the global economy does not end at the edge of the oil patch. According to company 10K filings to the SEC, the* ***Four Horsemen of Banking are among the top ten stock holders of virtually every Fortune 500 corporation.’ The Four Horsemen of Banking (Bank of America, JP Morgan Chase, Citigroup and Wells Fargo) own the Four Horsemen of Oil (Exxon Mobil, Royal Dutch/Shell, BP and Chevron Texaco); in tandem with Deutsche Bank, BNP, Barclays and other European old money behemoths.***\n\n***Companies under Rockefeller control include Exxon Mobil, Chevron Texaco, BP Amoco, Marathon Oil, Freeport McMoran, Quaker Oats, ASARCO, United, Delta, Northwest, ITT, International Harvester, Xerox, Boeing, Westinghouse, Hewlett-Packard, Honeywell, International Paper, Pfizer, Motorola, Monsanto, Union Carbide and General Foods.***\n\nYeah, Elon. Might wanna watch your back. Tesla has most key advances over fossil fuel cars, except one: they cannot charge to full within 5 mins. ICE cars can. That is still the make it or break it deal for most people. But Elon’s company is flying, destroying all shorting efforts to stop it, and in 2 short years, the tech in his cars may render all ICE cars obsolete. I mean, there are videos popping up of normal Tesla’s being *used as boats, the rear wheels propelling them through water, the car floating, the front wheels actually providing some steering.* *Steering around LOTS of ICE cars destroyed by water.* *And Elon smugly tweeted they can go through flood waters because his cars do float.* The moment Elon’s tech proves Old Money obsolete without a doubt is the day he needs to be careful…\n\n*Danger Will Robinson.* *Danger…*\n\nThe MOASS is ‘inevitable’. There are wayyyyyyyyyyyyyyyyyyyyy too many ‘mechanisms’ just *suddenly activating* after being dormant for decades to protect the financial system. This is not *ah, just in case my dudes if something goes wrong…* This is DEFCON upgrade in war alert levels. So it goes without saying, once the MOASS happens and you are brimming in wealth 1) LAWYER UP WITH AN EXPENSIVE BUT BEST FIRM IN THE COUNTRY AND OR 2) DO NOT REVEAL YOUR IDENTITY OR WHERE THE MONEY CAME FROM. COOL DOWN. DISAPPEAR. THIS INFORMATION CAN NOW GET. YOU. KILLED!!! I SHIT YOU NOT!!! SPEND IT WISELY, SPEND IT CAREFULLY WITHOUT BEING TRACED OR 3) INSTRUCT THE LAWYER FIRM TO CREATE AN IDENTITY FOR YOU TO SPEND AS A HIGH ROLLER AND KEEP YOUR REAL IDENTITY A SECRET.\n\nThese ultra-rich families will be hit hard in their bank accounts. Do not worry, they will survive and still be wealthy, but they will lose a big chunk of their wealth. And that’s the thing, very wealthy and influential families like them *do not like losing a penny!* *Even if it was 100% legally lost, they may resort to nefarious or even lethal means to regain what they lost.*\n\n*Edit 1: Sorry to confuse anyone.  Summery: MOASS is even closer.  We know that because Feds pulling out all the stops now to try and 'control it'.  Desperate.  MOASS will happen.  HODL!!!!  Then, be careful...*\n\n*Edit 2: This all just makes me want it more.  They are trying to 'dictate' how the MOASS will go.  All nearly 400 pages of it.  No.  The banks, SHF's, and Fed made a bad, bottom-of-humanity greedy mistake.  I am capitalizing on it.There are some things you cannot control.  I am not trying to incite any rebellion but the MOASS will happen.  Stop trying to dictate terms to an event that will improve so many lives.*",
    "title": "The Fed Just Went FULL RETARD to protect itself! YOU NEVER GO FULL RETARD! But they went FULL RETARD and dropped a nearly 400 page RETARD BOOK TO LITIGATE THIS TO DEATH…so be careful",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/GME/comments/ortkgu/the_fed_just_went_full_retard_to_protect_itself/"
}